[
    {
        "title": "Pumpkin Pie I",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups pumpkin puree ADVERTISEMENT",
            "1 1/2 cups evaporated milk ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nAdd the sugar gradually to the pumpkin puree. Beat well an stir in the flour, salt and spices. Stir in the corn syrup and beat well. Stir in the slightly beaten egg, then slowly add the evaporated milk, mixing until well blended. Pour the batter into the unbaked pie shell.\nBake at 450 degrees F (230 degrees C) for 10 minutes then reduce the oven temperature to 325 degrees F (165 degrees F) and continue baking pie for an additional 30 minutes or until a knife inserted into the mixture comes out clean.\n",
        "picture_link": "EbVR3lftwDSDeE1MRSGdi1evygKF/D6"
    },
    {
        "title": "Classic Tuna Noodle Casserole",
        "ingredients": [
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Celery Soup or Campbell's® Condensed 98% Fat Free Cream of Celery Soup ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup cooked peas ADVERTISEMENT",
            "2 tablespoons chopped pimentos (optional) ADVERTISEMENT",
            "2 (6 ounce) cans tuna, drained and flaked ADVERTISEMENT",
            "2 cups hot cooked medium egg noodles ADVERTISEMENT",
            "2 tablespoons dry bread crumbs ADVERTISEMENT",
            "1 tablespoon butter or margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F.\nMix soup, milk, peas, pimiento, tuna and noodles in 1 1/2-quart baking dish.\nBake for 20 minutes.\nMix bread crumbs with butter. Sprinkle on top. Bake 5 minutes or until hot.\n",
        "picture_link": "tsNaQ0lpghcFMTUvq..0IbLkQAI7.zC"
    },
    {
        "title": "Mini Pumpkin Muffins with Orange Drizzle",
        "ingredients": [
            "1 (15 ounce) can 100% pure pumpkin ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 large eggs, lightly beaten ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Orange Drizzle: ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon finely grated orange zest ADVERTISEMENT",
            "4 teaspoons orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Adjust oven rack to center position and heat oven to 425 degrees. Spray 36 mini-muffin cups with vegetable cooking spray.\nBring pumpkin, ginger, cinnamon and cloves to a simmer in a medium saucepan until puree thickens enough to start sticking to pan bottom, 6 to 8 minutes. Turn hot puree into a bowl. Whisk in brown sugar and oil, then slowly beat in eggs.\nMeanwhile, whisk the flour, baking powder, baking soda and salt in a medium bowl; whisk into pumpkin mixture until just combined.\nDivide batter among the muffin cups and bake until golden and cooked through, about 10 minutes. Let stand a few minutes, then transfer mini-muffins to a wire rack to cool. Mix the drizzle ingredients together and drizzle over warm muffins.\n",
        "picture_link": "aHZgjSLDJqNWWy.pROzqwQWODUoHeeK"
    },
    {
        "title": "Pork Brine",
        "ingredients": [
            "2 cups apple cider vinegar ADVERTISEMENT",
            "1 cup salt ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 tablespoon whole black peppercorns ADVERTISEMENT",
            "1 tablespoon mustard powder ADVERTISEMENT",
            "1 tray ice cubes ADVERTISEMENT",
            "2 pounds boneless pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure the vinegar into a saucepan and bring to a boil. In a sealable plastic container, combine the salt, brown sugar, peppercorns, and mustard powder.\nPour the hot vinegar into the container, and stir to dissolve. Let stand for about 10 minutes to develop the flavors, then add the ice cubes. Cover and shake, or stir until melted. Remove the lid and add pork chops to the brine. Refrigerate for 2 hours.\nCook pork chops as desired. Pan fry or grill for about 15 minutes over medium-high heat, turning once. They will be juicy and moist.\n",
        "picture_link": "x6a1XufT.6hg9c3ke8etVZH.aXMo3HS"
    },
    {
        "title": "BBQ Pie",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/4 cup diced onion ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 (15 ounce) cans baked beans with pork ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "1 cup biscuit baking mix ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon barbecue sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nCrumble the ground beef into a large skillet over medium heat. When it is starting to brown, stir in the onion and season with pepper. Continue to cook and stir until beef is browned and the onion is tender.\nDrain off the grease from the beef, and stir in the baked beans, Worcestershire sauce and 1 cup of barbeque sauce. Transfer to a large casserole dish. In a separate bowl, mix together the baking mix, milk and egg. Pour this mixture evenly over the beef and beans in the dish.\nBake for 40 to 45 minutes in the preheated oven, until the biscuit toping is golden brown. Spread a small amount of barbeque sauce over the top and sprinkle with Cheddar cheese while hot from the oven.\n",
        "picture_link": "k9ZgIqURnErA5wold7LhzLfi30MNd92"
    },
    {
        "title": "Jim's Salmon Patties",
        "ingredients": [
            "1 (14.75 ounce) can salmon, drained and flaked ADVERTISEMENT",
            "1 (7.5 ounce) can salmon, drained and flaked ADVERTISEMENT",
            "1 (4 ounce) packet saltine crackers, crushed ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 teaspoons fresh lemon juice ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "2 tablespoons vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix both amounts of salmon, crushed crackers, eggs, mayonnaise, Worcestershire sauce, lemon juice, red pepper flakes, and dry mustard together in a bowl. Chill in refrigerator to allow flavors to combine, 30 minutes. Form mixture into 6 patties.\nHeat vegetable oil in a skillet over medium heat; fry the salmon patties until golden brown, about 4 minutes per side.\n",
        "picture_link": "4bXPbc17vgn2bGib0iV6BxKEWYGig9a"
    },
    {
        "title": "Deluxe Corned Beef Hash",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "5 large Yukon Gold potatoes, peeled and cut into 1/4-inch cubes ADVERTISEMENT",
            "1 large carrot, coarsely shredded ADVERTISEMENT",
            "2 pounds cooked corned beef, cubed ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon dried thyme leaves ADVERTISEMENT",
            "salt to taste (optional) ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter with the olive oil in a large skillet over medium heat, and cook the onion just until it begins to brown, about 8 minutes; stir in the potatoes and carrot, and cook until tender, about 15 minutes, stirring occasionally. Stir in the cubed corned beef, parsley, thyme, salt, and pepper. Let the mixture cook until hash is crisp and browned, stirring often, 10 to 15 more minutes.\n",
        "picture_link": "TZA1nhrGUP6UwUnTZFrrUbP3c1BiUYG"
    },
    {
        "title": "Strawberry Cake Filling",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "2 1/2 cups frozen strawberries, thawed and cut into bite size pieces ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk water and cornstarch together in a large saucepan.\nStir strawberries and sugar into the water.\nCook strawberry mixture over medium heat until thick, about 10 minutes.\nAllow to cool completely before use.\n",
        "picture_link": "Vb/pFj9JjfeJQIv6LxbWZ82cRKpYI4W"
    },
    {
        "title": "Crackers a la Yvette",
        "ingredients": [
            "1 (16 ounce) package unsalted saltine crackers ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "2 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "1 (1 ounce) package dry ranch salad dressing mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Unwrap the crackers, and place them all into a 1 gallon size glass jar with a tight fitting lid. In a small bowl, stir together the canola oil, red pepper flakes, and ranch dressing mix. Pour over the crackers in the jar.\nClose the lid tightly, and roll the jar every 5 minutes for about 1 hour to coat with the spice mixture. The longer these sit, the better they get!\n",
        "picture_link": "4htff3SeaguhIdZAb4awRmCij/5GXHm"
    },
    {
        "title": "Pork Chops with Garden Rice",
        "ingredients": [
            "6 (1 inch thick) pork chops ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (14 ounce) can vegetable broth ADVERTISEMENT",
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "1 (14.5 ounce) can Italian-style diced tomatoes, drained ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped orange bell pepper ADVERTISEMENT",
            "1/3 cup chopped green onions ADVERTISEMENT",
            "1/2 cup thinly sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSeason pork chops with salt, pepper, and paprika. Heat the oil in a skillet over medium heat. Saute the garlic about 1 minute, then brown pork chops about 2 minutes on each side.\nIn a pot, bring the vegetable broth and rice to a boil. Mix in the Italian-style diced tomatoes, green bell pepper, orange bell pepper, green onions, and mushrooms, and cook about 5 minutes, until heated through. Transfer to a 9x13 inch baking dish. Arrange the pork chops over the rice and vegetables.\nCover, and bake 1 hour in the preheated oven, or until rice and vegetables are tender and pork has reached an internal temperature of 145 degrees F (63 degrees C).\n",
        "picture_link": "TW59/FJYhaO3qXVF28muca2XoGhTr1O"
    },
    {
        "title": "Snow Cone Syrup II",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (0.13 ounce) package unsweetened, fruit-flavored soft drink mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, stir together the sugar and water. Bring to a boil, and boil for about 1 minute. Remove from heat, and stir in the drink mix. Allow to cool, and store in a container for pouring. Pour over shaved ice to flavor.\n",
        "picture_link": "7spM12BlnXiOAAFUgZbTamT82MIr.f6"
    },
    {
        "title": "Pinwheel Italian Calzones",
        "ingredients": [
            "1/2 cup ricotta cheese ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup chopped pepperoni ADVERTISEMENT",
            "1/4 cup finely chopped fresh mushrooms ADVERTISEMENT",
            "1/4 cup finely chopped green bell pepper ADVERTISEMENT",
            "2 tablespoons finely chopped onion ADVERTISEMENT",
            "1 (8 ounce) can refrigerated crescent roll dough ADVERTISEMENT",
            "1 (14 ounce) jar pizza sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the ricotta cheese, Italian seasoning, salt, Parmesan cheese, mozzarella cheese, pepperoni, mushrooms, green pepper and onion. Set aside.\nUnroll the crescent roll dough and separate into 4 rectangles. Press the remaining perforations together to seal. Spread the filling evenly onto the rectangles. Roll up the filling inside the dough starting at the short side. Slice each finished roll into four slices, and place cut side down onto a baking sheet.\nBake for 10 to 12 minutes in the preheated oven, until lightly browned. While the pinwheels are baking, warm the pizza sauce. Serve the pinwheels with pizza sauce in small cups for dipping.\n",
        "picture_link": "aQfI8h3h/kJFdr3EZbEwlS8DjDwP3u6"
    },
    {
        "title": "Zucchini and Eggs",
        "ingredients": [
            "4 eggs, lightly beaten ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 zucchini, sliced 1/8- to 1/4-inch thick ADVERTISEMENT",
            "garlic powder, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the eggs and Parmesan cheese together in a bowl; set aside.\nHeat the olive oil in a large skillet over medium-high heat; cook the zucchini in the hot oil until softened and lightly browned, about 7 minutes. Season the zucchini with garlic powder, salt, and pepper. Reduce heat to medium; pour the egg mixture into the skillet. Cook, stirring gently, for about 3 minutes. Remove the skillet from the heat and cover. Keep covered off the heat until the eggs set, about 2 minutes more.\n",
        "picture_link": "xA0ViSnQusF28zknOpxMxxHggxLvNnK"
    },
    {
        "title": "Creamy Cinnamon Rice Pudding",
        "ingredients": [
            "3 quarts milk ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the milk, cinnamon, butter, and rice in a large pot. Bring to a boil, then reduce heat to low, and simmer for 30 minutes, or until rice is tender. Gradually stir in the sugar.\nIn a medium bowl, whisk together the heavy cream and eggs until smooth. Gradually whisk in about a cup of the hot milk mixture, or enough to raise the temperature to just above body temperature. Gradually stir the warmed egg mixture into the pot. This will keep you from having scrambled egg in your pudding!\nSimmer the pudding over low heat for about 10 minutes, stirring constantly until thickened. Pour into a baking dish or bowl, and allow to cool for 10 to 15 minutes before refrigerating. Refrigerate for at least 2 hours before serving.\n",
        "picture_link": "YzLpwkqFkZ3EP3Dz9C2ngufi1thoF0m"
    },
    {
        "title": "Pancho Villa Baked Tilapia",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 (4 ounce) fillets tilapia ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "4 tablespoons minced fresh cilantro ADVERTISEMENT",
            "1 lime, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat one side of 4 (8x10 inch) pieces of aluminum foil with olive oil.\nCenter each fillet on a foil square. Spoon a generous amount of diced tomatoes with juices over fish. Sprinkle with lime juice and cilantro. Position 2 slices of lime on top of each fillet. Close and seal foil packets, and place on a baking tray.\nBake in preheated oven for approximately 20 minutes, or until fish flakes easily with a fork.\n",
        "picture_link": "c4XnZRNoaevuV7N.KrLlETCFfPTG4TW"
    },
    {
        "title": "Peanut-Ginger Marinade",
        "ingredients": [
            "1/2 cup hot water ADVERTISEMENT",
            "1/2 cup creamy peanut butter ADVERTISEMENT",
            "1/4 cup chile paste ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons grated fresh ginger root ADVERTISEMENT",
            "1/4 teaspoon ground red pepper ADVERTISEMENT",
            "3 pounds skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, gradually stir hot water into peanut butter. Stir in chili paste, soy sauce, oil, vinegar, garlic, ginger and ground red pepper. Place chicken in marinade, and turn to coat evenly. Cover, and refrigerate overnight, turning occasionally.\nPreheat an outdoor grill for medium heat, and lightly oil grate. Thread chicken pieces onto skewers. Discard marinade.\nGrill chicken 8 to 10 minutes per side, or until no longer pink, and juices run clear.\n",
        "picture_link": "yJVE2LknCa577d45nGUZDbDwnkPM5yK"
    },
    {
        "title": "Asian Style Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/2 pound ground pork ADVERTISEMENT",
            "3 slices bread, broken up into small pieces ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "2 stalks celery, finely chopped ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "2 tablespoons hoisin sauce ADVERTISEMENT",
            "1/2 cup hoisin sauce ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the beef, pork, bread crumbs, eggs, onion, and celery. Season with 3 tablespoons soy sauce, ginger, and 2 tablespoons hoisin sauce. Pat mixture into a shallow 2 quart baking pan.\nBake in preheated oven for 40 minutes.\nDrain grease from pan. In a small bowl, mix 1/2 cup hoisin with 2 tablespoons ketchup. Spread over top of meatloaf. Continue baking for 20 minutes or so. Remove from oven, and let rest for 5 minutes.\n",
        "picture_link": "4yuikfQrGgjC90wf1oqC/qgGnNZXwaW"
    },
    {
        "title": "Apricot Muffins",
        "ingredients": [
            "1 cup chopped dried apricots ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease a 12 cup muffin pan, or line with paper muffin cups. Place apricots into a small bowl, and pour the boiling water over them. Let stand for 5 minutes.\nIn a medium bowl stir together the flour, sugar, baking soda and salt. In a separate bowl, whisk together the melted butter, oil, buttermilk and egg. Pour the wet ingredients into the dry ingredients, and stir until just blended. It is okay for the batter to have some lumps. Drain water from apricots, and mix them into the batter. Spoon into the prepared muffin cups.\nBake for 15 minutes in the preheated oven, or until the top springs back when lightly pressed. Cool in the pan over a wire rack.\n",
        "picture_link": "JM0.3HOScj5rGQ3eg.ZeRMFWLkCiPkG"
    },
    {
        "title": "Skillet Herbed Chicken with Mustard",
        "ingredients": [
            "3 tablespoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons dried tarragon ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 boneless, skinless chicken breast halves ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, blend Dijon mustard and honey. Mix in the tarragon, basil, thyme, salt, and pepper.\nHeat oil in a large skillet over medium heat. Place chicken in the skillet, and brush on both sides with the Dijon mustard mixture. Pour 1/4 cup wine around the chicken. Reduce heat, cover, and simmer about 10 minutes, until liquid is reduced.\nPour another 1/4 cup wine around the chicken, and continue to cook about 5 minutes, until chicken is no longer pink and juices run clear. Remove from heat, reserving remaining liquid.\nMix remaining wine into the skillet. Increase heat to medium, and scrape up browned bits. Cook and stir until liquid is reduced by about 1/3. Serve as a sauce over the chicken.\n",
        "picture_link": "o6EKDQUmGkbvm5xuly8jB9s.n3bu7/a"
    },
    {
        "title": "Cola Sauerkraut",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 medium onions, chopped ADVERTISEMENT",
            "2 (16 ounce) jars sauerkraut ADVERTISEMENT",
            "1 (12 fluid ounce) can cola-flavored carbonated beverage ADVERTISEMENT",
            "1/2 cup water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet or Dutch oven over medium heat. Saute onions in butter until translucent. Stir in the sauerkraut and cola.\nCover, reduce heat to low, and simmer for 1 hour, adding up to 1/2 cup of water if necessary to prevent sticking. Remove cover and increase heat to medium for at least 15 minutes, or until most of the juice cooks down, and the sauerkraut glistens.\n",
        "picture_link": "3TZRfEi/JaAc4gzzS6l24gbQXv0DjVC"
    },
    {
        "title": "Very Special Spaghetti Sauce",
        "ingredients": [
            "3/4 cup olive oil ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "3 pounds ground chuck ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups dry red wine ADVERTISEMENT",
            "2 cups tomato sauce ADVERTISEMENT",
            "4 large tomatoes, peeled and chopped ADVERTISEMENT",
            "2 (6 ounce) cans tomato paste ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 pound fresh mushrooms, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Saute garlic until golden brown. Stir in ground beef, onions and green pepper. Cook until beef is evenly brown, and onions are tender. Stir in flour until smooth. Stir in red wine, tomato sauce, chopped tomatoes, tomato paste, Worcestershire sauce and sugar. Season with salt, cayenne pepper, celery salt, oregano and basil. Simmer for 3 hours. Stir in mushrooms at the end of cooking period.\n",
        "picture_link": "/VMHjp.oIqQ08wlXOaT7krl2gg/bzeC"
    },
    {
        "title": "Savory Cinnamon Rolls",
        "ingredients": [
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "2 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 (9 ounce) package yellow cake mix ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine the yeast mixture with the cake mix, salt and vanilla; stir well to combine. Stir in the flour; beat well. Cover bowl and let rise in a warm place for 1 hour.\nDeflate dough and turn it out onto a well floured surface. Roll dough out into a rectangle and spread with butter. Sprinkle with cinnamon and sugar. Roll up dough and cut into 3/4 inch thick rolls. Place rolls in two lightly greased 9x13 inch baking pans. Cover and let rise until doubled, about 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake rolls in preheated oven for 15 to 20 minutes. While rolls are baking, prepare the frosting. In a medium bowl, stir together confectioners' sugar, 1/3 cup butter, vanilla and milk. Let rolls cool slightly then spread with frosting.\n",
        "picture_link": "jVR38StvVdWFiK4WmGR4NIgYC2ZrX8q"
    },
    {
        "title": "Sesame Broccoli Salad",
        "ingredients": [
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "1 1/2 pounds fresh broccoli, cut into bite size pieces ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Toast sesame seeds for 3 to 5 minutes, or until the seeds begin to turn golden brown. Set aside.\nBring a large pot of water to a boil. Cook broccoli in boiling water for 3 to 5 minutes, or until desired tenderness. Drain, and transfer to a large bowl.\nIn a small bowl, whisk together the vinegar, soy sauce, sesame oil, sugar, and sesame seeds. Pour over broccoli, and toss to coat.\n",
        "picture_link": "1T5jK0mnfvgL4RJR9vAviqt.jBFN0lK"
    },
    {
        "title": "Olive Oil Dip for Italian Bread",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "5 cloves garlic ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons Parmesan cheese ADVERTISEMENT",
            "1 tablespoon crushed dried oregano ADVERTISEMENT",
            "fresh ground black pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the olive oil onto a salad plate. Use a garlic press to press the garlic cloves onto five different spots on the plate. Drizzle the balsamic vinegar over the oil and garlic. Sprinkle with Parmesan cheese and oregano. Season with black pepper.\n",
        "picture_link": "bnF1qPQOYMQwvcp3zQg.WE8JBBSEOKq"
    },
    {
        "title": "Shrimp Alfredo Pasta",
        "ingredients": [
            "1 (16 ounce) jar Alfredo-style pasta sauce ADVERTISEMENT",
            "1 (16 ounce) package angel hair pasta ADVERTISEMENT",
            "2 pounds fresh shrimp, peeled and deveined ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "1/2 small green bell pepper, diced ADVERTISEMENT",
            "1/2 small red onion, finely chopped ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over low-temperature, heat the Alfredo sauce. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 minutes or until al dente; drain.\nBoil shrimp in a large pot of water until they turn orange. Then place in bowl with melted butter. Let shrimp marinate for 15 to 30 minutes; remove. In a large skillet over medium heat, saute the green pepper and onion in a small amount of oil.\nMix together the cooked pasta, shrimp, pepper-onion mixture and Alfredo sauce. Season with garlic powder and cumin.\n",
        "picture_link": "sbpSXlOxD2vN7R8PdbmLCofcdP3.1ju"
    },
    {
        "title": "Chewy Jumbo Chocolate Chip Cookies",
        "ingredients": [
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup cake flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups butter, softened ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Sift together the all-purpose flour, cake flour, baking powder and baking soda; set aside.\nIn a large bowl, cream together the butter, white sugar and brown sugar until smooth. Beat in the eggs and vanilla, until well blended. Gradually stir in the flour mixture. Stir in the chocolate chips by hand using a wooden spoon, stir in walnuts if desired. Drop cookies by rounded tablespoonfuls 2 inches apart onto ungreased cookie sheets.\nBake for 10 to 14 minutes in the preheated oven, until the edges are light brown. Let cookies cool on the baking sheet before removing to wire racks to cool completely.\n",
        "picture_link": "QTgg7FMKoclExAL4GPS3M07ehYnJySu"
    },
    {
        "title": "Authentic Thousand Island Dressing",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "1 quart mayonnaise ADVERTISEMENT",
            "3/4 cup sweet pickle relish ADVERTISEMENT",
            "1/2 cup chopped black olives ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.\nIn a medium bowl, whisk together the chopped eggs, Worcestershire sauce, sugar, vinegar, cloves, mayonnaise, relish, olives and red pepper until evenly blended. Chill and serve spooned over fresh greens. Store in the refrigerator.\n",
        "picture_link": "65V.QmM1dV9BGVu.LgInoVQxXS9ElSa"
    },
    {
        "title": "N'Awlins Stuffed Bell Peppers",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 small green bell pepper, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon Creole seasoning ADVERTISEMENT",
            "1 teaspoon file powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "3/4 pound cooked ham, finely chopped ADVERTISEMENT",
            "1 pound baby shrimp ADVERTISEMENT",
            "1 (16 ounce) package unseasoned dry bread stuffing mix ADVERTISEMENT",
            "6 large green bell peppers, halved and seeded ADVERTISEMENT",
            "1 cup plain bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nHeat oil in a large pot over low heat. Saute onion, celery and chopped green pepper for 5 minutes. Stir in garlic, and saute for 2 minutes. Season with parsley, Creole seasoning, file powder, salt and pepper.\nIncrease heat to medium high, and add ground beef. Cook until beef is evenly browned. Stir in ham, and cook for 5 minutes. Add shrimp, and cook for 2 minutes. Remove from heat, and stir in stuffing mix.\nStuff each bell pepper half, and lightly sprinkle with breadcrumbs. Place stuffed bell pepper halves in ungreased baking dish. Bake in preheated oven for 1 hour.\n",
        "picture_link": "THgon9FeNX0cWRybvIEbriiy79VLRGa"
    },
    {
        "title": "Cabbage Rolls III",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 pound ground sausage ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "3/4 cup uncooked white rice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 large head cabbage ADVERTISEMENT",
            "1 (32 ounce) jar sauerkraut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the ground beef, sausage, chopped onion, rice, water, and salt and pepper.\nBring a large pot of water a boil. Separate 12 to 15 large cabbage leaves from the head, and place in boiling water. Boil until soft, approximately 2 to 3 minutes. Remove from water, and set aside.\nInto the center of each leaf, place a small amount of the meat mixture. Fold in the sides, and roll up from the bottom. Secure with a toothpick.\nPlace a layer of sauerkraut in the bottom of a large pot. Arrange cabbage rolls in a single layer over the sauerkraut. Cover with remaining sauerkraut. Pour in enough water to cover the rolls. Bring to a boil, lower heat, and simmer for 90 minutes.\n",
        "picture_link": "m8vA7dMfe7e4Ux0hKSLeFDrT0Cbbhlu"
    },
    {
        "title": "Bow Tie Medley",
        "ingredients": [
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 zucchini, chopped ADVERTISEMENT",
            "1 yellow squash, chopped ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "1/2 red bell pepper, cut into strips ADVERTISEMENT",
            "5 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/4 cup fresh basil leaves ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 cup finely grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Saute onion, garlic, zucchini, yellow squash, mushrooms, bell pepper, and 1/2 the chopped tomatoes until tender. Season with basil, oregano, salt and pepper. Add pasta and 1/4 cup olive oil. Mix well, and heat through. Sprinkle top with Parmesan and remaining chopped tomatoes.\n",
        "picture_link": "hm8c3C1/kg3lEuyHiZqYTBuIAqEU6Ra"
    },
    {
        "title": "Three Animal Italian Meatballs",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "1 pound ground Italian sausage ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup Italian-style seasoned bread crumbs ADVERTISEMENT",
            "1/2 cup quick cooking oats ADVERTISEMENT",
            "2 tablespoons Italian-style seasoning ADVERTISEMENT",
            "1 cup vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine ground meat, onion, eggs, bread crumbs, oats, and seasoning in a large bowl. Shape into 2-inch diameter balls.\nHeat enough vegetable oil in a large saute pan to be 1/2 inch deep. Brown meatballs in hot oil for about 5 minutes. Transfer to a glass baking dish.\nBake in preheated oven for 25 minutes.\n",
        "picture_link": "M0WnF5z0d18ee9hnZ8WvGI/6NVAUOqq"
    },
    {
        "title": "Shrimp Tempura",
        "ingredients": [
            "1/2 cup rice wine ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 pound fresh shrimp, peeled and deveined ADVERTISEMENT",
            "2 quarts oil for deep frying ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup ice water ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon shortening ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix rice wine and salt. Place shrimp into the mixture. Cover and marinate in the refrigerator at least 20 minutes.\nHeat oil in deep-fryer or large wok to 375 degrees F (190 degrees C).\nIn a medium bowl, mix together all-purpose flour, ice water, cornstarch, egg yolk, salt, white sugar, shortening and baking powder.\nOne at a time, dip shrimp into the flour mixture to coat. Carefully place a few shrimp at a time in the hot oil. Deep fry until golden brown on all sides, about 1 1/2 minutes. Use a slotted spoon to remove from oil. Drain on paper towels. Serve warm.\n",
        "picture_link": "HA57ReDZGn8bZ35Sdla4X/KeMrR/9u2"
    },
    {
        "title": "Amazing White Clam Sauce",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "1 3/4 cups half-and-half cream ADVERTISEMENT",
            "3 (6.5 ounce) cans minced clams, drained with juice reserved ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese for topping ADVERTISEMENT",
            "1 (8 ounce) package dried linguine pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Add onion and red pepper flakes, and cook stirring constantly until onion is tender. Add garlic, and cook for a couple of minutes, just until fragrant. Pour in the reserved clam juice, and simmer over low heat for 10 minutes.\nGradually stir the half-and-half cream into the skillet, and simmer for another 20 minutes, but do not boil. At this time, I like to prepare my linguine and garlic bread.\nBring a large pot of lightly salted water to a boil. Add linguine pasta, and cook for 8 to 10 minutes, until al dente.\nAdd clams to the sauce, and cook just until clams are heated through, or they will become tough and chewy. Remove from heat, and serve over linguine pasta. Top with a sprinkle of grated Parmesan cheese.\n",
        "picture_link": "KpnqGaOwx8oeSAi/InRWthoT/rjOHBy"
    },
    {
        "title": "Creamy Corn Chowder",
        "ingredients": [
            "6 red potatoes, peeled and cubed ADVERTISEMENT",
            "2 (11 ounce) cans whole kernel corn, undrained ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped sweet onion ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "1 (12 ounce) package low-fat, firm silken tofu ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot of salted water and bring to a boil. Cook until tender, about 30 minutes; drain.\nTo the potatoes add corn, bell pepper, onion, red pepper flakes and vegetable broth. Boil for about 15 minutes; remove from heat.\nIn a food processor or blender puree all but 1 1/2 cups of the vegetable and broth mixture with the tofu. Process in batches if necessary. Combine the pureed mixture with the remaining 1 1/2 cups vegetable and broth mixture, and cook over low heat for 5 minutes; do not boil. Season with salt to taste.\n",
        "picture_link": "zis9ExAVCThluac1jIqXkbyVTXFqa92"
    },
    {
        "title": "Chili Cheese Dip V",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (15 ounce) can chili ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the bottom of a 9 inch, microwave safe round baking dish, spread the cream cheese. Top cream cheese with an even layer of chili. Sprinkle Cheddar cheese over the chili.\nHeat in the microwave on high heat 5 minutes, or until the cheese has melted.\n",
        "picture_link": "lnKGgf/oyTVt7uDNdBSzkZOjM1vWS52"
    },
    {
        "title": "Mango Salsa Salmon",
        "ingredients": [
            "4 (6 ounce) salmon steaks ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large red onion, diced ADVERTISEMENT",
            "2 cloves garlic, peeled and minced ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1 sprig fresh cilantro, chopped ADVERTISEMENT",
            "2 mangos - peeled, seeded, and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler. Line a broiler pan with foil.\nBroil salmon steaks on the prepared pan 12 minutes, or until easily flaked with a fork.\nHeat olive oil in a medium saucepan over medium heat, and saute onion until tender. Stir in garlic, tomatoes, and cilantro. Cook until heated through, 1 to 2 minutes, and remove from heat. Mix in the mangos. Serve over the salmon steaks.\n",
        "picture_link": "iA95RTZYD5k0aCdFbZWWGLvipfDukVq"
    },
    {
        "title": "Green Chile and Rice Casserole",
        "ingredients": [
            "1 (6 ounce) package dry instant long grain and wild rice mix ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (4 ounce) can chopped green chiles, drained ADVERTISEMENT",
            "1 (16 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a medium baking dish.\nPrepare the instant long grain and wild rice mix according to package directions.\nSpread 1/2 the cooked rice mix over the bottom of the prepared baking dish. In a bowl, mix the sour cream and green chiles. Spread 1/2 the sour cream mixture over rice, and top with 1/2 the cheese. Repeat the layers.\nBake 25 minutes in the preheated oven, or until bubbly.\n",
        "picture_link": "ddluYikmKd1mbiI73JN97uPMOF9En7O"
    },
    {
        "title": "Super Duper Zucchini Muffins",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/4 cup sour milk ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 1/2 cups shredded zucchini ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a muffin pan, or use paper liners.\nIn a large bowl, combine flour and sugar. Stir in baking powder, baking soda, cinnamon, nutmeg and salt. Cut in shortening until mixture resembles coarse crumbs. Make a well in the center, and pour in milk, eggs, zucchini and vanilla. Fold in walnuts. Fill muffin cups 2/3 to 3/4 full. Sprinkle tops with brown sugar.\nBake in the preheated oven for 15 to 20 minutes, or until a toothpick inserted into the center comes out clean. Allow to cool.\n",
        "picture_link": "fTOP5/P.l.WcvphxGdtBnmN2lPi70Qq"
    },
    {
        "title": "Elegant Beef Stroganoff",
        "ingredients": [
            "2 pounds sirloin steak, pounded to 1/4-inch thickness and cut into 1 x 1 1/2-inch strips ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 cups canned sliced mushrooms ADVERTISEMENT",
            "1 (10 ounce) can beef broth ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons red pepper flakes ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard ADVERTISEMENT",
            "1/3 cup cream cheese ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "2 cups hot cooked noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix steak and red wine together in a bowl; set aside to marinate for 15 to 30 minutes.\nCombine flour, salt, paprika, and black pepper together in a resealable plastic bag. Remove steak from marinade, reserving red wine for later use; add steak to flour mixture and shake to coat.\nMelt butter in a large skillet over medium-high heat; cook and stir steak, onion, and garlic until steak is browned and onion is softened and translucent, 10 to 15 minutes.\nStir mushrooms, beef broth, water, reserved red wine marinade, Worcestershire sauce, red pepper flakes, and mustard into steak mixture until well mixed; bring to a boil. Reduce heat, cover skillet, and simmer until steak is very tender, about 1 hour.\nStir cream cheese and sour cream into steak mixture; cook and stir until warmed, 2 to 3 minutes. Serve over cooked noodles.\n",
        "picture_link": "lbE2I752agAIdqbkXpETdUxJ5n5DkS."
    },
    {
        "title": "Tex-Mex Pork",
        "ingredients": [
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 (4 ounce) cans diced green chile peppers ADVERTISEMENT",
            "1/4 cup chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "2 1/2 pounds boneless pork loin roast, trimmed ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 3 quart or larger slow cooker, mix tomato sauce, barbeque sauce, onion, green chile peppers, chili powder, cumin, oregano, and cinnamon. Place pork in slow cooker, and spoon sauce over to coat. the meat.\nCover, and cook on Low 8 to 10 hours, or until pork is tender.\nRemove pork to a cutting board. Using 2 forks, pull meat into shreds. Pour sauce into a serving dish; stir in cilantro and shredded pork.\n",
        "picture_link": "qkU8KuR63UZvuxktAtA0ezIM25BvMnu"
    },
    {
        "title": "Horseradish Pork Chops",
        "ingredients": [
            "4 boneless pork chops ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "1/4 cup prepared horseradish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nPlace the pork chops into the prepared baking dish. Mix together the butter, bread crumbs, and horseradish. Spoon the mixture onto the pork chops, and press down the mixture to completely coat each chop with about 1/4 of the mixture.\nBake in the preheated oven until the chops are tender, about 45 minutes.\n",
        "picture_link": "DB0Bc20qBUHJtNwc58WIt0Zlbr5aiqi"
    },
    {
        "title": "Smashed Potatoes",
        "ingredients": [
            "1 1/2 pounds small yellow-fleshed potatoes ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon butter at room temperature ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon ground thyme ADVERTISEMENT",
            "1/2 teaspoon dried savory ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a saucepan, fill with water to cover the potatoes, and bring to a boil. Reduce heat to a simmer, and cook the potatoes until tender but not mushy, about 20 minutes. Drain and allow potatoes to cool.\nWhile potatoes are cooking, combine olive oil, butter, balsamic vinegar, garlic, rosemary, sage, thyme, savory, sea salt and pepper in a bowl. Stir with a fork to combine well.\nPreheat an oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper.\nPlace the potatoes in a single layer on the prepared baking sheet, and lightly press down on the potatoes to partially crush them. Spoon the oil-herb mixture over each potato.\nBake in the preheated oven until the edges of the potatoes are beginning to crisp, about 25 minutes. Cool for about 5 minutes before serving.\n",
        "picture_link": "HzCglPXH6ufcc0c4KsQ8WzYviIJGdIO"
    },
    {
        "title": "Cinnamon Rice with Apples",
        "ingredients": [
            "3/4 cup uncooked white rice ADVERTISEMENT",
            "1 1/2 cups apple juice ADVERTISEMENT",
            "1 apple, cored and chopped ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine rice, apple juice, chopped apple, and raisins. Season with cinnamon and salt. Bring to a boil, reduce heat to low, and cover for about 17 minutes. Lift lid, and see if rice is moist enough for your taste; if not, cook another couple minutes.\nMix in fresh parsley. Serve immediately.\n",
        "picture_link": "YauH.nmN6Qh/E8bmc/JZhO103EjQZu."
    },
    {
        "title": "Lorraine's Club Sandwich",
        "ingredients": [
            "2 slices bacon ADVERTISEMENT",
            "3 slices bread, toasted ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "2 leaves lettuce ADVERTISEMENT",
            "2 (1 ounce) slices cooked deli turkey breast ADVERTISEMENT",
            "2 slices tomato ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a heavy skillet. Cook over medium high heat until evenly brown. Drain on paper towels.\nSpread each slice of bread with mayonnaise. On one slice of toast, place the turkey and lettuce. Cover with a slice of toast, then the bacon and tomato. Top with last slice of toast.\n",
        "picture_link": ".8bJHiPltyW1NF5AjxgM87Oo543/t9."
    },
    {
        "title": "Homemade Wine",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "4 cups sugar ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen juice concentrate - any flavor except citrus, thawed ADVERTISEMENT",
            "3 1/2 quarts cold water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the yeast, sugar and juice concentrate in a gallon jug. Fill the jug the rest of the way with cold water. Rinse out a large balloon, and fit it over the opening of the jug. Secure the balloon with a rubber band.\nPlace jug in a cool dark place. Within a day you will notice the balloon starting to expand. As the sugar turns to alcohol the gasses released will fill up the balloon. When the balloon is deflated back to size the wine is ready to drink. It takes about 6 weeks total.\n",
        "picture_link": "TCWPxBw2G10EGCkZ/U7ZkzZb1KsTnpG"
    },
    {
        "title": "Chex® Pumpkin Pie Crunch",
        "ingredients": [
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon pumpkin pie spice ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 teaspoons vanilla ADVERTISEMENT",
            "2 cups Cinnamon Chex® cereal ADVERTISEMENT",
            "2 cups Wheat Chex® cereal ADVERTISEMENT",
            "2 cups Honey Nut Chex® cereal ADVERTISEMENT",
            "8 ounces pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In small bowl, mix brown sugar and pumpkin pie spice; set aside. In small microwave-safe dish, microwave butter on High about 30 seconds or until melted. Stir in vanilla. In large microwaveable bowl, mix all cereals and pecans. Pour butter mixture over cereal mixture, stirring until evenly distributed. Add sugar and spice mixture and stir until coated.\nMicrowave uncovered on High 5 minutes or until mixture begins to brown, stirring every minute. Spread on wax paper or a cookie sheet to cool. Store in airtight container.\n",
        "picture_link": ".68nklRIfwOB5zQgmNa8JCaZ2P6HnMm"
    },
    {
        "title": "Southern-Style Chocolate Gravy",
        "ingredients": [
            "1/4 cup cocoa ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "2 teaspoons vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the cocoa, flour, and sugar together in a bowl until there are no lumps. Pour the milk into the mixture and whisk until well incorporated. Transfer the mixture to a saucepan and cook over medium heat, stirring frequently, until its consistency is similar to gravy, 7 to 10 minutes. Remove from heat and stir the butter and vanilla into the mixture until the butter is melted. Serve immediately.\n",
        "picture_link": "h0xqDdRFCqUUcP8MbfwJjOsV8GZVpfm"
    },
    {
        "title": "Spaghetti with Garlic and Basil",
        "ingredients": [
            "1 (16 ounce) package uncooked spaghetti ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup unsalted butter, melted ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 cup fresh basil, coarsely chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Place spaghetti in the pot, cook for 8 to 10 minutes, until al dente, and drain.\nIn a large bowl, toss the spaghetti with the olive oil, butter, garlic, basil, salt, and pepper until evenly coated. Serve with Parmesan cheese.\n",
        "picture_link": "b4aMgB2uHh0RFLWVrIG1aFnyj3ZbglG"
    },
    {
        "title": "Cabbage Burgers",
        "ingredients": [
            "3 (1 pound) loaves frozen bread dough, thawed ADVERTISEMENT",
            "5 pounds ground beef ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 large head cabbage, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Divide each loaf of frozen bread dough into 6 pieces, and roll into balls. Set aside.\nCrumble the ground beef into a large pot over medium heat. Cook and stir until evenly browned. Drain off grease. Add the water, cabbage, onion, and garlic. Cook over medium-low heat, stirring as needed, until the cabbage is soft. Season with salt and pepper to taste. I like to use more pepper than salt. Drain off any excess liquids, and set aside.\nOn a lightly floured surface, roll the dough balls into 5 inch (approximate) squares. Place about 3/4 cup of the cabbage burger into the center, fold the dough over, and pinch to seal. Place on a baking sheet with the seam side down.\nBake for 15 to 18 minutes in the preheated oven, or until golden brown. Remove from the oven, and brush with melted butter. Serve hot.\n",
        "picture_link": "gdM/.Yn/Jy0Lmy6hJH0U91K/sgzFe/u"
    },
    {
        "title": "Caribbean Jerk Pork Chops",
        "ingredients": [
            "3/4 cup water ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1 tablespoon packed brown sugar ADVERTISEMENT",
            "1 tablespoon chopped green onion ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground allspice ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried thyme, crushed ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "6 lean pork chops, 1/2 inch thick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, lemon juice, onion, brown sugar, green onions, oil, salt, allspice, cinnamon, black pepper, thyme, and cayenne pepper in a blender or food processor. Blend until smooth. Reserve 1/2 cup for basting.\nPlace pork chops in shallow glass dish. Pour remaining marinade over the meat. Cover, and refrigerate at least 12 hours, but no longer than 24 hours.\nPreheat grill for medium heat. Place grate 4 to 5 inches above heat source.\nOil the grill grate. Arrange chops on grate, and discard marinade. Cover grill, and cook chops for 10 minutes, turning once, or to desired doneness.\n",
        "picture_link": "wKhTAQs3qN6BEBklmYox1vPZMUzzmti"
    },
    {
        "title": "Summertime Tilapia",
        "ingredients": [
            "2 shallots, minced ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "2 tablespoons chopped fresh oregano ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "2 tablespoons tequila (optional) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 tilapia fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the shallots, garlic, oregano, sugar, olive oil, vinegar, lime juice, tequila, salt, and pepper in a gallon-sized sealable bag; shake to combine. Add the tilapia to the mixture and store in the refrigerator 2 to 4 hours, turning every 30 minutes.\nPreheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil and prepare the surface with cooking spray.\nArrange the fish on the prepared baking sheet. Discard remaining marinade.\nBake in the preheated oven until the fish flakes easily with a fork, about 10 minutes.\n",
        "picture_link": "MkZTPZxxlhfLjX1Dd1LniNvR2ptaShS"
    },
    {
        "title": "Velvety Pumpkin Soup With Blue Cheese and Bacon",
        "ingredients": [
            "2 (15 ounce) cans pumpkin ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1 cup crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the pumpkin, chicken stock, half-and-half, shallot, molasses, butter, pumpkin pie spice, salt, and cayenne pepper in a large stockpot over low heat; simmer 10 minutes.\nMeanwhile, place bacon in a large skillet over medium-high heat, and cook until crispy; remove to paper towels to drain, then cool and crumble.\nLadle soup into bowls. Top with bacon and blue cheese.\n",
        "picture_link": "OCu/qbe8WOck4Awmc1swsdeEajC.w6m"
    },
    {
        "title": "Convenient Vegetarian Lasagna",
        "ingredients": [
            "2 (12 ounce) packages lasagna noodles ADVERTISEMENT",
            "2 pounds ricotta cheese ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "1 cup sliced carrots ADVERTISEMENT",
            "1 1/4 cups chopped green bell pepper ADVERTISEMENT",
            "1 (16 ounce) package chopped frozen broccoli, thawed and drained ADVERTISEMENT",
            "3 cups chunky-style spaghetti sauce ADVERTISEMENT",
            "2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and set aside.\nIn a large bowl, combine ricotta cheese, eggs, Parmesan cheese, parsley, basil and ground black pepper. Stir to blend; set aside.\nHeat oil in a large saucepan over high heat. Saute onions for about 5 minutes, stirring occasionally; add carrot slices and saute about 2 minutes, then stir in green bell pepper and broccoli. Stir all together, reduce heat to medium and cook until tender, about 5 minutes. Scrape veggies into ricotta mix and mix well.\nPreheat oven to 350 degrees F (175 degrees C).\nLadle 1 cup of spaghetti sauce into a 9x13 inch baking dish and spread evenly over the bottom. Place 2 strips of lasagna lengthwise in the dish, then spread about 4 cups of the filling over the pasta. Sprinkle 1 cup of the mozzarella cheese over the filling; repeat layers.\nBake at 350 degrees F (175 degrees C) for 1 hour; let stand about 15 to 20 minutes, to firm up, before serving.\n",
        "picture_link": "dO.Z/Cg19JIVkJVR7lntYr3SSOs.n9y"
    },
    {
        "title": "Chicken Salad Wraps",
        "ingredients": [
            "2 (10 ounce) cans chunk chicken, drained and flaked ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "4 tablespoons fresh salsa ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 (10 inch) flour tortillas ADVERTISEMENT",
            "12 lettuce leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl combine the chicken, onion, mayonnaise, salsa, salt and pepper. Mix together.\nLine each tortilla with two lettuce leaves, then divide chicken salad mixture evenly among each tortilla and roll up, or 'wrap'.\n",
        "picture_link": "/ND4Z7.vHAnnynpXk/TtxnYKaQP6hk."
    },
    {
        "title": "Soy and Garlic Marinated Chicken",
        "ingredients": [
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, nonporous bowl, combine the garlic and the soy sauce. Add the chicken and turn to coat well. Cover and marinate in the refrigerator for at least an hour.\nPreheat an outdoor grill for medium high heat and lightly oil the grate.\nGrill chicken over medium high heat for 10 to 15 minutes per side, or until internal temperature reaches 180 degrees F (80 degrees C). Discard any remaining marinade.\n",
        "picture_link": "jsBfwoM9ArxH9sAkaim1s1VzRpm/qdC"
    },
    {
        "title": "Not Your Every Day Smoked Pork Spare Ribs",
        "ingredients": [
            "6 pounds pork spareribs ADVERTISEMENT",
            "Dry rub: ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 tablespoon freshly ground black pepper ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon jalapeno seasoning salt (optional) ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "Mop Sauce: ADVERTISEMENT",
            "1 cup apple cider ADVERTISEMENT",
            "3/4 cup apple cider vinegar ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 jalapeno pepper, finely chopped (optional) ADVERTISEMENT",
            "3 tablespoons hot pepper sauce ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "2 cups wood chips, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the brown sugar, chili powder, paprika, black pepper, 2 tablespoons garlic powder, 2 teaspoons onion powder, kosher salt, cumin, cinnamon, jalapeno seasoning, and cayenne pepper. Rub generously onto the pork spareribs. Cover, and refrigerate for at least 4 hours, or overnight.\nPrepare an outdoor grill for indirect heat, or preheat a smoker to 250 degrees F (120 degrees C). Soak wood chips (apple or cherry are our favorites).\nWhile the grill heats up, prepare the mop sauce. In a medium bowl, stir together the apple cider, apple cider vinegar, 1 tablespoon onion powder, 1 tablespoon garlic powder, lemon juice, jalapeno, hot pepper sauce, salt and pepper.\nWhen the coals are gray and ashed over, place 2 handfuls of soaked woodchips directly on them. Place the ribs on the grill grate bone-side down. Cover, and cook for 3 1/2 to 4 hours. Add more coals as needed. Baste with the mop sauce, and throw handfuls of soaked woodchips onto the coals every hour. Keep the temperature of the grill or smoker from going below 225 degrees F (110 degrees C). Ribs are done when the rub has created a wonderful crispy blackened 'bark', and the meat has pulled away from the bone. Discard any leftover mop sauce.\n",
        "picture_link": "dF3Ca6p1uHDUjECOg1CU4xW2p5b436K"
    },
    {
        "title": "Margarita Salmon",
        "ingredients": [
            "6 (5 ounce) salmon fillets ADVERTISEMENT",
            "3 tablespoons fresh lime juice ADVERTISEMENT",
            "3 tablespoons orange blossom honey ADVERTISEMENT",
            "1 pinch brown sugar ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "lime slices for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place salmon fillets in a 9x13 inch baking dish. In a small bowl, stir together the lime juice, honey, brown sugar, and olive oil. Pour over the salmon. Cover and refrigerate for 30 minutes to marinate.\nPreheat the oven to 450 degrees F (220 degrees C). Season the salmon with salt and pepper.\nBake for 15 minutes in the center of the preheated oven, or until fish flakes easily with a fork. Garnish with lime slices, and serve immediately.\n",
        "picture_link": "MkskcqWdDeBBTWfKT3qkcHncg.7uR9G"
    },
    {
        "title": "Blueberry Flax Pancakes",
        "ingredients": [
            "1 1/2 cups dry pancake mix ADVERTISEMENT",
            "1/2 cup flax seed meal ADVERTISEMENT",
            "1 cup skim milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup fresh or thawed frozen blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set a nonstick skillet over medium heat.\nIn a medium bowl, stir together the pancake mix and flax seed meal. In a separate bowl or measuring cup, whisk together the milk and eggs. Pour the liquid into the dry ingredients, and stir just until moistened.\nSpoon 1/4 cupfuls of batter onto the hot skillet. Sprinkle with as many blueberries as desired. Cook until bubbles appear on the surface, then flip and cook until browned on the other side.\n",
        "picture_link": "EQYeQHFXfmrkNVK1Huo.AfqmO5FvLjy"
    },
    {
        "title": "Layered Eggplant Hamburger Casserole",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes ADVERTISEMENT",
            "1/3 cup dried parsley ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 eggplant ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium heat, saute the ground beef, onion and garlic for 5 to 10 minutes. Drain excess fat. Stir in the tomato paste, water, tomatoes, parsley, thyme, oregano and basil. Set aside.\nSlice eggplant into 1/4-inch rounds. Place a layer of eggplant into the bottom of a lightly greased 9x12-inch glass baking dish. Then place a layer of the ground beef mixture over the eggplant, followed by a layer of sliced onion. Top this with 1/2 the breadcrumbs and cheese. Then repeat the layers: eggplant, ground beef mixture, sliced onion and remaining breadcrumbs and cheese.\nCover and bake at 350 degrees F (175 degrees C) for 1 hour, remove foil and bake for 20 more minutes.\n",
        "picture_link": "OIyYWhYzu7OmiMBh4RFm7QViJq2HvAq"
    },
    {
        "title": "Smoked Salmon Sushi Roll",
        "ingredients": [
            "2 cups Japanese sushi rice ADVERTISEMENT",
            "6 tablespoons rice wine vinegar ADVERTISEMENT",
            "6 sheets nori (dry seaweed) ADVERTISEMENT",
            "1 avocado - peeled, pitted and sliced ADVERTISEMENT",
            "1 cucumber, peeled and sliced ADVERTISEMENT",
            "8 ounces smoked salmon, cut into long strips ADVERTISEMENT",
            "2 tablespoons wasabi paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak rice for 4 hours. Drain rice and cook in a rice cooker with 2 cups of water. Rice must be slightly dry as vinegar will be added later.\nImmediately after rice is cooked, mix in 6 tablespoons rice vinegar to the hot rice. Spread rice on a plate until completely cool.\nPlace 1 sheet of seaweed on bamboo mat, press a thin layer of cool rice on the seaweed. Leave at least 1/2 inch top and bottom edge of the seaweed uncovered. This is for easier sealing later. Dot some wasabi on the rice. Arrange cucumber, avocado and smoked salmon to the rice. Position them about 1 inch away from the bottom edge of the seaweed.\nSlightly wet the top edge of the seaweed. Roll from bottom to the top edge with the help of the bamboo mat tightly. Cut roll into 8 equal pieces and serve. Repeat for other rolls.\n",
        "picture_link": "c5OkcfOG7kqmPEJMnRrrlhqe6H0ZB7i"
    },
    {
        "title": "Cranberry Pecan Salad",
        "ingredients": [
            "1 cup pecan halves ADVERTISEMENT",
            "2 tablespoons raspberry vinegar ADVERTISEMENT",
            "1/2 teaspoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste (optional) ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "6 cups mixed salad greens, rinsed and dried ADVERTISEMENT",
            "3/4 cup dried cranberries ADVERTISEMENT",
            "1/2 medium red onion, thinly sliced ADVERTISEMENT",
            "crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spread pecans evenly on a baking sheet. Toast for 8 to 10 minutes, or until lightly browned and fragrant.\nIn a small bowl, stir together the vinegar, mustard, sugar, salt, and pepper; mix until sugar and salt dissolve. Whisk in olive oil.\nIn a salad bowl, toss together the greens, cranberries, pecans, onions, and cheese. Drizzle with vinaigrette, and toss gently to coat.\n",
        "picture_link": "jgQaVIL6HYKpDtR75c2kcfCwAOGg9F2"
    },
    {
        "title": "Honey Glazed Carrots",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 pound baby carrots ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon monosodium glutamate (MSG) ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease the bottom of a 9x13 inch baking dish.\nToss carrots with onion, and add Worcestershire sauce, oregano, monosodium glutamate, garlic powder, salt and pepper.\nBake for 45 minutes, or until tender. Turn oven off and add honey and butter, mixing thoroughly. Place dish back in the warm oven for a few minutes. Serve immediately.\n",
        "picture_link": "VkeklZHBPO/G/IGuZvkn0muiql62wkS"
    },
    {
        "title": "Slumgullion",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cups tomato sauce ADVERTISEMENT",
            "2 (4.5 ounce) cans mushrooms, drained ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and place in large saucepan.\nMeanwhile, in a large skillet, brown beef over medium heat; just before beef is browned, stir in onion.\nAdd beef mixture to pasta, and stir in tomato sauce, mushrooms, garlic, salt, pepper and stewed tomatoes. Cook over low heat, 10 to 15 minutes, or until heated through.\n",
        "picture_link": "FmocANckIOW.3DuKLvOWKfq1ZuX47be"
    },
    {
        "title": "Okra, Corn and Tomatoes",
        "ingredients": [
            "2 slices bacon, chopped ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 (10 ounce) package frozen cut okra ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1 (20 ounce) package frozen corn ADVERTISEMENT",
            "1 tablespoon file powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet over medium-high heat. Cook and stir to release some of the juices, then add the onion and okra. Fry until tender and browned, stirring constantly. Be careful, as this tends to brown quickly.\nPour in the tomatoes, and simmer over medium heat for 20 minutes. Mix in the corn, and simmer for another 10 minutes. Season with file powder, salt and pepper, and serve.\n",
        "picture_link": "bkzSACwa2elzMqXqucJGFcUJfUYLhFq"
    },
    {
        "title": "Seafood Piccata",
        "ingredients": [
            "1 (16 ounce) package medium seashell pasta ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "1 cup fresh mushrooms, sliced ADVERTISEMENT",
            "3/4 cup minced green onions ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 pound medium shrimp - peeled and deveined ADVERTISEMENT",
            "1 pound bay scallops ADVERTISEMENT",
            "1 pound crabmeat ADVERTISEMENT",
            "2 cups dry white wine ADVERTISEMENT",
            "6 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to boil, add pasta shells, and cook for 8 to 10 minutes, or until al dente; drain.\nHeat olive oil in a large pot over medium heat. Saute mushrooms, green onions, and garlic until tender. Stir in shrimp, scallops, and crabmeat. Cook for 5 minutes, or until shrimp is pink. Stir in wine, lemon juice, and butter; cook until heated through.\nToss pasta with seafood sauce and parsley.\n",
        "picture_link": "3nAT.qPOc9KlfDVW5kMOdtYUfgHfo3O"
    },
    {
        "title": "Green Beans with Hazelnuts and Lemon",
        "ingredients": [
            "1 1/2 pounds fresh green beans, washed and trimmed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 teaspoons lemon zest ADVERTISEMENT",
            "1/3 cup chopped toasted hazelnuts ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot of salted boiling water, cook beans 3 to 8 minutes or until tender. Drain and place in a large bowl.\nAdd olive oil, lemon zest, hazelnuts, salt and pepper. Beans may be made 1 day ahead, chilled and covered. Reheat beans, preferably in a microwave.\n",
        "picture_link": "L21tQD4FITvj7lv3Ns37.yEFLMIit3a"
    },
    {
        "title": "Grandma Ruth's Stuffing",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound sliced fresh mushrooms ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 (20 ounce) loaf French or Italian bread, cut into 1 inch cubes ADVERTISEMENT",
            "1 (16 ounce) package herb-seasoned stuffing mix ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "2 teaspoons rubbed sage ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Saute the mushrooms, celery, and onions until softened.\nDampen the fresh bread cubes (not the stuffing mix), then squeeze out any excess water.\nIn a large bowl, combine the mushroom mixture, bread cubes, stuffing mix, eggs, and 1 can chicken broth. Season with sage, thyme, garlic powder, salt, and pepper, and mix well. The stuffing should have a rather paste-like consistency. Mix in additional chicken broth as necessary.\nLoosely pack stuffing inside turkey cavity before roasting.\n",
        "picture_link": "0k2PGJzu9d3qzSYWBUMSzpNlqE.QVLO"
    },
    {
        "title": "Fruity Grilled Pork Tenderloin",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup plum jam ADVERTISEMENT",
            "3/4 cup black cherry soda ADVERTISEMENT",
            "1 (1 pound) pork tenderloin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small sauce pan, mix together soy sauce, brown sugar, and jam over low heat until sugar has dissolved. Reserve 1/4 cup of sauce for basting the tenderloin while grilling. Combine remaining sauce with soda in a large plastic resealable bag; place meat in bag, and seal. Marinate in the refrigerator for at least 4 hours, or overnight.\nPreheat grill for medium heat.\nLightly oil preheated grill, and discard marinade. Cook tenderloin for 15 to 20 minutes, or until an instant-read thermometer inserted into the center reads 145 degrees F (63 degrees C).\nRemove meat from grill, and allow to rest for 5 minutes before slicing into 1/4 inch thick medallions.\n",
        "picture_link": "aKn5DVyqPDnwleeDXkSHr28q29K1LMu"
    },
    {
        "title": "Chinese Cold Pasta Salad",
        "ingredients": [
            "8 ounces dry fettuccine pasta ADVERTISEMENT",
            "2 tablespoons natural peanut butter ADVERTISEMENT",
            "1/2 cup vegetable broth ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in a large pot of boiling water until al dente. Rinse and drain. Set aside.\nIn a large bowl, combine peanut butter, broth, soy sauce, garlic, and crushed red pepper. Mix well. Add pasta, sliced red pepper, scallions, and cilantro; toss to combine. Chill.\n",
        "picture_link": "zkfma7ucHlIP4WiBPAQq3WX9bk4P0fa"
    },
    {
        "title": "Chutney Baked Brie",
        "ingredients": [
            "1 (2.2 pound) wheel Brie cheese ADVERTISEMENT",
            "2 teaspoons ground curry powder ADVERTISEMENT",
            "1 (12 ounce) jar mango chutney ADVERTISEMENT",
            "1 cup chopped cashews ADVERTISEMENT",
            "1 French baguette, cut into 1/2 inch slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSprinkle curry powder over top and sides of Brie; rub the curry powder into the rind to thoroughly coat the surface. Place the Brie wheel in a large pie plate or oven proof dish. Spread a generous layer of chutney over the top, and evenly sprinkle with cashews.\nBake 15 minutes in the preheated oven, or until cashews are slightly golden and cheese inside the rind is melted. Serve with slices of baguette.\n",
        "picture_link": "dLZrXa4rcAT8pFr7sQnIn/QhSXpytqi"
    },
    {
        "title": "Fettuccini with Basil and Brie",
        "ingredients": [
            "12 ounces dry fettuccine pasta ADVERTISEMENT",
            "4 large tomatoes, seeded and chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 cups cubed Brie cheese ADVERTISEMENT",
            "3/4 cup chopped fresh basil ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl combine chopped tomatoes, minced garlic, brie, chopped basil, olive oil, vinegar, salt and pepper. Mix well. Cover and let stand at room temperature to marinate for 1 to 2 hours.\nIn a large pot of boiling salted water over high heat, cook the fettuccine until al dente, about 12 minutes.\nDrain the fettuccine and toss with the sauce. Sprinkle with grated Parmesan cheese.\n",
        "picture_link": "txHZzV5gGbTywQEfEnVxUI5rlCAuMVG"
    },
    {
        "title": "Cauliflower Cheese Pie",
        "ingredients": [
            "2 cups shredded potatoes ADVERTISEMENT",
            "1/4 cup grated onion ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 head cauliflower, coarsely chopped ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a shallow 9 inch baking dish or pie pan.\nTo make crust: Use a cheese cloth to squeeze extra liquid from the grated potatoes. In a medium size mixing bowl, combine potato, onion, egg, salt and flour. Transfer the mixture to the prepared pie pan, and pat it down with a rubber spatula or your fingertips. Bake for 30 minutes. Brush the crust with oil, and bake for another 10 minutes. Remove crust from oven, and reduce the oven's temperature to 350 degrees F (175 degrees C).\nTo make the filling: In a large frying pan over a high heat, heat the oil until hot. Reduce the temperature to medium and saute onion, garlic, basil, thyme, salt, pepper and paprika in the hot oil; cook for 8 to 10 minutes. Stir the cauliflower into the pan and cook for 15 minutes.\nSpread 1/2 of the cheese onto the potato crust. Spoon the vegetables on top of the cheese. Sprinkle the remaining cheese over the sauteed vegetables. Beat the milk and eggs together in a small bowl, and then pour over the vegetables and cheese. Sprinkle paprika over the mixture.\nBake for 35 to 40 minutes, or until the custard is set and the top of the pie is slightly browned.\n",
        "picture_link": "AJu/FL7ytdLVxj/juJnrZ6vV.3/jd8a"
    },
    {
        "title": "Cakes In A Cone",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "24 flat bottomed ice cream cones ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1 ounce colored candy sprinkles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare cake mix according to directions. Fill each cone about 3/4 full of batter, up to first ridge. Place cones in the cups of a cupcake pan or on cookie sheets.\nBake at 400 degrees F (205 degrees C) for 15 to 18 minutes.\nPlace 10 chocolate chips on top of each warm cone, and in a minute or two spread melted chocolate over top. Decorate with candies.\n",
        "picture_link": "t6i7LUx36U6Pmsb4fA3tA9mHlU3Xuqq"
    },
    {
        "title": "Broccoli and Stuffing Casserole",
        "ingredients": [
            "2 pounds fresh broccoli florets ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "10 ounces dry bread stuffing mix ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nCook broccoli in a large pot of salted boiling water until just slightly tender. Drain.\nIn a large bowl, combine eggs, onion, mushroom soup and mayonnaise.\nPlace a layer of broccoli in the prepared baking dish. Pour mayonnaise sauce over broccoli. Spread stuffing mix over the sauce. Drizzle butter or margarine over all and top with shredded cheese.\nBake at 350 degrees F (175 degrees C) for 30 minutes.\n",
        "picture_link": "/IHF6/uKiB52.RTn3nMQ4AyEt9l9uRe"
    },
    {
        "title": "Asparagus Rolantina",
        "ingredients": [
            "1 pound fresh green asparagus spears, trimmed ADVERTISEMENT",
            "4 slices Swiss cheese ADVERTISEMENT",
            "5 (1/2 ounce) slices prosciutto ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "4 tablespoons butter, melted ADVERTISEMENT",
            "1 cup Italian-style dried bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of water to a boil. Lower asparagus into the water, and cook for 1 minute, 2 minutes if the spears are thick.\nLay one slice of meat on a plate. Layer a slice of cheese on top of the slice of meat. Place 3 to 4 asparagus spears at one end of the cheese and meat, and sprinkle with black pepper to taste. Roll the cheese and meat up over the asparagus, and secure with a toothpick. Place asparagus rolls in a casserole dish. Once all of the asparagus rolls have been arranged in the casserole dish, pour melted butter over the entire dish. Sprinkle with bread crumbs and Parmesan cheese.\nBake for 15 to 20 minutes, or until the crumb mixture has formed a crust over the asparagus rolls.\n",
        "picture_link": "/2jB5.pQWsc6lJh4aF6TkOLb25NS5ke"
    },
    {
        "title": "Red Potato Salad with Sour Cream and Chives",
        "ingredients": [
            "6 large red potatoes ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/4 cup fresh chives, finely chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scrub potatoes (don't peel). If large, cut in half or in quarters. Boil potatoes in their skins until fork-tender. Drain, dry and cut into 1/2 inch cubes.\nIn a salad bowl, combine the potatoes, sour cream, yogurt, and chives; toss gently to coat. Add salt, and pepper to taste; refrigerate until chilled.\n",
        "picture_link": "agiIfLQIM3hdYKlT2.ptwMEjfjVWqne"
    },
    {
        "title": "Cinnamon Sour Cream Biscuits",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a large mixing bowl, combine flour, sugar, cinnamon, baking powder, soda, and salt. Cut in margarine. Make a well in center. Add sour cream, 2 tablespoons milk, and raisins, stirring till just combined (add a bit more milk, if needed).\nOn floured surface, gently knead 8-10 stokes. Pat dough to 1/2\" thickness. Cut with biscuit cutter, dipping in flour between cuts. Place on baking sheet.\nBake at 450 degrees F (230 degrees C) for 10-12 minutes. Cool slightly on wire racks.\nStir together confectioners' sugar and 2 teaspoons milk. Drizzle over biscuits. Sprinkle with additional cinnamon and sugar, if desired.\n",
        "picture_link": "NtOazDLUt0faxpPKd/ckY6e4/JqkxKq"
    },
    {
        "title": "Chocolate Mocha Cake I",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 tablespoon instant coffee powder ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9 inch round cake pans.\nMeasure flour, sugar, cocoa, oil, eggs, buttermilk, baking powder, soda, and salt into a mixing bowl. Dissolve instant coffee in hot water, and add to mixing bowl. Beat at medium speed for 2 minutes until smooth; batter will be thin. Pour into prepared pans.\nBake for 30 to 35 minutes, or until an inserted wooden pick comes out clean. Cool in pans for 10 minutes, and then turn out onto racks to cool completely.\nFrost cooled cake with Coffee Icing. After frosting, melt some semisweet chocolate baking squares or chips in a double boiler. Drizzle chocolate around top outside edges letting it run down sides, or over top of cake.\n",
        "picture_link": "zm6K6iVRtTvUDCy2GZXEYZaqlXjYURu"
    },
    {
        "title": "BBQ Sauce",
        "ingredients": [
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl or bottle, combine the vinegar, ketchup, water, sugar, salt and chili powder. Mix well and store in the refrigerator until ready for use.\n",
        "picture_link": "sE5TcDLv/mQqFQbFIpYdiVZlfK6./F."
    },
    {
        "title": "Michelle's Famous Washed Cranberry Sauce",
        "ingredients": [
            "1 (12 ounce) package fresh cranberries, picked through and rinsed ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the cranberries, water, white sugar, and brown sugar in a saucepan. Bring to a boil over high heat; cook uncovered for 5 minutes. Spoon off any foam that forms. Serve hot or cold.\n",
        "picture_link": "Weal9calA8ocMkmIlkwmUEx5mD/uX4i"
    },
    {
        "title": "Pineapple Cake II",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x13 inch pan.\nMix the flour, baking soda, salt, and 1 1/2 cups of the white sugar together. Stir in the beaten eggs and the pineapple with juice and mix well. Pour batter into prepared pan.\nBake at 350 degrees F (175 degrees C) for 30 minutes. Pour Buttery Milk Syrup over top of cake while still warm.\nTo Make Buttery Milk Syrup: In a sauce pan combine the butter or margarine, evaporated milk, vanilla, and 1/2 cup white sugar. Bring mixture to a boil over medium high heat and cook for about 5 minutes. Pour over cake while still warm.\n",
        "picture_link": "RoMEDZD0yHEgLjDJw9QeWz5pzA2Zv1i"
    },
    {
        "title": "Marshmallow Brownies",
        "ingredients": [
            "1 cup butterscotch chips ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "2 cups milk chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan.\nMelt butterscotch morsels and margarine in a large bowl in microwave. Stir the mixture well and let it cool to lukewarm.\nWhile the liquid mixture is cooling, mix flour, brown sugar, baking powder, salt, vanilla, and eggs into the butterscotch mixture; mix well. Fold in marshmallows and chocolate morsels.\nSpread batter into a lightly greased 9x13 inch pan.\nBake 25 minutes. Be careful not to overcook.\n",
        "picture_link": "ayd.BbDb1GQUc6TNT/2mu32q.4Ncfvy"
    },
    {
        "title": "Mango, Peach and Pineapple Salsa",
        "ingredients": [
            "2 mangos, peeled, seeded and chopped ADVERTISEMENT",
            "2 small peaches, halved, pitted, and cut into 1/2-inch dice ADVERTISEMENT",
            "1 cup diced fresh pineapple ADVERTISEMENT",
            "4 tomatoes, chopped ADVERTISEMENT",
            "1 white onion, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 yellow bell pepper, diced ADVERTISEMENT",
            "1 cup chopped fresh cilantro, or to taste ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 small jalapeno pepper, minced ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar, or to taste ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the mango, peach, pineapple, tomato, onion, red pepper, yellow pepper, and cilantro in a mixing bowl. Stir in the garlic, jalapeno, lime juice, salt, sugar, and water. Cover and refrigerate at least 1 hour before serving.\n",
        "picture_link": "H5Ha9h7qwHHwUgPayHqTd/MDbGliTvC"
    },
    {
        "title": "Quinoa Broccoli Casserole",
        "ingredients": [
            "1 cup quinoa ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups chopped broccoli ADVERTISEMENT",
            "1 (10 ounce) can low-sodium cream of mushroom soup ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup French-fried onions ADVERTISEMENT",
            "1/2 cup light sour cream ADVERTISEMENT",
            "1 teaspoon lemon pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup French-fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place quinoa in a bowl; pour in enough water to cover. Soak for 30 minutes. Drain and rinse several times.\nBring quinoa, water, olive oil, and 1 teaspoon salt to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and the water has been absorbed, about 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add broccoli, cover, and steam until tender, 2 to 4 minutes.\nStir broccoli, cream of mushroom soup, Cheddar cheese, 1/2 cup French-fried onions, sour cream, and lemon pepper into cooked quinoa; season with salt and black pepper to taste. Spoon quinoa mixture into the prepared baking dish.\nBake in the preheated oven until heated through, 10 minutes. Sprinkle with 1/2 cup French-fried onions and bake until topping is lightly browned, about 5 more minutes.\n",
        "picture_link": "uZ5v90BTUks/D45ZOKlYemn3ipNxFEe"
    },
    {
        "title": "Juicy Butt Steaks",
        "ingredients": [
            "2 pork shoulder (Boston butt) steaks ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium heat. Season the pork steaks on both sides with salt, pepper and garlic powder. Place in the skillet and cook until browned on each side, about 4 minutes per side.\nPlace sliced onions on top of the steaks in the pan. Stir together the ketchup and water in a medium bowl; pour over the steaks. Bring to a simmer, then reduce the heat to medium-low, cover and cook for about 2 hours. The longer you cook, the better the meat tastes.\n",
        "picture_link": "rZtk4EMSWeS.N.3kCI6hY/cR89mgHx2"
    },
    {
        "title": "Buffalo Wontons",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup hot pepper sauce ADVERTISEMENT",
            "2 teaspoons distilled white vinegar ADVERTISEMENT",
            "2 cups shredded cooked chicken ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (12 ounce) package wonton wrappers ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "2 cups oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter over medium-high heat in a small saucepan. Remove from heat; whisk the hot pepper sauce and vinegar into the hot butter. When mixture is smooth, set sauce aside and allow to rest for 1 hour to cool and thicken. Stir the shredded chicken into the cooled buffalo sauce, and let stand 15 minutes.\nLay out several wonton wrappers, place 1/2 teaspoon chicken in the center of each wrapper and top with 1/2 teaspoon cream cheese. Brush the edges of the wonton wrappers with egg white, fold them over the filling in a triangle shape and press the edged together to seal. Continue until all of the wontons are filled.\nHeat the oil in a saucepan over medium-high heat to 375 degrees F (190 degrees C).\nCook the wontons, carefully placing the wontons 4 to 5 at a time into the hot oil and deep fry until golden brown, flipping as necessary for even browning, about 2 minutes. Remove the wontons from the oil and drain on paper towel.\n",
        "picture_link": "e2dbfTmczvdU/wBfiP6lgIL6kM7l1xK"
    },
    {
        "title": "Pinto Beans With Mexican-Style Seasonings",
        "ingredients": [
            "1 pound dried pinto beans, rinsed ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1/2 pound bacon, cut into 1/2-inch pieces ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 tablespoon chili powder, or to taste ADVERTISEMENT",
            "1 tablespoon ground cumin, or to taste ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder, or to taste ADVERTISEMENT",
            "1/2 bunch fresh cilantro, chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pinto beans into a large pot and pour in enough water to cover by 2 to 3 inches. Let beans soak overnight.\nDrain beans, return to pot, and pour in fresh water to cover; add diced tomatoes, bacon, onion, chili powder, cumin, and garlic powder. Bring to a boil, reduce heat to low, and simmer for 3 hours.\nStir cilantro and salt into bean mixture; simmer until beans are soft, about 1 more hour.\n",
        "picture_link": "2xjV1N5guAMF.JFRa3wqbp2VPjbA27i"
    },
    {
        "title": "New Orleans Barbequed Shrimp",
        "ingredients": [
            "1 pound shrimp, heads off and unpeeled ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup zesty Italian dressing ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWash shrimp and drain well.\nMelt margarine/butter in a one quart casserole dish. Add salad dressing, lemon juice, black pepper and garlic powder.\nAdd shrimp to the casserole dish. Stir gently to cover the shrimp with the mixture. Cover and bake, stirring occasionally for 25 to 30 minutes or until shrimp are pink.\nServe the shrimp hot on a large platter and place the sauce in individual bowls so that you can easily 'dunk' bread in the sauce!\n",
        "picture_link": "Wl43pQiOUV/Sce9zYTkfK025p1npG5G"
    },
    {
        "title": "Hoisin-Glazed Salmon",
        "ingredients": [
            "1/3 cup reduced-sodium soy sauce ADVERTISEMENT",
            "1/4 cup hoisin sauce ADVERTISEMENT",
            "1 tablespoon chili garlic sauce ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon grated fresh ginger root ADVERTISEMENT",
            "1 clove garlic, pressed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "6 (6 ounce) skinless, boneless salmon fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the soy sauce, hoisin sauce, chili sauce, lemon juice, ginger, garlic, and olive oil in a 9x13 inch baking dish. Place the salmon fillets into the marinade, and turn to evenly coat. Cover the dish with plastic wrap, and marinate in the refrigerator for 30 minutes.\nPreheat an oven to 350 degrees F (175 degrees C). Remove and discard the plastic wrap from the salmon, use a spoon to scoop up the marinade that has collected in the bottom of the baking dish, and drizzle it over the salmon fillets.\nBake in the preheated oven until the salmon flakes easily with a fork, about 30 minutes.\n",
        "picture_link": "O0OYRTwGOQBHR5IwcsNv4khzBGww9oC"
    },
    {
        "title": "Maple-Mustard Glazed Pork Chops",
        "ingredients": [
            "1/4 cup lightly packed brown sugar ADVERTISEMENT",
            "1 tablespoon fresh-ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "4 (6 ounce) boneless pork loin chops ADVERTISEMENT",
            "1/4 cup pure maple syrup ADVERTISEMENT",
            "2 tablespoons spicy brown mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the brown sugar, pepper, salt, onion powder, and paprika in a bowl. Coat the pork chops with this mixture on both sides. Cover and place in the refrigerator 6 hours to overnight.\nPlace oven rack in it's highest position. Set oven to Broil.\nPlace pork chops onto a slotted, two-piece broiler pan. Stir together the maple syrup and spicy mustard. Broil pork chops for 5 minutes, then turn over, and broil for another 5 minutes. Brush the tops with the mustard glaze, and cook for 1 minute. Turn the chops over, brush again, and broil for an additional minute, or until cooked to your desired degree of doneness. Remove pork chops to serving plates and top with additional glaze, if desired.\n",
        "picture_link": "qW3VyaHKoLdHgMnRSjs4OFCA2IY7HKK"
    },
    {
        "title": "Irish Boxty",
        "ingredients": [
            "1 1/2 cups grated raw potatoes ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup leftover mashed potatoes ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon skim milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the grated potatoes with flour in a large bowl. Stir in mashed potatoes until combined. In a separate bowl, whisk together the egg and skim milk; mix into the potatoes. Season to taste with salt and pepper.\nHeat the olive oil in a large skillet over medium-high heat. Drop in the potato mixture, forming patties about 2 inches in diameter. Fry on both sides until golden brown, 3 to 4 minutes per side. Drain on a paper towel-lined plate. Serve warm.\n",
        "picture_link": "fSPYp48VMMgZ35mcDh7w3Bhrk491Gwm"
    },
    {
        "title": "Crispy Turnip 'Fries'",
        "ingredients": [
            "3 pounds turnips ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with a piece of aluminum foil and lightly grease.\nPeel the turnips, and cut into French fry-sized sticks, about 1/3 by 4 inches. Place into a large bowl, and toss with the vegetable oil to coat. Place the Parmesan cheese, garlic salt, paprika, onion powder in a resealable plastic bag, and shake to mix. Place the oiled turnips into the bag, and shake until evenly coated with the spices. Spread out onto the prepared baking sheet.\nBake in preheated oven until the outside is crispy, and the inside is tender, about 20 minutes. Serve immediately.\n",
        "picture_link": "9BwXQ.lhx2Cz0peis0alJMPOPLtiuRq"
    },
    {
        "title": "Kung Wow Chicken",
        "ingredients": [
            "1 tablespoon white wine ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "3 medium green onions, finely chopped (white parts only) ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast, cut into 1-inch pieces ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1 tablespoon soy sauce, or to taste ADVERTISEMENT",
            "1 tablespoon Asian chili paste (sambal), or more to taste ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons ketchup ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 tablespoons peanut oil ADVERTISEMENT",
            "2 cups cubed zucchini ADVERTISEMENT",
            "1 cup cubed red bell pepper ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/4 cup roasted, salted peanuts ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup chopped green onion tops ADVERTISEMENT",
            "4 cups cooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together 1 tablespoon white wine, 1 tablespoon soy sauce, 1 teaspoon brown sugar, and finely chopped green onion.\nStir in chicken pieces to coat. Cover and refrigerate for 1 hour.\nCombine white vinegar, rice vinegar, 1 tablespoon soy sauce, sambal chile paste, sesame oil, 2 tablespoons brown sugar, ketchup, 2 tablespoon white wine, and garlic in a bowl. Whisk thoroughly; set aside.\nMix cornstarch with cold water in a small bowl.\nHeat peanut oil in a heavy duty, nonstick skillet over high heat. Stir in chicken; cook and stir until chicken begins to brown, about 2 minutes\nStir in zucchini and red bell pepper; cook for 2 more minutes. Add chicken broth and stir.\nStir in vinegar mixture; cook and stir until vegetables are tender and chicken is no longer pink in the center, about 2 minutes. Stir in cornstarch mixture until sauce is thickened, about 30 seconds; remove from heat.\nToss in peanuts; season with salt and pepper to taste. Stir in green onion tops. Serve over white rice.\n",
        "picture_link": "P9pEhZ5.5Scg9fZgz4NXULjLYRay2ba"
    },
    {
        "title": "Catfish Tuscany",
        "ingredients": [
            "4 (4 ounce) fillets catfish ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1 1/2 tablespoons mayonnaise ADVERTISEMENT",
            "4 roma tomatoes or sun-dried tomatoes, sliced thin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat broiler to 500 degrees. Coat a broiling pan with nonstick cooking spray. Brush both sides of fillets with lemon juice, and then sprinkle with salt and pepper. Place fillets flat side up on prepared pan.\nIn a small bowl, mix Parmesan cheese, butter, and mayonnaise.\nBroil fish about 4 inches from heat for 6 minutes. Remove pan from oven, and turn fillets over. Spread the cheese mixture evenly over each fillet. Top with tomato slices. Broil an additional 4 to 6 minutes, or until fish flakes easily with a fork.\n",
        "picture_link": "053gEA6GKSlI5YKhZPbpYOD9rJfyZwC"
    },
    {
        "title": "Campbell's® Slow-Cooker Chicken and Dumplings",
        "ingredients": [
            "1 1/2 pounds skinless, boneless chicken breasts, cut into 1-inch pieces ADVERTISEMENT",
            "2 medium Yukon Gold potatoes, cut into 1-inch pieces ADVERTISEMENT",
            "2 cups whole baby carrots ADVERTISEMENT",
            "2 stalks celery, sliced ADVERTISEMENT",
            "2 (10.75 ounce) cans Campbell's® Condensed Cream of Chicken Soup (Regular or 98% Fat Free) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon dried thyme leaves, crushed ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups all-purpose baking mix ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken, potatoes, carrots and celery into a 6-quart slow cooker.\nStir the soup, water, thyme and black pepper in a small bowl. Pour the soup mixture over the chicken and vegetables.\nCover and cook on LOW for 7 to 8 hours* or until the chicken is cooked through.\nStir the baking mix and milk in a medium bowl. Spoon the batter over the chicken mixture. Turn the heat to HIGH. Tilt the lid to vent and cook for 30 minutes or until the dumplings are cooked in the center.\n",
        "picture_link": "ZagiahqpU23DdQ8E9BJdQsZ7VtyUveC"
    },
    {
        "title": "Evin's Indian Apricot Chicken",
        "ingredients": [
            "1 pound chicken tenders, cut into bite-size pieces ADVERTISEMENT",
            "2 teaspoons garam masala ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 yellow onion, finely diced ADVERTISEMENT",
            "1 1/2 cups chicken stock, or as needed ADVERTISEMENT",
            "1 cup apricot preserves ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "1 teaspoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1 teaspoon lime zest ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the chicken with garam masala, garlic powder, salt, and pepper; set aside. Heat the olive oil in a skillet over medium heat. Cook the onions in the hot oil until tender, about 5 minutes. Add the chicken; cook and stir until the chicken pieces are no longer pink on the outside, about 5 minutes. Remove the mixture from the pan and set aside.\nPour 1 cup of chicken stock into the pan and bring to a simmer. Scrape up the brown bits from the bottom of the pan; stir in the apricot preserves and vinegar. Thin with the remaining chicken stock as needed to create a smooth sauce. Season to taste with the hot sauce. Place chicken back in pan; simmer until chicken is cooked through, about 10 minutes. Stir in lime zest and butter before serving.\n",
        "picture_link": "ytccfFJ.EZhf8S0XyRnp9MvuieFFKHu"
    },
    {
        "title": "Pretty in Pink Sangria",
        "ingredients": [
            "2 (10 ounce) packages frozen sliced strawberries, thawed ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen lemonade concentrate, thawed ADVERTISEMENT",
            "2 (750 milliliter) bottles chilled rose wine, such as white Zinfandel ADVERTISEMENT",
            "2 cups pineapple juice ADVERTISEMENT",
            "1 liter ginger ale ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the strawberries, lemonade concentrate, rose wine, and pineapple juice in a punch bowl until combined. Stir in the ginger ale just before serving.\n",
        "picture_link": "soFRMLU23QSCaQV.mPP6CquP07qdlN2"
    },
    {
        "title": "Chef John's Easy Apple Pie",
        "ingredients": [
            "6 tablespoons unsalted butter ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (15 ounce) package double crust ready-to-use pie crust (such as Pillsbury®) ADVERTISEMENT",
            "4 large red apples, cored and thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nMelt butter in saucepan over medium heat. Stir in white sugar, brown sugar, salt, cinnamon, and water. Bring the syrup to a boil, stirring constantly to dissolve sugar, then remove from heat.\nUnroll pie crusts, press one into a 9-inch pie dish, and place the apples into the crust. Unroll the second crust on a work surface, and cut into about 8 1-inch wide strips. Criss-cross the strips over the apples, or weave into a lattice crust. Crimp the bottom crust over the lattice strips with your fingers. Spoon caramel sauce over pie, covering lattice portion of top crust; let remaining sauce drizzle through the crust.\nBake in preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing.\n",
        "picture_link": "T/XGR0HhyULY/xXTJhKKr6yjS.WET/y"
    },
    {
        "title": "Kale Puttanesca",
        "ingredients": [
            "1/2 (16 ounce) package whole-wheat angel hair pasta ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 large onion, sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 tablespoon drained capers ADVERTISEMENT",
            "1 (2 ounce) can anchovy fillets, drained and quartered ADVERTISEMENT",
            "1 cup canned diced tomatoes, undrained ADVERTISEMENT",
            "2 cups coarsely chopped kale ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMeanwhile, heat olive oil in a large skillet over medium-high heat. Add onions, garlic, and red pepper flakes. Cook and stir until the onion has softened and begun to turn golden brown, about 5 minutes. Stir in capers, anchovy fillets, and diced tomatoes, and bring to a simmer. Stir in kale, and simmer over medium-low heat until wilted and tender, about 10 minutes.\nOnce the pasta has cooked and been drained, stir into the puttanesca along with the black olives. Toss and sprinkle with grated Parmesan cheese before serving.\n",
        "picture_link": "MYmHlUdZUJqHg8e0PhzmdURQr.58P7K"
    },
    {
        "title": "Thai Orange Chicken",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 carrots, cut into matchsticks ADVERTISEMENT",
            "1/2 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves, cut into small pieces ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup peanuts ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a large skillet over medium heat; cook and stir carrots, ginger, and garlic until carrots are slightly softened, about 5 minutes. Transfer carrot mixture to a bowl. Add remaining 2 tablespoons olive oil to the same skillet.\nCook and stir chicken in the hot olive oil until no longer pink in the center, about 10 minutes. Add carrot mixture, water, peanuts, orange juice, soy sauce, brown sugar, ketchup, and red pepper flakes to chicken; stir to combine. Cover and simmer until sugar has dissolved, about 5 minutes.\nRemove about 1/4 cup sauce from the skillet; whisk in cornstarch until dissolved and sauce is smooth. Pour cornstarch mixture back into chicken and sauce; cook until sauce is slightly thickened, about 5 more minutes.\n",
        "picture_link": "rQp4m3vgsF2E10p2UoAvj.FD76XCtne"
    }
]