[
    {
        "title": "Dixie Pork Stir-Fry",
        "ingredients": [
            "1 tablespoon oil ADVERTISEMENT",
            "1 Smithfield® Portobello Mushroom Marinated Fresh Pork Loin Filet, cut into thin strips ADVERTISEMENT",
            "1 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 medium sweet yellow onion, thinly sliced ADVERTISEMENT",
            "1 medium red bell pepper, thinly sliced ADVERTISEMENT",
            "1 (10 ounce) package frozen baby cob corn, thawed and drained ADVERTISEMENT",
            "1 (10 ounce) package frozen sliced okra, thawed and drained ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "Hot pepper sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large skillet over medium-high. Stir-fry pork strips, thyme and garlic until pork is browned.\nAdd onion, red pepper, corn and okra; stir-fry until onion is tender-crisp.\nStir in parsley and, if desired, hot sauce.\n",
        "picture_link": "lUqw.SBTHuODZuySIwjc6ZJwSOyjGDC"
    },
    {
        "title": "Parmesan-Crusted Swai Fish",
        "ingredients": [
            "1/4 cup stuffing mix (such as Bell's®) ADVERTISEMENT",
            "1/4 cup ground pecans ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons coconut oil ADVERTISEMENT",
            "3 (4 ounce) fillets swai fish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place stuffing mix in a blender and pulse until crumbly; mix with pecans and Parmesan cheese on a plate.\nCombine cornstarch and flour on a separate plate, mixing with a fork. Beat egg in a shallow bowl.\nPreheat an electric skillet to 375 degrees F (190 degrees C) or over medium-high heat; add coconut oil.\nPat swai fish dry with a paper towel. Press fillets, 1 at a time, in the flour mixture, shaking off excess. Dip each fillet in the egg, allowing excess to drip back onto plate; press into stuffing mixture until evenly coated.\nCook fillets in the hot coconut oil until lightly browned and fish flakes easily with a fork, 5 to 7 minutes per side.\n",
        "picture_link": "sk/F1lVcXcYXLEYp2iQpVUpYoBhqE8O"
    },
    {
        "title": "Kellie's Simple Penne with Pepperoni and Cheese",
        "ingredients": [
            "1 box Barilla® Pronto™ Penne ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 cup diced yellow onion ADVERTISEMENT",
            "1 cup diced pepperoni ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup grated pecorino cheese ADVERTISEMENT",
            "5 basil leaves, torn ADVERTISEMENT",
            "Salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour whole box of pasta into a large skillet (approximately 12 inches in diameter). Pour 1 1/2 cups of cold water and chicken broth into the pan, ensuring that the liquid covers the pasta. Add onion, turn the burner to high, then set your timer for 10 minutes (optional: add a bit of salt to taste).\nCook on high, stirring occasionally, until almost all of the liquid has evaporated.\nWhen pasta is almost done, add pepperoni and garlic; gently cook through.\nRemove from heat and stir in cheese and basil. Serve immediately.\n",
        "picture_link": "2hNyi1ZzWfWC1hPreRHef4UurBoMxq6"
    },
    {
        "title": "Yogurt Cumin Salad Dressing",
        "ingredients": [
            "1/3 cup plain yogurt ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk yogurt, mustard, garlic, cumin, and black pepper together in a bowl. Slowly pour olive oil into mixture while continually whisking until dressing is smooth.\n",
        "picture_link": "pWVYdWJ0s3Hz19oHGCcT/ZHTqborHqO"
    },
    {
        "title": "Sweet Pickle Relish",
        "ingredients": [
            "8 cucumbers, chopped ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 cup pickling salt ADVERTISEMENT",
            "cold water to cover ADVERTISEMENT",
            "2 cups cider vinegar ADVERTISEMENT",
            "1 tablespoon celery seed ADVERTISEMENT",
            "1 tablespoon mustard seed ADVERTISEMENT",
            "3 1/2 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cucumbers, onions, red bell pepper, and green bell pepper in a large bowl; add salt and pour in enough cold water to cover. Allow to soak for 2 hours. Thoroughly drain in a colander.\nPour vinegar into a large, heavy stainless steel pot; add celery seed and mustard seed. Stir sugar into mixture and bring to a boil, stirring until sugar is dissolved, 2 to 3 minutes. Add the drained vegetable mixture and return to a boil, about 10 minutes. Remove pot from heat.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack relish into hot, sterilized jars, filling to within 1/4 inch of the top. Run a clean knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "CmxyRrt8zsjtnrjHFtdBfJf/qLnZsSO"
    },
    {
        "title": "Chef John's Baba Ghanoush",
        "ingredients": [
            "4 large Italian eggplants ADVERTISEMENT",
            "2 cloves crushed garlic ADVERTISEMENT",
            "2 teaspoons kosher salt, or to taste ADVERTISEMENT",
            "1 lemon, juiced, or more to taste ADVERTISEMENT",
            "3 tablespoons tahini, or more to taste ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons plain Greek yogurt ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 leaf fresh mint, minced (optional) ADVERTISEMENT",
            "2 tablespoons chopped fresh Italian parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate. Prick the surface of the skin of eggplants several times with the tip of a knife.\nPlace eggplants directly on grill. Turn frequently with tongs while skin chars. Cook until eggplants have collapsed and are very soft, 25 to 30 minutes. Transfer to a bowl and cover tightly with aluminum foil and allow to cool, about 15 minutes.\nWhen eggplants are cool enough to handle, split them in half and scrape flesh into a colander placed over a bowl. Drain 5 or 10 minutes.\nTransfer eggplant to mixing bowl. Add crushed garlic and salt; mash until creamy but with a little texture, about 5 minutes. Whisk in lemon juice, tahini, olive oil, and cayenne pepper. Stir in yogurt.\nCover bowl with plastic wrap and refrigerate until completely chilled, 3 or 4 hours. Taste to adjust seasonings. Stir in mint and parsley.\n",
        "picture_link": "Oavfr6JU/NjcxaXiV88MXp0YAnwp4Wu"
    },
    {
        "title": "Roulades with Sauerkraut (Vogelsberger Rolle)",
        "ingredients": [
            "1 large dill pickle ADVERTISEMENT",
            "1 1/2 pounds pork loin ADVERTISEMENT",
            "6 strips thick sliced bacon ADVERTISEMENT",
            "1/4 cup German stone ground mustard ADVERTISEMENT",
            "1 (16 ounce) can sauerkraut, drained ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 cups dry bread crumbs ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice the pickle lengthwise into six wedges. Slice pork loin into six thin, wide pieces and lay onto a baking sheet.\nLay a slice of bacon and a slice of dill pickle on one side of each pork loin slice. Divide the mustard and sauerkraut among the pork loin slices. Season with salt and pepper; roll up each slice tightly and secure with toothpicks. Dip each roulade in the beaten egg and then roll in bread crumbs.\nMelt the butter in a skillet over medium heat; drizzle in the olive oil. Cook each roulade until they are golden brown, and a thermometer inserted into the center registers 145 degrees F (63 degrees C), 5 to 7 minutes per side. Remove toothpicks before serving.\n",
        "picture_link": "KbMt.OyW3hntu/bk4vGB3pZwUqiMM5K"
    },
    {
        "title": "Passover Bunuelos",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "3/4 cup cold water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup matzo meal ADVERTISEMENT",
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk together the eggs, water and salt. Add the matzo meal and whisk until smooth. Cover and refrigerate for at least 30 minutes.\nHeat the oil in a large heavy skillet over medium-high heat. Once the oil is hot, drop rounded teaspoonfuls of dough carefully into the oil and cook until golden brown on both sides. Drain briefly on paper towels, then toss in sugar while still warm.\n",
        "picture_link": "gWlb2JxbxSl4eNy7eu9eRVk.AHwCMj6"
    },
    {
        "title": "Tomato-Herb Vinaigrette",
        "ingredients": [
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "2 tablespoons Burgundy wine (optional) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1 tablespoon chopped fresh marjoram ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 tablespoon chopped fresh tarragon ADVERTISEMENT",
            "3 shallots, minced ADVERTISEMENT",
            "1 cup diced tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour vinegar and wine into a glass bowl. Whisk in salt, sugar, and pepper until the sugar has dissolved. Slowly pour the olive oil into the bowl while whisking rapidly to blend together. Stir in garlic, thyme, marjoram, basil, and tarragon; fold in shallots and tomatoes. Store in the refrigerator until serving.\n",
        "picture_link": "UzUMc8YEn0ePnuwiaSLKa4NwTIq8Mfu"
    },
    {
        "title": "Butter Brickle",
        "ingredients": [
            "1/4 (16 ounce) package saltine crackers, crushed ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "1 (16 ounce) package chocolate chips ADVERTISEMENT",
            "1 cup walnuts, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Line a baking sheet with foil and set aside.\nPlace the crushed crackers in a bowl, pour the melted butter over them, and stir gently to coat the cracker pieces with butter. Spread the crackers out on the foil-lined baking sheet, and bake for about 10 minutes, until the crackers have started to brown.\nRemove the sheet from the oven, and sprinkle the chocolate chips in an even layer over the hot crackers. Let the chips melt for about 1 minute, then spread the chocolate evenly over the crackers with a spatula. Sprinkle the walnuts on top.\nLet the candy cool and harden for about 30 minutes, until the chocolate is set. Break the candy into pieces to serve.\n",
        "picture_link": "Hstvhq7Aaz91gdGCNv3XQhTd3wGe5Je"
    },
    {
        "title": "Saleeg",
        "ingredients": [
            "3 pods black cardamom ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "1 medium red onion ADVERTISEMENT",
            "1 (3 1/2) pound chicken, split in half lengthwise ADVERTISEMENT",
            "1 teaspoon dried cilantro ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups long grain white rice ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the chicken, cardamom pods, cinnamon, and whole red onion into a large Dutch oven. Fill with enough water to cover the chicken, and bring to a boil over medium-high heat; boil for 20 minutes. Reserve 4 cups of the resulting chicken stock in a large saucepan.\nRemove the chicken and onion from the Dutch oven and place in a roasting pan. Season the chicken with the dried cilantro, black pepper, and salt; cover with aluminum foil.\nBake the chicken in the preheated oven for 30 minutes, then remove the foil and continue baking until the chicken becomes golden brown.\nMeanwhile, pour the rice in with the reserved chicken stock. Bring the rice to a boil over high heat, stirring occasionally. once it reaches a boil, cover the saucepan and reduce the heat to low, simmer covered for 15 minutes. Stir the milk into the rice and bring the heat back up to medium-low; cook uncovered until no liquid remains. Serve the rice topped with the chicken and onion.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cantaloupe Dressing",
        "ingredients": [
            "1 cup cubed cantaloupe ADVERTISEMENT",
            "1/2 cup low-fat vanilla yogurt ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the container of a blender, combine the cantaloupe, yogurt and sugar. Blend until smooth. Chill or serve immediately.\n",
        "picture_link": "pgpYcknQCaOVRhsFAScwPoNZgfjfq6m"
    },
    {
        "title": "Rhubarb-Infused 'Barbtini",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups thinly sliced rhubarb ADVERTISEMENT",
            "1 1/2 fluid ounces good-quality vodka ADVERTISEMENT",
            "1/2 fluid ounce triple sec liqueur ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the rhubarb syrup, place sugar and water in a saucepan and bring to a boil over high heat, stirring occasionally. Lower heat to medium, and stir the rhubarb into the syrup. Simmer until rhubarb is softened and stringy, 5 to 7 minutes. Press out the juice with a spoon while straining syrup through cheesecloth or strainer into a glass jar or bottle. Discard rhubarb solids. Cool, and refrigerate syrup until needed.\nTo make a 'Barbtini, combine the vodka, 2 tablespoons rhubarb syrup, and triple sec in a shaker with ice. Shake until the outside of shaker is frosty. Strain into a martini glass.\n",
        "picture_link": "/qmipYmQknxMpW.ZeI34MRocwOqxMTm"
    },
    {
        "title": "Pear Conserve with Cherries and Hazelnuts",
        "ingredients": [
            "2 pounds Bosc pears ADVERTISEMENT",
            "1 cup dried cherries ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons grated fresh ginger ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup hazelnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel, core, and cut pears into 1/2 inch cubes. There should be about 4 cups of fruit.\nCombine pears, dried cherries, vinegar, sugar, ginger, pepper, and salt in a heavy large saucepan. Simmer over medium heat until slightly thickened, stirring occasionally, about 25 minutes. Remove from heat, and cool to room temperature. Cover, and refrigerate overnight. Can be prepared 4 days ahead.\nToast hazelnuts at 350 degrees F (175 degrees C) on an ungreased baking sheet for 5 to 8 minutes. Husk the nuts, and chop coarsely. Stir into pear conserve. Serve at room temperature.\n",
        "picture_link": "BaboR7GieH2A3KpEuJnCECQiwQCes2."
    },
    {
        "title": "Michele's Crab and Shrimp Imperial",
        "ingredients": [
            "1 serving cooking spray (optional) ADVERTISEMENT",
            "2 pounds peeled and deveined extra large shrimp ADVERTISEMENT",
            "2 extra large eggs ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "3 dashes hot pepper sauce ADVERTISEMENT",
            "2 teaspoons seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1 tablespoon dried tarragon ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 (6 ounce) cans crabmeat, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat an 8x8 inch baking dish with nonstick cooking spray.\nPlace shrimp in the work bowl of a food processor; pulse until shrimp forms a thick paste. Mix eggs, mayonnaise, mustard, hot pepper sauce, seafood seasoning, dried tarragon, and salt and pepper in a large bowl. Stir in shrimp; carefully fold in crab. Spoon into prepared baking dish.\nBake in preheated oven until lightly browned and heated through, about 30 minutes.\n",
        "picture_link": "1naC7xRcbs/6NOMSz8MAXuYKgAnwQyi"
    },
    {
        "title": "Prom Night",
        "ingredients": [
            "1 fluid ounce vodka ADVERTISEMENT",
            "1 fluid ounce coconut rum ADVERTISEMENT",
            "2 fluid ounces cranberry-raspberry juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure the vodka, rum, and cranberry-raspberry juice into a cocktail shaker. Add a generous scoop of ice, cover and shake until frosty, about 30 seconds. Strain into a martini glass to serve.\n",
        "picture_link": "rAkj9chac7TOy1.mjFkYH1yqt3Jk7ZS"
    },
    {
        "title": "Southwestern Calico Corn",
        "ingredients": [
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 poblano pepper, diced ADVERTISEMENT",
            "1 small red bell pepper, diced ADVERTISEMENT",
            "2 cups fresh corn kernels ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 (14 ounce) can hominy, rinsed (see Ingredient Note) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large nonstick skillet over medium-high heat. Add poblano pepper, bell pepper and corn, and cook, stirring occasionally, until just tender, 3 to 5 minutes. Stir in chili powder, cumin and salt; cook for 30 seconds more. Add hominy and cook, stirring, until heated through, about 2 minutes more.\n",
        "picture_link": "Gf2.rZo7npbGpqpSlP9S7/iDggyM6xa"
    },
    {
        "title": "Sauerkraut on Bread Dough",
        "ingredients": [
            "1 (0.6 ounce) cake compressed fresh yeast ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/3 cup clarified butter, melted ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup bacon, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 tablespoon caraway seed ADVERTISEMENT",
            "ground nutmeg to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (20 ounce) can sauerkraut, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble the yeast into a small bowl. Pour in the sugar and water, and stir with a fork until the yeast has dissolved. Allow to sit for 15 minutes, then stir in the salt and clarified butter.\nPour the flour into a large bowl and make a well in the center. Stir in the yeast mixture, then knead until the dough is smooth and elastic, about 12 minutes. Return dough to the bowl, cover with a cloth, and let rise in a warm place until doubled in bulk, about 1 hour.\nWhile dough is rising, cook bacon in a skillet over medium heat until nearly crispy; drain off fat. Mix together the sour cream, eggs, caraway seed, nutmeg, salt, and pepper in a bowl until smooth. Set aside.\nPreheat oven to 350 degrees F (175 degrees C).\nRoll out the dough into a rectangle to fit a baking sheet. Place the dough onto the baking sheet and sprinkle with bacon. Evenly cover the dough with well drained sauerkraut, then drizzle the sour cream and egg mixture over the sauerkraut.\nBake on the middle rack of the preheated oven for 40 minutes, or until bread is browned on the top and underneath. Let cool slightly, then cut into squares to serve.\n",
        "picture_link": "xllH.9wEpk5akNcg7Z6G/NjgSaXR1q6"
    },
    {
        "title": "Layered Reuben Salad",
        "ingredients": [
            "6 slices pumpernickel bread ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1 cup drained sauerkraut ADVERTISEMENT",
            "8 cups torn lettuce leaves ADVERTISEMENT",
            "1/2 cup sliced green onions ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "3/4 pound deli sliced corned beef, cut into strips ADVERTISEMENT",
            "1 1/4 cups Thousand Island dressing ADVERTISEMENT",
            "3/4 cup shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBrush both sides of the bread with melted butter, then cut into cubes. Place on a baking sheet, and bake in preheated oven until crisp, stirring occasionally, about 15 minutes. Allow to cool to room temperature, then store in an airtight container.\nLayer the sauerkraut, lettuce, tomato, and corned beef in a 9x13 inch dish. Carefully spread dressing over the top. Sprinkle with Swiss cheese. Refrigerate overnight. Top with pumpernickel croutons and serve.\n",
        "picture_link": "p8LyVK.zc7F8e4iktFETnXZL0wcuTdq"
    },
    {
        "title": "Calypso Cooler",
        "ingredients": [
            "1 fluid ounce coconut-flavored rum ADVERTISEMENT",
            "1/2 fluid ounce peach schnapps ADVERTISEMENT",
            "7 fluid ounces orange juice ADVERTISEMENT",
            "1/2 fluid ounce grenadine syrup ADVERTISEMENT",
            "1 orange slice ADVERTISEMENT",
            "2 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the rum, schnapps, and orange juice into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Pour into a chilled glass, pour in the grenadine syrup, and garnish with the orange slice and maraschino cherries to serve.\n",
        "picture_link": "0/1QYJJc9fr7W3.zQtaYhaRmD.0OwmC"
    },
    {
        "title": "Jambalaya Deluxe",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "2 cups diced chicken breast meat ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "5 (3.5 ounce) links mild Italian sausage ADVERTISEMENT",
            "5 (15 ounce) cans Italian-style stewed tomatoes ADVERTISEMENT",
            "4 (16 ounce) cans diced tomatoes ADVERTISEMENT",
            "1 (16 ounce) can tomato paste ADVERTISEMENT",
            "3 tablespoons dry crab and shrimp boil seasoning ADVERTISEMENT",
            "1 pound littleneck clams ADVERTISEMENT",
            "1 pound mussels, cleaned and debearded ADVERTISEMENT",
            "1 pound peeled and deveined medium shrimp (30-40 per pound) ADVERTISEMENT",
            "1 pound bay scallops ADVERTISEMENT",
            "2 (16 ounce) packages angel hair pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium-high heat. Stir in the chicken and garlic, followed by the sausage links. Cook, stirring occasionally, until the sausage is firm enough to slice, about 10 minutes. Slice the sausages into 1/2 inch thick pieces, and return to the pot.\nPuree the stewed tomatoes, diced tomatoes, and tomato paste in batches using a blender. Stir the tomato mixture into the pot along with the shrimp boil. Bring to a simmer and cook for 15 minutes. Stir in the clams, mussels, shrimp, and scallops, then simmer 30 minutes longer. Remove from the heat, and allow to stand for 15 minutes.\nWhile the jambalaya is cooling, bring a large pot of lightly-salted water to a rolling boil; stir in the angel hair pasta and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink. Serve the jambalaya over the cooked pasta.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "OTTERCOON's Beanwiches",
        "ingredients": [
            "4 slices bread ADVERTISEMENT",
            "1 (28 ounce) can baked beans ADVERTISEMENT",
            "1 (12 ounce) can fully cooked luncheon meat (such as SPAM®), cubed ADVERTISEMENT",
            "2 large tomatoes, sliced ADVERTISEMENT",
            "8 slices Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nPlace the bread onto a baking sheet, and broil in the preheated oven until toasted on both sides. Remove and set aside. Meanwhile, place the baked beans in a saucepan, and bring to a boil over medium-high heat. Reduce heat to medium-low, and keep hot.\nHeat a skillet over medium-high heat. Add the luncheon meat, and cook until it begins to brown on the edges, about 5 minutes; pour off any excess grease.\nTo assemble the beanwiches, spoon the beans over the toasted bread slices. Place the luncheon meat on top of the beans, layer with tomato slices, and finish with two slices of Cheddar cheese per sandwich.\nBroil in the preheated oven until the cheese has melted, 1 to 2 minutes.\n",
        "picture_link": "aFUiq6e.dUipANKIgXgjhIgjsM0xUCe"
    },
    {
        "title": "Green Tea Zest",
        "ingredients": [
            "1 fresh pineapple - peeled, cored and cut into chunks ADVERTISEMENT",
            "2 large green apples, washed and sliced ADVERTISEMENT",
            "1 1/4 teaspoons chopped fresh ginger ADVERTISEMENT",
            "1 cup brewed green tea, chilled ADVERTISEMENT",
            "1 cup mango sorbet or crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Juice the pineapple, apples, and ginger in a juice machine. Mix the juice with the tea, and stir in the mango sorbet.\n",
        "picture_link": "BUDWW5TPgsZ.FFXB.YHqDqeaAAO5KoC"
    },
    {
        "title": "Easy Dutch Oven Cheese Lasagna",
        "ingredients": [
            "1 (32 ounce) jar spaghetti sauce ADVERTISEMENT",
            "15 lasagna noodles ADVERTISEMENT",
            "2 cups broccoli florets ADVERTISEMENT",
            "2 cups cauliflower florets ADVERTISEMENT",
            "1 cup green peas ADVERTISEMENT",
            "1 cup corn ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour about 1/2 cup of spaghetti sauce into the bottom of a large, cast-iron Dutch oven with lid. Spread the sauce around evenly.\nPlace down a layer of three lasagna noodles, and spread about 3/4 cup of spaghetti sauce over them. Lay in the broccoli and sprinkle with 2/3 cup of mozzarella cheese. Repeat this layering of noodles, sauce, vegetables, and cheese using the cauliflower, green peas, and corn.\nCover the corn with the last three remaining lasagna noodles, and spread the remaining spaghetti sauce on top. Sprinkle with the Cheddar cheese.\nPlace the lid on the Dutch oven, and place 12 hot coals underneath and 12 coals on top. Cook for 75 minutes or until noodles are soft and tender. Remove the coals, and allow to stand for about 10 minutes to firm up a bit before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Whole-Wheat Couscous with Parmesan and Peas",
        "ingredients": [
            "1 (14 ounce) can reduced-sodium chicken broth ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 teaspoons extra-virgin olive oil ADVERTISEMENT",
            "1 cup whole-wheat couscous ADVERTISEMENT",
            "1 1/2 cups frozen peas ADVERTISEMENT",
            "2 tablespoons chopped fresh dill ADVERTISEMENT",
            "1 teaspoon freshly grated lemon zest ADVERTISEMENT",
            "Salt and freshly ground pepper ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine broth, water and oil in a large saucepan; bring to a boil. Stir in couscous and remove from heat. Cover and let plump for 5 minutes.\nMeanwhile, cook peas on the stovetop or in the microwave according to package directions.\nAdd the peas, dill, lemon zest, salt and pepper to the couscous; mix gently and fluff with a fork. Serve hot, sprinkled with cheese.\n",
        "picture_link": "3DQ2mQomyeOL89P0UtJkZrm9qEtelYq"
    },
    {
        "title": "Macaroni Coleslaw",
        "ingredients": [
            "2 1/2 cups elbow macaroni ADVERTISEMENT",
            "1 medium red or green bell pepper, chopped ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "2 carrots, peeled and finely chopped ADVERTISEMENT",
            "1 cup pineapple chunks, drained, 2 tablespoons of juice reserved ADVERTISEMENT",
            "3 cups finely shredded cabbage ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon Dijon-style mustard ADVERTISEMENT",
            "2 teaspoons apple cider vinegar ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 teaspoon white pepper ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 cup cherry-flavored yogurt ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup fresh shredded coconut ADVERTISEMENT",
            "8 maraschino cherries for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain, and rinse with cold water until chilled. Drain well.\nPlace the macaroni in a large bowl, and toss together with the bell pepper, onion, carrot, pineapple, reserved pineapple juice, and cabbage. Sprinkle with garlic powder, and toss to combine; set aside.\nIn a small bowl, stir together the Dijon mustard, vinegar, oil, white pepper, sugar, and yogurt; season to taste with salt and pepper. Toss the macaroni salad with the dressing, cover, and refrigerate for 1 hour to overnight.\nTo serve, toss the salad again to mix, then pour into a serving bowl. Sprinkle with coconut, and garnish with maraschino cherries.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Finnish-American Flatbread",
        "ingredients": [
            "4 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "3/4 cup coarse whole wheat flour ADVERTISEMENT",
            "3/4 cup coarse whole rye flour ADVERTISEMENT",
            "8 cups bread flour ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the warm water and sugar. Sprinkle the yeast over the top and let stand until foamy, about 5 minutes.\nStir in the salt, whole wheat flour and rye flour. Mix in the bread flour 1 cup at a time until the dough is not sticky. Knead on a floured surface until smooth and elastic, about 10 minutes. Place in an oiled bowl, turning to coat. Set aside to rise until doubled in size, about 1 hour.\nPunch down the dough and divide into 4 or 5 portions. Form each one into a ball, and let rise again until doubled, about 20 minutes.\nPlace each ball onto a baking sheet and flatten out into an oval 1/2 to 3/4 inch thick. Poke holes all over using the tines of a fork. Let rise again until doubled, 20 to 30 minutes. Preheat the oven to 350 degrees F (175 degrees C).\nBake for 20 minutes in the preheated oven, or until browned on the top and bottom. Brush the tops with butter while still warm.\n",
        "picture_link": "vjceuTlSF1GoTDDrWR4QJMRHyCU8KUq"
    },
    {
        "title": "Pumpkin Surprise",
        "ingredients": [
            "1 small pumpkin ADVERTISEMENT",
            "6 potatoes - peeled and cubed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 (15 ounce) can cream-style corn ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut a 4 inch circle off the top of the pumpkin, including the stem; set aside to be used later as a lid. Remove seeds and stringy insides of pumpkin. Place pumpkin in a 9x13 inch baking dish. Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to a boil. Add potatoes and cook until tender, about 15 minutes. Drain, and mash. Season with salt, pepper and garlic powder; set aside.\nIn a skillet over medium heat, brown the ground beef until no pink shows; drain. Spoon the ground beef into the pumpkin. Pour in the creamed corn and whole kernel corn. Top with mashed potatoes. Cover with pumpkin lid. Pour 2 cups of water in the baking dish.\nBake in preheated oven for 50 to 60 minutes, or until pumpkin is tender and can be pierced with a fork.\n",
        "picture_link": "FvuOM7EFZmZ0etR6UbWPzN90iL.WTRW"
    },
    {
        "title": "Sweet Split Pea Soup",
        "ingredients": [
            "1 pound green split peas ADVERTISEMENT",
            "2 (14.5 ounce) cans beef broth ADVERTISEMENT",
            "1 head roasted garlic, mashed into a paste ADVERTISEMENT",
            "1 cup grated carrot ADVERTISEMENT",
            "1 large onion, grated ADVERTISEMENT",
            "1 1/2 tablespoons curry powder ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 tablespoons hoisin sauce ADVERTISEMENT",
            "1/2 teaspoon salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak peas overnight in ample water. Drain before using in the recipe.\nPour peas and beef broth into a large saucepan. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until peas begin to soften, about 30 to 45 minutes. Stir in roasted garlic, carrot, onion, curry powder, clove, and hoisin sauce. Simmer covered, stirring occasionally for an additional 30 to 45 minutes, adding water as needed while it cooks. Season to taste with salt and pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lingonberry Jam",
        "ingredients": [
            "2 1/4 pounds fresh lingonberries ADVERTISEMENT",
            "7/8 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lingonberries in a large pot with the water and bring to a boil. Boil for 5 to 10 minutes, and skim off any foam from the surface. Stir in sugar, bring to a rapid boil, and continue boiling for a few more minutes.\nLadle jam into sterile jars, leaving 1/4 inch of headspace. Cover with lids, and screw on rings. Process in a hot water bath for 10 minutes to seal. Refrigerate jam once the jar has been opened.\n",
        "picture_link": "mph8lFhq0hb1e8gkBjw6frqLMy81jKC"
    },
    {
        "title": "Roasted Pear Mango Chutney",
        "ingredients": [
            "2 firm green pears - peeled, cored and halved ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "2 cups diced green (under ripe) mango ADVERTISEMENT",
            "1 small red onion, chopped ADVERTISEMENT",
            "1 green chile pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1/2 cup dried sour cherries ADVERTISEMENT",
            "3/4 cup cider vinegar ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Oil a baking sheet.\nToss the pear halves in a bowl with the lemon juice, cinnamon, and 1 tablespoon of brown sugar. Place cut side down on prepared baking sheet. Brush pears with oil. Roast until caramelized and tender, 40 to 50 minutes. Remove from oven and let cool.\nMeanwhile, mix together 1/4 cup brown sugar, maple syrup, mango, red onion, chili, garlic, ginger, dried cherries, cider vinegar, and cayenne pepper in a non-reactive saucepan. Bring to a boil, then reduce heat and simmer uncovered until liquid thickens to a syrup-like consistency and mangoes look translucent, 35 to 40 minutes. Remove from heat and let cool.\nCoarsely chop pears and combine with the mango mixture. Cover and refrigerate 24 hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Marsha's Garoni",
        "ingredients": [
            "2 slices bologna ADVERTISEMENT",
            "1 (7.25 ounce) package macaroni and cheese mix ADVERTISEMENT",
            "1 (.75 ounce) packet dry brown gravy mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare macaroni and cheese mix according to package directions. In a separate pan, prepare brown gravy mix according to package directions. Place bologna slices in a skillet over medium-high heat, and fry until the edges are crispy. Cut bologna into small pieces. Mix brown gravy and bologna into macaroni and cheese, and serve immediately.\n",
        "picture_link": "fNaGLkKGMmq7I5y9GXAn9sZLma3GyCm"
    },
    {
        "title": "Korean Tofu and Vegetable Soup",
        "ingredients": [
            "3 cups beef stock ADVERTISEMENT",
            "1/4 cup toenjang (fermented soybean paste) ADVERTISEMENT",
            "1 (4 inch) piece dashi kombu (dried kelp) (optional) ADVERTISEMENT",
            "5 cloves garlic, chopped ADVERTISEMENT",
            "1 (16 ounce) package medium-firm tofu, cut into 1 1/2 x 1/4 inch dominoes ADVERTISEMENT",
            "1 pound napa cabbage, thickly sliced ADVERTISEMENT",
            "1 pound daikon radish cut into 1 1/2x1/4 inch pieces ADVERTISEMENT",
            "1 pound yellow squash, cut into 1 1/2x1/4 inch dominoes ADVERTISEMENT",
            "2 large green onions, white and pale green part only, sliced diagonally into 1 1/4 inch pieces ADVERTISEMENT",
            "1 hot red pepper, seeded and sliced diagonally into 1/4 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the beef stock into a stock pot or large deep skillet over medium-high heat. Stir in the toenjang until dissolved. Add the kelp and garlic, and bring to a boil. Put in the tofu, cabbage, daikon and yellow squash, cover and return to a boil. Cook gently for 5 minutes. Then add the green onions and hot pepper, and boil for a minute, or until the onion and pepper become fragrant and brightly colored. Limit the cooking time to no more than 15 minutes. Remove and discard kelp. Serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Forgotten Mint Meringue Surprises",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon peppermint extract ADVERTISEMENT",
            "1/4 teaspoon green food coloring ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "30 milk chocolate candy kisses (such as Hershey's Kisses®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet.\nCombine egg whites, cream of tartar, salt, vanilla extract, peppermint extract, and green food coloring in a large bowl. Use an electric mixer to beat until soft peaks form.\nBeat sugar into egg whites one tablespoon at a time. Continue to beat until stiff peaks form, and mixture is glossy and very smooth, 4 to 5 minutes.\nDrop the meringue by half teaspoons onto prepared cookie sheet; top with chocolate kisses. Spoon a scant teaspoon of meringue over chocolate, and smooth to cover completely.\nPlace cookies in the preheated oven; turn oven off. Leave meringues in oven overnight, or until oven has cooled completely.\n",
        "picture_link": "GnJv0GsY9v/bvWB1U6CkLZWQeqNb1zC"
    },
    {
        "title": "Cracklin' Bread II",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "3 tablespoons shortening or bacon fat ADVERTISEMENT",
            "1 1/8 cups buttermilk ADVERTISEMENT",
            "1 1/4 cups cornmeal ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup crushed pork cracklin's ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (220 degrees C). Grease a 9x9 inch square baking dish.\nIn a medium bowl, mix together the egg, shortening and buttermilk. In a separate bowl, stir together the cornmeal, sugar, flour, baking soda, baking powder and salt. Stir the dry ingredients into the wet ingredients until smooth, then stir in the pork cracklin's. Pour the batter into the prepared baking dish.\nBake for 25 to 30 minutes in the preheated oven, until center is set and the top is slightly brown.\n",
        "picture_link": "Li8nPJOu9TVOkD7yUiJ2cpykwRYj7lm"
    },
    {
        "title": "Witlof with Ham",
        "ingredients": [
            "4 medium heads Belgian endive ADVERTISEMENT",
            "4 (1/2 ounce) slices prosciutto ADVERTISEMENT",
            "1 cup grated Gruyere cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill to medium heat. When the grill is ready, lightly brush the grate with oil.\nPlace the endive in a shallow baking dish with 1/4 cup of water. Cover with plastic wrap, and microwave for 2 minutes, or until slightly tender. Remove from dish, and pat dry.\nWrap each whole endive with prosciutto, and pierce with a toothpick to secure. Place each piece directly on grill and cook, turning occasionally, until ham is browned and endive is tender, approximately 3 minutes.\nPlace in a disposable foil baking dish, and sprinkle with the cheese. Return to the grill, cover, and continue cooking until cheese has melted.\n",
        "picture_link": "3GRo..nZr0BjMnFwYhNyICU90s2pqzm"
    },
    {
        "title": "Champagne Cocktail",
        "ingredients": [
            "1 quart vanilla ice cream ADVERTISEMENT",
            "1 quart prepared lemonade ADVERTISEMENT",
            "1 (750 milliliter) bottle champagne ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the softened ice cream into a punch bowl. Pour in lemonade and champagne. Stir briefly then serve.\n",
        "picture_link": "7xkhTrKOakIfu0Q.c87sOty7Q./vECu"
    },
    {
        "title": "Three Greens and Fruit with Vinaigrette",
        "ingredients": [
            "6 tablespoons white wine vinegar ADVERTISEMENT",
            "6 tablespoons vegetable oil ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 dashes hot pepper sauce ADVERTISEMENT",
            "3/4 teaspoon ground black pepper to taste ADVERTISEMENT",
            "1/2 cup coarsely chopped walnuts ADVERTISEMENT",
            "1 head romaine lettuce, torn ADVERTISEMENT",
            "1 head butter lettuce, torn ADVERTISEMENT",
            "2 bunches fresh spinach leaves ADVERTISEMENT",
            "2 pears, cored and sliced ADVERTISEMENT",
            "1 (4 ounce) package feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the vinegar, oil, onion, sugar, salt, hot sauce, and pepper. Cover and refrigerate 1 hour.\nIn a skillet over medium heat, cook the walnuts, stirring constantly, until lightly toasted.\nIn a large bowl, mix the walnuts, romaine lettuce, butter lettuce, spinach, and pears. Toss with the dressing mixture to coat. Sprinkle with feta cheese to serve.\n",
        "picture_link": "xGxUABwUcMuI9o6yhMPonOxN6OlIBVW"
    },
    {
        "title": "Fresh Bratwurst Wisconsin Style",
        "ingredients": [
            "1 1/2 pounds pork butt, fat trimmed and reserved ADVERTISEMENT",
            "1 pound veal ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 1/2 teaspoons coarsely ground black pepper ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "2 teaspoons mustard seed ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/4 cup cold milk ADVERTISEMENT",
            "2 cups grated raw potatoes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the pork butt, veal, and fat into 1 inch cubes. Spread on a plate, and place in the freezer for 10 minutes to make it easier to chop. Place food processor bowl and blade in the freezer as well for the same amount of time.\nSet up the food processor and add just enough meat to cover the blade. Pulse to form chunks about 3/8 inch in size. Repeat with remaining meat. Process the fat into smaller pieces, about 1/4 inch, and mix it with the meat.\nPut the chopped meat and fat into a large bowl. Season with salt and pepper, sugar, mustard and mustard seed, nutmeg, and sage. Pour in cold milk, and add grated potatoes if desired. Mix together with your hands.\nMake a small patty of the sausage mixture, and fry it in a small pan over medium heat. Taste, and adjust seasonings of the sausage mix if necessary. Cover bowl, and refrigerate for 8 hours to improve flavor before cooking as desired.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Home Made Souse",
        "ingredients": [
            "2 beef tongues ADVERTISEMENT",
            "4 pig's ears ADVERTISEMENT",
            "2 pig's feet ADVERTISEMENT",
            "4 onions, chopped ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "15 whole black peppercorns ADVERTISEMENT",
            "3 tablespoons dried sage ADVERTISEMENT",
            "15 whole cloves ADVERTISEMENT",
            "4 bay leaves ADVERTISEMENT",
            "2 tablespoons pickling spice ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "3 cups distilled white vinegar ADVERTISEMENT",
            "2 pimentos, julienned ADVERTISEMENT",
            "6 pepperoncini peppers, chopped ADVERTISEMENT",
            "4 tablespoons dill pickle relish ADVERTISEMENT",
            "5 tablespoons unflavored gelatin ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tongues, pig's ears, pig's feet, and onions in a large stock pot; add water to cover. Season with salt, pepper, whole peppercorns, sage, cloves, bay leaves, pickling spice, garlic powder and vinegar. Bring to a boil, and cook until meat is cooked, about 2 1/2 hours.\nRemove meat; set aside to cool. Strain broth, and measure 8 cups into another pot. Return broth to stove, and let simmer.\nPeel skin from ears, leaving the ear as intact as possible. Place the ears aside. Remove gristle and fat from pig's feet, and combine with ear trimmings. Cut off large portion of tongue and set aside. Trim loose meat from remainder of tongue, and combine with other trimmings. Put trimmings through a coarse meat grinder, then stir into broth; continue to simmer.\nSlice tongues into thin strips, and place lengthwise into 2 glass loaf pans, 9x5x3 inches. Slice ears into thin strips, then cut the strips into 1/2 inch pieces. Arrange the ear pieces among the tongue strips. Divide the pimiento and pepperoncini between the two molds. Sprinkle with pickle relish.\nDissolve gelatin in 1 cup water. Stir into the simmering broth. Carefully ladle enough broth into each mold to completely cover the meat. Prod with a fork to uniformly distribute. Let stand 15 minutes, then cover with remaining broth. Allow to cool at room temperature, until they begin to jell, 2 to 3 hours. Refrigerate for 8 to 10 hours.\nWhen cool, run a thin knife around the sides of the mold to release the souse. Remove any fat that has accumulated on the surface.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Back to the Basics Smoothie",
        "ingredients": [
            "1 (11 ounce) can mandarin oranges, frozen ADVERTISEMENT",
            "1 banana, frozen and chunked ADVERTISEMENT",
            "1 frozen Gala apple, peeled, cored and chopped ADVERTISEMENT",
            "1 (12 ounce) package tofu ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine mandarin oranges, banana, apple and tofu. Pour in orange juice. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "z2OTKdDhicEY7xZH/4rqV6hjzcteHO6"
    },
    {
        "title": "Texas Tea II",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger Kentucky bourbon ADVERTISEMENT",
            "1/2 fluid ounce triple sec liqueur ADVERTISEMENT",
            "1/2 cup prepared lemonade ADVERTISEMENT",
            "2 fluid ounces chilled lemon-lime soda per serving ADVERTISEMENT",
            "1 wedge lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine . Blend until smooth. Pour into glasses and serve.\nIn a cocktail mixer, combine whiskey, triple sec, lemonade and lemon-lime soda. Shake until mixed, then pour into a Collins glass filled with ice. Garnish with lemon wedge.\n",
        "picture_link": "pW0AszeatHkggbC7WPZ40JBfYEeliuK"
    },
    {
        "title": "Sherbet Cooler",
        "ingredients": [
            "1 pint rainbow sherbet ADVERTISEMENT",
            "1 cup sparkling grape juice, cold ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill 4 goblets with rainbow sherbet, and cover with sparkling grape juice. Allow bubbles to settle, and fill glass again. Serve immediately.\n",
        "picture_link": "8hcLHfTAzrVZXoJU0SU0xmtWElzX7oy"
    },
    {
        "title": "Eggs BenaBabs",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "4 artichokes, uncooked and trimmed to the heart ADVERTISEMENT",
            "1 recipe Hollandaise Sauce ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup black olives, sliced ADVERTISEMENT",
            "1/2 cup chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring olive oil, 1 tablespoon vinegar, and water to boil in a large pot. Place artichoke hearts in the mixture, and boil 30 minutes, or until tender; drain.\nPrepare Hollandaise Sauce according to recipe directions.\nFill a large saucepan with 3 inches of water. Bring water to a gentle simmer, and add remaining vinegar. Carefully break eggs into simmering water, and allow to cook for 3 to 5 minutes. Yolks should still be soft in center. Remove eggs from water with a slotted spoon and set on a warm plate.\nPlace artichoke hearts on a serving platter. Place a poached egg on top of each artichoke heart. Cover with hollandaise sauce. Sprinkle olives on top of sauce. Sprinkle chives around platter.\n",
        "picture_link": "latGXK2C..8WHtDilqlmMKKRvGMCmPq"
    },
    {
        "title": "World's Easiest Spinach Spread",
        "ingredients": [
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "8 ounces fresh baby spinach ADVERTISEMENT",
            "1 whole head garlic, peeled ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Wrap garlic cloves in aluminum foil, and bake for 45 minutes, or until soft.\nBring 3 inches of water to a boil in a large saucepan. Add spinach, cover, and cook for about 2 minutes, just until wilted and soggy. Remove from heat and drain.\nMix the garlic, spinach, olive oil, and Romano cheese. In small batches, use a food processor to process to your desired consistency. Transfer to a serving dish.\n",
        "picture_link": "Ad8o9QvEv8W9vM.d0wlw8x.d92EVz3O"
    },
    {
        "title": "Green Chili and Corn Dip",
        "ingredients": [
            "1 1/2 cups whole peeled tomatoes, drained and chopped ADVERTISEMENT",
            "1/4 cup whole kernel corn, drained ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 (16 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, mix tomatoes, corn, milk and flour. Cook and stir until thick and bubbly, about 10 minutes. Gradually blend in Cheddar cheese and diced green chile peppers. Continue cooking until cheese has melted, about 10 minutes. Serve warm.\n",
        "picture_link": "qRTUK2C0HsNXQ7G.rN/xIuQLHze6sOe"
    },
    {
        "title": "Roasted Garlic Soup with Thyme Croutons",
        "ingredients": [
            "4 whole heads garlic ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (8 ounce) loaf French bread, cubed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Coat the heads of garlic with 1 tablespoon of olive oil, and place them in a baking dish or on a cookie sheet. Bake for about 40 minutes, or until golden brown.\nWhile the garlic is roasting, stir together 2 tablespoons of olive oil, 1 tablespoon of thyme, salt and pepper in a medium bowl. Add the bread cubes, and stir to coat. Spread the cubes out on a baking sheet. Bake for about 10 minutes in the oven with the garlic, or until golden brown. Stir occasionally for even toasting.\nOnce the garlic is roasted, cut the heads in half horizontally, so that all of the cloves are exposed. Squeeze both halves to release the roasted cloves into a medium bowl. Pick out any pieces of skin that fall in.\nIn a large saucepan, combine the roasted garlic, milk, cream and thyme. Bring to a simmer over medium heat. Simmer for 10 minutes, then puree in a blender. Strain through a sieve back into the pan. Season with salt and pepper. Ladle into bowls, and top with croutons to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Argentine Corn Pie",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "2 cups frozen corn ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3/4 cup onion, chopped ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nPlace 1 egg into a saucepan cover with water by 1 inch. Cover the saucepan and bring the water to a boil. Once the water is boiling, immediately remove from the heat and let the egg stand in the hot water for 15 minutes. Pour out the hot water and cool the egg under cold running water in the sink; peel and chop the egg. Meanwhile, bring a saucepan of water to a boil. Stir in the corn and return to a boil. Cook for 2 minutes; strain and set aside to cool.\nHeat the vegetable oil in a saucepan over medium heat. Stir in the onion, and cook until the onion has softened and turned translucent, about 5 minutes. Pour the milk into the saucepan and whisk in the cornstarch. Add the butter, nutmeg, salt, and pepper. Bring to a simmer whisking constantly, then cook for 2 minutes until the butter has melted and the sauce has thickened. Stir in the hard boiled egg and corn; pour into the pie crust. Brush the crust with the beaten egg.\nBake in the preheated oven until the crust and the pie are golden brown, about 25 minutes.\n",
        "picture_link": "iK8KpI3OWCqacVCe4BBSPcyPqE03Y76"
    },
    {
        "title": "Shrimp Ceviche with Coconut Milk",
        "ingredients": [
            "1 lemon, halved and seeded ADVERTISEMENT",
            "1 head garlic, halved ADVERTISEMENT",
            "3 Turkish bay leaves ADVERTISEMENT",
            "8 whole black peppercorns ADVERTISEMENT",
            "1 tablespoon kosher salt, or to taste ADVERTISEMENT",
            "1 1/2 pounds peeled and deveined large shrimp (21 to 25 per lb) ADVERTISEMENT",
            "2 cups coconut milk ADVERTISEMENT",
            "1/2 cup lime juice ADVERTISEMENT",
            "2 serrano chile peppers, thinly sliced ADVERTISEMENT",
            "1/2 bunch cilantro, chopped ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "8 sprigs cilantro, for garnish ADVERTISEMENT",
            "1 lime, cut into 8 wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Squeeze the lemon halves into a large pot, and toss in the halves. Add the garlic, bay leaves, peppercorns, and salt, then fill with water to half full. Bring to a boil over high heat, then stir in the shrimp, and turn off the heat. Allow the shrimp to poach until they are no longer translucent in the center, 3 to 5 minutes. Drain in a colander in the sink, then place the shrimp on a baking sheet, and refrigerate until cold, about 30 minutes.\nStir the coconut milk, lime juice, serrano peppers, chopped cilantro, and onion together in a non-metallic bowl; season with salt to taste. Cut the chilled shrimp in half lengthwise and stir into the coconut marinade. Cover and refrigerate 30 minutes before serving. Garnish individual servings with the cilantro sprigs and lime wedges.\n",
        "picture_link": "h9Re9fBJDMPZXel8AaG65ZUduspoiiW"
    },
    {
        "title": "Jet Tila's Tom Yum Goong Soup",
        "ingredients": [
            "6 whole Thai chiles ADVERTISEMENT",
            "2 quarts Thai chicken broth ADVERTISEMENT",
            "1 cup peeled and deveined medium shrimp ADVERTISEMENT",
            "1 (15 ounce) can whole straw mushrooms, drained ADVERTISEMENT",
            "6 tablespoons fish sauce ADVERTISEMENT",
            "6 tablespoons lime juice ADVERTISEMENT",
            "3 tablespoons Thai garlic chile paste ADVERTISEMENT",
            "6 kaffir lime leaves ADVERTISEMENT",
            "6 sprigs fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil. Place the peppers onto the prepared baking sheet.\nCook under the preheated broiler, turning occasionally until the skin of the peppers has blackened and blistered, about 5 minutes. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove and discard the skin, seeds, and stem. Chop the roasted chiles.\nPour the chicken broth into a large pot, and bring to a simmer over medium-high heat. Stir in the shrimp, mushrooms, and chopped roasted chiles. Return to a simmer, and cook until the shrimp are no longer translucent in the center, about 1 minute. Stir in the fish sauce, lime juice, and chile paste until the chile paste has dissolved. Ladle into bowls, and garnish each bowl with a lime leaf and a sprig of cilantro.\n",
        "picture_link": "Wv5v0y.ubTsebGdVBimPsP5C4NfaRJm"
    },
    {
        "title": "Almond Gelatin with Mandarin Oranges",
        "ingredients": [
            "2/3 cup white sugar ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 (.25 ounce) packages unflavored gelatin (such as Knox ®) ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "1 (11 ounce) can mandarin orange segments, undrained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the sugar into the milk in a mixing bowl until dissolved. Sprinkle the gelatin over top, and let stand for 1 minute to soften. Whisk the boiling water and almond extract into the gelatin mixture until the gelatin has dissolved. Pour into a 7-inch square pan. Refrigerate until firm, about 4 hours.\nOnce firm, cut the gelatin into 1-inch squares, and place into a mixing bowl. Gently stir in the mandarin oranges and their juice to serve.\n",
        "picture_link": "zKejJ09OsrTyNDjXiUe/KG24mxxEAhy"
    },
    {
        "title": "Auntie Anita's Lobster Stew",
        "ingredients": [
            "2 (1 pound) Maine lobsters ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 quart whole milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil over high heat. Add the lobsters; boil until the lobsters turn bright red and the claws are easily pulled off, 12 to 14 minutes. Once done, remove with a pair of tongs, and allow to cool until cool enough to handle.\nSplit the lobsters in half lengthwise. Remove and reserve the green tomalley (liver), the red coral (eggs), and the thick white substance from inside the claws. Melt the butter in a large saucepan over medium heat. Stir in the reserved tomalley and coral. Cook and stir for 8 minutes, breaking up the tomalley.\nRemove the meat from the claws and tail. Remove the black vein from the tail, cut the meat into bite sized pieces, and add to the tomalley. Reduce the heat to low; cook for 10 minutes, stirring frequently. Pour the milk into the saucepan a trickle at a time, stirring constantly, until the stew is thick, hot, and has blossomed into a rich salmon color.\nPlace the stew in the refrigerator, and let stand 5 to 6 hours. This is one off the secrets of truly fine flavor. It's called aging. Once the stew has aged, return to the stove over medium-low heat, and cook until hot. You do not need salt or pepper when the stew is prepared in this manner.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Watermelon Granita with Champagne",
        "ingredients": [
            "2 pounds watermelon, seeded and cubed ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup champagne ADVERTISEMENT",
            "4 slices watermelon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cubed watermelon and sugar in the pitcher of a blender. Blend for 1 minute. Stir in the champagne. Pour the watermelon mixture into a plastic container, cover and place in the freezer. Stir the mixture with a fork every 30 minutes until frozen, about 2 hours.\nBefore serving, remove the frozen granita from the freezer and stir well using a fork or place in the food processor and process until it reaches the desired consistency. Serve in tall glasses garnished with sliced watermelon.\n",
        "picture_link": "t.GRBAUttQTQzmCtWimul/R5tDVSWg6"
    },
    {
        "title": "Bow Tie Pasta with Tomato Tuna Sauce",
        "ingredients": [
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup whole wheat bread crumbs ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 (15 ounce) can canned beans ADVERTISEMENT",
            "1 (5 ounce) can tuna, drained ADVERTISEMENT",
            "2 cups tomato sauce ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nBring a large pot of lightly salted water to a boil over high heat. Stir in the pasta and boil until cooked through, but still firm to the bite, about 12 minutes. Drain well.\nHeat the olive oil in a large skillet. Toast bread crumbs in oil, about 2 minutes. Season with salt and pepper; stir in lemon zest. Remove seasoned bread crumbs from skillet and drain on paper towels.\nPlace the skillet back over medium heat. Add the beans, and mash. Stir in the tuna, tomato sauce, and 1/4 cup of the Parmesan cheese. Reduce heat to a simmer and cook for 10 to 15 minutes.\nToss sauce with prepared pasta; place in prepared baking dish. Top with the toasted bread crumbs and remaining 1/2 cup Parmesan cheese. Bake in preheated oven until the cheese melts, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Thai Chicken Stock",
        "ingredients": [
            "1 chicken carcass ADVERTISEMENT",
            "3/4 cup thinly sliced galangal ADVERTISEMENT",
            "2 kaffir lime leaves, or to taste ADVERTISEMENT",
            "2 stalks lemon grass, crushed ADVERTISEMENT",
            "2 chopped Thai chiles, or to taste ADVERTISEMENT",
            "2 cloves peeled garlic ADVERTISEMENT",
            "1 shallot, sliced ADVERTISEMENT",
            "10 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken carcass into a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, and simmer for 5 minutes. Drain, and rinse the carcass under running water. Return the carcass to the pot along with the galangal, lime leaves, lemon grass, chile peppers, garlic, and shallot. Pour in 10 cups of water.\nReturn to a boil over high heat, then reduce heat to medium-low. Simmer uncovered for 1 1/2 hours, skimming the foam and fat often. Strain through cheesecloth before using.\n",
        "picture_link": "6rtzpLfDg1A1ETbFnFhWRJS3153t17K"
    },
    {
        "title": "Orange-Soy Sauce Reduction",
        "ingredients": [
            "2 oranges, juiced ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the orange juice, soy sauce, chicken stock, and orange zest to a boil in a saucepan. Reduce heat to medium-low and simmer until the sauce has reduced to half of its original volume, about 30 minutes.\n",
        "picture_link": "sN0VXETxxBe2mknLETbJBkcjvGzWlIm"
    },
    {
        "title": "Crawfish Michelle",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "3 large shallots, minced ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "1 1/2 cups heavy cream ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 1/2 teaspoons prepared horseradish ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon paprika, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/3 cup chopped green onion ADVERTISEMENT",
            "1 (16 ounce) package cooked and peeled whole crawfish tails ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Grease a 2-quart casserole dish with cooking spray.\nMelt 2 tablespoons of butter in a saucepan over medium heat. Stir in the chopped onion and shallots; cook and stir until the onion has softened and turned translucent, about 5 minutes. Pour in the chicken stock and bring to a boil over high heat. Reduce heat to medium and simmer until the chicken stock has reduced to half its original volume, about 5 minutes. Pour in the heavy cream; whisk in the Dijon mustard, horseradish, cayenne pepper, paprika, salt, and pepper. Bring to a simmer and cook 3 to 5 minutes, stirring occasionally.\nWhile the sauce is cooking, melt 3 tablespoons of butter in a skillet over medium heat. Stir in the garlic and green onions; cook and stir until the aroma of the garlic has mellowed, about 5 minutes. Add the crawfish tails and cook until hot. Stir the crawfish mixture into the sauce along with the Parmesan cheese. Pour into the prepared casserole dish and sprinkle with bread crumbs.\nCook under the preheated broiler until the bread crumbs are golden brown. Let stand for a few minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Creme Fraiche Ice Cream",
        "ingredients": [
            "6 (1 ounce) squares bittersweet chocolate, chopped ADVERTISEMENT",
            "1 cup 2% milk ADVERTISEMENT",
            "2 cups creme fraiche ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the chocolate and milk together in a blender on high until smooth; add the creme fraiche, sugar, maple syrup, and vanilla extract. Blend again until the sugar has dissolved.\nPour the mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Transfer ice cream to a lidded plastic container; cover surface with plastic wrap and seal. For best results, ice cream should ripen in the freezer at least 2 hours or overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Monaco",
        "ingredients": [
            "4 fluid ounces amber beer ADVERTISEMENT",
            "2 fluid ounces lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "1/4 teaspoon grenadine syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the beer, soda, and grenadine syrup in a tall glass. Stir and serve.\n",
        "picture_link": "aWvWC4BuWJZU7.r.50PIec7TsR58GaW"
    },
    {
        "title": "Dolce Pesca (Sweet Peaches)",
        "ingredients": [
            "4 fresh figs ADVERTISEMENT",
            "1/2 cup pine nuts ADVERTISEMENT",
            "4 peaches, halved and pitted ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "1/2 cup brandy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Line a baking sheet with foil.\nPlace the figs and pine nuts in the bowl of a food processor and pulse until fine. Place the halved peaches onto the prepared baking sheet, cut side up. Sprinkle evenly with the white sugar. Pour the white wine over the peaches, and stuff them with the fig mixture. Pour the brandy over the peaches.\nBake in the preheated oven until browned, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ultimate Mashed Potatoes",
        "ingredients": [
            "5 pounds red potato, cut into chunks ADVERTISEMENT",
            "1/2 cup carrots, cut into 1 inch pieces ADVERTISEMENT",
            "4 cloves garlic, halved ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon dried thyme leaves ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons barbeque sauce (such as Sweet Baby Ray's®) ADVERTISEMENT",
            "1 cup hot popcorn chicken ADVERTISEMENT",
            "2 cups hot milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes, carrots, and garlic into a large pot and cover with water. Season with salt, black pepper, paprika, onion powder, thyme, basil, oregano, and marjoram. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\nReturn the potatoes to the pot, and mash until smooth. Fold in the butter, Cheddar cheese, Worcestershire sauce, barbeque sauce, and popcorn chicken until the cheese has melted. Stir in the hot milk until absorbed and serve.\n",
        "picture_link": "zYxR.70zXp60M/TVo5aonnUhhJJyBNq"
    },
    {
        "title": "Frosted Strawberries",
        "ingredients": [
            "2 pints whole fresh strawberries ADVERTISEMENT",
            "1 cup roasted peanuts, finely chopped ADVERTISEMENT",
            "1 (16 ounce) container cream cheese frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and pat dry the strawberries with paper towels, leaving the green caps and stems intact.\nLine a baking sheet with parchment or waxed paper, and set aside. Place the finely chopped peanuts in a bowl, and set aside.\nHeat the frosting in the microwave until warm and melted, 20 to 40 seconds. Hold each strawberry by the green top, and dip it straight down into the warm frosting, coating about 3/4 of the berry.\nGently roll the dipped strawberry in chopped peanuts, and place on the lined baking sheet to set up. Serve as soon as they have set.\n",
        "picture_link": "v8eeLPtxTFxuhO43uBn.0N4.OwpRdZ."
    },
    {
        "title": "Petey's Squares",
        "ingredients": [
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the graham cracker crumbs, confectioners' sugar and peanut butter. Press into the bottom of a 9x13 inch baking pan. Melt chocolate chips in the microwave or over a double boiler. Spread over the bottom layer and sprinkle with chopped nuts (if desired). Chill for 20 to 30 minutes, then cut into squares. Do not chill for too long or the top will crack when cutting which is not as attractive.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hamburger Pie I",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 medium slice yellow onion, diced ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 (15 ounce) cans mixed vegetables ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 (10 ounce) package refrigerated biscuit dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCrumble ground chuck into a large skillet and saute over medium heat for 2 minutes. Add onion, and saute until meat is no longer pink and onion is beginning to brown. Drain grease.\nIn a large bowl, mix together cream cheese, vegetables, cream of celery soup, and ketchup. Add hamburger and stir until ingredients are thoroughly combined. Spread mixture evenly into a large casserole dish. Place biscuit dough on top, allowing room for biscuits to spread without touching.\nBake in preheated oven for 30 minutes, until biscuits are browned and fluffy.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shredded Roast Spaghetti Sauce",
        "ingredients": [
            "4 pounds bone-in pork roast ADVERTISEMENT",
            "3 teaspoons salt ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 cups hot water ADVERTISEMENT",
            "3 cloves crushed garlic ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon Italian-style seasoning ADVERTISEMENT",
            "1/4 teaspoon monosodium glutamate (MSG) ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon dried rosemary, crushed ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "4 (6 ounce) cans tomato paste ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "1 cup fresh sliced mushrooms ADVERTISEMENT",
            "8 anchovy fillets, mashed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season pork roast with salt to taste; dredge in flour. Heat oil in a large pot. Brown roast slowly, on all sides, in hot oil. Add hot water; cover and cook slowly for 3 hours or until meat almost falls apart. Tear meat into small pieces with a fork.\nTo pot add the garlic, onion, bay leaves, celery salt, black pepper, sugar, chile pepper, seasoning, monosodium glutamate, oregano, basil, parsley, rosemary, nutmeg, tomato paste, water, wine, olives, mushrooms and anchovy fillets (if desired). Stir together, cover pot tightly and let simmer over low heat for 2 hours, stirring occasionally. Remove cover and continue cooking until sauce thickens to desired consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raisin Peanut Bars",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup salted peanuts ADVERTISEMENT",
            "1/3 cup peanut butter ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together the sugar and margarine. Stir in the molasses, vanilla and egg yolk. Add flour, mix until combined. Press dough into the bottom of a 9x13 inch baking pan. Bake for 20 to 25 minutes, until golden brown.\nIn a 2 quart saucepan, combine raisins, peanut butter and chocolate chips. Melt over medium-low heat, stirring constantly. Spread evenly over the baked crust, and refrigerate until set, about 1 to 2 hours. Cut into 1x2 inch bars and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caribbean Fudge Pie IV",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "8 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "2 teaspoons instant coffee granules ADVERTISEMENT",
            "1 teaspoon rum flavored extract (optional) ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "16 walnut halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees F).\nIn a medium mixing bowl beat butter or margarine and sugar until light and fluffy. Add eggs one at a time, blending constantly until well combined. Mix in melted chocolate, coffee, and rum extract, blending thoroughly. Fold in flour and, if desired, chopped nuts. Pour mixture into pie shell and decorate with walnut halves.\nPlace in lower third of preheated oven and bake 25 minutes. Let cool one hour before cutting.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "PCP Pie",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "4 large eggs, beaten ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 tablespoon yellow cornmeal ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 (9 inch) prepared pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat sugar, eggs, butter, cornmeal, flour, and vanilla extract together in a large bowl until smooth; add pineapple, pecans, and coconut and stir. Pour the filling into the prepared pie crust.\nBake in preheated oven until the center of the pie is nearly set, 50 to 60 minutes.\n",
        "picture_link": "DySsiUo1HrMEutTS.8MZRgfxwU7uiCW"
    },
    {
        "title": "Breakfast on a Stick",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "1/2 cup cubed fully cooked ham ADVERTISEMENT",
            "1/2 cup 1-inch pieces link sausage ADVERTISEMENT",
            "2 tablespoons barbeque sauce ADVERTISEMENT",
            "2 tablespoons grape jelly ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nThread 1 end of a piece of bacon onto a skewer; add a ham cube and fold bacon over the ham through the skewer. Add a piece of sausage and fold bacon over sausage. Repeat with remaining bacon, ham, and sausage. Spread bacon, ham, and sausage out onto the skewer so bacon isn't squeezed too closely to the meat.\nBake in the preheated oven for 15 minutes. Combine barbeque sauce and grape jelly in a microwave-safe bowl; heat in microwave for 30 seconds. Stir sauce and brush over skewers. Continue baking skewers, basting every 10 minutes, until bacon is desired crispness, 15 to 30 minutes more.\n",
        "picture_link": "xfFL.I/0Z/v6cmvdk4e/v9oh6R.HNXi"
    },
    {
        "title": "Asian Chicken and Rice from Uncle Ben's®",
        "ingredients": [
            "2 teaspoons minced gingerroot ADVERTISEMENT",
            "1 1/2 cups UNCLE BEN'S® Fast & Natural™ Whole Grain Instant Brown Rice ADVERTISEMENT",
            "4 chicken breast halves ADVERTISEMENT",
            "1/4 cup green onions, sliced ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Nonstick cooking spray ADVERTISEMENT",
            "3 cups assorted Asian vegetables such as bok choy, pea pods, red peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 10-inch skillet with nonstick spray and heat over medium heat until hot. Add the chicken breasts and cook for 2-3 minutes until golden brown on both sides.\nAdd the gingerroot and garlic, cook for 30 seconds. Add the chicken broth, rice and sesame oil. Cover and bring to a boil, reduce heat and cook for 15 minutes.\nAdd assorted vegetables and continue to cook until liquid is absorbed. Just before serving, stir in green onions.\n",
        "picture_link": "s/chuyMALzPxc8pstplKee6ekNSHx0i"
    },
    {
        "title": "Marielle's French Onion Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 large red onions, thinly sliced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 (10.5 ounce) cans beef broth ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "6 slices French bread, toasted ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nHeat the butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. Stir in the flour; cook and stir for a few minutes, then gradually add the beef broth and water. Bring to a boil, then simmer for 20 minutes.\nArrange French bread slices on a baking sheet, and sprinkle with Parmesan and Swiss cheese.\nBake in the preheated oven until the cheese is lightly browned and melted, about 10 minutes. Divide the soup into 6 bowls, and top with the cheesy bread.\n",
        "picture_link": "EoWOv15A0vbZYZt5NAupCVrhljiwsfS"
    },
    {
        "title": "Baked Pineapple Chicken",
        "ingredients": [
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "1 (20 ounce) can pineapple rings, drained ADVERTISEMENT",
            "4 potatoes, cubed ADVERTISEMENT",
            "6 carrots, cubed ADVERTISEMENT",
            "1 bunch spring onions, sliced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 pieces of boneless chicken, such as thighs or breasts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nPlace flour into a large oven roasting bag, inflate the bag slightly, and shake to distribute flour around the inside of the bag. Place pineapple rings, potatoes, carrots, spring onions, salt, and black pepper into the oven bag. Rinse the chicken pieces but don't dry them; add them to the bag. Shake to evenly distribute the ingredients and flour. Tie the top of the bag closed, and place on a baking sheet.\nBake the chicken, vegetables, and pineapple in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 50 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "The Perfect Simplified Sushi Vinegar",
        "ingredients": [
            "2 cups rice vinegar (such as Marukan®) ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 tablespoons salt ADVERTISEMENT",
            "1/8 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the rice vinegar, sugar, salt, and lemon juice together in a saucepan until the sugar and salt have dissolved; bring the mixture almost to a simmer over low heat, but not allow to boil. Remove from heat and allow to cool completely. Store in refrigerator.\n",
        "picture_link": "qoLkGA/29kTEVZW.0JmFoS2DAH3JJZC"
    },
    {
        "title": "Sausage Oyster Dressing",
        "ingredients": [
            "1 (16 ounce) package bulk mild pork sausage (such as Jimmy Dean®) ADVERTISEMENT",
            "1 (16 ounce) package bulk hot pork sausage (such as Jimmy Dean®) ADVERTISEMENT",
            "1 (16 ounce) package plain croutons ADVERTISEMENT",
            "1 pint shucked oysters, drained with liquid reserved ADVERTISEMENT",
            "2 cups diced celery ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 1/2 cups chicken broth, or as needed ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.\nPlace the pork sausage in a skillet over medium heat, and brown the sausage, breaking it up into crumbles as it cooks, until the sausage is thoroughly mixed together and no longer pink, about 10 minutes. Drain grease, and transfer the sausage to a large bowl. Mix in the croutons, oysters, celery, eggs, and onion until thoroughly combined. Mix together the reserved oyster liquid and enough chicken broth to total 2 cups in a bowl, and pour into the dressing; stir in the butter. Transfer the dressing into the prepared baking dish.\nBake in the preheated oven until hot, browned, and the oysters are cooked, about 30 minutes.\n",
        "picture_link": "14uj1HaH0vnG8WaoAkIuaQ2MYsfnLdu"
    },
    {
        "title": "Sweet Pumpkin Cupcakes with Cream Cheese Frosting",
        "ingredients": [
            "Cupcakes: ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/3 cup canola oil ADVERTISEMENT",
            "1 (16 ounce) can pumpkin puree ADVERTISEMENT",
            "Cream Cheese Frosting: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease or line 24 muffin cups with paper liners.\nBeat cake mix, eggs, water, and canola oil together in a bowl using a hand mixer on medium speed until smooth, about 2 minutes. Add pumpkin and beat until batter is smooth; pour into prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center of a cupcake comes out clean, 18 to 20 minutes. Place cupcakes on a wire rack to cool completely.\nBeat cream cheese and butter together in a bowl using an electric mixer until smooth; add vanilla extract and beat until smooth. Beat confectioners' sugar, 1/4 cup at a time, into cream cheese mixture until frosting is smooth and creamy. Refrigerate frosting until chilled, at least 30 minutes.\nSpread frosting onto cupcakes and refrigerate frosted cupcakes until chilled, at least 1 hour.\n",
        "picture_link": "1N4rDBRBhc/WwgrAyoS6c8elDqlklfy"
    },
    {
        "title": "Corned Beef Dinner for St. Patrick's Day",
        "ingredients": [
            "4 pounds corned beef brisket, or more to taste ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 medium head cabbage, cored and cut into 6 wedges ADVERTISEMENT",
            "12 small red potatoes, halved ADVERTISEMENT",
            "1 pound small white onions, peeled ADVERTISEMENT",
            "6 large carrots, peeled and cut in chunks ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1/2 cup reduced-fat sour cream ADVERTISEMENT",
            "2 tablespoons coarse Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place corned beef in a 6-quart Dutch oven or heavy pot and pour in enough water to cover beef by 2 inches. Bring water to a boil, skimming the liquid occasionally to remove fat from top. Reduce heat to medium-low, cover Dutch oven with a lid, and simmer for 2 hours.\nArrange cabbage, potatoes, onions, and carrots around beef and return liquid to a boil. Lower heat to medium-low, cover Dutch oven, and simmer until vegetables are tender, about 40 minutes. Transfer beef to a serving platter, reserving 1 1/2 cups cooking liquid. Surround meat with the vegetables.\nMelt butter in a small saucepan over medium heat. Whisk flour into melted butter until dissolved and bubbling, about 1 minute. Add reserved cooking liquid and vinegar to butter-flour mixture; cook, stirring frequently, until sauce is slightly thickened, about 4 minutes. Remove saucepan from heat and whisk sour cream and mustard into sauce. Serve sauce alongside corned beef and vegetables.\n",
        "picture_link": "3PXFyPvtTMF2xMvMLlshGevK.DR30WC"
    },
    {
        "title": "Pumpkin Granola Bars",
        "ingredients": [
            "3/4 cup pumpkin puree ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup room-temperature butter ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "3 tablespoons molasses ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "2 tablespoons shredded unsweetened coconut ADVERTISEMENT",
            "2 teaspoons ground flax (optional) ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a jelly roll pan.\nBeat pumpkin puree, egg, butter, honey, and molasses together in a large bowl. Stir rolled oats, sunflower seeds, wheat germ, coconut, ground flax, orange zest, and cinnamon into the pumpkin mixture; spread into the prepared pan.\nBake in preheated oven until golden brown, about 40 minutes. Cut into bars while still warm.\n",
        "picture_link": "U/rj4wf7PSzxixMcjIqZqDdJKgh3S0u"
    },
    {
        "title": "Hungarian Hot and Spicy Pickled Cauliflower",
        "ingredients": [
            "4 cups distilled white vinegar ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1/2 cup sea salt ADVERTISEMENT",
            "1 head cauliflower, broken into florets ADVERTISEMENT",
            "3 hot chile peppers, sliced lengthwise ADVERTISEMENT",
            "3 cloves garlic, minced, divided ADVERTISEMENT",
            "1 tablespoon mustard seed, divided ADVERTISEMENT",
            "1 tablespoon whole black peppercorns, divided ADVERTISEMENT",
            "1 tablespoon coriander seeds, divided ADVERTISEMENT",
            "1 tablespoon dill seeds, divided ADVERTISEMENT",
            "1 tablespoon allspice berries, divided ADVERTISEMENT",
            "1 1/2 teaspoons red pepper flakes, divided ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "3 1-quart canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vinegar, water, and salt together in a pot; bring to a simmer.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack each jar 1/3 the cauliflower, 1 hot pepper, 1 minced garlic clove, 1 teaspoon mustard seed, 1 teaspoon peppercorns, 1 teaspoon coriander seed, 1 teaspoon dill seed, 1 teaspoon allspice berries, 1/2 teaspoon red pepper flakes, and 1 bay leaf. Pour vinegar mixture into the jars, filling to within 1/2-inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "i3HmbXIr8bqvXQNLTrf9Zz2w.pKpCt2"
    },
    {
        "title": "Healthy Sweet Potato Wraps",
        "ingredients": [
            "2 sweet potatoes, peeled and cut into bite-size pieces ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 cup broccoli florets ADVERTISEMENT",
            "1 (15 ounce) can lentils, drained and rinsed ADVERTISEMENT",
            "1 tablespoon cumin ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper, or to taste ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "6 tablespoons barbeque sauce, divided ADVERTISEMENT",
            "6 whole wheat Lebanese-style pita bread rounds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sweet potatoes into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 8 minutes. Drain.\nHeat olive oil in a large skillet over medium-high heat. Cook and stir broccoli in hot oil until tender yet still crisp, 3 to 5 minutes. Stir sweet potatoes, lentils, cumin, cayenne pepper, and salt into broccoli; cook until heated through, about 5 minutes. Add diced tomatoes and cook until hot, about 3 minutes.\nDrizzle 1 tablespoon barbeque sauce into each pita round. Scoop about 1 cup of sweet potato mixture into each pita and wrap each, folding up the bottom of the pita first, followed by the sides. Secure with toothpicks, if necessary.\n",
        "picture_link": "ye3mW7YR2FlRjO4wgTxxJuhOWHo4pV2"
    },
    {
        "title": "Smoked Salmon French Toast Sandwich",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 1/2 tablespoons milk ADVERTISEMENT",
            "1 pinch herbes de Provence, or to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "4 slices day-old French bread ADVERTISEMENT",
            "1/2 cup fresh spinach leaves, or to taste ADVERTISEMENT",
            "cream cheese ADVERTISEMENT",
            "4 ounces smoked salmon, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk eggs, milk, and herbes de Provence together in a shallow bowl.\nMelt butter in a skillet over medium heat. Working in batches, dip bread in egg mixture, turning once to coat bread completely. Transfer coated bread to prepared skillet and cook in hot butter until golden, 1 to 2 minutes per side. Transfer toasted bread to a paper-towel lined plate. Repeat with remaining bread slices.\nCook and stir spinach in the same skillet until slightly wilted, 1 to 2 minutes.\nSpread cream cheese onto 2 slices of toasted bread. Top each with spinach and smoked salmon, and place remaining slices of bread on top.\n",
        "picture_link": "F6.Lsz10HM2s6bW3uLuUWThJ19oP4Je"
    },
    {
        "title": "Super Deluxe Steak Nachos",
        "ingredients": [
            "Steak: ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 (1 1/2-pound) skirt steak or flap steak ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground dried chipotle pepper ADVERTISEMENT",
            "Beans: ADVERTISEMENT",
            "2 tablespoons bacon fat ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 teaspoon salt, divided ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "2 (15 ounce) cans pinto beans, rinsed and drained ADVERTISEMENT",
            "1 1/2 cups water or chicken broth, plus more as needed ADVERTISEMENT",
            "Nacho Toppings: ADVERTISEMENT",
            "1 (14 ounce) bag corn tortilla chips ADVERTISEMENT",
            "12 ounces shredded Cheddar cheese ADVERTISEMENT",
            "12 ounces shredded Monterey Jack cheese ADVERTISEMENT",
            "1 avocado - peeled, pitted and diced ADVERTISEMENT",
            "1/2 cup chopped white onion, or to taste ADVERTISEMENT",
            "2 ripe tomato, chopped, or more to taste ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/2 cup sour cream, for topping ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season both sides of steak with salt and pepper. Heat oil in a skillet over medium-high heat. Cook steak, turning occasionally, to medium doneness, about 6 minutes per side. An instant-read thermometer inserted into the center should read 135 to 140 degrees F (60 degrees C). Transfer meat to a bowl to let it rest.\nPour a splash of water into the skillet; stir to scrape up browned bits and deglaze the pan. Pour this liquid over meat. Allow meat to cool completely.\nWhen meat is completely cool slice thickly (about 1/2 inch) with the grain, then cut into thinner strips. Dice by cutting into pieces against the grain. Transfer chopped steak back to the bowl; toss with the pan drippings.\nMelt bacon fat over medium heat in a pot. Add onions and a pinch of the salt; cook and stir until softened, 5 or 6 minutes. Stir in oregano. Add pinto beans and water. Bring back to a simmer and cook until onions are soft and sweet, about 5 minutes. Reduce heat to low.\nMash the beans with a potato masher to your desired consistency. Add additional liquid, if necessary, to achieve your preferred texture. Add the remaining salt to taste. Remove from heat.\nPreheat oven to 450 degrees F (230 degrees C).\nPlace tortilla chips about 2 or 3 deep in a heat proof pan. (You may need more than one pan.) Top chips with spoonfuls of beans and a generous handful of steak pieces. Sprinkle with grated cheese.\nBake in preheated oven until cheese is melted and edges start to brown, about 10 minutes.\nScatter diced ripe avocado, diced onions, diced tomatoes, and diced jalapenos over the top. Drizzle nachos with sour cream and garnish with chopped cilantro.\n",
        "picture_link": "E5IombbprOLGx.AwGfyBj9OJgWKlB1a"
    },
    {
        "title": "Gluten Free Carbonara",
        "ingredients": [
            "1 (12 ounce) box Barilla® Gluten Free Spaghetti ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 cup chopped raw bacon ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 bunch asparagus, trimmed, cut 1 inch long on a bias ADVERTISEMENT",
            "5 egg yolks, lightly beaten ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "Salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Cook pasta according to package directions.\nMeanwhile, in a skillet, saute onion, bacon and oil for approximately 5 minutes or until bacon is rendered and onions are translucent. Add the asparagus and saute for additional 3-4 minutes, then season with salt and pepper.\nSeparately, in a large bowl, mix yolks with cheese. Add salt and pepper and set aside.\nDrain pasta and toss with bacon and asparagus mixture.\nWith the heat off, fold the yolk mixture into the pasta and stir vigorously until the yolks thicken up and coat the spaghetti. Serve immediately.\n",
        "picture_link": "2KB3eQxJNPKjaQe33mtef7CE6aKg.Ja"
    },
    {
        "title": "Salmon en Croute ",
        "ingredients": [
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 cup chopped fresh mushrooms ADVERTISEMENT",
            "2 teaspoons minced garlic, divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup baby spinach ADVERTISEMENT",
            "1 tablespoon all-purpose flour, or as needed ADVERTISEMENT",
            "2 sheets frozen puff pastry (such as Pepperidge Farm®), thawed ADVERTISEMENT",
            "1 (1 1/2-pound) boned, skinned salmon fillet ADVERTISEMENT",
            "1/2 teaspoon smoked paprika, or more to taste ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon dried dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon oil in a large skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Add mushrooms and 1 teaspoon garlic; cook and stir until mushrooms are soft, about 5 minutes. Season with salt and black pepper. Transfer onion and mushroom mixture to a small bowl.\nHeat remaining 1 tablespoon oil in the same skillet. Add remaining 1 teaspoon garlic; cook and stir until fragrant, about 30 seconds. Add spinach; cook and stir until wilted, 3 to 5 minutes. Season with salt and black pepper. Transfer to another bowl.\nPreheat oven to 350 degrees F (175 degrees C). Line a glass baking dish with parchment paper.\nDust work surface with flour. Lay 1 puff pastry sheet out on work surface. Spread onion and mushroom mixture evenly across pastry, leaving a 1/2-inch border. Center salmon on top. Sprinkle paprika over salmon and top with wilted spinach. Cover with second puff pastry sheet. Fold over and crimp edges to seal. Brush top with beaten egg. Transfer to baking dish.\nBake in the preheated oven until pastry is golden, 40 to 45 minutes. Remove and let stand for 5 minutes. Slice into 4 portions.\nWhisk mayonnaise, lemon juice, Dijon mustard, and dill together in a small bowl. Spoon sauce onto 4 plates and place a piece of salmon on each.\n",
        "picture_link": "cZFS975dmS23k6mZP2APtd9jHyzGRLK"
    },
    {
        "title": "Power Brownies",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 cup plain nonfat Greek yogurt ADVERTISEMENT",
            "1/2 cup brewed coffee ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray an 8-inch square baking pan.\nMix sugar, flour, cocoa powder, baking powder, and salt together in a large bowl. Push mixture to the sides of the bowl to form a well in the center.\nCombine yogurt, coffee, applesauce, and vanilla extract in a small bowl. Pour yogurt mixture into the flour mixture. Fold gently with a spatula until just combined. Spread in the prepared pan.\nBake in the preheated oven until center is firm to the touch, 45 to 55 minutes. Cool slightly before cutting into squares, about 15 minutes.\n",
        "picture_link": "IA7fmjbiEZv.Z9bt1Ln4Jeq7dL3uFq6"
    },
    {
        "title": "Quick Risotto-Style Rice & Chicken",
        "ingredients": [
            "2 tablespoons I Can't Believe It's Not Butter!® Spread, divided ADVERTISEMENT",
            "1 pound boneless, skinless chicken breasts, cut into bite-size pieces ADVERTISEMENT",
            "1 (10 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 (5.6 ounce) package Knorr® Rice Sides™ - Chicken ADVERTISEMENT",
            "1 cup frozen green peas ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon Spread in large nonstick skillet over medium-high heat and cook chicken, stirring occasionally, until chicken is thoroughly cooked, about 5 minutes. Remove chicken and set aside.\nMelt remaining 1 tablespoon Spread in same skillet and cook mushrooms, stirring occasionally, until golden, about 5 minutes. Add milk, Knorr(R) Rice Sides(TM) - Chicken flavor and peas and prepare according to package directions.\nStir in chicken, sour cream and 2 tablespoons Parmesan cheese; heat through. Serve sprinkled with remaining Parmesan cheese. Garnish, if desired, with chopped parsley and cracked black pepper.\n",
        "picture_link": "cMC5Sw4PdHkfRUjQgyckzVivYa0/sv."
    },
    {
        "title": "Creamy Mock Hollandaise Sauce",
        "ingredients": [
            "3 ounces cream cheese, softened ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/4 teaspoon fine salt ADVERTISEMENT",
            "1/2 cup milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese and egg yolks together in a bowl with an electric mixer. Stir lemon juice and salt together in a separate small bowl.\nTransfer cream cheese mixture to saucepan over low heat; whisk in lemon juice mixture. Increase heat to medium-low; bring cream cheese mixture to a boil, whisking constantly, about 3 minutes. Whisk milk in gradually until desired consistency is reached. Continue to cook, whisking constantly, until smooth sauce forms, 1 to 2 minutes.\n",
        "picture_link": "39KaGvfWKRPRWHlCFClvMySdxkuR8aK"
    },
    {
        "title": "Chicken Gorgonzola Quesadillas",
        "ingredients": [
            "2 large skinless, boneless chicken breast halves, cut into bite-size pieces and pounded thin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 flour tortillas, or more as desired ADVERTISEMENT",
            "1 (5 ounce) package crumbled Gorgonzola cheese ADVERTISEMENT",
            "1 cup cooked spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nSeason chicken with salt and pepper. Heat oil in a skillet over medium heat. Add chicken; cook until no longer pink in the center and juices run clear, 3 to 4 minutes. Add onion and garlic; cook and stir until onion is golden brown, 10 to 15 minutes.\nPlace 1 tortilla on prepared baking sheet; layer with 1/2 of the Gorgonzola cheese, spinach, and chicken mixture; top with remaining Gorgonzola cheese. Place remaining tortilla on top and gently press down to flatten the quesadilla.\nBake quesadilla in preheated oven until cheese is melted, about 10 minutes; cut into triangles.\n",
        "picture_link": "DMEm3d/BllN4Bc58JIfB.4rAogg17QK"
    },
    {
        "title": "Gluten Free Spicy Mac & Cheese",
        "ingredients": [
            "1 (12 ounce) box Barilla® Gluten Free Elbows ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "2 cups organic milk ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 pound shredded pepperjack cheese ADVERTISEMENT",
            "Salt and black pepper to taste ADVERTISEMENT",
            "1 small fresh jalapeno pepper, minced ADVERTISEMENT",
            "4 egg yolks, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil and pre-heat oven to 400 degrees F.\nCook pasta 2 minutes shorter than recommended cook time.\nIn a small pot, heat milk and cream until begins to simmer. Mix corn starch with 2 tablespoons water to create a slurry. Add slurry to the cream mixture to thicken, then season with salt, pepper and jalapeno.\nSlowly add 3/4 of the cheese into the sauce, whisking constantly.\nAdd pasta to the mixture and let it sit for 5 minutes.\nStir in yolks and place in a 9 x 9 greased baking dish.\nBake in the oven for approximately 15 minutes or until bubbling and slightly caramelized on the top.\n",
        "picture_link": "CXbnjtFrZz2kPHBkNlnid6BRJw3JKKC"
    },
    {
        "title": "Chia Colada",
        "ingredients": [
            "1 cup coconut water ADVERTISEMENT",
            "2 tablespoons pineapple juice ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "1/4 cup chopped pineapple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend coconut water, pineapple juice, and chia seeds together in a blender. Set mixture aside until chia seeds expand, about 30 minutes. Top mixture with chopped pineapple to serve.\n",
        "picture_link": "p6C2oKVmsfD8zHe.LfSTp/6b1rYEoXS"
    },
    {
        "title": "Buffalo Chicken & Rice Skillet",
        "ingredients": [
            "1 tablespoon I Can't Believe It's Not Butter!® Spread ADVERTISEMENT",
            "1 pound boneless, skinless chicken breasts, cut into bite-size pieces ADVERTISEMENT",
            "1 (5.6 ounce) package Knorr® Rice Sides™ - Chicken flavor ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "2 tablespoons cayenne hot sauce, or more to taste ADVERTISEMENT",
            "2 tablespoons crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt Spread in large nonstick skillet over medium-high heat and cook chicken, stirring occasionally, until chicken is thoroughly cooked, about 5 minutes. Remove chicken and set aside.\nAdd 2 cups water, Knorr(R) Rice Sides(TM) - Chicken flavor, carrots and celery to same skillet and prepare according to package directions.\nStir in chicken and hot sauce. Serve sprinkled with blue cheese and, if desired, additional chopped celery.\n",
        "picture_link": "//SF/HZfZEtbUiXX7w4nDqeMBJ6lyIq"
    },
    {
        "title": "Wheat Berry Salad with Peas, Radishes, and Dill",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "1/2 pound sugar snap peas or snow peas, trimmed ADVERTISEMENT",
            "1 cup wheat berries, hard winter or soft wheat berries ADVERTISEMENT",
            "1 cup frozen peas ADVERTISEMENT",
            "4 green onions, thinly sliced ADVERTISEMENT",
            "4 radishes, halved and thinly sliced ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1/3 cup chopped fresh dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove strings from sugar snap peas. Cut each snap pea or snow pea pod diagonally into thirds.\nBring a large pot of water to a boil over high heat. Add wheat berries, reduce heat to medium, and cook, uncovered, stirring occasionally, until tender but still chewy, about 1 hour. Stir in sugar snaps and frozen peas and cook 1 minute. Drain wheat berry mixture in a large colander and rinse under cold water. Drain well. Transfer wheat berry mixture to a large bowl and let cool, about 30 minutes. Stir in green onions and radishes.\nWhisk together lemon juice, mustard, salt, and sugar until sugar is dissolved. Whisk in oil. Pour dressing over salad and toss well. Add dill and toss to combine.\n",
        "picture_link": "4S/lCHcVr8WVc5kVmRLBMNEt.FX82oi"
    },
    {
        "title": "Tampa Coconut Cilantro Rice",
        "ingredients": [
            "2 cups coconut water, or as needed ADVERTISEMENT",
            "1 cup basmati rice ADVERTISEMENT",
            "salt, or as desired ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 teaspoons unsalted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 1 cup coconut water to a boil in a saucepan. Add basmati rice and salt, cover, and reduce heat to simmer. Stir occasionally, adding more coconut water as needed, until rice is soft but not mushy, about 15 minutes.\nRemove rice from heat, stir in cilantro and butter, and cover again. Let stand until coconut water is absorbed and flavors have blended, about 5 minutes more.\n",
        "picture_link": "GWH4myt.yG5oaUmsVJV4Vq.TJnFSBK2"
    },
    {
        "title": "Spicy Remoulade Sauce",
        "ingredients": [
            "1 cup non-fat Greek yogurt ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup stone-ground mustard ADVERTISEMENT",
            "1 tablespoon pickle juice ADVERTISEMENT",
            "1 tablespoon capers ADVERTISEMENT",
            "1 teaspoon prepared horseradish ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon hot paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend yogurt, mayonnaise, mustard, pickle juice, capers, horseradish, garlic, hot pepper sauce, cayenne, and paprika together in the bowl of a food processor. Chill until ready to serve, at least 30 minutes.\n",
        "picture_link": "R59dRap.P7UE7cn2hHNY2qIRSYZKZNe"
    },
    {
        "title": "Easy, Breezy, Cheesy Stuffed Bread (Domino's® Copycat Recipe)",
        "ingredients": [
            "1 (11 ounce) package refrigerated French bread dough (such as Pillsbury®) ADVERTISEMENT",
            "1/4 cup melted butter, divided ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 cup shredded Mexican cheese blend ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon freshly grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon shredded Cheddar cheese ADVERTISEMENT",
            "1 pinch dried parsley ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a large baking sheet.\nRoll dough out into a large rectangle on a flat work surface. Brush with 3 tablespoons melted butter and sprinkle with cornmeal. Flip dough over and scatter mozzarella cheese, Mexican cheese blend, and 1 cup Cheddar cheese on top. Fold the dough in half and press edges together with your fingers to seal.\nBrush remaining 1 tablespoon butter over dough and lightly sprinkle with Parmesan cheese, 1 tablespoon Cheddar cheese, dried parsley, garlic powder, and onion powder. Make shallow cuts 1 inch apart across the top with a knife, so that you can easily pull the bread apart after baking.\nBake in the preheated oven until bread is golden brown and cheese is bubbly about 25 minutes. Cool 5 minutes before pulling strips apart.\n",
        "picture_link": "3BmSjObRwVjro1UB7XYd2krbnx6nTPW"
    },
    {
        "title": "Skinny Black Forest Smoothie",
        "ingredients": [
            "2 cups baby spinach ADVERTISEMENT",
            "1 cup frozen cherries ADVERTISEMENT",
            "1 cup almond milk ADVERTISEMENT",
            "1/4 cup rolled oats ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 packet stevia sweetener (such as Truvia®) ADVERTISEMENT",
            "1 teaspoon chia seeds, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place baby spinach, cherries, almond milk, rolled oats, cocoa powder, and sweetener in a blender. Blend until smooth, about 2 minutes. Pour into a glass and top with chia seeds.\n",
        "picture_link": "45IvI/OpzsBQDY42GYhvzSfbJ1Dqaeq"
    },
    {
        "title": "Yellow Rice with Asparagus and Mushrooms",
        "ingredients": [
            "2 1/2 cups water ADVERTISEMENT",
            "1 (6.9 ounce) package ZATARAIN'S® Yellow Rice ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cups sliced mushrooms ADVERTISEMENT",
            "8 ounces fresh asparagus, cut into 1-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to boil in medium saucepan. Stir in Rice Mix; return to boil. Reduce heat to low; cover and simmer 25 minutes or until rice is tender.\nMeanwhile, melt butter in large skillet on medium-high heat. Add mushrooms; cook and stir 3 minutes. Add asparagus; cook and stir 3 minutes until tender-crisp.\nStir vegetables into rice mixture; mix well. Remove from heat. Let stand 5 minutes.\n",
        "picture_link": "jZEN1SPNRh5o49IQfuP7Q2vpYOG.xk2"
    },
    {
        "title": "Brooklyn Style Pizza Dough",
        "ingredients": [
            "3 cups bread flour, divided, or as needed ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 cups bread flour, water, yeast, and salt in a bowl with an electric mixer fitted with dough attachment. Mix on lowest speed until blended but still moist, about 2 minutes. Cover with a towel and let rise in a warm place until doubled in volume, about 20 minutes.\nUncover bowl and mix the dough with electric mixer on low speed until dough has pulled together, about 5 minutes. Sprinkle in remaining flour until soft, sticky dough forms, 1 to 2 minutes.\nIncrease mixer speed to medium and mix until dough pulls away from sides of bowl, about 8 minutes. Cover with a towel and let rest, about 20 minutes. Rub a few drops of olive oil evenly into a plastic container.\nTransfer dough onto a floured work surface. Dust hands with flour and knead dough until soft but still wet on the inside. Form into a ball and place into prepared container. Refrigerate dough at least 1 day and up to 7 days.\n",
        "picture_link": "ezphtxK4/m.tPvXF7fJBwZkBFq.YFMK"
    },
    {
        "title": "Warm Jeweled Barley Salad with Honey-Mustard Dressing",
        "ingredients": [
            "1 cup pearl barley, rinsed ADVERTISEMENT",
            "1/3 cup dried apricots, coarsely chopped ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "1/3 cup dried cherries or dried cranberries ADVERTISEMENT",
            "1/3 cup slivered almonds ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 medium red onion, coarsely chopped ADVERTISEMENT",
            "3 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Cook barley in boiling water, uncovered, over medium heat, stirring occasionally, until tender, about 40 minutes. Add dried fruit and cook 1 minute more. Drain barley mixture well and transfer to a large bowl.\nMeanwhile, preheat oven to 350 degrees F (175 degrees C). Toast almonds in a small rimmed baking sheet or pie pan until golden, 10 to 15 minutes. Let cool.\nWhile barley cooks and nuts toast, heat 1 tablespoon oil in a large skillet over medium heat until shimmering. Cook onion, stirring occasionally, until browned around edges, 6 to 8 minutes. Add onion to barley and toss to combine.\nWhisk together mustard, honey, vinegar, and salt in a small bowl. Whisk in remaining tablespoon oil and pour dressing over salad. Toss well. Sprinkle salad with toasted almonds and toss lightly.\n",
        "picture_link": "Q6sBhjb9MEZxPcVDBhYplcVeasA4ut."
    },
    {
        "title": "Cinnamon Roll Casserole ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/4 cups white sugar, divided ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "3 (8 ounce) tubes refrigerated biscuit dough ADVERTISEMENT",
            "1 cup crushed salted peanuts, or to taste ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 3-quart casserole dish with cooking spray.\nCombine 3/4 cup white sugar and cinnamon in a large bowl.\nCut each biscuit into 4 pieces and toss in sugar mixture until well-coated. Transfer to prepared casserole dish.\nHeat 1/2 cup plus 2 tablespoons margarine in a saucepan over medium heat until melted, 3 to 5 minutes. Stir in remaining 1/2 cup white sugar, peanuts, and brown sugar. Pour over biscuits in the casserole dish, trying to moisten them evenly.\nBake in the preheated oven until golden, about 40 minutes. Remove from oven, gently mix, and return to oven until puffed and browned, about 15 minutes more.\nCool casserole slightly before serving, about 15 minutes.\n",
        "picture_link": "wO0psb7muWuLNb2r7xKoqVlWi2y54T2"
    },
    {
        "title": "Healthy Big Bowl",
        "ingredients": [
            "7 red potatoes, scrubbed and quartered ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 links smoked beef sausage (such as Eckrich®), sliced into 1-inch pieces ADVERTISEMENT",
            "1 bunch asparagus, stemmed and chopped ADVERTISEMENT",
            "2 cups frozen sweet white corn ADVERTISEMENT",
            "2 cups chopped broccoli florets ADVERTISEMENT",
            "3 cups beef broth ADVERTISEMENT",
            "3 tablespoons all-purpose flour, or more as needed ADVERTISEMENT",
            "ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium and simmer until potatoes are very soft, about 20 minutes. Drain.\nPlace potatoes in a large bowl. Add milk, butter, and garlic. Blend potatoes until creamy with an electric mixer. Divide mashed potatoes among bowls.\nHeat olive oil in a large skillet over medium heat. Add sausage; cook until warmed through, 2 to 3 minutes. Add chopped asparagus, corn, and broccoli florets. Pour in broth; cover, and simmer, stirring occasionally, until vegetables are almost cooked through, about 5 minutes.\nScoop 1 cup of broth out of the skillet into a small bowl. Whisk in flour until smooth. Pour broth mixture back into skillet. Stir until a thickened gravy forms, about 5 minutes.\nServe sausage mixture and gravy over mashed potatoes. Season with black pepper.\n",
        "picture_link": "DxNOShPl/krQB8BdepuIkXG4SKQAzWW"
    }
]