[
    {
        "title": "Meatloaf with Beer",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2/3 pound ground beef ADVERTISEMENT",
            "2/3 pound ground pork ADVERTISEMENT",
            "2/3 pound ground veal ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2/3 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup pale ale ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "3 tablespoons ketchup ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat a baking sheet with cooking spray.\nCombine ground beef, ground pork, ground veal, eggs, bread crumbs, pale ale, onion, 3 tablespoons ketchup, mustard, basil, garlic powder, salt, and pepper in a large bowl; mix well. Transfer mixture to prepared baking sheet; shape into 10x5x2-inch loaf. Spread 1/3 cup ketchup on top of the loaf.\nBake in the preheated oven until no longer pink in the center, 60 to 65 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Cool meatloaf 10 minutes before slicing.\n",
        "picture_link": "40eeGEj.I8TUM2XTLxcgqkxGQrSwuom"
    },
    {
        "title": "Cheddar-Rosemary Zucchini Boats",
        "ingredients": [
            "3/4 tablespoon butter ADVERTISEMENT",
            "3/4 tablespoon olive oil ADVERTISEMENT",
            "3 cups crusty bread cubes ADVERTISEMENT",
            "2 teaspoons minced fresh garlic ADVERTISEMENT",
            "2 zucchini ADVERTISEMENT",
            "3/4 tablespoon butter ADVERTISEMENT",
            "3/4 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 cups chopped plum (Roma) tomatoes ADVERTISEMENT",
            "1 teaspoon finely chopped fresh rosemary ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMelt 3/4 tablespoon butter with 3/4 tablespoon olive oil in a skillet over medium heat. Cook bread cubes in the butter mixture, tossing gently to coat, until fragrant and toasted, 3 to 4 minutes. Add garlic to the bread; cook and stir together for 1 minute. Remove to a plate and set aside to cool.\nSlice zucchini lengthwise with stem and flower ends intact. Use a small spoon to hollow out squash, leaving a 1/4-inch shell. Place squash boats in a large baking dish. Coarsely chop zucchini innards.\nMelt 3/4 tablespoon butter with 3/4 tablespoon olive oil in a skillet over medium-high heat. Cook and stir zucchini innards, tomatoes, rosemary, salt, and pepper in the butter mixture until the vegetables soften, 3 to 4 minutes; transfer to a large bowl and mix with the bread cubes, Cheddar cheese, and beaten egg. Fill the hollowed zucchini halves with the vegetable mixture. Arrange stuffed zucchini boats into a baking dish.\nBake in preheated oven for 25 minutes. Remove and switch oven to broil. Cook under the broiler until golden brown and bubbling on top, 2 to 3 minutes.\n",
        "picture_link": "nt5FexSi/c52Tdlx/uoKY0c8/6BOy8G"
    },
    {
        "title": "Creamed Hot Lobster Sandwich or Lobster Poutine",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 cups cooked lobster meat ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 cups light cream, divided ADVERTISEMENT",
            "8 slices bread ADVERTISEMENT",
            "2 tablespoons butter, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1/2 cup butter in a large frying pan over medium-low heat; cook and stir lobster into melted butter until heated through, about 5 minutes. Season with salt and pepper.\nWhisk cornstarch and about 1 tablespoon cream together in a small bowl until smooth. Pour remaining cream into lobster, stir in cornstarch mixture; cook and stir until cream sauce comes to a simmer and thickens slightly, about 5 minutes.\nToast bread and spread with about 2 tablespoons butter. For each serving, pour some creamed lobster over one buttered piece of toast, top with another piece of toast, and pour more creamed lobster over the top.\n",
        "picture_link": "CR3ByryLInPk.OcTJd5QDcVdYQfmq2y"
    },
    {
        "title": "Mushroom Bouchees",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 green onions ADVERTISEMENT",
            "1 (10 ounce) can mushroom pieces, drained ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "10 slices sandwich bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray.\nChop green onions and mushrooms very finely, to a nearly paste-like consistency.\nMelt butter in a small saucepan over medium heat; stir in green onions and mushrooms and cook and stir until fragrant, about 2 minutes. Whisk cornstarch into half-and-half; pour into mushroom mixture and cook, stirring often, until thickened, about 3 minutes. Season mushroom mixture with salt, pepper, and garlic powder.\nRoll bread slices with a rolling pin until very flat and thin. Spread mushroom mixture evenly onto flattened bread; tightly roll up bread slices. Slice each bread tube into 1-inch thick rounds; place rounds onto a baking sheet.\nBake in the preheated oven until bread is browned, about 10 minutes.\n",
        "picture_link": "4V/IkJjlc08vbopqoWTjPmjjG83TFoq"
    },
    {
        "title": "Easy Graham Cracker Cookies",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chocolate chips, or to taste (optional) ADVERTISEMENT",
            "4 graham crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nWhisk white sugar, brown sugar, butter, and egg together in a large bowl. Stir flour, baking soda, and salt into sugar mixture until batter is just mixed; fold in chocolate chips. Roll dough into 1-inch balls.\nPour graham cracker crumbs into a resealable bag. Place each dough ball, 1 at a time, into the bag and shake until completely coated in graham cracker crumbs. Arrange coated dough balls on a baking sheet.\nBake in the preheated oven until cookies are lightly browned on the edges and have 'cracks' in the middle, about 10 minutes.\n",
        "picture_link": "032YCpSeASJtFFTJZMjmeHqovxchXe2"
    },
    {
        "title": "The Best Lemon Iced Tea",
        "ingredients": [
            "4 green tea bags ADVERTISEMENT",
            "4 orange pekoe tea bags ADVERTISEMENT",
            "6 cups boiling water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (12 ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "cold water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place green tea bags and black tea bags in a 1-gallon glass jar. Pour boiling water over tea bags; steep for 30 minutes.\nRemove tea bags; stir in sugar and lemonade concentrate until dissolved. Fill jar to the top with cold water; stir in lemon juice. Chill in the refrigerator until cold. Serve over ice.\n",
        "picture_link": "dfAwY3hgXwYbh4Lh54dKksltc1ofjt2"
    },
    {
        "title": "Chocolate Mousse Cups",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 (14 ounce) package extra firm tofu, drained ADVERTISEMENT",
            "2 cups So Delicious® Dairy Free Coconut Milk (vanilla or chocolate) ADVERTISEMENT",
            "6 tablespoons cacao powder ADVERTISEMENT",
            "6 (1 gram) packets stevia ADVERTISEMENT",
            "Chocolate cups for serving ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the chocolate over a double boiler. While it is melting, blend the remaining ingredients in a high-speed blender until very smooth. Make sure to stop a few times and scrape down the sides. Once the chocolate has melted, add it to the rest of the ingredients in the blender and blend until smooth, scraping down the sides as needed. The mixture will now be warm and the consistency of pudding.\nYou could serve the dessert now as a warm pudding. Or you can serve it as mousse by placing the pudding into a glass container and keeping it in the fridge for several hours to overnight to give it time to firm up.\nPrior to piping, whip the mousse with a handheld mixer to whip air into it. Pipe the mousse into chocolate cups and serve.\n",
        "picture_link": "9jJdO/GpYpTwl24qevge9ykKeHID1Ja"
    },
    {
        "title": "Cheesy Bacon and Potatoes Casserole",
        "ingredients": [
            "3 slices bacon ADVERTISEMENT",
            "1 (20 ounce) package Simply Potatoes® Diced Potatoes with Onion ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 cup Crystal Farms® Shredded Cheddar Cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F. Spray 2 quart casserole with nonstick cooking spray*. In small skillet cook bacon until crisp; drain grease. Chop bacon.\nIn large bowl stir bacon and all remaining ingredients until well blended. Spread mixture into prepared dish. Cover; bake 60 minutes or until potatoes are tender.\n",
        "picture_link": "Q6BslcXDJHbj8tU324pmrOpdO5KxcX6"
    },
    {
        "title": "My Meatball Lasagna",
        "ingredients": [
            "Meatballs: ADVERTISEMENT",
            "4 slices day-old bread ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (12 ounce) package lasagna noodles ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 (24 ounce) jar prepared spaghetti sauce (such as Prego®) ADVERTISEMENT",
            "1 (12 ounce) can tomato paste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed Cheddar cheese soup ADVERTISEMENT",
            "Cheese Mixture: ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 (12 ounce) container cottage cheese ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 cup shredded mozzarella cheese, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak bread slices in warm water in a bowl for 5 minutes; squeeze bread dry and transfer to a large bowl.\nMelt butter in a skillet over medium heat; cook and stir onion and garlic in hot butter until onion is translucent, about 5 minutes. Add onion and garlic to bread. Stir 1 1/2 cup mozzarella cheese, eggs, Parmesan cheese, and Italian seasoning into bread and onions until thoroughly combined. Crumble ground beef into mixture; mix until thoroughly combined. Season with salt and black pepper.\nForm ground beef mixture into 1-inch meatballs. Heat vegetable oil in a large skillet over medium heat. Pan-fry meatballs until browned, working in batches if necessary, about 10 minutes, turning often. Set meatballs aside.\nBring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine prepared spaghetti sauce, tomato paste, and Cheddar cheese soup in a bowl. Combine ricotta cheese, cottage cheese, 2 cups mozzarella cheese, and parsley in a separate bowl.\nSpread 1 cup of sauce mixture into the bottom of a 9x13-inch baking dish. Layer 1/3 the lasagna noodles over the sauce, overlapping if necessary. Arrange meat balls over noodles. Place 1/3 the lasagna noodles over meat balls, and spread with cheese mixture in an even layer. Top cheese layer with remaining 1/3 the lasagna noodles and spread remaining sauce over top layer of noodles. Sprinkle top with 1 cup mozzarella cheese.\nBake lasagna in the preheated oven until casserole is bubbling and the topping is melted, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Green Drink with Aloe Vera Juice",
        "ingredients": [
            "1 cup aloe vera juice ADVERTISEMENT",
            "1/2 cup old-fashioned rolled oats ADVERTISEMENT",
            "1 cup baby spinach ADVERTISEMENT",
            "1 cup baby kale ADVERTISEMENT",
            "1 cup baby chard ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/2 cucumber ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "2 tablespoons protein powder (optional) ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix aloe vera juice and oats together in a bowl; set aside until oats have absorbed the liquid, about 10 minutes.\nBlend oat mixture, spinach, kale, chard, banana, cucumber, blueberries, protein powder, cinnamon, and cayenne pepper together in a blender until smooth, about 2 minutes.\n",
        "picture_link": "3wqNyoUWtsTspKAsQ.jyOKR.a2MJSzW"
    },
    {
        "title": "Easy Apple Avocado Salad",
        "ingredients": [
            "2 Granny Smith apples, cut into cubes ADVERTISEMENT",
            "1 large avocado - peeled, pitted, and cut into chunks ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon honey, or more to taste ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine apples and avocado together in a bowl.\nWhisk lemon juice and honey together in a separate bowl; drizzle over apples and avocado. Sprinkle cinnamon over salad and fold until evenly mixed. Refrigerate until chilled, at least 30 minutes. Serve cold.\n",
        "picture_link": "Co6Sk5GdW5NFDejf8r1niCyTI7JYBk."
    },
    {
        "title": "Pomegranate Marinated Pork Chops",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon pomegranate-infused red wine vinegar ADVERTISEMENT",
            "3 sprigs fresh rosemary, leaves stripped and finely chopped ADVERTISEMENT",
            "1 clove garlic, sliced ADVERTISEMENT",
            "1/8 teaspoon cracked black pepper ADVERTISEMENT",
            "6 (1/2 inch thick) boneless pork chops ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, vinegar, rosemary, garlic, and black pepper together in a large glass or ceramic bowl. Add the pork chops and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for 8 hours or overnight.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove pork chops from marinade, discard marinade, and season pork chops with salt.\nCook the pork chops on the preheated grill until no longer pink in the center, 7 to 10 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Let chops rest for 3 to 5 minutes before serving.\n",
        "picture_link": "E/2JzSxO2ju.fVMdoEdy4qDbMcexwBu"
    },
    {
        "title": "Easy and Super Delicious Black Bean Soup",
        "ingredients": [
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1/2 cup mild salsa ADVERTISEMENT",
            "1/2 cup vegetable broth ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon sour cream, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thoroughly mash black beans in a small bowl. Stir salsa into the beans; transfer mixture to a small saucepan and place over medium heat. Pour vegetable broth into the saucepan; stir. Bring the liquid to a simmer and cook until the liquid reduces slightly and thickens to your preferred texture, 10 to 15 minutes.\nSeason the soup with salt. Sprinkle Cheddar cheese over the soup and stir to melt. Continue to cook until heated through, 1 to 2 minutes more. Divide between 2 bowls and top each portion with a dollop of sour cream.\n",
        "picture_link": "we2ygnI28opaxZmej./DWjb7oMZ5kEu"
    },
    {
        "title": "Pumpkin Alfredo Sauce",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "9 sage leaves ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat; cook and stir sage leaves in hot butter until the butter takes on the sage flavor, about 5 minutes.\nWhisk cream, pumpkin, nutmeg, cinnamon, and Parmesan cheese into the butter; cook until the cheese melts, about 5 minutes.\n",
        "picture_link": "GlFJSJr9gyX5Qu0ff3ZDZ7KMP6Ow1Ey"
    },
    {
        "title": "Peruvian Causa",
        "ingredients": [
            "8 russet potatoes, peeled ADVERTISEMENT",
            "1/2 cup vegetable oil, or as needed ADVERTISEMENT",
            "2 tablespoons minced aji amarillo ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "1 small red onion, diced small ADVERTISEMENT",
            "1/2 cup mayonnaise, divided ADVERTISEMENT",
            "2 avocados, cut into thin strips ADVERTISEMENT",
            "3 hard-boiled eggs, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nMash potatoes with a ricer or hand mixer until smooth. Gradually stir in oil until potatoes come together; add aji amarillo, salt, and pepper. Cool potato mixture in the refrigerator, about 20 minutes.\nStir tuna, onion, and 1/4 cup mayonnaise together in a bowl.\nLine a casserole dish with plastic wrap. Spread 1/2 the potato mixture on the bottom of the dish. Spread 2 tablespoons mayonnaise over the potatoes, spread the tuna mixture over the mayonnaise, and place the avocado slices in a single layer on top of the tuna mixture. Spread the remaining 1/2 of potato mixture over the avocados, and top with remaining 2 tablespoons mayonnaise. Place sliced eggs over the top. Cover casserole dish with plastic wrap and refrigerate until firm, about 30 minutes.\nInvert casserole dish onto a serving dish or baking sheet to remove potato casserole from dish. Remove plastic wrap and cut casserole into squares.\n",
        "picture_link": "MIfJESHUTUHWLqTvUNmzbPgrLVNVOAu"
    },
    {
        "title": "Alaskan Performance Burgers",
        "ingredients": [
            "1 (7.5 ounce) can wild Alaskan salmon ADVERTISEMENT",
            "1/4 cup almond meal ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix salmon, almond meal, eggs, 1 tablespoon olive oil, salt, and pepper together in a bowl. Form mixture into patties, 1/2 cup per patty.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook patties until browned and heated through, about 5 minutes per side.\n",
        "picture_link": "ODreHzQKWxMz53xlSYUy65F/7BLXzzO"
    },
    {
        "title": "Date Goat Cheese Basil Bites",
        "ingredients": [
            "1 (8 ounce) package goat cheese, slightly softened ADVERTISEMENT",
            "1 1/2 tablespoons honey ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "1 pound pitted dates ADVERTISEMENT",
            "1/3 pound thinly sliced prosciutto ADVERTISEMENT",
            "toothpicks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix goat cheese, honey, and basil together in a bowl until smooth and creamy; refrigerate for 20 minutes.\nPreheat toaster oven or oven to 400 degrees F (200 degrees C).\nFill dates with goat cheese filling using a small spoon. Wrap each date with enough prosciutto to cover entire date and secure with a toothpick. Arrange on a baking sheet.\nBake in the preheated toaster oven until prosciutto becomes crisp and caramelized, about 10 minutes. Flip each date and continue baking until crisp on top, about 5 more minutes.\n",
        "picture_link": "ne0rdeHk.2x4wBFP.Bbay2Os0Ni3U8W"
    },
    {
        "title": "Korean Fusion Chicken Burrito",
        "ingredients": [
            "Meat: ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons Korean chile paste (gochujang) ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "2 (10 ounce) cans chicken chunks, drained ADVERTISEMENT",
            "Everything Else: ADVERTISEMENT",
            "4 (10 inch) flour tortillas ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 teaspoons butter, softened (optional) ADVERTISEMENT",
            "1 cup fresh cilantro leaves ADVERTISEMENT",
            "1/2 cup chopped kimchi, squeezed dry (optional) ADVERTISEMENT",
            "2 tablespoons shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 tablespoon salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 360 degrees F (182 degrees C).\nStir garlic, chile paste, soy sauce, sugar, and sesame oil together in a bowl until the sugar dissolves into the liquid; add chicken and stir to coat.\nWrap tortillas in aluminum foil and bake in preheated oven until hot and soft, about 10 minutes.\nWhile the tortillas warm, heat vegetable oil in a skillet. Cook and stir chicken in skillet until hot and the sauce has thickened, about 10 minutes.\nSpread 1/2 teaspoon butter over one side of each warm tortilla. Divide chicken between the tortillas. Top chicken with equal portions of the cilantro, kimchi, Cheddar cheese, and salsa.\nFold opposing ends of each tortilla toward one another to partially cover the filling. Pull one remaining edge over the filling and then roll so the tortilla surrounds the filling completely.\n",
        "picture_link": "59I1CqDXBtjmFBHWbteBA4eSZcSvmUm"
    },
    {
        "title": "Smokey Butternut Squash Soup",
        "ingredients": [
            "1 butternut squash - peeled and cut into cubes, seeds removed and reserved ADVERTISEMENT",
            "1/2 shallot, diced ADVERTISEMENT",
            "3 tablespoons canola oil, divided ADVERTISEMENT",
            "2 teaspoons smoked paprika ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1 1/2 teaspoons chipotle chile powder ADVERTISEMENT",
            "1 teaspoon minced fresh ginger ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 fresh Brussels sprouts, cored and separated into leaves ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1 1/2 cups almond milk ADVERTISEMENT",
            "1/4 cup crumbled goat cheese, or to taste ADVERTISEMENT",
            "seeds of 1 pomegranate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a roasting pan with a large sheet of aluminum foil.\nToss butternut squash, shallot, 2 tablespoons canola oil, paprika, chili powder, chipotle powder, and ginger together in a bowl until evenly mixed and coated. Pour into prepared roasting pan and wrap aluminum foil around squash mixture.\nBake in the preheated oven until squash is tender, 30 to 40 minutes.\nHeat 1 tablespoon canola oil in a cast-iron skillet over medium heat. Cook and stir reserved butternut squash seeds, pinch salt, and pinch ground black pepper in the skillet until lightly toasted, 5 minutes. Add Brussels sprouts leaves and cook, stirring occasionally, until leaves are slightly crispy and seeds are browned, 10 to 15 minutes. Stir maple syrup into seed mixture and immediately remove from heat.\nPour butternut squash mixture and almond milk into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until soup is smooth.\nPour butternut squash soup into bowls and top with squash seeds and Brussels sprouts mixture, pomegranate seeds, and goat cheese.\n",
        "picture_link": "CSplXdDn1kKt/lBY9Xk8kBq6GLuH8aW"
    },
    {
        "title": "German Potato Bacon Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 yellow onions, diced small ADVERTISEMENT",
            "4 slices bacon, diced small ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 quarts chicken broth ADVERTISEMENT",
            "4 russet potatoes, diced ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1 teaspoon caraway seed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 ounces sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a stockpot over medium heat; add onions, bacon, and bay leaf. Cook and stir the onion mixture until the onions are nearly clear, 5 to 7 minutes.\nPour chicken broth into the pot; add potatoes, flour, marjoram, caraway seed, salt, and pepper. Bring the mixture to a boil, reduce heat to medium-low, and simmer until the potatoes are tender, about 20 minutes.\nStir sour cream into the soup; cook another 1 to 2 minutes.\n",
        "picture_link": "oIKkBYd8fM.DH8couoQNiGKRtZbcBv6"
    },
    {
        "title": "Quick Chocolate Peanut Butter Brownies",
        "ingredients": [
            "2 cups chocolate chips ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nMelt the chocolate chips, butter, and peanut butter together in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Stir vanilla into chocolate mixture.\nStir flour, sugar, eggs, baking soda, and salt into the chocolate mixture. Fold walnuts into batter. Pour batter into prepared baking dish.\nBake brownies in the preheated oven until a toothpick inserted in the center comes out with moist chunks on it, but not wet, about 30 minutes. Cool to room temperature before cutting into squares.\n",
        "picture_link": "EoB9JAsR./k96363UF./aXZFM2XU73K"
    },
    {
        "title": "Fresh Israeli Salad",
        "ingredients": [
            "2 vine-ripened tomatoes, cut into 1/4-inch cubes ADVERTISEMENT",
            "1 red bell pepper, cut into 1/4-inch cubes ADVERTISEMENT",
            "1 green bell pepper, cut into 1/4-inch cubes ADVERTISEMENT",
            "1/2 seedless cucumber, cut into 1/4-inch cubes ADVERTISEMENT",
            "2 radishes, cut into 1/8-inch cubes ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 scallion, cut into 1/8-inch cubes ADVERTISEMENT",
            "1 teaspoon lemon juice, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground sumac ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss tomatoes, red bell pepper, green bell pepper, cucumber, radishes, olive oil, scallion, lemon juice, sumac, and salt together in a bowl; let stand for flavors to blend, about 20 minutes.\n",
        "picture_link": "n.CbkDL1PoZfOd51K3qktgwtQ4MfIJa"
    },
    {
        "title": "Captain's Avocado Bean Dip",
        "ingredients": [
            "1/2 large avocado - peeled, pitted, and quartered ADVERTISEMENT",
            "3 tablespoons salsa ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "2 teaspoons lime juice ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 (16 ounce) can refried beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash avocado in a bowl using a fork until smooth. Stir salsa, mayonnaise, lime juice, chili powder, cumin, and garlic powder into mashed avocado using a fork. Gradually stir refried bean into dip. Refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "euSZiS/jLCLBjJ7HJql.9QVc7rpp5o2"
    },
    {
        "title": "Johnsonville Strawberry and Apple Chicken Sausage Salad",
        "ingredients": [
            "1 link Johnsonville® Apple Chicken Sausage, sliced ADVERTISEMENT",
            "1 (5 ounce) package pre-washed spring mixed greens ADVERTISEMENT",
            "1 quart fresh strawberries, hulled and quartered ADVERTISEMENT",
            "1 medium Granny Smith apple, cored and cut into chunks ADVERTISEMENT",
            "1/3 cup walnut pieces, toasted ADVERTISEMENT",
            "1/4 cup crumbled low-fat feta cheese ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a non-stick skillet, over medium heat, lightly brown sausage. Set aside. In a large salad bowl, combine salad greens, strawberries, apple, walnuts, cheese and sausage.\nIn a small bowl, combine vinegar, honey and oil. Pour over salad and toss. Serve.\n",
        "picture_link": "xXGAj49R4Zf/vUfx6FrcvBl.NFtJbs2"
    },
    {
        "title": "Deviled Pickled Eggs",
        "ingredients": [
            "1 (16 ounce) can sliced beets, drained with liquid reserved ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup distilled white vinegar ADVERTISEMENT",
            "10 whole cloves ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "12 hard-boiled eggs, peeled ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon sweet pickle relish ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure 1 cup beet juice from reserved juice.\nCombine 1 cup beet juice, sugar, vinegar, cloves, salt, pepper, and bay leaves in a saucepan; bring to a boil. Reduce heat and simmer until sugar is dissolved, about 5 minutes.\nPlace beets and eggs into a large bowl. Pour beet juice mixture over beets and eggs. Refrigerate for 3 days. Drain and discard pickling liquid.\nCut each egg in half lengthwise and scoop yolks into a bowl. Mix mayonnaise, relish, and mustard into egg yolks until smooth. Spoon egg yolk filling back into each egg white. Serve beets and eggs on a platter.\n",
        "picture_link": "K7arUFqSMTob0bRpcyoRJCuMrFxnhpu"
    },
    {
        "title": "Creamy Mustard Yogurt Sauce",
        "ingredients": [
            "1/4 cup spicy brown mustard ADVERTISEMENT",
            "1/4 cup plain Greek yogurt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mustard, yogurt, and garlic powder together in a bowl until even in color. Cover bowl with plastic wrap and refrigerate 1 hour before serving.\n",
        "picture_link": "WBM7PWOxW7b1AEZ54kkFI/jz8RFxrMC"
    },
    {
        "title": "Chocolate Cinnamon Roll Bread Machine Bread",
        "ingredients": [
            "1/4 cup water ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 1/3 cups bread flour ADVERTISEMENT",
            "1/4 cup sucralose and brown sugar blend (such as Splenda® brown sugar blend) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon cocoa powder (such as Hershey's®) ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "1/2 cup peanut butter chips (such as Reese's®) ADVERTISEMENT",
            "1/4 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, milk, egg, vanilla extract, bread flour, sucralose and brown sugar blend, salt, cinnamon, cocoa powder, yeast, and margarine respectively in the pan of a bread machine. Select a 1 1/2-pound loaf cycle with a light crust and press Start. Add peanut butter chips and semisweet chips when the final knead cycle begins. Cool bread for 10 to 15 minutes before slicing.\n",
        "picture_link": "2a0hckomxdX.LNTOwBnO/0JhEK/8gn6"
    },
    {
        "title": "Denver Omelet Breakfast Taco",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup sliced onion ADVERTISEMENT",
            "1/4 cup chopped cooked ham ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "4 (8 inch) flour tortillas ADVERTISEMENT",
            "1/4 cup salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium-low heat; saute onion, ham, and green bell pepper until onion and bell pepper are tender, 5 to 10 minutes. Pour eggs into ham-vegetable mixture; cook and stir until eggs are scrambled and cooked through, about 5 minutes.\nSprinkle Monterey Jack cheese over egg mixture; cook and stir until cheese is melted, 2 to 3 minutes. Serve egg mixture in tortillas; top with salsa.\n",
        "picture_link": "qUYvcuBAkfwA1MsHzNEMYMKKb2ivSdS"
    },
    {
        "title": "Western Denver",
        "ingredients": [
            "2 eggs, beaten ADVERTISEMENT",
            "1 large red bell pepper, diced ADVERTISEMENT",
            "1 large green bell pepper, diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir eggs, red bell pepper, green bell pepper, and onion together in a bowl.\nHeat a nonstick skillet over medium-high heat. Pour egg mixture into skillet, cook until eggs are set on the bottom, 2 to 3 minutes; flip and cook until eggs are set completely, about 1 minute more.\n",
        "picture_link": "tS0jLxekjyWBDwRb3kPDZIX4aYqrA6K"
    },
    {
        "title": "Cheesy Veggie Soup",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup chopped carrots ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped green pepper ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "6 tablespoons all-purpose flour ADVERTISEMENT",
            "4 cups half-and-half ADVERTISEMENT",
            "12 ounces American cheese, sliced into strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In one pan, melt 1/4 cup butter over medium heat. Saute the onion, carrot, celery, pepper, and tomato in the melted butter until soft. Using a blender or food processor, puree vegetables with vegetable broth; set aside.\nIn a separate pot, melt the remaining 1/2 cup butter. Slowly whisk in flour, and then stir in half and half. When warm, slowly stir in cheese until melted. Mix in veggie puree, and serve.\n",
        "picture_link": "Tz1NHrGblbl6kIFc7chaBGBQYCR34.C"
    },
    {
        "title": "Portuguese Egg Pudding",
        "ingredients": [
            "1/2 teaspoon butter ADVERTISEMENT",
            "12 egg yolks ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup hot water ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "1/2 cup hot water ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "1 lemon peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBeat butter, egg yolks and egg white until smooth. Set aside.\nIn a small saucepan, heat 1 cup sugar and 1/4 cup water over low heat, stirring occasionally, until sugar is melted and golden. Pour into a 2 quart baking dish and turn to coat bottom and sides of dish with the caramel.\nIn another small saucepan, combine 1 1/3 cups sugar, 1/2 cup water, cinnamon stick and lemon peel. Bring to a boil and let boil for 2 minutes. Remove from heat, remove cinnamon stick and lemon peel. Beat syrup, a little at a time, into egg mixture. Pour into caramel-coated dish.\nLine a roasting pan with a damp kitchen towel. Place baking dish on towel, inside roasting pan, and place roasting pan on oven rack. Fill roasting pan with boiling water to reach halfway up the sides of the baking dish.\nBake in preheated oven one hour, until set. Cover the dish part way through cooking if pudding begins to brown. Let cool completely. Invert on a serving dish.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "New York State Special Milk Punch",
        "ingredients": [
            "1 1/2 quarts vanilla ice cream, softened ADVERTISEMENT",
            "3 (46 fluid ounce) cans pineapple juice, chilled ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 quart cold milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a punch bowl, combine ice cream, pineapple juice, orange juice, lemon juice and milk. Stir until ingredients are blended.\n",
        "picture_link": "KxFGmSe1b2A4GnluzOBolB5vtqnhnle"
    },
    {
        "title": "Pina Colada II",
        "ingredients": [
            "1 lemon ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "4 slices canned pineapple ADVERTISEMENT",
            "1 (750 milliliter) bottle white wine ADVERTISEMENT",
            "2 cups lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash lemon very well and cut into fine slices. Put in a gallon jar with sugar. Mince pineapple and put in jar. Pour in wine and soda. Mix with a spoon and refrigerate for 2 hours.\n",
        "picture_link": "dzobjuNx9C7Z411Ayum3SV5.xQLT5Hm"
    },
    {
        "title": "Grilled Tofu Sandwich Filling",
        "ingredients": [
            "1 (16 ounce) package firm tofu ADVERTISEMENT",
            "1 cup honey mustard sauce ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven to broil.\nCut the tofu cake into 4 pieces. Slice each piece very thinly, then lay the tofu strips on a paper towel and blot them dry to remove excess moisture. Place the dry strips in a bowl and cover them with the honey mustard sauce. Cover the bowl and refrigerate for at least 3 hours, stirring occasionally.\nBroil for 5 minutes, then flip the tofu and broil for another 5 minutes, or until the tofu is hot.\n",
        "picture_link": "AMk15/BJEOkKc8yhQ4hATsvpfuPP2Qu"
    },
    {
        "title": "Lemon Cream Pie",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "1 (16.5 ounce) package lemon bar mix ADVERTISEMENT",
            "1/4 cup finely chopped blanched almonds ADVERTISEMENT",
            "1 1/2 cups cold water ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 drops yellow food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Crust: In a 10 inch skillet over medium heat, melt butter or margarine. Stir in dessert bar crust mix and almonds. Cook 4 minutes, stirring constantly, until mixture begins to brown and crumble.\nReserve 2 tablespoons of crust mixture for topping. Use the back of a fork to press remaining crust mixture into an ungreased 9 inch deep dish pie plate. Cool completely.\nTo Make Filling: Pour cold water into a 2 quart non-aluminum saucepan. Sprinkle gelatin over water and allow to soften 5 minutes. Using a wooden spoon, stir dessert bar filling mix into gelatin, mixing until smooth. Cook over medium-high heat, stirring constantly, until mixture thickens and boils. Boil and stir for 1 minute, then remove from heat.\nPlace egg yolks in a medium bowl. Whisk 1/4 cup of hot lemon mixture into egg yolks. Whisk egg yolk mixture back into rest of lemon filling. Return mixture to heat. Boil and stir 1 minute. Remove from heat. Cover and refrigerate.\nIn a medium mixing bowl, combine cream cheese and 1/4 cup of lemon filling (may be slightly warm), beating until smooth. Gradually beat in remaining filling mixture until smooth. Mix in food coloring if desired.\nPour filling into crust. Cover and chill at least 4 hours before serving. Sprinkle reserved almond mixture over top just before serving.\n",
        "picture_link": "4MnhrHhZG42lWSBsqFwVarLG29cl5U2"
    },
    {
        "title": "Marinated Potato Salad with Anchovy Vinaigrette",
        "ingredients": [
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "1/2 cup white wine vinegar ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 (2 ounce) can anchovy filets ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 pounds red potatoes ADVERTISEMENT",
            "1 pound Italian sausage ADVERTISEMENT",
            "2 cups chopped green onions ADVERTISEMENT",
            "1/3 cup chopped parsley ADVERTISEMENT",
            "6 ounces black olives, pitted and halved ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine the oil, vinegar, parsley, salt, sugar, anchovy fillets and garlic. Puree until smooth.\nBring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and cut into cubes. Pour prepared vinaigrette over potatoes and marinate overnight.\nPlace sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nCombine the potatoes and dressing, sausage, green onions, parsley and olives. Toss together well and season with salt and pepper to taste.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mohn Candy",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "2 cups honey ADVERTISEMENT",
            "1 tablespoon tahini ADVERTISEMENT",
            "4 cups poppy seeds ADVERTISEMENT",
            "3 cups chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine the sugar, honey, tahini, and poppy seeds. Stirring constantly, cook the mixture over a low heat until thick, about 30 minutes. Add the nuts and stir well.\nWet a wooden board and pour the mixture onto it. Pat down the mixture with your hands (careful its hot) or a wet spatula until the candy is about 1/2 inch thick. Let cool. Slice with a wet knife into diamond shape pieces.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Refrigerator Cookies with Chocolate Sprinkles",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 (1.75 ounce) package chocolate sprinkles (jimmies) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together the butter and sugar. Stir in the vanilla and oats. Next, combine the flour, baking soda and salt; stir into the creamed mixture. Divide the dough into 3 sections, and shape each section into a log about 8 inches long. Roll each log in the sprinkles to coat, then wrap them in waxed paper and chill overnight.\nPreheat oven to 325 degrees F (165 degrees C). Grease cookie sheets or line them with parchment paper. Cut the cookie dough rolls into 1/4 inch slices and place them 1 inch apart onto the prepared cookie sheets.\nBake for 15 to 20 minutes in the preheated oven. Remove from baking sheet to cool on wire racks.\n",
        "picture_link": "EMstT1Cv2hiT3/Kj6BpO9SEBDnfccyy"
    },
    {
        "title": "Sour Cream Raisin Pie IV",
        "ingredients": [
            "1 prepared 8 inch pastry shell, baked and cooled ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1 1/2 cups raisins ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 1/8 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine cream or milk with vinegar and set aside 5 minutes. Place raisins in a medium saucepan. Pour in enough water to cover, and simmer over low heat for 10 minutes, until plump. Remove from heat, stir in salt, and set aside.\nIn a large saucepan, mix together flour, cornstarch, sugar, cinnamon, and nutmeg. Add egg yolks and blend thoroughly. Mix in cream and vinegar mixture and stir until mixture is smooth. Cook over medium heat, stirring constantly, until mixture boils and thickens. Remove from heat. Stir in vanilla extract and raisins, then set aside to cool.\nIn a medium glass or metal bowl, beat egg whites until foamy. Gradually add 6 tablespoons sugar, continuing to beat until whites are stiff and glossy. Pour cooled raisin mixture into pastry shell. Top with an even layer of meringue.\nBake in preheated oven for 12 to 15 minutes, until meringue is golden brown.\n",
        "picture_link": "rkwcUsd2LlGorYX7Zxo4aKKqlyRsSki"
    },
    {
        "title": "Champagne Pie",
        "ingredients": [
            "2 (9 inch) pie shells, baked ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon butter flavored extract ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups unsweetened pineapple juice ADVERTISEMENT",
            "1 (7.25 ounce) package fluffy white frosting mix ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "1 teaspoon rum flavored extract ADVERTISEMENT",
            "3 ounces cream cheese, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, cream butter or margarine and sugar together until fluffy. Blend in eggs. In a separate bowl, mix together flour and salt, then add to sugar mixture. Stir until ingredients are thoroughly combined.\nAdd butter flavoring, vanilla, and pineapple juice to sugar and flour mixture. Blend well, then pour mixture into a large saucepan or double boiler. Place over medium heat and bring to a boil, stirring constantly. Reduce heat to a simmer and continue to cook mixture an additional 5 minutes, stirring frequently.\nIn a large heatproof mixing bowl, blend frosting mix with boiling water. Beat until stiff, then stir in rum flavoring.\nAdd cream cheese to mixture on stove, and stir just until incorporated. Pour mixture into frosting and blend until smooth. Pour mixture into baked pastry shells and sprinkle with chopped pecans. Chill for 4 hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mock Apple Pie III",
        "ingredients": [
            "2 (9 inch) pie shell ADVERTISEMENT",
            "36 buttery round crackers ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 teaspoons cream of tartar ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nArrange crackers in pastry-lined pie pan and set aside.\nIn medium saucepan, combine water, sugar, and cream of tartar. Stir well and bring to a boil. Reduce heat and simmer for 15 minutes. Remove from heat. Stir in vinegar.\nCool sugar mixture, then pour over crackers. Dot crackers with butter and sprinkle with cinnamon. Cover with second pastry shell. Seal edges and cut steam vents in top.\nBake in preheated oven for 30 minutes or until crust is golden brown. Cool and serve with ice cream or whipped cream if desired.\n",
        "picture_link": "8IDAG8Izz7rFIKujZ4al1edLIWQe/Bi"
    },
    {
        "title": "Herman Doughnuts",
        "ingredients": [
            "8 cups vegetable oil (for frying) ADVERTISEMENT",
            "3 tablespoons shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup Herman Sourdough Starter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, cream together shortening and sugar. Beat in the eggs, Herman starter and milk. In a separate bowl, mix together flour, baking soda, salt and nutmeg. Stir flour mixture into the starter mixture until well blended.\nTurn dough out onto a well floured surface and roll out or flatten to 1/2 inch thickness. Cut out doughnuts with a doughnut cutter. Cover the donuts and let them rise for 1 hour.\nHeat oil in a deep-fryer to 375 degrees F (190 degrees C).\nCarefully slide doughnuts into hot oil. Fry until golden brown on both sides. Drain on paper towels, sprinkle with confectioners' sugar and serve hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tuna Wellingtons with Pimento Cheese Sauce",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 (6 ounce) can canned tuna ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons diced dill pickles ADVERTISEMENT",
            "2 tablespoons chopped pimento ADVERTISEMENT",
            "1 tablespoon chopped green bell pepper ADVERTISEMENT",
            "2 cups all-purpose flour, sifted ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/3 cup vegetable shortening ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 tablespoons chopped pimento ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons diced green bell pepper ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 1/2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 tablespoons minced pimento ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a large mixing bowl, combine tuna fish, mayonnaise, egg, pickles, 2 tablespoons pimentos, and 1 tablespoon chopped green bell pepper. Mix well, and set bowl aside.\nSift together 2 cups flour, baking powder, and salt. Cut in vegetable shortening until mixture resembles coarse crumbs. Stir in 1 cup Cheddar cheese and 2 tablespoons chopped pimento. Add 2/3 cup milk and stir until mixture forms a ball. Knead about 15 times.\nRoll out dough 1/4 inch thick. Cut into 3 inch rounds (should be about 20 rounds total). Spoon a tablespoon of the tuna mixture onto the top half of each round (using 10 rounds). Moisten the edges of these 10 rounds with water and place each of the remaining 10 rounds over each tuna-layer round. Press edges together with the tines of a fork and prick the tops to vent the dough. Place on a cookie sheet.\nBake tuna rounds at 450 degrees F (230 degrees C) for 12 to 15 minutes.\nTo Make Cheese Sauce: In a double-boiler, heat 3 tablespoons butter and add 3 tablespoons chopped bell pepper; cook until softened. Blend in 3 tablespoons flour, and mix until smooth. Add 1 1/2 cups milk and cook, stirring constantly, until thickened. Sift in 1 1/2 cups Cheddar cheese, 2 tablespoons chopped pimento and 1/2 teaspoon salt. Continue to cook until cheese has completely melted.\nServe Tuna Wellingtons with the cheese sauce poured over them.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Poertzelki",
        "ingredients": [
            "1 1/4 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "4 cups all-purpose flour, divided ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "1/4 cup butter, room temperature ADVERTISEMENT",
            "2 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "3 cups raisins ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast in warm water; add sugar and 2 cups flour. Mix to combine, cover bowl with plastic, and let rise about 1 hour.\nMix in remaining flour, eggs, butter, salt, milk, and raisins until fully combined. Cover bowl and let rise again for 1 hour.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nDrop dough by tablespoonfuls in hot fat and cook until brown on both sides. Cookie usually flips over when done on the first side. Be sure fat isn't too hot or your cookie may be raw inside when dark on the outside. Drain on paper towels. Sprinkle with granulated or powdered sugar, if desired.\n",
        "picture_link": "eDQAyb8IoBMdWvdTt76eZUCwOqSKuAm"
    },
    {
        "title": "Loving Loaf",
        "ingredients": [
            "1/2 cup melted butter ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 1/2 cups crushed vanilla wafers ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 8x4 inch bread pans.\nPrepare the topping by combining the 1/2 cup butter, 1/3 cup sugar, vanilla wafers and pecans. Mix together well and press into the bottom of prepared pans.\nCream butter and sugar together. Add eggs one at a time and beat well. Combine milk and vanilla.\nSift flour, baking powder, and salt. Add to batter, alternating with milk; beat well. Pour into prepared loaf pans.\nBake in preheated oven at 350 degrees F (175 degrees C) for 1 hour, or until a toothpick inserted into the cake comes out clean. Remove from oven and cool on wire rack.\n",
        "picture_link": "zv1PkxCCtXNML2/YLYdfi2lixEDol2i"
    },
    {
        "title": "South of the Border DEEE-licious  Chicken Salad",
        "ingredients": [
            "2 boneless chicken breasts, cooked and diced ADVERTISEMENT",
            "2 ripe tomatoes, diced ADVERTISEMENT",
            "1 small red onion, diced ADVERTISEMENT",
            "1 large jicama, diced ADVERTISEMENT",
            "1 bunch fresh cilantro, chopped ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 avocado - peeled, seeded and sliced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the chicken, tomatoes, red onion, jicama, cilantro and lime juice. Toss together well.\nGarnish with slices of avocado, season with salt and pepper and serve immediately.\n",
        "picture_link": "mT6hBXiT9wh/VCaWOxaquNOo8AA9Zbi"
    },
    {
        "title": "Bundt Cake Fruit Celebration",
        "ingredients": [
            "1 (18.25 ounce) package strawberry cake mix ADVERTISEMENT",
            "1 (16 ounce) package cream cheese frosting ADVERTISEMENT",
            "1 (21 ounce) can light blueberry pie filling, refrigerated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare and bake cake mix according to package directions for a 10 inch Bundt pan. Allow to cool completely.\nCover cake with cream cheese frosting. Pour pie filling over frosted cake.\n",
        "picture_link": "dnF2nto.n4Hle1Bl8K5VNKJ7O.ZoABe"
    },
    {
        "title": "Charley's Low Sugar Peanut Butter Pie",
        "ingredients": [
            "1 1/2 cups crushed shredded wheat crackers ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 1/2 teaspoons heat stable artificial sweetener ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/2 (8 ounce) package light cream cheese, softened ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium-size bowl, mix together crushed crackers, pecans, and artificial sweetener. Cut in butter or margarine until mixture is crumbly. Press into a 9 inch pie pan.\nBake in preheated oven for 7 minutes. Remove and cool.\nIn a medium-size mixing bowl, combine cream cheese and peanut butter. Beat until fluffy, then fold in whipped topping. Pour mixture into cooled crust. Chill 2 to 3 hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mocha Cake IV",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2/3 cup coffee flavored liqueur ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons coffee flavored liqueur ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "2 teaspoons instant coffee powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt cake pan.\nIn a large bowl, stir together the cake mix and instant pudding. Add the eggs, oil, coffee flavored liqueur, and water, mix until well blended. Pour into the prepared pan.\nBake for 50 to 60 minutes in the preheated oven, until the cake springs back when lightly touched. Cool in the pan for 10 minutes before inverting onto a wire rack to cool completely.\nIn a small saucepan, heat cream and instant coffee, until hot enough to dissolve coffee crystals. Pour into a bowl. Stir in the confectioners' sugar and coffee flavored liqueur. Pour over warm cake. Let cool before serving.\n",
        "picture_link": "d7LPdY3LVWXTnUevf9MqviKHN2.lHOG"
    },
    {
        "title": "Maids of Honor Tarts II",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "1/4 cup raspberry jam ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 cup ground almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Generously grease 12 2-inch tart tins.\nRoll out pastry. Cut 12 3-inch circles. Reserve pastry scraps. Fit pastry circles into greased tart tins. Spread 1 teaspoon of jam into bottom of each tart shell.\nIn a small mixing bowl, beat together egg, sugar, and salt until light in color. Mix in milk and almonds. Spoon an equal amount of filling into each tart shell. Cut pastry scraps into small strips and form a cross on top of each tart.\nBake in preheated oven for 15 minutes, until tops are golden brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Haystack Pie",
        "ingredients": [
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "1 banana, sliced ADVERTISEMENT",
            "1 cup frozen whipped topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare pudding as per package directions; stir in coconut accordingly. Put 1/2 of this mixture into prepared pie crust.\nSpread banana on top of pudding layer and then cover with remaining 1/2 of the pudding mixture.\nCover and refrigerate to chill for 1 hour; top with whipped topping and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ho Ho Ho Rum Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "1/2 cup light rum ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 (16 ounce) package chocolate frosting ADVERTISEMENT",
            "1/8 cup light rum ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour one 10 inch tube or Bundt pan.\nCombine the cake mix, pudding mix, eggs, water, rum and oil. Mix until smooth and pour into prepared pan.\nBake for 1 hour or until a cake tester inserted in the center comes out clean. Cool for 25 minutes in pan before removing; remove and allow to cool completely.\nPrepare the frosting by blending together the frosting and rum. Ice the cake and sprinkle 1/2 cup chopped pecans over the top. Seal in airtight container.\n",
        "picture_link": "mB2GqzSGw6.Ok3TTR6u.6g3D553e5tK"
    },
    {
        "title": "Coffee Liqueur II",
        "ingredients": [
            "6 cups water ADVERTISEMENT",
            "1/2 cup instant coffee granules ADVERTISEMENT",
            "6 cups white sugar ADVERTISEMENT",
            "1/2 cup vanilla extract ADVERTISEMENT",
            "1/2 gallon vodka ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 4 quart saucepan, bring to a boil the water, instant coffee and sugar. Simmer for 2 hours, then allow to cool. When cool, add vanilla and vodka.\n",
        "picture_link": "tNq9e6A2rLvmTnes3EoPuJANm1x56l."
    },
    {
        "title": "Valentine Heart Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (12 fluid ounce) can white frosting ADVERTISEMENT",
            "1 (18 ounce) jar strawberry glaze ADVERTISEMENT",
            "1 pint strawberries, hulled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven according to package directions.\nPrepare cake mix as directed; lightly grease heart-shaped pan.\nPour cake mix into pan and bake in preheated oven; let cool.\nIce cake with white frosting and pipe frosting around bottom and top edges of cake with cake decorator tips to form a ridge. Spread strawberry glaze on top of cake and decorate with strawberries around edges; use your imagination as you go.\n",
        "picture_link": "6roa4O/LMiu/sM7d3I91Q8dk9AUeoIa"
    },
    {
        "title": "100% Whole Wheat Peanut Butter and Jelly Bread",
        "ingredients": [
            "10 ounces water ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/2 cup strawberry jelly ADVERTISEMENT",
            "1 1/2 tablespoons light brown sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "3 tablespoons vital wheat gluten ADVERTISEMENT",
            "3 1/3 cups whole wheat flour ADVERTISEMENT",
            "1 tablespoon whole wheat flour ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, peanut butter, jelly, brown sugar, salt, baking soda, baking powder, gluten, 3 1/3 cups plus 1 tablespoon whole wheat flour, and yeast, respectively, in the pan of a bread machine. Select 1 1/2 Pound Loaf, Medium Crust, Wheat cycle, and press Start.\n",
        "picture_link": "ydnpqjyu2pJDx2CWnSQ6H4MBMbpFDzS"
    },
    {
        "title": "Apple Cider Chicken with Noodles",
        "ingredients": [
            "3 tablespoons butter, divided ADVERTISEMENT",
            "1 Granny Smith apple, peeled and sliced ADVERTISEMENT",
            "1 tablespoon packed brown sugar ADVERTISEMENT",
            "4 (4 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 onion, sliced into rings and rings separated ADVERTISEMENT",
            "1/2 cup apple cider ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "2 cups cooked wide noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat; cook and stir apples until lightly browned, 5 to 10 minutes. Sprinkle brown sugar over apples and cook until apples are tender, about 5 minutes more. Transfer apples to a plate.\nArrange chicken on a sheet of waxed paper; season both sides with cinnamon, salt, and pepper. Melt remaining butter in the same skillet and cook chicken until browned, 2 to 3 minutes per side. Transfer chicken to a plate.\nCook and stir onion in the same skillet used for chicken until tender, 5 to 10 minutes. Stir cider and vinegar into onion, reduce heat to medium-low, and simmer until sauce is slightly thickened, about 2 minutes.\nReturn chicken to onion mixture, spooning cider sauce over chicken and cook until chicken is no longer pink in the center and the liquid is reduced by half, 5 to 10 minutes more. Spoon apples into chicken mixture and cook until apples are warmed, 2 to 3 minutes.\nArrange noodles on plate, top with chicken, and spoon sauce over chicken.\n",
        "picture_link": "wkNPT09S9KEZlcdTWz9Y8vKmuFJ.LjG"
    },
    {
        "title": "Gluten-Free, Super-Easy Chicken Pad Thai",
        "ingredients": [
            "1 tablespoon tamari (gluten-free soy sauce) ADVERTISEMENT",
            "1 tablespoon maple syrup ADVERTISEMENT",
            "1 tablespoon freshly grated ginger ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken breasts, thinly sliced ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 tablespoon gluten-free all purpose baking flour ADVERTISEMENT",
            "1 tablespoon fish oil ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1 (6.75 ounce) package rice noodles ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "2 cups mushrooms, sliced ADVERTISEMENT",
            "1 bunch green onions, sliced ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "1 fresh red chile pepper, finely chopped (optional) ADVERTISEMENT",
            "2 cups bean sprouts ADVERTISEMENT",
            "1 bunch fresh cilantro, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk tamari, maple syrup, ginger, and garlic together in a large bowl; add chicken and toss to coat. Whisk chicken broth, flour, fish oil, and lime juice together in another bowl.\nPlace noodles in a large bowl and cover with hot water. Set aside until noodles are softened, 10 to 15 minutes. Drain and rinse thoroughly.\nHeat coconut oil in a large skillet or wok over medium-high heat. Cook and stir chicken in hot oil until golden all over, about 5 minutes. Pour chicken broth mixture over chicken and bring to a boil; stir mushrooms, green onion, red bell pepper, and red chile pepper into chicken mixture, cover the skillet with a lid, reduce heat to medium-low, and cook until vegetables are slightly tender, about 5 minutes.\nStir bean sprouts, cilantro, and noodles into chicken mixture; cook and stir until all ingredients are heated through, 3 to 5 minutes.\n",
        "picture_link": "CHVa8AnVf0dnMaNcI.IbBSStPEfNr3S"
    },
    {
        "title": "Lisa's Favorite Mexican Rice",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 teaspoons olive oil, or to taste ADVERTISEMENT",
            "1/2 onion, chopped fine ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1 (1 ounce) packet taco seasoning mix ADVERTISEMENT",
            "4 cups cooked rice ADVERTISEMENT",
            "1 (16 ounce) package southwestern-style mixed frozen vegetables ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained (optional) ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese, divided ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "1/4 cup sliced Kalamata olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Prepare a casserole dish with cooking spray.\nHeat olive oil in a skillet over medium-high heat. Saute onion and garlic in hot oil until the onion is tender, about 5 minutes; add ground beef and continue to cook while breaking beef into small pieces with a wooden spoon until the beef is completely browned, 5 to 7 minutes. Season beef mixture with the taco seasoning mix.\nStir beef mixture, rice, vegetables, kidney beans, 1 cup Cheddar cheese, salsa, and olives together in the prepared casserole dish. Sprinkle remaining cheese over the mixture.\nBake in preheated oven until the cheese is melted and the dish is hot in the center, about 30 minutes.\n",
        "picture_link": "u7K0qzvpVvRby082f1VUlCsH3hz2NUm"
    },
    {
        "title": "Sweet Potato and Cinnamon-Apple Bake",
        "ingredients": [
            "2 large sweet potatoes, peeled and diced ADVERTISEMENT",
            "2 large Honeycrisp apples, diced ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2/3 cup water, or as needed ADVERTISEMENT",
            "2 tablespoons butter, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace diced apples and sweet potatoes in a microwave-safe glass or ceramic loaf pan. Sprinkle cinnamon and nutmeg over apple mixture; add enough water to leave 1/2-inch water in bottom of pan.\nCook in microwave until the potatoes have softened are easily pierced with a fork, about 8 minutes; drain. Dot apple mixture with butter.\nBake in preheated oven until potatoes and apples are completely softened, about 10 minutes.\n",
        "picture_link": "aUO7Tm867tyAe71bdJujhMo3.QTzcuK"
    },
    {
        "title": "Bolo de Fuba Cremoso (Creamy Cornmeal Cake)",
        "ingredients": [
            "4 cups milk ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 1/2 tablespoons softened butter ADVERTISEMENT",
            "1 1/2 cups grated coconut ADVERTISEMENT",
            "1 cup cornmeal ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease a 9-inch cake pan.\nCombine milk, sugar, eggs, Parmesan cheese, and butter in a blender; blend until smooth, about 5 minutes. Add coconut, cornmeal, and flour; blend until creamy. Add baking powder and salt and blend until smooth. Pour into the prepared cake pan.\nBake in the preheated oven until top is golden brown and edges pull away from the sides of the pan, about 30 minutes.\n",
        "picture_link": "ChQlKTnm2M2uDe5aw6Ij0Yq9DtWqhHG"
    },
    {
        "title": "Mexican Fiesta Bites",
        "ingredients": [
            "1/4 cup fat-free refried beans ADVERTISEMENT",
            "12 Original Snack Factory® Pretzel Crisps® ADVERTISEMENT",
            "1 teaspoon taco seasoning mix, or to taste ADVERTISEMENT",
            "1/4 cup guacamole ADVERTISEMENT",
            "1/4 cup salsa ADVERTISEMENT",
            "1/4 cup reduced-fat sour cream ADVERTISEMENT",
            "1 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro, or to taste ADVERTISEMENT",
            "12 slices black olives ADVERTISEMENT",
            "1 tablespoon shredded Cheddar cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Smooth about a teaspoon of refried beans over the top of the Snack Factory(R) Pretzel Crisps(R). Sprinkle lightly with taco seasoning.\nAdd a layer of guacamole, then salsa, and a dollop of sour cream.\nTop with some chopped tomatoes, a sprinkle of chopped cilantro, and Cheddar cheese. Place an olive slice on the top.\n",
        "picture_link": "n/nRVbR0oGqpJAuJpSz5THZeV5IRRhC"
    },
    {
        "title": "Sunny Poutine",
        "ingredients": [
            "1 (16 ounce) package frozen French fries ADVERTISEMENT",
            "12 slices bacon ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup prepared hollandaise sauce ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Arrange frozen French fries in a single layer on a baking sheet.\nBake in the preheated oven until golden, about 20 minutes; keep warm.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble when cool enough to handle.\nHeat a large skillet over medium heat; spray with cooking spray. Crack eggs into skillet; season with salt and pepper. Reduce heat to medium low, cover skillet loosely, and cook until egg whites are firm and yolks are still runny, about 3 minutes.\nDivide French fries onto 4 plates; sprinkle evenly with crumbled bacon. Drizzle each serving with hollandaise sauce, sprinkle with chives, and top with an egg.\n",
        "picture_link": "Q5SjqNGjVsSVg95gDjNZkjORyPwKmeq"
    },
    {
        "title": "Gluten-Free Butter Crepes with Orange Blossom Honey Butter",
        "ingredients": [
            "Crepes: ADVERTISEMENT",
            "2 eggs, room temperature ADVERTISEMENT",
            "1 cup milk, room temperature ADVERTISEMENT",
            "3/4 cup all-purpose gluten-free flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 cup LAND O LAKES® Unsalted Butter, melted ADVERTISEMENT",
            "1/2 teaspoon LAND O LAKES® Unsalted Butter, or as needed for the pan ADVERTISEMENT",
            "Filling & Topping: ADVERTISEMENT",
            "6 tablespoons LAND O LAKES® Butter, at room temperature ADVERTISEMENT",
            "6 tablespoons orange blossom honey ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk eggs, salt and milk together in a mixing bowl. While whisking, add the flour 1/4 cup at a time, making sure it is well combined before adding the next. Stir in 1/4 cup melted butter.\nIn a separate bowl, mix 6 tablespoons softened butter, honey and orange zest together. Whip until creamy and smooth.\nHeat a 10-inch crepe pan over medium heat. When hot, add 1/2 teaspoon butter to the pan and spread around with a brush to cover the whole pan. If your pan is non-stick, you will only need to do this once. If your pan is not non-stick you may need to repeat this more often.\nWhisk the batter well, add 1/3 cup of batter to the heated pan; swirl it around to cover the entire surface of the pan. Cook until the edges brown and the crepe moves freely, about 2 minutes.\nFlip the crepe over and cook until evenly cooked. Remove from the pan and continue with the rest of the batter.\nPlace a crepe on a warm plate. Spread 1 1/2 tablespoons filling evenly over one half of the crepe. Fold the crepe twice making a triangle. Do the same with the rest of the crepes. Top with remaining honey butter and serve.\n",
        "picture_link": "ndXocz/uQAPQY02Tb0b6CuGmesZhNg2"
    },
    {
        "title": "Grilled Fish Taco Salad with Avocado Dressing",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "1 large avocado, peeled and pitted ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "2 medium cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "4 (6 ounce) halibut fillets ADVERTISEMENT",
            "1 medium lime ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "8 cups romaine lettuce ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 cup shredded Colby-Jack cheese ADVERTISEMENT",
            "1 cup diced tomatoes ADVERTISEMENT",
            "1 1/2 cups tortilla strips ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make the dressing by combining the avocado, yogurt, garlic, lime juice, honey, 1/2 teaspoon salt and 1/4 teaspoon pepper in a blender. Blend until creamy (the dressing will be thick), then cover and refrigerate the dressing while you make the salad.\nPreheat the grill for 10 minutes on medium heat. Prepare the foil packets by placing two halibut fillets on each sheet of Reynolds Wrap(R) Aluminum Foil. Squeeze the lime juice atop the fillets, then sprinkle them with the cumin and a pinch of salt and pepper. Fold and crimp the edges together to form sealed foil packets.\nPlace the foil packets on the grill, close the lid and grill the fish for 8 to 10 minutes or just until the fish flakes easily and is opaque throughout. Remove the foil packets from the grill and unwrap them.\nPrepare the taco salad by layering the lettuce, beans, cheese, tomatoes and tortilla strips on serving plates. Arrange the grilled fish on top of the salads, drizzle with the avocado dressing and serve.\n",
        "picture_link": "r7NTebtUgCpY06DZOaoB/5HjAlAPjQG"
    },
    {
        "title": "Veggie Rose Tart",
        "ingredients": [
            "1 sheet frozen puff pastry, thawed ADVERTISEMENT",
            "1 1/2 cups ricotta cheese ADVERTISEMENT",
            "1 1/2 tablespoons ricotta cheese ADVERTISEMENT",
            "1/2 cup cubed fresh mozzarella cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 sprig fresh thyme, leaves stripped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "6 carrots, assorted colors ADVERTISEMENT",
            "2 zucchini (courgettes) ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPress puff pastry gently into the bottom and sides of a 9-inch tart tin. Trim off excess pastry and discard. Line pastry with parchment paper and fill with ceramic pie weights or dried beans.\nBake pastry crust in the preheated oven until light golden in color, about 15 minutes. Remove from oven; remove parchment paper and pie weights.\nIncrease oven temperature to 400 degrees F (200 degrees C).\nMix 1 1/2 cup plus 1 1/2 tablespoon ricotta cheese, mozzarella cheese, egg, Parmesan cheese, nutmeg, thyme, and salt together in a bowl. Spoon filling into crust and smooth out the top.\nSlice carrots and zucchini lengthwise into thin strips using a mandoline or vegetable peeler.\nSpread carrots and zucchini strips on a microwave-safe plate; cook in the microwave until slightly soft, 1 to 2 minutes.\nRoll 1 vegetable strip tightly into a rosebud shape. Wrap another strip of the same vegetable around to make a full rose shape. Repeat with remaining strips. Arrange carrot and zucchini roses over the filling in a decorative pattern, alternating colors; brush with olive oil.\nBake tart in the preheated oven until pastry is golden brown, filling is firm, and carrot and zucchini roses are tender, about 40 minutes.\n",
        "picture_link": "ZM6iWy7JdsGGw8ypmlmFB/TtuSDCahK"
    },
    {
        "title": "Micah's 4 1/2-Alarm Chili",
        "ingredients": [
            "1 pound ground beef, or more to taste ADVERTISEMENT",
            "1 onion, chopped, or more to taste ADVERTISEMENT",
            "1 pound bacon ADVERTISEMENT",
            "2 (15 ounce) cans kidney beans, undrained, or more to taste ADVERTISEMENT",
            "2 (15 ounce) cans baked beans, undrained, or more to taste ADVERTISEMENT",
            "1 (28 ounce) can diced stewed tomatoes, or more to taste ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 tablespoons barbeque rub (such as Great American Spice Co.™ Pit Master) ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon habanero-based hot sauce (such as Backdraft Fire Sauce®) ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ground beef and onion in a large skillet over medium heat; cook and stir until browned, 5 to 8 minutes. Pour off excess grease.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain and cut into pieces.\nCombine beef mixture, bacon, kidney beans, baked beans, tomatoes, brown sugar, barbeque rub, chili powder, hot sauce, and garlic powder in a large pot. Cook over medium-low heat, stirring every 30 minutes, until bubbling, 2 to 3 hours. Remove chili from heat and let cool, about 30 minutes.\nRefrigerate chili, 8 hours to overnight.\nReheat chili over low heat, stirring every 30 minutes, for at least 4 hours before serving.\n",
        "picture_link": "3.yIvrrxsfuHUXCZgAscNRuaGiXyMfa"
    },
    {
        "title": "Cheeseburger Rice Skillet",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 zucchini, sliced 1/2-inch thick ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (5.5 ounce) package Knorr® Rice Sides™ - Beef flavor ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 cup grated Cheddar cheese ADVERTISEMENT",
            "Salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown ground beef in skillet over medium to medium-high heat, stirring to crumble. Transfer browned beef to a bowl.\nMelt butter the same skillet; add zucchini and saute until just slightly softened, about 5 minutes.\nReturn ground beef to skillet along with dried onions, water, Knorr(R) Rice SidesTM- Beef, chopped tomatoes, and Worcestershire sauce. Bring to a boil over high heat. Reduce heat to low; cover and cook for 7 minutes. Top with cheese. Let sit 5 minutes before serving.\n",
        "picture_link": "72xMKhjr7rDv0YIh8CWx0U3nq4XJoHC"
    },
    {
        "title": "Baked S'mores Dip",
        "ingredients": [
            "6 (1.5 ounce) bars milk chocolate candy bars (such as Hershey's®) ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "12 marshmallows ADVERTISEMENT",
            "2 (4.8 ounce) packages graham crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nBreak chocolate bars into a saucepan over low heat. Add milk. Heat, stirring constantly, until chocolate is melted, about 5 minutes. Pour into 8-1/2x6-1/2-inch casserole dish. Arrange marshmallows over melted chocolate.\nBake dip in the preheated oven until marshmallows are golden brown, 4 to 7 minutes.\nServe dip with graham crackers.\n",
        "picture_link": "Qk2liWCuNaxSVMEYAaGNOhoFXE8GUhu"
    },
    {
        "title": "Pumpkin Pie Cookies",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 cups canned pumpkin ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 baking sheets with cooking spray.\nMix pumpkin, shortening, and vanilla extract together thoroughly in a bowl. Stir flour, sugar, cinnamon, nutmeg, baking soda, and baking powder into the cookie dough.\nDrop tablespoonfuls of cookie dough 2 inches apart on the baking sheets.\nBake in the preheated oven until golden, 12 to 14 minutes.\n",
        "picture_link": "AfE6rGnZKUbDSfsgZ0f00e8r6DI/.bu"
    },
    {
        "title": "Chicken Bombs",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup finely chopped green onion, or to taste ADVERTISEMENT",
            "1 jalapeno pepper, finely chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "8 chicken tenders ADVERTISEMENT",
            "8 slices bacon ADVERTISEMENT",
            "8 toothpicks ADVERTISEMENT",
            "6 tablespoons pepper jelly ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Set a wire rack on top of a baking sheet.\nMix cream cheese, green onion, jalapeno pepper, salt, and pepper together in a bowl.\nPound chicken tenders into a rectangular shape with the flat side of a meat tenderizer. Place 3 tablespoons of the cream cheese mixture in the middle of each tender; fold into a pouch.\nWrap a slice of bacon around each pouch and secure with a toothpick. Top with some pepper jelly. Arrange on the wire rack.\nBake in the preheated oven until bacon is crisp and chicken juices run clear, about 35 minutes.\n",
        "picture_link": "eXLGAU4HUoCIfCWvpcWsXepPvX0/7jy"
    },
    {
        "title": "\"Spinach Salad\" Chicken Bake",
        "ingredients": [
            "3 skinless, boneless chicken breasts ADVERTISEMENT",
            "1/2 cup honey mustard dressing ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "3 slices bacon ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 small shallots, chopped ADVERTISEMENT",
            "3 cloves garlic, sliced ADVERTISEMENT",
            "3 cups fresh baby spinach leaves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3/4 cup shredded smoked provolone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken, honey mustard dressing, white wine, and black pepper in a gallon-sized resealable plastic bag; seal and shake to mix. Let marinate in the refrigerator, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a baking dish.\nPlace bacon slices in a large skillet and cook over medium-high heat, turning occasionally, until crispy, about 10 minutes. Drain on paper towels.\nHeat olive oil and butter in the same skillet over medium heat until butter is melted. Add shallots and garlic; cook until lightly browned and soft, about 5 minutes. Stir in spinach. Cook, stirring often, until wilted, about 3 minutes. Season with salt and pepper.\nRemove chicken from marinade and place in the prepared baking dish. Discard marinade. Top each chicken breast with 1/3 of the spinach mixture, 1 slice of bacon, and 1/4 cup shredded provolone cheese.\nBake in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 45 minutes.\n",
        "picture_link": "AONgmdoGsM5RGaH2ycsP17aeh0YEl5W"
    },
    {
        "title": "Moist Flourless Chocolate Cupcakes",
        "ingredients": [
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "6 eggs, separated ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C). Line 2 muffin tins with liners.\nCombine chocolate chips and butter in a saucepan over medium-low heat. Stir until melted and smooth, about 3 minutes. Remove from heat. Let cool slightly, about 5 minutes. Whisk in egg yolks.\nBeat egg whites in a large bowl with an electric mixer until soft peaks form. Gradually add sugar with mixer running, beating until peaks are stiff and glossy.\nStir some of the egg whites into the chocolate mixture to lighten it. Pour chocolate mixture into the bowl of egg whites and fold until batter is well-mixed.\nScoop batter into prepared muffin tin, filling each cup 3/4 of the way full.\nBake in the preheated oven until cupcakes are just set in the center, about 25 minutes. Place muffin tin on a wire rack to cool, about 5 minutes. Remove cupcakes from the tin and let cool completely, about 15 minutes.\n",
        "picture_link": "ATqndbTm9Jl93/2vTDkeUjmyBme3n1C"
    },
    {
        "title": "Sunnyside Burger with Chipotle Aioli",
        "ingredients": [
            "Chipotle Aioli: ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 large garlic clove, minced ADVERTISEMENT",
            "1 teaspoon chipotle chile powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "Burgers: ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "5 eggs, divided ADVERTISEMENT",
            "1/4 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "2 garlic cloves, minced ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 slices sharp Cheddar cheese ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "4 hamburger buns, split ADVERTISEMENT",
            "4 lettuce leaves ADVERTISEMENT",
            "4 slices red onion, separated into rings ADVERTISEMENT",
            "4 tomato slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, 1 large garlic clove, chipotle powder, and pinch of salt together in a small bowl; cover and refrigerate.\nPlace ground beef, 1 egg, seasoned bread crumbs, 2 garlic cloves, coriander, black pepper, and 1/4 teaspoon salt in a bowl; mix with your hands until just combined. Shape beef mixture into 4 patties.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook patties on preheated grill until browned on one side, about 6 minutes. Flip patties; continue grilling until no longer pink in the center, about 6 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (71 degrees C). Transfer burgers to a plate; top each burger with a slice of Cheddar cheese and cover plate tightly with foil.\nHeat a nonstick skillet over medium heat; spray with cooking spray. Crack remaining eggs into skillet and immediately reduce the heat to low; season eggs with salt and pepper. Cook eggs until whites are set, about 2 minutes; add 1 tablespoon water to skillet, cover, and cook 1 to 2 minutes more.\nSpread about 1 tablespoon chipotle aioli on bottom of each hamburger bun; top each bun with 1 lettuce leaf, 1 onion slice, 1 tomato slice, and 1 burger. Add one egg to top of each burger; place top of hamburger bun over egg.\n",
        "picture_link": "X2sFl8k1cUqwSNNVd90jOrN2UfgtI3i"
    },
    {
        "title": "Smoked Chicken Hot Wings",
        "ingredients": [
            "Dry Rub: ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons Cajun seasoning ADVERTISEMENT",
            "2 1/2 pounds chicken wings ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "2/3 cup hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 tablespoons white vinegar ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1 pinch salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a smoker to 225 degrees F (110 degrees C) according to manufacturer's directions.\nMix 1 tablespoon salt, pepper, and Cajun seasoning in a small bowl to make dry rub. Sprinkle over chicken wings.\nCook chicken wings in the preheated smoker until tender, 1 to 1 1/4 hour.\nCombine hot pepper sauce, butter, vinegar, Worcestershire sauce, garlic powder, and salt in a small saucepan over low heat. Cook, stirring often, until butter is melted and sauce is smooth. Remove from heat.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nTransfer smoked wings to a large bowl; stir in 1/2 of the sauce until wings are evenly coated.\nGrill coated wings until skin is browned and starting to get crispy, 4 to 5 minutes per side. Transfer to a large bowl and stir in remaining sauce until wings are well-coated.\n",
        "picture_link": "krpr2HTKedmlPCL0.GLdrrhftYwJ2fu"
    },
    {
        "title": "Mighty Melon Green Tea Smoothie",
        "ingredients": [
            "1 cup brewed green tea (such as Gold Peak®), chilled ADVERTISEMENT",
            "1 cup frozen pineapple chunks ADVERTISEMENT",
            "1 cup cantaloupe chunks ADVERTISEMENT",
            "1 pear, cored and cut into chunks ADVERTISEMENT",
            "1/2 cup plain Greek yogurt ADVERTISEMENT",
            "4 fresh mint leaves, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tea, pineapple, cantaloupe, pear, yogurt, and mint leaves in a blender. Blend until smooth.\n",
        "picture_link": "aoPuCy7X/ihiOYKJ4M0dOgKFmYPbVl."
    },
    {
        "title": "Indian Fry Bread (Navajo Tacos)",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 1/2 cups warm water ADVERTISEMENT",
            "2 cups shortening for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, baking powder, and salt in a large bowl. Pour in milk; mix thoroughly. Pour in warm water gradually, kneading dough until soft but not sticky. Cover with plastic wrap and let dough rest, about 15 minutes.\nPinch off egg-shaped balls of dough and place on a flat work surface. Roll out into 1/4-inch thick rounds. Make a small hole in the center of each round.\nMelt shortening in a deep fryer or large saucepan. Working in batches, fry dough rounds in hot shortening until bubbly and golden, 1 to 2 minutes per side. Drain on paper towels.\n",
        "picture_link": "rw.zeQCKQdNdi3bS4kAiPRorgxOGEAG"
    },
    {
        "title": "Grilled Avocado Tacos",
        "ingredients": [
            "2 ears fresh corn, shucked ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 large avocados ADVERTISEMENT",
            "7 ounces black beans, rinsed and drained ADVERTISEMENT",
            "1 jalapeno pepper, seeded and finely chopped ADVERTISEMENT",
            "1 small bunch cilantro, roughly chopped ADVERTISEMENT",
            "2 limes ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "12 corn tortillas ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill to medium-high heat.\nBrush corn with olive oil and individually wrap with Reynolds Wrap(R) Aluminum Foil. Place on the grill, turning frequently for 20 minutes. Allow to cool slightly before handling.\nCut corn off the cob and combine with black beans, jalapeno, cilantro and the juice of 1 lime. Season to taste with salt and pepper and set aside.\nSlice avocados in half and remove the seeds but do not remove the skin yet. Squeeze the juice of the remaining lime over the avocados and lightly brush them with olive oil.\nGrill flesh side down for 2 to 3 minutes and then remove. Quarter each avocado half and then carefully peel off the skin.\nWrap tortillas in foil and place on the grill while the avocados are cooking.\nBuild tacos by placing avocado slices on tortillas and then top with the corn and salsa.\nServe with your favorite hot sauce and additional lime wedges.\n",
        "picture_link": "JVJUwg0gvSLxkNhvL3QcV3wacRqEiR."
    },
    {
        "title": "Easy and Delicious Avocado Dip",
        "ingredients": [
            "2 ripe avocados, peeled and pitted ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash the avocados in a deep bowl. Mix in garlic, salt, and black pepper. Stir in sour cream until well-blended.\n",
        "picture_link": "xw33AUPNaILUvQYyy8wQLgPIVDlaGaq"
    },
    {
        "title": "Actually Delicious Buffalo Turkey Burgers",
        "ingredients": [
            "2 pounds 99%-lean ground turkey ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1/2 cup panko bread crumbs ADVERTISEMENT",
            "1/4 cup Buffalo wing sauce ADVERTISEMENT",
            "1/4 cup chopped fresh parsley (optional) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "12 slices Monterey Jack cheese ADVERTISEMENT",
            "12 hamburger buns, split ADVERTISEMENT",
            "6 tablespoons ranch dressing, or to taste ADVERTISEMENT",
            "6 tablespoons Buffalo wing sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a George Foreman(R) Grill or an outdoor grill for medium-high heat.\nMix ground turkey, onion, panko, 1/4 cup Buffalo wing sauce, parsley, egg, garlic, celery seed, black pepper, cayenne pepper, paprika, and salt together in a large bowl; form into 12 patties.\nGrill patties on the grill for 3 minutes, flip and continue grilling until cooked through, about 2 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nTop each burger with a slice of Monterey Jack cheese and place each inside a bun.\nMix ranch dressing and 6 tablespoons Buffalo wing sauce together in a bowl; spread onto each burger.\n",
        "picture_link": "cajCmwKsuMN6xyfitak2murCTG0EqQG"
    },
    {
        "title": "Butterfly Frosting",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "3 cups sifted confectioners' sugar ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon cream ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "3 drops red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter or margarine. Add part of the sugar gradually, blending after each addition. Add remaining sugar, alternately with egg white, then with cream, beating after each addition until smooth. Stir in vanilla and salt. Divide into different bowls if you wish to make different colours, and tint delicately with colouring. Keep frosting covered to avoid crusting. If necessary, one or two drops of cream or milk may be added to maintain consistency\n",
        "picture_link": "kqUWs58x/0dTm2Ff97Zk5gYqPsGaESi"
    },
    {
        "title": "Crushed Pineapple Fruitcake",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "3 cups golden raisins ADVERTISEMENT",
            "1/2 cup red candied cherries ADVERTISEMENT",
            "1 cup candied mixed fruit peel ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line an angel food pan with parchment paper, and brush with melted butter.\nCream butter or margarine, and then beat in sugar. Beat in eggs one at a time, beating well after each addition. Stir in extract. Mix in flour, baking powder, and salt. Stir in raisins, cherries, pineapple, and mixed peel. Allow this to sit overnight in covered bowl.\nBake at 300 degrees F (150 degrees C) for 2 1/2 hours with a pan of hot water placed on the lowest rack of your oven during baking. Brush warm cake with some melted butter.\n",
        "picture_link": "gMeRB4KY68Q3F0p723KLdOatSDN8Xmi"
    },
    {
        "title": "Apricot Filling and Frosting for Angel Food Cakes",
        "ingredients": [
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 1/2 cups dried apricots, chopped ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup heavy cream, whipped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat apricots by placing them in a bowl, cover with water, and microwave on high for about 10 minutes or until the water is absorbed. Soften gelatin in the cold water. Blend apricots into the gelatin. Add lemon juice, sugar and salt and mix. Chill until slightly thickened (about 1 hour).\nWhip the cooled apricot mixture until frothy. In a separate bowl, whip the cream until soft peaks form. Fold the whipped cream into the apricot mixture.\nSplit cake into 2 or 3 layers. Fill between layers, and frost side and top. Chill overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Three C Bread",
        "ingredients": [
            "3 eggs, beaten ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups grated carrots ADVERTISEMENT",
            "1 (3.5 ounce) package flaked coconut ADVERTISEMENT",
            "1/2 cup maraschino cherries, chopped ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour four 16 ounce fruit or vegetable cans.\nIn a large bowl, sift together flour, sugar, baking powder, baking soda, cinnamon, and salt. Combine the eggs, oil, and milk; add to the sifted ingredients, and mix until just combined. Stir in carrots, coconut, cherries, raisins, and pecans.\nBake for 45 to 50 minutes. Remove from cans, and cool thoroughly. Wrap in plastic wrap or foil, and refrigerate to store.\n",
        "picture_link": "Xwlw27vuhGgH.kc37fZHXPVo.A0Tzge"
    },
    {
        "title": "Flower Pot Challah Bread",
        "ingredients": [
            "1 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons active dry yeast ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scrub the pots in hot soapy water and rinse well. Let them dry overnight. Oil the inside of the pots with vegetable oil, including the rim, until the pot will not absorb any more. Set the pots in a cold oven. Heat the oven to 400 degrees then turn off the heat and leave the pots in the oven to cool. When completely cool, oil them again, and heat them again, using the same process. The pots are now ready for use. Be sure to grease them well before each use, especially around the rim.\nIn a small bowl, melt butter in the warm water.\nIn a separate bowl, mix 4 cups flour, yeast, sugar, and salt. Add eggs and melted butter mixture to form dough. Knead for 5 to 10 minutes, slowly adding more flour. Watch for blisters on the dough, and do not knead too much. Oil top of the bread. Let it rest in a warm place for 2 to 3 hours.\nPush dough down, and let it rise again. Don't let the bread rise too high, or the bread will be tough.\nShape the dough and put it into 2 clean, greased terracotta flower pots. Let loaves rise for 30 minutes more.\nBake in a preheated 350 degree F (175 degree C) oven for 35 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "The All-Good Loaf",
        "ingredients": [
            "1 1/8 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup quinoa flour ADVERTISEMENT",
            "1 cup white spelt flour ADVERTISEMENT",
            "2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add ingredients in order suggested by your manufacturer. Select whole wheat setting.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Screw Pine Cake",
        "ingredients": [
            "1 1/4 cups white sugar ADVERTISEMENT",
            "20 egg yolks ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups butter ADVERTISEMENT",
            "2 (10 ounce) cans coconut milk ADVERTISEMENT",
            "2 tablespoons pandan paste ADVERTISEMENT",
            "1/2 teaspoon green food coloring ADVERTISEMENT",
            "1 tablespoon ovalette ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line one 13x9 inch pan with a greased cake sheet.\nBeat eggs and sugar together until creamy. In a separate bowl, mix ovalette, butter, and coconut milk. Add into the egg mixture and continue mixing until ingredients are blended well. Stir in the sifted flour and salt. Mix well.\nSeparate batter into 2 bowls. Mix one bowl with the pandan paste and the green food coloring , making sure that the color is stirred in well. Pour 1 to 2 soup-ladle scoops of green cake mixture onto pan. Even it out so that the mixture covers the base of the pan\nPour 1-2 soup-ladle scoops of green cake mixture onto pan. Even it out so that the mixture covers the base of the pan. Bake it in a 400 degrees F (200 degrees C) oven until the top is brown. Take it out of the oven, prick the top gently with a fork and brush some butter over the top. Pour 1-2 scoops of the 'normal' colored cake mixture on top of the first layer. Spread evenly.\nChange your oven setting so that you're using the upper fire only (broiler). Increase temperature to 450 degrees F (230 degrees C). Bake the second layer till the top turns brown. Repeat the above procedure, alternating the colors each layer, until there is no cake mix left.\nLet cake cool and cut and serve in finger-size portions. (I do not recommend that this cake be eaten in chunks because it is very rich and high in cholesterol). Refrigerate any uneaten portions. Cake keeps well for 2 weeks if refrigerated. Thaw it for about 1/2 hour before eating.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easter Party Cake",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 3/4 cups sifted cake flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "5 egg whites, stiffly beaten ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 drops red food coloring ADVERTISEMENT",
            "1/2 cup candy-coated milk chocolate eggs ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "4 drops green food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter or margarine and shortening. Add 1 cup sugar gradually, beating until mixture resembles whipped cream.\nSift flour and baking powder together 3 times; add to creamed mixture alternately with milk. Stir in 1 teaspoon vanilla extract and almond extract. Fold in stiffly beaten egg whites carefully. Pour batter into two greased 8 inch round pans.\nBake for 20 to 30 minutes at 375 degrees F (190 degrees C). Cool layers on wire racks.\nTo Make Boiled Icing: Place 1 cup sugar, water, 1/2 teaspoon vanilla, cream of tartar, 2 egg whites, and red food colouring in top of double boiler. Cook, beating constantly, until frosting is thick and creamy.\nFrost cake with icing. Make a nest of green coconut on top of cake, and fill nest with candy eggs. Sprinkle a border of coconut around base of cake. Makes 15-20 servings.\nTo make green tinted coconut, Place coconut in a large plastic bag, put a few drops of green food color in the bag and shake until desired consistency is achieved.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Groom's Cake",
        "ingredients": [
            "9 cups raisins, finely chopped ADVERTISEMENT",
            "6 cups golden raisins ADVERTISEMENT",
            "3 cups dried currants ADVERTISEMENT",
            "1 1/2 pounds chopped candied citron ADVERTISEMENT",
            "1/2 pound candied lemon peel ADVERTISEMENT",
            "1/2 pound chopped candied orange peel ADVERTISEMENT",
            "3 1/3 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "4 teaspoons ground allspice ADVERTISEMENT",
            "1 1/2 teaspoons ground mace ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "2 cups butter ADVERTISEMENT",
            "2 1/4 cups packed brown sugar ADVERTISEMENT",
            "12 eggs, separated ADVERTISEMENT",
            "1 cup brandy ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1 cup molasses ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, sift 3 cups flour with spices. In another bowl, mix raisins, sultana raisins, currants, citron, and citrus rinds; dredge with 1/3 cup flour. Stir raisin mixture into the flour.\nIn a very large bowl, cream the butter or margarine. Beat in sugar, a small amount at a time. Add beaten egg yolks, flour mixture, brandy, chocolate and molasses. Beat egg whites until stiff, and fold them into the batter. Dissolve baking soda in hot water and stir gently into batter. Grease and flour 5 bread pans, and pour batter into prepared pans.\nBake at 275 degrees F (135 degrees C) for 4 hours. Cool. Cut into 275 to 300 slices; wrap each slice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tomato Basil Sherry Bread",
        "ingredients": [
            "1 1/4 cups tomato paste ADVERTISEMENT",
            "1/2 cup sherry ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "2/3 cup diced sun-dried tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients in the bread machine in order suggested by your manufacturer (except for the sun dried tomatoes).\nSelect regular setting, medium crust. At the beep or according to your manufacturer's suggestion add the sun dried tomatoes.\nRemove immediately at end of baking cycle. Let cool and slice, spread with your favorite topping.\n",
        "picture_link": "GmSpqFmft3LKPbXXRjocypZ5wi3U0Cu"
    },
    {
        "title": "Chocolate Date Loaf I",
        "ingredients": [
            "1 cup dates, pitted and chopped ADVERTISEMENT",
            "3/4 cup boiling water ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips, melted ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chopped dates, boiling water, and soda. Stir, and allow to cool.\nWhisk together flour, baking powder, and nuts.\nIn a large mixing bowl, beat together egg, salt, sugar, and vanilla. Blend together melted chocolate and melted butter or margarine; stir into batter. Stir in date mixture. Add flour mixture, and stir to mix. Scrape into a greased 9 x 5 inch loaf pan.\nBake at 350 degrees F (175 degrees C) for 1 hour, or until it tests done. Cool in pan 10 minutes. Remove from pan.\n",
        "picture_link": "tdt3DBLrfJgzEyaXZSDx3OH2kbFLmTu"
    },
    {
        "title": "Lemon Orange Filling",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sugar and flour in a saucepan. Add water gradually, stirring constantly. Slightly beat the egg and yolk, and add with butter, lemon juice, and orange juice to the saucepan. Mix well. Cook and stir over medium heat until mixture comes to a boil and is thickened - about 7 minutes. Cool before spreading on cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sharkie's Green Sauce",
        "ingredients": [
            "4 avocados, peeled and pitted ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend avocados, sour cream, diced tomatoes with green chile peppers, cream cheese, green chile peppers, garlic powder, salt, and lemon juice together in a blender until smooth; refrigerate until chilled, about 30 minutes.\n",
        "picture_link": "uRtoCBj8OgUIKEMMP5GYOwoFnfGWQ46"
    },
    {
        "title": "No-Bake Cookie Dough Truffles",
        "ingredients": [
            "3/4 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/2 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "1 cup finely chopped pecans ADVERTISEMENT",
            "1 1/2 pounds chocolate almond bark (chocolate confectioners' coating) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line baking sheets with waxed paper.\nBeat brown sugar and butter together in a large bowl using an electric mixer until smooth and creamy; add vanilla extract and beat until smooth. Gradually beat flour into creamed butter mixture until smooth; add sweetened condensed milk and beat until smooth. Fold chocolate chips and pecans into cookie dough mixture; shape into 1-inch balls and place on prepared baking sheets. Refrigerate cookie dough balls until chilled, about 2 hours.\nMelt chocolate bark in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Dip each cookie dough ball into melted chocolate using 2 forks to hold the ball. Place dipped ball onto the waxed paper and repeat with remaining balls and chocolate. Chill in refrigerator until set, at least 1 hour.\n",
        "picture_link": "mGANXYiST.xcGOPWaQsUkAvWKO5qdQa"
    },
    {
        "title": "Justin's Honey Buffalo Chicken Wraps",
        "ingredients": [
            "Sauce: ADVERTISEMENT",
            "1/4 cup whiskey (such as Jack Daniel's® Tennessee Honey) ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "2 tablespoons hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "Wraps: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 (6 inch) flour tortillas ADVERTISEMENT",
            "8 slices provolone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir whiskey, brown sugar, ketchup, hot sauce, butter, vinegar, cayenne pepper, red pepper flakes and garlic powder together in a saucepan over medium heat; cook, whisking occasionally, until the mixture begins to bubble, about 5 minutes. Reduce heat to low and cook sauce at a gentle simmer until thickened to the consistency of syrup, about 15 minutes more. Remove from heat to cool.\nHeat olive oil in a large skillet over medium heat. Cook chicken breasts in the hot oil, turning occasionally, until no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nRemove chicken to a cutting board. Use two forks to pull the chicken into shreds.\nDrain and discard oil from skillet, but do not otherwise clean. Return shredded chicken to the skillet. Place skillet over low heat and pour sauce over the chicken; cook and stir until the chicken is coated in sauce and the sauce sticks to the chicken strands, 1 to 2 minutes.\nHeat a clean skillet over low heat. Toast a tortilla in the skillet until warmed, about 1 minute. Flip tortilla and top with 2 slices provolone cheese. Cook until the cheese melts slightly, about 1 minute more. Spoon about one-quarter of the chicken mixture into the tortilla and wrap tortilla around the filling. Repeat with remaining tortillas, cheese, and chicken mixture.\n",
        "picture_link": "0g9jypcX9rT/W/lEWw0cdBJbus/WgyS"
    },
    {
        "title": "Vanilla Layer Cake with Strawberries",
        "ingredients": [
            "1 (18.25 ounce) package golden vanilla cake mix ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "3 cups sliced strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour three 8-inch cake pans.\nBeat cake mix, milk, oil, eggs, and vanilla pudding mix together in a large bowl with an electric mixer on low speed until just blended. Scrape the bowl, increase mixer speed to medium, and beat until batter is smooth, about 4 minutes. Pour batter into prepared cake pans.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 20 to 25 minutes. Cool in the pans for 10 minutes before transferring cakes to a wire rack to cool completely.\nBeat cream cheese, confectioners' sugar, and white sugar together in a bowl with an electric mixer until smooth; fold in whipped topping until frosting is smooth.\nPlace 1 cake on a serving platter. Spread frosting on top of the cake; top frosting with a layer of strawberries. Place 1 cake atop strawberries. Frost cake and top with a layer of strawberries. Place remaining cake atop strawberries, frost the top and sides of the cake, and top with remaining strawberries.\n",
        "picture_link": "MhAvdZaF1I8uT1qFQ82ztZuTxVFio0y"
    },
    {
        "title": "Midnight Nutella® Dip",
        "ingredients": [
            "5 tablespoons chocolate-hazelnut spread (such as Nutella®) ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chocolate-hazelnut spread, milk, honey, and vanilla extract in a small microwave-safe container.\nHeat in microwave oven for 1 minute.\nStir the dip with a toothpick until somewhat smooth; let cool for 2 minutes before eating.\n",
        "picture_link": "rX4jjQxvUHUjE/GX3Y5Y48yAi2WGuDS"
    },
    {
        "title": "Savory Turkey Sausage Quinoa Bites",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 pound ground turkey sausage ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground dried sage ADVERTISEMENT",
            "2 cups cooked quinoa ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "3 green onions, diced ADVERTISEMENT",
            "2 eggs, whisked ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly spray a mini-muffin pan with cooking spray.\nMix turkey sausage, garlic, and sage in a skillet over medium-high heat; cook and stir until browned, about 6 minutes. Drain.\nMix browned sausage mixture, quinoa, Cheddar cheese, Parmesan cheese, green onions, eggs, flour, and black pepper together in a medium bowl until well-blended. Spoon mixture into prepared muffin cups.\nBake in the preheated oven until golden brown, about 20 minutes.\n",
        "picture_link": "iAAIvAgPmh90SZDA0i4psnxGDXhAB/6"
    },
    {
        "title": "Soy-Glazed Corn on the Cob",
        "ingredients": [
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon oyster sauce ADVERTISEMENT",
            "1 tablespoon hoisin sauce ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon sriracha hot sauce ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "6 ears corn, husks removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk soy sauce, oyster sauce, hoisin sauce, red wine vinegar, garlic powder, sriracha hot sauce, and ground black pepper together in a bowl until sauce is smooth.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nPlace corn on the grill and brush with the sauce; cook for 5 minutes. Turn corn and brush the other side with sauce and cook until tender, about 5 minutes more.\n",
        "picture_link": "ZygyMb.JSzT/BGQdYwgFYHEoCx9aN/e"
    },
    {
        "title": "Chef John's Grilled Game Hens ",
        "ingredients": [
            "1 jalapeno pepper, seeded ADVERTISEMENT",
            "1 habanero pepper, seeded ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons sherry vinegar ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 Cornish game hens, halved lengthwise ADVERTISEMENT",
            "1 pinch salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend jalapeno pepper, habanero pepper, garlic, vegetable oil, sherry vinegar, mayonnaise, and 2 teaspoons salt together in a blender until marinade is smooth.\nPlace halved hens in a large bowl. Pour marinade over the chickens and turn to coat completely. Cover the bowl with plastic wrap and marinate in the refrigerator for 3 hours.\nPreheat an outdoor grill for medium heat and lightly oil the grate.\nRemove hens from marinade, shaking off any excess, place hens on a plate, skin-side up. Discard remaining marinade. Season skin-side of hens with salt.\nCook hens on the preheated grill, turning occasionally, until skin is crisped, meat is no longer pink at the bone, and juices run clear, about 45 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "/ruzVLkf59jsFIhOrCGpYKGSISTs7y."
    },
    {
        "title": "Juicy Mango Mai Tai",
        "ingredients": [
            "1/2 cup ice cubes, or as needed ADVERTISEMENT",
            "4 fluid ounces pineapple juice, chilled ADVERTISEMENT",
            "3 fluid ounces mango nectar, chilled ADVERTISEMENT",
            "2 fluid ounces vodka (such as Burnett's®) ADVERTISEMENT",
            "1 1/2 fluid ounces coconut milk ADVERTISEMENT",
            "1 fluid ounce orange juice, chilled (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a glass with ice. Pour pineapple juice, mango nectar, vodka, coconut milk, and orange juice over ice; stir well.\n",
        "picture_link": "gt9VPF7ORGnUkKSbjpxerCyIwMuDUea"
    }
]