[
    {
        "title": "Chiles Rellenos (Stuffed Peppers)",
        "ingredients": [
            "4 fresh poblano chile peppers ADVERTISEMENT",
            "1/2 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "2 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup corn oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place whole peppers over an open flame (gas burner) or under the broiler. Roast, turning frequently until evenly black and blistered. Remove from heat, place in a plastic bag, and let them sweat for a while. This will allow the skins to peel of easily.\nWhile the peppers are sweating, place the ground beef in a skillet over medium-high heat. Cook, stirring to crumble, until evenly browned. When beef is fully cooked, add the onion, garlic and tomato, and cook for a few more minutes. Season to taste with salt and pepper.\nRemove the peppers from the bag, and peel off the burnt skin. You may wish to wear protective gloves. Run peppers under cool running water to rinse away any burnt pieces. Make a small vertical slit in the side of the peppers, and remove the seeds and veins. Stuff each pepper halfway with the ground beef mixture, then fill the rest of the way with shredded cheese. Close the slits, and secure with toothpicks.\nWhip egg whites in a large glass or metal bowl until thick and fluffy. Add the egg yolks, and whip for a minute to blend in.\nMeanwhile, heat 1/4 inch of oil in a large heavy skillet over medium-high heat. Coat the stuffed peppers with a light dusting of flour, then dip them in the egg so they are fully covered. Carefully place in the hot oil, and fry on both sides until golden. Drain on paper towels, then serve on a large platter.\n",
        "picture_link": "ghqUaWdAnic4/BC2l6TLhIuYPE/C78e"
    },
    {
        "title": "Whole Wheat Bread III",
        "ingredients": [
            "1 1/4 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 1/2 tablespoons instant powdered milk ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "3 tablespoons margarine, softened ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "3 cups whole wheat flour ADVERTISEMENT",
            "1/4 cup cornmeal ADVERTISEMENT",
            "2 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients into the pan of the bread machine in the order suggested by the manufacturer. Press Start.\n",
        "picture_link": "dJgot5zazWieeai98wxPiC.0J4ugPL."
    },
    {
        "title": "Potato Cake",
        "ingredients": [
            "2 cups mashed potatoes ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium size mixing bowl combine mashed potatoes, egg, flour, salt (if needed) and garlic salt. Mix well.\nMelt butter in a large frying pan over a low heat. Drop pancake-size (4 inch circles) lumps of mashed potatoes into the frying pan. Pat to flatten to 1/2 to 1 inch thickness. Sprinkle some cheddar cheese onto the mashed potato cake. Spoon more potato mixture over the cheese. Flip the potato cake over when the bottom is browned (about 10 minutes). Brown the other side (about 10 minutes).\n",
        "picture_link": "Z70mMsOKDCzJFQvilo9IFwuzjxE7awG"
    },
    {
        "title": "Cheesy Creamed Spinach Casserole",
        "ingredients": [
            "2 (10 ounce) packages frozen chopped spinach, cooked ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart casserole dish.\nDrain spinach. In a medium mixing bowl combine spinach, soup mix and sour cream. Spoon into greased casserole dish and top with cheese.\nBake in preheated oven about 25 minutes, or until heated through.\n",
        "picture_link": "z///pGLEgO8n53I60EkSNT3mDK9kQ0u"
    },
    {
        "title": "Decadent Pumpkin Muffins",
        "ingredients": [
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 cups canned pumpkin puree ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "1 cup fat free vanilla yogurt ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line two 12 cup muffin pans with paper muffin liners.\nIn a medium bowl, mix the flour, baking soda, salt, baking powder, nutmeg, allspice, cinnamon, and cloves. In a large bowl, beat together the pumpkin, white sugar, brown sugar, applesauce, yogurt, egg whites, and egg. Blend the flour mixture into the sugar mixture, alternating with the water, to form a smooth batter. Fold in the raisins. Transfer to the prepared muffin pan.\nBake 16 to 18 minutes in the preheated oven, until a toothpick inserted in the center of a muffin comes out clean. Cool on wire racks.\n",
        "picture_link": "FNO082ryg8cQ8Wiz8.QdPJNAgmudxtW"
    },
    {
        "title": "Beef and Vegetable Stew",
        "ingredients": [
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (14.5 ounce) can low fat, low sodium beef broth ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "3 potatoes, cubed ADVERTISEMENT",
            "1 sprig fresh rosemary ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "10 ounces button mushrooms, quartered ADVERTISEMENT",
            "1 (10 ounce) package frozen green peas, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove any bits of fat from the meat. Heat the oil in a large pot over medium high heat. Saute the meat in the oil for 10 minutes, or until browned on all sides. Remove meat and set aside.\nAdd the onion and tomato paste to the pot and saute over medium heat for 5 minutes, or until onion is tender, stirring often. Return the meat to the skillet along with the beef broth, combining with the onion and tomato paste mixture. Reduce heat to low, cover and simmer for 1 to 1 1/2 hours, or until meat is tender.\nAdd the carrots, potatoes, rosemary, thyme, bay leaf and crushed red pepper flakes and simmer, covered, for another 45 minutes. (Note: It may be necessary to add some water if the stew seems too thick.)\nFinally, add the mushrooms and the peas and allow stew to heat through, about another 10 to 15 minutes. Remove bay leaf and rosemary sprig before serving.\n",
        "picture_link": "S/1PYe6i9Ajevl21.89X2dfK5r/TDSa"
    },
    {
        "title": "Classic Hollandaise Sauce",
        "ingredients": [
            "3 egg yolks ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 teaspoon cold water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, whisk together egg yolks, lemon juice, cold water, salt and pepper. Melt butter in a saucepan over low heat. Gradually whisk yolk mixture into butter. Continue whisking over low heat for 8 minutes, or until sauce is thickened. Serve immediately.\n",
        "picture_link": "XKHb17u7C/6vBXLbxJxbXQGDLpGigAS"
    },
    {
        "title": "Yorkshire Pudding",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup milk, room temperature ADVERTISEMENT",
            "3 eggs, room temperature ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup beef drippings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour and salt together until blended. Make a well in the flour, add the milk, and whisk until consistent. Beat the eggs into the batter. Add water and beat again until the mixture is light and frothy. Set aside for an hour (or, if it's the day before, cover in the fridge overnight).\nIf the batter has been refrigerated, allow it to come up to room temperature before using. When the roast beef is ready to come out of the oven, ready the mixture.\nPreheat oven to 400 degrees F (205 degrees C).\nPour off drippings from roast beef and measure out desired amount (about 1/2 cup should do). Pour drippings into a 9x12 inch baking dish and place into the oven until the drippings sizzle. Pour the batter over the drippings and bake for 30 minutes (or until the sides have risen and are golden brown). Cut into eight portions and serve immediately.\n",
        "picture_link": "1mswFKHa/ep0wyZck0nwOGo2/7MykKK"
    },
    {
        "title": "Garlic Ranch Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 cup fat free ranch dressing ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the dressing, garlic and basil in a large resealable plastic bag. Add chicken pieces, turning them to coat. Squeeze out air and seal bag. Place in refrigerator for 1/2 hour.\nPreheat grill to medium heat.\nGrill chicken breasts for 6 to 8 minutes on each side, turning occasionally, until juices run clear when pierced with a fork.\n",
        "picture_link": "7QWUxnqDxSHM9JQfNlqhNPXEKQxgzXq"
    },
    {
        "title": "Shortbread Supreme",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, beat the butter and sugar with an electric mixer until light and fluffy. Stir in flour by hand until the dough is smooth. Extra flour can be added if the dough is not stiff enough to roll out.\nOn a floured surface, roll dough to 1/4 inch thickness and cut into desired shapes with cookie cutters. Place 1 inch apart onto ungreased cookie sheets.\nBake for 12 to 15 minutes in the preheated oven, until the edges are lightly browned. Cool on cookie sheets for a few minutes before transferring to wire cooling racks.\n",
        "picture_link": "Xl09Z2Jr8DNm/BRuw3UGHZqGgwuvC02"
    },
    {
        "title": "Garlic Shrimp Pasta",
        "ingredients": [
            "1 pound vermicelli pasta ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound medium shrimp - peeled and deveined ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in a large pot of boiling water with vegetable oil until al dente.\nMeanwhile, place the shrimp in boiling salted water for 3 to 5 minutes, just until they turn pink. Cooking time will depend on the size of the shrimp. Remove the tails, and place in a bowl of warm water.\nIn a microwave safe bowl, mix butter or margarine and minced garlic. Microwave on high for 45 seconds, or until melted. Stir.\nDrain pasta, and transfer to a serving dish. Toss with garlic butter and shrimp. Sprinkle with grated Parmesan cheese. Serve warm.\n",
        "picture_link": "sLdT8efi69pVKerQNE25mN2iwQxk4LK"
    },
    {
        "title": "Pineapple Fried Rice II",
        "ingredients": [
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "3 green onions, thinly sliced including tops ADVERTISEMENT",
            "1 cup diced ham ADVERTISEMENT",
            "1/2 cup peas ADVERTISEMENT",
            "1 (8 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon white pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Spread cooked rice out on a rimmed baking sheet and refrigerate until cooled, about 20 minutes.\nHeat sesame oil in a large skillet or wok over medium-high heat. Cook and stir the green onions, ham, and peas in the hot oil until onions have softened, about 2 minutes. Stir the pineapple chunks into the wok; cook until pineapple begins to darken, about 2 minute. Push ingredients to the side of the wok, and pour beaten egg in the center. Cook until egg begins to set, about 30 seconds. Stir together all contents of the wok.\nMix the cooled rice, sugar, salt, white pepper, and garlic powder into the wok; stir constantly to keep from sticking. Cook until heated through, about 3 minutes. Sprinkle the rice with the soy sauce, and stir to combine.\n",
        "picture_link": "uQ.8Bj1XViCI0uGfKe2.Ynu187DDm8S"
    },
    {
        "title": "Apple Oatmeal Cookies I",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup diced apple without peel ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the shortening and sugar. Beat in the eggs until well blended. Combine the flour, baking powder, cinnamon, nutmeg, and salt; stir into the sugar mixture until well blended. Fold in the walnuts, oats and apples. Drop dough by spoonfuls about 2 inches onto ungreased cookie sheets.\nBake for 12 to 15 minutes in the preheated oven. Let cool on wire racks.\n",
        "picture_link": "sRgQlQ8iF3vmeZkqm0t2Uuy6az6TIa2"
    },
    {
        "title": "Bean with Bacon",
        "ingredients": [
            "1 (16 ounce) package dried navy beans ADVERTISEMENT",
            "9 cups water ADVERTISEMENT",
            "1 pound bacon ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "4 teaspoons chicken bouillon ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/3 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1 (16 ounce) can diced tomatoes ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil the beans in 9 cups of the water and then let sit for one hour. Drain and set aside.\nCook the bacon to your desired texture (it can be soft or crisp, whatever you prefer) and drain except for 1/4 cup grease. Coarsely chop the bacon.\nAdd the onions and celery to the reserved grease and bacon and saute until soft, do not drain. Add the chicken base or cubes, 4 cups water, beans, bay leaf, salt, pepper, and cloves, and simmer for 2 hours.\nStir in the tomatoes with their juice. Serve.\n",
        "picture_link": "zlcVXvlRMdn.sSQDJKTfdZpQWf5DlTe"
    },
    {
        "title": "Carne Guisada II",
        "ingredients": [
            "2 tablespoons cooking oil ADVERTISEMENT",
            "1 pound beef stew meat ADVERTISEMENT",
            "1/2 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 serrano chile peppers, seeded and chopped ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium high heat. Cook beef until evenly brown. Pour off excess fat. Stir in tomato paste, beef broth and water. Season with garlic, chili powder, cumin, black pepper, salt and serrano peppers. Reduce heat, and simmer for 8 to 12 hours.\nDissolve cornstarch in a small amount of water, and stir into simmering stew until thickened, about 5 minutes.\n",
        "picture_link": "77bz28L17Cz.hjpwqomUebR7Rdge5Za"
    },
    {
        "title": "Best Ever Pasta Salad",
        "ingredients": [
            "1 (16 ounce) package dry penne pasta ADVERTISEMENT",
            "2 large cucumbers, peeled and cubed ADVERTISEMENT",
            "2 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "3 tablespoons dried dill weed ADVERTISEMENT",
            "2 tablespoons lemon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add penne pasta and cook for 8 to 10 minutes or until al dente; drain.\nCombine pasta, cucumbers, tomatoes, mayonnaise, sour cream, dill weed and lemon pepper. Serve as is or chill for 45 minutes.\n",
        "picture_link": "h.1ozXqUMrgsh4mD5kJpsgHE60wOQjy"
    },
    {
        "title": "Easy Mac and Cheese Muffins",
        "ingredients": [
            "2 cups uncooked elbow macaroni ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup seasoned dry bread crumbs ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a muffin tin with nonstick cooking spray. In a small bowl, stir together the bread crumbs, olive oil and salt; set aside.\nBring a large pot of lightly salted water to a boil. Add the macaroni and cook for about 8 minutes, it should still be a little bit firm. Remove from the heat, drain and return to the pan; stir in the butter and egg until pasta is evenly coated. Reserve 1/2 cup of sharp Cheddar cheese and stir the remaining Cheddar cheese, milk and mozzarella cheese into the pasta. Spoon into the prepared muffin tin. Sprinkle the reserved cheese and the bread crumb mixture over the tops.\nBake for 30 minutes in the preheated oven, or until the topping is nicely browned. Allow the muffins to cool for a few minutes before removing from the pan. This will allow the cheese to set and they will hold their muffin shape.\n",
        "picture_link": "sNq1KRi6ZSBmnaSsf1QHULKzapfjtMe"
    },
    {
        "title": "Sour Cream Chicken",
        "ingredients": [
            "1 cup sour cream ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the sour cream, soup and wine. Mix well.\nPlace chicken breasts in a 9x13 inch baking dish. Pour sour cream mixture over chicken and bake in the preheated oven for 1 hour.\n",
        "picture_link": "WQtQWQkMuMVgxXx8f9Zua3dqN2xpgSC"
    },
    {
        "title": "Easy Peach Crisp I",
        "ingredients": [
            "1 (29 ounce) can sliced peaches, with juice ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPour canned peaches into a 9x13 inch baking pan; make sure juices cover peaches, if not add a small amount of water to just cover fruit. Mix peaches with 1/2 cup of the sugar and sprinkle cinnamon to taste into mixture.\nSprinkle dry cake mix evenly over top of peach mixture. Poke holes into cake mix to allow juice through. Cut stick of margarine into small pats, placing randomly over the top. Sprinkle with the remaining 1/2 cup of sugar and a light dusting of cinnamon.\nBake in preheated oven for 25 to 30 minutes, or until the juice mixture is bubbly and the top of the cake mix topping is crusty and golden brown.\n",
        "picture_link": "griq4k1Sqd3hJbftw5Ecy6Z6wab56qe"
    },
    {
        "title": "No Bake Chocolate Oatmeal Cookies",
        "ingredients": [
            "2/3 cup maple syrup ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "5 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat combine the maple syrup, oil, cocoa and cinnamon. Boil for three minutes, stirring constantly. Remove from heat and stir in the peanut butter, rolled oats and vanilla until well blended. Drop by heaping spoonfuls onto waxed paper and chill to set, about 30 minutes.\n",
        "picture_link": ".ODkQYEiJgeDkx.6ZnFkhDmJl1b/tEm"
    },
    {
        "title": "BBQ Chicken Salad",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "1 large red bell pepper, diced ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "1 (8.75 ounce) can sweet corn, drained ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "2 tablespoons fat-free mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nLightly oil grate. Grill chicken 10 minutes on each side, or until juices run clear. Remove from heat, cool, and cube.\nIn a large bowl, toss together the chicken, celery, red bell pepper, onion, and corn.\nIn a small bowl, mix together the barbeque sauce and mayonnaise. Pour over the chicken and veggies. Stir, and chill until ready to serve.\n",
        "picture_link": "ccaT4iAcCbabU6nToBGzE1fYB7ofTvG"
    },
    {
        "title": "Yum-Yum Corn",
        "ingredients": [
            "2 (16 ounce) packages frozen corn kernels ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 clove garlic, pressed ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook corn according to package directions. Drain water, then mix in butter, cream cheese, garlic, sugar, salt, and parsley. Spoon into a casserole dish and bake in preheated oven for 30 minutes, until lightly browned on top.\n",
        "picture_link": "wVXk.qLifCU9A1Qk2b3moN558/E613a"
    },
    {
        "title": "Spicy Avocado Chicken",
        "ingredients": [
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 red onion, minced ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 avocado, diced ADVERTISEMENT",
            "Salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir 1 teaspoon salt, 1/4 teaspoon black pepper, and cayenne pepper together in a small bowl; rub evenly into the chicken breasts.\nHeat the olive oil in a skillet over medium heat; cook the chicken in the heated oil until no longer pink in the center and the juices run clear, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nStir the onion, lime juice, and avocado together in a bowl; season with salt and pepper. Spoon over the chicken breasts to serve.\n",
        "picture_link": "uAWVKrKGfTU/J9oa7hncGviDoTQxbMy"
    },
    {
        "title": "Banana Split Cheesecake",
        "ingredients": [
            "2 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "3/4 cup melted butter ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "3 medium bananas, quartered ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "8 maraschino cherries, halved ADVERTISEMENT",
            "1/4 cup chocolate syrup ADVERTISEMENT",
            "1/2 cup pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the melted butter or margarine with the graham crackers and press into the bottom of one 9x12 inch pan.\nBlend the confectioner's sugar and the cream cheese together until smooth. Spread over the graham cracker crumb layer. Layer the crushed pineapple and the bananas over the cream cheese layer. Then spread the whipped topping over the top. Decorate with maraschino cherry halves. Drizzle chocolate syrup over the top and sprinkle with pecans. Chill for at least 4 hours then serve.\n",
        "picture_link": "s07i.TUxZ6fkS5uu3yerSxemb3ycd9."
    },
    {
        "title": "Flavorful Flounder For the Oven",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 pounds flounder fillets, rinsed and patted dry ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "3 tablespoons chopped green onion (optional) ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Prepare a 13x9-inch baking dish with non-stick cooking spray.\nSeason both sides of flounder fillets with salt. Place into prepared baking dish. Brush 1 tablespoon lemon juice over fillets.\nMix Parmesan cheese, melted butter, mayonnaise, green onions, and 2 tablespoons lemon juice in a bowl; spoon over the fillets.\nBake flounder in preheated oven for 10 minutes. Switch oven to broil; broil fillets until the tops are just browned, 3 to 5 minutes.\n",
        "picture_link": "NpwLF6hf0k8O3jNZpmV/3MRbtSDLmxm"
    },
    {
        "title": "Grandpop's Special Chocolate Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup hot, brewed coffee ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, sift together flour, sugar, cocoa, baking powder, soda, and salt.\nAdd oil, milk, vanilla, coffee, and eggs; beat well. Batter will be thin. Pour into two 9 inch greased and floured round pans.\nBake at 325 degrees F (165 degrees C) for 25 minutes, or when top springs back when done. Cool layers on wire racks.\n",
        "picture_link": "7fHJLywNV5sORMAf9McRWktHpUU.kEG"
    },
    {
        "title": "Tortellini Salad",
        "ingredients": [
            "1 (16 ounce) package refrigerated cheese tortellini ADVERTISEMENT",
            "4 ounces sliced pepperoni, quartered ADVERTISEMENT",
            "2 green onions, sliced ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives ADVERTISEMENT",
            "1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "6 ounces mozzarella cheese, diced ADVERTISEMENT",
            "1/3 cup extra-virgin olive oil ADVERTISEMENT",
            "1 1/2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 1/2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 teaspoon dried Italian herb seasoning ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the tortellini according to package instructions, drain in a colander set in the sink, and rinse with cold water.\nPlace the tortellini, pepperoni, green onions, olives, artichoke hearts, and mozzarella cheese in a large salad bowl.\nWhisk together the olive oil, balsamic vinegar, white vinegar, Italian seasonings, and salt and pepper in a bowl, and pour over the salad ingredients. Gently stir to combine, and refrigerate to chill before serving. For even better flavor, let chill in refrigerator for at least 2 hours before serving.\n",
        "picture_link": "ky3b/w5kDUft4TGzph3sSeAcahVpaKa"
    },
    {
        "title": "Mom's Beef Shish Kabobs",
        "ingredients": [
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon coarsely cracked black pepper ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 pounds lean beef, cut into 1-inch cubes ADVERTISEMENT",
            "16 mushroom caps ADVERTISEMENT",
            "8 metal skewers, or as needed ADVERTISEMENT",
            "2 green bell peppers, cut into chunks ADVERTISEMENT",
            "1 red bell pepper, cut into chunks ADVERTISEMENT",
            "1 large onion, cut into large squares ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the vegetable oil, soy sauce, lemon juice, mustard, Worcestershire sauce, garlic, black pepper, and salt together in a bowl; pour into a resealable plastic bag. Add the beef, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator 8 hours or overnight.\nAdd the mushrooms to the bag, coat with the marinade, squeeze out excess air, and reseal the bag; marinate in the refrigerator another 8 hours.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nRemove the beef and mushrooms from the marinade, shaking off any excess liquid. Pour the marinade into a small saucepan and bring to a boil over high heat. Reduce heat to medium-low, and simmer for 10 minutes; set aside for basting.\nThread pieces of green bell pepper, beef, red bell pepper, mushroom, and onion onto metal skewers, repeating until all ingredients are skewered.\nCook the skewers on the preheated grill, turning frequently and brushing generously with the reserved marinade until nicely browned on all sides and the meat is no longer pink in the center, about 15 minutes.\n",
        "picture_link": "iQMV4B8zs9V/kRlz/vUjneyH9CKgUJy"
    },
    {
        "title": "Tiny Pecan Tarts",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "6 ounces cream cheese, softened ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3 cups packed brown sugar ADVERTISEMENT",
            "4 tablespoons melted butter ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Pastry: Cream butter or margarine and cream cheese. Add flour and mix well. Make into 48 balls; place one ball in each cup of a mini tart pan. Use your fingers or a tart tamper to press out into a tart shell.\nTo Make Filling: Break the eggs, but do not beat. Add sugar, melted butter, salt, vanilla and pecans. Mix well. Fill the tart shells. Bake at 350 degrees F (180 degrees C) for about 30 minutes or until delicately browned.\n",
        "picture_link": "RlHqdCJYnEu4/bQWChx4SbZwduI2oWm"
    },
    {
        "title": "Haitian French Toast",
        "ingredients": [
            "1 French baguette ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 dash ground nutmeg ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut loaf ends off and reserve for another use. Cut remaining loaf into 1 1/2 inch slices; let stand 4 hours or overnight.\nIn a 9x13 inch baking pan, combine orange juice, cream, eggs ground cinnamon and white sugar. Place bread slices in pan and turn until liquid is absorbed, about 5 minutes.\nIn a large skillet, melt butter over medium heat. Add bread slices and cook until browned on both sides, about 5 minutes. Dust generously with confectioners' sugar and serve warm.\n",
        "picture_link": "o7adzkZsgYzneOIOohre2DpcVTxdjH2"
    },
    {
        "title": "Zeppole",
        "ingredients": [
            "2 quarts vegetable oil for frying ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer to 375 degrees F (190 degrees C).\nIn a medium saucepan, combine the flour, baking powder, salt and sugar. Stir in the eggs, ricotta cheese and vanilla. Mix gently over low heat until combined. Batter will be sticky.\nDrop by tablespoons into the hot oil a few at a time. Zeppole will turn over by themselves. Fry until golden brown, about 3 or 4 minutes. Drain in a paper sack and dust with confectioners' sugar. Serve warm.\n",
        "picture_link": "ZOS7E6v50SKG5psWwv1uK5nAaoigxWS"
    },
    {
        "title": "Lobster Tails Steamed in Beer",
        "ingredients": [
            "2 whole lobster tail ADVERTISEMENT",
            "1/2 (12 fluid ounce) can beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, over medium to high heat, bring the beer to a boil.\nIf lobster tails are still in the shell, split the shell lengthwise first.\nPlace a steamer basket on top of the saucepan. place thawed lobster tails in basket and cover. Reduce heat and simmer for 8 minutes.\n",
        "picture_link": "vmx5x..U/2SuOCqrBWmjY1YN3H83rjO"
    },
    {
        "title": "Parmesan Potato Soup",
        "ingredients": [
            "4 potatoes, cubed ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon seasoning salt ADVERTISEMENT",
            "1/4 teaspoon sage ADVERTISEMENT",
            "4 1/2 cups chicken broth ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon celery salt ADVERTISEMENT",
            "1/4 teaspoon onion salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "6 cups milk ADVERTISEMENT",
            "12 slices crisp cooked bacon, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the potatoes in boiling water until tender.\nIn a soup kettle, saute onion in butter or margarine until tender.\nStir in flour and spices. Gradually add broth, stirring constantly. Bring to a boil; cook and stir for 2 minutes. Add potatoes, and return to a boil. Reduce heat, cover, and simmer for 10 minutes.\nStir in milk and cheese. Heat through. Stir in bacon.\n",
        "picture_link": "KCgEke5vYm7FyddrBPC8pW9h9jXBaLm"
    },
    {
        "title": "Hard Candy",
        "ingredients": [
            "3 3/4 cups white sugar ADVERTISEMENT",
            "1 1/2 cups light corn syrup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon orange, or other flavored extract ADVERTISEMENT",
            "1/2 teaspoon food coloring (optional) ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, stir together the white sugar, corn syrup, and water. Cook, stirring, over medium heat until sugar dissolves, then bring to a boil. Without stirring, heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads.\nRemove from heat and stir in flavored extract and food coloring, if desired. Pour onto a greased cookie sheet, and dust the top with confectioners' sugar. Let cool, and break into pieces. Store in an airtight container.\n",
        "picture_link": "EDVtvgi7/zTIyKdIePLdeZHi4b6KKZq"
    },
    {
        "title": "Baked Chicken on Rice",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1 1/2 cups uncooked white rice ADVERTISEMENT",
            "2 (4.5 ounce) cans sliced mushrooms ADVERTISEMENT",
            "2 (1 ounce) packages dry onion soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Cut each chicken breast in half to make a total of 8 pieces; set aside.\nMix cream of mushroom soup with milk. Reserve 1 cup of mixture. Combine remaining mixture with rice, undrained mushrooms and 1 envelope of dry onion soup mix.\nSpoon rice mixture into a 9x13 inch baking dish. Arrange chicken pieces on top. Pour reserved soup mixture over chicken and sprinkle with other envelope of onion soup mix. Cover tightly with aluminum foil and bake in preheated oven for 1 hour. Remove cover and bake for an additional 15 minutes. Let cool 10 minutes and serve.\n",
        "picture_link": "KPaPlPHUk1CswCLFsFkAPZr/aQ1No/G"
    },
    {
        "title": "Hamburger Casserole",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "8 ounces egg noodles ADVERTISEMENT",
            "1 (15 ounce) can chili ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1/4 cup salsa ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nIn a large skillet over medium heat, combine the ground beef, onion and celery and saute for 10 minutes, or until the meat is browned and the onion is tender. Drain the fat and set aside.\nIn a separate saucepan, cook noodles according to package directions. When cooked, drain the water and stir in the meat mixture, chili, tomatoes, corn, taco sauce and taco seasoning mix. Mix well and place entire mixture into a 10x15 baking dish.\nBake at 250 degrees F (120 degrees C) for 20 minutes, or until thoroughly heated.\n",
        "picture_link": "I6eHhjers5JFm15fbS/hx6Gvzv7uHSS"
    },
    {
        "title": "Country Seed Bread",
        "ingredients": [
            "3/4 cup water ADVERTISEMENT",
            "4 teaspoons honey ADVERTISEMENT",
            "4 teaspoons canola oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/3 cups bread flour ADVERTISEMENT",
            "2/3 cup whole wheat flour ADVERTISEMENT",
            "3 tablespoons flax seed ADVERTISEMENT",
            "4 teaspoons sesame seeds ADVERTISEMENT",
            "2 teaspoons poppy seeds ADVERTISEMENT",
            "1 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast seeds on a baking sheet in a 350 degree F (175 degree C) oven for 4 minutes; let cool completely. This step is optional. The seeds can be added untoasted.\nPlace ingredients in the bread machine pan in the order suggested by the manufacturer.\nSelect Basic bread cycle, and Start.\n",
        "picture_link": "mk4G6pD6IF6QmB4dxbuC7Lp.qJ4AVW."
    },
    {
        "title": "Old Time Chicken Divan",
        "ingredients": [
            "2 heads broccoli, cut into florets ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3 tablespoons sherry ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "2 cooked chicken breast halves - bones and skin removed, cut into 1/4 inch slices ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add broccoli, and cook until just tender, 3 to 4 minutes. Drain and rinse well with cold water to chill. Place drained broccoli into a 9x13 inch baking dish and set aside.\nMelt butter in a saucepan over medium heat. Whisk in flour, and cook, whisking constantly, until the flour begins to turn from white, to a pale beige, about 3 minutes. Whisk in sherry, chicken broth, and heavy cream until smooth. Bring to a boil over medium-high heat, then reduce heat to medium-low and simmer for 5 minutes; season with salt and pepper.\nPour half of the hot cream sauce over the broccoli and top with chicken slices. Stir Parmesan cheese into the remaining sauce, and pour over the chicken slices. Sprinkle top with extra cheese, if desired.\nBake in preheated oven for 20 minutes or until heated through, then broil for a few minutes until top has turned golden brown.\n",
        "picture_link": "0ptoKq5vY5g9AOYBCTloS.UEkUDs4LK"
    },
    {
        "title": "How to Make Perfect Hard Boiled Eggs  ",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs into a saucepan and pour in cold water to cover; place over high heat. When the water just starts to simmer, turn off heat, cover pan with a lid, and let stand for 17 minutes. Don't peek.\nPour out the hot water and pour cold water over eggs. Drain and refill with cold water; let stand until eggs are cool, about 20 minutes. Peel eggs under running water.\n",
        "picture_link": "ysXWkrC7TM6HOzViuiLs0iDVzu8BzjW"
    },
    {
        "title": "Classic Cuban Midnight (Medianoche) Sandwich",
        "ingredients": [
            "4 sweet bread rolls ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup prepared mustard ADVERTISEMENT",
            "1 pound thinly sliced cooked ham ADVERTISEMENT",
            "1 pound thinly sliced fully cooked pork ADVERTISEMENT",
            "1 pound sliced Swiss cheese ADVERTISEMENT",
            "1 cup dill pickle slices ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Split the sandwich rolls in half, and spread mustard and mayonnaise liberally onto the cut sides. On each sandwich, place and equal amount of Swiss cheese, ham and pork in exactly that order. Place a few pickles onto each one, and put the top of the roll onto the sandwich. Brush the tops with melted butter.\nPress each sandwich in a sandwich press heated to medium-high heat. If a sandwich press is not available, use a large skillet over medium-high heat, and press the sandwiches down using a sturdy plate or skillet. Some indoor grills may be good for this also. Cook for 5 to 8 minutes, keeping sandwiches pressed. If using a skillet, you may want to flip them once for even browning. Slice diagonally and serve hot.\n",
        "picture_link": "4WvIN24FSYlP3MNTDZEajYuLYwCI1PC"
    },
    {
        "title": "Texas-Style Baked Beans",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "4 (16 ounce) cans baked beans with pork ADVERTISEMENT",
            "1 (4 ounce) can canned chopped green chile peppers ADVERTISEMENT",
            "1 small Vidalia onion, peeled and chopped ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "3 tablespoons hot pepper sauce (e.g. Tabasco™), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium heat, brown the ground beef until no longer pink; drain fat, and set aside.\nIn a 3 1/2 quart or larger slow cooker, combine the ground beef, baked beans, green chiles, onion and barbeque sauce. Season with brown sugar, garlic powder, chili powder and hot pepper sauce. Cook on HIGH for 2 hours, or low for 4 to 5 hours.\n",
        "picture_link": "SFZ4NHM7cgK8fWoG4oB.b8tn2fSFIn6"
    },
    {
        "title": "Bacon Cheese Puffs",
        "ingredients": [
            "1 pound sliced bacon ADVERTISEMENT",
            "2 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 pound sliced pumpernickel party bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble and set aside.\nPreheat oven to broil.\nIn a medium bowl combine the bacon, cheese, mustard and mayonnaise. Stir well. Arrange party bread on a cookie sheet. Spoon mixture onto each slice of bread.\nBroil for 5 minutes, or until bubbly.\n",
        "picture_link": "VnkP77ewDMRUXiU7oVFSxRZm/mpp.7i"
    },
    {
        "title": "Curry Chicken Salad",
        "ingredients": [
            "3 cooked skinless, boneless chicken breast halves, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1/2 cup low-fat mayonnaise ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the chicken, celery, mayonnaise, and curry powder.\n",
        "picture_link": "i5YKROO4KuEU/9S3i8PDSt/P.aU4IWi"
    },
    {
        "title": "Country Fried Squash",
        "ingredients": [
            "6 pounds butternut squash - peeled, seeded and sliced ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "1 cup oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine egg and milk together in a small bowl, mix well.\nIn a second bowl, combine flour, cornmeal, salt, pepper and garlic salt. Dip squash slices first in the egg mixture, then dredge the squash in the dry mixture.\nHeat 1/2 inch of oil in a deep skillet over medium heat. Fry squash until golden brown.\n",
        "picture_link": "ry1/pbtIq.IvX8SSMVIletRPg/Ib.AK"
    },
    {
        "title": "Batman's Best Caesar Dressing",
        "ingredients": [
            "1 1/2 cups olive oil ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons anchovy paste ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "3 tablespoons sour cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor or blender, combine the olive oil, vinegar, lemon juice, Worcestershire sauce, anchovy paste, mustard, garlic, sour cream and Parmesan cheese. Process until smooth. Pour into a glass container, seal, and refrigerate until ready to use.\n",
        "picture_link": "KRwAZaNJNkry64YlRRIxTuiko1YXw52"
    },
    {
        "title": "Simple Mexican Rice",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 cup uncooked short-grain white rice ADVERTISEMENT",
            "1 3/4 cups chicken broth ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nHeat the oil in a large skillet over medium heat. Add the onion and garlic; cook and stir until onion is translucent. Stir in the chili powder and cumin, and cook for about 30 seconds. Add the rice, chicken broth and tomato paste, and bring to a boil. Transfer to a 1 quart casserole dish, and cover with aluminum foil or a lid.\nBake for 35 to 40 minutes, or until liquid has been absorbed and rice is tender. Let rest for 3 to 5 minutes before serving.\n",
        "picture_link": "VSiFrKlwoRqTClEJxErTB6gpBMGsnBu"
    },
    {
        "title": "Caramels I",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups corn syrup ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 9x13 inch dish.\nIn a heavy saucepan, combine sugar, corn syrup, 1 cup cream and butter. Bring to a boil, stirring often, then stir in remaining 1 cup cream. Heat, without stirring, to 242 degrees F (116 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball. Remove from heat, stir in vanilla, and pour into prepared dish. Refrigerate.\nWhen cool, return candies to room temperature then cut into 1 inch squares and wrap in waxed paper.\n",
        "picture_link": "JjzB6xMUKdgDbiL8d/9EyMlH7aakSUK"
    },
    {
        "title": "Almond Chicken Casserole II",
        "ingredients": [
            "2 cups uncooked long-grain rice ADVERTISEMENT",
            "1/2 tablespoon butter ADVERTISEMENT",
            "4 tablespoons chopped onion ADVERTISEMENT",
            "2 cups diced celery ADVERTISEMENT",
            "3 cups cooked, chopped chicken breast meat ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/2 cup blanched slivered almonds ADVERTISEMENT",
            "1 cup crushed cornflake crumbs ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. Set aside. Melt 1/2 tablespoon butter in a medium skillet over medium heat; saute onion and celery until soft.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine the chicken, rice, onion and celery in a 9x13 inch baking dish. Stir in mayonnaise and soup, then almonds. Top with crushed cornflakes and 2 tablespoons butter.\nBake in preheated oven for 45 minutes, until golden brown.\n",
        "picture_link": "9pxOFc5TlQ2Ric3U9R9T7b/aT.SedO."
    },
    {
        "title": "Chicken Thigh Fricassee with Mushrooms and Rosemary",
        "ingredients": [
            "4 tablespoons olive oil, divided ADVERTISEMENT",
            "5 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "4 cloves garlic, peeled and halved ADVERTISEMENT",
            "2 tablespoons fresh rosemary, chopped ADVERTISEMENT",
            "1 pound chicken thighs ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "3/4 cup dry white wine ADVERTISEMENT",
            "12 cherry tomatoes ADVERTISEMENT",
            "12 Nicoise olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a large skillet over medium heat. Stir in mushrooms, and cook until soft. Remove to a plate.\nWipe out skillet, and heat 2 tablespoons olive oil over medium-high heat. Place garlic, rosemary, and chicken thighs in hot oil. Season with salt and pepper. Cook, turning chicken, until chicken and garlic are well browned.\nReturn mushrooms to skillet, and sprinkle red pepper flakes over chicken. Pour in white wine, scraping the bottom of the skillet with a wooden spoon. Cook about 3 minutes.\nReduce heat to low; cover, and simmer gently for 1 hour.\nSprinkle tomatoes and olives over chicken, return cover, and cook about 5 minutes more.\n",
        "picture_link": "T0wdCVAQzfvp7shoL7Fh5diy9wtzKPy"
    },
    {
        "title": "Goat Cheese Salmon",
        "ingredients": [
            "4 salmon fillets ADVERTISEMENT",
            "1/2 cup herbed goat cheese ADVERTISEMENT",
            "1/4 cup prepared Dijon mustard mayonnaise blend ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large baking dish.\nArrange the salmon fillets in the baking dish. Make small incisions in each fillet, and stuff with equal amounts of the herbed goat cheese. Spread equal amounts prepared Dijon mustard mayonnaise blend over each fillet. Season with salt and pepper.\nBake salmon 15 minutes in the preheated oven, or until easily flaked with a fork.\n",
        "picture_link": "Qbvw.MARMguwlx0uQVOiwSxAFToBv5K"
    },
    {
        "title": "Herbed Sweet 'n' Sour Chicken",
        "ingredients": [
            "2/3 cup uncooked long-grain white rice ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "6 tablespoons soy sauce ADVERTISEMENT",
            "6 tablespoons honey ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 1/2 teaspoons dried thyme ADVERTISEMENT",
            "1 1/2 teaspoons ground paprika ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix rice and water in a medium saucepan, and bring to a boil. Cover, reduce heat, and simmer 20 minutes, until rice is tender.\nIn a medium bowl, blend the olive oil, soy sauce, honey, and vinegar. Mix in the thyme, paprika, cayenne pepper, allspice, and black pepper.\nPlace chicken breasts in a medium baking dish, and coat with the olive oil mixture.\nPlace chicken in the preheated oven, and, basting occasionally with the olive oil mixture, cook 30 minutes, or until no longer pink and juices run clear. Serve over the rice with remaining olive oil mixture.\n",
        "picture_link": "ZrhLSt01ys5DUTgLNo7genPoPvJ4Zr2"
    },
    {
        "title": "Claire's Yummy Crepes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, sugar and salt in a bowl. Make a well in the center of the flour and add the milk and egg. Beat well to combine.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour the batter onto the griddle, using approximately 1/4 cup for each crepe. Tilt the pan with a circular motion so that the batter coats the surface evenly.\nCook the crepe for about 2 minutes, until the bottom is light brown. Loosen with a spatula, turn and cook the other side. Serve hot.\n",
        "picture_link": "gDJO8QTc4rkcQBWyh5QcZxycLI0YrVC"
    },
    {
        "title": "Pear Honey",
        "ingredients": [
            "8 cups peeled, cored and chopped pears ADVERTISEMENT",
            "1 cup unsweetened pineapple juice ADVERTISEMENT",
            "8 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chopped pears into a large pot, and pour pineapple juice over them to prevent them from browning. Stir in sugar, and bring to a boil over medium-high heat. Stir frequently to prevent scorching. When the pears are at a full boil, reduce heat to medium, and cook until the mixture is the color and texture of honey. The longer you cook it, the thicker it gets. Cooking time is usually 2 to 3 hours.\nLadle into hot sterile jars, filling to within 1/4 inch of the top. Wipe rims with a clean damp cloth, and seal jars with lids and rings. Process in a boiling water canner for 10 minutes, or the amount of time recommended by your local extension for your area.\n",
        "picture_link": "uzrnE2GI05e57yKvs0qMN5l8Ehhabdi"
    },
    {
        "title": "Renaissance Stuffed Mushrooms",
        "ingredients": [
            "12 large mushrooms ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, peeled and minced ADVERTISEMENT",
            "3 tablespoons chopped green onions ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 tablespoons port wine ADVERTISEMENT",
            "1 teaspoon Italian-style seasoning ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 dashes hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRemove stems from mushrooms. Set aside caps. Finely chop stems, discarding hard pieces.\nHeat olive oil in a medium saucepan over medium heat. Stir in mushroom caps, garlic and green onions. Cook and stir until soft, about 4 minutes. Remove from heat and allow to cool until easily handled.\nIn a medium bowl, mix together chopped mushroom stem pieces, cream cheese, port wine, Italian-style seasoning, Parmesan cheese, Cheddar cheese, ground black pepper and hot pepper sauce.\nStuff mushroom caps with the mushroom stem mixture. Arrange on a medium baking sheet and bake in the preheated oven 20 to 25 minutes, or until lightly browned.\n",
        "picture_link": "o4/USfhS4bEZD9MNL2Ri0kQx8CkVZsa"
    },
    {
        "title": "Garlic Pita Bread Bites",
        "ingredients": [
            "1 (10 ounce) package pita bread, cut in half ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 teaspoon crushed garlic ADVERTISEMENT",
            "1 teaspoon dried Italian-style seasoning ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nOpen pita bread halves and roughly cut into approximately 2 inch pieces. Arrange on a medium baking sheet.\nIn a small saucepan over medium heat, melt butter and mix in garlic and dried Italian-style seasoning. Pour the mixture over pita bread pieces.\nSprinkle bread with Parmesan cheese, adjusting the amount as desired. Bake in the preheated oven 10 minutes, or until lightly browned.\n",
        "picture_link": "SFhI6z99w8i1qOx.69z2.ZC1HD8/KfW"
    },
    {
        "title": "Rum Sauce",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 tablespoons white or dark rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a small saucepan over medium heat. Mix together the sugar and cornstarch, and stir into the butter. Pour in milk, and cook stirring frequently until the mixture begins to boil. Continue cooking until thick, stirring constantly. Remove from heat, and stir in rum. Serve warm.\n",
        "picture_link": "vcNkKDqR6JknYMxo0eTz7PftB.Opzby"
    },
    {
        "title": "Tex-Mex Beef and Cheese Enchiladas",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1/2 cup all-purpose flour, divided ADVERTISEMENT",
            "1 1/2 teaspoons sugar ADVERTISEMENT",
            "2 tablespoons cooking oil ADVERTISEMENT",
            "12 (6 inch) corn tortillas ADVERTISEMENT",
            "4 cups shredded American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nHeat the ground beef in a large skillet over medium heat. Cook, stirring to crumble, until no longer pink. Drain off grease and season with chili powder, paprika, cumin, garlic powder, and salt. Mix in the tomato sauce and 2 cups of the water. Simmer over low heat. Mix the remaining water with the flour and sugar until flour is dissolved; stir into the simmering meat sauce. Simmer until thickened, about 10 minutes.\nWhile the sauce is cooking, heat oil in another skillet over medium-high heat. Warm tortillas in the hot oil until pliable. Fill each tortilla with a little bit of cheese, and place in a 9x13 inch baking dish, reserving some of the cheese to sprinkle on top. Pour the meat sauce evenly over the rolled tortillas. Top with remaining cheese.\nBake for 25 minutes in the preheated oven, until cheese is melted and lightly browned.\n",
        "picture_link": "JykpRsfSlUick1txuzSxXK2CF9PqfqW"
    },
    {
        "title": "Famous Restaurant Alfredo Sauce",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup cream cheese ADVERTISEMENT",
            "3/4 cup half-and-half ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "lemon pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package dry fettuccine pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pasta in a large pot of lightly salted boiling water. Cook until tender, about 8 minutes. Drain.\nCombine the butter, cream cheese, and half and half in a saucepan. Season with garlic salt and lemon pepper. Bring to a low boil over medium-low heat. Cook, stirring, until thickened slightly. Serve over 12 ounces of pasta.\n",
        "picture_link": "JXxew392ZE.zGvMviJC8FXaL46osZk6"
    },
    {
        "title": "Baked Acorn Squash",
        "ingredients": [
            "2 acorn squash, halved and seeded ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup butter, diced ADVERTISEMENT",
            "6 tablespoons firmly packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace squash in a shallow baking pan, cut side down.\nBake in preheated oven for 30 minutes, or until tender.\nTurn cut side up; season with salt and pepper, dot with butter and sprinkle with brown sugar and cinnamon.\nBake for 20 minutes more.\n",
        "picture_link": "/0SItXjQ4VKxQDR3ZEnInYZU67Jukqe"
    },
    {
        "title": "Roasted Tomatoes with Garlic",
        "ingredients": [
            "4 cups grape tomatoes ADVERTISEMENT",
            "4 cloves garlic, sliced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Place a piece of aluminum foil over a baking sheet.\nPlace the tomatoes and garlic into a mixing bowl. Drizzle with olive oil, and toss until evenly coated. Season to taste with salt and pepper, then spread evenly onto the prepared baking sheet.\nBake the grape tomatoes in the preheated oven until the skins pop and start to brown, 15 to 20 minutes.\n",
        "picture_link": "7S7JNy.7w19B4cNNKCDC.d2RHvP.SK2"
    },
    {
        "title": "Kalacs (Hungarian Cinnamon Swirl Bread)",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1 1/4 cups warm milk (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "melted butter for brushing ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour, white sugar, salt, and yeast into the bowl of a stand mixer. In a bowl, whisk together egg, melted butter, warm milk, and vanilla extract; pour into the flour mixture. Using dough hook attachment, mix on low until the flour is moistened and a dough forms, then increase speed to medium, and continue kneading until smooth and elastic, 4 to 5 minutes.\nPlace dough into a greased bowl, cover, and allow to rise in a warm place until doubled in bulk, about 1 1/2 hours.\nPunch down dough, turn out onto a floured work surface, and divide into 2 equal pieces. Roll each piece into a 1/3 inch thick rectangle. Brush each square with melted butter. Mix together cinnamon and brown sugar in a small bowl, then sprinkle evenly over the two rectangles.\nRoll each firmly into a log, pinch the ends closed, and tuck them underneath. Place each into a greased, glass loaf pan. Cover, and allow to rise in a warm place until doubled in bulk, about 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBrush the tops of the loaves with melted butter, then bake in preheated oven until loaves are golden brown, and sound hollow when tapped, about 30 minutes.\n",
        "picture_link": "VGzWu297DlsMoJ.TbhGJy0B4Xy3E2rG"
    },
    {
        "title": "Artichoke and Black Olive Baked Chicken",
        "ingredients": [
            "4 bone-in chicken breast halves, with skin ADVERTISEMENT",
            "6 chicken drumsticks ADVERTISEMENT",
            "2 (6.5 ounce) jars marinated quartered artichoke hearts, drained ADVERTISEMENT",
            "1 (15 ounce) can black olives, drained ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 tablespoon chopped fresh tarragon ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken breasts and drumsticks in a 9x13 inch baking dish, bone side down. Spread artichokes and olives around chicken, then mix wine and broth together in a small bowl and pour mixture all over chicken. Sprinkle with tarragon and season with salt and pepper to taste.\nBake at 350 degrees F (175 degrees C) for 1 hour, or until chicken is cooked through (juices run clear) and browned.\n",
        "picture_link": "cGQU9f.s5tgxiy01cbBWDSuZZE3BxzG"
    },
    {
        "title": "Thai Spicy Basil Chicken Fried Rice",
        "ingredients": [
            "3 tablespoons oyster sauce ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 cup peanut oil for frying ADVERTISEMENT",
            "4 cups cooked jasmine rice, chilled ADVERTISEMENT",
            "6 large cloves garlic clove, crushed ADVERTISEMENT",
            "2 serrano peppers, crushed ADVERTISEMENT",
            "1 pound boneless, skinless chicken breast, cut into thin strips ADVERTISEMENT",
            "1 red pepper, seeded and thinly sliced ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "2 cups sweet Thai basil ADVERTISEMENT",
            "1 cucumber, sliced (optional) ADVERTISEMENT",
            "1/2 cup cilantro sprigs (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the oyster sauce, fish sauce, and sugar in a bowl.\nHeat the oil in a wok over medium-high heat until the oil begins to smoke. Add the garlic and serrano peppers, stirring quickly. Stir in the chicken, bell pepper, onion and oyster sauce mixture; cook until the chicken is no longer pink. Raise heat to high and stir in the chilled rice; stir quickly until the sauce is blended with the rice. Use the back of a spoon to break up any rice sticking together.\nRemove from heat and mix in the basil leaves. Garnish with sliced cucumber and cilantro as desired.\n",
        "picture_link": "CAipOl1XKV.CBOnBBkejyLsyhp2jOz."
    },
    {
        "title": "Lemon Pudding Cake I",
        "ingredients": [
            "4 eggs, separated ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup sifted all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat together egg yolks, lemon juice, lemon rind, and butter or margarine until thick and lemon colored. Combine sugar, flour, and salt; add alternately with milk to the yolk mixture, beating well after each addition.\nBeat egg whites until stiff. Blend egg whites into batter on low speed of electric mixer. Pour into 8 inch square baking dish.\nPlace a pan of hot water in the oven, and set the baking dish into the pan. Bake at 350 degrees F (175 degrees C) for 45 minutes.\n",
        "picture_link": "L34/XzcsX40ln1PFr3tbAYRqU/oJW3e"
    },
    {
        "title": "Linnie's Spanish Rice",
        "ingredients": [
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the rice with the garlic in a large saucepan. Pour water and salsa into the rice mixture. Bring the water to a full boil and then reduce the temperature to simmer. Simmer for 20 minutes or until the rice is tender. Fluff the rice when finished.\n",
        "picture_link": "5nK9VQslgZ5IUPbH.3wDqCsi7g9W9lq"
    },
    {
        "title": "Ranch Chicken Tacos",
        "ingredients": [
            "1/2 cup ranch dressing ADVERTISEMENT",
            "1/4 cup reduced-fat sour cream ADVERTISEMENT",
            "1 (1 ounce) packet taco seasoning mix, divided ADVERTISEMENT",
            "1 tablespoon mild chunky salsa ADVERTISEMENT",
            "2 cups shredded rotisserie chicken ADVERTISEMENT",
            "8 (6 inch) corn tortillas ADVERTISEMENT",
            "shredded lettuce ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "4 green onions, sliced ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives ADVERTISEMENT",
            "1 avocado - peeled, pitted and diced (optional) ADVERTISEMENT",
            "1 cup shredded Colby-Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ranch dressing, sour cream, 1 teaspoon taco seasoning, and salsa in a small bowl. Cover and refrigerate until serving.\nToss chicken with remaining taco seasoning. Cover bowl loosely with wax paper or plastic wrap. Microwave chicken until chicken is heated through, about 2 to 3 minutes.\nWarm the tortillas in a skillet for about a minute on each side to make them pliable. Place a scoop of chicken on the tortilla and top with lettuce, tomato, green onion, olives, avocado, cheese, and a spoonful of the ranch dressing mixture.\n",
        "picture_link": "0mkimz3k3zuB2HQhP8RCrVlSn.52Nha"
    },
    {
        "title": "Buffalo Chicken Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup half-and-half cream ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "2 cups cubed cooked chicken ADVERTISEMENT",
            "1/4 cup buffalo wing sauce, or more to taste ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium-high heat; cook the celery and onion in the melted butter until tender, about 5 minutes. Add the flour and allow to cook until absorbed, about 2 minutes more. Slowly stir the half-and-half and water into the mixture. Dissolve the bouillon in the liquid. Stir in the chicken, buffalo wing sauce, and Cheddar cheese. Season with salt and pepper. Reduce heat to medium-low. Stirring occasionally, allow the soup to simmer until the the cheese has melted completely, about 10 minutes.\n",
        "picture_link": "4hLuS3hRijBDVrBySggv.ys1tEvjCBe"
    },
    {
        "title": "Spooky Halloween Eyeballs",
        "ingredients": [
            "1 1/2 cups creamy peanut butter ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar, sifted ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "12 ounces white chocolate, chopped ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "2 drops blue food coloring ADVERTISEMENT",
            "1/2 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "red food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the peanut butter and butter with an electric mixer in a large bowl until smooth. Beat in the sugar and vanilla. Cover and refrigerate for 30 minutes. Roll chilled dough into small, eyeball-sized balls and place on 2 baking sheets lined with wax paper. Refrigerate for another 30 minutes.\nMelt the white chocolate and shortening in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave). Do not overheat or chocolate will scorch. Dip each eyeball into the white chocolate and transfer to the waxed paper until the chocolate has set. You can chill them in the refrigerator.\nStir a few drops of blue food coloring into the remaining melted white chocolate. Make a round \"iris\" on the top of the cooled eyeball and press a mini chocolate chip in the center for a \"pupil.\" For an extra spooky bloodshot eyeballs take a toothpick dipped in red food coloring and make squiggly lines on the eye.\n",
        "picture_link": "9usiapX7Dk1jXfIiib/mnCHc/VA/1gG"
    },
    {
        "title": "Gouda and Spinach Stuffed Pork Chops",
        "ingredients": [
            "4 (6 ounce) thick cut pork chops ADVERTISEMENT",
            "8 slices smoked Gouda cheese ADVERTISEMENT",
            "1/2 pound fresh spinach, rinsed and torn into bite-size pieces ADVERTISEMENT",
            "3 tablespoons horseradish mustard ADVERTISEMENT",
            "1 cup panko crumbs or breadcrumbs ADVERTISEMENT",
            "Creole-style seasoning to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Coat a 9x13 inch baking dish with cooking spray.\nLay each chop flat on cutting board, and with a sharp knife held parallel to the board, cut a pocket into the pork, leaving three sides intact. Stuff each chop with spinach, and then with cheese.\nPlace panko crumbs in a shallow dish. Coat each chop with a thin layer of horseradish, and then roll in crumbs. Arrange chops in prepared baking dish. Sprinkle with Creole seasoning to taste.\nBake in preheated oven for 45 minutes, or until brown and crispy.\n",
        "picture_link": "vuATtui29jgA/SYFRhv.DIWgoVB3a5C"
    },
    {
        "title": "Chef John's Chicken Riggies",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 ounces hot Italian ground sausage meat ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken thighs, roughly chopped ADVERTISEMENT",
            "1/2 cup Marsala wine ADVERTISEMENT",
            "1 (28 ounce) can whole Italian plum tomatoes (such as San Marzano), crushed ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup water, or as needed ADVERTISEMENT",
            "1 1/2 cups chopped hot and sweet peppers ADVERTISEMENT",
            "1/2 cup pitted and chopped kalamata olives ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup chopped Italian flat leaf parsley ADVERTISEMENT",
            "1 pound rigatoni ADVERTISEMENT",
            "1/2 cup grated Parmigiano-Reggiano or Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat. Cook and stir sausage, mushrooms, onions, salt, and black pepper in hot oil until vegetables are softened and sausage is browned, 6 to 7 minutes.\nStir chopped chicken to sausage mixture; cook and stir over medium-high heat until browned, about 5 minutes. Pour in wine and cook, stirring to remove any browned bits off the bottom of the pan, until most of the wine is evaporated, 2 to 3 minutes. Add tomatoes, chicken broth, and cream; simmer for 30 minutes. If needed, add water to create a thick sauce.\nStir peppers, olives, and garlic into sauce. Continue to simmer until thickened, 15 to 20 minutes. Season with salt and pepper to taste and stir in parsley.\nBring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until nearly cooked, about 11 minutes. Drain.\nCombine sauce and cooked pasta, stir in cheese, cover and set aside until pasta has absorbed the sauce, 1 to 2 minutes.\n",
        "picture_link": "p6dhw2lAAa24xW7IZ.Vns/JJRUgzdC6"
    },
    {
        "title": "Beef Chimichangas",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon taco seasoning mix, or more to taste ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "6 (7 inch) corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nBrown the ground beef, onion, garlic, taco seasoning, and oregano in a skillet over medium heat, breaking the meat up into crumbles as it cooks, about 8 minutes. Drain off excess fat. Stir in sour cream, chilies, and vinegar until well mixed. Remove from heat, and mix in the Cheddar cheese.\nMelt margarine in a small skillet over low heat. When melted, dip each tortilla into the margarine for about 30 seconds, or until soft. Place the softened tortilla onto a baking sheet, and fill with about 1/3 cup of the meat mixture. Fold the right and left sides of the tortilla over the filling, then the top and bottom, making an envelope that completely encloses the filling. Flip the tortilla seam side down on the baking sheet. Repeat with remaining tortillas and filling.\nBake in the preheated oven until the tortilla is crisp, about 15 minutes.\n",
        "picture_link": "VB0sUR0VT9NE2yVK/dmTlY3oiSGwlSG"
    },
    {
        "title": "Jalapeno Garlic Tilapia Pasta",
        "ingredients": [
            "2 1/2 cups penne pasta ADVERTISEMENT",
            "1/3 cup margarine, melted ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 (4 ounce) fillets tilapia fillets ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 1/2 tablespoons lemon juice ADVERTISEMENT",
            "2 jalapeno peppers, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 (5 ounce) package baby spinach leaves ADVERTISEMENT",
            "1 roma (plum) tomato, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nWhile the pasta cooks, combine the melted margarine and garlic in a shallow dish. Place the flour in another dish. Dip the tilapia filets in the garlic butter mixture and then immediately coat with the flour. Heat olive oil in a large skillet over medium-high heat. Cook the fish in the oil until golden brown, turning once, about 5 minutes total.\nPour the cream, lemon juice, and remaining garlic and margarine mixture into the skillet. Stir in the jalapenos, salt, black pepper, cayenne pepper, paprika, and garlic powder. Bring to a simmer and allow to cook until sauce has reduced slightly and fish flakes easily with a fork; about 2 minutes. Mix the baby spinach into the sauce and cook until wilted. Stir in the chopped tomato and the cooked pasta.\n",
        "picture_link": "YVJ4cHHLZX6M7n4Ln4l.jeWX6o5Ytn2"
    },
    {
        "title": "Lemon Cream Cheese Bars",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 (8 ounce) packages refrigerated crescent roll dough (such as Pillsbury® Recipe Creations®), divided ADVERTISEMENT",
            "2 lemons, zested and juiced, divided ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line the bottom of a 9x13-inch baking dish with aluminum foil and spray with cooking spray.\nPress 1 can crescent roll dough into the bottom of the prepared baking dish, stretching to the edges.\nMix the zest of 1 1/2 lemons and juice from 2 lemons together in a bowl. Beat cream cheese and 1/2 cup sugar into lemon zest mixture using an electric mixer until smooth and creamy; spread over crescent roll dough layer.\nUnroll the second can of crescent roll dough and layer over cream cheese mixture, gently stretching dough to the edges. Brush melted butter over crescent roll dough layer. Mix remaining lemon zest and 3 tablespoons sugar together in a bowl; sprinkle over butter.\nBake in the preheated oven until top is golden brown, about 30 minutes. Allow to cool for about 20 minutes. Lift dessert from baking dish using foil; transfer to a cutting board. Cut into squares, leaving on foil. Return dessert to the baking dish and refrigerate until chilled, at least 1 hour.\n",
        "picture_link": "wKbB95QCkPPYaHsEvZV6eODA/TpOk/q"
    },
    {
        "title": "Easy Texas Chili",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 large bell pepper, minced ADVERTISEMENT",
            "3 (15 ounce) cans pinto beans ADVERTISEMENT",
            "2 (28 ounce) cans diced tomatoes ADVERTISEMENT",
            "4 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "3 jalapeno peppers, minced (optional) ADVERTISEMENT",
            "1/2 cup chili powder ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir the beef, onion, and bell pepper in a large pot over medium heat until the beef is brown and onion and pepper are tender, about 10 minutes. Drain grease from beef.\nStir in beans, tomatoes, tomato sauce, jalapenos (if using), chili powder, red pepper flakes, black pepper, salt, and garlic powder. Bring mixture to a slow boil; cover and reduce heat. Simmer chili at least 30 minutes, stirring occasionally so that it does not stick. This chili can be simmered for several hours; the longer you simmer, the more flavor you will get.\n",
        "picture_link": "cv5LA8trkjsn8JzeuE6CsTa5c8IUlPW"
    },
    {
        "title": "Crispy Pork Cutlets",
        "ingredients": [
            "2 (1 1/4 pound) fully trimmed pork tenderloins, cut into 8 pieces ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour, or as needed ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3 cups panko bread crumbs ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/3 cup diced dill pickles ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1 bunch green onions, chopped, green tops reserved ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups cold milk, or more as needed ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce, or to taste ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper, or more to taste ADVERTISEMENT",
            "1/2 cup vegetable oil for frying ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound pork with the smooth side of a meat mallet to a thickness of 1/2 inch.\nPlace pork pieces on a plate and season both sides generously with salt and black pepper. Sprinkle 2 tablespoons of flour over pork pieces, lightly coating both sides. Pour eggs over pork, turning to coat.\nTransfer pork pieces to a bowl filled with panko bread crumbs. Press bread crumbs firmly into the meat on both sides. Transfer breaded cutlets to a clean plate, cover with plastic and refrigerate for 15 minutes.\nMelt butter in a skillet over medium heat. Stir in pickles, jalapeno pepper, and green onions; cook and stir until onions have softened, about 3 minutes.\nSprinkle in 1 1/2 tablespoon flour. Cook and stir for 3 minutes.\nSlowly stir in 2 to 3 tablespoons cold milk, whisking constantly. Stir in remaining milk, Worcestershire sauce, and black pepper. Simmer on low for 5 minutes. Taste and adjust seasoning.\nHeat half the vegetable oil in a large skillet over medium-high heat. Add 4 breaded pork cutlets and cook until pork is not longer pink inside, and the crust is well-browned, 4 to 5 minutes per side. Transfer to plate lined with paper towels. Sprinkle with salt. Repeat with remaining vegetable oil and pork cutlets.\n",
        "picture_link": "xGzB1n/wA1wQteXzR6llZdRdKZWbHtW"
    },
    {
        "title": "Fast Salmon with a Ginger Glaze",
        "ingredients": [
            "4 (8 ounce) fresh salmon fillets ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/3 cup cold water ADVERTISEMENT",
            "1/4 cup seasoned rice vinegar ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon hot chile paste (such as sambal oelek) ADVERTISEMENT",
            "1 tablespoon finely grated fresh ginger ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nSeason salmon fillets with salt.\nPlace salmon on the preheated grill; cook salmon for 6 to 8 minutes per side, or until the fish flakes easily with a fork.\nCombine water, rice vinegar, brown sugar, chile paste, ginger, garlic, and soy sauce in a small saucepan over medium heat.\nBring mixture to a boil, reduce heat to medium and simmer until barely thickened, about 2 minutes.\nSprinkle basil on top of salmon; spoon glaze over basil.\n",
        "picture_link": "YT8FKVV9ed3NZkimxPi7qmzFT89zpz6"
    },
    {
        "title": "Winter Leek and Potato Soup",
        "ingredients": [
            "2 tablespoons butter, or more if needed ADVERTISEMENT",
            "2 leeks, cleaned and chopped ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "6 potatoes, peeled and cubed ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "4 ounces shredded Cheddar cheese (optional) ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a pot over medium heat. Cook and stir leeks and onion until vegetables are tender, about 5 minutes.\nStir potatoes and chicken broth into onion mixture; simmer until potatoes are tender, 20 to 25 minutes.\nPour half-and-half into potato soup and continue to simmer until slightly thickened, about 15 minutes more.\nStir Cheddar cheese, parsley, garlic powder, salt, and black pepper into soup until cheese is melted, about 5 minutes.\n",
        "picture_link": "UJuX3wstohXPMWFcOTW9lcnGOmwAyvm"
    },
    {
        "title": "Hard Chocolate Glaze",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "10 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop the chocolate into small pieces. Combine chocolate with butter in the top of a double boiler, over simmering water. Stir frequently until melted and smooth. Remove from heat.\n",
        "picture_link": "xsCWcCcbj/Hrh72rNjGpiKXyzuwy9uu"
    },
    {
        "title": "Slow Cooker Chops",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 1/2 pounds boneless pork chops ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (14.5 ounce) can green beans ADVERTISEMENT",
            "4 potatoes, peeled and cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour soup into slow cooker. Stir in water to thin soup slightly. Season each pork chop with a dash of pepper, and place chops in slow cooker. Cover, and cook on Low for 7 to 8 hours.\nAdd green beans and potatoes, and cook on High for 2 to 2 1/2 hours. Stir, remove from heat, and serve.\n",
        "picture_link": "dIdBFhpVSxGmK1Dzze3PlqaO6Ucq.P2"
    },
    {
        "title": "Chi Tan T'ang (Egg Drop Soup)",
        "ingredients": [
            "8 cubes chicken bouillon ADVERTISEMENT",
            "6 cups hot water ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 green onion, minced ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, dissolve bouillon in hot water. Mix cornstarch with a small amount of water, and stir into bouillon. Add soy sauce, vinegar, and green onion. Bring to a boil, then simmer, stirring occasionally. Gradually pour the beaten eggs into the saucepan while stirring. Serve at once.\n",
        "picture_link": "OCXW5CBqsFMfT/Uhtydlv7o3gk6Esbq"
    },
    {
        "title": "Apple Spice Dump Cake",
        "ingredients": [
            "1 (18.25 ounce) package spice cake mix ADVERTISEMENT",
            "2 (21 ounce) cans apple pie filling ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C.)\nPour the cans of apple pie filling into a 9 x 13 inch rectangular pan.\nIn a small bowl, mix together cinnamon, nutmeg, allspice and sugar. Sprinkle mixture over pie filling.\nPour the dry box of cake mix over apples. Dot with butter and scatter nuts on top.\nBake at 350 degrees F (175 degrees C) for 45 minutes to an hour, until cake is brown on top and bubbling on the sides. Serve warm with ice cream or whipped topping.\n",
        "picture_link": "62yrqdO3W9uICepMSZ/0yoJib.ta6Lq"
    },
    {
        "title": "Quick Lemon Poppy Seed Bread",
        "ingredients": [
            "1 (18.25 ounce) package lemon cake mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 (3 ounce) package instant lemon pudding mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 - 8x4 inch loaf pans.\nIn a large bowl, mix together the cake mix, eggs, oil, pudding mix, water, and poppy seeds. Spread batter into two greased 8x4 inch loaf pans.\nBake at 350 degrees F (175 degrees C) for 25 minutes or until a toothpick inserted into the cake comes out clean.\n",
        "picture_link": "a.thFmlSdtbux6.VRT9PdOWmG1Sx082"
    },
    {
        "title": "Graham Streusel Coffee Cake",
        "ingredients": [
            "1 1/3 cups graham cracker crumbs ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "2/3 cup butter, melted ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon butter flavored extract (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan. Make the streusel: In a medium bowl, combine the graham cracker crumbs, nuts, brown sugar and cinnamon. Stir in the melted butter. Set aside.\nIn a large mixing bowl, combine the cake mix, water, oil, and eggs. Beat on low speed with an electric mixer just until moistened. Beat on medium speed for 2 minutes longer. Spread 1/2 of the batter into a greased 9x13 inch pan. Sprinkle on 1/2 of the streusel mixture. Carefully spread the remaining 1/2 of the cake batter over the streusel, and sprinkle with the remaining streusel.\nBake for 35 to 40 minutes or until a toothpick inserted comes out clean. Cool slightly, then drizzle with the powdered sugar icing. Best if served warm. Makes 12 to 16 servings.\nTo make the Icing: In a small bowl, combine confectioners sugar with vanilla and butter flavoring. Add a few drops of water until you achieve drizzling consistency.\n",
        "picture_link": ".vWxIHtfcFSHez9aIiU2PQPUsrvw3CW"
    },
    {
        "title": "Gingerbread Cupcakes with Cream Cheese Frosting",
        "ingredients": [
            "5 tablespoons unsalted butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup unsulfured molasses ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon Dutch process cocoa powder ADVERTISEMENT",
            "1 1/4 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup hot milk ADVERTISEMENT",
            "2 tablespoons unsalted butter, softened ADVERTISEMENT",
            "2 ounces cream cheese, softened ADVERTISEMENT",
            "2/3 cup sifted confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon lemon extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Butter or line with paper liners a 12-cup muffin tin.\nCream 5 tablespoons of the butter with the white sugar. Add the molasses and the egg and egg yolk.\nSift together the flour, cocoa powder, ginger, cinnamon, allspice, nutmeg and salt. Dissolve the baking soda in the hot milk. Add the flour mixture to the creamed mixture and stir until just combined. Stir in the hot milk mixture. Pour the batter evenly into the prepared tin.\nBake at 350 degrees F (175 degrees C) for 20 minutes or until slightly springy to the touch. Allow to cool a few minutes in the pan and remove to a rack to cool.\nTo Make Frosting: Cream the 2 tablespoons butter and the cream cheese together. Beat in the confectioners' sugar until fluffy. Add the lemon extract and beat. When the cupcakes are cool, frost the tops with the frosting and serve.\n",
        "picture_link": "vtpSUYlHraOeK6ufbyuE49mE62KT0SS"
    },
    {
        "title": "Blueberry Drop Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 1/2 teaspoons lemon zest ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, cream the shortening, sugar, egg, milk, almond extract and lemon zest. Mix well after the addition of each ingredient. Combine the flour, baking powder and salt; blend into the sugar mixture. Fold in the blueberries. Cover and chill for 4 hours.\nPreheat oven to 375 degrees F. Drop dough by teaspoonfuls onto ungreased cookie sheets, about 1 1/2 inches apart.\nBake 12 to 15 minutes in the preheated oven. Let the cookies cool on the baking sheets for a few minutes before transferring to wire racks to cool completely.\n",
        "picture_link": "X949PsuqLlC0xSmCCI/e7j32GsE7OC6"
    },
    {
        "title": "Almost Eggless Egg Salad",
        "ingredients": [
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon sweet pickle relish ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 pound firm tofu, sliced and well drained ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "2 tablespoons minced celery ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine mayonnaise, sweet pickle relish, vinegar, mustard, sugar, turmeric, dill, and parsley. Mix well, and reserve.\nPlace drained tofu in large bowl, and crumble with a fork. Stir in onion and celery. Mix in reserved mixture. Season to taste with salt and pepper. Chill for several hours to allow flavors to blend.\n",
        "picture_link": "vXRxIL9AScRGDwoWGVgBVwJ0Kw.0xda"
    },
    {
        "title": "Spicy Sweet Potato Chips",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "3 large sweet potato, peeled and cut into 1/4-inch slices ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil.\nStir together olive oil, maple syrup, and cayenne pepper in a small bowl. Brush the sweet potato slices with the maple mixture and place onto the prepared baking sheet. Sprinkle with salt and pepper to taste.\nBake in preheated oven for 8 minutes, then turn the potato slices over, brush with any remaining maple mixture, and continue baking until tender in the middle, and crispy on the edges, about 7 minutes more.\n",
        "picture_link": "Z6UafzOjnTGTsNn3YolqUeAu1dtGRgO"
    },
    {
        "title": "Chef John's Blueberry Muffins",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 cups fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease 16 muffin cups, or line with paper muffin liners.\nBeat butter and sugar in a large bowl until light and fluffy, about 3 minutes. Stir in eggs until well mixed. Add vegetable oil, stir to combine. Whisk sour cream, milk, and lemon zest into butter mixture until smooth.\nWhisk flour, baking powder, baking soda, and salt in a small bowl.\nStir half the flour mixture into the butter mixture until combined. Add remaining half of flour mixture and blueberries into the batter, folding together until just combined.\nSpoon batter into prepared muffin cups.\nPlace muffin cups on center rack of the preheated oven and bake until tops are golden and a toothpick inserted into the center of a muffin comes out clean, about 30 minutes.\n",
        "picture_link": "ug.YLsc53nsVB9m5lhQRf/OeyIP/8du"
    },
    {
        "title": "Pfeffernusse Cookies",
        "ingredients": [
            "1/2 cup molasses ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cardamom ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "2 teaspoons anise extract ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the molasses, honey, shortening, and margarine in a saucepan over medium heat; cook and stir until creamy. Remove from heat and allow to cool to room temperature. Stir in the eggs.\nCombine the flour, white sugar, brown sugar, cardamom, nutmeg, cloves, ginger, anise, cinnamon, baking soda, pepper, and salt in a large bowl. Add the molasses mixture and stir until thoroughly combines. Refrigerate at least 2 hours.\nPreheat oven to 325 degrees F (165 degrees C). Roll the dough into acorn-sized balls. Arrange on baking sheets, spacing at least 1 inch apart.\nBake in preheated oven 10 to 15 minutes. Move to a rack to cool. Dust cooled cookies with confectioners' sugar.\n",
        "picture_link": "D0/3teLMdfG1Ne7AD0xD72nUm8kVv2W"
    },
    {
        "title": "Making Crispy Onion Rings",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "2 tablespoons dry potato flakes ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1 cup chilled club soda ADVERTISEMENT",
            "2 cups panko bread crumbs, or as needed ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "2 large onions, cut into 1/4-inch thick slices and separated into rings ADVERTISEMENT",
            "fine salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together flour, cornstarch, dry potato flakes, and cayenne pepper in a large bowl. Whisk in club soda to make a smooth batter.\nPlace panko bread crumbs in a shallow bowl.\nHeat oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C).\nPlace a few onion rings at a time into the bowl of batter and turn to coat all sides with batter.\nRemove onion rings from batter and place into pan of panko bread crumbs; turn to coat completely with crumbs.\nCook a few rings at a time in the hot oil until golden brown, about 2 to 3 minutes.\nTransfer to a cooling rack set over paper towels to drain. Season with salt to taste and serve.\n",
        "picture_link": "hTvmEcTBmMGDpJovvx5LPTADGYvJoUO"
    },
    {
        "title": "Classic Tapioca Pudding",
        "ingredients": [
            "3 cups whole milk ADVERTISEMENT",
            "1/2 cup quick-cooking tapioca ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the milk, tapioca, sugar, and salt in a medium saucepan. Bring the mixture to a boil over medium heat, stirring constantly. Reduce heat to low; cook and stir 5 minutes longer.\nWhisk 1 cup of the hot milk mixture into the beaten eggs, 2 tablespoons at a time until incorporated. Stir the egg mixture back into the tapioca until well mixed. Bring the pudding to a gentle simmer over medium-low heat; cook and stir 2 minutes longer until the pudding becomes thick enough to evenly coat the back of a metal spoon. Remove from the heat and stir in the vanilla. The pudding may be served hot or poured into serving dishes and refrigerated several hours until cold.\n",
        "picture_link": "pWiIk/ar7qq9Lc.R8vBRK14udsDkX0G"
    },
    {
        "title": "Peanut Butter Cup Brownies",
        "ingredients": [
            "1 (19.8 ounce) package brownie mix ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "20 miniature chocolate covered peanut butter cups, unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nCombine brownie mix, oil, egg and water in a large bowl. Stir 50 strokes with a spoon.\nPlace batter in a cupcake pan (cupcake wrappers recommended). Once cups are 3/4 of the way full, place an unwrapped miniature peanut butter cup in the middle, then bake for 30-35 minutes keeping an eye on them while they're baking. Let them cool and then they're ready to eat!!\n",
        "picture_link": "O7GDePXYCIB.H93.jbU6dfkwE/XRZ4O"
    },
    {
        "title": "Jelly Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup raspberry preserves ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease baking sheets.\nCream the butter with the white sugar and brown sugar. Beat in the egg and vanilla.\nMix the flour and baking powder together. Stir in the flour mixture into the butter mixture and combine.\nForm dough into 1 inch balls and place on the prepared baking sheet. Make an indentation in each cookie and fill with jam. Bake at 350 degrees F (175 degrees C) for 12 to 15 minutes. Let cool completely and sprinkle with confectioners' sugar.\n",
        "picture_link": ".JGXNGyvYwFUjVHjzy1IzPcgO6dYsrq"
    },
    {
        "title": "Pie Crust I",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2/3 cup shortening ADVERTISEMENT",
            "6 tablespoons cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour and salt in a large bowl. Cut in shortening with a pastry blender until mixture is completely blended and appears crumbly.\nMix in water, 1 tablespoon at a time, by lightly tossing with a fork. Add only enough water to form mixture into a ball. The dough will be sticky and tough if to much water is added, and it will crack and tear when rolled if too little is added.\nDivide the dough into 2 balls, and roll each out into a circle 1 inch larger than the inverted pie plate.\nFollow these directions for a filled pie. Fold one circle of dough in half, and gently lift. Place into pie plate and unfold. Add filling to pie plate. Fold second circle of dough in half. Gently place over filling, and unfold. With a table knife, cut off excess crust evenly so that 1/2 to 1 inch extends beyond the edge of the pie plate. Fold under the excess dough so that it is even with the edge of the pie plate. Flute the edge of the crust. Cut slits in top crust for steam to escape.\nFollow these directions for 2 prebaked pie shells. Fold circle of dough in half, and gently lift. Place into pie plate and unfold. Either prick the entire surface of dough with a fork, or weight the bottom of the crust with pie weights while baking. Pie weights can be uncooked rice, dried beans, small clean pebbles, or small balls sold as pie weights.\n",
        "picture_link": "/XALFvIvUjAOhBWOVUtiIId/P76WSYO"
    },
    {
        "title": "Apple Butter I",
        "ingredients": [
            "8 apples - peeled, cored and chopped ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a slow cooker with diced apples, sugar, cinnamon, cloves and salt. Cover, and cook on high for 1 hour. Reduce heat. Simmer, stirring occasionally, for 12 hours, or until thick and dark golden in color.\nPack into small, freezer-safe containers leaving 3/4 inch space at the top. Store in the freezer.\n",
        "picture_link": "OSfiO85729EAIG9z23xFD63kNQWzxdy"
    },
    {
        "title": "Hot Spinach Red Pepper Dip",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 cup diced red bell pepper ADVERTISEMENT",
            "1/2 cup thawed frozen chopped spinach ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch freshly ground black pepper ADVERTISEMENT",
            "1 tablespoon finely diced red bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the cup of water to a boil in a small saucepan over high heat and add the 1 cup of diced red pepper and the chopped spinach. Bring the water back to a boil, turn the heat down to medium and simmer until the pepper is very soft, about 10 minutes. Drain the spinach and red pepper in a colander, pressing out as much liquid as possible.\nCombine the cream cheese and milk in the saucepan and cook over medium heat until hot and softened. Stir in the cooked spinach and red peppers, Parmesan cheese, crushed red pepper flakes, salt, and ground black pepper. Continue to stir until well combined and heated through.\nSpoon hot dip into a serving dish and serve with the tablespoon of finely diced red bell pepper sprinkled on top for garnish.\n",
        "picture_link": "OUdbv/xVhhu9M3bfwdkI66zVRta29hy"
    },
    {
        "title": "Apple Coffee Cake",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 tablespoon flour, or as needed ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1/4 cup vanilla yogurt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups diced Granny Smith apple ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray an 8-inch square baking dish with cooking spray; dust with 1 tablespoon flour.\nBeat 1/4 cup butter and 3/4 cup brown sugar together with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Beat egg into butter mixture. Add sour cream, vanilla yogurt, and vanilla extract to the mixture; beat to integrate.\nStir 1 cup flour, 3/4 teaspoon cinnamon, baking soda, and salt together in a bowl; add to the butter mixture and beat to combine into a batter. Fold apples into the batter. Pour batter into prepared baking dish.\nMix 1/4 cup brown sugar, 1/4 cup flour, 2 tablespoons butter, and 1/2 teaspoon cinnamon together in a bowl using a fork to achieve a crumbly consistency; sprinkle over the top of the batter.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "DovHVtjzaM1H6d3FJR6bVh.TjF3GTve"
    },
    {
        "title": "Pumpkin Crisp",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 (29 ounce) can pumpkin puree ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2/3 cup evaporated milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Set aside 1 cup cake mix for the topping. Combine remaining cake mix, 1 egg, and melted butter or margarine. Pat into a 9x13 inch baking pan.\nIn a large bowl, mix pumpkin, 2 eggs, spices, 1/2 cup sugar, and milk. Pour pumpkin mixture over the cake mix crust.\nIn a small bowl, combine 1 cup cake mix and 3/4 cup sugar. Cut in 1/2 cup softened butter until mixture resembles coarse crumbs. Sprinkle mixture on top of pumpkin mixture.\nBake at 350 degrees F (175 degrees C) for 55 minutes.\n",
        "picture_link": "YDqkIC1jqK8nfhIze5qp66nzeNOIOLa"
    },
    {
        "title": "Maryland Crab Soup",
        "ingredients": [
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup fresh lima beans ADVERTISEMENT",
            "1 cup frozen corn kernels ADVERTISEMENT",
            "1 cup sliced carrots ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "2 tablespoons Old Bay Seasoning TM ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1 pound blue crab crabmeat ADVERTISEMENT",
            "10 blue crab claws, steamed (optional) ADVERTISEMENT",
            "1 gallon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place whole tomatoes, water, lima beans, corn, sliced carrots, chopped onion, Old Bay seasoning, and beef broth, in a 4 quart pot. Heat to simmer, cover, and cook for 5 minutes.\nBring 1 gallon water to boil. Add crab claws and boil 6 minutes. Drain crab and set aside\nStir crabmeat (and crabs claws, if desired) into tomato and vegetable mixture. Cover and simmer 10-15 minutes longer. Serve hot.\n",
        "picture_link": "QPn.2YUda3NX9laISlRenh3AWdjXcuq"
    },
    {
        "title": "West African Peanut Stew",
        "ingredients": [
            "2 tablespoons peanut oil ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons chopped fresh ginger ADVERTISEMENT",
            "1 pound chicken, cut into chunks (optional) ADVERTISEMENT",
            "1 tablespoon crushed red pepper, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "5 cups chicken stock ADVERTISEMENT",
            "3 small sweet potatoes, cut into chunks ADVERTISEMENT",
            "1 (16 ounce) can chopped tomatoes, with liquid ADVERTISEMENT",
            "1/4 pound collard greens, roughly chopped ADVERTISEMENT",
            "1 cup chunky peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the peanut oil in a large pot over medium-high heat; cook and stir the onion, garlic, and ginger in the hot oil until softened, about 5 minutes. Add the chicken; cook and stir until completely browned. Season with the crushed red pepper, salt, and black pepper. Pour the chicken stock over the mixture. Stir the sweet potatoes into the liquid and bring the mixture to a boil; reduce heat to low, cover the pot partially with a lid, and cook at a simmer for 15 minutes.\nStir the tomatoes, collard greens, and peanut butter into the soup. Partially cover the pot again and continue cooking, stirring occasionally, another 20 minutes.\n",
        "picture_link": "rlA1jPqiJo922IFyi0aPHOjfN8ccUw."
    }
]