[
    {
        "title": "Chile Barbeque Sauce",
        "ingredients": [
            "1 (12 ounce) jar honey ADVERTISEMENT",
            "1 (18 ounce) bottle barbeque sauce ADVERTISEMENT",
            "1 (12 ounce) bottle chile sauce ADVERTISEMENT",
            "1 tablespoon dried minced onion flakes ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix honey, barbeque sauce, chile sauce, dried minced onion flakes and garlic powder. Apply generously to meats while grilling.\n",
        "picture_link": "UQaM2GcEuG1oSgHO73AbCKABCgbWtKu"
    },
    {
        "title": "Sour Cream Vegetable Soup",
        "ingredients": [
            "1 pound dried baby lima beans ADVERTISEMENT",
            "4 1/2 cups water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes ADVERTISEMENT",
            "8 large potatoes, peeled and cubed ADVERTISEMENT",
            "3 cups shredded cabbage ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and pick through beans. Place them in a large pot with the water. Season with salt and pepper. Bring to a boil, then reduce heat and simmer, covered, 1 1/2 to 2 hours, until just tender.\nStir in undrained corn and tomatoes, potatoes and cabbage. Simmer until potatoes are tender, about 20 minutes. At the table, stir sour cream to taste into individual servings.\n",
        "picture_link": "zxDAsnP9SKIi9h0nOLG7S2Po28aunS."
    },
    {
        "title": "Chicken Sausage Heroes",
        "ingredients": [
            "1 pound ground chicken ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup oil-packed sun-dried tomatoes, drained and diced ADVERTISEMENT",
            "1/2 cup chopped Italian flat leaf parsley ADVERTISEMENT",
            "1 teaspoon fennel seeds ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 1/4 teaspoons salt, divided ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 large sweet onion, sliced ADVERTISEMENT",
            "3 cloves garlic, slivered ADVERTISEMENT",
            "1 green bell pepper, cut into strips ADVERTISEMENT",
            "1 tablespoon red bell pepper, cut into strips ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 (1 pound) loaf Italian bread, cut in half lengthwise ADVERTISEMENT",
            "4 (1 ounce) slices provolone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the ground chicken, Parmesan cheese, bread crumbs, sun-dried tomatoes, parsley, fennel seeds, pepper, and 3/4 teaspoon salt. Form into 8 links.\nHeat 1 tablespoon olive oil in a skillet, and cook the sausage links 10 minutes, or until the chicken is no longer pink and juices run clear.\nHeat remaining 1 tablespoon olive oil in a separate skillet over medium heat, and saute the onion and garlic about 5 minutes, until tender. Stir in the green bell pepper and red bell pepper. Cook and stir about 5 minutes, until tender. Sprinkle with vinegar and season with remaining 1/2 teaspoon salt.\nPlace sausages on the bottom of the loaf of bread, cover with the vegetables, and layer with provolone cheese. Form a long sandwich by replacing the top of the loaf, and cut into slices to serve.\n",
        "picture_link": "LQB9hvvbemSpRWshI4zooQNYZEzOCTW"
    },
    {
        "title": "Chicken Curry Croissants",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 tablespoon peanut oil ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "4 plain croissants, split in half ADVERTISEMENT",
            "4 tablespoons chutney ADVERTISEMENT",
            "4 tablespoons mayonnaise ADVERTISEMENT",
            "lettuce ADVERTISEMENT",
            "tomato slices ADVERTISEMENT",
            "red onion slices ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium heat, add the curry powder and stir a few seconds until it becomes fragrant. Stir in the oil. Cook the chicken in the seasoned oil for about 5 to 8 minutes on each side, or until done.\nSpread chutney sauce on one side of each croissant, and the mayonnaise on the other side. Cut the cooked chicken to fit the croissants (I cut them into slices), and layer with lettuce, tomatoes, and red onion. Sprinkle with a little salt and pepper, and serve.\n",
        "picture_link": "tV0juM81jrKLNahKFq16mJdsoIOBNci"
    },
    {
        "title": "Cracker Crumb Cake",
        "ingredients": [
            "6 egg whites ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "36 saltine crackers, finely crushed ADVERTISEMENT",
            "2 cups chopped pecans ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple ADVERTISEMENT",
            "1 (8 ounce) tub frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Butter a 9x13 inch baking pan.\nIn a large glass or metal bowl, whip egg whites with cream of tartar and vanilla until soft peaks form. Gradually add sugar while continuing to whip to stiff peaks. Fold in cracker crumbs and pecans until evenly blended. Spread evenly in the prepared pan.\nBake for 30 minutes in the preheated oven, until the cake springs back when pressed in the center. Cool completely before frosting.\nTo make frosting: Mix together the crushed pineapple and whipped topping. Spread over cooled cake, and refrigerate until serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cheese Filling For Pastries",
        "ingredients": [
            "1/4 cup raisins ADVERTISEMENT",
            "1 tablespoon brandy ADVERTISEMENT",
            "1 1/2 cups cream cheese ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1 egg yolk, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle raisins with brandy and set aside.\nIn a bowl, cream together cream cheese and sugar. Beat in flour, sour cream, vanilla and butter. Beat in egg yolk. Fold in raisins. Chill until using.\n",
        "picture_link": "R075vm57Pc.G5QjeVYO5HJj6HOSACTO"
    },
    {
        "title": "Mango and Mixed Fruit Cake",
        "ingredients": [
            "1 (15.25 ounce) can mango slices, with juice ADVERTISEMENT",
            "1 2/3 cups candied mixed fruit peel ADVERTISEMENT",
            "2 tablespoons rum ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, combine mango slices and juice, mixed fruit and rum. Add cinnamon and nutmeg. Stir gently on medium-low heat for 10 to 15 minutes. Remove from heat and let stand until completely cool. Preheat oven to 300 degrees F (150 degrees C). Grease and flour an 8x4 inch loaf pan. Mix together the flour and baking powder; set aside.\nIn a large bowl, combine fruit mixture with egg and vanilla. Stir in flour mixture. Pour into prepared pan.\nBake in the preheated oven for 55 to 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Medieval Custard Pie (Daryoles)",
        "ingredients": [
            "2 (9 inch) unbaked pie crusts ADVERTISEMENT",
            "1/2 cup blanched almonds ADVERTISEMENT",
            "1 1/4 cups cold water ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 pinch saffron powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon rose water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Press pie crusts into the bottom and up the sides of two 9 inch pie pans. Prick with a fork all over to keep them from bubbling up. Bake pie crusts for about 10 minutes in the preheated oven, until set but not browned. Set aside to cool.\nMake an almond milk by placing almonds in the container of a food processor. Process until finely ground, then add water, and pulse just to blend. Let the mixture sit for 10 minutes, then strain through a cheesecloth. Measure out 1 cup of the almond milk, and mix with half and half. Stir in the saffron and cinnamon, and set aside.\nPlace the eggs and sugar in a saucepan, and mix until well blended. Place the pan over low heat, and gradually stir in the almond milk mixture and cinnamon. Cook over low heat, stirring constantly until the mixture begins to thicken. When the mixture is thick enough to evenly coat the back of a metal spoon, stir in rose water and remove from heat. Pour into the cooled pie shells.\nBake for 40 minutes in the preheated oven, or until the center is set, but the top is not browned. Cool to room temperature, then refrigerate until serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Black Olive and Goat Cheese Croustade",
        "ingredients": [
            "1 teaspoon unsalted butter ADVERTISEMENT",
            "1/4 cup leeks, diced ADVERTISEMENT",
            "1/4 cup Lindsay® Black Ripe Pitted Olives, diced ADVERTISEMENT",
            "1 (10 ounce) package prepared pizza dough ADVERTISEMENT",
            "3 ounces goat cheese, crumbled ADVERTISEMENT",
            "1 teaspoon thyme, chopped ADVERTISEMENT",
            "1 teaspoon oregano, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a small saute pan over medium heat. Add leeks and cook for 3-4 minutes until soft. Remove from heat and stir in olives. Set aside.\nCut pizza dough into 20 (1/2 ounce) pieces. Shape into 2-inch circles and place on a lightly greased parchment lined baking sheet. Bake in a 400 degree oven for 7-8 minutes.\nRemove from oven and spread each disk with olive mixture. Top with goat cheese and bake for an additional 5-7 minutes at 400 degrees. Sprinkle with fresh herbs just before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Holiday Peppers",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1 tablespoon chopped pimento pepper ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon minced fresh chives ADVERTISEMENT",
            "1 tablespoon minced fresh parsley ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 large green bell pepper, top and seeds removed ADVERTISEMENT",
            "1 large red bell pepper, top and seeds removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the cream cheese, tomato, pimento, garlic, chives, parsley, and basil. Fill the green bell pepper and red bell pepper with equal amounts of the mixture. Slice each pepper into 4 pieces. Cover, and refrigerate at least 2 hours before serving.\n",
        "picture_link": "vOVDxR0AfE7Gsznx3rRMEO1Dzev1OpG"
    },
    {
        "title": "Creamed Broccoli and Mushroom Soup",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "2 cups chopped broccoli ADVERTISEMENT",
            "8 ounces mushrooms, sliced ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup nonfat dry milk powder ADVERTISEMENT",
            "1 (10.75 ounce) can condensed Cheddar cheese soup ADVERTISEMENT",
            "2 dashes hot sauce ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 dash garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, mix the water, broccoli, mushrooms, and butter. Bring to a boil, reduce heat to low, and simmer 5 minutes, until broccoli is tender. Mix in milk powder, soup, hot sauce, pepper, and garlic powder. Continue cooking, stirring frequently, until heated through.\n",
        "picture_link": "rdgHqomDQHwrrvc7j9c.IQyDuWRz/LW"
    },
    {
        "title": "Coconut Macadamia Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "1 1/2 cups chopped macadamia nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla and sour cream. Combine the flour and baking soda; stir into the creamed mixture until well blended. Use a wooden spoon to stir in the coconut and macadamia nuts. Drop dough by rounded teaspoons 2 inches apart onto ungreased cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, until edges are golden brown. remove cookies from baking sheets to cool on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Talamee",
        "ingredients": [
            "1 teaspoon sugar ADVERTISEMENT",
            "4 cups lukewarm water ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "5 pounds all-purpose flour ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve sugar in about 1 cup of the water. Sprinkle the yeast over the top. Let stand for about 10 minutes, until foamy.\nIn a large bowl, mix together the yeast mixture, water, oil, and about half of the flour until well blended. Gradually mix in the rest of the flour until the dough is stiff enough to take out of the bowl. Knead on a floured surface until smooth and elastic, about 10 minutes. Place dough in a greased bowl, and cover with a cloth. allow to rise in a warm place until doubled in size. This will take 1 to 2 hours.\nDivide dough into sections about the size of a grapefruit. Form into smooth balls, cover with a cloth, and let rise again for about 30 minutes.\nOn a lightly floured surface, flatten each ball to 1/2 inch thickness, pressing out with your fingers. Circles should be about 8 inches across. Place on an oiled baking sheet. Let rest for about 10 minutes, or while you preheat the oven .\nPreheat the oven to 450 degrees F (230 degrees C).\nBake rounds until the top is lightly browned, 10 to 12 minutes. Remove from the oven, and brush with melted butter. Repeat with remaining bread.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peppermint Liqueur",
        "ingredients": [
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "2 1/2 cups brandy ADVERTISEMENT",
            "3 drops peppermint oil ADVERTISEMENT",
            "3 drops green food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the sugar and water in a small saucepan. Bring to a boil and stir to dissolve the sugar, making a thick syrup. Stir in the peppermint oil and green food coloring. Allow to cool slightly before stirring in brandy. Pour into a bottle and seal.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Swedish Cake Rusks",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "5 tablespoons sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (230 degrees C). Grease a large baking sheet.\nSift the flour, salt and baking powder into a large bowl. Cut in butter using a pastry blender, or pinching between your fingers, until the mixture resembles coarse crumbs. In a cup or small bowl, whisk together the egg and sour cream. Mix into the dry ingredients a little at a time until a moist soft dough is achieved.\nPlace the dough on a floured surface, and shape into a slab about 3/4 inch thick and 4 inches wide. Cut the slab crosswise into 5 pieces. Place the pieces about 2 inches apart on the prepared baking sheet.\nBake for 20 minutes in the preheated oven, until well risen and light brown. Remove from the oven, and allow to cool. Slice each piece in half lengthwise, and return to the baking sheet. Turn off the oven. Return rusks to the warm oven to dry out, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tabu Cocktail",
        "ingredients": [
            "1 1/2 fluid ounces Tanqueray #10 Gin ADVERTISEMENT",
            "2 ounces pureed fresh strawberries ADVERTISEMENT",
            "1 heaping bar spoon powdered sugar ADVERTISEMENT",
            "fresh raspberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add all ingredients in an ice filled shaker. Shake until well mixed and chilled and strain into a chilled cocktail glass. Garnish with two fresh raspberries on a bamboo pick.\n",
        "picture_link": "MJnZNNnOjMCRZUXqGyWqDrwnRS7NrCK"
    },
    {
        "title": "Seventh H'Evan",
        "ingredients": [
            "4 ice cubes ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers bourbon whiskey ADVERTISEMENT",
            "1 (12 ounce) can chilled diet lemon-lime soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a tall glass with ice cubes. Pour in the whiskey and top off with lemon-lime soda. Stir gently and serve immediately.\n",
        "picture_link": "X6.xXJwezufhCaqKpfvhqcI0DXXV5CO"
    },
    {
        "title": "French Salad with Russian Dressing",
        "ingredients": [
            "5 eggs ADVERTISEMENT",
            "1 head iceberg lettuce, shredded ADVERTISEMENT",
            "1 head romaine lettuce, torn ADVERTISEMENT",
            "1 head leaf lettuce, torn ADVERTISEMENT",
            "1 large cucumber, sliced ADVERTISEMENT",
            "2 large carrots, shredded ADVERTISEMENT",
            "Russian Salad Dressing: ADVERTISEMENT",
            "1 cup French salad dressing ADVERTISEMENT",
            "1 cup creamy salad dressing ADVERTISEMENT",
            "1 teaspoon bottled hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan with enough cold water to cover. Bring to a boil and immediately remove from heat. Cover pan, and let eggs stand in hot water for 10 to 12 minutes. Drain, cool, and peel. Cut in half and remove yolks. Mash yolks with a fork. Slice whites into small pieces.\nIn a large bowl, toss together the egg whites, iceberg lettuce, romaine lettuce, and leaf lettuce. Arrange the cucumber slices on top of the salad in a ring along the inside edge of the bowl. Sprinkle salad with carrots inside the cucumber ring. Sprinkle all with egg yolks.\nIn a separate bowl, mix the French salad dressing, creamy salad dressing, and hot pepper sauce. Serve as dressing for the salad.\n",
        "picture_link": "8yx0aR8XuZ4QdDe.mt7rs5H8QA8mj9."
    },
    {
        "title": "Savoiardi II",
        "ingredients": [
            "3 egg yolks ADVERTISEMENT",
            "3/8 cup sugar ADVERTISEMENT",
            "3/8 cup all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease and flour a baking sheet.\nIn a medium bowl, whip egg yolks and 3/8 cup of white sugar until thick and pale. Whisk in flour and salt just until smooth. Stir in vanilla. In a separate glass or metal bowl, whip egg whites until they are able to hold firm peaks. Fold egg whites into the egg yolk mixture until fully incorporated.\nDrop the batter by tablespoonfuls onto the prepared baking sheet, and shape into 3 inch long strips. Stir together the remaining white sugar and confectioners' sugar, and sprinkle half of the mixture over the tops of the strips. Let stand for 10 minutes, then sprinkle the remaining sugar mixture over them, and let stand for 5 more minutes.\nBake for 10 minutes in the preheated oven, or until golden. Cool on a wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apricot Dessert",
        "ingredients": [
            "1 quart apricot nectar ADVERTISEMENT",
            "2 (3 ounce) packages apricot flavored Jell-O® mix ADVERTISEMENT",
            "1 pint sour cream ADVERTISEMENT",
            "1 (8.75 ounce) can apricot halves, drained and chopped ADVERTISEMENT",
            "1 (8 ounce) tub frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the apricot nectar into a saucepan and bring to a boil. Remove from heat and stir in gelatin mix until completely dissolved. Whisk in sour cream until smooth or process in a blender. Pour into a serving bowl, and stir in the apricots. Chill until set, about 3 hours. Top with whipped topping just before serving.\n",
        "picture_link": "ZRYas3.ZbWocXr.xOsgcf4B4DYsi6c."
    },
    {
        "title": "Texas Praline Coffee Cake",
        "ingredients": [
            "2 cups baking mix (such as Bisquick ®) ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "2 tablespoons instant coffee granules ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 cup butter flavored shortening, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1/4 cup graham cracker crumbs ADVERTISEMENT",
            "1/4 cup softened butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease and flour a 10 inch square cake pan.\nMix baking mix, 1/2 cup brown sugar, 3/4 cup chopped pecans, and the instant coffee granules in a large bowl. Whisk together the egg, shortening, buttermilk, and vanilla in a separate large bowl. Stir the dry ingredients into the wet ingredients, mixing just until completely moistened.\nPour batter into prepared pan. Mix remaining 1/4 cup brown sugar, 1/4 cup chopped pecans, and the graham cracker crumbs in a small bowl. Sprinkle topping evenly over batter.\nBake in preheated oven until a toothpick inserted in the center comes out clean, about 20 to 25 minutes. Immediately dot top of cake with softened butter.\n",
        "picture_link": "CSChPbtPHkc.PZQo/N1EZDCqahYD.IG"
    },
    {
        "title": "Nuclear Screwdriver",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger vodka ADVERTISEMENT",
            "1/2 fluid ounce 190 proof grain alcohol ADVERTISEMENT",
            "2 fluid ounces fresh orange juice ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a rocks glass with ice, and pour in vodka, grain alcohol, and orange juice; stir and serve.\n",
        "picture_link": "MhS117OpvinC7APFOSFkJR1eWwBv6n6"
    },
    {
        "title": "Scalloped Corn and Bacon Casserole",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "2 (15 ounce) cans cream-style corn ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped bell pepper ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "16 crushed saltine crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C), and grease a 9x13 inch baking dish.\nCook the bacon in a large skillet over medium-high heat, turning occasionally until crisp and brown, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, and crumble when cool enough to handle.\nMix corn, crumbled bacon, eggs, onion, bell pepper, milk, and crushed crackers in prepared baking dish, and bake in the preheated oven for 1 hour, until the casserole is thickened and bubbling.\n",
        "picture_link": "BP242Tm4hhu/L/xWhd6P78tyHn8dbva"
    },
    {
        "title": "Grandmom Marino's Easter Meat Pie",
        "ingredients": [
            "1/4 pound thinly sliced ham ADVERTISEMENT",
            "1/4 pound thinly sliced salami ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 (15 ounce) package refrigerated pie crusts ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nTear the ham and salami into small pieces and place in a medium bowl. Stir in the ricotta cheese, egg and parsley. Season with salt and pepper. Set aside. Press one pie crust into a 9 inch pie plate and fill with the meat mixture. Cover with the other pie crust and press the edges together to seal. Cut a few slits in the top to vent steam.\nBake for 45 minutes in the preheated oven, until the crust is golden brown and filling is set. Cool to room temperature, then refrigerate until cold before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Saffron and Cointreau Cheesecake on Gingerbread",
        "ingredients": [
            "1 (8 ounce) package ginger nut cookies (biscuits) ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/4 cup Cointreau or other orange liqueur ADVERTISEMENT",
            "1/2 (.5 gram) packet saffron threads ADVERTISEMENT",
            "5 (3 ounce) packages cream cheese ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 1/2 tablespoons finely-grated orange zest ADVERTISEMENT",
            "1 3/4 cups heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cookies and butter in a blender. Blend until you have a slightly-moist and crumbly mixture. Press the crumbs into the base of a 9 inch springform pan; refrigerate.\nHeat the Cointreau in a small saucepan until it begins to steam; add the saffron threads. Remove from heat and allow to rest for 20 minutes.\nBeat the cream cheese with an electric hand mixer on low speed until softened. Slowly beat in the honey and orange zest. Add the saffron mixture and continue to beat. Pour in the cream while continuing to beat on the lowest speed until the mixture is thick enough to firmly hold its shape. Spoon the mixture over the crust. Chill overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Focaccia Alla Genovese",
        "ingredients": [
            "1/2 cup warm water ADVERTISEMENT",
            "1/2 teaspoon active dry yeast ADVERTISEMENT",
            "2 1/2 cups unbleached bread flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup Biga ADVERTISEMENT",
            "1 tablespoon additional extra-virgin olive oil for brushing ADVERTISEMENT",
            "2 teaspoons cornmeal for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1/2 cup warm water in a small bowl, and sprinkle yeast over the surface. Let stand until yeast is absorbed, about 10 minutes.\nCombine flour and salt in a large bowl. Make a well in the center, and pour in the cold water, yeast mixture, 1 tablespoon olive oil, and biga. Stir together using a sturdy wooden spoon.\nWhen the dough comes together, turn out onto a floured surface, and knead vigorously for about 20 minutes. Take a few 1 to 2 minute breaks if you like. The dough will be somewhat sticky until it is fully kneaded. Form dough into a ball. Rub the inside of a clean bowl with oil, and place the dough in it. Turn to coat the ball with oil. Cover with a towel and let rise at room temperature until doubled in size. This will take about 1 1/2 hours.\nPunch down the dough by folding the edges into the center and turning it over so the top is once again smooth. Cover the bowl again, and let the dough rise a second time until doubled, about 45 minutes.\nTurn the dough out onto a floured surface and gently flatten into an 8 inch square using the palms of your hands. Cover and let rise again.\nPreheat the oven to 425 degrees F (220 degrees C). Place a baking stone in the oven while it preheats. Dust a bakers peel with cornmeal, and gently slide it under the dough square. Use your fingers to make a dimpled surface by pressing them about 3/4 of the way down into the dough. Mist with water.\nSprinkle a little cornmeal over the surface of the baking stone. Slide the square off of the peel onto the baking stone. Mist some water into the hot oven, and quickly shut the door.\nBake for 30 minutes in the preheated oven, until the top is golden brown. Remove from the oven to cool on a wire rack. Brush the surface with remaining olive oil while the foccacia is still hot.\n",
        "picture_link": "3ADs.MkhtY4I5e5jvwgYtPLLtAQI6zW"
    },
    {
        "title": "DOLE® Ambrosia",
        "ingredients": [
            "1 (20 ounce) can DOLE® Pineapple Chunks, drained ADVERTISEMENT",
            "1 (11 ounce) can DOLE Mandarin Oranges, drained ADVERTISEMENT",
            "1 DOLE Banana, sliced ADVERTISEMENT",
            "1 1/2 cups seedless grapes ADVERTISEMENT",
            "1/2 cup miniature marshmallows ADVERTISEMENT",
            "1 cup vanilla low-fat yogurt ADVERTISEMENT",
            "1/4 cup flaked coconut, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pineapple chunks, mandarin oranges, banana, grapes and marshmallows in medium bowl.\nStir yogurt into fruit mixture. Sprinkle with coconut.\n",
        "picture_link": "2mkzDg2tJNlCIIqF8vBeNhCw6nNtxbG"
    },
    {
        "title": "Pumpkin Kaya",
        "ingredients": [
            "4 1/4 cups cubed fresh pumpkin ADVERTISEMENT",
            "1 cup unsweetened coconut cream ADVERTISEMENT",
            "3/8 cup brown sugar ADVERTISEMENT",
            "8 young pandan leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pumpkin into a steamer insert and set in a pot over one inch of water. Bring to a boil, cover and steam until soft, about 20 minutes. Transfer pumpkin to a blender and blend until smooth with no lumps.\nCombine the pumpkin, coconut cream, brown sugar, and pandan leaves in a pot over medium-low heat. Cook, stirring frequently, until mixture is thick and smooth, about 1 hour; remove leaves and discard. Cool kaya before serving; refrigerate unused portion.\n",
        "picture_link": "vdBil.Tq6W099aS2mH1JH.Uv.XPB9hu"
    },
    {
        "title": "Grilled Fruit Gorgonzola Salad",
        "ingredients": [
            "1/3 ripe pineapple, peeled, cored, and cut into 1-inch pieces ADVERTISEMENT",
            "2 firm ripe peaches or nectarines ADVERTISEMENT",
            "1 Anjou pear ADVERTISEMENT",
            "1 tablespoon oil ADVERTISEMENT",
            "Freshly ground black pepper ADVERTISEMENT",
            "1/3 pound crumbled Gorgonzola cheese ADVERTISEMENT",
            "15 leaves fresh basil, chopped ADVERTISEMENT",
            "10 sprigs Italian flat leaf parsley, chopped ADVERTISEMENT",
            "2 cups arugula leaves, chopped ADVERTISEMENT",
            "1 tablespoon olive oil (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat and lightly oil grate.\nCut the peaches in half, removing the pit. Keeping the skin on the pear, cut straight down one side, then the opposite, leaving the core. Cut the two remaining sides off of the core (the pieces will not be even).\nBrush a small amount of oil on the pineapple, peaches, and pear to prevent them from sticking to the grill. Sprinkle all sides of the fruit with pepper. Place the fruit flesh side down on the grill and cook for 10 minutes, turning as needed, until soft and caramelized.\nWhen the fruit is cooked, remove from the grill and place on a serving platter. Sprinkle with crumbled cheese and top with chopped basil, parsley and arugula. Drizzle with olive oil if desired. Serve hot.\n",
        "picture_link": "LcZpu9rdp68LKifUeuYXfqNO1UgJtTS"
    },
    {
        "title": "Romance-in-a-Bowl Salad",
        "ingredients": [
            "4 cups baby salad greens ADVERTISEMENT",
            "1 carrot, peeled and sliced ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "6 strawberries, hulled and sliced ADVERTISEMENT",
            "12 fresh raspberries ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup seasoned almond slices ADVERTISEMENT",
            "1/4 cup dried currants ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "1/2 cup seasoned croutons ADVERTISEMENT",
            "1/2 cup herbed vinaigrette salad dressing, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the salad greens, carrot, green onions, strawberries, raspberries, garlic, walnuts, almond slices, currants and feta cheese. Divide between two salad bowls. Top each bowl with some croutons and serve with vinaigrette dressing.\n",
        "picture_link": "S3Eaz2klM7nG1Al4IYc5s6FPKZAPYOa"
    },
    {
        "title": "Spicy Devil's Tom Yum Soup",
        "ingredients": [
            "2 pounds tiger prawns with heads and shells ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 stalks fresh lemon grass, tough outer leaves removed and and white part slightly crushed ADVERTISEMENT",
            "5 lime leaves ADVERTISEMENT",
            "5 shallots, thinly sliced ADVERTISEMENT",
            "5 slices galangal ADVERTISEMENT",
            "10 chile padi (bird's eye chiles), thinly sliced ADVERTISEMENT",
            "1 tablespoon Asian red chili paste ADVERTISEMENT",
            "1 skinless, boneless chicken breast half - cut into cubes ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "2 large squid, cleaned and sliced into rings ADVERTISEMENT",
            "1/2 (15 ounce) can baby corn, drained ADVERTISEMENT",
            "1/2 (6 ounce) can whole straw mushrooms, drained ADVERTISEMENT",
            "3 fresh tomatoes, quartered ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash the prawns, remove the heads, shells, and black veins, and retain the heads. Set the cleaned prawns aside. Place the prawn heads in a large saucepan or soup pot with the water, bring to a boil, and boil over high heat to reduce the stock and concentrate the flavor, about 15 minutes. Strain out the prawn heads and discard.\nHeat the vegetable oil in a large skillet over medium heat; cook and stir the garlic, lemon grass, lime leaves, shallots, galangal, and red chilies until the shallots are translucent and the seasonings are fragrant, about 3 minutes. Stir in the chili paste, cook and stir for 1 minute, and add the chicken breast and lime juice. Stir well to evenly mix in the chili paste, and let the mixture simmer for 5 minutes. Pour the seasoned chicken-lime juice mixture into the prawn stock, and bring to a boil over medium-low heat.\nWhen the soup begins to boil, stir in the squid rings, baby corn, straw mushrooms, cleaned prawns, and tomatoes. Turn the heat to low, stir in the coconut milk, and let the soup simmer until the prawns are pink and opaque, about 5 minutes. Add salt to taste, and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Special Frosted Applesauce Cake",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup thick, unsweetened applesauce ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "2/3 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line an 8 inch square pan with parchment paper.\nSift together flour, salt, baking powder, baking soda, cinnamon and cloves. Set aside.\nCream shortening and sugar until fluffy, add eggs and beat well. Fold in applesauce and flour mixture. Mix well. Fold in raisins.\nPour batter into a parchment-lined 8 inch square pan. Bake at 350 degrees F (175 degrees C) for 45 to 50 minutes, or until a toothpick inserted into center of cake comes out clean. Remove from oven and let cool to room temperature before frosting.\nFrosting Instructions: In a saucepan, combine brown sugar, white sugar, corn sugar and whipping cream. Cook, covered, over low heat 2 to 3 minutes to dissolve sugar crystals. Uncover and cook to soft ball stage (240 degrees F/ 115 degrees C).\nCool to lukewarm, then beat to a spreading consistency and spread over cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Cake in a Jar II",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 cups unsweetened applesauce ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Wash 8 (pint) straight sided, wide mouth canning jars in hot soapy water. Rinse well, dry and let them come to room temperature. Grease insides of jar well.\nIn a medium bowl, sift flour, baking soda, baking powder and salt. Set aside.\nIn a large bowl, cream butter with half of the butter until fluffy. Add eggs and remaining sugar and beat in. Add vanilla and applesauce and combine.\nAdd the flour mixture in three increments, mixing well after each addition.\nPour 1 cup of batter into each jar and carefully remove any batter from the rims.\nBake at 325 degrees F (165 degrees C) for 40 minutes.\nWhile cakes are baking, sterilize lids and rings by boiling them in a saucepan of water. Keep them in the hot water until ready to use.\nWhen the cakes have finished baking, remove jars from oven. Make sure jar rims are clean. (If they're not, jars will not seal correctly). While jars are still hot, place lids on jars, and screw rings on tightly. Jars will seal as they cool. Place the jars on the counter and listen for them to \"ping\" as they seal. If you miss the \"ping\", wait until they are completely cool and press on the top of the lid. If it doesn't move at all, it's sealed.\nUnsealed jars should be stored in the refrigerator and eaten within 2 weeks. Sealed jars may be placed in a freezer.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Graham Nut Cake",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup finely ground graham cracker crumbs ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup ground walnuts ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat the egg whites with the cream of tartar until stiff. Gradually beat in 1/4 cup sugar until the mixture is slightly glossy. Set aside.\nIn another large bowl, beat the egg yolks. Gradually beat in the remaining 3/4 cup sugar until the mixture is thick and pale. Beat in the vanilla. In another bowl, stir together the graham cracker crumbs, baking powder, and salt. Beat into the egg yolk mixture. Stir in the walnuts and chocolate. Stir in about 1/3 of the egg whites to lighten the batter and then fold in the rest gently but thoroughly.\nTurn the batter into a greased and floured 9x13 inch baking pan. Bake the cake in a preheated 350 degrees F (175 degrees C) oven for 25 to 30 minutes, or until it tests done with a toothpick. Let cool on a rack. Makes 12 servings.\n",
        "picture_link": "ezDcVqN/K/akE1kmtYYcVoPjE1jJDf."
    },
    {
        "title": "Half Moons II",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "7 1/2 tablespoons ground walnuts ADVERTISEMENT",
            "4 1/2 tablespoons white sugar ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix the butter with the nuts and sugar until well combined. Add the flour and the vanilla and mix.\nRolling about a tablespoon of dough in your hand, form a half moon or crescent shape.\nBake cookies on ungreased cookie sheets at 325 degrees F (165 degrees C) for 15 minutes. Immediately remove from cookie sheets and roll in white sugar.\n",
        "picture_link": "ZlJ3BzfTAY.cCFbwVZW.6ipx9dwym.2"
    },
    {
        "title": "Pecan Pie Cake II",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl, combine flour, salt, soda and baking powder. Add 1 1/2 cup sugar, 1/2 cup margarine, 2 eggs and vanilla; mix well. reserve 2/3 cup of batter for filling. Spread remaining batter in 9x13 inch pan. Bake the cake base for 15 minutes.\nIn a saucepan, heat corn syrup, 1 1/4 cups sugar and 1/4 cup margarine until melted and hot. Remove from heat and beat in reserved 2/3 cup of cake batter. Stir in 3 eggs and add pecans. Pour on top of cake. Return to oven and bake an additional 40 minutes.\n",
        "picture_link": "ikU0TmB9FMi0RQi7Q5nwwdESI092Yt6"
    },
    {
        "title": "Whipped Cream Icing II",
        "ingredients": [
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "2 tablespoons piping gel ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whip cream and sugar with a wire whisk until soft peaks form.\nAdd piping gel and continue to beat until stiff. Be careful not to over mix.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Oooh Baby Chocolate Prune Cake",
        "ingredients": [
            "9 (1 ounce) squares bittersweet chocolate ADVERTISEMENT",
            "2/3 cup unsalted butter ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup finely ground almonds ADVERTISEMENT",
            "1/2 cup prunes, pitted and chopped ADVERTISEMENT",
            "1/2 cup brandy ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak prunes overnight in brandy. Melt chocolate and butter or margarine with water.\nIn a large bowl, beat egg yolks and sugar until pale. Stir in chocolate mixture. Gently mix in flour and ground nuts. Stir in prunes.\nIn another bowl, beat egg whites to stiff peaks. Carefully fold into cake mixture. Pour into a greased 9 inch round cake tin.\nBake at 375 degrees F (175 degrees C) for 30 - 40 minutes. Remove from oven, and cool on a wire rack. Frost with Chocolate Ganache Frosting.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gallets",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons orange extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Separate the eggs. Beat the egg whites until stiff peaks have formed.\nIn a separate bowl beat the egg yolks until light and lemon colored. Beat in the sugar, oil, flour and orange extract. Beat for about 10 minutes then fold in the egg whites.\nOn a preheated non-stick waffle iron drop teaspoons of batter. BAKE LIGHTLY. Transfer to racks to cool. Sprinkle with confectioners' sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "O.D.'s Strawberry Jam Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "6 fluid ounces milk ADVERTISEMENT",
            "3 tablespoons strawberry jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x9 inch pan.\nIn a medium bowl, mix the flour, baking powder and salt. Set aside.\nIn a large bowl, combine oil, eggs, sugar and milk. Beat until blended. Add flour mixture and beat until smooth. Fold in jam. Pour batter into 9x9 inch pan.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes, or until toothpick inserted into center of cake comes out clean.\n",
        "picture_link": "UvxNfAWm03fQQSgPJYQC992WnDy0Sqa"
    },
    {
        "title": "Pat Maharaj Spice Cake",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 320 degrees F (160 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl, beat eggs for 10 minutes or until fluffy. In a separate bowl, cream butter and sugar until light and fluffy. Add beaten eggs and combine.\nAdd flour and cinnamon and mix in.\nAdd milk and flavorings and mix well.\nSpoon batter into 9x13 inch pan. Bake at 320 degrees F (140 degrees C) for 45 minutes or until golden brown.\nAllow to cool, then frost or serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Oatcakes",
        "ingredients": [
            "1/2 cup rolled oats ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, milk, and raisins in a saucepan. Boil. Slowly stir in oats, honey (to taste), and cinnamon. Turn down heat and cook for about 10 minutes.\nWhen oatmeal is a lot less sticky, pour into bowl. Spray cookie sheet with cooking spray. Take small handfuls of the oatmeal (this is very messy) and kneed into balls. Place on cookie sheet. Poke small holes in each ball and fill with honey. Close with extra oatmeal.\nPlace cookie sheet in oven and bake for about 10 - 15 minutes at 350 degrees F (175 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cooky Corn Cake",
        "ingredients": [
            "1 (14.75 ounce) can cream-style corn ADVERTISEMENT",
            "1/2 cup packed dark brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "4 tablespoons unsalted butter ADVERTISEMENT",
            "1/2 cup packed dark brown sugar ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 13x9 inch pan.\nCombine the creamed corn with the white sugar and 1/2 cup of the dark brown sugar. Stir in the eggs and the oil.\nCombine the baking powder, flour, baking soda, salt and ground cinnamon. Add the nuts and raisins.\nAdd the flour mixture to the corn mixture and stir until just combined. Pour batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes. Let cake cool completely then frost.\nTo Make Frosting: Bring the butter and 1/2 cup dark brown sugar to a boil. Remove from the heat. Add the heavy cream and the confectioners' sugar. Mix until of frosting consistency. Add more confectioners' sugar if necessary. Use to frost cooled cake.\n",
        "picture_link": "mLP0u9qBPGoZyKohkbT9nBsnDdqDv1e"
    },
    {
        "title": "Three Layer Coconut Cake",
        "ingredients": [
            "3 cups cake flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "5 teaspoons baking powder ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 tablespoon light corn syrup ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, 2 cups sugar, salt, and baking powder; add shortening and milk. Beat well. Beat in eggs and 1 1/2 teaspoons vanilla. Spread batter in three greased and floured 9 inch round pans.\nBake for 30 minutes at 350 degrees F (175 degrees C). Cool, and remove from pans.\nMix 3 cups sugar, corn syrup, and 1 cup boiling water in a saucepan; boil until mixture spins thread. Beat egg whites until stiff. Pour syrup over egg whites, beating constantly. Add 1 teaspoon vanilla to flavor the icing. Frost cake, and sprinkle with coconut.\nPreheat oven to 350 degrees F (175 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Food For The Gods I",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup dates, pitted and chopped ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup graham cracker crumbs ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSeparate the eggs and beat the egg yolks until light and lemon colored. Slowly add the sugar to the beaten egg yolks, mixing constantly. Add The dates, nuts, graham cracker crumbs and salt.\nBeat the egg whites until stiff peaks form. Fold the egg whites into the batter. Pour the batter into an ungreased loaf pan.\nBake at 350 degrees F (175 degrees C) for 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Honey Vanilla Cheesecake with Gingersnap Crust",
        "ingredients": [
            "32 gingersnap cookies, crushed ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 (3 ounce) package Neufchatel cheese ADVERTISEMENT",
            "1 cup part-skim ricotta cheese ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 cup egg substitute ADVERTISEMENT",
            "1 (16 ounce) container low-fat cottage cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a food processor or blender, crush the gingersnaps with the 2 tablespoons sugar. Add the egg white and process long enough to moisten the mixture. Press the crumbs into the bottom and up the sides of an 8- or 9-inch springform pan to form a thin layer.\nIf the crumbs are too sticky, use a sheet of waxed paper between the crust and your fingers to press the crumbs into place. Bake until the crust is brown and firm to the touch, 10 to 12 minutes. Remove from the oven. If the crust slides down the side of the pan, use a rubber spatula or the back of a spoon to press it in place.\nReduce oven heat to 300 degrees F (150 degrees C). Fill an oven-proof dish with about 1 inch of warm water and place it at the back of the oven to provide steam for the cheesecake while it bakes.\nClean the food processor or blender. Add the cream cheese, cottage cheese, ricotta cheese and cornstarch. Blend until the mixture is smooth. Add the honey, vanilla and blend again. Add the egg substitute, blending until the mixture is smooth and even colored. Pour into the prepared crust.\nBake 20 minutes on the lower rack of the oven. Reduce oven temperature to 250 degrees F (120 degrees C) and bake 60 minutes longer or until the sides are set and the center is fluid but not sloshing.\nTurn off the oven and allow the cake to cool 1 hour in the oven. Remove and cool to room temperature. Chill covered overnight before slicing. The cake will continue to set in the refrigerator so don't worry if the center doesn't appear to be firm when you remove it from the oven.\nIf desired, serve the cheesecake with a sauce made from thawed frozen strawberries or raspberries. Place the berries in a food processor or blender and puree until smooth. Add sugar (or sugar substitute) to taste, if desired.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Web Cake",
        "ingredients": [
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/4 cups evaporated milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "1 1/3 cups shortening ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "3/4 cup evaporated milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F(175 degrees C). Grease two 9 inch round cake pans.\nSift flour, baking powder, salt, baking soda and 1 1/2 cups of the white sugar together in a large mixing bowl. Add 1/2 cup of the shortening and 1-1/4 cup of the evaporated milk. Beat at medium speed with an electric mixer for 2 minutes. Beat in the eggs and beat for 2 minutes longer. Spread the batter evenly into the prepared pans. Drizzle 1 square of the melted chocolate in a spiral on top of each cake. Feather lines with a knife to form a web pattern.\nBake at 350 degrees F (175 degrees C) for 30 to 40 minutes or until a toothpick inserted in the center comes out clean. Let cakes cool in pans for 10 minutes then remove from pans and let cakes cool completely.\nTo Make Filling: Combine the 2 squares unsweetened melted chocolate, 1 1/3 cups shortening, 1 cup white sugar, 3/4 cup evaporated milk and the vanilla together and beat with an electric mixer until smooth.\nTo Assemble Cake: Cut each cooled cake layer in half horizontally. Spread 1/4 of the filling between each layer making a 4 layer cake with a web design on top. Frost sides with the remaining filling.\n",
        "picture_link": "RWtNBXkuixL/KpJd3dHpF3/NOlF8NO."
    },
    {
        "title": "Passover Sponge Cake (Plava)",
        "ingredients": [
            "9 egg whites ADVERTISEMENT",
            "9 egg yolks ADVERTISEMENT",
            "1 1/3 cups confectioners' sugar ADVERTISEMENT",
            "1 1/2 lemons, juiced ADVERTISEMENT",
            "1/2 cup potato flour ADVERTISEMENT",
            "1/2 cup matzo cake meal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat whites until stiff. Beat in confectioners' sugar. Beat together yolks and lemon juice: fold yolk mixture into egg whites. Fold in potato flour and matzo meal. Pour batter into ungreased tube pan.\nBake at 375 degrees F (190 degrees C) for approximately 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fruit In Crust Cheesecake",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup fruit preserves ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "2 cups frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn medium bowl, combine flour, oats, baking powder, sugar and butter. Mix until crumbly.\nReserve 1 cup crumb mixture, set aside. With remaining crumbs, pat onto bottom and sides of 9 inch pie pan.\nSpread fruit preserves over unbaked crust and top with reserved crumb mixture.\nBake at 350 degrees F (175 degrees C) for 20 to 25 minutes, or until golden brown. Cool.\nIn a large bowl, combine cream cheese, vanilla, milk and confectioners sugar. Blend until smooth. Fold in the whipped topping. Spoon into baked pie crust. Store in refrigerator.\n",
        "picture_link": "6pfYOG7JW0O1F1MSne7bcUlptOOfSFe"
    },
    {
        "title": "Daddy's Stew",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 medium onions, chopped ADVERTISEMENT",
            "2 (19 ounce) cans minestrone soup ADVERTISEMENT",
            "1 (14.5 ounce) can pinto beans with jalapeno peppers ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes and green chiles ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium heat, cook the ground beef and onions until beef is evenly brown and onions are tender. Drain grease.\nIn a pot, mix the beef and onions, minestrone soup, pinto beans with jalapeno peppers, and diced tomatoes and green chiles. Season with garlic powder, seasoned salt, and pepper. Bring to a boil, reduce heat to low, and simmer 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Northern Comfort",
        "ingredients": [
            "2 (1.5 fluid ounce) jiggers apple schnapps ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger bourbon whiskey ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine apple schnapps and bourbon in a shaker with ice. Shake, and pour into a glass.\n",
        "picture_link": "HCyXPeHcPUA/N0ija2vh2Pp6fLW8Tae"
    },
    {
        "title": "Rick's Big Bad Bean Burrito",
        "ingredients": [
            "1/2 cup vegetarian refried beans ADVERTISEMENT",
            "1 large whole-wheat tortilla ADVERTISEMENT",
            "2 romaine lettuce leaves ADVERTISEMENT",
            "1/2 avocado, peeled and sliced ADVERTISEMENT",
            "1/4 cup fresh pico de gallo ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir refried beans in a saucepan over medium-low heat until hot, 2 to 4 minutes.\nWarm tortilla in a skillet over low heat until softened, 1 to 2 minutes. Transfer tortilla to a plate.\nLayer lettuce onto tortilla. Spread warmed refried beans, avocado slices, and pico de gallo on top of lettuce. Roll tortilla around the fillings into a burrito shape.\n",
        "picture_link": "DdO4Ui/44PUSZsbMyFbREkHpYn1ZNwm"
    },
    {
        "title": "Chourico Stew",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1 (16 ounce) package Portuguese chourico sausage, diced ADVERTISEMENT",
            "2 potatoes, diced ADVERTISEMENT",
            "1/2 head cabbage, coarsely chopped ADVERTISEMENT",
            "3 carrots, diced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "1 (15 ounce) can mixed vegetables, drained ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon ground red pepper ADVERTISEMENT",
            "2 tablespoons cornstarch (optional) ADVERTISEMENT",
            "2 tablespoons water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the water, chourico, potatoes, cabbage, carrots, onion, celery, canned vegetables, parsley, garlic powder, celery salt, and red pepper in a large pot. Bring to a simmer over high heat, then reduce heat to medium-low and continue to simmer the soup until the vegetables are tender, about 40 minutes. If soup is too thin, stir in cornstarch dissolved in water to thicken.\n",
        "picture_link": "Xzf.73QUPaI8V2iRyi5fAlQvpHHidF6"
    },
    {
        "title": "Tomato Mackerel Salad",
        "ingredients": [
            "1/2 (15 ounce) can mackerel fillets, drained ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 pound roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 cucumber, peeled and diced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 head soft lettuce (Boston, Bibb or mixed baby greens) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place mackerel in a mixing bowl, and break into small chunks. Mix in garlic, tomato paste, and oil. Season with basil and salt and pepper. Stir in tomatoes, cucumber, and onion. Serve mixture on a bed of lettuce leaves.\n",
        "picture_link": "39qGrT1C/46lgeEXmJAbKOwg7RLpCPu"
    },
    {
        "title": "Hot Clam Dip IV",
        "ingredients": [
            "3 (6.5 ounce) cans minced clams, with juice ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, peeled and minced ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "crushed red pepper to taste ADVERTISEMENT",
            "3/4 cup seasoned bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium saucepan over medium low heat, slowly cook and stir the clams and lemon juice approximately 15 minutes\nIn a separate medium saucepan over medium low heat, mix butter, green bell pepper, onion, garlic, oregano, parsley, hot pepper sauce and crushed red pepper. Slowly cook and stir until tender, about 15 minutes.\nTransfer the clam mixture and the butter mixture to an 8x8 inch baking dish. Mix in the seasoned bread crumbs. Bake in the preheated oven 20 minutes, until bubbly and lightly browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Corn Relish III",
        "ingredients": [
            "2 quarts sweet corn kernels ADVERTISEMENT",
            "4 cups chopped cabbage ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 cup chopped red bell pepper ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons ground dry mustard ADVERTISEMENT",
            "1 tablespoon celery seed ADVERTISEMENT",
            "1 tablespoon mustard seed ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1 quart apple cider vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, mix corn, cabbage, onion, green bell pepper, red bell pepper, white sugar, ground dry mustard, celery seed, mustard seed, salt, turmeric, apple cider vinegar and water. Bring to a boil. Reduce heat and simmer 20 minutes.\nTransfer the mixture to sterile containers. Seal and chill in the refrigerator until serving.\n",
        "picture_link": "dW0O//w2iliUBisFFdfYcgabinWA3Dm"
    },
    {
        "title": "Cranberry Parfait Pie",
        "ingredients": [
            "1 cup cranberry juice ADVERTISEMENT",
            "1 (6 ounce) package strawberry flavored Jell-O® ADVERTISEMENT",
            "1 cup whole berry cranberry sauce ADVERTISEMENT",
            "1/2 cup vanilla ice cream ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the cranberry juice in a medium saucepan over low heat. Stir in strawberry flavored gelatin until dissolved. Cook, stirring occasionally, until thickened, 15 to 20 minutes. Remove from heat. Transfer to a medium bowl, and beat with an electric mixer until fluffy.\nIn a blender or food processor, finely chop the whole cranberry sauce. Mix in the gelatin mixture and vanilla ice cream until well blended.\nTransfer blended mixture to the prepared graham cracker crust. Chill in the refrigerator 2 to 3 hours.\nIn a medium bowl, whip together the heavy cream, white sugar and vanilla extract. Pour over the chilled pie before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pear Spread for Fruit Bread",
        "ingredients": [
            "2 pears - peeled, cored and shredded ADVERTISEMENT",
            "1 tablespoon crystallized ginger ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pears, crystallized ginger, vanilla extract and white sugar in a small microwave safe bowl. Cover and microwave on high 2 minutes. Uncover and continue to microwave in 1 minute intervals, stirring occasionally, until the mixture attains a thick, spreadable consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kiwifruit Rice Salad",
        "ingredients": [
            "2 1/4 cups water ADVERTISEMENT",
            "1 cup brown rice ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1 teaspoon fresh lime juice ADVERTISEMENT",
            "1/2 teaspoon lime zest ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 kiwi, peeled and chopped ADVERTISEMENT",
            "4 ounces cooked ham, julienned ADVERTISEMENT",
            "2 ounces Swiss cheese, cubed ADVERTISEMENT",
            "1/3 cup cashews ADVERTISEMENT",
            "1/2 cup fresh mushrooms, coarsely chopped ADVERTISEMENT",
            "2 kiwis, peeled and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and rice in a medium saucepan. Bring to a boil. Cover, reduce heat, and simmer for 45 to 50 minutes. Cool.\nHeat butter in a skillet over medium heat. Cook onion and celery in butter until tender, stirring frequently. Season with curry powder, and continue cooking for one minute.\nIn a large bowl, mix together yogurt, lime juice, lime zest, and sugar. Stir in rice, onion and celery mixture, chopped kiwi, ham, cheese, nuts, and mushrooms. Arrange sliced kiwi over salad.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Calves Liver with Lemon Thyme",
        "ingredients": [
            "8 ounces calves liver, sliced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "6 sprigs fresh lemon thyme, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse liver and pat dry. Heat oil in a large non-stick skillet over medium heat. Place the fresh thyme in a layer on the bottom of the pan, then lay the liver on top. Cook on medium heat for about 4 to 5 minutes on each side. Calves' liver may be eaten slightly pink, but be careful not to overcook it. Season with salt and pepper after cooking.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Madcat",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger fruit-flavored rum liqueur ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers vodka ADVERTISEMENT",
            "4 fluid ounces lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a tall glass with ice. Pour in rum liqueur and vodka. Fill with lemon-lime soda.\n",
        "picture_link": "B3.jeb5v6EZlufaTNR2k90fzqu15KYe"
    },
    {
        "title": "Orange Summer Cooler",
        "ingredients": [
            "2 cups orange juice ADVERTISEMENT",
            "2 cups cold water ADVERTISEMENT",
            "2 cups orange sherbet ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "3 cups crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, blend the orange juice, water, orange sherbet, vanilla, confectioners' sugar, and ice until smooth.\n",
        "picture_link": "0jR98tIjZY8tWlweHQ1I2F/2SJZXwgm"
    },
    {
        "title": "Spicy Crab and Shrimp Dip",
        "ingredients": [
            "2 (1 pound) loaves Mexican-style processed cheese food, cubed ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1/2 pound cooked and peeled shrimp ADVERTISEMENT",
            "1/2 pound cooked crabmeat ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium baking dish, mix Mexican-style processed cheese food, mayonnaise, Worcestershire sauce, shrimp and crabmeat.\nBake in the preheated oven 45 minutes, or until bubbly and lightly browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Calypso Coffee",
        "ingredients": [
            "1 fluid ounce rum ADVERTISEMENT",
            "1 fluid ounce creme de cacao liqueur ADVERTISEMENT",
            "8 fluid ounces hot brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour rum and liquor into a mug. Fill mug to the top with coffee.\n",
        "picture_link": "VTzao.etlgginEJbx4zQLaxPdLNyzNC"
    },
    {
        "title": "Chef Nick's Amazing Calamari",
        "ingredients": [
            "1 cup ricotta cheese ADVERTISEMENT",
            "1/3 cup mascarpone cheese ADVERTISEMENT",
            "12 sun-dried tomatoes, chopped ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1/4 teaspoon dried oregano, or to taste ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "8 large squid, cleaned and tentacles removed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). In a medium bowl, mix together the ricotta cheese, mascarpone cheese, sun-dried tomatoes, bread crumbs, oregano, salt and pepper until well blended. Set aside.\nBring a large pot of lightly salted water to a boil. Trim the ends of the squid bodies to make them an even size, and rinse out the tubes. Spoon the cheese mixture into the cavities of the squid until full, and secure the open ends with toothpicks. Place in boiling water, and cook for 6 minutes.\nRemove the stuffed calamari tubes from the water, and place in a baking dish. Bake for 20 minutes in the preheated oven.\nMelt butter in a large skillet over medium heat. Add garlic and sesame seeds. Place the calamari tubes in the skillet, and fry on all sides until golden brown. Remove toothpicks before serving.\n",
        "picture_link": "wjZuGqJOxpjBp6DOyYJNlvoq8JSATAG"
    },
    {
        "title": "Seared Veggie Rollups",
        "ingredients": [
            "2 jalapeno peppers, seeded and diced ADVERTISEMENT",
            "2 banana peppers, seeded and diced ADVERTISEMENT",
            "1 Anaheim pepper, seeded and diced ADVERTISEMENT",
            "6 cloves garlic, peeled and crushed ADVERTISEMENT",
            "1/4 onion, diced ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cube vegetable broth ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons hot pepper sauce ADVERTISEMENT",
            "1 (8 ounce) can refrigerated crescent roll dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, cook and stir jalapeno peppers, banana peppers, Anaheim pepper, garlic and onion in oil until soft, about 3 minutes.\nMix in the frozen mixed vegetables, water, vegetable broth, lemon juice and hot pepper sauce. Raise heat to high and cook, stirring constantly with a wooden spoon, until thick and darkened, 10 to 15 minutes. Remove from heat.\nPreheat oven to 375 degrees F (190 degrees C).\nSeparate crescent roll dough into triangles, and arrange on a large baking sheet. Place a generous amount of the vegetable mixture on each triangle. Roll triangles around the mixture.\nBake in the preheated oven 20 minutes, or until lightly browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange Poppyseed Cookies",
        "ingredients": [
            "1/3 cup unsalted butter ADVERTISEMENT",
            "3/4 cup superfine sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 teaspoons grated orange zest ADVERTISEMENT",
            "2 teaspoons orange juice ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon buttermilk ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "1 cup white chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together the butter, sugar and egg until light and fluffy. Stir in the orange juice and orange zest. Sift together the flour, cornstarch and baking soda; stir into the sugar mixture. Mix in the buttermilk and poppy seeds to form a soft dough. Drop dough by tablespoons onto cookie sheets and press a white chocolate chip into the center of each one.\nBake for 15 minutes in the preheated oven, or until just golden. Cool on cookie sheets for about 5 minutes before removing to wire racks to cool completely. Store up to one week in an airtight container.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mussels (Not from Brussels, but Belgian Anyway)",
        "ingredients": [
            "8 pounds fresh mussels ADVERTISEMENT",
            "1 carrot, peeled and sliced ADVERTISEMENT",
            "1 onion, peeled and sliced ADVERTISEMENT",
            "1 1/2 stalks celery, sliced ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "3 black peppercorns ADVERTISEMENT",
            "2 slices lemon ADVERTISEMENT",
            "1/2 (750 milliliter) bottle white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To prepare the mussels, scrape off anything living or growing on the outside of the shells, and pull out the little bunch of dark hairs (the beard) coming out of the side of the shells. Soak them in cold water while doing so. The shells are usually closed when you buy them. Do not panic if they open under water! Any shells that do not close when you tap them, have to be thrown out. This part may be done a couple of hours ahead of time if the mussels are stored in a cool place. Set the cleaned mussels aside.\nIn a large heavy-bottomed pot, combine the carrot, onion, celery, bay leaf, peppercorns, lemon slices and white wine. Bring to a boil over high heat, and add 1/3 of the cleaned mussels. Cover the pan, and cook shaking, every minute or so to help the mussels cook evenly. When all of the mussels are open, remove from the pan using a slotted spoon, and start enjoying your meal. Continue to cook remaining mussels in the same liquid.\n",
        "picture_link": "rFlLbedSty4S8TcxfpODFPWjjutjhQe"
    },
    {
        "title": "Tennessee Stack Cake",
        "ingredients": [
            "4 cups dried apples ADVERTISEMENT",
            "2 2/3 cups water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "5/8 cup buttermilk ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 3/4 teaspoons ground ginger ADVERTISEMENT",
            "3 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup dried apple slices for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, combine 4 cups of dried apples and water. Bring to a boil, and let simmer over medium-low heat for 30 minutes, or until apples are very soft. Mash the apples slightly, and stir in the sugar. Set aside to cool.\nPreheat the oven to 400 degrees F (200 degrees C).\nIn a large bowl, cream together the shortening and 1 1/4 cups sugar until light and fluffy. Stir in the buttermilk, baking soda, baking powder, salt and ginger. Mix in the flour about 1 cup at a time to form a stiff dough. Divide dough into 5 equal portions. Pat each portion of the dough into a 9 inch circle on greased cookie sheets.\nBake for 6 to 8 minutes in the preheated oven, or until edges are golden. Carefully remove layers to a cooling rack.\nStack the layers onto a serving plate, spreading about 3/4 cup of the apple filling between each layer. Spread the rest of the filling over the top layer, and arrange dried apple slices on top for garnish. Let stand overnight before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Marjolaine",
        "ingredients": [
            "1/2 (17.5 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "1/4 cup finely chopped hazelnuts ADVERTISEMENT",
            "1 cup chopped semisweet chocolate ADVERTISEMENT",
            "4 ounces light cream cheese, softened ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "3 tablespoons strong brewed coffee, cold ADVERTISEMENT",
            "1/2 cup ground hazelnuts ADVERTISEMENT",
            "1/2 cup ground almonds ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper.\nOn a lightly floured surface, roll puff pastry to 13x13 inches square. With a sharp knife, trim to 12x12 inches. Cut into 3 equal strips, 4x12 inches. Poke each strip several times with a fork. Arrange on prepared baking sheet. Sprinkle with hazelnuts.\nBake in preheated oven for 8 to 10 minutes, or until puffed and golden. Allow to cool. If not equal in size, trim with a serrated knife, using a gentle sawing motion.\nMelt chocolate in a bowl over barely simmering water, stirring constantly, until smooth. Cool to room temperature. In a large bowl, beat together cream cheese, brown sugar and coffee until smooth. Blend in melted chocolate. Fold in ground hazelnuts and almonds. In a large bowl, whip cream until peaks form. Fold 1/3 of the whipped cream into the cheese mixture, then quickly fold in remaining whipped cream until no streaks remain.\nSpread 1/3 of filling on a strip of puff pastry. Repeat layers. Refrigerate for 3 hours, or until set. With a serrated knife, cut into 10 slices using a gentle sawing motion.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apricot Shortbread Bars",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup packed light brown sugar ADVERTISEMENT",
            "2/3 cup butter or margarine, softened ADVERTISEMENT",
            "1 1/2 cups chopped dried apricots ADVERTISEMENT",
            "2 teaspoons grated lemon zest ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "4 teaspoons cornstarch ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). In a medium bowl, stir together the flour and sugar. Cut in butter until the mixture resembles coarse crumbs. Press into the bottom of a 9x13 inch pan.\nBake for 12 to 15 minutes in the preheated oven, or until firm. While the crust is baking, place apricots in a saucepan with enough water to cover. Bring to a boil, and cook for 10 minutes.\nDrain, reserving 1/2 cup of the liquid. Return the apricots and reserved liquid to the pan, and stir in the lemon zest. Mix together the sugar and cornstarch, and stir into the apricot mixture. Bring to a boil, and boil for 1 minute. Remove from heat and allow to cool. Spread onto the prepared crust, and sprinkle the walnuts over.\nBake for 20 to 25 minutes in the preheated oven, or until firm to the touch. Cool completely before cutting into bars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rice with Sesame Seeds",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 1/2 cups uncooked long-grain white rice ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon garlic paste ADVERTISEMENT",
            "1 tablespoon ginger paste ADVERTISEMENT",
            "1/2 cup tamarind paste ADVERTISEMENT",
            "1 pinch ground turmeric ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 teaspoons sesame seeds ADVERTISEMENT",
            "fresh cilantro, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, bring water and rice to a boil. Reduce heat, cover, and simmer 20 minutes, until liquid has been absorbed. Fluff rice with a fork.\nHeat 1/2 the oil in a medium saucepan over medium heat, and saute the garlic paste and ginger paste until lightly browned. Mix in the tamarind paste, turmeric, salt, and pepper. Gradually mix in the rice. Cook and stir until well coated.\nHeat the remaining oil in a small skillet, and saute sesame seeds until lightly browned. Mix into the rice mixture. Garnish with cilantro to serve.\n",
        "picture_link": "3q6Q9ZPPRjcUt5SAtLUS4wb5Qds4NyO"
    },
    {
        "title": "Sticky Sweet Sausage Kabobs",
        "ingredients": [
            "wooden skewers ADVERTISEMENT",
            "4 tablespoons honey ADVERTISEMENT",
            "1 tablespoon honey mustard ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon Asian five-spice powder ADVERTISEMENT",
            "24 Chipolata sausage ADVERTISEMENT",
            "8 large shallots, peeled and halved lengthwise ADVERTISEMENT",
            "1 red bell pepper, cut into 1 inch pieces ADVERTISEMENT",
            "1 zucchini, cut into 1/2-inch rounds ADVERTISEMENT",
            "1 large carrot, peeled and sliced into 1/4 inch thick rounds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat. Soak eight wooden skewers in water to prevent burning when grilled.\nMix honey, mustard, soy sauce, and five spice powder together in a large bowl. Add sausage, shallot, red pepper, zucchini, and carrot, and toss thoroughly to coat. Alternately thread sausage, shallot, red pepper, zucchini, and carrot onto skewers.\nCook skewers on the prepared grill until sausage is evenly brown and vegetables are tender.\n",
        "picture_link": "nIQT3SyM3ynXEGw5KEjNqnkuXvpO3H."
    },
    {
        "title": "Big M's Grilled Orange Lamb Kabobs",
        "ingredients": [
            "2 1/4 pounds lean lamb meat, cubed ADVERTISEMENT",
            "1 1/3 cups coriander seeds ADVERTISEMENT",
            "4 1/4 cups fresh orange juice ADVERTISEMENT",
            "6 orange, peeled, sectioned, and cut into bite-size pieces ADVERTISEMENT",
            "1 hot chile pepper, minced ADVERTISEMENT",
            "2/3 cup orange liqueur ADVERTISEMENT",
            "1 bunch fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lamb meat into a large nonmetallic bowl. Grind the coriander seed in a mortar and pestle, and rub into the meat. Pour orange juice and orange liqueur over meat, and mix in minced chile pepper and chopped orange. Cover, and refrigerate for 24 hours. Turn the meat over every couple of hours.\nPreheat grill for medium heat. Remove the lamb and orange pieces from marinade, and transfer marinade to a small saucepan. Set marinade aside. Thread the cubes of lamb on skewers, alternating with pieces of orange, and starting and finishing with a piece of orange.\nPlace saucepan with marinade on the grill, and bring to the boil. Continue boiling until reduced to a sticky but fluid sauce.\nOnce the marinade has come to the boil, place the skewers on the grill. Cook slowly until slightly charred, and cooked to your preference. Transfer skewers to a warm dish, and cover for 5 minutes. Serve with the orange sauce, garnished with sprigs of fresh cilantro.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Paradise of Chocolate",
        "ingredients": [
            "14 (1 ounce) squares unsweetened baking chocolate ADVERTISEMENT",
            "10 tablespoons margarine, softened ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "6 egg whites ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon active dry yeast ADVERTISEMENT",
            "1 cup apricot jelly ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Place a circle of parchment paper into the bottom of a 10 inch pan for easy removal.\nBreak the chocolate into pieces, and melt it in a metal bowl over simmering water. Stir frequently until melted. Remove from heat, and set aside to cool - don't let it harden.\nIn a medium bowl, cream together the confectioners' sugar and margarine until light and fluffy. Mix the 6 egg yolks into the chocolate until well blended, then stir the chocolate mixture into the sugar mixture.\nIn a large clean glass bowl, whip the egg whites to soft peaks. Gradually pour in the white sugar while continuing to whip the egg whites to stiff peaks. Combine the flour and yeast, and fold them into the egg whites. Fold in the chocolate mixture. Spread the batter evenly into the prepared 10 inch round cake pan.\nBake for 1 hour in the preheated oven, or until the top of the cake springs back when lightly touched. Allow cake to cool completely before removing from pan.\nSplit the cake in half horizontally and place the top of the cake onto a serving plate. Spread 2/3 of the apricot jelly onto that layer, then flip the bottom layer, flat side up, and place on top of the other one. Spread remaining jelly over the top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fish and Tamarind Soup",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "8 shallots, chopped ADVERTISEMENT",
            "6 cloves garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "6 stalks lemon grass, ground ADVERTISEMENT",
            "1/4 cup tamarind juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 pounds red snapper fillets, cut into 1 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat. Mix in shallots, garlic, crushed red pepper, and turmeric. Cook and stir until shallots are tender, about 5 minutes. Pour water into skillet, and mix in lemon grass and tamarind juice. Season with salt. Bring the mixture to a boil.\nStir snapper into boiling mixture. Cook 10 minutes, or until fish pieces are easily flaked with a fork.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Puttanesca II",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (8 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (8 ounce) can diced tomatoes ADVERTISEMENT",
            "1 cup sun-dried tomatoes ADVERTISEMENT",
            "1/2 cup hot cherry peppers ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "1/2 cup sliced green olives ADVERTISEMENT",
            "1/2 teaspoon capers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil and butter in a large saucepan over medium heat. Saute onion and garlic until onion is tender and translucent. Stir in crushed tomatoes, diced tomatoes and sun-dried tomatoes. Simmer 5 minutes on medium heat. Add peppers, black olives, green olives and capers. Simmer 15 to 20 minutes on low heat, or until sauce has thickened.\n",
        "picture_link": "hCkI74tH2lNCHxjJ7BKoowRBNrPN7u6"
    },
    {
        "title": "Creamy Cajun Crawfish Stew",
        "ingredients": [
            "nonstick cooking spray ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 green bell pepper, cut into strips ADVERTISEMENT",
            "1 red bell pepper, cut into strips ADVERTISEMENT",
            "2 cups fresh okra, cut into 1/2 inch slices ADVERTISEMENT",
            "1 whole boneless, skinless chicken breast, cubed ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1 pound whole cooked crawfish, peeled ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1/3 cup half-and-half cream ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup freshly grated Romano cheese ADVERTISEMENT",
            "1/3 cup chili powder ADVERTISEMENT",
            "1 tablespoon ground paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a heavy bottom pot with cooking spray, and place over medium heat. Saute onion, green bell pepper, red bell pepper and okra until soft. Season with a pinch of Cajun seasoning. Remove from pot, and set aside.\nCoat pot with cooking spray (turn off flame while spraying), and return to medium high heat. Saute chicken until no longer pink, and juices run clear. Season with 1 tablespoon Cajun seasoning. Stir in crawfish, and cook for 1 minute. Remove from pot, and set aside with vegetables.\nMelt butter in pot on medium low heat. Whisk in flour until roux begins to bubble. Add milk, and whisk until smooth. Add half-and-half, and whisk continuously until mixture thickens enough to coat the back of a spoon. Add a pinch of salt. Stir in shredded Cheddar cheese a little at a time until well incorporated. Add grated Romano cheese and whisk until incorporated. Season with chili powder and paprika. Stir in chicken, crawfish and vegetable mixture. Simmer for 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tangy Tomato Dressing",
        "ingredients": [
            "1 cup ketchup ADVERTISEMENT",
            "1/2 cup corn syrup ADVERTISEMENT",
            "1/4 cup tomato and clam juice cocktail ADVERTISEMENT",
            "2 tablespoons tomato sauce ADVERTISEMENT",
            "1 teaspoon prepared horseradish ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thoroughly blend ketchup, corn syrup, tomato and clam juice cocktail, tomato sauce, lemon juice, prepared horseradish, Worcestershire sauce, black pepper, and cayenne pepper. Cover, and chill until serving.\n",
        "picture_link": "f7gjY1uzu8vND6ce0Y4.poZXC83HzuW"
    },
    {
        "title": "Leprechaun's Delight",
        "ingredients": [
            "1 cup hot brewed coffee ADVERTISEMENT",
            "1 fluid ounce brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1 fluid ounce Irish cream liqueur ADVERTISEMENT",
            "1 tablespoon whipped cream ADVERTISEMENT",
            "1/2 teaspoon grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour hot coffee into a mug. Stir in Grand Marnier and Irish cream. Top with a dollop of whipped cream, and sprinkle with grated orange rind.\n",
        "picture_link": "IZfcUdrGcBGdTLDhJSldlzhNlYZgXU2"
    },
    {
        "title": "The Psycho",
        "ingredients": [
            "4 (1.5 fluid ounce) jiggers vodka, chilled ADVERTISEMENT",
            "1 (12 fluid ounce) can cola-flavored carbonated beverage ADVERTISEMENT",
            "3/4 fluid ounce absinthe ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour vodka into an 8 ounce glass. Fill glass nearly to brim with cola. Add absinthe. Do not stir.\n",
        "picture_link": "StvUyVmdDpEA11Uwqvw.DDSWopVpWgC"
    },
    {
        "title": "Brown Mixers",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup hazelnuts, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Butter a baking sheet.\nIn a medium bowl, beat the eggs and sugar until thick and smooth. Fold in flour and hazelnuts. Use two spoons to form the dough into balls, and place them 2 inches apart onto the prepared baking sheet.\nBake for 6 to 7 minutes in the preheated oven, or until toasted.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spinach and Chicken Salad",
        "ingredients": [
            "1 (10 ounce) bag fresh spinach, rinsed and dried ADVERTISEMENT",
            "4 cooked skinless, boneless chicken breast halves, sliced ADVERTISEMENT",
            "1 zucchini, halved lengthwise and sliced ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/2 cup black olives ADVERTISEMENT",
            "3 ounces fontina cheese, shredded ADVERTISEMENT",
            "1/2 cup fat-free roasted garlic salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place equal portions of spinach onto four salad plates. Arrange chicken, zucchini, bell pepper, and black olives over spinach, and top with cheese. Drizzle dressing over salad.\n",
        "picture_link": "3EDOr5RTYcoDBONFyTOZugr1B91vAES"
    },
    {
        "title": "Summer Olive Pizza",
        "ingredients": [
            "3 medium tomatoes ADVERTISEMENT",
            "2 tablespoons olive oil, or more if needed ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1 tablespoon dried tarragon ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1/3 cup drained canned cannellini beans ADVERTISEMENT",
            "1/4 cup canned mushrooms, drained ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "3 (10 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nBring a saucepan of water to a boil. Boil tomatoes for about 5 minutes, then remove from the pan, and drop into a bowl of cold water. Peel, and cut in half. Place tomato halves cut side up onto a baking sheet. Drizzle with olive oil, and season with salt, pepper and tarragon to taste. Reserve 1 teaspoon of tarragon for later.\nBake for 12 minutes in the preheated oven. Meanwhile, combine the beans and mushrooms in the container of a food processor or blender, and process until smooth. Set aside in a small dish.\nHeat 1 tablespoon of olive oil in a skillet over medium heat. Add the garlic, and cook stirring until fragrant. Add the bean and mushroom paste, and stir to blend. When the tomatoes are done, place them into the food processor, and process for about 10 seconds. The tomatoes should not become a paste, but more of a pulp. Stir the tomatoes into the skillet a little bit at a time, and season with poultry seasoning and the remaining teaspoon of tarragon. Heat through.\nPlace tortillas into the oven, and cook for about 1 minute, or until slightly hardened. Remove from the oven, and place on a baking sheet. Spread some sauce onto the browned side of each tortilla, sprinkle with olive slices, and cover generously with shredded mozzarella cheese.\nBake for 3 to 5 minutes in the preheated oven, or until cheese is melted and the edges are lightly browned. Cool for a few minutes, then cut into quarters and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Laura's Pickled Garlic",
        "ingredients": [
            "6 bulbs garlic ADVERTISEMENT",
            "4 cups white wine vinegar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon whole black peppercorns ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 dried red chile peppers ADVERTISEMENT",
            "1 1/2 tablespoons lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim the tops from the heads of garlic. Peel off all but one layer of the outer skin. Set aside.\nIn a saucepan, combine the vinegar, sugar, peppercorns, cloves, bay leaf, chile peppers and lemon zest. Bring to a boil and cook for 2 minutes. Add the garlic, and continue to boil for another 4 minutes. Remove from the heat and let stand overnight at room temperature.\nTransfer to a clean jar. Strain the brine into the jar with the garlic so that the heads are completely covered. Discard the solids. Cover and store in the refrigerator until using. It will keep for 6 to 8 weeks. To keep longer, store in sterile jars and process in a hot water bath for at least 10 minutes to seal the jars.\n",
        "picture_link": "Lbali2uERAlB76FQAEteI3tGRMfKhsW"
    },
    {
        "title": "Rabbit Italian Style",
        "ingredients": [
            "1 (2 pound) rabbit, cut into small pieces ADVERTISEMENT",
            "1/4 pound salt pork ADVERTISEMENT",
            "1 (750 milliliter) bottle sweet sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a Dutch oven, cook salt pork over medium heat until fat melts. Cook rabbit in hot fat until well browned on all sides.\nPour in enough sherry to cover meat. Simmer until sherry is absorbed for the most part and meat is very tender.\nPour in remaining sherry, and simmer for just a few minutes (leave enough liquid in the pan for sauce).\n",
        "picture_link": "k5rpmp.budN/ry4xfdA8q7k/h0CpPxe"
    },
    {
        "title": "Great Tater Rounds",
        "ingredients": [
            "4 large russet potatoes, peeled and cubed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 quart oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potato cubes into a food processor, and process until the potatoes are finely shredded, and some of the starch has been incorporated. Sprinkle with salt, and form the potato mixture into balls the size of a quarter. The starch will hold them together.\nHeat oil in a deep-fryer to 365 degrees F (180 degrees C). Drop the balls carefully into the hot oil, and cook until golden brown. Remove from deep-fryer to drain on paper towels.\n",
        "picture_link": "7nJad7J0Tt7yW8AX8kFDO4SDbx14SX."
    },
    {
        "title": "Sugarless Fruitcake",
        "ingredients": [
            "1 cup chopped golden raisins ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups chopped nuts ADVERTISEMENT",
            "1 cup chopped cranberries ADVERTISEMENT",
            "1 cup crushed pineapple ADVERTISEMENT",
            "1/4 cup grated lemon peel ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "8 packets artificial sweetener ADVERTISEMENT",
            "1 teaspoon ground mace ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sugar substitute with orange juice. Pour over chopped cranberries. Soak 1 hour, mixing often.\nMix raisins, nuts, coconut, lemon rind in flour until well coated. Add cranberries and orange juice mixture. Sprinkle baking soda over mixture, and mix. Mix in spices. Fold in crushed pineapple. Pour batter into a greased and floured 9 inch loaf pan.\nBake at 325 degrees F (165 degrees C) for 40 minutes. Cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lemon-Marmalade Cookie Sandwiches",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup sifted confectioners' sugar ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup toasted hazelnuts ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3 tablespoons lemon marmalade ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl beat butter and 1/2 cup sugar with an electric mixer until smooth. Beat in lemon peel and vanilla.\nIn a food processor, finely grind flour, nuts, salt and cinnamon. Add to butter mixture and mix just until dough holds together.\nGather dough into a ball and flatten into a disk. Wrap in plastic and chill for about 1 hour or until firm.\nPreheat oven to 325 degrees F. Butter cookie sheet.\nRoll dough on a lightly floured surface to 1/4-inch thick. Cut out cookies with a 3-inch round cookie cutter. Gather scraps into a ball and re-roll to 1/4-inch thick. Cut out cookies, forming total of 12. Transfer cookies to the cookie sheet.\nUsing a 1-inch round cookie butter, cut out the center of 6 cookies and remove. Bake about 20 minutes or until golden. Cool on rack for 5 minutes.\nLeaving a 1/8-inch border, spread 1 1/2 teaspoons of marmalade evenly over each cookie without a hole. Sift additional powdered sugar over cookies with holes. Place cookies with holes sugar side up atop jam-covered cookies.\n",
        "picture_link": "uQ7oDDUkUxnlulrH5djjaDDUTC9QqzS"
    },
    {
        "title": "Wassail I",
        "ingredients": [
            "8 lady apples ADVERTISEMENT",
            "4 whole allspice berries ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "2 liters ginger ale ADVERTISEMENT",
            "25 fluid ounces sherry ADVERTISEMENT",
            "1 cup brandy ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place whole apples on a baking sheet and bake until brown and tender, about 25 minutes.\nGently crush the allspice berries and break up the cinnamon stick. Place the allspice, cinnamon, cloves, nutmeg, and ginger in a cheesecloth bag.\nIn a large sauce pan place 2 cups of the ginger ale and the spice bag. Bring to a boil, reduce heat and simmer for 10 minutes. Remove spice bag and add the remaining ginger ale, the sherry and the brandy heat until hot. DO NOT BOIL! Whisk in milk and pour into a punch bowl garnish with the baked apples.\n",
        "picture_link": "bmCpsztcd.b9usnvDkGUkwHGJ9BOMn6"
    },
    {
        "title": "Elegant Light Fruit Cake",
        "ingredients": [
            "2 cups ground almonds ADVERTISEMENT",
            "3 cups red candied cherries ADVERTISEMENT",
            "1 1/2 cups green candied cherries ADVERTISEMENT",
            "1 (8 ounce) package diced candied citron ADVERTISEMENT",
            "6 cups golden raisins ADVERTISEMENT",
            "8 ounces candied pineapple, diced ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 2/3 cups white sugar ADVERTISEMENT",
            "8 egg yolks ADVERTISEMENT",
            "4 teaspoons almond extract ADVERTISEMENT",
            "2/3 cup brandy ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "8 egg whites ADVERTISEMENT",
            "1 1/2 teaspoons cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Place a pan of water in oven. Grease thoroughly and line with heavy brown paper one set of tier pans (one 9 inch, one 7 inch, and one 5 inch).\nIn a large bowl combine ground almonds and fruits. Dredge with one cup flour.\nIn a large bowl, cream together 1 cup flour and shortening. Gradually blend in white sugar. Beat in egg yolks and almond flavoring; beat until very light and fluffy. Mix together brandy and milk; add alternately with 4 1/2 cups flour to creamed mixture. Make 3 dry and 2 liquid additions, combining lightly after each.\nIn another bowl, beat egg whites with cream of tartar to form stiff but moist peaks. Fold into batter. Fold in floured fruit mixture.\nBake for 2 1/2 to 3 1/2 hours, depending on size of pan. Bake each cake until it tests done with a toothpick. Remove from pans, and lift off paper. Cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Carol Punch",
        "ingredients": [
            "2 red apples ADVERTISEMENT",
            "8 cups clear apple cider ADVERTISEMENT",
            "8 cinnamon sticks ADVERTISEMENT",
            "2 teaspoons whole cloves ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 large orange ADVERTISEMENT",
            "1 lemon ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Core apples, and slice into 1/2 inch rings. Cut orange and lemon into thin slices.\nIn a dutch oven, combine cider, cinnamon, cloves, apple rings, and raisins. Bring to boil over high heat. Reduce heat to low. Simmer 5 to 8 minutes or until apples are just tender. Remove cloves, and add orange and lemon slices, and lemon juice. Pour into punch bowl. Ladle into large mugs, including an apple ring, some raisins, and citrus slices in each serving. Serve with spoons.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chestnut Souffle",
        "ingredients": [
            "4 egg yolks ADVERTISEMENT",
            "1 cup chestnut puree ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1 tablespoon brandy ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1 cup whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, beat the egg yolks until thick and lemon colored.\nIn a separate bowl, beat together the chestnut puree, sugar, milk, and brandy. Add egg yolks and mix until smooth.\nIn a large bowl, beat egg whites until stiff peaks form. Fold the beaten whites into the chestnut mixture.\nPour into an ungreased 1 1/2 quart souffle dish. Bake for 35 to 40 minutes. Top with whipped cream and serve.\n",
        "picture_link": ".gmJgka9FZno7Sedr6CID8ZOB/CCf6q"
    },
    {
        "title": "Orange Sugar Bells",
        "ingredients": [
            "1/3 cup shortening ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "25 maraschino cherries, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl beat shortening and butter or margarine until butter is softened. Add the sugar and beat until fluffy.\nAdd the egg, milk, orange peel, and vanilla and beat until well mixed. Add flour and baking powder and mix well.\nCover and chill about 30 minutes or until easy to handle.\nShape dough into two 8-inch long rolls. Wrap in plastic wrap and chill for several hours or overnight.\nPreheat oven to 350 degrees F.\nCut rolls into 1/4-inch slices. Place on ungreased cookie sheet.\nOn the bottom half of each slice, place a cherry for the bell clapper. Fold in the sides of the slice, overlapping at the top and slightly covering cherry. Pinch in the sides to form a bell shape.\nBake for 12-14 minutes or until done. Remove and cool on wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pastel Wafers",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3 1/2 tablespoons light cream ADVERTISEMENT",
            "1 cup sifted confectioners' sugar ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 drop food coloring ADVERTISEMENT",
            "1 tablespoon light cream ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F.\nCut the 6 tablespoons of cold butter into the flour until it resembles coarse crumbs.\nSprinkle 1 tablespoon of cream over the mixture and toss gently with a fork. Repeat with the remaining cream until all is moistened. Form into a ball.\nRoll the dough to slightly less than 1/8 inch thick. Cut into rounds with a 1 1/2-inch cookie cutter. Sprinkle one side of each round with sugar and place on an ungreased cookie sheet, sugar side up.\nPrick each round in four parallel rows with a fork.\nBake for 8-10 minutes or until the edges just begin to brown. Remove to a rack and cool completely.\nMake filling as follows. Stir together the powdered sugar, 1 tablespoon softened butter, vanilla, food coloring, and enough of the 1 tablespoon cream to make it spreadable.\nSpread 1/2 teaspoon of the filling on the flat side of half of the cookies. Top with the remaining cookies, flat side down.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cinnamon Raisin Crescents",
        "ingredients": [
            "1/4 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "3 cups sifted all-purpose flour ADVERTISEMENT",
            "1/4 cup lukewarm water ADVERTISEMENT",
            "2 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 cup butter, melted and cooled ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 cup chopped raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, sprinkle the yeast on the warm water and stir until dissolved. Stir in the melted butter. Beat in the eggs and sugar until well blended. Gradually mix in flour. Place dough in an airtight container and refrigerate for at least 3 hours and up to 3 days.\nPreheat oven to 350 degrees F (175 degrees C). Mix together the 1/2 cup sugar and cinnamon. Set aside. Divide dough into 6 equal parts. Sprinkle the cinnamon-sugar mixture into a shallow pan.\nRoll out dough into a circle on a flat surface to 1/8 inch thickness. Press dough into shallow pan and sprinkle again with cinnamon-sugar mixture. Cut dough into 8 wedges, as a pie. Sprinkle raisins on each wedge and roll each wedge, starting from widest to point, as a crescent roll. Place each roll on cookie sheets, about 2 inches apart. Let crescents stand 15 minutes before baking.\nBake 15 minutes in the preheated oven, or until golden. Let cool on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Macadamia Nut Lemon Drops",
        "ingredients": [
            "1 1/2 cups chopped macadamia nuts ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/3 cups packed brown sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "3 teaspoons lemon zest ADVERTISEMENT",
            "2 teaspoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F.\nSpread macadamia nuts on cookie sheet and bake until lightly browned. Set aside and let cool.\nIn a large bowl, beat eggs until light and fluffy (this should take at least 5 minutes). Gradually add sugar and beat well. Sift together the flour, salt and baking powder and blend into egg mixture. Beat until smooth.\nMix in the lemon zest, lemon juice and nuts. Mix until well blended.\nDrop by teaspoonfuls about 3 inches apart on parchment paper lined cookie sheets. Bake for 7 to 9 minutes until cookies are golden with dark edges. Let cool on wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Japanese Fruitcake",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 pound raisins ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "6 eggs, separated ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups hot water ADVERTISEMENT",
            "4 teaspoons all-purpose flour ADVERTISEMENT",
            "1 lemon -- peeled, seeded and minced ADVERTISEMENT",
            "2 large orange, peeled, sectioned, and cut into bite-size ADVERTISEMENT",
            "1 pound flaked coconut ADVERTISEMENT",
            "1 cup pecan halves ADVERTISEMENT",
            "1 cup maraschino cherries, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dedge the raisins in 1 cup flour.\nPreheat oven to 350 degrees F (175 degrees C). Butter and flour two 9 inch round pans.\nSift together the flour, baking powder, cinnamon, clove, and nutmeg.\nIn a large bowl, cream together the butter or margarine and sugar; add egg yolks, and beat until smooth. Mix in flour mixture in parts alternately with milk. Stir in coconut, pecans, and raisins.\nIn a clean bowl, beat egg whites until stiff peaks form. Fold into batter, and then pour batter into prepared pans.\nBake for 25 minutes, or until done. Cool layers on wire racks.\nIn a medium saucepan, combine the sugar, water, flour, lemon and orange. Cook over medium heat until thickened. Stir in coconut and cook for 2 minutes. Allow to cool, and then ice cake. Alternate pecan halves and maraschino cherries halves around top of cake to form a pinwheel.\n",
        "picture_link": "lpyb7e1Qy2DUbNBIshNUuJF/YgsVjS2"
    },
    {
        "title": "Sesame Wafers",
        "ingredients": [
            "1/2 cup sesame seeds ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour cookie sheets.\nPlace sesame seeds in small saucepan and stir or shake them over moderate heat until slightly brown. Remove from heat and stir in butter, brown sugar, egg and vanilla. Mix in flour, egg and salt. Drop by teaspoonfuls onto cookie sheets about 2 inches apart.\nBake until just brown, 4 to 6 minutes. Remove from cookie sheets while still warm. If cookies are hard to remove, reheat for 30 seconds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mom's Fruitcake",
        "ingredients": [
            "1 cup dried currants ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "1 cup candied cherries ADVERTISEMENT",
            "1 ounce small gum drops, no licorice ones ADVERTISEMENT",
            "2 cups pitted dates, cut in half ADVERTISEMENT",
            "1 1/4 cups chopped walnuts ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "2 teaspoons ground allspice ADVERTISEMENT",
            "1/4 cup brandy ADVERTISEMENT",
            "1 cup apple jelly ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1 1/4 cups butter ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "7 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour boiling water over raisins and currants to cover. Let steam for 5 minutes, then drain. In a very large bowl combine currants, raisins, gum drops, candied cherries, pitted dates, jelly, spices, and brandy wine or fruit juice. Stir to blend. Cover and let stand overnight.\nPreheat oven to 275 degrees F (135 degrees C). Grease three 8x4 inch loaf pans.\nCream the butter and the sugar together until light and creamy. Add the eggs one at a time, mixing well after each one. Stir in the vanilla.\nSift the flour and baking soda together.\nAdd the flour mixture alternately with the fruit mixture to the creamed mixture. Pour evenly into three loaf pans.\nBake at 275 degrees F (135 degrees C) for 2-1/4 to 3 hours or until a toothpick inserted in the center of the loaves comes out clean.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]