[
    {
        "title": "Rich Slow Cooker Hot Chocolate",
        "ingredients": [
            "6 cups milk ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 1/2 cups heavy whipping cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk, condensed milk, chocolate chips, heavy cream, and vanilla extract in a slow cooker.\nCover and cook on Low, stirring occasionally, until chocolate chips are melted and mixture is smooth, about 2 hours.\n",
        "picture_link": "mkLvTpdqHFrXU1o9.PC9v9ZYySahHlq"
    },
    {
        "title": "Kirsten's Dark Chocolate Chip Cookie Bars",
        "ingredients": [
            "1 cup butter, melted ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "2 cups dark chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nMix butter, brown sugar, and white sugar together in a bowl; beat it eggs and vanilla extract until smooth and creamy. Stir flour, baking soda, salt, and baking powder into the creamed butter mixture until batter is well mixed. Fold chocolate chips into batter; spread into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 40 minutes. Cool before cutting into bars.\n",
        "picture_link": "3fHVQ3Ofxe1Sq15t7em06dN3A2hQQ8a"
    },
    {
        "title": "Pesto Chicken Kabobs",
        "ingredients": [
            "1 pound skinless, boneless chicken breasts, cut into 1-inch pieces ADVERTISEMENT",
            "1 cup pesto ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "12 cherry tomatoes ADVERTISEMENT",
            "12 red onion chunks ADVERTISEMENT",
            "6 wooden skewers, soaked in water for 20 minutes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken pieces, pesto, and lemon juice in a gallon-size resealable plastic bag; seal bag and toss to coat evenly. Marinate in the refrigerator for 24 hours.\nThread chicken, tomatoes, and onion alternately onto skewers. Season with salt and pepper.\nPreheat Panasonic Countertop Induction Oven to Medium-High on the \"Grill\" setting.\nPlace the skewers into the grill pan and set the timer for 3 minutes.\nTurn skewers and cook another 3 to 4 minutes or until chicken is cooked through. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nAllow to rest for about 5 minutes.\n",
        "picture_link": "X/seLQqe8zm6Gl9ekRwoB9m5sX9LwcO"
    },
    {
        "title": "Paleo Stuffed Cabbage",
        "ingredients": [
            "Tomato Sauce: ADVERTISEMENT",
            "1 (28 ounce) can crushed San Marzano tomatoes ADVERTISEMENT",
            "1 cup low-sodium chicken broth ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 (8 ounce) can tomato paste ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "1 small yellow onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons sea salt ADVERTISEMENT",
            "3/4 head cauliflower ADVERTISEMENT",
            "2 heads green cabbage ADVERTISEMENT",
            "1 zucchini ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup almond flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomatoes, chicken broth, 1 clove garlic, and 1 teaspoon parsley in a saucepan; bring to a boil. Add tomato paste. Fill the can 1/4 of the way with hot water; swirl to dissolve any tomato paste remaining in the can and pour into the saucepan. Season sauce with 1 teaspoon salt and 1/2 teaspoon pepper. Simmer until flavors combine, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nMix beef, pork, onion, 3 cloves garlic, basil, oregano, 1/2 teaspoon parsley, 1/2 teaspoon salt, and 1/4 teaspoon pepper together in a large bowl.\nBring a large pot of water to a boil; add 2 tablespoons sea salt. Add cauliflower; cook for 5 minutes. Transfer to a bowl using a slotted spoon. Add 1 head of cabbage to the boiling water; cook for 5 minutes. Remove with the slotted spoon. Repeat with second cabbage. Separate cabbage leaves.\nShred cauliflower and zucchini in a food processor fitted with the shredder disk. Add enough to the beef mixture so there is an equal ratio of both. Stir in eggs and almond flour.\nLay 1 cabbage leaf on a flat surface. Roll 1 tablespoon of the beef mixture into a log and place in the middle of the leaf. Overlap with the bottom of the leaf; fold in opposing edges and roll up. Repeat with remaining leaves and beef mixture.\nCoat the bottom of a large baking dish with a layer of tomato sauce. Arrange cabbage rolls seam-side down in the dish; cover with remaining tomato sauce. Cover dish with aluminum foil.\nBake in the preheated oven until sauce is bubbling, about 1 hour.\n",
        "picture_link": "fOG2ZxEdkKjjJjA9bK35K8zJP21/.oW"
    },
    {
        "title": "Orange-Cranberry Bundt® Cake",
        "ingredients": [
            "1 cup almond milk, or other non-dairy milk ADVERTISEMENT",
            "1 tablespoon freshly grated orange zest ADVERTISEMENT",
            "1/2 cup fresh orange juice ADVERTISEMENT",
            "1/3 cup coconut oil, melted ADVERTISEMENT",
            "1/3 cup unsweetened applesauce ADVERTISEMENT",
            "2 tablespoons ground flax seeds ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 2/3 cups all-purpose flour, divided ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups fresh or frozen cranberries, halved or coarsely chopped ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons fresh orange juice ADVERTISEMENT",
            "1 tablespoon coconut oil, melted ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 12-cup fluted tube pan (such as Bundt(R)).\nVigorously whisk together milk, zest, juice, oil, applesauce, flax seeds, and cornstarch in a large bowl. Add sugar and whisk until well combined, then whisk in vanilla.\nUse a fine mesh strainer to sift in about half of flour and all of baking powder, salt, and baking soda, then stir until well combined. Sift in remaining flour and stir until smooth. Fold in cranberries. Pour batter into prepared pan.\nBake until top is puffed and firm to touch, cake starts to pull away from pan sides, and a wooden pick inserted near center comes out clean, 50 to 55 minutes. Cool in pan 10 minutes, then loosen cake with a small metal spatula, invert on a cooling rack, and cool completely, about 2 hours.\nPut confectioners' sugar in a large bowl. Add juice, oil, and vanilla and stir vigorously, until thick and smooth but pourable. (Thin with water or a little more juice if needed.)\nPut a sheet of wax paper under rack with cake. Drizzle glaze over cake, letting excess drip off. Let stand until set, about 15 minutes.\n",
        "picture_link": "I3ou5X31ylGEWBNqJzWGaUp1QIjcej6"
    },
    {
        "title": "Stuffed Peppers from Green Giant®",
        "ingredients": [
            "1 pound ground turkey or chicken ADVERTISEMENT",
            "1 (12 ounce) package Green Giant® Riced Cauliflower & Sweet Potato ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "4 medium red or green bell peppers, halved lengthwise and seeded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F.\nCook turkey, Green Giant® Riced Cauliflower & Sweet Potato, onion, garlic and salt in a large nonstick skillet over medium-high heat 10 minutes, stirring occasionally, until turkey is no longer pink and vegetables are tender.\nStir in 1 cup mozzarella, 1 cup sauce, Parmesan cheese and Italian seasoning.\nArrange pepper halves in 3-quart baking dish.\nEvenly fill peppers with turkey mixture. Top each pepper with remaining sauce.\nCover and bake 25 minutes or until hot.\nRemove cover, sprinkle with remaining mozzarella and bake 5 minutes or until cheese is melted.\n",
        "picture_link": "6Z8dsXp4pIbu/0PFKfrdSqAsYG.W6yO"
    },
    {
        "title": "Grandma's Southern Mac and Cheese",
        "ingredients": [
            "1 pound elbow macaroni ADVERTISEMENT",
            "4 pounds Cheddar cheese, sliced ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "5 eggs, or more to taste ADVERTISEMENT",
            "1 tablespoon yellow mustard ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 minutes. Drain.\nLayer some of the macaroni in a 5-quart baking dish; top with a layer of Cheddar cheese. Continue layering macaroni and Cheddar cheese into the dish, ending with a Cheddar cheese layer.\nBeat milk, eggs, and mustard together in a bowl; pour over macaroni mixture, ensuring milk mixture gets to all of the macaroni.\nBake in the preheated oven until cheese is melted and just before cheese around the sides gets crisp, 20 to 25 minutes. Season with black pepper.\n",
        "picture_link": "om7owPKMEmqVlKSXBblD8e3BYXuLB0i"
    },
    {
        "title": "Garlicky Blue Cheese Steak",
        "ingredients": [
            "6 tablespoons butter, softened ADVERTISEMENT",
            "2 ounces blue cheese ADVERTISEMENT",
            "1 (2 pound) beef top sirloin steak, cut into 4 equal pieces ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "12 drops liquid smoke flavoring (optional) ADVERTISEMENT",
            "2 tablespoons minced garlic, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat Panasonic Countertop Induction Oven to Medium-High on the \"Grill\" setting.\nMix butter and blue cheese together in a mixing bowl. Refrigerate until ready to use.\nSeason steak pieces on one side with salt and pepper. Flip and add 3 drops liquid smoke, salt, and pepper to each piece of steak.\nPlace steak pieces on the grill pan. Close oven and set timer for 6 minutes. Flip steak pieces after 3 minutes and spread minced garlic evenly on top. Press \"Start\" again to continue cooking.\nAllow steaks to rest for a few minutes before transferring to a serving plate. Garnish with blue cheese butter mixture.\n",
        "picture_link": "P/Z4IEPnrbczq3RmBXsLhUMBYUwuNPu"
    },
    {
        "title": "Easy Sausage and Shrimp Gumbo",
        "ingredients": [
            "1 cup canola oil ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 pound andouille sausage, chopped ADVERTISEMENT",
            "2 tablespoons Cajun seasoning ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "6 cups low-sodium chicken stock ADVERTISEMENT",
            "1 pound peeled and deveined small shrimp ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir oil and flour in a skillet over medium heat until mixture is thick and the color of peanut butter, about 20 minutes.\nStir onion, green bell pepper, and celery into flour mixture; cook and stir until softened, about 5 minutes. Add sausage; cook and stir until browned, about 5 minutes. Add Cajun seasoning, garlic, and black pepper; cook and stir until fragrant, about 2 minutes.\nPour chicken stock over vegetable-sausage mixture; reduce heat to low and simmer for 30 minutes. Add shrimp and cook until shrimp are pink and cooked through, about 10 minutes.\n",
        "picture_link": "i4qPjQ.Wf8r679K4IgbHDwHS6AIs9va"
    },
    {
        "title": "Easy Banana Nut Pancakes ",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup finely chopped walnuts ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup almond milk ADVERTISEMENT",
            "2 small overripe bananas, mashed ADVERTISEMENT",
            "1 1/2 tablespoons butter, melted ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, walnuts, sugar, baking powder, nutmeg, cinnamon, baking soda, and salt in a large bowl; make a well in the center.\nWhisk almond milk, bananas, melted butter, and vanilla extract together in a separate bowl until smooth. Whisk in egg. Pour mixture into the well in the flour mixture; stir until just combined.\nHeat a lightly oiled skillet over medium-high heat. Drop 1/4 cup batter into the skillet; tilt gently to spread batter evenly. Cook until bubbles form and the edges are firm, 3 to 4 minutes. Flip and cook until browned on the other side, 1 to 2 minutes more. Repeat with remaining batter.\n",
        "picture_link": "z5tY1x6gHhy3uQDLIDkIM/EZ9lCSR72"
    },
    {
        "title": "Red Pepper Green Bean Almondine",
        "ingredients": [
            "3 cups fresh green beans, trimmed and halved ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/3 cup sliced almonds ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 teaspoon minced fresh parsley ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 red bell pepper, cut into thin strips ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add green beans and cook uncovered until bright green, about 3 minutes. Immerse green beans in ice water for 1 minute to stop the cooking process. Drain.\nHeat butter in a large skillet over medium heat until melted and bubbling, about 1 minute. Cook and stir almonds, garlic, parsley, salt, and pepper in the hot butter until almonds are golden, 2 to 3 minutes.\nStir green beans, red bell pepper, and mushrooms into the skillet; cook, stirring occasionally, until heated through, 2 to 3 minutes.\n",
        "picture_link": "/1XQu5gNAOOMB9ntAU0p3AskP1IJG0S"
    },
    {
        "title": "Sweet and Spicy BBQ Chicken Wings",
        "ingredients": [
            "2 pounds frozen, ready-to-cook chicken wings ADVERTISEMENT",
            "2/3 cup ketchup ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup dark brown sugar ADVERTISEMENT",
            "2 teaspoons smoked paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly cracked black pepper ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange chicken wings on a grill pan. Cook in the Panasonic Countertop Induction Oven on \"Auto Cook\" setting 1 until browned, about 18 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nMake barbeque sauce by whisking ketchup, vinegar, brown sugar, paprika, salt, pepper, and red pepper flakes together in a small sauce pan until well combined. Simmer for 5 minutes, stirring occasionally.\nPlace cooked wings in a large bowl; pour desired amount of sauce over top and toss to coat well.\n",
        "picture_link": ".pTtf/5f8EhNkQWK2IuPg2iUVHga8v6"
    },
    {
        "title": "Big Ray's Kielbasa Cabbage Skillet for a Crowd",
        "ingredients": [
            "3 large potatoes, cubed ADVERTISEMENT",
            "1/4 cup butter, divided ADVERTISEMENT",
            "1 pound Polish kielbasa sausage, cut into 1/2-inch slices ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 large head cabbage, coarsely chopped ADVERTISEMENT",
            "2 (15 ounce) cans diced tomatoes ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a microwave-safe bowl; cook in microwave until partially tender, about 8 minutes.\nHeat 2 tablespoons butter in a Dutch oven or large cast iron skillet over medium heat; cook and stir sausage and onions until browned, about 5 minutes. Transfer sausage and onions to a bowl.\nHeat remaining 2 tablespoons butter in the same Dutch oven; cook and stir cabbage until tender, about 5 minutes.\nCombine tomatoes, sugar, and paprika in a bowl; pour over cabbage and bring to a boil. Reduce heat and add potatoes and sausage-onion mixture. Cover Dutch oven and simmer until potatoes are tender, about 40 minutes.\n",
        "picture_link": "hTiKhTSvpkqDHPslUbn638hHOudmRn2"
    },
    {
        "title": "Peanut Butter and Chocolate Panini",
        "ingredients": [
            "1 teaspoon butter ADVERTISEMENT",
            "1/2 cup crunchy peanut butter ADVERTISEMENT",
            "8 slices firm bread ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a panini press according to manufacturer's instructions to medium-low heat. Coat inside surfaces with butter.\nSpread 1 to 2 tablespoons peanut butter onto half the bread slices; cover peanut butter with 1 to 2 tablespoons chocolate chips. Top each with a second slice of bread, creating 4 sandwiches.\nGrill each sandwich in the panini press until bread is toasted and chocolate is melted, 2 to 4 minutes.\n",
        "picture_link": "PpGr9kZqnJ4kEtS7lcu7kl0c8rTVyZq"
    },
    {
        "title": "Buddha Bowl",
        "ingredients": [
            "3 cups chicken broth ADVERTISEMENT",
            "1 1/2 cups quinoa ADVERTISEMENT",
            "1 large sweet potato, diced ADVERTISEMENT",
            "1 large red onion, diced ADVERTISEMENT",
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "3 cloves garlic, minced, divided ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "2 tablespoons smooth peanut butter ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "2 cups baby spinach ADVERTISEMENT",
            "1 avocado - peeled, pitted, and thinly sliced ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon toasted sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken broth and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and broth is absorbed, 15 to 20 minutes.\nPreheat oven to 425 degrees F (220 degrees C).\nSpread sweet potato and red onion onto a baking sheet. Drizzle 1 tablespoon olive oil over mixture and season with salt and pepper; toss to coat.\nBake in the preheated oven until sweet potatoes are tender, 20 to 25 minutes.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir 2 cloves garlic and ginger until fragrant, about 1 minute. Add chicken and cook until no longer pink in the center and the juices run clear, about 6 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut chicken into 1-inch pieces.\nWhisk 1 garlic clove, lime juice, peanut butter, soy sauce, and honey together in a bowl. Whisk 1 tablespoon olive oil and sesame oil into mixture until dressing is smooth.\nDivide quinoa among bowls; top with chicken, sweet potato mixture, spinach, and avocado. Sprinkle cilantro and sesame seeds over the top and drizzle dressing over each bowl.\n",
        "picture_link": "iA1IMg/OsZfB/d8m/3UbMm.hqci9HL6"
    },
    {
        "title": "Super Easy Drinkable Fruit Yogurt Shakes ",
        "ingredients": [
            "1 1/2 cups vanilla yogurt ADVERTISEMENT",
            "1/2 cup whole milk ADVERTISEMENT",
            "2 tablespoons seedless raspberry jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend vanilla yogurt, milk, and raspberry jam in a blender until smooth, about 1 minute.\n",
        "picture_link": "ReP38nHqG2Cpjoau.diQ9leaTZ9Nc7K"
    },
    {
        "title": "Microwave Blueberry Dutch Baby",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "5 large eggs ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1 tablespoon confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 1-quart microwave-safe casserole dish with cooking spray.\nBeat eggs by hand in a bowl until slightly frothy; add flour, sugar, sour cream, and salt. Beat until all ingredients are fully incorporated. Pour batter into prepared casserole dish; sprinkle blueberries over batter.\nMicrowave on high, turning dish around every minute, until center is set, 4 to 5 minutes. Divide onto plates and sprinkle with confectioners' sugar.\n",
        "picture_link": "gNlSN8QQ3bodzc7HO9qtHLz5GFJnUKK"
    },
    {
        "title": "North End Sunday Gravy",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "2 pork neck bones ADVERTISEMENT",
            "1 country-style pork rib ADVERTISEMENT",
            "1 (8 ounce) beef chuck in 1 piece ADVERTISEMENT",
            "1 beef rib, or more to taste ADVERTISEMENT",
            "1 lamb shank (optional) ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 pinch dried basil, or to taste ADVERTISEMENT",
            "1 pinch dried mint, or to taste ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (12 ounce) can tomato paste ADVERTISEMENT",
            "2 (28 ounce) cans crushed tomatoes ADVERTISEMENT",
            "7 cups water, or as needed ADVERTISEMENT",
            "2 pinches dried basil ADVERTISEMENT",
            "2 pinches dried mint ADVERTISEMENT",
            "2 pinches crushed red pepper flakes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound bulk Italian sausage ADVERTISEMENT",
            "1/2 tablespoon white sugar, or to taste ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/4 pound ground pork ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup Italian bread crumbs ADVERTISEMENT",
            "1/2 cup chopped Italian flat leaf parsley ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/2 teaspoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/4 cup olive oil in a stockpot over medium heat. Cook neck bones, country-style pork rib, beef chuck, beef rib, and lamb shank in hot oil, turning regularly, until browned on all sides, 7 to 10 minutes. Remove all the meat to a large bowl.\nPour another 1/4 cup olive oil into the stockpot and heat over medium heat; stir a pinch of basil, a pinch of mint, and a pinch of red pepper flakes into the oil. Cook and stir onions in hot oil until translucent, about 5 minutes. Add garlic; cook and stir 1 minute more. Stir the tomato paste into the onion mixture until incorporated. Pour crushed tomatoes and water into the mixture and bring to a low boil. Add an additional 2 pinches each of basil, mint, and red pepper flakes. Season with salt and black pepper.\nReturn the browned meats to the tomato mixture; bring to a simmer and cook, stirring every 15 minutes, for 2 1/2 hours. Remove the neck bones and discard.\nHeat 2 tablespoons olive oil in a skillet over medium heat. Crumble Italian sausage into the skillet; cook and stir until crumbly, evenly browned, and no longer pink, 5 to 7 minutes. Drain and discard any excess grease. Stir sausage into the tomato sauce with sugar. Return the sauce to a simmer and cook another 1 1/2 hours.\nMix ground beef, ground pork, eggs, milk, Italian bread crumbs, parsley, Parmesan cheese, and garlic with your hands in a large bowl until evenly mixed; shape into 2-inch balls.\nHeat 1 1/2 teaspoons in a skillet over medium heat. Cook the meat balls in hot oil until evenly browned, 5 to 7 minutes.\nAdd meatballs to the tomato sauce. Cook at a simmer for 1 hour, adding water as needed to keep sauce from becoming too thick. Remove stockpot from heat; let sit 2 to 3 minutes. Skim and discard any fat from the top of the sauce.\n",
        "picture_link": "unmzGobuKY5OiGdG3BFL5mG0YN2VjwO"
    },
    {
        "title": "Bacon, Herb and Cheese Snack Bread",
        "ingredients": [
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 envelopes Fleischmann's® RapidRise Yeast ADVERTISEMENT",
            "1 1/2 teaspoons Spice Islands® Italian Herb Seasoning ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/4 cup Mazola® Vegetable Plus! Oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "8 ounces shredded cheese blend (Cheddar Jack, Cheddar mozzarella, etc.) ADVERTISEMENT",
            "6 slices cooked bacon, coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1-1/2 cups flour, undissolved yeast, Italian herb seasoning, salt and garlic in a large mixer bowl. Heat water and oil until very warm (120 degrees to 130 degrees F); gradually add to flour mixture. Beat 2 minutes at medium speed of electric mixer, scraping bowl occasionally. Add eggs and 1 cup flour; beat 2 minutes at high speed. Stir in 1 cup cheese and remaining flour to make a stiff batter. Spread batter on greased 15 x 10-inch jelly roll pan or rimmed baking sheet with at least 1-inch sides. Sprinkle with remaining cheese; top with bacon. Cover; let rise in warm, draft-free place until doubled in size, about 30 minutes.\nBake at 375 degrees F for 25 to 30 minutes or until done. Cover loosely with foil during last 5 to 10 minutes of baking if cheese begins to overbrown. Remove from pan; cool on wire rack. Serve as strips or squares, or slice and use for sandwiches.\n",
        "picture_link": "arAroBRG2IuWgyzfpGUihiwL2l3qSrK"
    },
    {
        "title": "Prawns Provencale",
        "ingredients": [
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "2 pounds raw shrimp (16-20 per pound) ADVERTISEMENT",
            "Breadcrumb Mixture: ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "1/4 teaspoon dried oregano leaves ADVERTISEMENT",
            "1/4 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/3 cup chopped fresh Italian parsley, divided ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1 cup plain dry bread crumbs ADVERTISEMENT",
            "1 pinch kosher salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1/2 cup freshly grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 475 degrees F (245 degrees C). Line a sheet pan with aluminum foil. Brush with 1 tablespoon olive oil.\nCarefully remove shells and legs of prawns; leave the tail attached. To butterfly the prawns, cut a slit with a small sharp knife lengthwise down the belly side of shrimp, almost to the skin on the back. Open out like a book.\nPlace chopped garlic, large pinch kosher salt, oregano, and thyme in a mortar; pound and stir with a pestle a few seconds. Add 1 tablespoon fresh parsley. Pound and stir mixture until it turns into a paste, 1 or 2 minutes. Add 1/3 cup olive oil; mix about 1 minute to infuse olive oil with herbs and garlic.\nPlace bread crumbs in a mixing bowl. Transfer herb-garlic mixture to breadcrumbs. Add a pinch of salt, black pepper, pinch cayenne, remaining chopped parsley, and grated cheese. Mix with a fork to distribute ingredients evenly. Pinch a bit of the mixture; if it feels a bit dry and doesn't stick to your finger, drizzle in a bit more olive oil. Stir until mixture reaches desired consistency. 2 to 3 minutes.\nLightly but thoroughly coat cut side of prawns with crumb mixture; place on prepared baking sheet.\nBake in preheated oven until cooked through and tails curl up, 8 to 10 minutes.\n",
        "picture_link": "S6GJuwwSs7IyVwytSXH12ZkZRtAdUqK"
    },
    {
        "title": "Turkey and Sun-dried Tomato Panini",
        "ingredients": [
            "1 tablespoon butter, or more if needed ADVERTISEMENT",
            "2 slices ciabatta bread ADVERTISEMENT",
            "6 slices deli-style sliced turkey breast ADVERTISEMENT",
            "2 slices provolone cheese ADVERTISEMENT",
            "3 sun-dried tomatoes packed in oil, drained and chopped ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a panini press according to manufacturer's instructions for medium heat.\nButter one side of each piece of bread. Lay 1 slice bread, butter side down, on the preheated panini press; layer with turkey, provolone cheese, and sun-dried tomatoes. Sprinkle with Italian seasoning. Top with second slice of bread.\nPress panini maker down and cook until provolone cheese has melted and bread is toasted, about 5 minutes. Cut in half and serve warm.\n",
        "picture_link": "hXrtlXRprPJfNZS4sbmlz0IK5Jq3bZm"
    },
    {
        "title": "Best Cheese Dip",
        "ingredients": [
            "1/2 pound bulk spicy pork sausage ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 (2 pound) loaf processed cheese food (such as Velveeta®), cubed ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Crumble sausage and ground beef into the skillet; add the onion. Cook and stir the beef mixture until the meat is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease. Pour into a slow cooker.\nLayer cheese food cubes atop meat mixture.\nBlend diced tomatoes with green chile peppers in a blender until smooth; pour over the cheese cubes along with the cream of mushroom soup. Stir the mixture.\nCook on High, stirring occasionally until the cheese is completely melted, about 90 minutes.\n",
        "picture_link": "O.qBTyxS8pV/a/nX3gbySV6yNzVA/sO"
    },
    {
        "title": "Chef John's Buffalo Chicken Nuggets",
        "ingredients": [
            "1 1/2 pounds skinless, boneless chicken thighs ADVERTISEMENT",
            "2 tablespoons fine dry breadcrumbs ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 tablespoon Buffalo-style hot pepper sauce (such as Frank's® RedHot) ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "Starch Coating: ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "1/3 cup self-rising flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken thighs in bowl of a food processor. Add breadcrumbs, kosher salt, paprika, pepper, seafood seasoning, and cayenne pepper. Drizzle in hot sauce and melted butter. Pulse on and off until mixture becomes a course paste with very few big chunks, about 18 pulses.\nLine a rimmed baking sheet with a silicon mat. Scoop out 24 portions of the chicken mixture with a small ice-cream scoop and place on mat. Cover sheet with plastic wrap. Refrigerate until thoroughly chilled. (Or place pan in freezer for 15 minutes.)\nLine a rimmed baking sheet with parchment paper.\nPlace cornstarch, self-rising flour, and salt into a quart-size zip-top plastic bag. Shake bag to mix thoroughly. Place 3 or 4 scoops of chilled chicken mixture into the bag; shake gently to coat and place on parchment-lined pan. Repeat with the rest of the nuggets. Shape them into flattened ovals, about 5/8-inch thick. Refrigerate pan overnight or until starch on surface is absorbed, flipping over once while they're in the fridge.\nHeat oil in a deep-fryer or large saucepan to 300 degrees F (150 degrees C).\nFry nuggets in batches for 1 minute. Drain on a rack over a baking sheet; chill about 1 hour or until you're ready to serve them.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Fry the nuggets a second time in batches for 2 minutes. Drain on rack.\n",
        "picture_link": ".OPEt09k5pywYn7n/Mi6AkLPOjLqDZO"
    },
    {
        "title": "Zucchini and Soy Bean Stir Fry",
        "ingredients": [
            "1/3 cup broccoli florets ADVERTISEMENT",
            "1/3 cup cauliflower florets ADVERTISEMENT",
            "1/2 cup shelled edamame (green soybeans) ADVERTISEMENT",
            "1 large carrot, chopped ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 zucchini, sliced ADVERTISEMENT",
            "5 large mushrooms, sliced ADVERTISEMENT",
            "1 tablespoon finely chopped garlic ADVERTISEMENT",
            "1 1/2 tablespoons reduced-sodium teriyaki sauce ADVERTISEMENT",
            "2 tablespoons agave nectar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine broccoli, cauliflower, edamame, carrots, and water in a microwave-safe bowl. Cover with plastic wrap and microwave for 1 minute until vegetables are tender. Set aside.\nHeat olive oil in a skillet over medium heat; add onion. Cook and stir until onion is softened and beginning to brown, about 10 minutes.\nStir cooked broccoli, cauliflower, edamame, carrots, zucchini, mushrooms, and garlic into the pan; cook and stir until vegetables are cooked through, about 5 minutes.\nStir in reduced-sodium teriyaki sauce and agave nectar; cook 5 more minutes.\n",
        "picture_link": "DZGODqG2wZrm8prdkLl3s46gd2g/G6a"
    },
    {
        "title": "Rick's Tomato Gravy",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "3 tablespoons self-rising flour ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 (15 ounce) can diced tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove bacon from pan, keeping the drippings in the skillet. Allow bacon to cool; crumble and return to bacon drippings.\nStir flour into bacon and drippings over medium-high heat; cook and stir until flour is blended and lightly browned, 3 to 5 minutes. Slowly whisk water into flour mixture until thickened, about 5 minutes; season with salt and black pepper. Stir in tomatoes and simmer until gravy is cooked through, about 5 minutes. Serve over warmed biscuits.\n",
        "picture_link": "NJ6mbXi8kX/nH9G3DT.fI6pmE4X1eSy"
    },
    {
        "title": "Avocado Tuna Mousse",
        "ingredients": [
            "1 1/4 cups fat-free sour cream ADVERTISEMENT",
            "3 tablespoons low-fat creamy salad dressing (such as Miracle Whip Light®) ADVERTISEMENT",
            "1 teaspoon sweet pickle relish ADVERTISEMENT",
            "2 teaspoons yellow mustard ADVERTISEMENT",
            "1/8 teaspoon dried minced onion ADVERTISEMENT",
            "2 (5 ounce) cans tuna in water, drained ADVERTISEMENT",
            "2 avocados, cut into 1/4-inch dice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the fat-free sour cream, creamy salad dressing, pickle relish, yellow mustard, and minced onion flakes in a bowl until well mixed. Add the drained tuna and mix well.\nAdd the avocado in small amounts and stir gently, just enough to distribute the avocado without mashing. Chill before serving.\n",
        "picture_link": "XLCb668e1dYCmhQ1wlH251XvRsMDYim"
    },
    {
        "title": "Ultimate Banana Muffins",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 dash ground nutmeg ADVERTISEMENT",
            "3 very ripe bananas ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1/4 cup lightly packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a muffin tin.\nSift flour, baking powder, baking soda, cinnamon, salt, and nutmeg together in a small bowl.\nMash bananas in a large bowl. Mix in white sugar, melted butter, brown sugar, egg, and vanilla extract. Fold in flour mixture until just combined. Fold walnuts into the batter.\nDivide batter evenly among the muffin cups.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes.\n",
        "picture_link": "2CRUenJL9B0vabKPkwEt7MDFFGK3Mc2"
    },
    {
        "title": "Linguine with Summer Squash, Tomatoes, and Basil",
        "ingredients": [
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 large zucchini, sliced into thin rounds ADVERTISEMENT",
            "1 large yellow squash, sliced into thin rounds ADVERTISEMENT",
            "1 cup cherry or grape tomatoes, halved ADVERTISEMENT",
            "1 (16 ounce) package fresh linguine pasta ADVERTISEMENT",
            "1 (8 ounce) container skim milk ricotta cheese, divided ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, garlic, 1/2 cup of basil, salt, and pepper in a large bowl. Add zucchini, yellow squash, and tomatoes to the oil mixture and toss to coat.\nBring a large pot of lightly salted water to a boil. Cook the linguine at a boil until tender yet firm to the bite, about 5 to 10 minutes; drain. Transfer pasta to a serving bowl.\nWhile the pasta is warm, fold in half of vegetable mixture along with 2 tablespoons ricotta cheese, until pasta is coated and vegetables are evenly dispersed. Top with remaining vegetable mixture. Spoon remaining ricotta on top. Sprinkle 1/2 cup chopped basil over the dish. Season with salt and pepper to serve.\n",
        "picture_link": "Q6mTU91sTAoV40rJXwFD.Ed.Rmh41Mm"
    },
    {
        "title": "Orange Almond Mixed Green Salad",
        "ingredients": [
            "3 tablespoons canola oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1 head red leaf lettuce, torn ADVERTISEMENT",
            "1 (11 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1/4 cup slivered almonds, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine canola oil, vinegar, sugar, lemon juice, salt, and dry mustard in a jar with a lid. Shake until ingredients combine into a dressing.\nToss lettuce, oranges, and almonds together in a large mixing bowl. Drizzle dressing over the salad and toss to coat.\n",
        "picture_link": "JxYqk9tH.cbr/g.ploVMI2c7PrjwAei"
    },
    {
        "title": "Creamy Smoked Paprika Sauce",
        "ingredients": [
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/4 cup smoked paprika ADVERTISEMENT",
            "2 teaspoons capers, minced ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix yogurt, mayonnaise, and lime juice in a bowl. Add paprika, capers, oregano, cumin, dill, and cayenne pepper; stir until evenly mixed.\n",
        "picture_link": "E8zlUonRhLJmuvzJZPgkWu5u2kRtc3O"
    },
    {
        "title": "Cottage Cheese Salad with Egg and Radish",
        "ingredients": [
            "1 (16 ounce) container cottage cheese ADVERTISEMENT",
            "1 hard-cooked egg, diced ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "3 radishes, chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cottage cheese, egg, chives, radishes, and salt together in a bowl.\n",
        "picture_link": "oIrCpO/6zX9x/IcaATGXpWZpgouKP7e"
    },
    {
        "title": "Palak Paneer",
        "ingredients": [
            "cheesecloth ADVERTISEMENT",
            "1 gallon whole milk ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1 bunch fresh spinach leaves ADVERTISEMENT",
            "1 pound tomatoes ADVERTISEMENT",
            "1/4 cup ghee (clarified butter) ADVERTISEMENT",
            "1 teaspoon turmeric powder ADVERTISEMENT",
            "1 teaspoon ground red chile pepper ADVERTISEMENT",
            "1/4 teaspoon asafoetida powder (hing) ADVERTISEMENT",
            "1 1/2 teaspoons salt, or to taste ADVERTISEMENT",
            "2 tablespoons heavy whipping cream, or more as needed ADVERTISEMENT",
            "1/4 teaspoon ground fenugreek seeds (methi powder) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a colander with a cheesecloth and place in the sink.\nBring milk to a boil in a large pot; add lemon juice. Stir until milk separates into curds and whey. Transfer curds with a large slotted spoon to the prepared colander and allow curds to drain. Whey can be saved for another use.\nGather cheesecloth around curds to squeeze out excess liquid and to form a ball. Return wrapped curd ball to the colander and place the whey-filled pot (or another weight) over the curd ball to press and drain completely, about 20 minutes.\nBring a large pot of water to a boil; add spinach. Simmer until spinach is wilted, 1 to 2 minutes. Transfer spinach to a bowl with a slotted spoon. Drop tomatoes into the same pot of boiling water; simmer until tomato skins begin to split, 3 to 5 minutes. Drain. Peel tomato skins when cool enough to handle.\nPlace spinach in a blender or food processor; puree until smooth and remove spinach to a bowl.\nPlace peeled tomatoes in a blender or food processor; puree until smooth and remove tomatoes to another bowl.\nUnwrap curd ball from cheesecloth; paneer should now be a solid block. Cut paneer into small cubes.\nHeat ghee in a large skillet over medium-low heat; cook and stir turmeric, ground red chile powder, and asafoetida powder in hot ghee until fragrant, about 20 seconds. Stir in tomato puree into ghee and spices and increase heat to medium. Cover and simmer until ghee rises to the top, about 10 minutes.\nStir spinach puree and salt into tomato mixture. Continue to simmer until fragrant, 5 to 10 minutes more. Add cubed paneer to skillet; cook until paneer is softened, 2 to 3 minutes. Stir cream into spinach-tomato mixture, cover, and simmer until hot, 2 to 3 minutes more.\nRemove skillet from heat and sprinkle with ground fenugreek. Cool for a few minutes before serving.\n",
        "picture_link": "T6LmxvBZoQ6SJjvacBnN8A.E7Ekc2RC"
    },
    {
        "title": "Crispy Peanut Butter Candy Delight",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (9 inch) angel food cake ADVERTISEMENT",
            "6 (2.1 ounce) bars chocolate-covered crispy peanut butter flavored candy bar ADVERTISEMENT",
            "1/2 cup pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, cream together butter, sugar vanilla and egg yolks. Fold whipped topping into butter mixture.\nTear angel food cake into very small pieces. Crush candy bars. Place half of cake pieces in 9x13 inch pan. Spread half of creamy mixture over cake pieces. Top with half of nuts and half of crushed candy bars. Repeat. Chill in refrigerator before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocaholics Delight",
        "ingredients": [
            "5 king size bars milk chocolate covered caramel and nougat ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "15 ounces digestive biscuits, crushed ADVERTISEMENT",
            "2 chocolate covered caramel cookie bars, such asTwix® ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "1/2 cup chopped hazelnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a double boiler over simmering water, melt nougat bars. Stir in melted butter.\nButter a deep 9 inch dish and coat with crushed biscuits. Combine remaining crushed biscuits with chopped cookie bars.\nStir the eggs into the melted nougat bar mixture. Remove from heat and stir in biscuit mixture, raisins and hazelnuts. Pour into prepared dish. Chill 8 hours or overnight in refrigerator. Turn out onto a serving platter and cut to serve. Keep chilled.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Melon Heaven",
        "ingredients": [
            "1 large ripe cantaloupe ADVERTISEMENT",
            "2 quarts cold water ADVERTISEMENT",
            "1 large honeydew melon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grate cantaloupe and place in a 2 quart pitcher. Fill the pitcher will water and place in the refrigerator overnight.\nUse a balling spoon to make little balls out of the honeydew melon. Add the honeydew melon balls to the cantaloupe mixture just before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar Nut Bars",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 cups cake flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "2 tablespoons confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Grease one 9x13 inch baking dish.\nIn a saucepan over medium heat, melt the butter and blend together with the brown sugar. Remove from heat; set aside to cool.\nAdd the flour, baking powder, vanilla and chopped nuts.\nPour into prepared pan and bake at 250 degrees F (120 degrees C) for 50 minutes. Remove from oven and allow to cool. Cut into bars and roll in confectioners' sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bordeaux Martini",
        "ingredients": [
            "8 fluid ounces citron vodka ADVERTISEMENT",
            "2 fluid ounces Lillet blanc ADVERTISEMENT",
            "1 lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill mixing container with ice. Pour in vodka and Lillet blanc aperitif wine. Stir for 2 minutes, until very cold. Strain into 4 cooled martini glasses.\nCut a fresh twist of lemon peel OVER THE GLASS and drop into drink (the zest and spray of this action - falling into the glass - is crucial!)\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Creamy Tuna Pasta Salad",
        "ingredients": [
            "1 (8 ounce) package small seashell pasta ADVERTISEMENT",
            "2 yellow squash, chopped ADVERTISEMENT",
            "1 zucchini, chopped ADVERTISEMENT",
            "1/2 cup chopped banana squash ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "1/2 (15 ounce) can canned corn ADVERTISEMENT",
            "2 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "1/2 cup Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Stir in pasta and return pot to boil. Cook until al dente. Drain well.\nPlace squash and zucchini in a medium saucepan with 2 cups of water. Bring to a boil and cook until tender, about 15 minutes. Drain and set aside.\nIn a large bowl, combine pasta, squash, zucchini, kidney beans, corn and tuna. Mix well and chill for at least 30 minutes. After salad is chilled, stir in dressing and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cool Cookie Crumble",
        "ingredients": [
            "1 (3 ounce) package fruit flavored Jell-O® mix ADVERTISEMENT",
            "2/3 cup boiling water ADVERTISEMENT",
            "1 1/4 cups ice water ADVERTISEMENT",
            "3 1/2 cups frozen whipped topping, thawed ADVERTISEMENT",
            "10 vanilla wafers, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, add gelatin to boiling water, stir until dissolved, about 3 minutes. Add ice water to gelatin and stir until gelatin begins to thicken. Whisk in whipped topping.\nPlace crumbled cookies in large serving bowl or six individual glasses. Spoon gelatin mixture on top of cookies. Chill 2 hours in refrigerator before serving.\n",
        "picture_link": "pzB4/MUIIU4We8JvbB3q0cxZUhWs3xK"
    },
    {
        "title": "Pineapple Flip",
        "ingredients": [
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, juice reserved ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup margarine ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Filling: In a medium bowl blend together cornstarch, sugar and salt, then stir in egg yolks and 1/2 cup of pineapple juice. Scald milk and cool slightly; whisk cornstarch mixture into scalded milk and bring to a boil over low heat until mixture thickens. Allow to cool for a short amount of time, then stir in 3/4 cup of the drained pineapple and vanilla to the cooked mixture and set aside to cool.\nTo Make Dough: In a large bowl sift together flour, salt and baking powder; cut in margarine. In a small bowl, slightly beat milk and eggs together. Combine egg mixture with dry ingredients; mix together until dough is formed.\nTo Make Crust: Divide dough into two parts. Take one part and roll between sheets of floured wax paper; rolled dough should fit a jelly roll pan allowing for slight overhang on edges. Roll remaining half in the same fashion.\nTransfer one of the rolled dough halves to pan and spread with cooled filling. Place other portion of rolled dough on top of the filling and crimp edges of dough layers together.\nBake at 350 degrees F (175 degrees C) for 40 minutes or until golden brown. Let cool. If desired, frost with confectioners' icing.\n",
        "picture_link": "6S/98kWpgn.uj7D4g9MqzVh7uD2bk5i"
    },
    {
        "title": "Chocolate Pecan Pie V",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/2 cup frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a double boiler melt chocolate and butter or margarine.\nCombine sugar and corn syrup in a medium saucepan. Bring to a rapid boil and allow mixture to boil 2 minutes. Add chocolate mixture, stirring well.\nPlace eggs in a medium bowl. While whisking constantly, pour chocolate mixture over eggs. Whisk in vanilla extract, then stir in pecans. Pour mixture into pie shell.\nBake in preheated oven for 45 to 50 minutes. Cool before serving. Top each slice with a spoonful of whipped topping.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pineapple Meringue Pudding",
        "ingredients": [
            "1/3 cup cornstarch ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups hot milk ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 1/2 teaspoons grated orange zest ADVERTISEMENT",
            "2 cups pineapple chunks ADVERTISEMENT",
            "1/2 (16 ounce) package vanilla wafers ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cornstarch, 2/3 cup sugar and 1/2 teaspoon salt in top of double boiler over simmering water. Pour in hot milk, stir and cover and cook, stirring occasionally, 10 minutes, or until thick. Beat egg yolks in separate bowl. Pour a little of hot milk mixture into egg yolks, and stir to combine. Pour egg mixture back into rest of milk mixture and stir well. Cook 2 minutes more, stir in orange zest, and remove from heat and let cool.\nPreheat oven to 350 degrees F (175 degrees C).\nLayer vanilla wafers, cooled pudding and pineapple in six ovenproof serving dishes or large ramekins. In large bowl, whip egg whites with 1/3 cup sugar and 1/4 teaspoon salt until stiff peaks form. Top puddings with egg white mixture.\nBake 15 minutes, until meringue is golden brown. Let cool and chill in refrigerator until serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Knots",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together eggs, sugar, vegetable oil and vanilla using an electric mixer on medium speed. Combine the flour, baking powder and salt, Gradually stir into the mixture by hand using a large spoon. Turn dough out onto a lightly floured surface and knead to make a soft elastic dough, about 5 minutes. Cover the dough and let rest at room temperature for 15 to 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets or line with parchment paper. Break off small pieces of dough and roll into small ropes about 4 inches long and 1/4 inch wide. Twist the ropes into loose knots or braids. place them 1 inch apart onto the prepared cookie sheets.\nBake for 15 to 20 minutes in the preheated oven, or until firm and lightly browned. Remove from cookie sheets to cool on wire racks. When cool, frost with a simple confectioners' glaze.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Adult Punch",
        "ingredients": [
            "2 quarts orange juice ADVERTISEMENT",
            "1 (750 milliliter) bottle gin ADVERTISEMENT",
            "6 (12 fluid ounce) cans or bottles caffeinated lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "1/2 gallon vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large punch bowl combine orange juice and gin. Gently stir in the carbonated soda and slide in the ice cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peach Clouds",
        "ingredients": [
            "6 egg whites ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "6 fresh peaches - peeled, pitted and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nBeat egg whites in clean, dry bowl with electric mixer for 2 minutes. Beat in salt and cream of tartar. Continue beating and pour in sugar, a few tablespoons at a time, until mixture is glossy and stiff peaks form. Fold in vanilla.\nPlace in greased pie plate or spoon or pipe onto parchment-lined baking sheets.\nPlace in preheated oven and turn oven off. Leave meringue in unopened oven 8 hours or overnight. To serve, place meringue on serving platter and arrange peaches on top.\n",
        "picture_link": "yyFOlwu5h61WA0KQMVx6IrTrxs.Ob26"
    },
    {
        "title": "Dough Art Basket",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine flour and salt. Mix in water, stirring constantly, until the dough pulls together. Turn dough out onto a lightly floured surface and knead until smooth and firm, about 7 to 10 minutes.\nInvert a medium sized mixing bowl and cover tightly with aluminum foil. Turn up the edge of the foil to make a shelf around the outer rim of the bowl. Roll a piece of dough out to 1/2 inch thickness and cut out a 3 inch circle. Place this circle on top of the inverted bowl to form the base of the basket.\nRoll dough out into long ropes. Braid the ropes together and coil them around the mixing bowl starting at the circle. Wet the dough slightly where you want it to stick together. To make a smooth transition from one braid to the next, snip the ends off square and press together with a bit of water. Stick each new row to the one before it. Continue until the bowl is completely wrapped in dough. When you reach the top of the bowl, finish it off by wrapping a single rope of dough around the rim. Brush the basket with egg white.\nBake in preheated oven for 30 minutes, or until basket is firm. Remove from oven, slip basket off of the bowl and bake until hard and golden, this takes about 30 to 40 minutes depending on the thickness of the basket.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blurry-Eyed Kicker",
        "ingredients": [
            "1/4 fluid ounce melon liqueur ADVERTISEMENT",
            "1/4 fluid ounce Southern Comfort liqueur ADVERTISEMENT",
            "1/4 fluid ounce banana liqueur ADVERTISEMENT",
            "1/4 fluid ounce vodka ADVERTISEMENT",
            "3/4 fluid ounce orange juice ADVERTISEMENT",
            "1/2 ounce whiskey sour mix ADVERTISEMENT",
            "2 cups ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice. Pour in the melon liqueur, Southern Comfort, Banana liqueur, vodka, orange juice and sour mix.\nShake vigorously for 1 to 2 minutes. Strain into a highball glass and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lady Joy",
        "ingredients": [
            "2/3 fluid ounce lemon rum ADVERTISEMENT",
            "2/3 fluid ounce Blue Curacao ADVERTISEMENT",
            "6 fluid ounces champagne ADVERTISEMENT",
            "1 twist lemon zest, garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a champagne flute, pour the lemon rum and blue curacao. Fill glass with champagne and garnish with a twist of lemon.\n",
        "picture_link": "9H3ak/yDPQzdzabPU71aj7vATwjMXj2"
    },
    {
        "title": "Diva Colada",
        "ingredients": [
            "1 cup pineapple juice ADVERTISEMENT",
            "2 cups pineapple sorbet ADVERTISEMENT",
            "2 tablespoons cream of coconut ADVERTISEMENT",
            "1 slice fresh pineapple ADVERTISEMENT",
            "2 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine pineapple juice, pineapple sherbet and coconut cream. Blend until smooth. Pour into glasses and serve garnished with a wedge of pineapple and a cherry.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Casa Marina",
        "ingredients": [
            "1 fluid ounce melon liqueur ADVERTISEMENT",
            "1 fluid ounce peach schnapps ADVERTISEMENT",
            "1 fluid ounce coconut flavored rum ADVERTISEMENT",
            "2 fluid ounces white rum ADVERTISEMENT",
            "3 2/3 fluid ounces orange juice ADVERTISEMENT",
            "3 2/3 fluid ounces cranberry juice ADVERTISEMENT",
            "2 twists lime zest, garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a cocktail shaker full of ice, combine melon liqueur, peach schnapps, coconut rum, white rum, orange juice and cranberry juice. Shake vigorously for about 60 seconds. Strain into 2 tall glasses and serve with a twist of lime zest.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sour Cream Raisin Pie VI",
        "ingredients": [
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium bowl, beat together eggs and sugar until smooth and lemon-colored. Add sour cream, raisins, and pecans. Stir well and pour mixture into pastry shell.\nBake in preheated oven for 10 minutes, then reduce heat to 350 degrees F (175 degrees C) and bake an additional 45 minutes. Cool before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chinese Shrimp Salad",
        "ingredients": [
            "1 (11 ounce) can lychee fruit, drained with juice reserved ADVERTISEMENT",
            "1 pound cooked shrimp - peeled and deveined ADVERTISEMENT",
            "3 Fuji apples - peeled, cored and cubed ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine lychees, shrimp and apples. Stir in lemon juice and 1/4 cup reserved lychee juice. Let chill for 15 minutes.\nRemove from refrigerator and drain liquid. Combine drained liquid with mayonnaise and toss together with fruit. Chill for at least another hour and serve cold.\n",
        "picture_link": "auEGFvCjaEjR7AN0CM86A/vxr2YErt6"
    },
    {
        "title": "Clean-Eating Pumpkin Spice Coffee Creamer",
        "ingredients": [
            "1 1/4 cups almond milk ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "3 tablespoons pumpkin puree ADVERTISEMENT",
            "3 1/2 teaspoons pure vanilla extract ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend almond milk, honey, pumpkin puree, vanilla extract, and pumpkin pie spice together in a blender; store in an airtight container in the refrigerator.\n",
        "picture_link": "TVXOt2hcS5pcK1wfTuIB1y7gN.NtC4S"
    },
    {
        "title": "Pumpkin Sandwich Rolls",
        "ingredients": [
            "1 cup milk, room temperature ADVERTISEMENT",
            "2 eggs, room temperature ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 1/2 cups white whole wheat flour (such as King Arthur®) ADVERTISEMENT",
            "3 1/2 cups bread flour ADVERTISEMENT",
            "1 (.25 ounce) package instant yeast ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground white pepper (optional) ADVERTISEMENT",
            "1/4 cup butter, room temperature ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "Flexible plastic lids, for stencils ADVERTISEMENT",
            "1/4 cup light rye flour, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk milk and 2 eggs together in the bowl of a stand mixer; add pumpkin puree and honey and continue to stir until smooth.\nAdd white whole wheat flour, bread flour, yeast, salt, and white pepper to the pumpkin mixture. Attach the dough hook to the stand mixture and mix on low speed with the dough hook for 5 minutes, using a bowl scraper or stiff spatula to scrape down the sides of the bowl once or twice. Increase speed to medium-low. Add butter one piece at a time, mixing until each piece is completely incorporated before adding the next.\nTransfer the dough to a greased bowl. Cover bowl with plastic wrap and let the dough rise at room temperature until dough has doubled, 1 to 1 1/2 hours.\nWhile the dough rises, draw designs with permanent marker onto a flexible plastic lid. Cut shapes with a sharp paring knife or X-ACTO® knife. Wash the lids with warm soapy water to remove any remaining ink.\nPunch the dough down and fold it over to expel air bubbles. Cover the bowl with plastic wrap and refrigerate until approximately 2 hours before you wish to serve the rolls.\nRemove dough from the refrigerator and scrape from bowl onto a flour-dusted work surface. Divide the dough into 12 evenly sized pieces and shape into tight balls. Line 2 baking sheets with baking parchment; arrange balls seam-side down onto prepared sheets. (You can also freeze the dough at this point. Refer to footnotes for tips for freezing.)\nCover rolls with greased plastic wrap and let sit at room temperature for 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBeat 1 egg and water together in a small bowl using a whisk.\nGrease your hands and use them to gently flatten the dough balls into flat rounds, about 1/2 inch thick. Brush egg wash over the top of each round.\nSet a fine mesh strainer on a plate. Pour rye flour into the strainer. Place a stencil over one of the rounds. Sift rye flour onto the stencil. Carefully lift the stencil off the roll. Knock extra flour off stencil and onto the plate. Repeat with remaining rolls.\nLet dough rounds stand at room temperature until risen fully, about 10 minutes. Test for readiness by dabbing your index finger in flour and pressing it gently into the side of a roll, if the indentation springs back, let the dough rise until risen enough so another such indentation stays, about 5 minutes more.\nBake rolls in preheated oven until tops are golden and bottoms are browned, 15 to 20 minutes.\n",
        "picture_link": "FyBtUN.d5qScVITZjUxT7pOTjXh47ze"
    },
    {
        "title": "Coconut Ginger Oatmeal Raisin Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3 tablespoons grated fresh ginger ADVERTISEMENT",
            "lemon, juiced ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar, or to taste ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup quick-cooking oats ADVERTISEMENT",
            "1 cup finely shredded coconut ADVERTISEMENT",
            "1 cup Thompson seedless raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nCombine flour, baking powder, and baking soda together in a bowl. Mix ginger and lemon juice together in a separate bowl.\nBeat butter and sugar together in a bowl until smooth and creamy; add egg and beat until light and creamy. Stir oats, coconut, raisins, and ginger mixture into creamed butter mixture until well mixed. Add flour mixture to butter-oats mixture and stir until dough is well mixed. Spoon dough onto the prepared baking sheet about 2 inches apart.\nBake in the preheated oven until cookies are lightly golden brown, about 10 minutes. Cool cookies in a wire rack.\n",
        "picture_link": "rexqdoaEjGVmQ.MpW46TrM5/5NnpA3i"
    },
    {
        "title": "Sweet Italian Chicken Sausage Panzanella",
        "ingredients": [
            "1 (12 ounce) package al fresco® Sweet Italian Style Chicken Sausage ADVERTISEMENT",
            "3 ounces day-old crusty Italian or French bread, cut or torn into bite-size pieces ADVERTISEMENT",
            "3 cups ripe tomatoes, cut into bite-size chunks* ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/4 cup finely chopped scallions ADVERTISEMENT",
            "2/3 cup red wine vinaigrette ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "1/3 cup chopped fresh basil plus extra for garnish ADVERTISEMENT",
            "2 cups torn or chopped romaine lettuce, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread bread onto baking sheet. Allow bread to dry slightly while preparing other ingredients.\nPlace sausage on an oiled grill rack, set 4 to 5 inches over medium-low heat. Grill, with lid closed, using the direct grill method, turning with tongs, until cooked throughout, about 7 to 9 minutes. Cook until internal temperature reaches 165 degrees. Cool slightly and cut into bite-sized chunks.\nMeanwhile, in a large bowl, stir tomatoes, olives, green onions and vinaigrette together. Add bread and sausage. Toss to coat all surfaces.\nAdd Parmesan and chopped basil. Arrange 1/2 cup romaine on each plate and spoon salad atop lettuce. Garnish with extra basil. Serve immediately.\n",
        "picture_link": "CPOhtkVF61fsL8etT2HnyNUbgsuJvw."
    },
    {
        "title": "Easy Cheeseburger Casserole",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "Crust: ADVERTISEMENT",
            "5 cups self-rising flour ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup water, or as needed ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "6 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray 3 round baking dishes with cooking spray.\nMix flour, sour cream, and egg together with just enough water to bring the mixture together into a thick spreadable consistency.\nHeat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until beef is completely browned, 5 to 7 minutes; drain and discard grease. Set beef mixture aside to cool.\nDivide the dough mixture into thirds. Stretch each portion to cover the bottom of a prepared baking dish. Spread about one-third of the ground beef mixture over each pastry dough. Top each with about 2 cups shredded Cheddar cheese. Cover each with aluminum foil.\nBake in preheated oven until cheese is lightly browned and bubbling, 25 to 30 minutes.\n",
        "picture_link": "1BKZS2BgqPVgFo6BhiTV0hF4.p6xfVe"
    },
    {
        "title": "Brown Diner Fried Chicken",
        "ingredients": [
            "3 cups peanut oil for frying ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 pinch paprika, or to taste ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 fryer chicken, cut into serving pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat peanut oil in a deep, heavy skillet over medium heat or a deep-fryer.\nMix flour, onion powder, and paprika together in shallow bowl. Whisk milk and egg together in a separate shallow bowl.\nDip chicken pieces in flour mixture until evenly coated, shaking off excess. Dip coated chicken in the milk mixture, allowing excess to drip back into bowl; roll again in the flour mixture until coated.\nWorking in batches, place chicken in the hot oil and cover skillet; cook until chicken is browned and no longer pink and the center, about 7 minutes per side. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "NIthfmeqqUFvTAsi/8saq0FfvVSGnFy"
    },
    {
        "title": "Chia Greek Yogurt Pudding",
        "ingredients": [
            "1 cup unsweetened soy milk ADVERTISEMENT",
            "1 cup Greek yogurt ADVERTISEMENT",
            "2 tablespoons hulled hemp seeds ADVERTISEMENT",
            "2 tablespoons ground flax seeds ADVERTISEMENT",
            "1 tablespoon honey, or more to taste (optional) ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup chia seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk soy milk and Greek yogurt together in a large sealable container. Stir hemp seeds, flax seeds, honey, cinnamon, and vanilla extract into yogurt mixture.\nStir chia seeds into yogurt mixture until seeds are evenly distributed. Cover the container and refrigerate for 15 minutes. Stir mixture until chia seeds are evenly distributed again. Refrigerate until chilled and set, at least 1 hour.\n",
        "picture_link": "mHvH6bOiPAH.9kf57xezGl.ZhOSFYL."
    },
    {
        "title": "Sweet Potato & Ginger Soup",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 quart vegetable broth ADVERTISEMENT",
            "2 1/2 pounds sweet potatoes, peeled and cubed ADVERTISEMENT",
            "10 slices nickel-sized slices fresh ginger ADVERTISEMENT",
            "1 tablespoon finely chopped cilantro ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a heavy stock pot over medium-high heat. Add onions and saute until soft, about 5 minutes. Add garlic and saute until garlic begins to brown, 2 to 3 minutes. Stir vegetable broth, sweet potatoes, ginger, cilantro, cumin, cayenne pepper, salt, and ground black pepper into onion mixture; bring to a boil. Reduce heat and simmer until potatoes are soft, about 30 minutes.\nRemove stock pot from heat and blend soup with an immersion blender until smooth. Season with salt and ground black pepper as necessary. Serve with a dollop of sour cream.\n",
        "picture_link": "yy7sDDx6p2GqLLDMqJ9KfF2VmvK4M7y"
    },
    {
        "title": "Lazy Girl Pizza Margherita",
        "ingredients": [
            "2 pocketless Greek pita breads ADVERTISEMENT",
            "1/4 cup basil pesto ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "2 Roma tomatoes, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace pita breads on a baking sheet.\nBake in the preheated oven until lightly browned and slightly crisp, 8 to 10 minutes.\nSpread pesto onto each pita bread and top with mozzarella cheese and tomato slices.\nBake in the oven until cheese is melted and tomatoes are tender, about 10 minutes more.\n",
        "picture_link": "VXsrL2wTaDrGlmiwf2mNQzpmzhap8ta"
    },
    {
        "title": "Penne Pasta with Simple Beef Neck Sauce ",
        "ingredients": [
            "3 pounds beef neck bones ADVERTISEMENT",
            "1 onion, cut into chunks ADVERTISEMENT",
            "3 cups tomato sauce, or more to taste ADVERTISEMENT",
            "1 cup water, or more as needed ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano, or to taste ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 pound penne pasta, or to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spread neck bones and onions out in the bottom of a roasting pan.\nRoast in the preheated oven until bones are browned and caramelized, 45 minutes.\nCombine beef and onions, tomato sauce, and water in a large pot; bring to a simmer, reduce heat to low, and simmer, skimming fat and adding water as needed, until meat is falling off the bones, about 6 hours.\nStir parsley, oregano, red pepper flakes, salt, and ground black pepper into tomato sauce mixture; simmer until flavors combine, 10 to 15 minutes.\nBring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain.\nStir penne and 1/2 of the sauce together in a bowl with some of the Parmesan cheese. Spoon into bowls and top with remaining sauce and Parmesan cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Garlic-Feta Roasted Butternut Squash with Chicken",
        "ingredients": [
            "2 pounds cubed butternut squash ADVERTISEMENT",
            "2 large skinless, boneless chicken breasts, thinly sliced ADVERTISEMENT",
            "1 large sweet red onion, or to taste, finely chopped ADVERTISEMENT",
            "1 cup Mediterranean-style (with basil, Kalamata olive, and sun-dried tomato) crumbled feta cheese ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 cloves garlic, or to taste, minced ADVERTISEMENT",
            "1 pinch ground multi-colored peppercorns, or to taste ADVERTISEMENT",
            "1 pinch sea salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix butternut squash, chicken, red onion, feta cheese, olive oil, garlic, pepper, and sea salt together in a roasting pan.\nRoast in preheated oven, stirring every ten minutes or so, until the chicken is no longer pink in the center and the squash cubes are tender, 30 to 40 minutes.\n",
        "picture_link": "AahOvdSsiIm7AztQUdubF6dGSjHIHzu"
    },
    {
        "title": "Slow Cooker Northern White Bean",
        "ingredients": [
            "1 1/2 cups dried great Northern beans, rinsed ADVERTISEMENT",
            "2 large smoked neck bones ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "1/2 teaspoon soul seasoning ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1/2 teaspoon white vinegar, or to taste (optional) ADVERTISEMENT",
            "1 pinch white sugar, or to taste (optional) ADVERTISEMENT",
            "1 dash hot sauce, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse.\nPlace neck bones in a slow cooker and pour chicken broth over the top; stir in soul seasoning.\nCook on High until meat is falling off the bones, about 1 hour. Transfer bones and meat to a plate and shred meat from bones; discard bones.\nStir beans, onion, vinegar, sugar, and hot sauce into slow cooker; spread shredded meat over beans.\nCook on High for 2 to 4 hours (or cook on Low for 4 to 6 hours).\n",
        "picture_link": "TCw4Tvdb.mz1sCRydGuG1Znk6.W4m06"
    },
    {
        "title": "Homemade Hot Chocolate",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "2 cups dark chocolate chips ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch ground nutmeg, or more to taste ADVERTISEMENT",
            "1 pinch ground cloves, or more to taste ADVERTISEMENT",
            "1 pinch ground cinnamon, or more to taste ADVERTISEMENT",
            "1 pinch chili powder, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk in a saucepan over medium heat until almost boiling. Lower heat to medium-low; add chocolate chips, vanilla extract, nutmeg, cloves, cinnamon, and chili powder. Cook and stir milk mixture until chocolate is dissolved, 5 to 10 minutes.\n",
        "picture_link": "OXjxop3oFeFGxy46BPsPOmnV8k2t9cC"
    },
    {
        "title": "Garlic Dill Burgers",
        "ingredients": [
            "1 1/4 pounds ground beef ADVERTISEMENT",
            "3 tablespoons ketchup ADVERTISEMENT",
            "3 tablespoons garlic powder ADVERTISEMENT",
            "3 tablespoons dried dill ADVERTISEMENT",
            "2 tablespoons finely chopped dill pickles ADVERTISEMENT",
            "2 teaspoons mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCombine ground beef, ketchup, garlic powder, dill, pickles, and mustard in a bowl using your hands; form into patties.\nGrill patties on the preheated grill until desired doneness is reached, 7 to 8 minutes per side. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "hDQHPxCN/R0v1FHhBJAXUAzJXazkBT."
    },
    {
        "title": "Easiest Chocolate Blossom Cookies",
        "ingredients": [
            "1 (15.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1/2 cup miniature chocolate chips ADVERTISEMENT",
            "30 dark chocolate kisses ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.\nMix cake mix, pumpkin puree, and chocolate chips together in a bowl. Scoop batter using a cookie scoop and place on the prepared baking sheet.\nBake in the preheated oven until cookies are set, about 15 minutes. Place baking sheets on a wire rack and gently press a chocolate kiss into the center of each cookie. Allow cookies to cool and set.\n",
        "picture_link": "LHaXyhJkKrTk5f.luJnr/pyiC0p7mZi"
    },
    {
        "title": "3 Musketeers® Trifle",
        "ingredients": [
            "1 (18.25 ounce) package brownie mix (such as Pillsbury®) ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (6 ounce) bag semisweet chocolate chips (optional) ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "1 (3.3 ounce) package instant white chocolate pudding mix ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "2 (6 ounce) packages chocolate-covered nougat bites (such as 3 Musketeers® Bites) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.\nCombine brownie mix, vegetable oil, eggs, and water in a bowl until batter is smooth; fold in chocolate chips. Spread batter into the prepared baking dish.\nBake in the preheated oven until the top is dry and the edges have started to pull away from the sides of the pan, 45 to 50 minutes. Cool brownies completely. Cut into bite-size pieces.\nBeat cream cheese in a large bowl using an electric mixer until smooth. Beat 1/2 cup half-and-half into cream cheese until incorporated. Beat remaining 1 1/2 cups half-and-half and pudding mix into cream cheese mixture on low speed until pudding is well blended, about 2 minutes.\nBeat cream in a separate bowl using an electric mixer until soft peaks form; fold into pudding mixture.\nPlace a layer of brownie bites in the bottom of a trifle bowl or a large bowl with straight sides; top with a layer of pudding mixture and a layer of chocolate-covered nougat bites. Continue layering 2 or 3 more times in the same order with remaining ingredients.\n",
        "picture_link": "VOeebN4Hj6L2rjJhFmWTaIxOCW117Ki"
    },
    {
        "title": "Tomato, Basil, and Corn Salad with Apple Cider Dressing",
        "ingredients": [
            "2 cups frozen corn kernels, thawed ADVERTISEMENT",
            "1 pint grape tomatoes, halved ADVERTISEMENT",
            "10 fresh basil leaves, chopped ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon apple cider vinegar ADVERTISEMENT",
            "1/4 teaspoon salt (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix corn, tomatoes, and basil leaves together in a bowl; add olive oil, vinegar, and salt and mix until evenly coated.\n",
        "picture_link": "qj5Vig/YlfkDmFIXESZY5fNZTOwo9Xq"
    },
    {
        "title": "Instant Swiss Mocha Bliss",
        "ingredients": [
            "8 fluid ounces milk ADVERTISEMENT",
            "1 tablespoon mocha-flavored instant coffee mix (such as International Coffee® Suisse Mocha) ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon powdered chocolate drink mix (such as Nesquik®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Microwave milk in an microwave-safe glass or bowl until almost boiling, about 1 minute 45 seconds.\nStir coffee mix, sugar, and chocolate mix together in a mug. Pour hot milk over coffee mixture and stir until mixture is dissolved.\n",
        "picture_link": "Z9gHRBJdCP05nElQvNe1zjde0BfpYku"
    },
    {
        "title": "Slow Cooker Pepperoni Pizza",
        "ingredients": [
            "1 (16 ounce) package kluski noodles ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 (13.5 ounce) jar marinara sauce ADVERTISEMENT",
            "1 (8 ounce) can pizza sauce ADVERTISEMENT",
            "1 (3.5 ounce) package sliced pepperoni ADVERTISEMENT",
            "2 (6 ounce) cans sliced mushrooms, drained ADVERTISEMENT",
            "2 cups grated mozzarella cheese ADVERTISEMENT",
            "2 cups grated Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook kluski noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir marinara sauce and pizza sauce into ground beef.\nArrange half of the cooked noodles in the bottom of a slow cooker, cover with half of the ground beef mixture, half of the pepperoni, half of the mushrooms, and half of the cheese. Repeat layering with remaining ingredients, respectively.\nCook on Low for 1 1/2 hours.\n",
        "picture_link": "nTOfyFW.kbBiILgMGFFdAJv00eJs/0G"
    },
    {
        "title": "Penny's Best Chicken in Wine",
        "ingredients": [
            "12 saltine crackers, crumbled ADVERTISEMENT",
            "4 pounds skinless, boneless chicken breasts, cut into 1-inch pieces ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "12 fresh mushrooms, sliced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch dried tarragon (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPour crumbled saltine crackers into a large bowl. Press chicken pieces into crackers to coat completely; let rest for 10 minutes.\nMelt butter in a large skillet over medium-high heat. Saute chicken pieces in hot butter until browned on all sides, 5 to 7 minutes. Transfer chicken to a casserole dish.\nSaute mushrooms and onion in the same skillet until onion is translucent, 5 to 10 minutes. Pour chicken broth, white wine, salt, pepper, and tarragon into onion mixture and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Pour mushroom mixture over chicken into the casserole dish.\nBake in the preheated oven until chicken is cooked through and sauce is bubbling, about 45 minutes.\n",
        "picture_link": "jeCIadG0IMD/2orZLbxKAziOXlX0MUW"
    },
    {
        "title": "12th Man-Hattan",
        "ingredients": [
            "ice ADVERTISEMENT",
            "2 ounces wheat whiskey (such as Dry Fly®) ADVERTISEMENT",
            "1/2 ounce sweet vermouth ADVERTISEMENT",
            "3 dashes bitters (such as Angostura®) ADVERTISEMENT",
            "1 strip mandarin orange zest ADVERTISEMENT",
            "2 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice. Pour whiskey and vermouth over ice and add bitters; gently stir with a long spoon. Strain whiskey mixture into a cocktail glass. Rub mandarin zest along the rim of the cocktail glass and drop into the drink along with the cherries.\n",
        "picture_link": "7e1iiSWvejIaFgFgUE8WAXRbPXPhx46"
    },
    {
        "title": "Pasta Salad Dressing",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1 1/2 teaspoons Dijon mustard ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon ground thyme ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat mayonnaise, olive oil, vinegar, mustard, garlic, sugar, salt, pepper, oregano, thyme, and basil together in a bowl with a whisk until smooth.\n",
        "picture_link": "a/v4fLiRj46cEnx8Vp6KVlcUuyVPVHG"
    },
    {
        "title": "Balsamic Skirt Steak",
        "ingredients": [
            "1 cup soy sauce ADVERTISEMENT",
            "3/4 cup balsamic vinegar ADVERTISEMENT",
            "1 (1 1/2-pound) skirt steak ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat, and lightly oil the grate.\nWhisk soy sauce and balsamic vinegar together in a large glass or ceramic bowl. Add skirt steak and turn to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator, 30 to 45 minutes.\nRemove skirt from the marinade, and shake off excess. Discard remaining marinade. Season steak with salt.\nCook steak until it begins to firm and is reddish-pink and juicy in the center, 3 to 6 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C).\n",
        "picture_link": "cjRdJWPDGPuley3vVmKzZ/PAfr4iiIa"
    },
    {
        "title": "Kathy's Sauteed Kale",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "12 cups chopped kale ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 teaspoon vegetable bouillon base (such as Better Than Bouillon® Vegetable Base), or more to taste ADVERTISEMENT",
            "1 splash soy sauce, or more to taste ADVERTISEMENT",
            "1 pinch ground black pepper, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat; saute garlic until fragrant, about 1 minute. Add kale to garlic, working in batches if needed; cook and stir until beginning to wilt, about 5 minutes.\nStir water and vegetable base together in a small bowl until dissolved; pour over kale. Cook mixture until liquid is reduced, 1 to 2 minutes. Mix soy sauce and black pepper into kale.\n",
        "picture_link": "Fv9r7xsraF9F9hv.2myfx0XXDnO/YlG"
    },
    {
        "title": "Blackberry Butter Tarts",
        "ingredients": [
            "12 (3 inch) unbaked tart shells ADVERTISEMENT",
            "1 cup fresh blackberries, rinsed and patted dry ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place tart shells on a baking sheet.\nMash blackberries and lemon zest together lightly in a small bowl. Divide blackberry mixture evenly into the bottom of tart shells.\nWhisk brown sugar, honey, egg, butter, vanilla extract, and salt together in a bowl; spoon mixture evenly over blackberries in shells.\nBake in the preheated oven until filling is bubbly and shells are golden, 22 to 27 minutes.\n",
        "picture_link": "gMrxFOdSL8htfRgFjhKkgsRb26Xa06."
    },
    {
        "title": "Spinach and Queso Dip",
        "ingredients": [
            "3/4 cup half-and-half ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "3/4 pound sliced white American cheese, torn into pieces ADVERTISEMENT",
            "8 ounces Monterey Jack cheese, shredded ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 (5 ounce) package fresh spinach, or to taste, torn into small pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a double boiler over medium heat. Once the water is boiling, add half-and-half, cumin, garlic salt, white American cheese pieces, shredded Monterey Jack cheese, chopped green chiles, and diced tomatoes with green chile peppers, respectively, to the bowl of the double boiler; cook, stirring often, until the cheeses are melted and the mixture is smooth, about 15 minutes.\nStir spinach into melted cheese mixture; heat until the spinach wilts, 5 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Not Yo Momma's Egg Salad",
        "ingredients": [
            "4 hard-boiled eggs, chopped ADVERTISEMENT",
            "4 pitted green olives, chopped ADVERTISEMENT",
            "1 tablespoon jarred roasted red peppers, chopped ADVERTISEMENT",
            "1 teaspoon capers ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1/4 teaspoon curry powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine eggs, olives, roasted red peppers, and capers in a bowl. Stir mayonnaise and curry powder into egg mixture; season with salt and pepper.\n",
        "picture_link": "iNPO9AAismdgimHrVN7M7lBoNbwRFDK"
    },
    {
        "title": "Spicy Mexican Shrimp Cocktail ",
        "ingredients": [
            "2 pounds cooked shrimp, peeled and deveined ADVERTISEMENT",
            "1/2 cup finely chopped red onion ADVERTISEMENT",
            "1 habanero pepper, diced ADVERTISEMENT",
            "1/4 cup fresh cilantro, chopped ADVERTISEMENT",
            "1 jalapeno pepper, diced ADVERTISEMENT",
            "1 tablespoon crushed garlic ADVERTISEMENT",
            "1 1/2 cups tomato and clam juice cocktail ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1/4 cup prepared horseradish ADVERTISEMENT",
            "1 teaspoon hot pepper sauce, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 ripe avocado - peeled, pitted, and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix shrimp, red onion, habanero pepper, cilantro, jalapeno pepper, and garlic in a large bowl; add tomato and clam juice cocktail, lime juice, ketchup, horseradish, and hot pepper sauce and stir. Season mixture with salt. Gently stir avocado into the mixture taking care to not mash the avocado.\nCover bowl with plastic wrap and refrigerate for 2 to 3 hours before serving.\n",
        "picture_link": "t.NCxTfmhQ4J0zot5JaZyaQfwrnFQZq"
    },
    {
        "title": "Slow Cooker Chili Queso Dip",
        "ingredients": [
            "1 tablespoon salted butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 (15 ounce) cans chili without beans ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, cubed ADVERTISEMENT",
            "1 (16 ounce) jar medium salsa ADVERTISEMENT",
            "2 tablespoons minced jalapeno peppers, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a skillet over medium heat; cook and stir onion and garlic until tender, 5 to 10 minutes. Transfer onion mixture to a slow cooker.\nMix chili, cream cheese, salsa, and jalapeno peppers with onion mixture in the slow cooker.\nCook on Low, stirring occasionally, for 4 hours.\n",
        "picture_link": "gFJYLpdoBdMmmNlhGN4LyNWM9xqKYvm"
    },
    {
        "title": "Mrs Welch's Butter Tarts",
        "ingredients": [
            "12 (3 inch) unbaked tart shells ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "1/2 cup chopped walnuts or pecans (optional) ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup corn syrup ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace tart shells on a baking sheet; sprinkle raisins and walnuts evenly between shells.\nWhisk brown sugar, corn syrup, butter, egg, vanilla extract, and salt together in a bowl; pour mixture evenly over raisins and walnuts into tart shells.\nBake in the preheated oven until filling is set and crust is golden, about 35 minutes.\n",
        "picture_link": "TwLt9rZLybDJmOX/uCIPyzWW5yhzD3e"
    },
    {
        "title": "Easy Snowballs",
        "ingredients": [
            "1 pound unsalted butter, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup finely chopped walnuts, or more to taste ADVERTISEMENT",
            "1/2 cup confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter and 1 cup confectioners' sugar together in a bowl until light and fluffy. Stir in flour and walnuts until dough is just-combined. Roll dough into 1-inch balls and place 2-inches apart on a baking sheet.\nBake in the preheated oven until lightly browned on the bottom, about 10 minutes.\nPour 1/2 cup confectioners' sugar in a shallow bowl. Roll hot cookies in confectioners' sugar to coat; cool cookies completely and roll again in confectioners' sugar to coat.\n",
        "picture_link": "lISA4emGXMjNaRXDxLWLamSBOx2ZHFG"
    },
    {
        "title": "Baked Apple Cinnamon Rolls",
        "ingredients": [
            "Sauce: ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1 tablespoon heavy cream ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "1 cup Mott's® Original Applesauce ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Rolls: ADVERTISEMENT",
            "1 (13.8 ounce) can refrigerated pizza crust ADVERTISEMENT",
            "1/4 cup light brown sugar ADVERTISEMENT",
            "1/2 cup granulated sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For sauce, whisk together all ingredients in small saucepan over medium-low heat. Cook, stirring occasionally, for 15-20 minutes until sauce thickens.\nFor cinnamon rolls, preheat oven to 350 degrees F (175 degrees C). Lightly spray an 8-inch cake pan with non-stick cooking spray. Roll out pizza dough into 8 x 12-inch rectangle with the smallest length facing you.\nCombine sugars and cinnamon together in small bowl. Sprinkle evenly over dough. Pat sugar mixture gently into dough. Roll dough away from you. Dough will be about 2 inches in diameter and 12 inches long.\nCut dough into 8 equally thick slices. Place rolls in prepared cake pan and Bake for 20 minutes.\nPour sauce over rolls, and, bake for an additional 15 minutes. Let pan cool slightly on wire rack for 10 minutes. Serve.\n",
        "picture_link": "bCnNWi.uonC48VvLmwhAR1e8uqC5M72"
    },
    {
        "title": "Cashew Butter",
        "ingredients": [
            "3 cups unsalted cashews (such as Stock & Barrel®), divided ADVERTISEMENT",
            "1/3 cup vegetable oil, or more as needed ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put 1 cup cashews in a food processor bowl and begin to process while drizzling vegetable oil into the mixture to keep it moving. Add cashews to food processor, alternating with oil, and process. Once all cashews are added, add sea salt and continue to process until your preferred texture is attained, 10 to 15 minutes.\n",
        "picture_link": "emvpd8N8h/a2lP8QB69HRmDrxv0Ztx6"
    },
    {
        "title": "Clamato® Seafood Stuffed Peppers",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 pound uncooked medium shrimp, peeled, deveined and diced ADVERTISEMENT",
            "1 tilapia fillet, cut into bite-size pieces ADVERTISEMENT",
            "4 ounces small bay scallops (optional) ADVERTISEMENT",
            "1 cup Clamato® Tomato Cocktail ADVERTISEMENT",
            "1 tablespoon ReaLemon® Juice ADVERTISEMENT",
            "1 tablespoon seafood seasoning ADVERTISEMENT",
            "2 cups cooked white rice ADVERTISEMENT",
            "10 basil leaves, chopped ADVERTISEMENT",
            "8 ounces shredded Monterey Jack cheese ADVERTISEMENT",
            "4 cubanelle peppers, cut in half and hollowed out ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. In a large saute pan on medium-high heat, heat olive oil; add onions and garlic; cook for 2 minutes. Add shrimp, tilapia and bay scallops; cook 3-4 minutes until about halfway done. Add Clamato(R), lemon juice, seafood seasoning, basil and rice; mix well. Cook to heat through.\nRemove from heat; blend in Monterrey Jack. Spoon mixture into peppers, place in a lightly greased baking dish, cover with foil and bake for 20 minutes. Remove foil and top with Cheddar; bake 5 more minutes or until the cheese is melted.\n",
        "picture_link": "3sjdN2VOc241vHH2xH90VNalXg7Mg6q"
    },
    {
        "title": "Slow Cooker Butternut Squash",
        "ingredients": [
            "1 (3 pound) butternut squash - peeled, seeded, and cut into cubes ADVERTISEMENT",
            "1 cup apple juice ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/4 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine butternut squash and apple juice in a slow cooker. Whisk butter, brown sugar, and cinnamon together in a bowl; drizzle over butternut squash.\nCook on Low for 6 to 8 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten Free Almond Swirl Brownies",
        "ingredients": [
            "Brownie Base: ADVERTISEMENT",
            "4 tablespoons unsalted butter, cut into 1/2-inch slices ADVERTISEMENT",
            "4 ounces unsweetened chocolate, chopped ADVERTISEMENT",
            "1/4 cup Mott's® Original or Natural Applesauce ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup granulated sugar ADVERTISEMENT",
            "1/2 teaspoon fine sea salt or kosher salt ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "3/4 cup almond flour ADVERTISEMENT",
            "1/4 cup chopped roasted unsalted almonds ADVERTISEMENT",
            "Almond Butter Swirl: ADVERTISEMENT",
            "1/2 cup smooth almond butter ADVERTISEMENT",
            "1/4 cup powdered sugar ADVERTISEMENT",
            "2 tablespoons Mott's® Original or Natural Applesauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F. Line an 8-inch square metal, ceramic, or glass baking pan with 2 long pieces of aluminum foil, layering the pieces across one another and crimping the overhang over the sides of the pan.\nMelt the butter and chocolate together in a small (1 1/2-quart) heavy-bottomed saucepan over low heat, stirring constantly to make sure the chocolate doesn't burn. When nearly all the chocolate is melted, remove the pan from the heat and continue stirring to melt completely.\nScrape the melted chocolate into a large mixing bowl with a silicone spatula. Stir in the applesauce and vanilla extract, then stir in the sugar and salt until a grainy batter forms.\nStir in the eggs one at a time, making sure the first egg is fully incorporated before adding the next.\nGently stir in the almond flour 1/4 cup at a time, then stir in the almonds.\nPour the batter into the prepared baking pan, spreading it evenly to reach all the corners of the pan.\nMake the almond butter swirl by beating the almond butter, sugar, and applesauce together with a silicone spatula or electric hand mixer on low speed.\nDrop the almond butter in spoonfuls over the brownie batter and use the tip of a butter knife to carefully swirl into the batter, making sure not to puncture the foil on the bottom of the pan.\nBake for 45 minutes to 1 hour, or until a toothpick or small knife inserted into the center of the pan comes out with moist crumbs attached. (Baking time will be slightly longer for ceramic and glass pans than for metal pans.)\nCool completely in the pan for at least an hour and preferably overnight.\nUse the long edges of the foil to carefully lift the bars out of the pan and onto a cutting board. Peel the foil off and cut the brownies into squares.\nBrownies taste best when baked the day before you plan to serve them. Leftover brownies can be stored in the refrigerator in an airtight container for up to 5 days.\n",
        "picture_link": "I8ZhG2rSZI2cUNL/O1yYIzuCKy2/xmi"
    },
    {
        "title": "Panko-Parmesan Halibut",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/3 cup plain fat-free Greek yogurt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1/3 cup Italian-style panko bread crumbs ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 (6 ounce) halibut fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil, spray an ovenproof wire rack with cooking spray, and place rack on the prepared baking sheet.\nWhisk yogurt, lemon juice, and Dijon mustard together in a shallow bowl. Stir panko bread crumbs and Parmesan cheese together in another shallow dish.\nGently dip 1 fillet in yogurt mixture to coat completely; press fillet into bread crumbs. Place coated fillet on the wire rack on the prepared baking sheet. Repeat with remaining fillet.\nBake fillets in the preheated oven until fish flakes easily with a fork, 18 to 22 minutes. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).\n",
        "picture_link": "fS5CXA/s91fs2Mq71R5pntS0iB6iloe"
    },
    {
        "title": "Healthy Quinoa Salad",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1 (12 ounce) box quinoa ADVERTISEMENT",
            "3 carrots, chopped ADVERTISEMENT",
            "1 cup corn ADVERTISEMENT",
            "1 cup peas ADVERTISEMENT",
            "1 cup chopped broccoli florets ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add carrots, corn, peas, and broccoli to steamer; cover, and steam until tender, 5 to 10 minutes.\nMix quinoa and vegetable mixture together in a bowl.\nWhisk olive oil, lemon juice, chili powder, and cayenne pepper together in a bowl; pour over quinoa mixture and toss to coat.\n",
        "picture_link": "FuzlTq7EzEn5GOgjC9YXMPSTrFwiYfO"
    },
    {
        "title": "Clamato® Shrimp \"Ceviche\" Style",
        "ingredients": [
            "2 pounds cooked shrimp ADVERTISEMENT",
            "1 small red onion, thinly sliced ADVERTISEMENT",
            "1 fresh jalapeno chile, seeded and minced ADVERTISEMENT",
            "1 cucumber, peeled, seeded, thinly sliced ADVERTISEMENT",
            "1/2 bunch cilantro, finely chopped ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1/2 cup Clamato® Tomato Cocktail ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, combine shrimp, onion, jalapeno, cucumber and cilantro.\nAdd lime juice and Clamato(R); toss to mix well.\nChill in refrigerator 20-30 minutes.\nServe cold with tostadas (hard tortillas) or soda crackers.\n",
        "picture_link": "L/NEttrlgnCL2RULEgMRwp8c/kaHW5y"
    },
    {
        "title": "Tasty Pecan Pepper Appetizer",
        "ingredients": [
            "4 cups finely chopped pecans ADVERTISEMENT",
            "2 cups finely shredded Cheddar cheese ADVERTISEMENT",
            "1 cup finely chopped green onion ADVERTISEMENT",
            "1/2 cup mayonnaise, or as needed ADVERTISEMENT",
            "1 (10 ounce) jar raspberry jalapeno jelly ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse pecans in a food processor until very finely ground.\nStir pecans, Cheddar cheese, green onion, and mayonnaise together in a large bowl until mixture holds together. Transfer to a serving platter and top with jelly.\n",
        "picture_link": "2x9pUSl6p6kd56JFI6hyH4rMUy26aVK"
    },
    {
        "title": "Mazarin Cake II",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "7 tablespoons butter ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "10 1/2 ounces almond paste ADVERTISEMENT",
            "5 tablespoons butter, chilled ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "12 maraschino cherries, garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, sugar in a food processor, add the 7 tablespoons butter and egg yolk. Pulse until mixture comes together as smooth dough. Turn out onto a lightly floured surface and briefly knead the dough. Wrap with plastic and refrigerate for at least 15 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Roll the dough out to about a 12 inch circle. Cover the bottom and halfway up the sides of a 9 inch springform pan. Set aside.\nCut almond paste and butter into pieces and combine in the bowl of a food processor. Process until smooth. Add eggs one at a time, and process until smooth. Mix in almond extract. Pour filling into prepared crust.\nBake in the preheated oven for 25 to 30 minutes, or until golden brown and filling is set. Let cool for 20 minutes, then gently loosen sides of pan and cool completely.\nIn a small bowl, combine confectioners' sugar with water to make a thin glaze. Spread on top of cake and garnish with cherries.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mom's Pound Cake",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "4 cups confectioners' sugar, sifted ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch tube pan.\nIn a large bowl, cream together the butter and confectioners' sugar until light and fluffy. Add the eggs one at a time, beating well after each addition. Stir in the orange juice, vanilla and salt. Beat in the flour. Pour batter into prepared pan.\nBake in the preheated oven for 70 to 80 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n",
        "picture_link": "cgBXQojTUj8BJIcr0/EhDbnW9DFJW0O"
    },
    {
        "title": "Tangy Pickled Mushrooms",
        "ingredients": [
            "1 1/2 pounds fresh mushrooms ADVERTISEMENT",
            "1 1/2 ounces fresh ginger root ADVERTISEMENT",
            "1 lemon peel, cut into strips ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "4 cups white wine vinegar ADVERTISEMENT",
            "3 teaspoons sea salt ADVERTISEMENT",
            "1 teaspoon black peppercorns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wipe the mushrooms with a damp cloth to clean them, and trim the stalks so that they are even with the caps. Place mushrooms in a medium saucepan.\nPeel the ginger and cut into quarters. Add to the mushrooms, along with the lemon zest, onion, vinegar, salt and peppercorns. Bring the mixture to a boil and simmer for 15-20 minutes, or until mushrooms are tender.\nRemove the mushrooms from the cooking liquid with a slotted spoon and pack into sterilized jars. Strain the cooking liquid and bring it back to a boil. Pour hot liquid over the mushrooms until the level of the liquid is 1/2 inch above the mushrooms. Seal the jars and store in the refrigerator.\n",
        "picture_link": "Lzg5DYxofx55TEmhujdT3AUoehqw5Vy"
    },
    {
        "title": "Berry Refresher",
        "ingredients": [
            "1 cup apple juice ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 frozen strawberries, thawed ADVERTISEMENT",
            "1/3 cup frozen raspberries, thawed ADVERTISEMENT",
            "2/3 cup frozen blueberries, thawed ADVERTISEMENT",
            "3 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the apple juice, orange juice, milk, honey, strawberries, raspberries, blueberries, and ice cubes in a blender. Blend until slushy. Serve cold.\n",
        "picture_link": "Gbi3DEC3vUgnDgxL93tFTLGc/QXHcyS"
    },
    {
        "title": "Amanda's Big Beef Sauce",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons French dressing ADVERTISEMENT",
            "4 teaspoons sweet pickle relish ADVERTISEMENT",
            "1 tablespoon minced white onion ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together mayonnaise, French dressing, sweet pickle relish, white onion, white sugar and salt. Cover and refrigerate 6 hours, or overnight, stirring occasionally, before serving.\n",
        "picture_link": "9Qit5BakFQz5XC6WN6psXycVBozt9R2"
    },
    {
        "title": "Cereal Bread",
        "ingredients": [
            "1 cup bite size frosted wheat cereal ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "6 cups bread flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine cereal, brown sugar, shortening and salt. Pour boiling mixture over mixture. Let cool to room temperature.\nIn a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nCombine cereal and yeast mixtures. Add eggs and two cups flour; mix well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\nLightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until brown, about 30 minutes. Remove from pans and let cool on a wire rack.\n",
        "picture_link": "huVTRRALQ8fLT6OonY/t6lVOzcByMuG"
    },
    {
        "title": "No Crust Rice Pie",
        "ingredients": [
            "1 (3 ounce) package cook and serve vanilla pudding ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups cooked instant rice ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the vanilla pudding according to package directions using the milk. Set aside to cool slightly.\nPreheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, beat the eggs, sugar and vanilla until light and fluffy. Stir in the cooked rice, vanilla pudding and ricotta cheese until smooth. Pour into a 9 inch deep dish pie plate or 10 inch pie plate.\nBake for 1 hour in the preheated oven, or until the center appears set when the pie is gently jiggled. Cool to room temperature, then refrigerate until chilled before slicing and serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Red Apple Milkshake",
        "ingredients": [
            "1 red apple - peeled, cored, and chopped ADVERTISEMENT",
            "2 cups cold skim milk ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "fresh mint leaves for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, blend the apple, skim milk, and sugar until smooth. Garnish with mint to serve.\n",
        "picture_link": "g8ENQY/G6GiD8pcHPiwoJizDpxHAVr2"
    }
]