[
    {
        "title": "Barbecued Beef Sandwiches",
        "ingredients": [
            "3 pounds beef chuck ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 tablespoons sugar ADVERTISEMENT",
            "1/3 (10 fluid ounce) bottle Worcestershire sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place roast in a Dutch oven, and sprinkle with chopped onions. Cover with tomatoes, water, sugar and Worcestershire sauce. Season with salt and pepper.\nCook over medium heat with lid slightly ajar for 3 hours.\nRemove meat, and shred with 2 forks. Discard bones, fat and gristle. place shredded meat back into sauce, and cook until liquid is reduced, 15 to 20 minutes.\n",
        "picture_link": "P4erEkho937dno6dFY4G2vEgrHUWGgG"
    },
    {
        "title": "Barbecued Beef Liver",
        "ingredients": [
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 pound beef liver, thinly sliced ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 dash garlic powder ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a resealable plastic bag, mix the flour, salt, and pepper. Place the liver slices into the bag one at a time, seal, and toss to coat.\nIn a bowl, mix the water, ketchup, brown sugar, vinegar, Worcestershire sauce, and garlic powder.\nHeat the oil in a skillet over medium heat. Brown the liver slices on both sides. Pour the sauce mixture over the liver. Bring to a boil, reduce heat, and simmer 20 minutes, until liver is tender.\n",
        "picture_link": "Zy3hJelMLQiyJeIriSRTP/aOqaPbwqu"
    },
    {
        "title": "Red, Juicy, Herb-Fried Tomatoes",
        "ingredients": [
            "2 tablespoons dried basil ADVERTISEMENT",
            "2 tablespoons dried thyme ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon white pepper ADVERTISEMENT",
            "5 teaspoons olive oil ADVERTISEMENT",
            "2 Roma (plum) tomatoes, halved lengthwise ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together basil, thyme, salt, and white pepper. Mix in 5 teaspoons olive oil to make a spreadable paste. Spread paste on cut side of each tomato half.\nHeat remaining 2 tablespoons olive oil in small skillet over medium-low heat. Place tomatoes herb-side down in skillet, and cover. Simmer for 5 minutes; tomatoes should be hot but not stewed. Serve immediately.\n",
        "picture_link": "yw20s9O2pFFmWfZcFS4PnpZExuUiV/."
    },
    {
        "title": "Shrimp Scampi ala Norelllaura",
        "ingredients": [
            "1/3 cup extra virgin olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup diced red bell pepper ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 pound peeled and deveined large shrimp ADVERTISEMENT",
            "1 cup flour for dredging ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2/3 cup dry white wine ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-low heat; cook and stir the garlic, bell pepper, and red pepper flakes in the oil about 20 minutes. Dredge the shrimp in the flour to coat, then shake off the excess. Raise heat to medium-high and stir in the shrimp and tomato; cook until the shrimp is pink, 3 to 5 minutes. Add the lemon juice, wine, and butter; continue cooking until the sauce thickens, about 5 minutes more. Garnish with parsley to serve.\n",
        "picture_link": "6/H3yONfGtyPN5iaB7ujPJbDlfzSlUG"
    },
    {
        "title": "Mexican Ceviche",
        "ingredients": [
            "5 large lemons, juiced ADVERTISEMENT",
            "1 pound jumbo shrimp, peeled and deveined ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, or to taste ADVERTISEMENT",
            "tomato and clam juice cocktail ADVERTISEMENT",
            "2 white onions, finely chopped ADVERTISEMENT",
            "1 cucumber, peeled and finely chopped ADVERTISEMENT",
            "1 large tomatoes, seeded and chopped ADVERTISEMENT",
            "3 fresh jalapeno peppers, seeded and minced ADVERTISEMENT",
            "1 bunch radishes, finely diced ADVERTISEMENT",
            "2 cloves fresh garlic, minced ADVERTISEMENT",
            "tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place shrimp in a bowl (You may either coarsely chop the shrimp, or leave them whole, depending on your preference.) Add lemon, covering shrimp completely. Cover, and refrigerate for 30 minutes, or until opaque and slightly firm.\nAdd tomatoes, onions, cucumber, radishes, and garlic; toss to combine. Gradually add cilantro and jalapenos to desired taste (jalapeno will grow stronger while marinating). Stir in tomato and clam juices to desired consistency. Cover, and refrigerate for 1 hour. Serve chilled with tortilla chips.\n",
        "picture_link": "dojLCxWMFddHsvWrOIZnhZZO3aLHky6"
    },
    {
        "title": "That Addicting Salad",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 (10 ounce) package spring lettuce mix ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup grated carrot ADVERTISEMENT",
            "1/2 cup small cauliflower florets ADVERTISEMENT",
            "1/2 cup bacon bits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together the mayonnaise, 1/4 cup Parmesan cheese, and sugar until well blended. Cover, and refrigerate overnight. Stir again just before using.\nIn a large serving bowl, combine the lettuce, 1/2 cup Parmesan cheese, carrot, cauliflower, and bacon bits. Toss with chilled dressing just before serving.\n",
        "picture_link": "GjJnE0nU2h1eelyqLxYk6qYU3oRZ8am"
    },
    {
        "title": "Corn, Sweet Onion, and Tomato Salad",
        "ingredients": [
            "3 (11 ounce) cans whole kernel corn ADVERTISEMENT",
            "2 large tomatoes, diced ADVERTISEMENT",
            "1 large sweet onions, cut into thin strips ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 bunch cilantro leaves, minced into tiny strips ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1/3 cup rice vinegar ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the corn, tomatoes, sweet onion, green onion, and cilantro. Squeeze lime juice over mixture, and mix in. Stir in rice vinegar to taste; the amount you use will depend on the sweetness of the corn, and the acidity of the lime. Season with kosher salt.\nCover, and chill for 45 minutes to an hour. Stir before serving.\n",
        "picture_link": "kHg/CdffjGZg1rSlZrpLg5xgCP7mhKG"
    },
    {
        "title": "Thai Pork Loin",
        "ingredients": [
            "1 pound thinly sliced pork loin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season meat with salt and pepper to taste.\nIn a large skillet, heat butter and olive oil over medium heat. When skillet is hot, place sliced pork loin into skillet; cook until browned, turning once. After both sides have browned nicely, add chicken stock ,and cook until liquid thickens.\nStir in dry white wine, scraping the bottom of the pan. Reduce heat, and simmer until liquid is reduced by half. Remove from heat, and allow to cool slightly. Stir in cilantro. Spoon sauce over pork when serving.\n",
        "picture_link": "QpJ3fzVGYuMR1CxGzKvAcxzz4RSD30C"
    },
    {
        "title": "Orange Chocolate Swirl Cheesecake",
        "ingredients": [
            "CRUST: ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "FILLING: ADVERTISEMENT",
            "4 ounces semisweet chocolate, chopped ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1/2 teaspoon grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). In a medium bowl, mix together the graham cracker crumbs, sugar and butter until well blended. Press into the bottom and 1 1/2 inches up the side of a 9 inch springform pan.\nBake for 10 minutes. In a metal bowl over a pan of simmering water, melt chocolate, stirring occasionally until smooth. Set aside to cool, but do not allow to harden.\nIn a medium bowl, mix together the cream cheese and 1 cup sugar until smooth. Mix in the eggs, one at a time on a low speed, or by hand. Gradually stir in the orange juice, and orange zest. Reserve 2 cups of the batter. Pour the remaining batter over the baked crust. Stir the melted chocolate into the reserved batter. Drop the chocolate batter by large spoonfuls onto the white batter. Use a knife to cut through the batter, and leave a swirling design.\nBake for 60 minutes in the preheated oven, or until the center is almost set. Run a spatula or thin knife around the edge of the pan while it is still warm, so the cake will not crack. Allow cake to cool completely before removing the sides of the pan. Refrigerate for at least 4 hours before serving.\n",
        "picture_link": "396lx3IBJ97Iti548Zpn0esL0iHMpyq"
    },
    {
        "title": "Stuffed Acorn Squash II",
        "ingredients": [
            "1 halved lengthwise and seeded ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1/4 pound lean ground beef ADVERTISEMENT",
            "1/4 pound ground pork sausage ADVERTISEMENT",
            "vegetable oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 ounces Cheddar cheese, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSprinkle squash with salt and pepper, and lightly spray with cooking oil. Place in a baking dish flesh side down, and cover with plastic wrap.\nMicrowave on high for 10 to 15 minutes, or until flesh is fork-tender.\nMeanwhile, cook beef and pork in 1 tablespoon of oil on medium high heat until well browned, stirring frequently to crumble. Drain, and set aside. In the same skillet, cook the onion and garlic until onion is translucent. Combine beef and pork with cheese and onions, and spoon mixture into squash halves.\nBake, uncovered, in the preheated oven for 15 to 20 minutes, or until cheese is melted and squash is lightly browned. Season with salt and pepper to taste. Serve hot.\n",
        "picture_link": "9ElZVaQBQmVTonraBBnljPNB62XIZxW"
    },
    {
        "title": "Grilled Portobello and Mozzarella",
        "ingredients": [
            "4 portobello mushroom caps ADVERTISEMENT",
            "1/2 (8 ounce) bottle Italian salad dressing ADVERTISEMENT",
            "1 (14 ounce) jar marinara sauce ADVERTISEMENT",
            "1 (7 ounce) jar roasted red bell peppers, drained and sliced ADVERTISEMENT",
            "8 slices mozzarella cheese ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the mushrooms in a large resealable plastic bag with the salad dressing. Seal, and marinate for at least 15 minutes.\nPreheat grill for medium-high heat. Heat the marinara sauce in a saucepan over medium heat, and keep warm.\nOil the grill grate. Place the mushrooms on the grill, and cook for 7 to 10 minutes on each side, until lightly toasted.\nPreheat the oven broiler. Spread the bottom of a shallow baking dish or oven-proof plate with just enough marinara sauce to cover the bottom. Place mushrooms in the dish bottom side up, and top with the peppers and remaining marinara sauce. Place 2 slices of cheese on each mushroom, and sprinkle with oregano and basil.\nBroil for 3 to 5 minutes, or until the cheese is melted. Serve hot.\n",
        "picture_link": "alLKj4hh0WDYn7ep/pEvM0Rnttr1Zaq"
    },
    {
        "title": "Sarah's Spinach Side Dish",
        "ingredients": [
            "1 tablespoon whipped butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "1 pinch kosher salt ADVERTISEMENT",
            "1/4 cup low-fat milk ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt whipped butter in a small saucepan over medium heat; stir flour, garlic salt, and kosher salt into the melted butter until smooth.\nWhisk in low-fat milk, bring to a simmer, and reduce heat to low. Simmer sauce until thickened, whisking constantly, about 1 minute.\nStir spinach into the sauce and heat until warmed through, 1 to 2 more minutes.\n",
        "picture_link": "4RN5ohNq8A7GAp9xA8wo.XqcxSa8Gae"
    },
    {
        "title": "Yellow Squash Dressing",
        "ingredients": [
            "2 cups diced yellow squash ADVERTISEMENT",
            "2 cups crumbled cornbread ADVERTISEMENT",
            "1/2 cup margarine, melted ADVERTISEMENT",
            "2 teaspoons dried sage ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 1/2 teaspoons sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place squash in a pot fitted with a steamer basket over boiling water, and steam 10 minutes, or until tender.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\nIn a bowl, mix the squash, cornbread, margarine, sage, cream of mushroom soup, egg, onion, sugar, salt and pepper, and milk. Transfer to the prepared baking dish.\nBake 30 minutes in the preheated oven, or until lightly browned.\n",
        "picture_link": "9ves4ke06Y5iCQwYQQO8Uw7YEYPmCYG"
    },
    {
        "title": "Quick Brown Rice and Mushroom Pilaf",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/4 cup celery, chopped ADVERTISEMENT",
            "1 1/2 cups sliced mushrooms ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "2 cups Minute® Brown Rice, uncooked ADVERTISEMENT",
            "1/2 cup chopped walnuts, toasted ADVERTISEMENT",
            "2 tablespoons fresh parsley, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in medium saucepan on medium heat. Add onions and celery; cook 3 minutes or until crisp-tender, stirring occasionally.\nAdd mushrooms; cook 3 minutes or until mushrooms are tender, stirring occasionally. Add broth; stir. Bring to boil.\nStir in rice; cover. Reduce heat to medium-low; simmer 5 minutes. Remove from heat; let stand 5 minutes. Add walnuts and parsley; mix lightly.\n",
        "picture_link": "ei.imPZdbW5UQIjvGxUAPGOXcsHtJ26"
    },
    {
        "title": "Mini Cheeseburgers",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nMix ground beef, 1/2 cup ketchup, 1/2 cup shredded cheese, egg, and garlic powder in a large bowl. Form mixture into 1 inch balls, and gently press onto prepared baking sheet to form mini-burgers.\nBake in preheated oven for 20 minutes. Spread remaining ketchup on burgers, and sprinkle with remaining cheese. Return burgers to the oven, and bake until cheese is melted and bubbly, about 5 minutes.\n",
        "picture_link": "AoEXK7Cmv0Y5Yol9I/X8hpcACcApmCa"
    },
    {
        "title": "Prime Rib Soup",
        "ingredients": [
            "4 beef ribs, trimmed from a cooked prime rib roast ADVERTISEMENT",
            "2 cups beef stock ADVERTISEMENT",
            "1 potato, peeled and cut into 3/4 inch pieces ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ribs in a large pot and cover with water. Bring to a boil; reduce heat to medium-low, cover, and simmer until the meat is falling from the bones, about 2 hours. Remove the ribs and allow to cool. Trim the meat from the ribs and cut into bite sized pieces; refrigerate. Continue simmering the broth until reduced to 1 cup; refrigerate until the fat congeals to the top.\nSkim and discard the congealed fat. Pour the broth into a saucepan along with the meat trimmings, beef stock, potato, mushrooms, salt, and pepper. Bring to a boil; reduce heat to medium-low, cover, and simmer until the potatoes are tender, about 20 minutes. Sprinkle with chives to serve.\n",
        "picture_link": "oKSq.seXJ17BLwSWtTzqcLd/S23uLQq"
    },
    {
        "title": "Kendra's Maid-Rite Sandwiches",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 chopped onion ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons prepared yellow mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "16 hamburger buns, warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat and stir in the ground beef and onion. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the ketchup, brown sugar, vinegar, Worcestershire sauce, mustard, and salt. Bring to a simmer, then reduce heat to medium-low, cover, and simmer 20 minutes longer. Serve on warmed buns.\n",
        "picture_link": "w0FSLyWhAnSAVlunVqGOshad1TuP7Gq"
    },
    {
        "title": "Creamy Roasted Parsnip Soup",
        "ingredients": [
            "2 pounds parsnips, peeled and cut into 1/2 inch pieces ADVERTISEMENT",
            "3 carrots, peeled and cut into 1/2-inch pieces ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "4 cups chicken stock ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nPlace the parsnips and carrots into a mixing bowl, and sprinkle with 1 tablespoon olive oil. Toss to coat the vegetables with oil, then season to taste with salt and pepper. Spread the vegetables evenly over a baking sheet.\nRoast in the preheated oven until the parsnips are tender and golden brown, about 30 minutes.\nHeat the remaining 1 tablespoon of olive oil in a large saucepan over medium heat. Stir in the onion and celery. Cook and stir until the vegetables have softened and the onion is beginning to turn golden brown, about 7 minutes. Reduce the heat to low, and stir in the butter, garlic, brown sugar, and the roasted parsnips and carrots. Continue to cook and stir until all of the vegetables are very tender and beginning to brown, about 10 minutes.\nSeason with the ginger, cardamom, allspice, nutmeg, and cayenne pepper; stir for 1 minute. Pour in the chicken stock, and bring to a boil over medium-high heat. Reduce heat to medium-low, partially cover, and simmer gently until all of the vegetables are very tender, about 15 minutes.\nPour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.\nStir in the milk and cream. Return to a simmer over medium-low heat. Season to taste with salt and pepper before serving.\n",
        "picture_link": "NahyXaJwoICv7mOIUll2Mlci9.L3kUy"
    },
    {
        "title": "Parrothead Salad",
        "ingredients": [
            "1 head leaf lettuce - rinsed, dried, and torn into bite-size pieces ADVERTISEMENT",
            "1/2 pound fresh strawberries, sliced ADVERTISEMENT",
            "1/2 pound fresh blueberries ADVERTISEMENT",
            "1 mango, peeled, seeded, and cut into strips ADVERTISEMENT",
            "1 cup cherry tomatoes, halved ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/4 cup toasted slivered almonds ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the lettuce, strawberries, blueberries, mango, tomatoes, raisins, almonds, and onions together in a salad bowl. Cover, and refrigerate at least 30 minutes to allow the flavors to mingle. Do not refrigerate more than 4 hours.\nPlace the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until crisp and evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Crumble and sprinkle over the salad to serve.\n",
        "picture_link": "9d7OP68Z3Cc11BouL/IhyXhY9XI3nXC"
    },
    {
        "title": "Grilled Salmon with Curried Peach Sauce",
        "ingredients": [
            "2 fresh peaches, peeled and diced ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 salmon steaks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat, and lightly oil grate.\nStir together the peaches, honey, and curry powder in a small saucepan over medium heat. Bring to a simmer, and cook until the peaches break down, and the sauce thickens, about 10 minutes. Season to taste with salt and pepper.\nSeason the salmon steaks with salt and pepper, and cook on the preheated grill until the fish flakes easily with a fork, 5 to 10 minutes per side depending on the thickness of the steaks. Pour the peach sauce over the salmon to serve.\n",
        "picture_link": "vK7O2f.UzniQeNulQiX8M1gH993qSiG"
    },
    {
        "title": "Turkey Stuffing Divan",
        "ingredients": [
            "1 1/4 cups boiling water ADVERTISEMENT",
            "4 tablespoons butter or margarine ADVERTISEMENT",
            "4 cups Pepperidge Farm® Herb Seasoned Stuffing ADVERTISEMENT",
            "2 cups cooked broccoli cuts ADVERTISEMENT",
            "2 cups cubed cooked turkey or chicken ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Celery Soup (Regular or 98% Fat Free) ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water and butter. Add stuffing. Mix lightly.\nSpoon into 2-quart shallow baking dish. Top with broccoli and turkey.\nMix soup, milk and 1/2 cup cheese and pour over all. Sprinkle with remaining cheese.\nBake at 350 degrees F for 30 minutes or until hot.\n",
        "picture_link": "JZm1V2i4UVuILHOYAboOjleiyJVLbwm"
    },
    {
        "title": "Mexi-Italian Salsa",
        "ingredients": [
            "3 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 (6 ounce) can marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon Italian seasoning ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently stir the tomatoes, onion, olives, and artichoke hearts in a bowl; set aside. Whisk together the lemon juice, garlic, basil, red pepper flakes, Italian seasoning, cumin, cilantro, salt, and pepper in a separate bowl. Fold the dressing into the tomato mixture.\n",
        "picture_link": "jFd8NCWCDCFw3jG8FTZnthQmNyRzsL."
    },
    {
        "title": "Healthier Golden Pork Chops",
        "ingredients": [
            "6 pork chops ADVERTISEMENT",
            "1/4 teaspoon seasoned salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cups fresh sliced mushrooms ADVERTISEMENT",
            "1 (10.75 ounce) can natural cream of mushroom soup ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nRinse pork chops, pat dry, and season with seasoned salt and pepper. Place them in a 9x13-inch baking dish. Combine onion, mushrooms, and soup in a separate small bowl. Mix together and spoon over chops.\nCover and bake in preheated oven for 45 minutes. Uncover and bake for 15 more minutes. (Note: Time could be less or more depending on thickness of chops.) Pork chops are done with their internal temperature has reached 160 degrees F (70 degrees C).\nPour sauce into a medium pot and bring to a simmer. Whisk together cornstarch and 1/2 cup of sauce in a small bowl. Whisk into pot and simmer until thickened, about 2 minutes longer. Serve with pork chops.\n",
        "picture_link": "T.jev8YMRv5ysbBXNswb6zP/hIB0ruu"
    },
    {
        "title": "Slow Cooker Beef and Mushrooms",
        "ingredients": [
            "1 1/2 pounds cubed beef stew meat ADVERTISEMENT",
            "1 (10.75 ounce) can condensed golden mushroom soup ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms, undrained ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1/4 cup red wine (optional) ADVERTISEMENT",
            "1 pinch black pepper to taste ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the stew meat, mushroom soup, mushrooms with their liquid, and onion soup mix in the crock of a slow cooker. Pour in red wine, if desired. Season with pepper.\nCook on Low for 8 to 10 hours, or on High for 4 to 6 hours.\nIn the last half hour of cooking time, bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.\n",
        "picture_link": "7guOEdy0Si.sQN8ojzvQC83SA9NwMn."
    },
    {
        "title": "Slow Cooker Cinnamon Apple Steel Cut Oats",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "23 ounces unsweetened applesauce ADVERTISEMENT",
            "1 1/2 cups steel cut oats ADVERTISEMENT",
            "2 Granny Smith apples - peeled, cored, and diced ADVERTISEMENT",
            "1/4 cup ground cinnamon, or to taste ADVERTISEMENT",
            "1/3 cup granular no-calorie sucralose sweetener (such as Splenda®) (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly spray a 5-quart or larger slow cooker crock with cooking spray.\nCombine water, applesauce, oats, diced apple, cinnamon, and sweetener in prepared slow cooker.\nCook on Low for 6 hours.\n",
        "picture_link": "1Rh84rW7VrH/C0vrkG/w2vbW1sY4S0q"
    },
    {
        "title": "Sweet Blackberry and Brandy Sauce",
        "ingredients": [
            "4 cups fresh blackberries ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 tablespoon brandy ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the blackberries, sugar, and brandy into a saucepan, and place over medium heat. Slowly bring to a simmer, and cook until the blackberries have softened, about 10 minutes. Dissolve the cornstarch in the water, and stir into the simmering berries. Continue cooking and stirring until the sauce has thickened and reached your desired consistency, about 10 minutes.\n",
        "picture_link": "cySLU2EIVtIkOEpybe8TnZEdgyVFqtG"
    },
    {
        "title": "Spicy Mango Salad",
        "ingredients": [
            "4 medium mangos - peeled, seeded, and cubed ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons chopped shallots ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the mango cubes into a serving bowl. In a separate bowl, whisk together the lime juice and olive oil. Season with red pepper flakes, cilantro, shallots, salt and pepper. Whisk briefly, then pour over the mangos. Stir to coat, then cover and refrigerate for about 30 minutes to blend the flavors before serving.\n",
        "picture_link": "Oi0OdRcI0ohYs6/noSjXqm5GhJ.Y.H6"
    },
    {
        "title": "Zucchini Cheddar Pancakes",
        "ingredients": [
            "2 cups grated zucchini ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup grated onion ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup biscuit baking mix (such as Bisquick®) ADVERTISEMENT",
            "2 teaspoons vegetable oil, as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix zucchini, Cheddar cheese, and onion together in a bowl. Stir eggs and biscuit mix into zucchini mixture until well combined.\nHeat vegetable oil on the griddle or large skillet over medium heat. Scoop about 1/4 cup batter onto heated griddle; cook until pancakes are browned, 3 to 4 minutes per side. Repeat with remaining batter.\n",
        "picture_link": "q.mwCWFN64/mxF0BLalAN00wlWmdlku"
    },
    {
        "title": "Blackberry Jam",
        "ingredients": [
            "4 cups blackberries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash blackberries in a saucepan with a potato masher. Stir in sugar until juices form; place about 1 tablespoon blackberry juice in a small bowl and stir in cornstarch. Pour cornstarch mixture into saucepan.\nBring berries to a boil, stirring often, until jam is thickened, about 15 minutes. Stir in cinnamon and allspice. Remove from heat and allow to cool. Transfer jam to a bowl, cover, and refrigerate until chilled. Stir in lemon juice.\n",
        "picture_link": "dJqLvX4T.9k2lBjkxT7iQdhWw7VyuXS"
    },
    {
        "title": "Cheeseburger Pasta",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Cheddar Cheese Soup ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Tomato Soup (Regular or 25% Less Sodium) ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "2 cups uncooked medium shell-shaped pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook beef in skillet until browned. Pour off fat.\nAdd soups, water and pasta. Heat to a boil. Cook over medium heat 10 minutes or until done, stirring often.\n",
        "picture_link": "TOpWOJQfD.NZBKpr9gGfMLFp7a46nt."
    },
    {
        "title": "Greek Orzo with Feta",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 cup fresh lemon juice ADVERTISEMENT",
            "1/2 cup pitted kalamata olives, chopped ADVERTISEMENT",
            "2 ripe tomatoes, seeded and diced ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon finely chopped fresh oregano ADVERTISEMENT",
            "1 (8 ounce) package crumbled feta cheese ADVERTISEMENT",
            "1/2 pound dried orzo pasta ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together olive oil, lemon juice, olives, tomatoes, red pepper, red onion, garlic, oregano, and feta cheese in a large bowl. Let stand at room temperature for 1 hour.\nBring a large pot of lightly salted water to a boil. Add the orzo and cook for 8 to 10 minutes or until al dente; drain and toss the tomato mixture. Sprinkle with chopped parsley to serve.\n",
        "picture_link": "BUQ3Ddd8tZQCyuI77RP2oDd8mPKcy/C"
    },
    {
        "title": "Mushrooms in White Wine Sauce",
        "ingredients": [
            "1/4 cup peanut or vegetable oil ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pound mushrooms, sliced ADVERTISEMENT",
            "3/4 cup water, divided ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Stir in onions and garlic, and cook until tender, about 5 minutes. Stir in mushrooms, 1/2 cup water, wine, and chicken bouillon. Season with basil, salt, and pepper. Bring to a boil; reduce heat, and simmer, uncovered, 10 minutes, stirring occasionally. Mix together cornstarch with 1/4 cup water. Stir into mushrooms, and cook until thickened, about 5 minutes.\n",
        "picture_link": "Oo5UgbBajvtdFNOGuSxoNOFRQ5P3Ih2"
    },
    {
        "title": "Thai Chicken Satay",
        "ingredients": [
            "1/2 cup canned coconut milk ADVERTISEMENT",
            "1 1/2 teaspoons ground coriander ADVERTISEMENT",
            "1 teaspoon yellow curry powder ADVERTISEMENT",
            "1 teaspoon fish sauce ADVERTISEMENT",
            "1/2 teaspoon chili oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon chopped unsalted peanuts ADVERTISEMENT",
            "12 wooden skewers, soaked in water for 15 minutes ADVERTISEMENT",
            "1 cup prepared Thai peanut sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the coconut milk, ground coriander, curry powder, fish sauce, and chili oil. Add the chicken breast strips, and stir to coat. Cover, and refrigerate for at least 30 minutes, and up to 2 hours.\nPreheat an indoor or outdoor grill for high heat. Thread the chicken strips onto skewers. Discard marinade.\nGrill chicken for 2 to 3 minutes per side, until no longer pink. Time will depend on how thick your strips are. Transfer to a serving plate, and garnish with cilantro and peanuts. Serve with peanut sauce for dipping.\n",
        "picture_link": "ILwPG7nGBTmtmeF/S/x2oFteN55ilue"
    },
    {
        "title": "Grilled or Fried Skirt Steak",
        "ingredients": [
            "2 pounds beef skirt steak ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/3 cup prepared spicy brown mustard ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "1 cup blue cheese dressing (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the lemon juice and mustard. Trim away most of the fat from the steaks, and rub with the mustard marinade. Place into a resealable bag, and marinate in the refrigerator for at least 1 hour, and up to 24 hours.\nPreheat a grill or large skillet for medium-high heat.\nGrill or fry steaks for about 5 minutes per side, or to your desired degree of doneness. Remove from the heat, and let the meat rest for 5 to 10 minutes to let the juices settle. Cut each steak along the grain into 3 or 4 pieces. Serve with blue cheese dressing.\n",
        "picture_link": "4fc49Awg406mKjKEqwF2YlDMrO8Bnc6"
    },
    {
        "title": "Raspberry Kielbasa over Cheese Grits",
        "ingredients": [
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cup dry grits ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (16 ounce) package kielbasa sausage, sliced into 1/2 inch pieces ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "1 cup raspberry preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine the water and milk. Bring to boil, then stir in the grits, reduce the heat to low, and simmer until thick, about 10 minutes. Stir in the cheese, and remove from the heat.\nHeat the olive oil in a large skillet over medium heat. Add the sausage, mushrooms and onion; cook and stir until browned. Stir in the preserves, and simmer until sausage and mushrooms are coated and sauce is smooth, about 5 minutes. Serve over cheese grits.\n",
        "picture_link": "ec68VMkaxj7tCdNkx4RAn.sR2tn3p5S"
    },
    {
        "title": "Easy Ice Cream Sandwiches",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup butterscotch chips ADVERTISEMENT",
            "1/2 gallon vanilla ice cream, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease baking sheets.\nIn a large bowl, mix together the cake mix, butter, vanilla extract, eggs, chocolate chips, and butterscotch chips. Roll dough into 2-inch balls and place them onto the prepared baking sheets. Bake for 10 minutes in the preheated oven. Do not overbake; the cookies should be set, but still soft. Let cool on the baking sheet for a few minutes before removing to finish cooling on wire racks.\nUsing an ice cream scoop, mold the softened ice cream into a ball about the size of the cookies. Place scoop of ice cream between two cookies and gently press together. If you like a smooth edge, run the back of a spoon around the edge of the ice cream sandwich. Working quickly, fill all of the cookies, lay out on a baking sheet, and place in the freezer to harden. Serve when the ice cream has frozen solid. Sandwich cookies can be stored in a freezer bag for up to two weeks.\n",
        "picture_link": "IeFl2QkXXIfqORXSAna.BECo8bVjdm6"
    },
    {
        "title": "White Beans and Peppers",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1/4 large onion, chopped ADVERTISEMENT",
            "1 yellow gypsy (bull horn) sweet pepper, chopped ADVERTISEMENT",
            "1 (15 ounce) can great Northern beans, drained ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "ground cayenne pepper to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a skillet over medium heat. Stir in onion and sweet pepper, and cook until tender. Mix in beans. Season with oregano, cayenne pepper, salt, and black pepper. Continue cooking, stirring occasionally, until beans are heated through.\n",
        "picture_link": "qqQ/fncPcDiazHpLEI.LWE9TPkcFUGG"
    },
    {
        "title": "Slow Cooker Porcupine Meatballs With Peppers",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "2/3 cup uncooked white rice ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 beaten egg ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (14 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 1/2 cups beef broth ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (16 ounce) package frozen pepper and onion stir fry vegetable blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thoroughly combine ground beef, rice, milk, egg, garlic, basil, and salt in a bowl. Form the mixture into about 16 1-1/2 inch meatballs.\nHeat olive oil in a skillet over medium heat, and brown the meatballs well on all sides, about 15 minutes.\nPlace the spaghetti sauce, diced tomatoes, beef broth, red wine, basil, cayenne pepper, bay leaves, and 3 minced garlic cloves in slow cooker, and stir to combine. Put the meatballs into the slow cooker, and stir gently to cover with sauce. Shake the frozen vegetables over the sauce, without stirring, and cook on Low, covered, for 6 to 8 hours, until the meatballs are tender and the vegetables are cooked.\nAbout an hour before serving, gently stir the sauce, being careful not to break the meatballs, and remove the bay leaves. Cook for 1 more hour to blend the flavors and thicken the sauce.\n",
        "picture_link": "77e.eCVyt0xKUDOYSe8QQ65S4Z6fD4G"
    },
    {
        "title": "Honey Pork with Peppers",
        "ingredients": [
            "1 1/2 pounds boneless pork loin, cut into 1 inch cubes ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (.75 ounce) packet dry brown gravy mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1 onion, cut into wedges ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, saute the pork chunks in the oil for about 15 minutes, or until browned on all sides. Add the gravy mix, water, honey, soy sauce, vinegar, ginger and garlic powder.\nMix well, reduce heat to low, cover and simmer for 15 minutes, or until sauce has thickened and pork is near done. Add the onion, green bell pepper and red bell pepper and simmer for 15 more minutes or until all vegetables are tender.\n",
        "picture_link": "WNzqd3NbV41LdBxCF9FIaeE3nnyZXo."
    },
    {
        "title": "Wine Sauce Chicken",
        "ingredients": [
            "6 skinless boneless chicken breasts, cut into 2-inch cubes ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup slivered almonds for topping ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken in a saucepan and add water to cover. Bring to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the chicken pieces are no longer pink, about 10 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nMelt the butter in a skillet over medium heat. Stir in the mushrooms; cook and stir until the mushrooms are lightly browned and have released their liquid, about 5 minutes.\nPlace the chicken pieces in the prepared baking dish and add the sauteed mushrooms.\nIn a small saucepan over medium heat, combine and heat the soup, milk, Cheddar cheese and garlic powder. Remove from heat and add the white wine and mayonnaise. Pour mixture over the chicken and mushrooms. Top with slivered almonds and grated Parmesan cheese and bake in the preheated oven for 1 hour.\n",
        "picture_link": "zNJc/.af78ossdoSMSuu9kwtjLP0Y1y"
    },
    {
        "title": "Jalapeno Bread II",
        "ingredients": [
            "1 1/8 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup diced sharp Cheddar cheese ADVERTISEMENT",
            "5 1/2 tablespoons fresh chopped jalapeno peppers ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1/2 tablespoon active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add ingredients according to the bread machine manufacturer's directions.\nSet your machine on regular basic bread. I used setting 1 and it turned out great. Hope you like this one!!!\n",
        "picture_link": "dA1ylmfXU.ZTF64WXVKyTtOZ3fFIa8W"
    },
    {
        "title": "Johnnycakes",
        "ingredients": [
            "2 cups stone ground cornmeal ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 tablespoons unsalted butter ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "2 tablespoons boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream the cornmeal, salt, and butter together. Add the milk and enough water to make a moist but firm batter.\nDrop by large spoonfuls onto a hot greased griddle, and flatten slightly with the back of a spoon. When brown, turn and cook the other side.\n",
        "picture_link": "J/vGu2or8A0tDrh0saZHMjDn8MdoGEG"
    },
    {
        "title": "Dilly Bread",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 cup cottage cheese ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons dill seed ADVERTISEMENT",
            "1 teaspoon dried minced onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon margarine, melted ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the yeast into the warm water, and add a pinch of sugar. Set aside to proof.\nIn a large saucepan, warm the cottage cheese and margarine until the fat is melted. Remove from heat, and add sugar, onion flakes, dill seed, salt, and soda. Mix in egg and dissolved yeast. Stir in flour for a stiff dough. Place dough in a greased bowl, and turn several times to thoroughly coat. Let rise until double in size in a warm place, usually 50 to 60 minutes.\nStir the dough until it is deflated. Place into an 8 inch round, buttered 2 quart casserole. Let rise 30 to 40 minutes in a warm place.\nBake at 350 degrees F (175 degrees C) for 40 to 50 minutes until golden brown. Brush top with melted margarine. Sprinkle lightly with salt.\n",
        "picture_link": "aKlPOUhwvokwIMrF5F/W7Q93mNnVRtS"
    },
    {
        "title": "Succulent Ribeye and Peppers",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 (10 ounce) beef rib-eye steaks ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons fajita seasoning ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over high heat. Sear the steaks on both sides and set aside. In the same skillet over medium heat, saute the red bell pepper, green bell pepper, onion and garlic for 5 minutes, or to desired tenderness.\nSprinkle the steaks with the fajita seasoning and place them back in the skillet. Squeeze the lime juice over the steaks and bell peppers, reduce heat to low, cover and simmer for 30 minutes to 1 hour, turning steaks over occasionally. (Note: The longer it simmers, the more tender the meat gets.)\n",
        "picture_link": "2xv.yIyAVdr/RxhUgTkNQVxIHsYsZ8."
    },
    {
        "title": "Simple Texas Salsa",
        "ingredients": [
            "3 tablespoons chopped fresh chives ADVERTISEMENT",
            "1/2 bunch fresh cilantro ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 (14 ounce) cans stewed tomatoes ADVERTISEMENT",
            "2 serrano chilis, seeded and chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chives, cilantro, garlic, tomatoes, peppers, salt and pepper to taste in an electric blender. Pulse until the salsa is to your desired consistency.\n",
        "picture_link": "lam3mCcyPkY0HAtkzrcKFxFW5ve2zLm"
    },
    {
        "title": "Caryn's Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - pounded thin ADVERTISEMENT",
            "6 oranges, juiced ADVERTISEMENT",
            "3 tablespoons thinly sliced green onion ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Hit the chicken fillets with a tenderizing mallet until they are slightly thinned out.\nPut the orange juice, green onions and black pepper into a skillet over medium heat. Don't cook over high heat, or the juice will burn and go bitter.\nPoach the chicken in the juice mixture until it is firm and the juices run clear. This usually takes about 10 minutes, depending on the thickness of the filets. Place the chicken on a serving plate and pour some of the juice mixture on top. Serve.\n",
        "picture_link": ".ciGC3gCxbeh/BjBJDp.1yvj4ttV5Ha"
    },
    {
        "title": "Bran Muffins I",
        "ingredients": [
            "2 cups raisin bran cereal ADVERTISEMENT",
            "4 cups whole bran cereal ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 cups buttermilk ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "5 teaspoons baking soda ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cereal and boiling water together in a metal bowl, and allow to cool.\nCream shortening, sugar, and eggs in a large bowl. Add buttermilk and cooled cereal mixture. Combine flour, baking soda, and salt; stir into the creamed mixture until flour is moistened. Batter should be lumpy. Put batter into a one gallon wide mouth jar. When using mix, use a ladle to get batter out of the jar; don't mix or stir.\nWhen ready to use, spoon batter into muffin tins. Bake at 375 degrees F (195 degrees C) for approximately 15 minutes.\n",
        "picture_link": "qz4w2W3Z0pEXHBYIb1rVk3D8K8.MZHW"
    },
    {
        "title": "Sloppy Joe Spaghetti",
        "ingredients": [
            "1 pound spaghetti ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (15 ounce) can sloppy joe sauce ADVERTISEMENT",
            "1/2 green bell pepper, diced ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 cup Italian-style dried bread crumbs ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet, brown beef over medium heat; cook until no longer pink and drain. Add sauce and simmer on low.\nAdd green bell pepper and onion; mix well. Remove from heat and immediately mix in bread crumbs and cheese.\nAdd sauce to pasta; serve immediately.\n",
        "picture_link": "4aj1cN8RAWMS44QsDCU86TS4UIDLRs6"
    },
    {
        "title": "Broccoli, Pepperoni and Three Cheese Calzones",
        "ingredients": [
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "1 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 heads fresh broccoli ADVERTISEMENT",
            "2/3 cup shredded provolone cheese ADVERTISEMENT",
            "1/3 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup diced pepperoni ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "2 tablespoons cornmeal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, proof the yeast by blending it with 1/4 cup of the warm water. Let stand until it bubbles.\nIn a large bowl combine the flour, salt, and sugar. Blend in the one tablespoon of olive oil by rubbing the mixture between the palms of your hands. Make a well in the dry ingredients. Add proofed yeast mixture and work in by hand. Gradually add the remaining warm water. Blend well and gather into a ball.\nPlace one teaspoon of olive oil on a wooden board. Knead dough on board until smooth. Place dough in a greased bowl and cover with plastic wrap and a towel. Let rise in a warm place for 1 1/2 hours or until doubled in bulk.\nMeanwhile, prepare calzone filling: separate the broccoli tops from the stalks. Soak in cool water with 1 teaspoon salt for 15 minutes. Rinse in cool water. Cook in a large pot of boiling water for 5 minutes. Drain well and chop into small pieces. Place in large bowl with provolone cheese, mozzarella cheese, Parmesan cheese, garlic, pepperoni, olive oil, salt, and ground black pepper.\nPunch down dough and knead for one minute. Divide into six equal pieces. On a floured board, roll each section into a 8x10 inch rectangle.\nIn a small bowl combine the beaten egg and water. On the long side of the dough, place 2/3 cup filling in a strip one inch away from the edges of the dough. Flatten the filling with a spoon. Brush egg mixture over edges of dough. Fold the dough over the filling. Fold edges under 1/4 inch. Seal edges.\nSprinkle two 12x16 inch baking pans with cornmeal. Place three calzones on each baking pan. Brush remaining egg mixture on top of calzones. Prick tops of calzones with toothpick, making holes 1/2 inch apart on top of dough.\nBake in a preheated 375 degree F (190 degrees C) oven for 30 minutes, or until golden brown. Serve hot or cold.\n",
        "picture_link": "uElx4GTP9xfBbF5zaMTld6v4.wGiR/K"
    },
    {
        "title": "Buttermilk Seed Bread",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "3/4 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "2 tablespoons margarine, melted ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "2 tablespoons flax seeds ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "2 tablespoons sunflower seeds ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "4 cups bread flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve the yeast and sugar in the warm water. Let stand until creamy, about 10 minutes.\nCombine buttermilk, butter or margarine, honey and the yeast mixture in a large bowl. Add the salt, all of the seeds and the whole wheat flour. Stir to combine. Add the bread flour, 1/2 cup at a time, mixing well with a wooden spoon after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 6 minutes.\nLightly oil a large mixing bowl, place the dough in the bowl and turn to coat with the oil. Cover with a damp cloth and put in a warm place to rise until doubled in volume, about 1 hour.\nPreheat oven to 375 degrees F (190 degrees F). Grease two 9x5 inch loaf pans.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into the prepared pans. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes.\nBake at 375 degrees F (190 degrees C) for about 30 minutes or until the tops are brown and the bottom of a loaf sounds hollow when tapped.\n",
        "picture_link": "nmidSRwl457QxbOQIl4uI0qn8VxCkqC"
    },
    {
        "title": "Penne in Vodka Cream",
        "ingredients": [
            "1 pound penne pasta ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup vodka ADVERTISEMENT",
            "1/2 teaspoon dried red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon Worcestershire sauce ADVERTISEMENT",
            "8 ounces tomato sauce ADVERTISEMENT",
            "1/2 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and reserve.\nIn a large saucepan melt butter over medium low heat; add vodka, red pepper flakes and Worcestershire sauce. Stir well and simmer for 5 minutes.\nBlend in tomato sauce, tomato paste and cream; increase heat to bring to a boil. Simmer for 5 minutes or until sauce has slightly thickened; season with salt and pepper to taste.\nReduce heat to very low and stir in cheese; add cooked pasta and more cheese, if desired. Serve.\n",
        "picture_link": "zYa35CA0urk/9eb4hKacnvTNf/m.ciq"
    },
    {
        "title": "Gazpacho Pasta Salad",
        "ingredients": [
            "1/2 pound rotelle pasta ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 cucumber ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "6 fluid ounces tomato juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn large bowl combine pasta, onion, bell pepper, jalapeno, tomatoes, cucumber, oil, salt, garlic, lime juice, black pepper and tomato juice. Toss well and chill in refrigerator for 2 hours. Toss again before serving.\n",
        "picture_link": "laALeo8YwsjQzzW7GSkLJKrVu8Y1JO6"
    },
    {
        "title": "Thai Chicken Wings",
        "ingredients": [
            "5 pounds frozen chicken wings ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup fish sauce ADVERTISEMENT",
            "1/4 cup crushed garlic ADVERTISEMENT",
            "1/4 cup finely chopped jalapeno chile peppers ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "3 teaspoons paprika ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace chicken wings on a non-greased cookie sheet. Bake in the preheated oven for 45 minutes to 1 hour, turning once, until golden brown. Move to serving dish/platter.\nIn a medium skillet saute garlic and jalapeno peppers in olive oil until soft. Add chicken broth, fish sauce, paprika and sugar. Add cornstarch and let thicken. Stir all together and pour over crispy chicken wings. Enjoy!\n",
        "picture_link": "4EPDpm2eQsMmWVrf54rHNZXvvJpke/C"
    },
    {
        "title": "Mom's Shrimp Macaroni Salad",
        "ingredients": [
            "1 cup uncooked elbow macaroni ADVERTISEMENT",
            "1 tablespoon finely diced onion ADVERTISEMENT",
            "1 tablespoon chopped green bell pepper ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup sweet pickle relish ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "1 teaspoon prepared horseradish ADVERTISEMENT",
            "1/4 teaspoon hot pepper sauce ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1/8 teaspoon chili powder ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 ounces cooked salad shrimp ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil, add the macaroni and let it cook until al dente; drain well.\nIn a medium-size mixing bowl, combine onion, bell pepper, celery, mayonnaise, sweet pickle relish, ketchup, pickle juices, horseradish, hot pepper sauce, parsley, celery seed, chili powder, salt, black pepper and shrimp. Fold the macaroni into the mixture. Cover and chill at least 3 hours before serving.\n",
        "picture_link": "3smWsGewXlgdEKMA/bMJGwmGR2ZO9Fm"
    },
    {
        "title": "Rhubarb Pie IV",
        "ingredients": [
            "4 cups chopped rhubarb ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 (9 inch) unbaked pie crusts ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPour rhubarb into the prepared pie crust. Combine flour and sugar; sprinkle over the rhubarb in the crust. Cover with top crust making sure to cut 4 steam slots into the top of it. Brush the top with egg.\nBake in preheated oven for 30 to 45 minutes.\n",
        "picture_link": "LqePttixUZZCIYn.GhmSMfs2YwWQQYO"
    },
    {
        "title": "Mock Apple Pie",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons cream of tartar ADVERTISEMENT",
            "30 buttery round crackers ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "1 cup crushed buttery round crackers ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a saucepan over medium high heat, combine the water, sugar and cream of tartar; bring to boil.\nDrop in whole crackers and boil for 5 minutes. Pour mixture into pie shell; sprinkle with cinnamon and lemon juice.\nMix together the crushed crackers, brown sugar, cinnamon and butter; sprinkle over pie filling.\nBake for 15 minutes and reduce heat to 375 degrees F (190 degrees C) and continue to bake for 15 to 20 minutes longer. Serve warm.\n",
        "picture_link": "BPdYrBPOK9a4Yl2.EpBncM0I.WSKmye"
    },
    {
        "title": "Roast Pork",
        "ingredients": [
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "3/4 cup soy sauce ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 (6 pound) boneless pork loin roast ADVERTISEMENT",
            "1 large onion, sliced into thin rings ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the lime juice, soy sauce, sugar, ginger, garlic, and salt until the sugar dissolves.\nPlace the loin of pork in a roasting pan, and scatter the onion rings and bay leaves over it. Pour lime-ginger mixture over the meat, and cover with plastic wrap. Refrigerate for 12 hours or so, turning every once in a while.\nPreheat the oven to 325 degrees F (165 degrees C).\nRoast, uncovered, for about 3 1/2 hours; baste frequently with pan juices. For a well done roast, cook until the internal temperature of the roast is 145 degrees F (63 degrees C).\n",
        "picture_link": "2sHdTDj8/.fb5vjt7XOMsGEkrQczu/i"
    },
    {
        "title": "Veneto Chicken",
        "ingredients": [
            "3 large tomatoes - peeled, seeded and chopped ADVERTISEMENT",
            "1 (3 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/4 pound fresh mushrooms, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dredge chicken lightly in flour. Heat oil over medium-high heat. Fry chicken pieces briefly, turning to brown evenly. Add onion and celery; cook 1 to 2 minutes. Stir in wine and chopped tomatoes. Season with oregano, and salt and ground pepper to taste. Cover, reduce heat, and simmer gently for 30 minutes, turning pieces once.\nPour in balsamic vinegar and mushrooms, and cook another 5 to 10 minutes.\n",
        "picture_link": "Bthd3GoTN0MjV9vLFAVUFYRWNcSce.S"
    },
    {
        "title": "Cookie Mix in a Jar I",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the salt and baking soda with the flour, then layer the ingredients into a 1 quart, wide mouth jar. Use scissors to cut a 9 inch-diameter circle from calico. Place over lid, and secure with rubber band. Tie on a raffia or ribbon bow to cover rubber band.\nEnclose a card with the following mixing and baking directions: Chocolate Chip Cookies 1. Preheat oven to 375 degrees F (190 degrees C). 2. In a large bowl, cream 1 cup of unsalted butter or margarine until light and fluffy. Beat in 1 egg and 1 teaspoon of vanilla. Mix in cookie mix. Drop teaspoonfuls of dough, spaced well apart, onto a greased cookie sheet. 3. Bake for 8 to 10 minutes in preheated oven, or until lightly browned. Cool on wire racks.\n",
        "picture_link": "bFx5clyGMexnpiGvxyzw1KXHQhpEXXK"
    },
    {
        "title": "Ricotta Pie (Old Italian Recipe)",
        "ingredients": [
            "Pie Filling: ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 pounds ricotta cheese ADVERTISEMENT",
            "1/4 cup miniature semisweet chocolate chips, or to taste (optional) ADVERTISEMENT",
            "Sweet Crust: ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "5 teaspoons baking powder ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening, chilled ADVERTISEMENT",
            "1 tablespoon shortening, chilled ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon milk (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the 12 eggs, 2 cups sugar and vanilla extract together in a large bowl. Stir in the ricotta cheese and the chocolate chips, if using (see Cook's Note). Set aside.\nCombine the flour, baking powder, and 1 cup sugar together. Cut in 1/2 cup plus 1 tablespoon shortening until the mixture resembles coarse crumbs. Mix in 4 beaten eggs and 1 teaspoon vanilla extract. Divide dough into 4 balls, wrap in plastic, and chill for at least 30 minutes.\nPreheat oven to 325 degrees F (165 degrees C). Grease two deep-dish pie plates.\nRoll out 2 of the balls to fit into the pie pans. Do not make the crust too thick, as it will expand during cooking. Do not flute the edges of the dough. Roll out the other 2 balls of dough and cut each into 8 narrow strips for the top of the crust. (Alternately, you can use cookie cutters and place the cutouts on the top of the pies.)\nPour the ricotta filling evenly into the pie crusts. Top each pie with 8 narrow strips of dough or cookie cut-outs. Brush top of pie with milk for shine, if desired. Place foil on the edge of crust.\nBake in preheated oven for 20 to 30 minutes; remove foil. Rotate pies on the rack so they will bake evenly. Continue to bake until a knife inserted in the center of each pie comes out clean, 25 to 30 minutes more. Cool completely on wire racks. Refrigerate until serving.\n",
        "picture_link": "yfmN8ACauxLMgP5agZZaBZ7Rav4FLYG"
    },
    {
        "title": "Cappuccino Brownies",
        "ingredients": [
            "2 pounds milk chocolate chips ADVERTISEMENT",
            "1/4 cup instant coffee granules ADVERTISEMENT",
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "3 tablespoons vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease and flour four 8x8-inch baking pans.\nPlace the chocolate chips and the coffee granules in a double boiler over simmering water. Cook over medium heat, stirring occasionally, until melted and smooth. Set aside.\nIn a large bowl, cream the butter and sugar together until light and fluffy. Beat in the eggs two at a time, mixing well after each addition. Stir in vanilla, cinnamon, and salt, then mix in the melted chocolate. Mix in flour until just blended. Divide the batter equally into the prepared pans, and spread smooth.\nBake for 35 minutes in preheated oven, or until the edges pull from the sides of the pans. Cool on a wire rack. Cover, and refrigerate for 8 hours. Cut the cold brownies into bars to serve.\n",
        "picture_link": "zyxdFkTVyqh041MzcD0QmXh4GNYi3SW"
    },
    {
        "title": "Summer Fruit Galettes",
        "ingredients": [
            "2 (9 inch) refrigerated pie crusts ADVERTISEMENT",
            "3 fresh peaches - peeled, pitted, and sliced ADVERTISEMENT",
            "1 pint fresh strawberries, sliced ADVERTISEMENT",
            "1/2 pint fresh blueberries ADVERTISEMENT",
            "4 tablespoons white sugar, divided ADVERTISEMENT",
            "4 tablespoons all-purpose flour, divided ADVERTISEMENT",
            "6 tablespoons turbinado sugar, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nLay out one pie crust on a baking sheet lined with parchment or on a baking stone, leaving room for the second pie crust next to it.\nMix together the sliced peaches with half the blueberries, 2 tablespoons of the flour and 2 tablespoons of the sugar in a bowl. Pour over one pie crust leaving a 1-inch border. Fold up the uncovered border over the edge of the fruit and pinch into pleats. Sprinkle the crust and fruit filling with 3 tablespoons of turbinado (or raw) sugar.\nLay out the second pie crust on the baking sheet. Mix together the sliced strawberries, the rest of the blueberries, 2 tablespoons of flour and 2 tablespoons of sugar in the bowl. Pour over the second pie crust and form the galette the same as the first. Sprinkle with 3 tablespoons of turbinado sugar.\nBake in preheated oven until crust is lightly browned, 12 to 14 minutes. Sprinkle with more sugar if desired. Serve warm or at room temperature.\n",
        "picture_link": "N.OsTawpSSF1mxlJNzhRDT3Cu39f.C."
    },
    {
        "title": "Coconut Jerk Chicken",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "2 teaspoons dry Caribbean jerk seasoning ADVERTISEMENT",
            "2 teaspoons chicken bouillon granules ADVERTISEMENT",
            "1 yellow onion, coarsely chopped ADVERTISEMENT",
            "1 teaspoon fresh minced garlic ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast halves - cut into 1/2 inch cubes ADVERTISEMENT",
            "1 cup peeled, seeded, and diced butternut squash ADVERTISEMENT",
            "8 ounces button mushrooms, sliced ADVERTISEMENT",
            "1 bunch green onions, cut into 1/4-inch pieces ADVERTISEMENT",
            "1 (13.5 ounce) can coconut milk ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, chopped, juice reserved ADVERTISEMENT",
            "1/2 cup tomato juice ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium-high heat. Stir in the curry powder, jerk seasoning, bouillon granules, onions, and garlic. Stir and cook for 2 minutes.\nReduce heat to medium, add the chicken, and continue to stir and cook 6 to 8 minutes more. Stir in the squash and mushrooms. Reserve 1 tablespoon green onions for garnish, and stir in the remaining amount. Continue to stir and cook 2 minutes more. Pour in the coconut milk, tomatoes, 1/2 cup reserved tomato juice, and sugar. Reduce heat to low, and simmer for 35 to 40 minutes, stirring occasionally. Serve, using 1 tablespoon green onions for garnish.\n",
        "picture_link": "dT8CYQgq/BChM3q8EdOIE0YLr.O0gp2"
    },
    {
        "title": "Veal Scaloppini with Lemon Cream Sauce",
        "ingredients": [
            "8 (2 ounce) pieces veal scaloppini ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 1/2 cups Italian bread crumbs ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 (15 ounce) can chicken broth ADVERTISEMENT",
            "1/4 teaspoon garlic pepper ADVERTISEMENT",
            "1/4 teaspoon lemon pepper ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dip veal into the beaten egg, then press into the bread crumbs. Gently shake off excess, and set aside.\nHeat olive oil in a large skillet over medium-high heat. Add breaded scaloppini, and cook until golden brown on both sides, and no longer pink on the inside, about 4 minutes per side. Remove to a paper towel lined plate, and keep warm.\nPour in lemon juice and white wine. Increase heat to high, and bring to a boil. Boil for 1 minute. Dissolve the cornstarch in about 2 tablespoons of chicken broth, and set aside. Pour the remaining chicken broth into the skillet, season with garlic pepper and lemon pepper, and bring to a boil. Once the sauce is boiling, stir in the dissolved cornstarch, and cook until thickened and clear, about 1 minute. Remove the sauce from the heat, then whisk in heavy cream. Place the veal on a serving platter, and pour sauce overtop to serve.\n",
        "picture_link": "f7CabliuLqOHL5evlNcmGGz3Fe5UC2K"
    },
    {
        "title": "Crunchy Pumpkin Pie Granola",
        "ingredients": [
            "1/3 cup brown sugar ADVERTISEMENT",
            "1 tablespoon pumpkin pie spice ADVERTISEMENT",
            "3 1/2 cups rolled oats ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "2/3 cup applesauce ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 250 degrees F (120 degrees C). Coat 2 baking sheets with nonstick cooking spray.\nCombine brown sugar, pumpkin pie spice, rolled oats, almonds, and pecans in a large bowl. Mix the applesauce, honey, and vanilla in a separate large bowl. Stir the oat mixture into the applesauce mixture, until granola begins to gather in clusters. Spoon granola evenly onto prepared baking sheets.\nBake in preheated oven, stirring every 20 minutes, until lightly browned and crispy, about 1 hour.\nRemove from oven; cool to room temperature. Stir in raisins and cranberries; store in an airtight container.\n",
        "picture_link": "CfhTD1ZN9qlzqN5g8DkmnAbfHmtPCFy"
    },
    {
        "title": "Grilled Ginger-Peanut Pork Tenderloin",
        "ingredients": [
            "2 (16 ounce) pork tenderloins, trimmed of fat ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 1/2 teaspoons sugar or sugar substitute ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon smooth natural peanut butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork in a large resealable plastic bag. Mix together soy sauce, sugar, sesame oil, peanut butter, garlic, curry powder, ginger, and salt in a bowl until smooth. Pour marinade over tenderloins, press air out of bag, seal, and refrigerate overnight.\nPreheat an outdoor grill for high heat.\nUse a paper towel to pat any excess marinade from the pork; allow to sit at room temperature while the grill is heating. Lightly oil grill grate. Cook pork 3 minutes on each side (on all four sides) for a total of 12 to 15 minutes. The pork will be done when it is no longer pink inside and has reached an internal temperature of 145 degrees F (65 degrees C). Remove from the grill and cover meat loosely with a foil tent. Let rest 5 minutes before serving.\n",
        "picture_link": ".vYOnFmJQKbzVmdtJtdwVAq7o8sePc2"
    },
    {
        "title": "Arroz con Leche",
        "ingredients": [
            "2 1/4 cups water ADVERTISEMENT",
            "1 1/2 cups short grain rice ADVERTISEMENT",
            "1 (1/4 inch x 3 inch) strip lime peel ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "2 tablespoons anise seed, crushed ADVERTISEMENT",
            "1 (12 ounce) can evaporated milk ADVERTISEMENT",
            "1 (14 ounce) can condensed milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup raisins (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 1/4 cups of water, rice, and lime peel in a saucepan. Bring to a boil over medium-high heat, then reduce heat to medium-low, cover, and simmer for 20 minutes until the rice is tender.\nWhile the rice is cooking, combine 1/2 cup of water, the cinnamon stick, and anise in another saucepan over medium-high heat. Bring mixture to a low boil for 3 minutes, then remove saucepan from stove. Strain flavored water into a bowl and set aside, discarding cinnamon stick and anise pieces.\nAfter rice has simmered for 20 minutes, carefully remove the lime peel with a slotted spoon, and over low heat, gradually stir evaporated milk and condensed milk into the rice. Mix in the cinnamon and anise-flavored water, vanilla, and salt. Add raisins, if desired. Continue to stir until the mixture thickens, about 7 to 10 minutes.\nIf the pudding is too watery after 10 minutes, turn up heat to medium-low and stir continuously. When pudding reaches desired consistency, remove from heat and pour into individual dishes, or a large bowl. Store in the refrigerator until ready to serve.\n",
        "picture_link": "wlNCZuYBhtD37ADURIMEAgDwJMxMuEO"
    },
    {
        "title": "Jesse's Ginger Salad Dressing",
        "ingredients": [
            "1 carrot, peeled and chopped ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons ground ginger ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine carrot, mayonnaise, ground ginger, soy sauce, and white sugar in a food processor. Blend until smooth.\n",
        "picture_link": "2SGvIRUGPaPtLVoJqo/5jM.cmK0YIbO"
    },
    {
        "title": "Tortilla Espanola (Spanish Tortilla)",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "2 pounds baking potatoes, peeled and cut into 1/4-inch slices ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 onions, sliced into rings ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 roasted red pepper, drained and cut into strips ADVERTISEMENT",
            "3 ounces Spanish serrano ham, chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh Italian parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/2 cup olive oil in a large skillet over medium-low heat. Add half of the potato slices, and cook, stirring occasionally, until just tender, 15 to 20 minutes. When done, remove potatoes to a large bowl, leaving oil in the skillet. Cook the remaining potatoes in the oil until tender, then add to the bowl, leaving oil in the skillet. Gently toss potatoes with salt and pepper to taste.\nMeanwhile, heat 2 tablespoons olive oil in a skillet over medium heat. Stir in onion rings, and gently cook until soft and golden brown, about 15 minutes. Spoon onions onto a plate, and allow to cool while the potatoes finish cooking.\nWhisk eggs in a large bowl until smooth. Stir in cooled onions, roasted peppers, and serrano ham. Gently fold in cooked potatoes.\nHeat the skillet with the reserved oil over low heat. Pour in the egg mixture, and gently cook until the sides have started to set and the bottom has turned golden brown, 8 to 10 minutes. Loosen the tortilla with a spatula if needed, then carefully slide onto a large plate. Turn the skillet upside down and place onto the uncooked side of the tortilla. Turn the skillet right-side-up, and remove the plate. Return the skillet to the stove, and continue cooking until the tortilla has set in the center, about 4 minutes.\nSlide the tortilla onto a serving plate and allow to cool to room temperature. Cut into six wedges and sprinkle with parsley to serve.\n",
        "picture_link": "EJdFsZrpD5xcUFxUxFtoamzsHbE162K"
    },
    {
        "title": "Banana Snack Cake",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. In a medium bowl, mix flour, oats, baking soda and salt together and set aside.\nIn a large bowl, cream butter and sugar until light and fluffy. Add eggs one at a time, mixing well with each addition. Mix in buttermilk, bananas and vanilla. Add flour mixture and mix well. Finally, fold in the nuts, coconut and 1 cup of the chocolate chips.\nPour batter into a 9x13 inch pan. Sprinkle top with remaining 1 cup of chocolate chips. Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes, or until a toothpick inserted into the cake comes out clean.\n",
        "picture_link": "44UnS.v8P1mtCodbVV6V.SKKtpza0ai"
    },
    {
        "title": "Clam Linguine",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "3 large tomatoes, diced ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1 (6.5 ounce) can minced clams, with juice ADVERTISEMENT",
            "1/2 pound linguine pasta ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, combine olive oil, butter, garlic, tomatoes and parsley; simmer and let reduce. Add some clam juice if the sauce reduces too much.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 3 minutes or until al dente; drain.\nAdd clams to the skillet and heat through; top with cheese and serve immediately.\n",
        "picture_link": "RMLYdfqKnRi/gGerfhkwRkTf4QPv9se"
    },
    {
        "title": "Applesauce Custard Pie",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups applesauce ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a medium mixing bowl combine butter or margarine, sugar, and eggs. Beat until smooth. Add applesauce and vanilla. Mix thoroughly.\nPour custard mixture into pie shell. Sprinkle top lightly with cinnamon.\nBake in preheated oven for 30 to 40 minutes or until set in center.\n",
        "picture_link": "Cr99asYgpA43VglbM.HDZ4bxiSa25zy"
    },
    {
        "title": "Catfish Creole",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked long-grain rice ADVERTISEMENT",
            "1 pound catfish fillets ADVERTISEMENT",
            "1 (16 ounce) can stewed tomatoes, with liquid ADVERTISEMENT",
            "2 teaspoons dried minced onion ADVERTISEMENT",
            "1 teaspoon chicken bouillon granules ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, bring the 2 cups of water to a boil. Stir in the rice and return to a boil; reduce the heat. Cover and simmer for 20 minutes or until the rice is tender and the water is absorbed.\nUsing a very sharp knife, cut the catfish into 3/4 inch pieces; set aside.\nIn a medium saucepan, combine the tomatoes (with juices), dried onions, bouillon granules, dried oregano, garlic powder and hot-pepper sauce; bring to a boil and stir in the catfish pieces.\nCover and cook over medium heat for 5 to 8 minutes or until the fish flakes easily when tested with a fork and is opaque all the way through.\nServe the fish mixture over the rice.\n",
        "picture_link": "tSWnaYG5iStipJHXs.I7VMvz6sUgTYS"
    },
    {
        "title": "Stuffed Flounder",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "1/2 large onion, minced ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1 stalk celery, minced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 pound crabmeat, shredded ADVERTISEMENT",
            "1/4 teaspoon Cajun seasoning ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "4 pounds whole flounder - cleaned, rinsed and dried ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large casserole dish or a baking sheet lined with tin foil.\nHeat butter over medium-low heat in a large saucepan. Stir in onion, green onions, bell pepper, celery and garlic. Cook slowly, stirring occasionally until onions are soft.\nRemove pan from heat and stir in shredded crabmeat, seasoning, bread crumbs, salt and pepper.\nRub flounder skin and cavity with butter. Stuff with crab mixture and place in prepared pan.\nBake for 30 minutes, or until flesh is firm and white at the thickest part of the fish.\n",
        "picture_link": "4Tr5NrFkzATT830p7h3bQH7au66AneK"
    },
    {
        "title": "Hot Fudge Sauce I",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, chopped ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine condensed milk, chocolate and salt in top of double boiler over rapidly boiling water. Stir and cook until chocolate melts and mixture thickens, about 10 minutes.\nRemove from heat and stir in water, a little at a time, until sauce reaches desired consistency. Cool slightly and stir in vanilla. Serve.\n",
        "picture_link": "CCShtMw4rXqOXxTlRKszE8g2KtbEDf6"
    },
    {
        "title": "Passover Chocolate Torte",
        "ingredients": [
            "1/2 cup pareve margarine ADVERTISEMENT",
            "8 ounces semisweet chocolate, chopped ADVERTISEMENT",
            "5 eggs, separated ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup ground almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line bottom and sides of a 9 inch springform pan with foil. Grease foil.\nMelt margarine and chocolate over low heat. Stir until smooth and let cool.\nIn a medium-size mixing bowl, beat whites until stiff; about 2 minutes. In a separate bowl, beat together yolks and sugar until thick and pale; about 1 minute. Blend in chocolate mixture and stir in almonds. Fold in beaten whites, 1/3 at a time, into chocolate until no streaks of white remain. Scrape into prepared pan.\nPlace an 8 inch baking pan with 1 inch of water in it on the bottom rack of the oven (to make the torte more moist).\nBake torte on center rack at 350 degrees F (175 degrees C) for 45 to 50 minutes, or until sides begin to pull away from pan and top is set in center. Cover the torte loosely with foil for the last 20 minutes of baking. Note: Don't worry if the cake cracks because the top will be on the bottom later.\nCool on wire rack for 10 minutes and then carefully remove sides of pan. Invert onto a serving plate and cool completely.\n",
        "picture_link": "OzPeeVLqm6ehLnRKQeYyV4WrenjObES"
    },
    {
        "title": "Potato Salad With Bacon, Olives, and Radishes",
        "ingredients": [
            "5 potatoes ADVERTISEMENT",
            "1 pound bacon ADVERTISEMENT",
            "2 stalks celery ADVERTISEMENT",
            "4 small green onions ADVERTISEMENT",
            "12 stuffed green olives ADVERTISEMENT",
            "5 radishes ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and peel the potatoes and cut into 1/2 to 3/4 inch pieces. Bring a large pot of salted water to a boil. Add the potatoes and cook until tender but still firm, about 10 minutes.\nSlice the bacon into small pieces and cook over medium high heat in a large, deep skillet until evenly brown. Do not overcook.\nChop the celery, green onions, stuffed olives and radishes into small pieces and put into a large bowl. Add the potatoes and bacon and mix together. Add the mayonnaise and lemon juice to taste, stir, and place in the refrigerator for a few hours to chill before serving. You may want to add a few sliced hard boiled eggs on top. ENJOY!!!\n",
        "picture_link": "AFf8kw7X4ZmRkokD2J7q1RonPpJtjmm"
    },
    {
        "title": "Black Bean and Rice Salad",
        "ingredients": [
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 large red bell pepper, chopped ADVERTISEMENT",
            "2 jalapeno peppers, minced ADVERTISEMENT",
            "3/4 cup lemon juice ADVERTISEMENT",
            "1 1/4 teaspoons dried cilantro ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn; drain and reserve liquid ADVERTISEMENT",
            "1 (15 ounce) can black beans; drain and reserve liquid ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 1/2 cups instant brown rice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine tomatoes, red bell pepper, jalapeno pepper, lemon juice, cilantro, basil, red pepper flakes, corn, and beans. Stir to combine the vegetables, then set aside.\nIn a medium saucepan, heat olive oil at a medium-low heat. Add onions and saute until they are translucent. Add garlic and saute for another minute. Pour in rice and toss to coat. Add reserved liquid from the corn and beans, along with any additional liquid as directed on the rice box. Cook the rice to package specifications. Let the rice cool slightly.\nCombine the rice and vegetable mixture. Salt and pepper to taste and serve.\n",
        "picture_link": "zW8.5GRhTC.yzuvfdOHOfl0KmpprtFK"
    },
    {
        "title": "Sauced Fish",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1 pound cod fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, combine butter, mayonnaise, sour cream and lemon juice.\nPlace cod fillets in a 8x8 inch baking dish. Pour mayonnaise mixture over fish.\nBake in a preheated oven for 30 minutes or until fish flakes easily with a fork.\n",
        "picture_link": "pIs8LZyPvpu/pnuEH/jrtHMuYODkMIa"
    },
    {
        "title": "Cajun Blackened Redfish",
        "ingredients": [
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon lemon pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups Italian-style salad dressing ADVERTISEMENT",
            "4 (4 ounce) fillets red drum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium saucepan, melt the butter on low heat; cool to room temperature. Meanwhile, in a medium bowl, combine the cayenne pepper, black pepper, lemon pepper, garlic powder and salt. Set aside.\nDip the filets into the melted butter, then coat with the seasoning mixture.\nIn a large skillet over high heat, sear fish on each side for 2 minutes or until slightly charred.\nPlace in a 11x7 inch baking dish and pour the Italian dressing onto each filet. Cover baking dish and bake in a preheated oven for 30 minutes or until flaky and tender.\n",
        "picture_link": "a5tSO3paCRkJPP78VTPaxR05wgAMXlC"
    },
    {
        "title": "Easy Beer and Ketchup Meatballs",
        "ingredients": [
            "1 (28 ounce) bottle ketchup ADVERTISEMENT",
            "24 fluid ounces beer ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace the beer and ketchup in a slow cooker on high setting and allow to simmer..\nMeanwhile, in a large bowl, combine the ground beef, garlic powder and onion, mixing well. Form mixture into meatballs about 3/4 inch in diameter. Place meatballs in a 9x13 inch baking dish.\nBake at 400 degrees F (200 degrees C) for 20 minutes.\nTransfer meatballs to the slow cooker with the beer and ketchup and simmer for 3 hours; sauce will thicken.\n",
        "picture_link": "mLiE3/P1Ag42K425/MN92Ds/A8kJZYy"
    },
    {
        "title": "Basil, Roasted Peppers and Monterey Jack Cornbread",
        "ingredients": [
            "1/2 cup unsalted butter, chilled and cubed ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 3/4 cups cornmeal ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 cups shredded pepperjack cheese ADVERTISEMENT",
            "1 1/3 cups frozen corn kernels, thawed and drained ADVERTISEMENT",
            "2 ounces roasted marinated red bell peppers, drained and chopped ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Butter a 9x9x2 inch baking pan.\nMelt 1 tablespoon butter in medium nonstick skillet over medium-low heat. Add onion and saute until tender, about 10 minutes. Cool.\nMix cornmeal with the flour, baking powder, sugar, salt, and baking soda in large bowl. Add 7 tablespoons butter and rub with fingertips until mixture resembles coarse meal.\nWhisk buttermilk and eggs in medium bowl to blend. Add buttermilk mixture to dry ingredients and stir until blended. Mix in cheese, corn, red peppers, basil, and onion. Transfer to prepared pan.\nBake cornbread until golden and tester inserted comes out clean, about 45 minutes. Cool 20 minutes in pan. Cut cornbread into squares.\n",
        "picture_link": "894.92YDSOrrWvDLSp90i/Xnkm92MTS"
    },
    {
        "title": "Parsley Potatoes",
        "ingredients": [
            "1 1/2 pounds new red potatoes ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel a strip of skin from around the center of each potato, place the potatoes in cold water. Set aside.\nHeat oil in a large skillet over medium high heat. Saute onion and garlic for 5 minutes or until tender. Pour in broth and 3/4 cup of the parsley; mix well. Bring to a boil.\nPlace the potatoes into a large pot full of salted water. Bring the water to a boil; then reduce heat. Simmer covered, for 10 minutes or until the potatoes are tender.\nRemove potatoes with a slotted spoon to a serving bowl. Sprinkle the black pepper into the skillet and stir.. Pour the peppered sauce over potatoes and sprinkle with remaining parsley.\n",
        "picture_link": "vlDpMfdUgA2y6KxVqRg5emPh459PW4y"
    },
    {
        "title": "Amish Cinnamon Bread",
        "ingredients": [
            "1 cup Amish Friendship Bread Starter ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 (3 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup peeled, cored and chopped apple ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease three 9x5 inch loaf pans.\nPlace the starter in a bowl, stir in the oil, sugar, eggs and vanilla and mix well.\nCombine the flour, baking soda, baking powder, instant pudding, and cinnamon. Add the flour mixture to the starter mixture and beat by hand. Add the pecans, raisins and apples and mix well. Pour batter into the prepared pans.\nBake at 325 degrees F (165 degrees C) for 1 hour.\n",
        "picture_link": "ME8td.nWDe7PLFurZ5qfdGUXBt9FBAC"
    },
    {
        "title": "Gingerbread Waffles with Hot Chocolate Sauce",
        "ingredients": [
            "1 cup light molasses ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, heat molasses and 1/2 cup butter until almost boiling. Remove from heat and let cool slightly. Stir in baking soda, milk and egg.\nIn a large bowl, sift together flour, ginger, cinnamon and salt. Make a well in the center and pour in the molasses mixture. Mix until smooth.\nSpray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown. Serve hot with chocolate sauce.\nTo make chocolate sauce: In a saucepan, combine water, 1 cup sugar, cornstarch, cocoa powder and 1 teaspoon salt. Cook over medium heat, stirring constantly, until mixture comes to a boil. Remove from heat and add vanilla and 2 tablespoons butter; stir until smooth.\n",
        "picture_link": "ZAxxna./21hjzkXNSZrPwfAGL4oFMse"
    },
    {
        "title": "Flan I",
        "ingredients": [
            "8 eggs ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Have ready 9 inch round cake pan.\nIn blender or food processor, or using electric mixer, combine eggs, condensed milk and vanilla and blend until smooth. In medium sauce pan, cook sugar, stirring constantly, until it liquefies. When it starts to turn light brown, remove from heat and pour into waiting pan. Pour egg mixture over liquid sugar.\nLine a roasting pan with a damp kitchen towel. Place baking dish on towel, inside roasting pan, and place roasting pan on oven rack. Fill roasting pan with water to reach halfway up the sides of the baking dish.\nBake 70 minutes in the preheated oven, or until knife inserted in center comes out clean. Remove pan from water bath and let cool completely, about 1 hour. Run a knife along the edge of the pan, place a serving plate on top and invert. Serve.\n",
        "picture_link": "pgrfXXmqIEEIhBBp20tRiq0dg9bxEMO"
    },
    {
        "title": "Molasses Banana Bread",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup molasses ADVERTISEMENT",
            "2 cups mashed banana ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, cream the butter. Beat in egg, molasses and banana. Mix in whole wheat flour, all-purpose flour, baking soda, salt, nutmeg and walnuts; stir until well blended. Pour batter into prepared pan.\nBake in preheated oven for 55 to 65 minutes, or until a toothpick inserted into center of the loaf comes out clean.\n",
        "picture_link": "dFQC3kRlFZddeQjZCiUZkiJyIUKV3ES"
    },
    {
        "title": "Potato Croquettes",
        "ingredients": [
            "4 cups mashed potatoes ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1/2 cup grated Romano cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons imitation bacon bits ADVERTISEMENT",
            "1 teaspoon dried onion flakes ADVERTISEMENT",
            "1 cup Italian-style dried bread crumbs ADVERTISEMENT",
            "1 quart vegetable oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine mashed potatoes, eggs, parsley, cheese, salt and pepper, bacon bits and onion flakes. Form mixture into patties, and dredge patties in the bread crumbs.\nPour oil 1/2 inch deep in a large, heavy skillet. Heat oil over medium-high heat. Fry patties, flipping to fry them on both sides, until they are golden brown. Serve hot.\n",
        "picture_link": "aeVpj6sPIX/K36bnqwXM1bT1KJFHwGC"
    },
    {
        "title": "Fudge Cake",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter or margarine and sugar together in a large bowl. Add vanilla, and then eggs to the mixture.\nIn another bowl, mix together flour, soda, baking powder, and salt. Sour the milk by adding the lemon juice or vinegar. Add flour mixture alternately with soured milk to the creamed mixture.\nMix cocoa and hot water together, and beat into batter.\nBake 30 to 35 minutes at 350 degrees F (175 degrees C). Cool, and frost with desired frosting.\n",
        "picture_link": "1hXqiP1/pjp6.sLVLIMz4ckSF3HenqO"
    },
    {
        "title": "Old Time Popcorn Balls",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "5 quarts popped popcorn ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter the sides of a large saucepan. In the sauce pan combine the sugar, water, salt, corn syrup and vinegar. Cook over medium heat to the hard ball stage 250 degrees F (120 degrees C). Stir in the vanilla and slowly pour the hot mixture over the popped popcorn, stirring just to mix well.\nButter hands lightly and shape into balls. Mixture will be hot so be careful. Place balls on waxed paper to cool.\n",
        "picture_link": "fWit0edFumv7/7oUIyxsevQIllCmlyC"
    },
    {
        "title": "Chocolate Cake I",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup grated semisweet chocolate ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "2 cups cake flour ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degree F (175 degrees C). Grease and flour one 9 x 13 inch pan.\nGrate the chocolate. In a small saucepan, boil the milk and chocolate until mixture forms a custard.\nCream the butter or margarine and sugar. Add eggs and sour cream to the creamed mixture.\nDissolve the baking soda in water, and add to the creamed mixture. Add the flour, and mix thoroughly. Add the chocolate mixture and beat well. Pour into a greased and floured 9x13 inch pan.\nBake at 350 degrees F (175 degrees C) for 40 minutes to one hour.\n",
        "picture_link": "coqWRTB2Xfdh27N9zh5GNy5/I3A3c6y"
    },
    {
        "title": "Apple and Spice Cookies",
        "ingredients": [
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/3 cups packed brown sugar ADVERTISEMENT",
            "1/3 cup apple juice ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 cup chopped apples ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together shortening and brown sugar. Stir in flour, baking soda, salt and spices until dampened. Stir until smooth. Mixture will be very thick.\nStir in nuts, apples and raisins.\nDrop by tablespoon 2 inches apart on a lightly greased cookie sheet. Bake 8 to 10 minutes in a 400 degree F (205 degrees C) oven. Let cool slightly, remove from cookie sheet.\n",
        "picture_link": "i5t3S1mJ8rmHSPQjeKq4H.d1vCtfle2"
    },
    {
        "title": "Jerk Chicken and Pasta",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 teaspoons jerk paste ADVERTISEMENT",
            "1 (12 ounce) package uncooked egg noodles ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1 tablespoon jerk paste ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "2 limes, quartered ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "4 sprigs fresh cilantro, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub each breast half with 1/2 teaspoon jerk paste, and place in a shallow dish. Cover, and refrigerate at least 1 hour.\nPreheat the grill for high heat. Bring a large pot of lightly salted water to a boil, cook the egg noodles 6 to 8 minutes, until al dente, and drain.\nLightly oil the grill grate. Grill chicken 8 to 10 minutes on each side, until juices run clear.\nMeanwhile, heat the olive oil in a large saucepan over medium heat, and cook the garlic for one minute. Mix in the chicken stock, 1 tablespoon jerk paste, white wine, chopped cilantro, juice of 1 lime, salt, and pepper. Bring to a boil, reduce heat to low, and stir in the heavy cream. Cook and stir until mixture is thickened, about 5 minutes. Do not allow it to boil.\nPour the cooked egg noodles into the saucepan, and toss with the cream sauce. Divide noodles onto 4 serving plates, and top with grilled chicken. Garnish each serving with a cilantro sprig and the juice of 1/4 lime.\n",
        "picture_link": "OocSifcYt4TgfLpBLxbXJ6MVFRT01L2"
    },
    {
        "title": "Cream of Broccoli Soup IV",
        "ingredients": [
            "2 1/2 cups fresh chopped broccoli, steamed and divided ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/4 cups chicken broth, divided ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3 cups skim milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor puree 1 cup steamed broccoli, garlic, and 1/4 cup chicken broth.\nIn a large saucepan over medium heat, melt the margarine. Add the flour, and stir until mixture thickens and starts to brown.\nSlowly add remaining 1 cup chicken broth and milk, stirring often. Allow mixture to thicken, about 5 minutes. Then add the puree mixture and the remaining 1 1/2 cups steamed broccoli. Heat through, and allow to thicken for about 5 minutes. Season with salt and pepper.\n",
        "picture_link": "V7xDN.HqU/2roFD5ZeuSFG5nrLDeXqa"
    },
    {
        "title": "Cream Cheese Cookies III",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "8 ounces cream cheese ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCream together butter and sugar. Add flour and nuts. Pat into a 9 x 9 pan. (Reserve some for top.) Bake for 12 minutes.\nCream together cream cheese, sugar and add remaining ingredients Pour on top of crust. Sprinkle reserved crumbs over top. Bake for 20 minutes. Let cool.\n",
        "picture_link": "yCeBmimOY2hL2xgYA24lz5btoAHkltC"
    },
    {
        "title": "Chicken Continental",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 1/2 cups instant rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, brown the chicken and mushrooms in butter or margarine. Stir in the soup, water, parsley, salt and a dash of ground black pepper. Cover and simmer for 20 minutes.\nStir in uncooked rice and simmer for an additional 10 minutes, or until liquid has been absorbed.\n",
        "picture_link": "vYO/4risVXInVBb/0SMP25vubO1TZlO"
    },
    {
        "title": "Better than Grandma's Brownies",
        "ingredients": [
            "6 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 3/4 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F. Grease and flour a 9x13 inch baking pan.\nIn double boiler over low heat, melt the chocolate and butter together, stirring frequently until smooth. Remove from heat and let cool.\nIn a large mixing bowl, mix together eggs, vanilla, salt and sugar. Beat with an electric mixer for 8 to 10 minutes. Slowly pour in chocolate mixture and flour. Stir in the walnuts. Spread batter evenly in the prepared pan\nBake for 17 to 20 minutes in the preheated oven, until the top is crackled. Let cool for 2 hours before cutting into squares.\n",
        "picture_link": "dw6Fo2GZ13LoUuASojzcAfknd8GjBhe"
    },
    {
        "title": "Haystacks I",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3 1/2 cups quick cooking oats ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1/2 cup chopped peanuts ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan bring sugar, cocoa, milk and butter or margarine to a boil. Remove from heat.\nStir in oats, coconut, nuts and salt. Drop quickly from teaspoon on wax paper. Let cool.\n",
        "picture_link": "cfyQ4RkuqYv7l4NHpHywiYL.qxYqdCS"
    },
    {
        "title": "Old Fashioned Hard Candy",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup light corn syrup ADVERTISEMENT",
            "1/2 teaspoon peppermint extract ADVERTISEMENT",
            "1 drop red food coloring (optional) ADVERTISEMENT",
            "1/8 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a heavy 2 quart saucepan, combine the sugar, water and corn syrup. Cook, stirring constantly until the sugar is dissolved; then cook without stirring, lowering the heat and cooking more slowly during the last few minutes, to the hard crack stage (300 degrees F), If sugar crystals form on sides of pan, wipe them off with a damp brush.\nRemove from heat, add oil flavoring and enough food coloring to color; stir only to mix. Pour into 2 well buttered 9 inch pans. Set one pan of candy over a sauce pan containing hot water (unless you have a helper to help cut the candy). As soon as the other pan of candy is cool enough to handle, cut it with scissors into 1-inch strips. Then snip the strips into pieces. Work fast. Drop the pieces onto a buttered baking sheet. If the candy cools too quickly, set it on a saucepan over hot water to soften it, but if it gets sticky, return at once to the work counter.\nToss in a small amount of powdered sugar to keep from sticking together. Repeat with the second pan of candy.\n",
        "picture_link": "DNIZgKy2SIjSHb0CtYm99lMmQnOxWbK"
    },
    {
        "title": "Chocolate Biscotti",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (180 degrees C).\nIn a large bowl, combine all the ingredients except the almonds; mix well with a spoon. Stir in the almonds until well blended; the dough will be thick and sticky.\nPlace half of the dough on a 10 x 15 inch rimmed cookie sheet that has been coated with nonstick baking spray. Form a slightly rounded 4 x 12 inch loaf that is about 3/4 inch thick. Repeat with the remaining dough on a second cookie sheet and bake for 30 minutes.\nRemove from the oven and reduce the temperature to 325 degrees F (170 degrees C). Allow the loaves to cool for 20 to 25 minutes, then cut into 1/2 inch thick slices. Lay the slices cut side down on the cookie sheets and bake for 15 more minutes. Turn the cookies over and bake another 15 minutes or until very crisp. Allow to cool, then store in an airtight container. Will keep several weeks.\n",
        "picture_link": "cIfogh1v5fmvWaEJUkkK7oR7FGH9tXy"
    }
]