[
    {
        "title": "Peanut Butter, Bacon and Apple Sandwiches",
        "ingredients": [
            "2 tablespoons peanut butter ADVERTISEMENT",
            "2 slices white bread, toasted ADVERTISEMENT",
            "3 slices crispy bacon ADVERTISEMENT",
            "1/2 apple, cored and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread peanut butter onto one side of one slice of toast. Place slices of bacon onto the peanut butter and then the apple slices. Top with the other slice of bread.\n",
        "picture_link": "nF5HW74dhxQgFlYAFJG94rnJCrU4cwW"
    },
    {
        "title": "Superb Cranberry Sauce with Apples and Pears",
        "ingredients": [
            "5 (3 inch) cinnamon sticks ADVERTISEMENT",
            "8 whole allspice berries ADVERTISEMENT",
            "8 whole cloves ADVERTISEMENT",
            "6 cups fresh cranberries ADVERTISEMENT",
            "2 1/4 cups orange juice ADVERTISEMENT",
            "4 Gala apples, peeled, cored and diced ADVERTISEMENT",
            "4 Bosc pears, peeled, cored and diced ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cinnamon sticks, allspice berries, and cloves onto the center of a 8 inch square piece of cheesecloth. Gather together the edges of the cheesecloth, and tie with kitchen twine to secure. Place the sachet into a large saucepan along with the cranberries and orange juice. Bring to a boil over high heat, and cook until the berries begin to burst, about 10 minutes.\nStir in the apples, pears, white sugar, and brown sugar. Return to a boil, then reduce heat to medium-low, and simmer about 25 minutes until the apples and pears are slightly soft. Remove and discard the spice sachet. Scrape the sauce into a bowl, cover, and refrigerate overnight. Serve cold.\n",
        "picture_link": "OftTABNu6sOHW97SmJrOllOdwuocY0m"
    },
    {
        "title": "Cranberry Relish with Grand Marnier® and Pecans",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/4 cup brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "4 cups fresh cranberries ADVERTISEMENT",
            "1/2 cup chopped toasted pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the sugar, orange liqueur, orange juice, ginger, and orange zest to a boil in a saucepan over medium-high heat. Stir until the sugar has dissolved, then stir in the cranberries, and cook until they pop, about 5 minutes. Add the pecans, pour into a bowl, and refrigerate several hours until cold.\n",
        "picture_link": "U9sx6fv0ls1uBkyBw7MosPYmWBZnVEC"
    },
    {
        "title": "Byrdhouse Spinach Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "1 (8 ounce) package sliced mushrooms ADVERTISEMENT",
            "1/2 cup dry sherry ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 quart milk ADVERTISEMENT",
            "2 bunches fresh spinach, cleaned and chopped ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "8 ounces cooked small shrimp ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium heat. Whisk in flour, and cook until the mixture turns a darker yellow color, about 5 minutes. Stir in the mushrooms, and cook for 2 minutes.\nWhisk in the sherry, chicken broth, and milk, then add the spinach, green onion, nutmeg, salt, and pepper. Bring to a boil over high heat, whisking constantly, then reduce heat to medium low, and simmer until the spinach is tender, 15 to 20 minutes. Garnish with shrimp to serve.\n",
        "picture_link": "VO3TE/To01EBdno6O5zLvHkVZsiyjHu"
    },
    {
        "title": "Dad's Potato Soup",
        "ingredients": [
            "4 large potatoes, cubed ADVERTISEMENT",
            "6 stalks celery, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "4 cups water, or as needed ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon instant mashed potato flakes, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potato cubes, celery, and onion into a pressure cooker and add 4 cups of water, or enough to reach the fullness mark on your cooker. (Follow manufacturer's directions for how full to fill your cooker.) Cover the cooker, seal, and bring the pressure up over medium heat. When cooker reaches full pressure, reduce heat to maintain the pressure, and pressure-cook the vegetables for 25 minutes.\nAllow the pressure in the cooker to subside, and release the cover on the cooker when the pressure is normal. Mix in the evaporated milk, butter, salt, and black pepper, and bring the soup to a boil over medium heat. Reduce heat to a simmer, and cook the soup to the desired thickness, 5 to 15 minutes. If you like a thicker soup, mix in mashed potato flakes to desired consistency.\n",
        "picture_link": "OOMW.GncpJXdTDg6XdfuXGpWTY0ryWy"
    },
    {
        "title": "Tortilla Rollups ",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "14 (10 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese, sour cream, green onions, and taco seasoning in a bowl until well blended. Spread a thin layer of the cream cheese mixture onto each tortilla. Roll each tortilla tightly to create a long tube. Spread more of the cream cheese mixture on the edges of the tortilla to seal. Freeze rolls on a baking sheet for 20 minutes for easier slicing. Cut each roll into 1-inch pieces and thaw before serving.\n",
        "picture_link": "8J1w/woX/8lBD7qvvGyUkPIx8ja5mFG"
    },
    {
        "title": "Lobster Dipping Sauce",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons dried cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon of butter in a saucepan over medium heat. Add the garlic; cook and stir until starting to brown, about 3 minutes. Add the remaining butter and reduce heat to low. Stir to melt the butter, then mix in the lemon juice, pepper and cilantro. Let it steep over low heat for about 10 minutes. Strain before serving if desired.\n",
        "picture_link": "hV2Dy9zkDFjIJ4O9zrdyBlpmWzs0eKW"
    },
    {
        "title": "White Pizza a la Chick Lit",
        "ingredients": [
            "1 (12 inch) pre-baked thin pizza crust ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil, divided ADVERTISEMENT",
            "3 cups shredded mozzarella cheese ADVERTISEMENT",
            "8 cloves garlic, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (230 degrees C).\nPlace the pizza crust on a baking sheet and drizzle with 1 tablespoon of olive oil. Sprinkle the mozzarella cheese evenly over the crust and top with pieces of garlic.\nBake in the preheated oven until cheese is bubbly and starting to brown, about 15 minutes. Drizzle with a little bit more olive oil and cut into wedges to serve.\n",
        "picture_link": "4Nq7UOMSMaFbZy8ux.MxHqZDP47wnd6"
    },
    {
        "title": "ECU Tailgate Wings",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup minced fresh ginger root ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 limes, quartered ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "3 pounds chicken wings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the water, soy sauce, Worcestershire sauce, ginger, sugar, limes, and red pepper in a gallon-sized sealable bag; seal and shake to combine. Add the chicken wings; refrigerate 24 to 48 hours.\nPreheat an outdoor grill for medium-low heat and lightly oil grate.\nDrain the marinade from the wings and discard. Cook the wings on the heated grill, turning occasionally, until juices run clear, 25 to 30 minutes.\n",
        "picture_link": "JUtyW8u1WE8czshz5T9hz2g2pwjqcj."
    },
    {
        "title": "Oven Baked Vegetables",
        "ingredients": [
            "1 vegetable cooking spray ADVERTISEMENT",
            "2 potatoes, cubed ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "2 onions, sliced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/3 cup fat free Italian-style dressing ADVERTISEMENT",
            "1/8 teaspoon garlic salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/8 teaspoon onion salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9 x 13 inch baking pan with cooking spray.\nIn prepared pan combine potatoes, carrots, onions and bell pepper.\nIn a small bowl combine Italian dressing, garlic salt, cayenne pepper and onion salt. Pour over vegetables.\nBake, covered, for 15 minutes. Uncover, stir and bake for 10 minutes more.\n",
        "picture_link": "9pveC1DcZITMiDsXrdPmDMBWdee.t7e"
    },
    {
        "title": "Mrs. Baker's Sticky Cinnamon Rolls",
        "ingredients": [
            "2/3 cup sugar ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine 2/3 cup sugar, shortening, salt and 1 cup boiling water; set aside.\nIn a large bowl, dissolve yeast in 1/2 cup warm water. Add eggs and the water/sugar mixture; beat well. Beat in 2 cups flour. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. Mix until a stiff dough has formed. Cover with a damp towel and let rise until doubled, about 45 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Lightly grease three 8x8 inch baking pans.\nIn a small bowl, combine 1 cup sugar and 1 tablespoon cinnamon. Roll dough into small balls. Dip balls in melted butter, then roll in cinnamon sugar. Roll balls into 4 inch long cylinders and tie into knots. Place knots into prepared pans.\nBake in preheated oven for 15 minutes, until golden. Serve warm.\n",
        "picture_link": "1oP1vbmirq6znvdR9uPQX4TCs6Gziqi"
    },
    {
        "title": "David's Mesquite Smoked Texas Brisket",
        "ingredients": [
            "8 pounds beef brisket ADVERTISEMENT",
            "15 cloves garlic, peeled ADVERTISEMENT",
            "1/4 cup Greek-style seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make deep cuts into the brisket with a paring knife. Place cloves all the way into the cuts. Liberally sprinkle brisket with Greek seasoning.\nPlace mesquite wood over gray/hot charcoals.\nPut brisket fat side down on the grill. Smoke for 2 hours and do not turn the meat.\nTake the meat out and wrap tightly 2 times in extra heavy aluminum foil. Put in the oven for 2 hours on a cookie sheet at 250 degrees F.\nRemove from oven and let sit (still wrapped in foil) 30 minutes to 1 hour before serving to let the meat \"firm up\" and the juice to be absorbed.\n",
        "picture_link": "QB31SzBV7tiGCQdYVHnt97AiW0NeaSy"
    },
    {
        "title": "Perfect Party Punch",
        "ingredients": [
            "1 (64 fluid ounce) bottle fruit punch ADVERTISEMENT",
            "2 (15 ounce) cans pineapple chunks ADVERTISEMENT",
            "1 pint strawberries, hulled and sliced ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "2 pints fruit flavored sherbet ADVERTISEMENT",
            "1 (2 liter) bottle lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large punch bowl, pour fruit punch. Add pineapple chunks, strawberries and bananas. Slide in the sherbet and slowly pour in the lemon-lime soda.\n",
        "picture_link": "svFaIcintNhFx7b2XGbkbEtP7eVgQv2"
    },
    {
        "title": "Genuine Egg Noodles",
        "ingredients": [
            "2 cups Durum wheat flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, salt and baking powder. Mix in eggs and enough water to make the dough workable. Knead dough until stiff. Roll into ball and cut into quarters. Using 1/4 of the dough at a time, roll flat to about 1/8 inch use flour as needed, top and bottom, to prevent sticking. Peel up and roll from one end to the other. Cut roll into 3/8 inch strips. Noodles should be about 4 to 5 inches long depending on how thin it was originally flattened. Let dry for 1 to 3 hours.\nCook like any pasta or, instead of drying first cook it fresh but make sure water is boiling and do not allow to stick. It takes practice to do this right.\n",
        "picture_link": "8WFk4PrjetScLXEkeg2uMV32JcpKKWG"
    },
    {
        "title": "Cheese Easy Squares",
        "ingredients": [
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/3 onion, grated, juice reserved ADVERTISEMENT",
            "1 (1 pound) loaf cocktail rye bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the Parmesan cheese, mayonnaise, onion and reserved onion juice in a blender or food processor. Blend thoroughly. Spread the mixture evenly on slices of cocktail rye bread.\nPlace cocktail rye bread slices on a large baking sheet. Bake in the preheated oven 10 minutes, or until lightly toasted.\n",
        "picture_link": "KzdaBcpj6mkNMvm5zv6AcZBDs/PY5Va"
    },
    {
        "title": "Ma's Premium Ice Cream Pie",
        "ingredients": [
            "1 pint chocolate ice cream, softened ADVERTISEMENT",
            "1 pint double chocolate fudge ice cream, softened ADVERTISEMENT",
            "1 (12 ounce) jar hot fudge topping ADVERTISEMENT",
            "1 (9 inch) prepared chocolate cookie crumb crust ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 tablespoon chocolate sprinkles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread the chocolate ice cream into pie crust in an even layer. Freeze for 15 to 20 minutes, or until set. Remove pie from freezer and spread on a layer of hot fudge. You may make this layer as thick as you wish. It is usually difficult to spread, but DO NOT heat the fudge as it will melt the ice cream layer underneath. Immediately freeze again for 15 minutes, or until set.\nRemove pie from freezer and spread the double fudge ice cream on top of the fudge layer. (if ice cream is too soft, put back in freezer for a few minutes -- but DON'T LET PIE THAW or the layers will run together!) After adding the second ice cream layer, freeze again until set.\nSpread on a layer of whipped topping, and garnish top with chocolate sprinkles. Return pie to freezer until ready to serve.\n",
        "picture_link": "JQybDrUwHXaFJJNQ02B30U3D9ZtPYqO"
    },
    {
        "title": "Company Casserole",
        "ingredients": [
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 (7 ounce) cans tomato sauce with mushrooms ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup cottage cheese ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a skillet over medium heat, brown the ground beef with the onion until no pink shows; drain. Mix in 1 of the cans of tomato sauce, salt, pepper and cinnamon. Pour into shallow 3 quart casserole baking dish.\nPour in noodles in an even layer. Top with cottage cheese; sprinkle with onions and Cheddar cheese. Pour on remaining can of tomato sauce.\nBake in a preheated over for 30 minutes.\n",
        "picture_link": "ubvf8U7Cav8NmwqkDS4VfNrmJmQ4mem"
    },
    {
        "title": "Savory Pumpkin Soup",
        "ingredients": [
            "5 cups pumpkin puree ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "4 ounces dry pasta ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/2 cup fresh parsley, minced ADVERTISEMENT",
            "1/4 cup cilantro, minced ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/2 cup sour cream, for topping ADVERTISEMENT",
            "1/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup toasted almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, mix the pumpkin, vegetable broth, heavy cream, garlic powder and onion powder. Bring to a boil. Stir in the pasta. Cook 12 minutes, or until pasta is tender but firm. Reduce heat to simmer.\nStir in pumpkin pie spice, parsley and cilantro. Slowly stir butter, plain yogurt and sour cream into the mixture, making sure they do not curdle. Stir in the cheese, allowing it to melt. Serve topped with nuts.\n",
        "picture_link": "/ETuW23hYF6CppDgP0VAolxZMzoh/Si"
    },
    {
        "title": "Platski",
        "ingredients": [
            "4 large potatoes, grated ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl combine potatoes, onion powder, garlic powder, salt, paprika, flour and pepper. Mix very well.\nCoat a medium skillet with oil and heat on medium-high. Using a fork or spoon quickly spread a thin layer of potato mixture over the entire bottom of the pan. Make the pancake as thin as possible, without gaps or holes. Fry for 2 minutes, or until golden brown. Flip with a spatula and cook on the other side.\nRepeat with remaining potato mixture.\n",
        "picture_link": "ogthrERXIcGbhCeplVXC6APuJTmIhwG"
    },
    {
        "title": "Angel Lush with Pineapple from DOLE®",
        "ingredients": [
            "1 (20 ounce) can DOLE® Crushed Pineapple, undrained ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding ADVERTISEMENT",
            "1 cup thawed whipped topping ADVERTISEMENT",
            "1 (10 ounce) package round angel food cake, cut into 3 layers ADVERTISEMENT",
            "Seasonal berries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix pineapple and dry pudding mix in medium bowl. Gently stir in whipped topping.\nStack cake layers on plate, spreading pudding mixture between layers and on top of cake.\nRefrigerate 1 hour or until ready to serve. Garnish with your favorite seasonal berries.\n",
        "picture_link": "bjH6jvhHvZUfkWBvHHzyJOX7B/HDAxC"
    },
    {
        "title": "One Pot Thai-Style Rice Noodles",
        "ingredients": [
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 1/2 tablespoons water ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "2 1/2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 tablespoon chile-garlic sauce (such as Sriracha®), or more to taste ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 (16 ounce) package thick rice noodles ADVERTISEMENT",
            "1 cup sliced zucchini ADVERTISEMENT",
            "1 cup sliced red bell pepper ADVERTISEMENT",
            "2 cooked chicken breasts, cut into 1-inch cubes ADVERTISEMENT",
            "1/4 cup crushed peanuts (optional) ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cornstarch and water together in a small bowl until smooth. Pour chicken broth into a large pot and stir cornstarch mixture, soy sauce, fish sauce, rice vinegar, chile-garlic sauce, vegetable oil, ginger, garlic, and coriander into broth. Cover and bring to a boil.\nPlace rice noodles in the boiling sauce, reduce heat to medium, and simmer until noodles are tender, 5 to 10 minutes. Stir zucchini, red bell pepper, and chicken into sauce. Bring back to a boil, cover, and simmer until vegetables are just become tender, about 5 more minutes.\nRemove from heat and let stand, covered, for 5 minutes to thicken. Serve garnished with crushed peanuts and cilantro.\n",
        "picture_link": "wfDFkmISyXydnHPvoChYJUfXgLu58zq"
    },
    {
        "title": "Swiss Chard and Pecan Pesto",
        "ingredients": [
            "1/2 cup olive oil, divided ADVERTISEMENT",
            "10 leaves Swiss chard, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 cup basil leaves ADVERTISEMENT",
            "1 cup pecans ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 (3 ounce) package grated Parmesan cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 teaspoons of the olive oil in a skillet over medium heat; cook and stir the Swiss chard and garlic in the hot oil until the chard leaves have wilted, 3 to 5 minutes. Remove from heat and allow to cool.\nProcess the basil, pecans, sea salt, Parmesan cheese, and remaining olive oil in a food processor until all the ingredients are well integrated. Add the Swiss chard mixture and the lemon juice to the food processor; continue chopping until the mixture is pureed. Season with salt and pepper.\n",
        "picture_link": "NcNtJ23tQZQUSPeGfwrEKdACFiRR8WO"
    },
    {
        "title": "Raisin Bread French Toast Casserole",
        "ingredients": [
            "5 cups cubed cinnamon raisin bread ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons softened butter, cut into chunks ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly butter an 8x8-inch baking pan.\nPour bread cubes into the prepared pan.\nBeat milk, eggs, sugar, and vanilla extract together in a bowl until evenly mixed; pour mixture over bread cubes. Arrange butter chunks atop bread mixture. Set aside for bread to absorb liquid, about 10 minutes. Sprinkle with cinnamon.\nBake in the preheated oven until top is golden, 45 to 50 minutes.\n",
        "picture_link": "pghSrDYf3KUnYVXvj2FD6ygY1uw2uq6"
    },
    {
        "title": "Bob's Little Known, Less Cared About Chili",
        "ingredients": [
            "1/2 pound thick-cut bacon, chopped ADVERTISEMENT",
            "1 large yellow onion, chopped ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "3 (15.5 ounce) cans kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/4 cup chili powder ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 dash hot pepper sauce (such as Tabasco®), or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon and onion together in a large pot over medium heat until the onion is translucent, about 5 minutes. Add ground beef, garlic and cumin to the pot; cook and stir until the beef is completely browned, 7 to 10 minutes.\nStir kidney beans, diced tomatoes, water, chili powder, liquid smoke, salt, black pepper, and hot pepper sauce into the beef mixture; bring to a simmer and cook until thick, about 1 hour. Skim excess grease if desired.\n",
        "picture_link": "CqLdpxCO0gUewZ6Ip.LF8crgefhBIJG"
    },
    {
        "title": "Josephine's No-Bake Granola Bars",
        "ingredients": [
            "1/2 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups quick-cooking rolled oats ADVERTISEMENT",
            "1 1/2 cups crispy rice cereal ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease an 8-inch glass baking dish.\nBring brown sugar and honey to a boil in a saucepan, stirring constantly. Remove from heat and stir peanut butter and vanilla into the sugar mixture.\nMix oats, rice cereal, raisins, coconut, and sunflower nuts in a large bowl; add peanut butter mixture and blend. Press mixture into the prepared pan.\nCool mixture completely before cutting into bars.\n",
        "picture_link": "9lc1LaQneseNztKRbM/KTgJE959sTvG"
    },
    {
        "title": "Crunchy Almond Biscotti",
        "ingredients": [
            "1 cup blanched slivered almonds ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spread almonds on a baking sheet.\nToast almonds in the preheated oven until lightly browned and fragrant, 8 to 10 minutes. Allow almonds to cool.\nReduce oven heat to 300 degrees F (150 degrees C). Lightly grease a baking sheet.\nLightly beat eggs, vanilla extract, and almond extract in a bowl. Combine flour, sugar, baking powder, and salt in another bowl. Gradually beat egg mixture into flour mixture with an electric mixer until dough comes together. Add toasted almonds and mix until just incorporated.\nTurn dough out on a lightly floured surface and shape dough into a 3x14-inch log. Transfer log to prepared baking sheet.\nBake in the preheated oven until firm to the touch, 30 to 40 minutes. Allow log to cool on a wire rack for 10 minutes. Transfer log to a cutting board and cut into 1/2-inch thick slices, using a serrated knife. Return biscotti slices to baking sheet, cut-side up.\nReturn biscotti to the oven and bake until biscotti are firm to the touch, about 20 minutes. Flip each cookie and continue baking until toasted, about 20 minutes more. Cool biscotti completely before storing in an airtight container.\n",
        "picture_link": "M121Cv6O0icTLFDQygSeYWZ/Azpl7lO"
    },
    {
        "title": "Greek Pizza",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 (10 ounce) package frozen chopped spinach, thawed and squeezed dry ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "2 1/4 teaspoons lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (14 ounce) package refrigerated pizza crust ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 large tomato, thinly sliced ADVERTISEMENT",
            "1/3 cup seasoned bread crumbs ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "3/4 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). If using a pizza stone, place in oven to preheat.\nHeat 1 tablespoon olive oil in a large skillet; cook and stir onion and garlic until tender, about 5 minutes. Add spinach and continue to cook and stir until all liquid has evaporated, 5 to 7 minutes. Remove from heat and season with basil, lemon juice, oregano, and pepper. Allow mixture to cool slightly.\nUnroll pizza dough on preheated pizza stone or a large baking sheet and brush with remaining 1 tablespoon olive oil. Spread spinach mixture over dough, leaving a small border at the edge of the pizza crust. Top with 1 cup mozzarella cheese.\nPress tomato slices into seasoned bread crumbs until coated; arrange tomatoes over pizza. Spread remaining 1 cup mozzarella cheese and feta cheese over tomatoes.\nBake in preheated oven until pizza crust is golden brown and cheese is melted, about 15 minutes.\n",
        "picture_link": "2qyFxVZ9QetXp/rFT3uha0mn/jFZldm"
    },
    {
        "title": "Utokia's Ginger Shrimp and Broccoli with Garlic",
        "ingredients": [
            "Reynolds® Parchment Paper ADVERTISEMENT",
            "4 cups broccoli florets ADVERTISEMENT",
            "1 pound raw shrimp, peeled and deveined ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1/2 tablespoon grated fresh ginger ADVERTISEMENT",
            "1/2 tablespoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F. Tear off four 15-inch sheets of Reynolds Parchment Paper. Fold each sheet in half and crease it in the center. Cut each into a heart shape; unfold.\nDivide broccoli and shrimp evenly on one-half of each sheet near crease.\nMix garlic, sesame oil, ginger and soy sauce. Spoon 1/4 the mixture evenly over broccoli and shrimp on each sheet.\nFold over other half of each sheet to enclose ingredients. Starting at top, make small overlapping folds down entire length of parchment to secure edges together. Twist last fold several times to make a tight seal. Place parchment packets on a large baking sheet with 1-inch sides.\nBake 13 to 15 minutes or until shrimp is done.\nPlace parchment packets on dinner plates. Carefully cut an X in the top of each packet; open carefully, allowing steam to escape. Serve immediately.\n",
        "picture_link": "YYEJjLvAGuYtKGSgMecrM.qQJwLFDiy"
    },
    {
        "title": "Gluten-Free Sausage Gravy",
        "ingredients": [
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1 cup unsalted butter ADVERTISEMENT",
            "10 tablespoons gluten-free all purpose baking flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "60 grinds black pepper, divided ADVERTISEMENT",
            "6 cups milk, divided ADVERTISEMENT",
            "salt to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Reduce heat to low.\nStir butter into cooked sausage until melted; whisk in flour. Cook, whisking constantly, until mixture is the color of peanut butter, 5 to 10 minutes. Season with 1 teaspoon salt and 30 grinds of black pepper.\nIncrease heat to medium and pour in 3 cups milk. Bring to a simmer, stirring constantly. Stir in remaining 3 cups milk, 1/4 cup at time, allowing mixture to return to a simmer after each addition, 10 to 15 minutes. Continue cooking and stirring until desired thickness is reached, 5 to 10 minutes. Season with 30 grinds of black pepper and salt to taste.\n",
        "picture_link": "bylDae6DSqW7Pp2WVkZm0S7TRAdRZnC"
    },
    {
        "title": "Cherry Coconut Bars",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 tablespoons confectioners' sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1/2 cup maraschino cherries, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nWith your hands, mix together 1 cup flour, butter and confectioners sugar until smooth. Spread thinly (with fingers) on bottom of 8 x 8 x 2 inch square pan.\nBake about 25 minutes.\nMeanwhile, lightly beat eggs and stir all remaining ingredients into the eggs. Spread over cooked base and bake about 25 minutes more. Cool.\n",
        "picture_link": "fKOaMfDpbWiBaH3ceXi0Xvy2z8hwhJq"
    },
    {
        "title": "Spritz Orange Crisps",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCream the shortening. Gradually add the sugar and the orange juice. Cream well. Beat in the egg and the orange rind.\nSift the flour, salt and baking soda. Add the flour mixture to the creamed mixture a little at a time. Fill cookie press and form cookies onto an ungreased cookie sheet.\nBake at 375 degrees F (190 degrees C) for 10 to 12 minutes.\n",
        "picture_link": "bjVNI96rR/MSvRQSDgdJjGOL3nqQ5Ny"
    },
    {
        "title": "Lemon Curd Tassies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend butter and cream cheese together; stir in flour. Cover; chill 1 hour.\nOn lightly floured surface, roll dough to 1/8 inch thickness. Cut in 3 inch rounds with scalloped cookie cutter. Pat rounds in 1 3/4 inch muffin pans. Bake tart shells at 400 degrees F (200 degrees C) for 10 to 12 minutes. Cool in pans.\nTo Make Filing: Grate 1/2 teaspoon lemon peel; set aside. In saucepan combine 3 well-beaten eggs, 1 1/4 cups sugar, 1/3 cup lemon juice, and 1/4 cup butter or margarine. Cook and stir over low heat till thick, about 15 minutes.\nRemove from heat; stir in lemon peel. Chill. Spoon a rounded teaspoonful of filling into each shell. If desired, top with toasted slivered almonds. Chill.\n",
        "picture_link": "QYUVxLP0/bCVDRqoworAcV0KpJo0s4C"
    },
    {
        "title": "Nutty Wild Rice Salad with Kiwifruit and Red Grapes",
        "ingredients": [
            "2 1/2 cups chicken stock ADVERTISEMENT",
            "1 cup wild rice ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "2 kiwis, peeled and diced ADVERTISEMENT",
            "1 cup seedless red grapes, halved ADVERTISEMENT",
            "1 1/2 tablespoons toasted, chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place broth in a medium saucepan, and bring to a boil. Add rice, reduce heat to low, and simmer, covered, for 45 minutes, or until tender. Drain excess liquid, cover and let cool.\nWhisk together lemon juice, oil, and honey in a small bowl until honey is dissolved. Season with salt and pepper.\nPlace cooled rice in a salad bowl, along with kiwi, red grapes and pecans. Add dressing, and gently toss.\n",
        "picture_link": "fI85NZUZYiaNsBC/Q/qxAAHdjuYv2KK"
    },
    {
        "title": "Swedish Nuts I",
        "ingredients": [
            "3 1/2 cups mixed nuts ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nPlace nuts on a 10x15 inch jellyroll pan, and bake for 10 minutes. Remove nuts, and melt butter on pan.\nIn a medium bowl, beat egg whites until soft peaks form. Gradually beat in the sugar and salt. Fold toasted nuts into egg white mixture. Arrange the coated nuts in a single layer on the buttered pan.\nBake for 30 minutes in the preheated oven, turning nuts with spatula every 10 minutes, until outside is crisp and golden. Cool, and store in an airtight container.\n",
        "picture_link": "G/QxhR.TKHUhnw68orGeSE4kiybu.OC"
    },
    {
        "title": "Langues de Chat",
        "ingredients": [
            "9 tablespoons butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "6 (1 ounce) squares semisweet chocolate, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Lightly grease baking sheets.\nIn a medium bowl, cream together butter and 1/2 cup plus 2 tablespoons sugar until smooth. Beat in the egg whites one at a time until batter is light and fluffy. Stir in the vanilla. Mix in the flour just until blended. Dough will be a little stiff.\nUsing a cookie press or a pastry bag with a medium star tip, press dough onto prepared baking sheet into 3-inch lengths, like a ladyfinger.\nBake cookies in preheated oven until straw-colored, about 10 minutes. Cool on wire rack.\nWhen cookies are cool, dip one end of each cookie in melted chocolate and place on wax paper until chocolate hardens. Store in a cool place.\n",
        "picture_link": "L9aABV1LoMSHf8orHy3NUIVeuWCF8Iu"
    },
    {
        "title": "Chocolate Chip Crispy Cookies",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In small mixing bowl, combine flour, baking soda and salt. Set aside.\nIn large mixing bowl, beat together margarine and sugar until light and fluffy. Add egg and vanilla. Beat well. Add flour mixture, mixing until combined. Stir in Rice Krispies cereal and chocolate chips .\nDrop by level tablespoons onto cookie sheets coated with vegetable spray.\nBake at 350 degrees F (175 degrees C) about 12 minutes or until lightly browned. Remove immediately from cookie sheets and cool on wire racks. Store in airtight container.\n",
        "picture_link": "zhbcZgAUsoKhvjMJcHDsTGjMzK5Xdmu"
    },
    {
        "title": "Grapefruit Bars",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 tablespoons fresh grapefruit juice ADVERTISEMENT",
            "3 tablespoons grapefruit zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch square baking pan.\nCombine flour, baking soda, cinnamon and salt and set aside. In large bowl, cream together shortening and brown sugar. Beat in the eggs, then add in grapefruit juice and zest and blend well. Gradually blend in flour mixture.\nBake for 25-30 minutes or until lightly colored on top. Set pan on a wire rack to cool. Frost with plain, lemon or orange icing and cut into bars.\n",
        "picture_link": "26VeCZalESTch8Eb6ERGRdsc1zN4pna"
    },
    {
        "title": "Wassail Punch I",
        "ingredients": [
            "1 tablespoon whole cloves ADVERTISEMENT",
            "6 cinnamon sticks ADVERTISEMENT",
            "3 tablespoons chopped crystallized ginger ADVERTISEMENT",
            "3 3/4 cups white sugar ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "2 quarts orange juice ADVERTISEMENT",
            "2 cups lemon juice ADVERTISEMENT",
            "1 gallon apple cider ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wrap the cloves, cinnamon stick, and ginger in cheese cloth, and tie with string.\nIn a medium saucepan, combine sugar, water and spice bag. Simmer and stir until sugar dissolves. Remove from heat, and refrigerate overnight.\nBefore serving, stir in the orange juice, lemon juice, and cider. Reheat over medium low flame, and serve warm. Be careful not to boil.\n",
        "picture_link": "K4YfBFEmUN.0GtAgwrz5JvBTKP/B85a"
    },
    {
        "title": "Orange Biscotti",
        "ingredients": [
            "3/4 cup almonds ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 large orange ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons orange liqueur ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Toast the almonds until golden brown.\nLet almonds cool, then chop into 1/4 inch pieces.\nSet oven temperature to 325 degrees F (165 degrees C).\nCream the butter and sugar until smooth and creamy. Beat in the eggs until smooth. Zest the orange, add to mixture and stir well. Add the orange-flavored liqueur and cinnamon. Mix in the flour, baking powder and salt. Beat until just mixed. Stir in the chopped almonds. Divide the dough in half on a lightly floured board and form into long rolls, about 2 inches in diameter and 10 inches long.\nSet the rolls on a cookie sheet and bake for about 25 minutes, or until they are brown on top.\nLet the rolls cool for 5 minutes, then slice diagonally 1/2 inch thick.\nLay slices back flat on cookie sheet and cook for another 10 minutes. Flip biscotti over and cook for another 10 minutes. Let cool on wire racks. If you keep these in an airtight container, they will keep for months.\n",
        "picture_link": "8IkSYcggA.ps.OWC.IjuQl/7KnaNboC"
    },
    {
        "title": "Sand Tarts",
        "ingredients": [
            "1 cup unsalted butter ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter in large bowl until light. Beat in 1/2 cup confectioner's sugar and vanilla. Add flour and mix until just blended. Stir in nuts. Shape dough into a ball, then flatten into a disc. Wrap in plastic wrap and refrigerate until cold.\nPreheat oven to 325 degrees F (170 degrees C). Line cookie sheets with parchment paper.\nShape dough into 1 inch balls. Place on prepared sheets, spacing evenly. Bake about 20 minutes, or until firm and lightly colored.\nSift 1/4 cup confectioners' sugar into a bowl. Transfer cookies to confectioners' sugar while still warm and roll gently to coat. Immediately transfer cookies to plastic bag and seal (this makes the cookies sweat and form an icing). Let stand 5 minutes in the bag. Transfer to rack and cool.\n",
        "picture_link": "v7BPn3/1bmzv7jFhE1CYQAZMmTzloE2"
    },
    {
        "title": "Chocolate Frosted Marshmallow Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 (16 ounce) package large marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F(180 degrees C). Lightly grease cookie sheets or line with parchment paper.\nMelt butter and chocolate in small heavy saucepan over low heat; stir to blend. Remove from heat; cool.\nBeat egg, brown sugar, vanilla and baking soda in large bowl until light and fluffy. Blend in chocolate mixture and flour until smooth. Slowly beat in milk to make light, cake-batter-like dough.\nDrop dough by teaspoonfuls 2 inches apart onto prepared cookie sheets. Bake 10 to 12 minutes or until firm in center. Cut marshmallows in half.\nImmediately place halved marshmallow, cut side down, onto each baked cookie. Return to oven 1 minute or just until marshmallow is warm enough to stick to cookie. Remove to wire racks to cool.\n",
        "picture_link": "QAcxEUtfvuCqFa3tgePaiBzxpiH3uJG"
    },
    {
        "title": "Peanut Butter Kisses II",
        "ingredients": [
            "1 cup creamy peanut butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "48 milk chocolate candy kisses, unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix peanut butter, sugar and eggs until blended. With floured hands, roll level tablespoons of dough into balls.\nPlace balls 1 1/2 inches apart. Bake 12 - 14 minutes. Remove from pan, immediately place chocolate kiss in middle. Cool 1 - 2 minutes.\n",
        "picture_link": "c2uOOWEXo89tX4Lf03ibEJsCKzfnHbK"
    },
    {
        "title": "Date Filled Cookies",
        "ingredients": [
            "1 cup dates, pitted and chopped ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 1/4 cups rolled oats ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small saucepan over low heat, mix dates, sugar and 1/2 cup of water. Bring to a boil, and cook for 15 minutes, or until thick and smooth. Set aside to cool.\nCream butter and brown sugar together until smooth. Gradually mix in flour, baking soda, and salt. Add the oatmeal and mix well. Stir in 2 to 4 tablespoons of water. Form the dough into a ball and refrigerate for 15 minutes.\nOn a floured surface, roll dough to 1/8 inch thickness and cut into 2 inch rounds. Place 1/2 of the rounds on cookie sheets. Spoon date mixture in the center of each round and top with another round. Press edges firmly together.\nBake 15 minutes in the preheated oven, or until browned.\n",
        "picture_link": "/K7Ky3b8LrK/ps77v/XjlvvZLmnXJ12"
    },
    {
        "title": "No Bake Date Balls",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 cups dates, pitted and chopped ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups crisp rice cereal ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using a double boiler, heat butter, chopped dates, confectioner's sugar, eggs and salt. Stir constantly until very thick, about 20 minutes. Remove from heat and cool.\nAdd crispy rice cereal, chopped walnuts, and vanilla. Mix well and form into small balls. Roll in coconut. Keep refrigerated.\n",
        "picture_link": "z2A8XYewey0lG5qNuTdhUd6E72c/7sW"
    },
    {
        "title": "Citrus Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "6 drops yellow food coloring ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter or margarine and sugar. Add salt, zest, juice, and food coloring. Mix until well blended.\nAdd flour a half cup at a time, mixing well. Dough should ball up when finished. Shape into a cylinder about 2 1/2 inches in diameter. Chill for 4 hours.\nPreheat oven to 350 degrees F (180 degrees C).\nSlice into 24 cookies and bake on cookie sheet 6 to 8 minutes.\n",
        "picture_link": "etcJFLiS5RRNDqbdnihSdVH4qAhh/Ni"
    },
    {
        "title": "Whoopie Pies IV",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "5 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nTo Make Cookies: Cream together 2 cups sugar, 1/2 cup shortening and 2 eggs.\nSift together 4 cups flour, baking soda, baking powder, 1 1/2 teaspoons salt and cocoa. Add alternately the flour mixture to the creamed mixture with boiling water and 1 teaspoon vanilla.\nDrop teaspoons sized pieces of dough onto greased cookie sheet. Bake 5 to 7 minutes.\nTo Make Filling: Cook 5 1/2 tablespoons flour and 1 cup milk until thick. Let cool. Cream 1 cup shortening, 1 cup sugar, 1/4 teaspoon salt, and 1 teaspoon vanilla. Add cooled flour mixture. Beat till creamy.\nSpread on the flat side of a cooled cookie and sandwich together with another cookie.\n",
        "picture_link": "wn7XYXLaubL1VldLjHoLQ9.2sfX0h7O"
    },
    {
        "title": "German Christmas Gingerbread",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "1/4 cup orange liqueur ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the flours, baking powder, and spices.\nIn a large bowl, cream the butter or margarine with the brown sugar. Beat in the eggs, then the honey, orange liqueur, sour cream, and orange juice. Beat the flour mixture into the creamed mixture, and then stir in the raisins and almonds. Turn batter into a greased and floured tube pan.\nBake cake at 350 degrees F (175 degrees C) for 80 minutes, or until it tests done with toothpick. Transfer to a rack to cool.\n",
        "picture_link": ".Yi3hEkSHgaMVdljDKZStOBYHPnm0Cm"
    },
    {
        "title": "Butterscotch Lace Cookies",
        "ingredients": [
            "2 1/4 cups rolled oats ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon molasses (optional) ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rolled oats and brown sugar in a bowl. Pour melted butter over oats and stir to combine. Let mixture stand at room temperature overnight so oats absorb butter.\nPreheat oven to 375 degrees F (190 degrees C). Grease a baking sheet very well, or line it with greased parchment paper.\nMix salt, molasses, flour, egg, and vanilla into oat mixture. Drop level teaspoonfuls of dough 2 inches apart on prepared baking sheet. Bake only 12 cookies per pan.\nBake in preheated oven until edges are brown, 5 to 7 minutes. Allow to remain on sheet a few minutes, until firm, then immediately remove with spatula to cooling rack.\n",
        "picture_link": "x6F3QI7oAoZ7jmDSCf4CH.xkbsBrofm"
    },
    {
        "title": "Pumpkin  Nog",
        "ingredients": [
            "1 (29 ounce) can pumpkin puree ADVERTISEMENT",
            "1 pint vanilla ice cream, softened ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground mace ADVERTISEMENT",
            "1 cup whipped cream ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender or food processor, blend the pumpkin, ice cream, milk, cinnamon, nutmeg, and mace in batches.\nPour into individual cups. Top with whipped cream and a sprinkle of nutmeg.\n",
        "picture_link": "i.HJv6vmc2ZRRBdx7/Kvx0vMwU1Ebca"
    },
    {
        "title": "Oatmeal Pie V",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter or margarine and sugar. Stir in cinnamon, cloves, and salt. Stir in syrup. Add eggs one at a time, stirring after each addition until blended. Stir in oats. Pour filling into pie shell.\nBake at 350 degrees F (175 degrees C) for about 1 hour, or until knife inserted in center comes out clean.\n",
        "picture_link": "Dnv/4mB6GwyTroF1UmAoV4kQ729Kv3C"
    },
    {
        "title": "Creamy Vegetable Cheese Soup",
        "ingredients": [
            "2 quarts water ADVERTISEMENT",
            "2 cups diced potatoes ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 pound processed cheese food (eg. Velveeta) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, combine the water, potatoes, onions and celery. Bring to a boil and then reduce heat to low. Simmer for 20 minutes. Add frozen vegetables and simmer 10 more minutes. Add the cans of soup and the cheese and cook slowly, until the cheese melts.\n",
        "picture_link": "9qwAlmAflB/b5AafUndaep1RMW1WQKm"
    },
    {
        "title": "Transparent Pie",
        "ingredients": [
            "1/2 cup margarine, melted ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (9 inch) pie shell ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, beat eggs well. Mix in sugar and margarine. Blend in vinegar and vanilla extract. Pour filling into pie shell.\nBake at 450 degrees F (230 degrees C) until pie starts to brown. Reduce heat to 350 degrees F (175 degrees C), and continue to bake for about 25 minutes.\n",
        "picture_link": "mMvWe3zOYvMQQ0m05gcwhIvglwunta2"
    },
    {
        "title": "Quick Spicy Tomato Soup",
        "ingredients": [
            "1 red bell pepper, cut into 1 inch pieces ADVERTISEMENT",
            "1 onion, sliced into rings ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (6 ounce) can black olives, drained and chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stock pot, cook and stir red bell pepper strips and onion slices in a little oil until soft but not brown.\nStir in chicken stock and about 1/2 can condensed cream of tomato soup, stewed tomatoes with chilies, olives, salt, pepper, garlic powder, parsley, and hot pepper sauce if desired. Heat through. Ladle hot soup into bowls over broken tortilla chips. Serve with shredded cheese and dollops of sour cream.\n",
        "picture_link": "d3/o7.8bpFg34SmIg.vYeyAGal.6Vrq"
    },
    {
        "title": "Potato Pouches",
        "ingredients": [
            "4 large red potatoes ADVERTISEMENT",
            "1 onion, sliced into thin rings ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "1 pinch dried parsley ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Cut four 8x12 inch sheets aluminum foil.\nSlice each potato into 1/4 inch slices and lay in an overlapping fashion in 2 columns on each sheet of aluminum foil.\nPlace several rings of onion on top of the potatoes. Mix together the oregano, parsley, basil, salt and pepper; sprinkle to taste over onion and potato. Top with 1 tablespoon of butter.\nCreate the pouch by take the long sides of the aluminum foil and join at the top and fold down. The ends just get folded over.\nPlace on a cookie sheet and bake for about 30 minutes or cook on a grill over medium-high heat.\n",
        "picture_link": "moHrzq6oang3jcSIMmJsmPfSZX5Voa6"
    },
    {
        "title": "South of The Border Chicken Soup",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "3 (6 inch) corn tortillas, cut into 1/2 inch strips ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "2 cups cubed, cooked chicken meat ADVERTISEMENT",
            "2 cups frozen mixed vegetables ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large stock pot; add tortilla strips and fry, stirring until golden. Once golden remove tortillas and place on paper towel, lined plate. Try absorbing as much oil as possible.\nPlace onion and bell pepper into stock pot, over medium heat, and cook until soft.\nAdd garlic, stir in flour and gradually stir in chicken broth.\nAdd cooked chicken, frozen vegetables and chili powder and cook until thickened.\nSprinkle with tortilla strips before serving.\n",
        "picture_link": "QoRRyk.i7gilr1RJUmzShRPmK6Xim9e"
    },
    {
        "title": "Cornish Hen Soup",
        "ingredients": [
            "1 Rock Cornish hens ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "5 stalks celery, chopped ADVERTISEMENT",
            "3 large carrots, diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "3 potatoes, peeled and cubed ADVERTISEMENT",
            "1 (48 fluid ounce) can chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the gizzards, and wash the hen thoroughly. Cut hen into several pieces.\nHeat oil in a large pot. Add hen pieces, and brown on all sides. Add carrots, celery, onions, garlic, and potatoes; cook until onion is tender.\nPour in chicken broth. Use more or less broth to your taste, but make sure to cover all the ingredients in the pot. Bring to a boil, and then reduce heat. Simmer until vegetables are tender and hen is cooked through.\nRemove hen from pot, and remove meat from the bones. Discard bones. and return meat to soup. Serve.\n",
        "picture_link": "oV6ZB7dnMWhJqDNeedqKF1fSiyrEKB2"
    },
    {
        "title": "Chili Without The Beans",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (29 ounce) can diced tomatoes ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "6 potatoes, diced ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, brown the meat, and then add the onion and garlic. Cook until the onion is soft.\nPour in the tomatoes and water. Add the potatoes. Cook for 45 minutes.\nAdd hot sauce, and cook for an additional 10 minutes. Before serving stir in chopped fresh parsley or dried parsley.\n",
        "picture_link": "Pvtj9Ug5f7X1P1EAyVPQsFNmp75B96u"
    },
    {
        "title": "Polish Dill Pickle Soup",
        "ingredients": [
            "1 pound beef neck bones ADVERTISEMENT",
            "1 cup mixed vegetables ADVERTISEMENT",
            "2 cups diced dill pickles ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "2 cups diced potatoes ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, place neck bones, vegetables, and pickles. Add water. Cook over medium heat for 45 minutes.\nAdd potatoes; cook until soft, about 20 minutes.\nRemove neck bones. Increase heat to medium-high. Combine flour and milk in a small bowl, and gradually stir into soup. Continue stirring until mixture boils. Season to taste with salt.\n",
        "picture_link": "dwoiS6Jr7W.xqfmrvxI1uLUPjKpxmSG"
    },
    {
        "title": "Strawberry Soup III",
        "ingredients": [
            "2 cups strawberries ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 teaspoon granulated sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place strawberries and buttermilk into a blender or food processor and puree. Sweeten with sugar to taste, blend and either serve immediately or chill in the refrigerator.\n",
        "picture_link": "95QOov9.3htgRKvHFwZUjAAUEwsCF6m"
    },
    {
        "title": "Santa Fe Wild Rice Soup",
        "ingredients": [
            "2 cups frozen corn kernels ADVERTISEMENT",
            "1/3 cup diced onion ADVERTISEMENT",
            "1/3 cup diced carrots ADVERTISEMENT",
            "3 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "2 cups wild rice, cooked ADVERTISEMENT",
            "1/2 cup chopped green chile peppers ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/8 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, combine corn, onion, carrot and 1 can chicken broth and bring to a boil. Reduce heat and simmer 10 to 15 minutes or until onion is tender.\nStir in remaining chicken broth, wild rice, green chili peppers, chili powder, cumin, oregano and cayenne pepper. Simmer, uncovered, about 5 minutes or until heated through.\nTop each bowl with fresh tomato salsa, sprinkle with cilantro and serve.\n",
        "picture_link": "W7FVFcKnvtYRMER.c1Y1Zokz0po6VPq"
    },
    {
        "title": "Conh Chowdah (Corn Chowder)",
        "ingredients": [
            "1 white onion, chopped ADVERTISEMENT",
            "4 slices bacon, diced ADVERTISEMENT",
            "6 ears fresh corn ADVERTISEMENT",
            "2 quarts heavy whipping cream ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove corn kernels from the ears of corn.\nSaute bacon, onions, and corn in a medium pot until the onions are translucent and the bacon is crispy.\nAdd the heavy cream. Heat through over medium low heat. Season with salt and pepper. Serve.\n",
        "picture_link": "ZzfhNt8ug9YI/W2Rp5GWdq4uqil8JA6"
    },
    {
        "title": "Egg Custard Pie IV",
        "ingredients": [
            "1 (7 inch) unbaked pie crust ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a medium mixing bowl whisk together eggs and sugar. Pour milk into a small saucepan and place over low heat until warm. Pour milk over egg mixture slowly, whisking constantly. Stir in nutmeg, if desired, then pour into pie shell.\nBake for 10 minutes at 425 degrees F (220 degrees C) for 10 minutes. Reduce heat to 350 degrees F (175 degrees C). Cook 20 minutes longer, or until custard is just set. Chill before serving.\n",
        "picture_link": "fJW6Y0yPi0XdvGumYfa3VoNNLow9wtq"
    },
    {
        "title": "Curried Cream of Any Veggie Soup",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "4 cups chopped mixed vegetables ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups nonfat milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat. Saute onion and garlic until tender. Stir in curry, and cook for 2 minutes, stirring constantly. Add broth and vegetables, and bring to a boil. Simmer 20 minutes, or until tender.\nDissolve flour in milk, then stir into the soup. Simmer until thickened. Season with salt and pepper.\n",
        "picture_link": "cm13WMzhln4vrO/UH3Qrj6N40tYVj6C"
    },
    {
        "title": "Deep Fried Lobster",
        "ingredients": [
            "2 cups cornmeal ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "4 pounds fresh lobster tails, cleaned and halved but still in shell ADVERTISEMENT",
            "2 quarts oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a gallon sized plastic closeable bag combine, cornmeal, flour, salt, pepper, cayenne, garlic powder and onion powder. Shake well. Place one half of a lobster tail at a time in to the bag. Shake to coat the tails completely.\nHeat vegetable oil in a deep fryer or large skilled to 365 degrees F (180 degrees C). Place one coated lobster tail at a time into the oil. Cook until the lobster turns white and the coating is lightly browned. Let the fried tails dry on paper towels.\n",
        "picture_link": "/pd7Piq1rwdr0nVYfEpz1c0BeCkYOEC"
    },
    {
        "title": "Chocolate Mousse Cake III",
        "ingredients": [
            "2 (12 ounce) packages ladyfingers ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line bottom and sides of a 9 inch springform pan with ladyfingers. In the top of a double boiler over hot water, melt the chocolate chips, stirring frequently. When the chocolate has melted, mix in the 2 eggs thoroughly.\nIn a large bowl, whip the cream until it is thick. In a separate large bowl, with a clean whisk, whip the whites until stiff but not blocky.\nAdd 1/3 of the whipped egg whites to the melted chocolate and fold in. Quickly add this to remaining whites and fold in. Fold in the whipped cream until no streaks remain, being careful not to overmix.\nPour mousse into the cake-lined pan. Cover with plastic wrap and refrigerate for 4 hours.\n",
        "picture_link": "wno1EeJBO/HOwHtcrUDe7VTlcXm9rO."
    },
    {
        "title": "Creamy Vegetable Soup",
        "ingredients": [
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "3 sweet potatoes, peeled and diced ADVERTISEMENT",
            "3 zucchini, chopped ADVERTISEMENT",
            "1 1/2 cups fresh broccoli, chopped ADVERTISEMENT",
            "3 (14 ounce) cans chicken broth ADVERTISEMENT",
            "2 potatoes, peeled and shredded ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker stir together the onion, butter or margarine, sweet potatoes, zucchini and broccoli. Pour in the chicken broth and stir. Add the potatoes, celery seed, salt and ground cumin and stir.\nCover and cook on low for 8 to 10 hours. Add the milk and cook for 30 minutes to 1 hour. Serve.\n",
        "picture_link": "OBKZj9XO3bsWB4yNxBe73CCnhsJVDhC"
    },
    {
        "title": "Sweet Potato Fluff",
        "ingredients": [
            "3 cups cooked and mashed sweet potatoes ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix the mashed sweet potatoes, white sugar, eggs, 1/2 cup of the butter or margarine, vanilla and flaked coconut. Place in heat proof 2 quart sized casserole dish.\nWith a fork mix the brown sugar, flour, pecans and the remaining 1/3 cup of butter or margarine. Sprinkle over the top of the potato mixture. Bake at 350 degrees F (175 degrees C) for 30 minutes.\n",
        "picture_link": "ZEPndbr5YeIoq7hYQhOUn8bTx.SFkFW"
    },
    {
        "title": "Almond Buttercrunch",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup chopped almonds ADVERTISEMENT",
            "2 cups milk chocolate chips ADVERTISEMENT",
            "1/2 cup finely chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over low heat, combine the butter, sugar and 1 cup chopped almonds. Stir constantly until mixture boils, then do not stir or shake. Heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads.\nPour onto a large buttered cookie sheet. Immediately press chocolate chips onto the hot candy. As the chocolate melts, spread it into a coating over the candy.\nSprinkle finely chopped almonds over the top; cool, and break into uneven pieces.\n",
        "picture_link": "S1wpW8LwZ0xdIrueqwTWenbEs0Dq3Rq"
    },
    {
        "title": "Ricotta Cheese Pie I",
        "ingredients": [
            "1 1/2 cups ricotta cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve cornstarch in 1/2 cup milk.\nCombine cornstarch and milk with ricotta, remaining 1 cup milk, eggs, vanilla, and sugar. Mix until well blended. Pour filling into unbaked pie shell.\nBake at 350 degrees F (175 degrees C) for 1 hour, or until a knife inserted into center comes out clean. Sprinkle top with cinnamon, and cool.\n",
        "picture_link": "Utv63U8N.CaAnd/segkU89UkTA39FSO"
    },
    {
        "title": "Mr. Goodbar Frosting",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "3/4 cup evaporated milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups crunchy peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the sugar, cocoa, and milk in a medium saucepan. Bring to a boil, and cook for 3 minutes. Stir in the vanilla and peanut butter. Mix well. Spread over hot cake while frosting is also still hot. Let frosted cake cool before cutting.\n",
        "picture_link": "Y0rXlwVSrAigCsuEXYVdAs7drgXde2i"
    },
    {
        "title": "Granny's Smothered Chicken",
        "ingredients": [
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1 (4 pound) chicken, cut into pieces ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "8 red potatoes, quartered ADVERTISEMENT",
            "3 whole cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, heat oil for frying. Season the chicken pieces with salt and pepper to taste. Flour the chicken lightly twice. Drop coated chicken into hot oil slowly to prevent splatters. Fry until golden brown, about 12 to 15 minutes.\nMeanwhile, boil the potatoes in a large pot of boiling water. When potatoes are soft, remove from heat. Save the 'potato water'.\nWhen chicken is done, drain the oil out of the skillet and place the potatoes in the skillet with the chicken. Slowly pour the 'potato water' over the skillet mixture. Add whole cloves, cover and simmer. As the mixture sets it prepares its own gravy in the skillet, so the longer it simmers, the better! When the consistency is to your taste, remove from heat and serve.\n",
        "picture_link": "XV4AWaB6Y890u8ammsgwpwWP8y3DUWG"
    },
    {
        "title": "Golden Orange Frosting",
        "ingredients": [
            "1/3 cup butter, softened ADVERTISEMENT",
            "1 1/2 tablespoons orange zest ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter, orange rind, lemon rind, and salt. Add egg yolk and mix well. Add confectioners sugar, alternately with orange juice and lemon juice, beating well after each addition. Makes 2 cups frosting, or enough to cover tops and sides of two 9 inch layers.\n",
        "picture_link": "AWrHDRhOhB/h.lKDUbZ3b3VYDce7WTy"
    },
    {
        "title": "Sticky Buns I",
        "ingredients": [
            "2 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 1/4 cups buttermilk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "5 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "2/3 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast in warm water in a large mixing bowl. Add buttermilk, eggs, 2 1/2 cups flour, 1/2 cup margarine, 1/2 cup white sugar, baking powder and salt. Blend 30 seconds with mixer on low speed, scraping sides and bottom of bowl. Beat 2 minutes on medium speed.\nStir in remaining 3 cups flour. Dough should remain soft and slightly sticky. Knead for 5 minutes, or about 200 turns on a lightly floured board.\nForm dough into a round and place it in an oiled bowl. Cover it with a damp cloth and leave it in a warm place to rise until doubled.\nDivide dough in half and roll each half into a 12x7 inch rectangle. Spread each half with 1 tablespoon soft margarine, and sprinkle with 1/4 cup white sugar and 1 teaspoon cinnamon. Roll up halves, beginning at wide side. Seal well by pinching the seams. Cut each roll into 12 slices.\nCoat two 9 inch round cake pans with 1/4 cup melted butter, 1/4 cup brown sugar, and 1/2 cup chopped pecans in each pan. Place 12 dough slices in each pan, leaving a small space between slices. Let rise until doubled.\nBake in a preheated 375 degrees F (190 degrees C) oven for about 30 minutes. Invert pans onto serving plate.\n",
        "picture_link": "xWrKtNF.65tgiwzS8knAaVxPiK4NVxa"
    },
    {
        "title": "Chocolate Spice Cake",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup sour milk ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (1 ounce) square semisweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the butter or margarine and sugar. Add the eggs, beating well after each addition.\nIn another bowl, sift together the flour and spices. Blend these dry ingredients into the sugar mixture.\nDissolve the soda in the sour milk, and add to the batter.\nGrate the chocolate, and add to the batter.\nPour batter into a greased and floured 8 inch round pan. Bake at 350 degrees F (175 degrees C) for 20 minutes, or until done.\n",
        "picture_link": "4O1F9TBwB3ji3Xovw43CuLygDYS6l4m"
    },
    {
        "title": "Honey Cake I",
        "ingredients": [
            "4 eggs, separated ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "3 teaspoons instant coffee granules ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix coffee in hot water, and then cool.\nIn a large bowl, beat the yolks with the sugar until creamy. Add the oil and then the honey, beating after each addition. Beat until the mixture is smooth and creamy.\nSift and then measure 3 cups of flour. Combine with salt, baking powder, baking soda, and spices. Add these dry ingredients alternately with the coffee to the honey mixture, stirring only until blended. Do not overmix.\nWhip egg whites until stiff. Fold in three additions into the batter. Pour into 2 greased 8 inch square pans.\nBake at 325 degrees F (165 degrees C) for 35 to 40 minutes, or until a toothpick inserted into the middle of cake comes out clean.\n",
        "picture_link": "9PcIKQL4FkUSdL7tw9EXmuh3KeqxrwW"
    },
    {
        "title": "Rich Yellow Cake",
        "ingredients": [
            "4 cups cake flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "6 egg yolks, beaten ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter and flour two 8 inch round cake pans then line them with parchment paper.\nSift the flour with the baking powder and salt and set aside.\nCream the butter until fluffy. Add the sugar gradually and beat until light and fluffy. Beat in the egg yolks and add the vanilla. Add flour mixture to butter mixture, alternating with milk. Stir the batter until smooth. Pour the batter into the prepared cake pans.\nBake at 350 degrees F (175 degrees C) for 45 minutes. This cake rises very well so only fill the cake pans 2/3 full. Cool cakes in pans for 10 minutes, then cool thoroughly on a wire rack. Frost as desired.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tex Mex Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 slice white bread, cut into cubes ADVERTISEMENT",
            "4 slices American cheese OR your choice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the ground beef, eggs, diced tomatoes and green chile peppers, onion powder, ground black pepper, salt and bread. Mix together well, place in a 5x9 inch loaf pan and top with the cheese.\nBake at 350 degrees F (175 degrees C) for 1 hour.\n",
        "picture_link": "HL9LnmEGqpCd3xra5JCEYQD1AxYLgyu"
    },
    {
        "title": "Apple Bran Cheddar Muffins",
        "ingredients": [
            "1 cup whole bran cereal ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 cup peeled, cored and sliced apple ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease one 12-cup muffin tin or line with paper liners.\nCombine the bran cereal, milk and apples. Mix well. Beat in the vegetable oil and egg.\nCombine the flour, baking powder, salt, cinnamon and brown sugar. Make a well in the center and stir in the wet mixture. Add the shredded cheese and mix enough until just moistened. Scoop the batter into the prepared pans.\nBake at 375 degrees F (190 degrees C) for 15 to 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tuppakaka",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1 cup + 1 tablespoon + 1 teaspoon all-purpose flour ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9 inch springform pan, and sprinkle with dry breadcrumbs.\nStir together the egg and sugar. Melt butter or margarine, and stir into mix. Add flour; mix until smooth, but not fluffy. Spread the batter into the prepared pan. Sprinkle flaked almonds on top.\nBake for 25 minutes. Allow cake to cool slightly before removing from the pan. Cool completely on a wire rack. This cake keeps very well for up to a week in an airtight container or plastic bag.\n",
        "picture_link": "IQGqURA9/sDlQalVTB2kbocqfg/qbkq"
    },
    {
        "title": "Sock it to Me Cake I",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the cake mix, sugar, oil, eggs, pecans, and vanilla. Fold in the sour cream.\nPut half the batter in a bundt pan.\nMix the brown sugar and cinnamon and sprinkle over the batter in the pan. Pour the remainder of the batter on top.\nBake at 350 degrees F (175 degrees C) for 70 minutes until cake tests done.\n",
        "picture_link": "gRU5aXowBbWp/UUjBDg/FElAaPYfJ72"
    },
    {
        "title": "Maple Ginger Cake",
        "ingredients": [
            "2 cups cake flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 teaspoons ground ginger ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1 cup real maple syrup ADVERTISEMENT",
            "2/3 cup sour cream ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 8 inch round cake layer pans.\nSift together into a bowl; cake flour, baking soda, baking powder, salt, ginger, cinnamon, cloves, and nutmeg. Add the shortening, brown sugar, maple syrup, and 2/3 cup sour cream. Beat for 2 minutes with an electric mixer set at medium speed. Beat in the eggs and 1/3 cup sour cream and mix for another 2 minutes. Pour batter into prepared pans.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes, or until cake springs back lightly when touched. Cool for 5 minutes, then remove from pans and continue cooling.\n",
        "picture_link": "VqPsgyaiw1o1uhgGXOlAfG8c.Xx3d82"
    },
    {
        "title": "Chocolate Chip-Amaretto Pound Cake",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 (18.25 ounce) package devil's food cake mix ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons almond extract ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease the bundt pan.\nMix eggs, cake mix, oil, water and almond extract with electric beater. Stir in chocolate chips.\nPour into prepared pan. Bake approximately 1 hour or until cake tests done. Cool, then dust with confectioners' sugar.\n",
        "picture_link": "4WsD/9cYqcuFKH6NYqF7M5Of0/oz0By"
    },
    {
        "title": "Battenburg Cake",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 drops red food coloring ADVERTISEMENT",
            "1 cup apricot preserves ADVERTISEMENT",
            "2 cups ground almonds ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1 egg, room temperature ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter and 1 cup sugar together. Beat in 3 eggs, one at a time. Mix in vanilla. Stir in flour, baking powder and salt gently. Add milk if needed.\nDivide batter into 2 equal parts. Add food coloring to 1 part to make a deep pink color. Grease two 7 inch square pans. Spread batters into pans.\nBake at 350 degrees F (175 degrees C) until an inserted wooden pick comes out clean, about 25 to 30 minutes. Let stand in pans 5 minutes. Turn out on racks to cool.\nTrim edges from both cakes. Cut each cake lengthwise into 4 strips as wide as the cake is thick. Trim to make strips match. Heat jam slightly. Spread on sides to glue 2 pink and 2 white strips together checkerboard fashion. Spread all 4 sides of completed cake with jam. Repeat with remaining pink and white stripes. Makes two cakes.\nTo Make Almond Paste: Mix almonds, confectioners' sugar, egg, lemon juice, and almond extract together. Knead until smooth, adding a bit of lemon juice or water if too dry to roll. Add only 1/2 teaspoon at a time. It will be stiff. Divide into 2 equal parts.\nRoll 1/2 of paste 1/8 inch or so thick on a surface lightly dusted with confectioners' sugar. Cut to fit length of cake, and long enough to cover 4 sides leaving ends uncovered. Lay cake on one end of paste. Wrap to completely enclose all 4 sides of cake pinching paste to seal. Roll in granulated sugar. Place with seal underneath on serving plate, or store in plastic bag. Repeat for second cake. Chill. Slice thinly to serve.\n",
        "picture_link": "lhuCxhai2y0ECoGX3ik7lGi1opuu7Qm"
    },
    {
        "title": "Green Tomato Mincemeat",
        "ingredients": [
            "8 quarts green tomatoes, minced ADVERTISEMENT",
            "8 quarts minced, cored apples ADVERTISEMENT",
            "1/2 pound beef suet ADVERTISEMENT",
            "6 pounds brown sugar ADVERTISEMENT",
            "1 cup distilled white vinegar ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "2 tablespoons ground cloves ADVERTISEMENT",
            "2 tablespoons ground allspice ADVERTISEMENT",
            "2 pounds raisins ADVERTISEMENT",
            "32 ounces candied mixed citrus peel (optional) ADVERTISEMENT",
            "7 large orange, peeled, sectioned, and cut into bite-size ADVERTISEMENT",
            "2 lemons, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a very large stock pot, combine green tomatoes, apples, suet (or oil), brown sugar, vinegar, chopped oranges, chopped lemons, raisins, and candied peel. Season with salt, cinnamon, cloves and allspice. Cover, and cook over low heat for 3 hours.\nSterilize 30 (1 pint) canning jars and lids according to manufacturer's instructions.\nLadle filling into the sterilized jars, leaving 1/2 inch head space. Wipe the jar with a clean, damp cloth. Cover with jars with lids, and screw on jar rings.\nHeat water in a hot water canner. Place jars in rack, and slowly lower jars into canner. The water should cover the jars completely, and should be hot but not boiling. Bring water to a boil, and process for 10 minutes.\n",
        "picture_link": "RZmKfEA8/D8fXkrIIiQ96.ROIt5DSUS"
    },
    {
        "title": "Maple Zucchini Bread",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 teaspoons maple flavored extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup wheat germ ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, beat the 3 eggs; add oil, sugars and flavoring, mixing until foamy. Blend in the flour, wheat germ, baking powder, soda, and salt. Stir in zucchini and nuts. Pour batter into 2 greased bread pans\nBake at 325 degrees F (165 degrees C) for 1 hour. Cool.\n",
        "picture_link": "3wL7KScIeS7LyoscLiiWtRkQ.Dxb472"
    },
    {
        "title": "Coconut Pecan Cake",
        "ingredients": [
            "1 (18.25 ounce) package moist white cake mix ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 cups shredded coconut ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "2 cups shredded coconut ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "2 teaspoons milk ADVERTISEMENT",
            "3 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees). Grease and flour two 8 inch round pans or one 9 x 13 inch pan.\nIn a large bowl, blend cake mix with the water, eggs, and oil. Beat with an electric mixer at medium speed for 4 minutes. Stir in 2 cups coconut and nuts. Pour into prepared pans.\nBake for 35 minutes, or until done. Cool completely.\nMelt 2 tablespoons butter or margarine in a skillet. Add 2 cups coconut, and stir constantly over low heat until golden brown. Spread toasted coconut on absorbent paper towel to cool.\nCream 2 tablespoons butter or margarine with softened cream cheese. Add milk and sugar alternately, beating well. Add vanilla, and stir in 1 3/4 cups of the toasted coconut. Ice the cake, and sprinkle with remaining coconut.\n",
        "picture_link": "X/gdfMp3PFubURqxdKgaVvu7fJdUFDS"
    },
    {
        "title": "Pita Bread",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup pastry flour ADVERTISEMENT",
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 teaspoon active dry yeast ADVERTISEMENT",
            "1 tablespoon applesauce ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve the yeast and sugar in the warm water.\nCombine the all-purpose flour, pastry flour and salt in a bowl. Stir in the yeast mixture and applesauce and knead. Dough shouldn't be sticky, but it shouldn't be dry either. If too sticky add 1 tablespoon of all-purpose flour till you get the right consistency. If too dry, add 1 tablespoons of water at a time till you get the right consistency.\nRoll out into a rope and cut into 8 pieces. Shape each piece into a ball and roll out till it's anywhere from a 6 to 8 inch circle\nThere are two ways to cook pita bread. The flavor is a bit different with both.<BR> To Bake Pita:<BR> Preheat oven to 500 degrees F (260 degrees C) and put a pita on a wire cake rack. Toss in the rack and cook for 3 minutes or until the bread stops puffing up. When you take it out, smash down the pita (Careful, its hot!) and quickly put it in a plastic freezer bag.<BR> To Fry Pita:<BR> Heat olive oil in a skillet over high heat. When almost smoking, place a pita in the pan and cook for a few minutes on each side, till brown spots begin to appear. It should look something like a tortilla when you're done. Put in a plastic bag once it has cooled a bit.\n",
        "picture_link": "zL/kmwLxJcpfTJPV5M5Qo9uJ9hPjXX."
    },
    {
        "title": "Whipped Cream Icing I",
        "ingredients": [
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "4 teaspoons cold water ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon clear imitation vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix gelatin and cold water in a small saucepan, and let the mixture stand until gelatin thickens. Cook over low heat, stirring constantly until gelatin dissolves. Remove from heat, and let cool; do not let set.\nWhip cream, sugar, and vanilla until slightly thickened. Continue beating slowly, while gradually adding the gelatin. Whip at high speed until stiff.\n",
        "picture_link": "gNB9JwKj5ROhPEp9peZmQaRmTBGzoWq"
    },
    {
        "title": "Peanut Butter Cake I",
        "ingredients": [
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/8 cup butter ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "4 1/2 tablespoons evaporated milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch cake pan.\nCream together 1/2 cup butter and 1/2 cup peanut butter. Stir in white and brown sugars and beat well, then add the beaten eggs and 3/4 teaspoon of vanilla. Sift together flour, baking powder and salt. Add the flour mixture into the batter alternately with the milk.\nPour batter into the prepared pan and bake for 35 minutes. Frost when cool.\nTo Make Frosting: Blend together 1/8 cup butter or margarine, 3 cups confectioners' sugar, 4 1/2 tablespoons evaporated milk and 1 1/2 teaspoons vanilla extract, stirring slowly until mixture holds its shape. Then beat until very smooth. If necessary, gradually add tiny amounts of evaporated milk to bring to spreading consistency.\n",
        "picture_link": "MmIfsF.t0eXYSX5t4HZnRK5WN.bYy2a"
    },
    {
        "title": "Farm Lady's Delicious Chicken Parmesan ",
        "ingredients": [
            "2 cups spaghetti sauce ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "4 (4 ounce) skinless, boneless chicken breast halves - pounded 1/4 inch thick ADVERTISEMENT",
            "butter-flavored cooking spray ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Pour spaghetti sauce into a saucepan over low heat.\nWhisk egg white and water together in a shallow bowl until evenly combined. Spread the flour out onto a plate. In a shallow bowl, mix the bread crumbs, Parmesan cheese, basil, oregano, salt, and black pepper until thoroughly combined.\nDip the chicken breasts into the flour, and shake off loose flour; dip them into the egg white, then gently press into the seasoned crumbs. Shake off loose crumbs; spray both side of the chicken breasts with the cooking spray. Lay the chicken breasts onto a nonstick baking sheet.\nBake the chicken breasts in the preheated oven until golden brown, 10 to 12 minutes. Remove from oven, and sprinkle with the mozzarella cheese; return to oven and bake until the cheese is melted and starting to brown, 1 to 2 more minutes. Serve topped with the hot spaghetti sauce.\n",
        "picture_link": "NK0U5xsPkSnpXs6XHkyGD5gk/mCdJK2"
    },
    {
        "title": "Simple Sweet Potato Soup",
        "ingredients": [
            "6 medium sweet potatoes, peeled and chopped ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "2 cups chicken or vegetable stock ADVERTISEMENT",
            "1 cup water, or as needed ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 cups milk or cream, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes and ginger in large saucepan. Pour in chicken stock and water, and bring to a boil over high heat. Reduce heat to medium low, cover, and simmer until the potatoes have softened, about 30 minutes.\nPuree potatoes and lime juice in a food processor, or with a hand blender until smooth. Return soup to saucepan and stir in milk or cream as desired; heat until warmed through.\n",
        "picture_link": "MbcEGvJXUdgmmTM0E0LxEeFjRwbJmdm"
    },
    {
        "title": "Mom's Best Ham and Bean Soup",
        "ingredients": [
            "1 cup dry navy beans ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 large meaty smoked ham bone ADVERTISEMENT",
            "6 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 whole bay leaves ADVERTISEMENT",
            "3 tablespoons dried minced onion flakes ADVERTISEMENT",
            "1 tablespoon minced fresh garlic ADVERTISEMENT",
            "1/2 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/2 teaspoon dry mustard powder ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1 cup sliced celery ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (28 ounce) can tomato puree ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "3 tablespoons chicken soup base ADVERTISEMENT",
            "3 tablespoons molasses ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/4 teaspoon cracked black pepper, or to taste ADVERTISEMENT",
            "1/2 cup uncooked small shell pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place dry beans and 3 cups of water in a saucepan. Bring to a boil, cover, remove from heat, and allow to stand for 1 hour. Drain and rinse beans.\nPlace 3 more cups fresh water into a large pressure cooker. Add the soaked beans and ham bone, and stir in parsley, bay leaves, dried onion flakes, garlic, thyme, dry mustard, chili powder, and paprika. Seal the pressure cooker, and heat to 15 pounds per square inch. Cook under pressure for 7 minutes; add 1 minute for every 1,000 feet above sea level. Remove from heat, and allow pressure to subside naturally.\nWhen pressure has reduced, open the lid of the cooker. Stir in 5 more cups of water, celery, olive oil, tomato puree, ketchup, chicken soup base, molasses, brown sugar, and cracked black pepper. Bring to a boil, reduce heat to low, and simmer the soup until the beans are tender, about 45 minutes. Stir in shell pasta, and simmer until the pasta is tender, about 15 more minutes.\n",
        "picture_link": "YJF1UL0zSUDl9OVqSxLkF0n8MzeWvUK"
    },
    {
        "title": "Smoky Steak Marinade",
        "ingredients": [
            "1/2 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup liquid smoke ADVERTISEMENT",
            "1 1/2 tablespoons salt ADVERTISEMENT",
            "3 tablespoons seasoned salt ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "2 1/2 tablespoons onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together Worcestershire sauce, liquid smoke, salt, seasoned salt, garlic powder, and onion powder in a bowl until the salts have dissolved.\nTo use, pour the marinade over up to 2 pounds of meat in a resealable plastic bag. Seal the bag, and refrigerate overnight. The following morning, discard the marinade, and cook the meat as desired.\n",
        "picture_link": "TtgQ9ndUB37ziC6ynUeqCCDRVbTI6HK"
    },
    {
        "title": "Ranch Style Popcorn Seasoning",
        "ingredients": [
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together onion powder, dill weed, garlic powder, salt, pepper, and vegetable oil.\n",
        "picture_link": "7FUqXqpFga9.y8M9yqwMdAuGfvRHIeK"
    },
    {
        "title": "Cabbage, Polish Sausage, and Pierogies",
        "ingredients": [
            "1 head savoy cabbage, quartered and cored ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "2 tablespoons seasoned salt ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "1 (16 ounce) package kielbasa (Polish) sausage, cut into 1/8-inch slices ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "12 pierogies ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cabbage, butter, and mushrooms into a large pot or Dutch oven with lid. Season with seasoned salt, and pour in the beer. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer. While the cabbage is simmering, combine the kielbasa, garlic, onion, Worcestershire sauce, and balsamic vinegar in a skillet. Bring to a simmer over medium-high heat, and cook until the onions have turned translucent, about 5 minutes. Stir the sausage mixture into the cabbage mixture, recover, and continue simmering until the cabbage is tender, about 15 to 20 minutes more.\nAbout 15 minutes before the cabbage is ready, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the pierogies and return to a boil. Cook until the pierogies float to the top, 5 to 10 minutes; drain.\nHeat the vegetable oil in a clean skillet over medium-high heat. Add the drained pierogies, and cook until golden brown on both sides, about 5 minutes. Gently stir the browned pierogies and diced tomatoes into the cabbage mixture, and cook 5 to 10 minutes to reheat.\n",
        "picture_link": "RSR/OX5BgsyIrjdj26mpXgRiubYvvsO"
    },
    {
        "title": "Cheater's Apple Strudel",
        "ingredients": [
            "flour for dusting ADVERTISEMENT",
            "1 (17.5 ounce) package frozen puff pastry sheets (2 sheets), thawed ADVERTISEMENT",
            "water, as needed ADVERTISEMENT",
            "6 small tart apples - peeled, cored, and sliced thinly ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/4 cup toasted slivered almonds ADVERTISEMENT",
            "1/4 cup butterscotch chips ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Lightly dust a working surface with flour. Line a baking sheet with parchment paper.\nOn your prepared work surface, join the two sheets of puff pastry by their short edges to make a long rectangle. Brush water along edges and press down gently with fingertips to seal.\nMix the apple slices, cinnamon, brown sugar, almonds, and butterscotch chips together in a bowl until evenly combined; spoon the mixture onto one of the long edges of the pastry. Fold one side of pastry over the mixture and roll into a long strudel. Make sure to seal at both ends. Brush pastry with melted butter; make two-inch diagonal slits the length of the strudel with a sharp knife. Transfer to the prepared baking sheet.\nBake in the preheated oven for 15 minutes. Sprinkle the sugar over the top of the strudel and return to oven until the pasty is golden brown and flaky, another 15 to 20 minutes.\n",
        "picture_link": "aeMw5uxX8npKcf3eET3heb.iA3R9fC6"
    },
    {
        "title": "Chicken Bruschetta Pasta",
        "ingredients": [
            "1 pound boneless skinless chicken breast strips ADVERTISEMENT",
            "1/3 cup fat-free reduced-sodium chicken broth ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 (10 ounce) tub PHILADELPHIA Original Cooking Creme ADVERTISEMENT",
            "2 cups grape tomatoes ADVERTISEMENT",
            "2 cups hot cooked farfalle (bow-tie pasta) ADVERTISEMENT",
            "12 leaves fresh basil leaves, cut into strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook chicken in large nonstick skillet on medium heat 5 to 6 min. or until done. Add broth and garlic powder; cook 3 min.\nAdd cooking creme and tomatoes; cook and stir 3 min.\nStir in pasta and basil.\n",
        "picture_link": "N6JqrhNe4zj/1Xa2OqfqA.lhg5o0uJq"
    },
    {
        "title": "Wife Saver French Toast",
        "ingredients": [
            "1 cup light brown sugar ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "10 slices French bread ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 cups 1% low-fat milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13 inch baking dish. Stir the brown sugar, corn syrup, and butter together in a saucepan over medium-high heat until bubbly. Pour into the prepared baking dish, then arrange the sliced French bread evenly over the syrup. Whisk together the eggs, milk, vanilla extract, flour, and salt until smooth. Pour over the French bread. Cover, and refrigerate overnight.\nPreheat oven to 350 degrees F (175 degrees C). Stir together the white sugar and ground cinnamon; sprinkle over the french toast.\nBake in preheated oven until golden brown on top, about 50 minutes.\n",
        "picture_link": "ksHUV05jdiAEmeksn3wTjA8rLQpPwKC"
    },
    {
        "title": "Creamy Edamame Risotto",
        "ingredients": [
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 1/2 cups frozen shelled edamame ADVERTISEMENT",
            "1 tablespoon reduced-sodium soy sauce ADVERTISEMENT",
            "3/4 teaspoon ground ginger ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup Arborio rice ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "4 cups hot water ADVERTISEMENT",
            "1/4 cup crumbled goat cheese ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the sesame oil in a skillet over medium heat. Stir in the edamame, soy sauce, and 3/4 teaspoons of ground ginger. Cook and stir until the edamame is hot and the liquid has evaporated, about 5 minutes. Set aside.\nMeanwhile, heat the olive oil in a large, heavy-bottomed saucepan over medium-high heat. Pour in the rice, and stir until the rice is coated in oil and has started to toast, 2 to 3 minutes. Reduce the heat to medium and stir in the garlic powder and white wine. Let the wine simmer until it has mostly evaporated, then stir in one-third of the hot water; continue stirring until the rice has absorbed the liquid and turned creamy. Repeat this process twice more, stirring constantly. Stirring in the water should take 15 to 20 minutes in all. When finished, the rice should be tender, yet slightly firm.\nStir in the edamame, goat cheese, Parmesan cheese, basil, and 1/4 teaspoon of ground ginger until the cheeses have melted. Season to taste with salt and pepper before serving.\n",
        "picture_link": "rlyIALI6hSBhhdsEdTTi7nD1dxEGngW"
    },
    {
        "title": "Octoberfest Pork Chops",
        "ingredients": [
            "1 (12 fluid ounce) bottle Octoberfest Beer ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon Old Bay Seasoning™ ADVERTISEMENT",
            "1 pinch salt and freshly ground black pepper ADVERTISEMENT",
            "4 boneless pork loin chops, pounded thin ADVERTISEMENT",
            "1/3 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1 cup panko crumbs ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large freezer bag, combine beer, Worcestershire sauce, garlic, Old Bay Seasoning(TM), salt, pepper, and pork chops. Marinate for 30 minutes.\nPreheat the oven to 325 degrees F (165 degrees C). On a large plate, mix panko crumbs and Parmesan cheese. In a shallow bowl, whisk eggs until creamy. Remove pork chops from marinade. Dip each chop in egg, then press into crumb mixture to coat. Transfer chops to non-stick baking pan.\nBake in preheated oven for 25 minutes on one side. Turn chops over and continue cooking for another 25 minutes. Raise temperature to 350 degrees F (175 degrees C), and continue cooking until pork chops achieve an internal temperature of 145 degrees F (63 degrees C) and the coating is crispy.\n",
        "picture_link": "qmBdskdOqf357/OQGnSj08dIYNz6eZe"
    }
]