[
    {
        "title": "Peanut Butter Chip Cookies II",
        "ingredients": [
            "1 cup creamy peanut butter ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 cups buttermilk baking mix ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the peanut butter, shortening, white sugar and brown sugar until smooth. Stir in the water and baking mix. Mix in the chocolate chips. Roll into walnut sized balls and place 2 inches apart onto the prepared cookie sheet. Flatten slightly with the tines of a fork.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "XJK3IEsdhgdIz/KnopI2RZFBrbTJybq"
    },
    {
        "title": "Crab Swiss Bites",
        "ingredients": [
            "1 (6 ounce) can crabmeat, drained and flaked ADVERTISEMENT",
            "1 tablespoon sliced green onion ADVERTISEMENT",
            "1/4 cup shredded Swiss cheese ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/4 teaspoon curry powder ADVERTISEMENT",
            "1 (8 ounce) package dinner rolls ADVERTISEMENT",
            "1 (5 ounce) can water chestnuts, drained and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium bowl, mix together crabmeat, green onion, Swiss cheese, mayonnaise, lemon juice and curry powder.\nSeparate dinner rolls into 3 pieces each. Spoon equal portions of the crabmeat mixture onto the roll pieces. Top with water chestnuts.\nBake in the preheated oven 10 to 12 minutes, or until bubbly and golden brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mark's Delight",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 tablespoons brandy ADVERTISEMENT",
            "1 1/2 cups unbleached all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup golden raisin and cherry dried fruit mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, cream together the butter, brown sugar and white sugar until smooth. Beat in the egg and brandy. Combine the flour and baking soda; stir into the sugar mixture. Mix in the chocolate chips and dried fruit mix. Drop dough by teaspoonfuls onto ungreased cookie sheets. Cookies should be about 2 inches apart.\nBake for 8 to 10 minutes in the preheated oven, cookies taste best when taken from the oven while still slightly doughy. Cool on cookie sheets for a few minutes before removing to wire racks to cool completely.\n",
        "picture_link": "74/1DcD5jEQT/kRCCd7a9tB.HhB0K7O"
    },
    {
        "title": "Creamy Macaroni with Asparagus Without the Cream",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 large clove garlic, crushed ADVERTISEMENT",
            "1 1/2 pounds fresh asparagus, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "3/4 pound ditalini pasta ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 cups boiling water, or as needed ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "3/4 cup grated Romano cheese (such as Locatelli® ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley, plus extra for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat, and cook and stir the garlic until just beginning to turn golden, about 2 minutes. Stir in the asparagus, and cook and stir until the pieces are bright green, about 2 more minutes. Stir in the pasta, tossing to coat with oil, and sprinkle with salt and pepper.\nPour boiling water into the saucepan, and bring back to a boil. This recipe should be as dry as possible. Stir the pasta mixture frequently to prevent sticking, and cook the pasta until tender but still firm to the bite, about 10 minutes. Remove the pot from the heat. If there is excess liquid, drain from the pasta.\nStir the eggs, grated Romano cheese, and parsley together in a bowl. Pour into the pasta mixture, stirring and pouring simultaneously until the eggs cook with the heat of the pasta. Sprinkle with additional parsley leaves, and serve.\n",
        "picture_link": "tvbusskbFh6YnkxN.v2Myl4qudkJK0K"
    },
    {
        "title": "Spicy Creamy Cajun Ham and Black Eyed Peas Salad",
        "ingredients": [
            "2 cups fresh corn kernels ADVERTISEMENT",
            "2 (15 ounce) cans black-eyed peas, rinsed and drained ADVERTISEMENT",
            "1 cup cubed fully cooked ham ADVERTISEMENT",
            "3 stalks celery, finely chopped ADVERTISEMENT",
            "2 tablespoons chopped red onion ADVERTISEMENT",
            "2/3 cup sour cream ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 tablespoon dried cilantro ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "2 dashes hot pepper sauce (such as Tabasco®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the corn into a saucepan, cover with water, and bring to a boil. Reduce heat and simmer until the corn is fully cooked, about 2 minutes. Drain the corn in a colander set in the sink.\nMix together the warm corn, black-eyed peas, ham, celery, and onion in a salad bowl.\nWhisk together the sour cream, ketchup, cilantro, Cajun seasoning, and hot pepper sauce in a bowl until smooth. Stir the dressing lightly into the black-eyed pea mixture until thoroughly mixed. Serve immediately.\n",
        "picture_link": "7Bg/HTKkHl4QncsqjtwEIBHf6A7com2"
    },
    {
        "title": "Blue Cheese and Asparagus Pizza",
        "ingredients": [
            "1 bunch asparagus, trimmed and snapped into pieces ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1/2 cup pizza sauce ADVERTISEMENT",
            "1 (14 ounce) prebaked pizza crust (such as Boboli®) ADVERTISEMENT",
            "3/4 cup crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nPlace asparagus on a baking sheet; drizzle with olive oil and sprinkle with salt and pepper.\nBake the asparagus in the preheated oven for 10 minutes.\nWhile asparagus is baking, spread the pizza sauce over the pizza crust. Distribute asparagus pieces and crumbles of blue cheese evenly over the pizza.\nReturn pizza to center rack of preheated oven; bake until the cheese is melted and bubbling, 8 to 10 more minutes.\n",
        "picture_link": "HwMo7IndVeMR/UKe8zF4idb/OFkeVlu"
    },
    {
        "title": "Adobong Pusit (Squid Adobo)",
        "ingredients": [
            "2 1/4 pounds squid, cleaned ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the squid, vinegar, and water in a small pot over medium heat; season with salt and pepper. Cook for 10 minutes.\nMeanwhile, heat the olive oil in a saucepan over medium heat; cook and stir the onion and garlic in the hot oil until softened, 5 to 7 minutes. Stir the tomato and soy sauce into the mixture. Pour the squid mixture into the saucepan and bring to a simmer; cook together another 20 minutes.\n",
        "picture_link": "5nHXoBKJ3EQAMd1/KkjK0GJKjPxPFKG"
    },
    {
        "title": "Moist Passover Apple Cake",
        "ingredients": [
            "2 tablespoons vegetable shortening, room temperature ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup matzo cake meal ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "4 Granny Smith apples - peeled, cored, and quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish with vegetable shortening.\nBeat egg whites in a metal, glass, or ceramic bowl with an electric mixer until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Set aside.\nPlace the egg yolks, oil, and orange juice into a mixing bowl; beat with an electric mixer until creamy and thick, about 5 minutes. Stir in 1 cup of sugar, mixing well, then lightly stir in the matzo cake meal and salt. Use a rubber spatula or wire whisk to fold about 1/3 of the beaten egg whites into the matzo meal mixture. Gently run the spatula through the center of the mixture, then around the sides of the bowl, repeating until fully incorporated. Add the remaining egg whites, folding until just incorporated.\nMix together 3/4 cup of sugar with cinnamon in a bowl. Spread half the batter into the prepared baking pan; distribute the apple quarters evenly over the batter. Sprinkle the apple pieces with about 1/2 cup of the sugar-cinnamon mixture, spread the remaining batter over the apples; sprinkle the remaining sugar-cinnamon mixture over the top of the cake.\nBake in the preheated oven until the cake is golden brown, about 45 minutes. Cut into squares while still warm.\n",
        "picture_link": "1Yp6tdJR8HX6/u6sV/bUQc7hHrkedcm"
    },
    {
        "title": "Aunt Martha's Jewish Coffee Cake",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "3/4 cup white sugar (optional) ADVERTISEMENT",
            "1 tablespoon ground cinnamon (optional) ADVERTISEMENT",
            "1 pinch ground nutmeg (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan. Combine flour, baking powder, baking soda, and salt in a bowl.\nBeat the butter and 1 1/2 cups of sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg. Pour in the flour mixture alternately with the sour cream, mixing until just incorporated.\nMix walnuts, 3/4 cup of sugar, cinnamon, and nutmeg in a bowl. Fold half of the walnut mixture into the batter; mixing just enough to evenly combine. Pour the batter into the prepared pan, then sprinkle the remaining walnut mixture on top.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "keUwBFwJH/HhR9IlcR5evohTCWbYpbK"
    },
    {
        "title": "Mexican Mole Poblano Inspired Chili",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 cups chopped onions ADVERTISEMENT",
            "1 cup chopped green pepper (optional) ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies (optional) ADVERTISEMENT",
            "8 large garlic cloves, chopped ADVERTISEMENT",
            "3 pounds cubed beef stew meat ADVERTISEMENT",
            "5 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes in puree ADVERTISEMENT",
            "1 (14.5 ounce) can beef broth ADVERTISEMENT",
            "1 (12 fluid ounce) bottle dark beer ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (15 ounce) can chili beans ADVERTISEMENT",
            "2 (1 ounce) squares bittersweet chocolate, chopped ADVERTISEMENT",
            "salt and pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large, heavy pot over medium-high heat. Stir in onions, green peppers, green chilies, and garlic. Cook and stir until onions are soft and translucent, about 8 minutes. Add the stew meat to the pot, cook until well browned, about 5 minutes.\nStir the chili power, cumin, basil, cayenne pepper, crushed red pepper, oregano, thyme, bay leaf, and cinnamon stick into the pot. Cook and stir until spices are aromatic, about 2 minutes.\nPour the crushed tomatoes, beef broth, and beer into the pot; stir in the tomato paste. Bring chili to a simmer and cook until beef is very tender and the liquids have thickened, about 1 hour and 15 minutes.\nMix the chili beans and chocolate into the chili. Simmer until the chocolate has melted and the chili is hot, 5 minutes. Remove cinnamon stick and bay leaf. Season to taste with salt and pepper.\n",
        "picture_link": "13PNkDPS0lR2EmN.26cAuFZm4eqZBrO"
    },
    {
        "title": "Grandma's Coconut Corn Flake Cookies",
        "ingredients": [
            "4 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups corn flake cereal ADVERTISEMENT",
            "1 cup sweetened flaked coconut ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Line baking sheets with parchment paper sprayed with cooking spray.\nBeat the egg whites in a bowl with an electric mixer until they form stiff peaks. Gradually beat in the sugar, adding about 2 tablespoons at a time. Beat in the salt and vanilla extract until the mixture is glossy and holds its shape. Gently and lightly use a rubber spatula to fold the corn flakes, coconut, and walnuts into the meringue. Gently run the spatula through the center of the bowl, then around the sides of the bowl, repeating until fully incorporated. Drop the mixture by rounded tablespoons onto the prepared baking sheets.\nBake in the preheated oven until the cookies are very lightly browned and set, 20 to 30 minutes. Let cool completely before removing with a metal spatula; warm cookies are very fragile.\n",
        "picture_link": "d4i2HSEZFEf6XgqpFAWRAhMV2d.JGHe"
    },
    {
        "title": "Dad's Best Haroset",
        "ingredients": [
            "3 apples - peeled, cored, and diced ADVERTISEMENT",
            "1 cup walnuts, chopped ADVERTISEMENT",
            "1 cup pecans, chopped ADVERTISEMENT",
            "1 cup kosher red wine (such as Manischewitz®) ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the apples, walnuts, pecans, and wine together in a large bowl. Season with cinnamon, stir, and refrigerate until chilled, about 30 minutes.\n",
        "picture_link": "3J.yIWDSGopilF4aLv2j3eDOuRCBtZy"
    },
    {
        "title": "Matzoh Candy",
        "ingredients": [
            "4 1/2 sheets of salted matzo ADVERTISEMENT",
            "1 cup margarine ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "8 ounces chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x9-inch baking dish.\nCover the bottom of the prepared dish with matzohs, breaking and fitting pieces into spaces as needed.\nCook the margarine and brown sugar in a heavy-bottomed saucepan over medium-low heat until the mixture is well combined and bubbling, about 3 minutes; pour over the matzohs in the baking dish.\nBake in the preheated oven until the syrup is thickened and bubbling, about 15 minutes. Remove from the oven and sprinkle evenly with chocolate chips. Let the candy stand for 5 minutes to melt the chocolate, then spread the melted chocolate evenly over the candy with a spatula. Cool completely and break into pieces to serve.\n",
        "picture_link": "dTMEmaeIhdJl6aFV6Ih4PJrJ6mCR9.i"
    },
    {
        "title": "Empanada Pork Filling",
        "ingredients": [
            "1 pound ground pork ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (9 ounce) box frozen peas and carrots ADVERTISEMENT",
            "1 (1.5 ounce) box raisins ADVERTISEMENT",
            "1 small potato, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the ground pork in a nonstick skillet over medium heat until completely browned, about 5 minutes. Season with salt and pepper.\nHeat the olive oil in a separate skillet over medium heat; cook the onion and garlic in the hot oil until the onion is translucent, about 5 minutes. Stir the browned pork into the onion mixture; cook and stir another 5 minutes. Mix the potato, peas and carrots, and raisins into the pork; allow the mixture to cook together until the vegetables are completely tender, about 10 minutes. Allow the filling to cool completely before spooning into empanada dough.\n",
        "picture_link": "XlVbnFUt3k6MN8/M8S2ygy20ENLVyPC"
    },
    {
        "title": "Turron Jijona (Spanish-Style Nougat Candy)",
        "ingredients": [
            "1 cup orange blossom honey ADVERTISEMENT",
            "1 cup finely ground almonds ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "1/8 teaspoon lemon zest (optional) ADVERTISEMENT",
            "1 egg whites, beaten stiff ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the honey into a saucepan and warm over medium-low heat to 140 degrees F (60 degrees C). Stir the almonds into the warm honey and remove from heat. Mix the egg yolks, cinnamon, and lemon zest into the almonds. Fold the egg whites into the mixture.\nLine a dish with parchment paper. Pour the mixture onto the parchment paper and smooth to a 1/2-inch layer. Place a sheet of parchment paper atop the mixture and then place a cutting board over the paper; place a few items on top of the cutting board to give it some weight.\nAllow the turron to dry for 3 days. Cut into 1-inch squares to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fried Whole Tilapia with Basil and Chilies",
        "ingredients": [
            "1 whole (10 ounce) fresh tilapia, cleaned and scaled ADVERTISEMENT",
            "1 quart oil for deep frying ADVERTISEMENT",
            "2 tablespoons cooking oil ADVERTISEMENT",
            "5 large red chili peppers, sliced ADVERTISEMENT",
            "5 cloves garlic, chopped ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "2 tablespoons light soy sauce ADVERTISEMENT",
            "1/4 cup Thai basil leaves ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 quart oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). If you do not have a thermometer, then dip the head of the fish into the oil; if it sizzles, it is ready, if it does not sizzle, then wait a couple minutes and try again.\nRinse the fish and dry well. Make several angled slits along the body of the fish, cutting down to the rib bones. Make two lateral slits along the back of the fish, from head to tail, on either side of the dorsal fin. These cuts will ensure quick cooking and maximum crispiness.\nGently slip the fish into the oil and fry until crispy, 7 to 10 minutes. Carefully remove the fish from the oil and let it drain on paper towels. Place on a large serving platter.\nWhile the fish drains, heat 2 tablespoons oil in a large skillet. Cook and stir the chili peppers, garlic, and onion in the hot oil until lightly browned, 5 to 7 minutes. Stir the fish sauce and soy sauce into the mixture, remove from heat, and fold the Thai basil and cilantro into the mixture. Pour the sauce over the fish to serve.\n",
        "picture_link": "qivHyGJx0LgOMl5V1YwAVq9tOEwoE9W"
    },
    {
        "title": "Pork Chops with Praline Sauce",
        "ingredients": [
            "4 pork chops ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "3/4 cup evaporated milk ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium-high heat, cook the pork chops until no longer pink in the center, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\nMelt the butter in a saucepan; stir the brown sugar into the melted butter until smooth. Add the evaporated milk and stir; bring the mixture to a boil and immediately remove from heat. Stir the corn syrup into the milk mixture; fold the pecans into the sauce. Spoon the sauce over the pork chops to serve.\n",
        "picture_link": "syCR4PBegbs7MNEI3g3HGdthqXIYZvC"
    },
    {
        "title": "Wasabi Pea Gnocchi",
        "ingredients": [
            "2 cups mashed potatoes ADVERTISEMENT",
            "3/4 cup frozen green peas, thawed ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon wasabi paste, or to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "2 cups all-purpose flour, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process the potatoes, peas, garlic, ginger, wasabi, salt, and pepper in a food processor until the mixture is evenly green. Add the egg and process again until the egg is just incorporated. Add 1 cup of the flour and process until just mixed; transfer to a bowl. Being careful to not over mix, gently work the remaining cup of flour into the mixture until it forms a sticky dough. Cover with plastic wrap and store in refrigerator until chilled to help make it easier to roll.\nWorking on a well-floured surface with about 1/2 cup of the mixture at a time, roll into a rope about 1/2 inch in diameter. Cut the rope into 1-inch segments using a floured knife. Continue until all the dough has been used.\nBring a large pot of lightly-salted water to a boil. Add the gnocchi, making sure to not overcrowd in the pot; return to a boil. Cook until the gnocchi floats to the top, about 3 minutes; drain.\n",
        "picture_link": "u5YAp2nhfljG8keYfqRR0z9r/c0aFUa"
    },
    {
        "title": "Japanese Shrimp Sauce",
        "ingredients": [
            "2 cups mayonnaise ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon garlic juice ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "1 teaspoon ground mustard ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, water, sugar, paprika, garlic juice, ketchup, ground ginger, hot pepper sauce, ground mustard, salt, and white pepper together in a bowl.\n",
        "picture_link": "doHrcfENpNTDHe6QkmfQxCN8pvFLIoC"
    },
    {
        "title": "Mango Orange Sorbet",
        "ingredients": [
            "4 cups chilled cubed mango ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the mango, water, and orange juice in a blender on medium-low speed until smooth. Add the sugar and blend until incorporated.\nPour into an ice cream maker and freeze according to the manufacturer's instructions.\n",
        "picture_link": "XVHtCsDNHJDplXYKAaylwUkhihnlybO"
    },
    {
        "title": "Nasty Cake",
        "ingredients": [
            "1 (18.25 ounce) box devil's food cake mix ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare batter and bake cake as directed on the package.\nAbout 5 minutes before the cake is finished baking, melt the butter in a large saucepan to allow for foaming, and stir in the evaporated milk. Bring the mixture to a boil over medium heat, and stir in the corn syrup and sugar. Bring back to a boil, stir to dissolve sugar, turn off the heat, and add the baking soda. Stir continuously until the baking soda is mixed in and stops foaming, about 2 minutes.\nRemove the cake from the oven, and poke holes in the hot cake with a butter knife or the end of a wooden spoon. Pour the syrup over the hot cake, and let cool before cutting.\n",
        "picture_link": "clv7weH1kO39yOt.7dATkLgG.gE9y6m"
    },
    {
        "title": "Spiced Tomato Jam/Butter",
        "ingredients": [
            "2 1/4 pounds tomatoes, peeled and chopped ADVERTISEMENT",
            "1 1/2 teaspoons lemon zest ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or more to taste ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 (1.75 ounce) package powdered pectin ADVERTISEMENT",
            "4 1/2 cups white sugar ADVERTISEMENT",
            "6 (1 pint) canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomatoes in a saucepan with a lid and simmer over medium heat, stirring frequently, for 10 minutes. Stir the lemon zest, allspice, cinnamon, cloves, lemon juice, and pectin into the tomatoes. Place the saucepan over high heat. Stirring constantly, bring the tomato mixture to a boil; immediately upon boiling, stir the sugar into the tomato mixture and return to a full rolling boil. Allow to cook at a full boil for 1 minute while stirring. Remove from heat and skim any foam off the surface of the mixture.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the tomato jam into the hot, sterilized jars, filling the jars to within 1/2 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 5 minutes.\nRemove the jars from the stockpot and place several inches apart onto a cloth-covered or wood surface; allow to sit until cool or overnight. Check the seal by pressing the top of each lid with a finger (the lid should not move up or down at all).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cajun-Style Eggs Benedict",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "4 large buttermilk biscuits, halved ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 pound andouille sausage, halved then cut into 2-inch pieces ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a small saucepan over medium-low heat. Whisk in the flour, and stir until the mixture becomes paste-like and light golden brown, about 3 minutes. Gradually whisk the milk into the flour mixture, and cook over low heat. Cook and stir until the mixture is thick and smooth, about 10 minutes. Stir in the Parmesan cheese and hot sauce; season to taste with salt and pepper. Keep warm over low heat.\nMeanwhile, warm the biscuits in a toaster oven and keep warm. Heat the vegetable oil in a large skillet over medium heat. Place the andouille pieces into the skillet cut-side-down. Cook until golden brown, then turn over and cook until browned on the skin side; remove and keep warm. Reduce the heat to medium-low. Crack four of the eggs into the hot pan, and cook until the egg whites have firmed about halfway through, about 1 minute. Gently flip the eggs over, and cook 10 to 20 seconds more until the other side has just firmed on the outside. Repeat with the remaining eggs.\nTo assemble, place two biscuit halves onto each plate, cut-side-up. Divide the andouille sausage among the biscuits, then top each biscuit with an egg. Finally, spoon some of the sauce over each egg and serve.\n",
        "picture_link": "5Tsxz8rn6JS8OveLxWr1bSSlD3piYQm"
    },
    {
        "title": "Mango Peach Banana Smoothie",
        "ingredients": [
            "1 (16 ounce) can mango nectar ADVERTISEMENT",
            "1 cup peach yogurt ADVERTISEMENT",
            "1 cup vanilla frozen yogurt ADVERTISEMENT",
            "1 1/2 cups frozen peach slices ADVERTISEMENT",
            "1 frozen banana, cut into chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mango nectar, peach yogurt, and frozen yogurt in pitcher of a blender; add peach slices and banana chunks. Blend until smooth, 30 seconds to 1 minute.\n",
        "picture_link": "4DGRDRwu196jASgUsAF9Ct1ZeiqtXN2"
    },
    {
        "title": "Healthy Strawberry Muffins",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "2 tablespoons stevia sugar substitute (such as Truvia®) ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup almond milk ADVERTISEMENT",
            "1/4 cup egg substitute (such as Egg Beaters®) ADVERTISEMENT",
            "3 tablespoons unsweetened applesauce ADVERTISEMENT",
            "1 tablespoon unsalted butter, melted ADVERTISEMENT",
            "1/2 teaspoon pure vanilla extract ADVERTISEMENT",
            "1 cup sliced fresh strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line 6 muffin cups with paper liners; spray the inside of each paper liner with cooking spray.\nMix flour, sugar substitute, baking powder, and salt together in a bowl. Whisk almond milk, egg substitute, applesauce, butter, and vanilla extract together in a separate bowl; stir almond milk mixture into flour mixture. Fold in strawberries. Spoon batter into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, 20 to 22 minutes.\n",
        "picture_link": "Rsz0KyYuKowrHR1ywbqe9EeFo848SvS"
    },
    {
        "title": "Easy Creamed Pearl Onions",
        "ingredients": [
            "1 pound pearl onions ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 1/2 cups light cream ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place onions into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 10 minutes. Drain.\nMelt butter in a large skillet over medium heat; cook and stir flour and nutmeg in melted butter for about 5 minutes; season with salt and pepper. Add cream to flour mixture; cook and stir until bubbly and thick, about 5 minutes more. Stir onion and parsley into cream sauce until heated through, 2 to 3 minutes.\n",
        "picture_link": "RvmLv5vXPOswFRwVEdpUI38NYIufcM."
    },
    {
        "title": "Shepherd's Pie from Birds Eye®",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (14 ounce) bag Birds Eye® Recipe Ready Mirepoix ADVERTISEMENT",
            "1 tablespoon chopped parsley (optional) ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 (24 ounce) container refrigerated prepared mashed potatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F.\nBrown beef in large nonstick skillet; drain fat.* Add tomatoes and Recipe Ready Mirepoix and bring to a boil over high heat. Reduce heat to low and simmer 10 minutes. Stir in parsley and salt.\nTurn mixture into 1-1/2 quart casserole dish. Evenly top with mashed potatoes.\nBake 20 minutes or until potatoes are golden and mixture is bubbling.\n",
        "picture_link": "KbjYox7pRQjD4aiAMZ0i.5jm20nxQ9C"
    },
    {
        "title": "Super Stuffed Meatloaf",
        "ingredients": [
            "Meatloaf: ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 1/3 cups dry bread crumbs ADVERTISEMENT",
            "1 egg, slightly beaten ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon chopped fresh garlic ADVERTISEMENT",
            "1 1/2 teaspoons Italian seasoning ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 (6 ounce) package portobello mushroom caps, chopped ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together ground beef, bread crumbs, egg, 1/2 a chopped onion, milk, Worcestershire sauce in a bowl; season with garlic, Italian seasoning, dry mustard, salt, and black pepper. Transfer the meat mixture to a piece of waxed paper or aluminum foil and flatten to a 1/2-inch thick rectangle.\nMelt butter in a skillet over medium heat. Cook and stir yellow onion and mushrooms in melted butter until the onion is translucent and mushrooms soft, about 5 minutes. Remove from heat to cool.\nSpread filling mixture into center of meat rectangle. Sprinkle Cheddar cheese over filling, leaving a bit of space at one end for easier rolling and sealing. Pick up the edge of the waxed paper or foil to roll the flattened meat into a log around the filling. Seal the ends and seam and place the loaf into a 9x5-inch loaf pan.\nBake in the preheated oven until oil from the cheese begins to pool, about 30 minutes. Drain oil and continue baking until the meat is no longer pink in the center, about 30 to 60 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "rQOylGND7Fxjs78xAq/jZsOFeePgkJy"
    },
    {
        "title": "All-Purpose No-Salt Seasoning Mix",
        "ingredients": [
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1 1/4 teaspoons dried savory ADVERTISEMENT",
            "1 1/4 teaspoons ground thyme ADVERTISEMENT",
            "1 teaspoon ground mace ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix garlic powder, basil, parsley, savory, thyme, mace, onion powder, black pepper, sage, and cayenne pepper in a bowl; store in a sealed jar.\n",
        "picture_link": "9Dp78JrpeWWTrX.ORI1PkONQng/UpVW"
    },
    {
        "title": "Haddock Citrine",
        "ingredients": [
            "1 pound haddock fillets ADVERTISEMENT",
            "1 teaspoon salt-free seasoning blend (such as Mrs. Dash®) ADVERTISEMENT",
            "2 oranges, zested and juiced ADVERTISEMENT",
            "3/4 cup panko bread crumbs ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons buttery spread (such as Smart Balance®), melted ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon ground thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange haddock fillets in a large baking dish. Season with salt-free seasoning blend. Pour orange juice over fish and cover with plastic wrap, reserve orange zest. Marinate in the refrigerator for at least 2 hours.\nPreheat oven to 425 degrees F (220 degrees C).\nStir panko bread crumbs, Parmesan cheese, buttery spread, parsley, thyme, and reserved orange zest in a bowl until well mixed. Press crumb mixture over haddock.\nBake in the preheated oven until fish is easily flaked with a fork and topping is golden brown, 20 to 25 minutes. Allow fish to rest 5 minutes before serving.\n",
        "picture_link": "iY2Y8xqv6hRHJmpPrZ2e1hY9WAgMtIy"
    },
    {
        "title": "Martha White \"Hot Rize\" Biscuits",
        "ingredients": [
            "Crisco® Original No-Stick Cooking Spray ADVERTISEMENT",
            "2 cups Martha White® Self-Rising Flour ADVERTISEMENT",
            "1/4 stick Crisco® Baking Sticks All-Vegetable Shortening* ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 450 degrees F. Spray a cookie sheet lightly with no-stick cooking spray. Place flour in large bowl. Cut in shortening with pastry blender or fork until mixture resembles coarse crumbs. Add milk; stir with fork until soft dough forms and mixture begins to pull away from sides of bowl.\nKnead dough on lightly floured surface just until smooth. Roll out dough to 1/2-inch thickness. Cut with floured 2-inch round cutter. Place biscuits with sides touching on prepared cookie sheet.\nBake 10 to 12 minutes or until golden brown. Serve warm.\n",
        "picture_link": "UVMxyFiUMrKk1EuxAa.QKKzE10LkDOi"
    },
    {
        "title": "Sourdough Croutons",
        "ingredients": [
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 1/2 teaspoons Italian seasoning ADVERTISEMENT",
            "1/4 teaspoon extra-virgin olive oil ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "6 slices sourdough bread, cut into 1/2-inch cubes ADVERTISEMENT",
            "2 teaspoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nCombine melted butter, Italian seasoning, olive oil, and kosher salt in a large bowl; add bread cubes and toss to coat. Sprinkle Parmesan cheese over the bread cubes; toss to coat. Spread onto a baking sheet.\nBake in preheated oven, stirring occasionally, until lightly browned, about 20 minutes.\n",
        "picture_link": "it9p2CBgXNyZpmanssGRcb.w7S9ZYn6"
    },
    {
        "title": "Camarones a la Diabla",
        "ingredients": [
            "1 teaspoon butter ADVERTISEMENT",
            "1 pound uncooked medium shrimp ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste (optional) ADVERTISEMENT",
            "1 cup ketchup, or to taste ADVERTISEMENT",
            "1 cup hot pepper sauce (such as Tapatio®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat; cook and stir shrimp in melted butter until slightly pink. Season with salt and pepper. Add ketchup and hot pepper sauce. Continue to cook and stir shrimp until they are bright pink on the outside and the sauce is bubbly, 7 to 10 minutes.\n",
        "picture_link": "jdhon/cfh6zmVyyWQasWeySz8i2W8H."
    },
    {
        "title": "Hummus Egg Salad",
        "ingredients": [
            "3 hard-boiled egg whites, chopped ADVERTISEMENT",
            "3 tablespoons prepared hummus ADVERTISEMENT",
            "1 pinch celery seed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 dash hot pepper sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chopped egg whites, hummus, celery seed, salt, black pepper, and hot pepper sauce in a bowl. Refrigerate for 2 hours to overnight.\n",
        "picture_link": "yd.8w.JVS6ogNLJmTgSRf7wuJ26Vch."
    },
    {
        "title": "Gunnar and Raven's Burgundy Sauce",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2/3 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2/3 cup beef broth ADVERTISEMENT",
            "1 cup Burgundy wine ADVERTISEMENT",
            "1 pinch dried basil, or to taste ADVERTISEMENT",
            "1 pinch dried oregano, or to taste ADVERTISEMENT",
            "1 1/2 cups sliced baby portobello mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter and olive oil in a large skillet over low heat; cook and stir onion and garlic in the hot butter-oil mixture until onion is transparent, 5 to 10 minutes. Add flour and slowly pour in beef broth while stirring constantly until flour is smoothly mixed into the broth and vegetables.\nStir Burgundy wine into onion-flour mixture; season with basil and oregano. Bring mixture to a simmer; add mushrooms. Cook and stir until sauce is thickened, about 10 minutes.\n",
        "picture_link": "dLGo9rWyaXKWbBhPhDPjw2Ba7I6l5Z2"
    },
    {
        "title": "Quick and Easy Huevos Rancheros",
        "ingredients": [
            "8 corn tostada shells ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "1 (7 ounce) can chipotle peppers in adobo sauce ADVERTISEMENT",
            "1/2 (8 ounce) jar salsa ADVERTISEMENT",
            "2 cups chopped fresh cilantro, divided ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1 tablespoon butter, or as needed ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 500 degrees F (260 degrees C).\nArrange tostada shells on a baking sheet. Spread a layer of refried beans onto each shell; sprinkle each shell with about 1 tablespoon Cheddar cheese.\nCombine chipotle peppers in adobo sauce, salsa, and 1 cup cilantro in a saucepan over medium heat; cook and stir until warm, about 5 minutes.\nPut black beans in a microwave-safe bowl; heat in microwave until warm, about 1 minute.\nHeat butter in a skillet over medium heat; cook each egg in the melted butter until white is firm and yolk is still together, 2 to 3 minutes. Carefully place each cooked egg atop a tostada shell; sprinkle with remaining Cheddar cheese.\nBake tostadas in the preheated oven until cheese is melted, about 10 minutes.\nPlace each tostada on a plate; top with salsa mixture and cilantro. Spoon black beans on the side.\n",
        "picture_link": "5DsSVAdDlXsp0J7yrREhuCkx3t7UptS"
    },
    {
        "title": "Banana Sorbet",
        "ingredients": [
            "1 frozen banana ADVERTISEMENT",
            "1 teaspoon cold water ADVERTISEMENT",
            "2 teaspoons caramel sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse banana and water in a food processor until chunky; add caramel sauce. Blend until completely smooth.\n",
        "picture_link": "67N7VwBu0s./ij97Tiy1lmXwFvTUI9."
    },
    {
        "title": "Chicken Broth",
        "ingredients": [
            "14 quarts water ADVERTISEMENT",
            "2 (5 pound) whole chickens, skinned and trimmed of fat ADVERTISEMENT",
            "4 pounds carrots, cut into chunks ADVERTISEMENT",
            "3 pounds celery, cut into chunks ADVERTISEMENT",
            "3 large sweet onions, cut into chunks ADVERTISEMENT",
            "6 leeks, trimmed and chopped ADVERTISEMENT",
            "14 tablespoons sea salt ADVERTISEMENT",
            "3 tablespoons chopped garlic ADVERTISEMENT",
            "3 tablespoons garlic powder ADVERTISEMENT",
            "2 tablespoons crushed dried rosemary ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 tablespoon dried thyme ADVERTISEMENT",
            "1 bunch fresh parsley, chopped (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, chicken, carrots, celery, onions, leeks, sea salt, garlic, garlic powder, rosemary, dried parsley, and dried thyme in a large stock pot; partially cover pot with a lid. Bring mixture to a boil, reduce heat, and simmer until chicken is fully cooked and falling off the bone, about 2 hours.\nRemove chicken from pot. Stir in fresh parsley until wilted, 2 to 3 minutes. Remove broth from heat and allow to cool slightly. Strain broth into freezable 2 to 4 cup containers. Use immediately or freeze.\n",
        "picture_link": "hCCgBy4/kdDnqF0qwAPed7JyW8N.tNy"
    },
    {
        "title": "Harvest Pasta Bake with PHILADELPHIA Cooking Creme",
        "ingredients": [
            "1 (2 pound) butternut squash, peeled and cut into 1-inch cubes ADVERTISEMENT",
            "1 red onion, cut into 1 inch pieces ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 cups rigatoni pasta, uncooked ADVERTISEMENT",
            "1 (10 ounce) tub Philadelphia Italian Three Cheese Cooking Creme ADVERTISEMENT",
            "2 cups KRAFT 4 Cheese Italiano Shredded Cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F.\nCombine first 4 ingredients in 13x9-inch baking dish sprayed with cooking spray.\nBake 30 to 40 min. or until squash is tender. Meanwhile, cook pasta as directed on package, omitting salt.\nDrain pasta, reserving 1/3 cup cooking water. Add to squash mixture with Cooking Creme, reserved water and 1 cup shredded cheese; mix lightly. Top with remaining shredded cheese.\nBake 20 min. or until heated through.\n",
        "picture_link": "zNJzEYE.eraQrGsE59XHuZlW4uamukm"
    },
    {
        "title": "Double Coco Double Chocolate Chip Cookies (a twist on Toll House® cookies)",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup cocoa powder, or more to taste ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips, or more to taste ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix flour, cocoa powder, salt, and baking soda together in a large bowl. Whisk white sugar, brown sugar, butter, shortening, eggs, and vanilla extract together in a separate bowl until smooth. Stir sugar mixture into flour mixture until just combined. Fold in chocolate chips and walnuts.\nSpoon batter, 1 to 2 tablespoons per cookie, onto a baking sheet.\nBake in the preheated oven until cookies are browned, 10 to 15 minutes. Cool cookies for 5 minutes on the baking sheet before serving.\n",
        "picture_link": "vh0bQOhA2y0Tz1/JngRZTQlVIcW6PpC"
    },
    {
        "title": "Jamaican Jerk Sauce",
        "ingredients": [
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1/2 cup peanut oil ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "3 tablespoons ground allspice ADVERTISEMENT",
            "3 habanero peppers ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger, peeled ADVERTISEMENT",
            "5 cloves garlic, peeled ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1/4 cup dark brown sugar ADVERTISEMENT",
            "2 tablespoons chopped fresh thyme ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1 tablespoon whole black peppercorns ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend green onions, peanut oil, vinegar, allspice, habanero peppers, ginger, garlic, lime juice, brown sugar, thyme, soy sauce, ketchup, peppercorns, and cinnamon in a blender until smooth.\n",
        "picture_link": "g7rZ.k5tl5OllGXzMqtmxRG/sRoBF6e"
    },
    {
        "title": "Chicken Alfredo Pita Pizza",
        "ingredients": [
            "olive oil, divided ADVERTISEMENT",
            "6 small frozen chicken tenders, thawed and sliced ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "1/4 cup garlic hummus ADVERTISEMENT",
            "4 pita bread rounds ADVERTISEMENT",
            "4 teaspoons basil pesto ADVERTISEMENT",
            "1/2 cup prepared Alfredo sauce ADVERTISEMENT",
            "1 cup fresh spinach leaves, chopped ADVERTISEMENT",
            "1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "3/4 cup crumbled feta cheese ADVERTISEMENT",
            "3/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon olive oil in a skillet over medium heat. Season chicken with garlic salt; cook and stir in hot oil until no longer pink in the middle, about 5 minutes. Set aside to cool.\nSpread 1 tablespoon hummus over one side of each of the pita rounds nearly to the edges. Top with layers of pesto and alfredo sauce. Sprinkle a layer of chopped spinach over the alfredo sauce; top with even portions of chicken, artichoke hearts, feta cheese, mozzarella cheese, Parmesan cheese, and mushrooms. Drizzle remaining olive oil over the pizzas.\nBake in preheated oven until cheese is melted and crust on pitas is slightly brown, about 15 minutes.\n",
        "picture_link": "nU2fkMMlgGrAwZIoW5AsxzD4dKYsouS"
    },
    {
        "title": "Mulberry Preserves",
        "ingredients": [
            "6 cups mulberries ADVERTISEMENT",
            "1 tablespoon water, or more as needed ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 (3 ounce) package strawberry-flavored gelatin (such as Jell-O®) ADVERTISEMENT",
            "1 (1.75 ounce) package powdered fruit pectin ADVERTISEMENT",
            "8 half-pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mulberries and 1 tablespoon water in a large pot; bring to a boil. Reduce heat, cover pot, and simmer, stirring frequently, until berries are softened, 15 to 20 minutes. Mash berries using a potato masher.\nCombine 2 cups water, sugar, strawberry-flavored gelatin, and pectin in a bowl; stir until gelatin is dissolved. Stir gelatin mixture into mashed mulberries; bring mixture to a boil.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the boiling mulberry mixture into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for about 15 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "gftJaXsX67NcdrrhLY25CfBbwFaTpbK"
    },
    {
        "title": "Memphis Style Back Ribs",
        "ingredients": [
            "Dry Rub: ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup kosher salt ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 1/2 teaspoons dry mustard ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed ADVERTISEMENT",
            "1/4 cup prepared yellow mustard ADVERTISEMENT",
            "Apple juice, in a spray bottle ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "About 30 minutes before smoking, make the dry rub. Combine all ingredients in a small bowl; mix well.\nSpread both sides of ribs with yellow mustard and sprinkle with dry rub. Let stand at room temperature for 30 minutes.\nHeat charcoal or gas grill for indirect cooking at 250 degrees F. Place the ribs, meaty side up, over a drip pan and cook for 4 to 6 hours until very tender. Spritz ribs occasionally with water or apple juice using a spray bottle. Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nLet ribs stand 10 to 15 minutes before serving.\n",
        "picture_link": "YanPV9J9iCQ0plHHL4lHJw81D8EYq0G"
    },
    {
        "title": "Sesame Raisin Cookies",
        "ingredients": [
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup sesame seeds ADVERTISEMENT",
            "1 cup brown rice flour ADVERTISEMENT",
            "1 1/4 cups rolled oats ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/8 cups unsweetened apple juice ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring 3/4 cup of water to boil and add the raisins. When the water returns to a boil turn off the heat. Let the raisins plump for at least 10 minutes. Drain the raisins well, then chop them coarsely.\nToast the sesame seeds by stirring them with a wooden spoon in a heavy saute pan over medium heat. Saute until the seeds begin to crackle, pop and smell toasted; about 10 minutes.\nCombine rice flour, oats, salt and toasted sesame seeds. Stir apple juice, oil and vanilla into the flour mixture.\nForm the dough into 8 large balls. Place each ball on greased cookie sheets or parchment paper. Moisten your fingers and flatten each ball until it is 1/2 inch thick.\nBake 25 minutes or until golden brown. Let cool on pans before removing.\n",
        "picture_link": "YA9qmqS829g4W/uMt9cE2wxfWEhms4S"
    },
    {
        "title": "Vanilla Wafers III",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 egg ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a cookie sheet.\nIn a medium bowl, cream together the butter, shortening, and sugar. Gradually add eggs and vanilla while mixing. Stir in the flour and salt. Drop cookie dough by tablespoonfuls onto the prepared cookie sheet. Flatten with the bottom of a glass. Bake in the preheated oven for 10 minutes, until edges are delicately browned. Remove from cookie sheet immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Krusczyki",
        "ingredients": [
            "14 egg yolks ADVERTISEMENT",
            "1 pint sour cream ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "8 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups shortening ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl mix together all ingredients. Stir into a ball, then turn dough out onto a floured surface . Knead dough for 1/2 hour. If you have a mixer with a dough hook attachment, mix for about 15 minutes.\nLet dough rest for 10 minutes.\nOn a floured surface, roll out dough to 1/4 to 1/8 inch thickness. Cut into strips that are 3 inches long and 1 inch wide. In the center of each strip, cut a 1 inch slit, lengthwise. Pull one end of the strip through the slit to form a bow.\nIn a frying pan or an electric skillet, melt shortening and heat to about 350 degrees F (175 degrees C). in a frying pan this would be on medium high heat.\nPlace cookies in hot oil. Cook on both sides until lightly browned then remove to a paper towel.\nDust finished cookies with confectioners sugar.\n",
        "picture_link": "LXKf4ooCaXh.rEEWiRtvs9Yf631Z8tm"
    },
    {
        "title": "Sweet Persimmon Fireside Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup cake flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "2 ripe persimmons, pureed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease one 9x13 inch baking pan.\nSift together all-purpose flour, cake flour, cinnamon, ginger, baking soda and salt.\nIn a medium bowl, cream butter, sugar, and lemon rind until fluffy and smooth. Blend in egg and persimmon pulp and mix until well combined.\nGradually stir in the flour mixture and mix until well blended.\nPour the batter into the prepared pan and spread evenly.\nBake for 25 minutes in the preheated oven, until golden brown. Remove from the oven and let cool. When the bars are completely cool, sift confectioners' sugar over the top and cut into bars.\n",
        "picture_link": "gnbNI9c1c0XgXPj/Z3hWrv9LtMccugG"
    },
    {
        "title": "No Bake Cow Pies",
        "ingredients": [
            "2 cups milk chocolate chips ADVERTISEMENT",
            "1 tablespoon shortening ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the chocolate and shortening together over medium-low heat. Stir until smooth. Remove the mixture from heat and stir in raisins and nuts. Drop cookies by tablespoon onto waxed paper. Chill and serve.\n",
        "picture_link": "uoj70.l5A0So5p.7xQILMakm1owsCAa"
    },
    {
        "title": "Apricot Cookie Frosting",
        "ingredients": [
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup apricot preserves ADVERTISEMENT",
            "3/4 cup pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together sugar, butter or margarine and apricot preserves until well blended.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Turkey Sausage and Egg Pie",
        "ingredients": [
            "1 pound spicy turkey sausage, casings removed ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1/2 cup sliced mushrooms ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup biscuit baking mix ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9-inch pie plate.\nPlace a large skillet over medium heat, and cook and stir the turkey sausage, onion, green bell pepper, mushrooms, and garlic until the turkey is no longer pink, about 8 minutes. Spread the turkey mixture into the prepared pie plate.\nBeat the eggs in a bowl with the milk, and stir in the biscuit mix. Pour the mixture over the turkey mixture in the pie dish. Sprinkle with Cheddar cheese.\nBake in the preheated oven until the cheese topping is browned and the pie filling is thickened and bubbling, about 30 minutes.\n",
        "picture_link": "gyQNl75wDZ02ZuI47/YHBZSvFInmTEO"
    },
    {
        "title": "Mmm-Mmm Ice Cream Cake",
        "ingredients": [
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "1 cup sweetened flaked coconut ADVERTISEMENT",
            "1 cup high-protein crisp rice and wheat cereal (such as Kellogg's® Special K®) - crushed ADVERTISEMENT",
            "1/2 gallon vanilla ice cream, softened ADVERTISEMENT",
            "1 (6 ounce) package chocolate chips ADVERTISEMENT",
            "3/4 cup light corn syrup ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix melted butter, brown sugar, almonds, coconut, and crushed cereal together in a bowl until thoroughly combined and crumbly. Press half the mixture into a 9x13-inch dish; reserve remaining mixture.\nSmooth the ice cream in an even layer over the crust. Sprinkle top with remaining cereal mixture.\nIn a saucepan, combine the chocolate chips, corn syrup, and evaporated milk over low heat until the chocolate chips have melted; stir the mixture until combined and smooth. Heat to a bare simmer, and cook, stirring constantly, until the syrup has thickened, 5 to 10 minutes. Allow to cool for about 10 minutes, then drizzle syrup over the top of the cake. Freeze the cake until firm, at least 2 hours; remove about 15 minutes before serving.\n",
        "picture_link": "8utcDAm9.UuDuM33Ju.9Fg7bWw/c5iq"
    },
    {
        "title": "Southern Texas-Style Beef Barbacoa",
        "ingredients": [
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1 (3 pound) boneless beef chuck roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare a smoker with dampened hickory wood charcoal. The heat inside your grill or smoker should be around 180 to 200 degrees F (80 to 95 degrees C). Combine the black pepper, oregano, cayenne pepper, chili powder, garlic powder, cumin, salt, and seasoned salt in a small bowl until thoroughly mixed.\nPlace the chuck roast into a mixing bowl, and rub all over with the spice mixture. Place the meat into the smoker, and smoke for 1 1/2 hours, turning about every half hour. The meat should be a dark red color, and the edges should be darkened. Place the meat into a roasting pan, and seal tightly with aluminum foil.\nPreheat an oven to 325 degrees F (165 degrees C).\nBake the barbacoa in the preheated oven for 1 1/2 hours until very tender. Uncover the beef, and shred with two forks while still hot.\n",
        "picture_link": "w5vNn2GqQdxINgFuC515l9Ku6Il7zmS"
    },
    {
        "title": "BJ's Easy Blackberry Cobbler",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "5 cups fresh blackberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 (15.8 ounce) package lemon-poppy seed muffin mix ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup butter at room temperature ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x9-inch baking pan with cooking spray.\nSpread the blackberries into the prepared baking pan, and sprinkle with white sugar; drizzle with lemon juice. In a bowl, mix the lemon-poppy seed muffin mix, egg, milk, and cinnamon, and stir until moistened. It's okay to leave lumps in the batter. Pour the batter over the blackberries.\nPlace the butter and brown sugar into a bowl, and mix with an electric mixer on medium speed until the mixture resembles coarse crumbs. Spread this mixture over the batter in the pan.\nBake in the preheated oven until the topping is browned and the blackberries are bubbling, about 1 hour. Allow to stand for 20 minutes before serving.\n",
        "picture_link": "kneLriIxLo.owYSwWRKa7QNZ3jpOk8q"
    },
    {
        "title": "Hearty Meat Lasagna",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 onions, peeled and chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 teaspoons dried thyme leaves ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 pound lean ground pork, veal or crumbled sausage ADVERTISEMENT",
            "4 cups Heinz® Tomato Juice ADVERTISEMENT",
            "1 (455 ml) bottle Heinz® Chili Sauce, Chunky with Sweet Peppers ADVERTISEMENT",
            "1 (156 ml) can Heinz Tomato Paste ADVERTISEMENT",
            "1 tablespoon Heinz Worcestershire Sauce ADVERTISEMENT",
            "12 oven-ready lasagna noodles ADVERTISEMENT",
            "3 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (180 degrees C). Heat oil in a large saucepan or Dutch oven set over medium heat. Add onion, green pepper, garlic and dried herbs; cook for 5 to 10 minutes or until vegetables soften.\nCrumble in beef and pork and brown all over, about 5 minutes. Stir in tomato juice, chili sauce, tomato paste and Worcestershire Sauce; bring to a boil. Reduce heat to medium-low and simmer for 10 minutes.\nSpread 1/4 of the sauce in to a 13- x 9-in (3 L) casserole dish. Top with 3 noodles. Layer with 1/4 more sauce and 1/3 of the cheese. Repeat layers twice, ending with cheese.\nCover with foil and bake for 1 hour. Remove foil and bake for 15 minutes or until golden. Let stand for 10 minutes before serving.\n",
        "picture_link": "ptzooawB/DHOwKbt/xZ8BTzFe4sshs6"
    },
    {
        "title": "Susan's Jee Bow Gai",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup black bean sauce ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 cup minced green onions ADVERTISEMENT",
            "5 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons hoisin sauce ADVERTISEMENT",
            "2 tablespoons dry sherry ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 teaspoons minced fresh ginger root ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/2 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "2 pounds chicken tenders ADVERTISEMENT",
            "12 (6 inch) wooden skewers, or as needed, soaked in water for 30 minutes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the sugar, black bean sauce, parsley, green onions, soy sauce, hoisin sauce, sherry, sesame oil, vegetable oil, ginger, garlic, and five-spice powder in a bowl, and pour into a resealable plastic bag. Add the chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator overnight, up to 2 days, turning occasionally.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate. Remove the chicken from the marinade, and shake off excess. Discard the remaining marinade. Weave the chicken tenders onto skewers.\nCook the skewered chicken on the preheated grill until no longer pink in the center and the juices run clear, turning occasionally, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "25UaTmNvSbHoVg8RbUwXklwOQzRV.dS"
    },
    {
        "title": "Aunt Gert's Sour Cream Cucumbers",
        "ingredients": [
            "4 large cucumbers, peeled and thinly sliced ADVERTISEMENT",
            "1 large cold onion, thinly sliced ADVERTISEMENT",
            "4 teaspoons salt, divided ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer 1/4 of the sliced cucumbers and 1/4 of the onion in a large bowl. Season with 1 teaspoon of salt. Repeat the layers 3 more times. Cover and allow to rest on the counter until the cucumbers and onion releases about 1 inch of liquid and are softened, 3 to 4 hours.\nDrain cucumbers and onion in a colander and thoroughly rinse to remove any remaining salt. Let the vegetables continue to drain in the colander for 30 minutes. Transfer the vegetables to a bowl, then stir in the sour cream. Cover and refrigerate until chilled, about 30 minutes.\n",
        "picture_link": "cWi1/d1cCUUM/L44LXi0zxgakcmclee"
    },
    {
        "title": "Chinese Tomato Soup: Dutch-Style",
        "ingredients": [
            "1 quart beef broth ADVERTISEMENT",
            "2 cups tomato juice ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "2 stalks celery, thinly sliced ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1 green onion, thinly sliced ADVERTISEMENT",
            "1 cup shrimp chips (prawn crackers) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour beef broth, tomato juice, and soy sauce into a large saucepan. Stir in brown sugar, applesauce, and celery; season with ginger and chili powder. Bring to a boil, then reduce heat to medium-low and simmer 20 minutes. Ladle into serving bowls and garnish with green onions and shrimp chips.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Colombian Ahuyama Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "4 1/2 quarts chicken broth ADVERTISEMENT",
            "2 1/2 pounds butternut squash, peeled and cubed ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon creamy peanut butter ADVERTISEMENT",
            "1/2 cup light cream ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat. Stir in the onion, garlic, curry powder, and red pepper flakes. Cook until the onion has turned translucent, 5 to 8 minutes.\nStir the chicken stock and squash into the onion mixture. Simmer the soup over medium heat until the squash is tender when pierced with a fork, about 20 minutes. Turn off the heat, and stir in the nutmeg, Worcestershire sauce, and peanut butter. Transfer the mixture in batches to a blender or food processor; blend until smooth, slowly pouring in the cream. Reheat soup if necessary, but do not boil. Serve garnished with parsley.\n",
        "picture_link": "px.pJ6C/P2iwWd.iVcs8BUl5w2I1Hwu"
    },
    {
        "title": "South-of-the-Border Stuffed Peppers",
        "ingredients": [
            "4 large red bell peppers, tops and seeds removed ADVERTISEMENT",
            "1 poblano pepper ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon dried oregano leaves ADVERTISEMENT",
            "1 (10 ounce) can red enchilada sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup shredded Asadero cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking dish.\nPlace the bell and poblano peppers in the prepared baking dish. Cook in preheated oven until poblano pepper's skin becomes wrinkled, about 20 minutes. Remove the poblano pepper from the dish, and peel off the skin. Chop the poblano pepper into 1/4 inch pieces, and set aside.\nCombine the rice and water in a pan over medium heat, and bring to a boil. Reduce heat to low, cover, and simmer until water is absorbed, about 20 minutes. Remove from heat, and set aside.\nPlace the onion in a skillet over medium heat; cook until translucent and soft, about 5 minutes. Stir in the ground beef; cook until crumbly and evenly browned. Drain the meat, and stir in the garlic, cumin, and oregano. Cook and stir until the garlic is fragrant, about 1 minute. Season with salt and pepper to taste. Stir the rice, enchilada sauce, and poblano pepper into the beef mixture, and mix thoroughly. Adjust the seasoning if desired.\nTo make the cheese sauce, place the queso asadero in saucepan over medium heat and stir until melted and smooth.\nLower oven heat to 350 degrees F (175 degrees C).\nSpoon the beef mixture into bell peppers until heaping full. Place any extra beef mixture into the center of the baking dish between the peppers. Drizzle cheese sauce over each pepper. Cover the baking dish with aluminum foil.\nBake peppers in preheated oven until cheese sauce bubbles and filling is heated through, about 35 minutes.\n",
        "picture_link": "RhqybBUsr3M5piYLy6Jxb.7LBPAKG1u"
    },
    {
        "title": "Crystal's Awesome Potato Salad",
        "ingredients": [
            "4 potatoes, peeled ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "2 tablespoons chopped roasted red pepper ADVERTISEMENT",
            "2 tablespoons chopped pepperoncini ADVERTISEMENT",
            "2 hard cooked eggs, chopped ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "3 tablespoons dill pickle relish ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon dried dill ADVERTISEMENT",
            "1 teaspoon chopped parsley ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large saucepan with enough water to cover, and bring to a boil over high heat. Reduce heat to medium low, cover and simmer until potatoes are tender. Drain and cool; cut into 1-inch cubes.\nIn a large bowl, combine potatoes with onion, celery, roasted red pepper, pepperoncini and eggs.\nIn a small bowl, mix mayonnaise, sour cream, pickle relish, Dijon and yellow mustards, garlic, dill, parsley and red pepper flakes. Pour mixture over potatoes and stir gently to combine. Season to taste with salt and pepper. Cover and chill for 2 hours before serving.\n",
        "picture_link": "S3D8YobtOvxeNLDcc8OuSscTplXrQ4O"
    },
    {
        "title": "Lemon-Blueberry Martini",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger blueberry vodka ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger vanilla vodka ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger limoncello ADVERTISEMENT",
            "2 tablespoons fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice. Pour in blueberry vodka, vanilla vodka, and limoncello. Cover and shake until the outside of the shaker is frosty. Strain into a chilled martini glass and garnish with fresh blueberries.\n",
        "picture_link": "8j9Efkp8XB9YhBgSSNk5b4cu4CbcIQW"
    },
    {
        "title": "Date and Chocolate Chip Whole Wheat Scones",
        "ingredients": [
            "2 cups whole-wheat flour ADVERTISEMENT",
            "1 cup all purpose flour ADVERTISEMENT",
            "3 tablespoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "1/3 cup cold butter ADVERTISEMENT",
            "3/4 cup chopped dates ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "milk for brushing ADVERTISEMENT",
            "extra sugar and cinnamon to sprinkle ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.\nSift together wheat and all-purpose flours, baking powder, salt, sugar and cinnamon into a large bowl. Rub butter into dry ingredients until it resembles fine breadcrumbs. Stir in dates and chocolate chips. Mix in the milk, just until blended and form dough into a ball.\nTurn the dough out onto a floured surface. Roll into a circle about 1/2 inch thick. Dip a round cookie cutter into flour (to prevent sticking) then cut out round scones. Place scones on a greased baking sheet. Brush with milk and sprinkle with cinnamon and sugar mixture.\nBake in preheated oven until risen and golden brown, 10 to 12 minutes.\n",
        "picture_link": "aQWxoBIeUktuV.Yq7lztiCe3qP7ZEHa"
    },
    {
        "title": "Lucy's Recuperation Food",
        "ingredients": [
            "4 cups low-salt chicken broth ADVERTISEMENT",
            "2 cups rice ADVERTISEMENT",
            "1 (15 ounce) can cut green beans, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan bring chicken broth to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. Once rice has cooked, stir in drained green beans.\nCool to room temperature before serving; refrigerate leftovers.\n",
        "picture_link": "ahFvlBPVWUuLNnkHJE5Qz9P1PYQpMty"
    },
    {
        "title": "Grape-Walnut Salad",
        "ingredients": [
            "1 pound seedless green grapes, rinsed and patted dry ADVERTISEMENT",
            "6 ounces roughly chopped walnuts ADVERTISEMENT",
            "1/2 cup blue cheese dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place grapes in a large bowl. Stir in the walnuts. Pour the blue cheese dressing over the grape mixture and stir until everything is evenly coated. Chill until ready to serve.\n",
        "picture_link": "lFW58PXNrl7N9jEdbefflzZleJPYhjq"
    },
    {
        "title": "Salmon Yakitori",
        "ingredients": [
            "1/4 cup light soy sauce ADVERTISEMENT",
            "1/4 cup sake ADVERTISEMENT",
            "1/4 cup mirin (sweetened Asian wine) ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 (6 ounce) salmon fillets ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the soy sauce, sake, mirin, and sugar in a shallow dish; place the salmon fillets in the dish, skin side up. Cover and refrigerate 2 hours or overnight.\nHeat the vegetable oil in a wok or skillet over medium-high heat. Drain the salmon and reserve the marinade. Pan fry the salmon 4 to 5 minutes per side, gradually adding the marinade to the pan, this will intensify the flavor and help to keep the salmon moist. Serve once the salmon is cooked through and is easily flaked with a fork.\n",
        "picture_link": "a0wHFxLXMblGe0UbOnGX4g4kw7hjfTi"
    },
    {
        "title": "Delaware Blue Crab Boil",
        "ingredients": [
            "2 tablespoons dill seed ADVERTISEMENT",
            "2 tablespoons mustard seed ADVERTISEMENT",
            "2 tablespoons cumin seed ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "2 sprigs rosemary ADVERTISEMENT",
            "10 sprigs thyme ADVERTISEMENT",
            "3 sprigs dill ADVERTISEMENT",
            "2 sprigs sage ADVERTISEMENT",
            "1/2 bunch parsley ADVERTISEMENT",
            "30 live, hard-shell blue crabs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crush the dill seed, mustard, and cumin in a spice grinder or with a mortar and pestle. Pour the spices into a 5 gallon stockpot along with the chili powder, paprika, red pepper flakes, rosemary, thyme, dill, sage, and parsley. Fill the pot 3/4 full with water, and bring to a rolling boil over an intense flame.\nAdd the blue crabs, cover the pot, and boil until all of the shells turn red, and the meat is no longer translucent, about 20 minutes. Stir the crabs occasionally as they boil to ensure even cooking.\n",
        "picture_link": "Q2w6r7L0R4AS7CMK7n/5eWI4UJhYB3G"
    },
    {
        "title": "Triple Fionn MacCool",
        "ingredients": [
            "2 fluid ounces Irish cream liqueur ADVERTISEMENT",
            "1 fluid ounce Canadian rye whiskey ADVERTISEMENT",
            "1/4 cup cold milk ADVERTISEMENT",
            "1 pinch cinnamon ADVERTISEMENT",
            "2 cups ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a cocktail shaker, shake together Irish cream liqueur and Canadian rye whiskey with several cubes of ice. Strain into a glass filled with ice cubes. Top off with milk and a dash of cinnamon. Give it a gentle stir and serve.\n",
        "picture_link": "FnWLDK/CMmVByy1ljVjpHhOliaHhlc."
    },
    {
        "title": "Crab and Salmon Dip",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "2 (6 ounce) cans lump crabmeat, drained ADVERTISEMENT",
            "6 ounces smoked salmon, chopped ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 tablespoon chopped Italian flat leaf parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in small skillet over medium heat. Add onion; cook and stir until onion is translucent, about 5 minutes. Set aside to cool.\nStir together cream cheese, yogurt , crab meat, and salmon in a bowl. Stir in cooled onion. Season with garlic salt and black pepper. Pour mixture into a shallow serving bowl and sprinkle with parsley.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raspberry Squares for Junior Chefs",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups quick cooking oats ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 cup raspberry jelly ADVERTISEMENT",
            "2/3 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 8x8 inch baking dish with foil, and lightly grease the foil.\nPlace the flour, oats, and sugar into a mixing bowl. Add the butter and mix, using your hands, until mixture has the consistency of coarse crumbs. Stir in the almond extract.\nRemove 2 cups of the flour mixture and place in a separate bowl. Pour the remaining flour mixture into the prepared pan, and press evenly across the bottom. Spread raspberry jelly over the flour layer. Gently press the reserved 2 cups of flour mixture over the jelly. Sprinkle the top with almonds.\nBake in preheated oven until top is golden brown, about 30 minutes. Cool in the baking dish. Lift out foil to place square on a cutting board. Using sharp knife, cut into 9 squares.\n",
        "picture_link": "8YAlcfI.KJBh3JwsH.6kAbfi4eFD5IG"
    },
    {
        "title": "Everything But the Kitchen Sink Casserole",
        "ingredients": [
            "1 (16 ounce) can chicken broth ADVERTISEMENT",
            "1 (1 ounce) package garlic and mushroom soup mix ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 1/2 cups uncooked brown rice ADVERTISEMENT",
            "1 1/2 cups cooked and cubed ham ADVERTISEMENT",
            "1 pound cubed cooked chicken breast ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 celery ribs, finely chopped ADVERTISEMENT",
            "2 carrots, peeled and diced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with garlic and onion ADVERTISEMENT",
            "2 tablespoons dry Marsala wine ADVERTISEMENT",
            "1 teaspoon dried parsley flakes ADVERTISEMENT",
            "1/2 teaspoon crushed bay leaf ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper (optional) ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 cup dried plain breadcrumbs (optional) ADVERTISEMENT",
            "6 ounces fresh mozzarella, grated (optional) ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking dish.\nStir the chicken broth, mushroom soup mix, mustard, and honey together in a bowl until thoroughly blended. Set aside.\nSpread the rice evenly over the bottom of the prepared baking dish. Cover the rice with a layer of ham, then the chicken.\nHeat the olive oil in a large skillet over medium heat. Stir in the onion, garlic, celery, and carrots; cook until onion is transparent and caramelized, about 5 minutes. Stir in the tomatoes, and cook 5 minutes more. Spoon the vegetables evenly over the chicken in the baking dish. Deglaze the skillet by adding the Marsala wine; cook and stir over medium heat to loosen any browned pieces of vegetables from the bottom. Let the liquid cool slightly, then stir into the chicken broth mixture. Pour the chicken broth mixture over the vegetables in the baking dish. Sprinkle with parsley, bay leaf, basil, cayenne pepper, and thyme. Cover the baking dish with foil.\nBake the casserole in preheated oven until top bubbles, about 50 minutes. Remove the foil, and stir in the sour cream. Sprinkle mozzarella cheese and bread crumbs evenly over the top. Bake, uncovered, 10 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fancy Franks",
        "ingredients": [
            "8 hot dogs ADVERTISEMENT",
            "8 pinches celery salt ADVERTISEMENT",
            "8 slices processed American cheese ADVERTISEMENT",
            "1 (12 ounce) bottle barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a baking sheet with non-stick cooking spray.\nBeing careful not to slice them into two separate pieces, make a lengthwise slit from the top of every hot dog to the bottom. Spread open the franks, then place them side by side flat side-up on the baking sheet.\nSeason each hot dog with a pinch of celery salt, then put a slice of cheese on top of each frank. Spread a thin layer of barbeque sauce over each piece of cheese.\nBake until cheese is slightly browned on edges, about 10 minutes.\n",
        "picture_link": "oF/OHoe04eYmESEVaN6snO4P8J7OvxC"
    },
    {
        "title": "Red Pepper and Tomato Soup",
        "ingredients": [
            "2 (10 ounce) cans condensed tomato soup ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 cup tomato juice (such as Mott's®) ADVERTISEMENT",
            "1/3 cup minced chives ADVERTISEMENT",
            "1/4 teaspoon garlic, minced ADVERTISEMENT",
            "1/4 pinch cayenne pepper (optional) ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 cup diced tomatoes ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the tomato soup and the water in a large sauce pot; simmer, stirring occasionally, for 5 minutes. Add the tomato juice, chives, garlic, cayenne, rosemary, thyme, oregano, basil, and paprika to the pot. Simmer soup for 25 minutes, stirring occasionally.\nStir in the diced tomatoes and red peppers. Simmer until peppers are soft, about 10 minutes.\n",
        "picture_link": "APHtaWL0SawEANWlOKKBWg9mSs4GSTO"
    },
    {
        "title": "Raspberry-Lime Sherbet 'Watermelon'",
        "ingredients": [
            "2 pints lime sherbet, slightly softened ADVERTISEMENT",
            "6 ounces miniature semi-sweet chocolate chips ADVERTISEMENT",
            "1/2 gallon raspberry sherbet, slightly softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a serving bowl with plastic wrap. Spoon lime sherbet into the bowl, smoothing it out to be 1/2 inch thick along the sides, making the watermelon rind. Place bowl in the freezer for 15 minutes.\nMeanwhile, stir the chocolate chips evenly into the raspberry sherbet. Scoop the raspberry sherbet into the lime sherbet shell, smoothing off and leveling the top. Return bowl to the freezer.\nTo serve, invert the bowl onto a serving plate. Lift off bowl and remove plastic wrap. Freeze again for 1 hour if the sherbet is too soft. Slice pieces like a watermelon.\n",
        "picture_link": "RfsI4ECYg.WdEQBRWgBCrUELRA2WbSO"
    },
    {
        "title": "Sweet Potato Bird Balls",
        "ingredients": [
            "1 large sweet potato ADVERTISEMENT",
            "1 cup frozen mixed vegetables, thawed ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 cup diced apples ADVERTISEMENT",
            "1 1/2 cups quick-cooking oatmeal, corn flakes, granola, or similar cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pierce the skin of the sweet potato several times with a paring knife or skewer. Place into the microwave, and cook on High power until the potato is tender, 5 to 9 minutes, turning the potato over halfway through cooking. When done, allow to cool until cool enough to handle.\nPeel the potato and place into a large mixing bowl. Add the vegetables, banana, raisins, apples, and oatmeal. Mix using an electric mixer on high speed until the vegetables have been reduced to tiny pieces and the mixture is thoroughly combined. If the mixture is too dry, add a little water until soft enough to roll into balls.\nLine a baking sheet with parchment or waxed paper. Roll the mixture into marble-sized balls and place onto baking sheet. Feed Polly a couple now, then place the baking sheet into the freezer, and freeze solid. Once frozen, remove treats from parchment paper and store in a resealable plastic bag. Defrost treats before serving.\n",
        "picture_link": "IFe6SKFJTIay.1EEai7Cmqyhswbr142"
    },
    {
        "title": "Fruit Bake",
        "ingredients": [
            "6 fresh peaches, pitted and chopped ADVERTISEMENT",
            "2 pears - peeled, cored and chopped ADVERTISEMENT",
            "4 stalks rhubarb, cut into 1/2 inch pieces ADVERTISEMENT",
            "2 tablespoons raisins ADVERTISEMENT",
            "1 large papaya - peeled, seeded and cubed (optional) ADVERTISEMENT",
            "2 tablespoons biscuit baking mix ADVERTISEMENT",
            "1/4 cup light brown sugar ADVERTISEMENT",
            "1 tablespoon margarine, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13 inch baking dish.\nArrange the peaches, pears, rhubarb, raisins, and papaya or mango in the prepared pan. In a medium bowl, combine the baking mix, brown sugar and margarine. Stir until mixture has a crumbly texture. Sprinkle evenly over fruit.\nBake in the preheated oven until top is golden brown, 35 to 45 minutes.\n",
        "picture_link": "ZZ/r8VIZGOsIY1oWuBg62SkInn0mEqa"
    },
    {
        "title": "Rhubarb and Strawberry Cobbler",
        "ingredients": [
            "1 (18 ounce) package refrigerated sugar cookie dough ADVERTISEMENT",
            "8 cups chopped fresh rhubarb (1/2-inch pieces) ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 (21 ounce) can strawberry pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place 8 large custard cups onto a baking sheet.\nChop the chilled cookie dough into 1/4 inch cubes and set aside. Mix the rhubarb with the sugar, cinnamon, and lemon juice. Fill each of the custard cups half full with the rhubarb mixture.\nSpoon the strawberry pie filling over the rhubarb. Arrange the cubed cookie dough on top of the filling. Leave some open spaces between the cubes, so that the filling does not overflow when baking. There may be some cookie dough left over.\nBake in the preheated oven until the dough is fully cooked and starting to brown around the edges, about 45 minutes.\n",
        "picture_link": "WljuGVh515SE1m8mQlozooGU5VEq8k2"
    },
    {
        "title": "New Year Day Dinner",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound boneless pork, cut into thin bite-size pieces ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 head cabbage, shredded ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1/2 teaspoon caraway seeds ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups chicken broth, divided ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a skillet over medium heat; cook and stir pork in hot vegetable oil until browned, about 10 minutes. Transfer pork to a bowl. Heat butter in the same skillet; cook and stir cabbage until wilted, about 5 minutes. Stir onion into cabbage and cook until onion is translucent, stirring often, about 5 more minutes.\nSprinkle vegetables with caraway seeds and season with salt and black pepper; pour 1/2 cup chicken broth into skillet. Raise heat to medium-high and cook until broth has nearly evaporated; pour remaining 1 cup broth into skillet. Return pork to skillet, add red and green bell peppers, and cover; cook until peppers start to soften, about 10 minutes.\n",
        "picture_link": "yi9OlY6B9KYAjCqYEJ3.JE11jTDh.oS"
    },
    {
        "title": "Easy Cheesy Hash Browns",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened (optional) ADVERTISEMENT",
            "2 (10.75 ounce) cans cream of celery soup ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (2 pound) package frozen hash brown potatoes, thawed ADVERTISEMENT",
            "2 cups crushed corn flakes ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir cream cheese, cream of celery soup, sour cream, and Cheddar cheese in a large bowl until thoroughly combined. Gently fold hash brown potatoes into soup mixture. Stir corn flakes with melted butter in a separate bowl. Spread potato mixture in an even layer into a 9x13-inch baking dish; sprinkle buttered corn flakes over the top.\nBake until casserole is bubbling and topping has browned, about 1 hour.\n",
        "picture_link": "BDqihOBEYsgRUzesH6d7QnJ058BlqW2"
    },
    {
        "title": "Four-Cheese Pasta Florentine",
        "ingredients": [
            "3 cups mostaccioli pasta, uncooked ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "4 ounces PHILADELPHIA Cream Cheese, cubed ADVERTISEMENT",
            "1 cup BREAKSTONE'S or KNUDSEN 2% Milkfat Low Fat Cottage Cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (8 ounce) package KRAFT Shredded Low-Moisture Part-Skim Mozzarella Cheese ADVERTISEMENT",
            "1/4 cup KRAFT Grated Parmesan Cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F.\nCook pasta as directed on package, omitting salt. Meanwhile, cook spinach as directed on package; drain well. Place in large bowl. Add cream cheese; stir until melted. Stir in cottage cheese and eggs until well blended.\nDrain pasta. Add to spinach mixture with mozzarella; mix lightly. Spoon into 8- or 9-inch square baking dish; top with Parmesan.\nBake 25 min. or until center is set.\n",
        "picture_link": "9POy2FhCNwTx9XnVBP8UtHwqzOtZdke"
    },
    {
        "title": "Mal's Maple Date Pecan Granola in the Slow Cooker",
        "ingredients": [
            "6 tablespoons applesauce ADVERTISEMENT",
            "1/4 cup pure maple syrup ADVERTISEMENT",
            "2 tablespoons brown sugar (optional) ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon maple extract ADVERTISEMENT",
            "1 tablespoon hemp seed hearts (optional) ADVERTISEMENT",
            "1 tablespoon chia seeds (optional) ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup Medjool dates, pitted and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour applesauce, maple syrup, brown sugar, cinnamon, salt, vanilla and maple extracts, hemp hearts, and chia seeds into a slow cooker. Stir until well combined; add oats and pecans and stir again.\nCook the granola in the slow cooker on high for 3 hours, venting the lid slightly. If you smell the granola cooking, it's time to stir. Keep an eye on it or it will burn if not stirred occasionally.\nPour the finished granola onto a baking sheet lined with parchment paper and allow to cool completely. Store in an airtight container and enjoy!\n",
        "picture_link": "dDX.rHfNU75h.zCzQgc0mYo.VGSvWv."
    },
    {
        "title": "Milano-Style Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup miniature chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBeat butter and shortening together in a bowl until creamy. Beat confectioners' sugar, water, egg, vanilla extract, and almond extract into the creamed mixture. Stir in flour and salt until dough is smooth. Fold chocolate chips into the dough. Scoop dough with a small cookie scoop and drop cookies on an ungreased baking sheet.\nBake in the preheated oven until edges of cookies are lightly browned, about 9 minutes.\n",
        "picture_link": "rrQVnrlTdsM8PNEx67fGcwvH8R6wVWy"
    },
    {
        "title": "Salami and Tomato Folds",
        "ingredients": [
            "22 thin slices salami ADVERTISEMENT",
            "1/2 cup herb and garlic-flavored cream cheese ADVERTISEMENT",
            "22 grape tomatoes ADVERTISEMENT",
            "22 toothpicks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread each salami slice with a thin layer of cream cheese; fold each salami slice in half over cream cheese layer. Place 1 tomato in the center of each salami half; roll salami around the tomato overlapping the two edges; secure edges to tomato with a toothpick.\n",
        "picture_link": "hZZKo19Hg8nzJjgLUzRqRR77uCYW/RS"
    },
    {
        "title": "Berry Good French Toast Bake",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "10 thick slices French bread, cut into 1-inch cubes ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1/2 cup chopped pecans (optional) ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, cut into 1/2-inch cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13-inch baking dish.\nBeat eggs, milk, flour, sugar, cinnamon, vanilla, nutmeg, and salt in a large bowl with a hand mixer until smooth; add bread cubes and stir until well coated. Pour bread mixture into prepared baking dish. Top evenly with blueberries, pecans, and cream cheese cubes. Cover dish with plastic wrap and refrigerate 2 to 24 hours.\nPreheat oven to 400 degrees F (200 degrees C).\nBake uncovered in preheated oven until golden brown, 20 to 25 minutes.\n",
        "picture_link": "./9etOgCxHr9mX5xGBO.37TNHmm0jXG"
    },
    {
        "title": "Asparagus Beef Bundles",
        "ingredients": [
            "25 thin asparagus spears, cut into 3-inch pieces ADVERTISEMENT",
            "3/4 cup cream cheese ADVERTISEMENT",
            "1 1/2 tablespoons prepared horseradish ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1 pound thinly sliced deli roast beef ADVERTISEMENT",
            "25 whole chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Drop asparagus into boiling water and cook for 2 minutes; drain. Immediately plunge asparagus into a bowl of iced water.\nMix cream cheese, horseradish, parsley, and chopped chives in a bowl. Lay thinly sliced beef onto a large sheet of waxed paper. Spread cream cheese mixture over each roast beef slice. Place one asparagus spear onto each slice so the tip overlaps an edge. Roll beef slice around the the asparagus. Secure by tying a chive around the wrapped asparagus.\nArrange rolls on a plate and cover with plastic wrap; refrigerate at least 30 minutes.\n",
        "picture_link": "ICY8bIkGmRsSuvjZ.2arzeIUet5g71i"
    },
    {
        "title": "Turkish Coffee",
        "ingredients": [
            "1 1/4 cups cold milk ADVERTISEMENT",
            "2 1/2 tablespoons finely ground Turkish-style coffee ADVERTISEMENT",
            "5 teaspoons white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir milk, coffee, and sugar together in a saucepan over medium heat until the sugar dissolves. Cook until the liquid begins to bubble. Cook another 30 seconds; remove from heat. Serve hot.\n",
        "picture_link": "fHCGVH7av/jzYML1Ds34.X0P4q7z4EC"
    },
    {
        "title": "Ham Steak Over Mixed Greens",
        "ingredients": [
            "1 pound ham steak ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon champagne vinegar ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 (10 ounce) packages mixed salad greens ADVERTISEMENT",
            "1/3 cup crumbled reduced-fat feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCoat ham steak on both sides with cooking spray; season with black pepper to taste.\nGrill ham on preheated grill until meat shows good grill marks, 4 to 5 minutes per side. Cut ham into bite-size pieces.\nWhisk olive oil, Dijon mustard, lemon juice, champagne vinegar, and 1/4 teaspoon black pepper in a large bowl. Toss mixed greens into dressing to coat. Divide salad onto four plates and top with ham and feta cheese.\n",
        "picture_link": "vm26B3A6i/ZiZPwBd/MgCBFoA4GkhHK"
    },
    {
        "title": "Cream Cheese, Havarti, and Parmesan Herbed Christmas Tree",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup shredded Havarti cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "2 teaspoons grated lemon peel ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese, Havarti cheese, Parmesan cheese, 2 tablespoons basil, lemon zest, and garlic together in a bowl. Transfer cream cheese mixture to a piece of plastic wrap. Roll the plastic wrap around cream cheese mixture forming a cone shape, resembling a tree.\nStand the 'tree' upright and remove the plastic wrap. Cover the visible portion of the 'tree' with 1/4 cup basil and parsley.\nGently wrap the 'tree' with a fresh sheet of plastic wrap and refrigerate until firm, about 2 hours.\n",
        "picture_link": "7OS9N8Bd8iwMxHwOXQrvpbraw1fsF6O"
    },
    {
        "title": "Bacon and Potato Breakfast Strata",
        "ingredients": [
            "3/4 pound small red potatoes, sliced ADVERTISEMENT",
            "12 slices OSCAR MAYER Bacon, cut into 1-inch pieces ADVERTISEMENT",
            "8 cups French bread, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 cup small broccoli florets ADVERTISEMENT",
            "1 1/2 cups KRAFT Shredded Triple Cheddar Cheese with a Touch of PHILADELPHIA ADVERTISEMENT",
            "1 (8 ounce) tub PHILADELPHIA Chive & Onion Cream Cheese Spread ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook potatoes and bacon in large skillet on medium heat 8 to 10 min. or until bacon is crisp and potatoes are tender, stirring occasionally; drain. Combine potato mixture, bread, broccoli and 1 cup shredded cheese; spoon into 13x9-inch baking dish sprayed with cooking spray.\nWhisk cream cheese spread, eggs and pepper in medium bowl until blended. Gradually add milk, beating well after each addition; pour over bread mixture. (Bread cubes should be evenly moistened.) Cover with foil. Refrigerate 2 hours.\nHeat oven to 375 degrees F. Bake strata, covered, 30 min. or until knife inserted in center comes out clean. Sprinkle with remaining shredded cheese; bake, uncovered, 10 min. or until cheese is melted.\n",
        "picture_link": "o4bNuQMDRNo8yi63uhcX7aitZR4PaY6"
    },
    {
        "title": "Blue Cheese Mousse",
        "ingredients": [
            "6 ounces crumbled blue cheese ADVERTISEMENT",
            "1 (4 ounce) package cream cheese ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree blue cheese and cream cheese together in a food processor until completely smooth; transfer to a bowl and season with kosher salt and black pepper.\nBeat heavy cream in a glass or metal bowl until soft peaks form. Lift your beater or whisk straight up: the whipped cream will form soft mounds rather than a sharp peak. Fold whipped cream into the blue cheese mixture, stirring until the mixture is creamy with no lumps.\nTransfer mixture to a pastry bag with a round tip for piping.\n",
        "picture_link": "e6IZQqTw9CnGS21PSyfzGzLsuVBf4N."
    },
    {
        "title": "Rutabaga Stew",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 1/2 pounds chicken, diced ADVERTISEMENT",
            "4 rutabagas, peeled and diced ADVERTISEMENT",
            "4 medium beets, peeled and diced ADVERTISEMENT",
            "4 carrots, diced ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 red onion, diced ADVERTISEMENT",
            "water, or to cover ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a Dutch oven or large pot over medium heat. Cook and stir chicken in hot oil until completely browned, 3 to 5 minutes. Add rutabagas, beets, carrots, celery, and red onion to the pot. Pour enough water over the vegetable mixture to cover completely. Reduce heat to low and cook at a simmer for at least 4 hours, adding water as needed to keep vegetable submerged.\n",
        "picture_link": "Rl9gYh8c1tV7nBgLvLIqAikB8ewhjAq"
    },
    {
        "title": "White Chocolate Thumbprint Cookies",
        "ingredients": [
            "1 pound butter, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "1 (8 ounce) jar seedless raspberry jam ADVERTISEMENT",
            "3 (1.55 ounce) bars white chocolate, chopped ADVERTISEMENT",
            "1 tablespoon vegetable shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter, sugar, and vanilla extract together in a bowl until creamy and smooth. Mix flour and baking powder together in a separate bowl; gradually beat flour mixture into creamed butter mixture until dough is smooth. Fold walnuts into the dough. Refrigerate dough for 1 hour.\nPreheat oven to 325 degrees F (165 degrees C).\nRoll cookie dough into 6 dozen small balls and place them 2 inches apart on a baking sheet. Press the center of each ball using your thumb to form a small well. Fill the depressions with jam.\nBake in the preheated oven until cookies are light golden brown, about 18 minutes.\nMelt white chocolate and shortening together in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Drizzle melted white chocolate mixture over cookies.\nCool cookies on the sheet for 5 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "i9E0eyfF9JbohtV0gbk79pWUfrAlYUq"
    },
    {
        "title": "Jeanine's Decadent Brownies",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup walnut halves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish.\nMix sugar, flour, oil, cocoa powder, eggs, salt, and vanilla extract together in a bowl; beat with an electric mixer for 3 minutes. Fold walnuts into batter. Pour batter into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center of the brownies comes out clean, 30 to 35 minutes.\n",
        "picture_link": "gIOV.TBveTeQ9j0gvS7aZ7SzaleAn92"
    },
    {
        "title": "Book Club Herb Roasted Chicken and Vegetables",
        "ingredients": [
            "1 cup olive oil ADVERTISEMENT",
            "2 teaspoons ground thyme ADVERTISEMENT",
            "2 teaspoons dried rosemary ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 whole chicken, cut into 6 pieces - rinsed and dried with paper towels ADVERTISEMENT",
            "2 onions, cut into 1-inch thick slices ADVERTISEMENT",
            "1 red bell pepper, cut into 1-inch wide strips ADVERTISEMENT",
            "2 cups broccoli florets ADVERTISEMENT",
            "1 bunch fresh asparagus, 2-inch tips only ADVERTISEMENT",
            "6 cloves garlic, peeled ADVERTISEMENT",
            "2 cups fingerling potatoes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix olive oil, thyme, rosemary, oregano, and paprika in a bowl. Divide herb mixture in half, pouring half into a separate bowl, and stir lime juice into one of the halves. Pour each half into a separate large plastic resealable bag. Place chicken pieces into the bag without the lime juice; squeeze excess air out of bag and seal.\nPlace onions and red bell peppers into a resealable plastic bag and pour half the marinade containing lime juice into the bag. Place broccoli, asparagus, and garlic into another resealable plastic bag and pour remaining lime juice marinade over vegetables. Squeeze excess air from both bags and seal. Refrigerate chicken and both bags of vegetables at least 2 hours to overnight.\nPreheat oven to 400 degrees F (200 degrees C).\nTransfer red bell peppers and onions to a baking dish; transfer broccoli, asparagus, and garlic to a separate baking dish. Bake both dishes of vegetables in the preheated oven for 20 minutes; stir and roast 10 more minutes. Remove vegetables from oven.\nTransfer marinated chicken into a roasting pan, shaking off excess marinade and discarding used marinade. Scatter fingerling potatoes around chicken pieces. Roast chicken for 30 minutes and flip chicken pieces and potatoes.\nDistribute all the vegetables into the roasting pan with the chicken pieces and potatoes. Roast until the chicken juices run clear, chicken is no longer pink inside, and an instant-read meat thermometer inserted into the thickest piece of chicken reads at least 160 degrees F (70 degrees C), about 30 more minutes. Season to taste with salt and black pepper.\n",
        "picture_link": "Lri2WCBKLKTb0.ynd33AC3mUgE0sDCm"
    },
    {
        "title": "Pudding You Can Feel Good About",
        "ingredients": [
            "1 avocado, peeled and pitted ADVERTISEMENT",
            "1/2 cup agave nectar ADVERTISEMENT",
            "1/4 cup carob powder ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 drops peppermint oil (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend avocado, agave nectar, carob powder, water, vanilla extract, and peppermint oil in a blender until smooth.\n",
        "picture_link": "4t7LCKcIsJsJb.c7WnWiRNd9Q1QCOI."
    },
    {
        "title": "Bobbie's Spaghetti Sauce",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 (12 ounce) package pork sausage links ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1 cup fresh mushroom slices ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "1/2 large onion, chopped ADVERTISEMENT",
            "1 (16 ounce) can tomato sauce (such as Hunt's®) ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (8 ounce) can tomato paste ADVERTISEMENT",
            "4 teaspoons balsamic vinegar ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1 pinch ground thyme ADVERTISEMENT",
            "1 pinch kosher salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch dried marjoram ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot. Cook sausage links and ground beef in the hot oil until the sausages are cooked through and no longer pink in the center, 3 to 5 minutes per side. Stir mushrooms, red bell pepper, yellow bell pepper, and onion into the meat mixture; cook and stir until he vegetables are tender, 5 to 7 minutes.\nRemove sausages from pot to a cutting board to cool slightly; cut into bite-size pieces and return to the pot. Add tomato sauce, diced tomatoes with green chile peppers, tomato paste, balsamic vinegar, oregano, basil, thyme, kosher salt, black pepper, and marjoram to the pot; stir. Reduce heat to low and cook at a simmer, stirring every so often, for 2 to 3 hours.\n",
        "picture_link": "EcGd1Nue23DSZrkOo36CxArIDxaLYD2"
    },
    {
        "title": "Shrimp, Broccoli Rabe, and Tomatoes Over Penne Pasta",
        "ingredients": [
            "12 ounces penne pasta ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 pound uncooked shrimp, peeled and deveined ADVERTISEMENT",
            "1 bunch broccoli rabe ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes (optional) ADVERTISEMENT",
            "3/4 cup cream of chicken soup ADVERTISEMENT",
            "2 tablespoons dry white wine ADVERTISEMENT",
            "1 pound ripe tomatoes, diced and drained ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/2 cup chopped fresh basil, divided ADVERTISEMENT",
            "1 cup shredded Parmigiano-Reggiano cheese, divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes. Drain penne and place in a large serving bowl.\nHeat olive oil in a deep skillet over medium-high heat. Cook and stir garlic in the hot oil until fragrant, about 30 seconds; add shrimp and cook until pink and opaque, about 2 minutes. Remove shrimp and set aside, reserving olive oil in skillet.\nAdd broccoli rabe and red pepper flakes to skillet; cook and stir until rabe is tender and bright green, about 5 minutes. Add cream of chicken soup, white wine, diced tomatoes, cooked shrimp, lemon juice, 1/4 cup chopped fresh basil, 1/2 cup grated Parmigiano Reggiano cheese, salt, and ground black pepper; cook and stir until tomatoes are heated through, about 2 minutes.\nToss shrimp and broccoli rabe mixture with penne in serving bowl; top with remaining 1/4 cup basil and 1/2 cup Parmigiano-Reggiano cheese.\n",
        "picture_link": "SewgGtUN9TJSogSGRPhEjnBQDRs8nTe"
    },
    {
        "title": "His-n-Hers Cocktails",
        "ingredients": [
            "His Ingredients: ADVERTISEMENT",
            "2 fluid ounces vanilla vodka ADVERTISEMENT",
            "1 fluid ounce hazelnut liqueur ADVERTISEMENT",
            "1/2 cup ice cubes ADVERTISEMENT",
            "Her Ingredients: ADVERTISEMENT",
            "1 fluid ounce raspberry vodka ADVERTISEMENT",
            "1 fluid ounce creme de cacao ADVERTISEMENT",
            "1 teaspoon chocolate syrup ADVERTISEMENT",
            "1 fluid ounce half-and-half cream ADVERTISEMENT",
            "2 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare his cocktail by pouring the vanilla vodka and hazelnut liqueur into a rocks glass over ice. Pour the contents of the glass into a cocktail shaker, then pour back into the rocks glass to mix.\nPrepare her cocktail by pouring the raspberry vodka and creme de cacao into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a martini glass rimmed with chocolate syrup, pour in the half-and-half, and garnish with maraschino cherries.\nKiss to mix flavors.\n",
        "picture_link": "tlQYkyUz6P8fy2N.N.kh5mNONz93nCu"
    },
    {
        "title": "Nepalese Scrambled Eggs",
        "ingredients": [
            "2 tablespoons ghee (clarified butter) ADVERTISEMENT",
            "2 small red onions, thinly sliced ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch ground cayenne pepper ADVERTISEMENT",
            "1 tablespoon curry paste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "6 eggs, lightly beaten ADVERTISEMENT",
            "3 tablespoons fresh cilantro, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat ghee in a skillet over medium heat. Fry the onions, coriander, cumin, and cayenne pepper until the onions are soft. Stir in the curry paste and set aside.\nIn a separate skillet, melt the butter over medium-low heat. Pour in the eggs; cook and stir until eggs are set. Mix in the onion mixture and serve garnished with fresh cilantro.\n",
        "picture_link": "Xuoe9aJcJ/u4CQB0HowuJK8eiBPlm8K"
    },
    {
        "title": "Horchata",
        "ingredients": [
            "2 quarts hot water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup long grain rice ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ice cubes, for serving ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour sugar, cinnamon, and rice into hot water; stir until sugar dissolves. Cover, and let stand at room temperature for at least 3 hours, but preferably overnight.\nStir in milk, then puree with a hand blender, or in batches in a standing blender until the rice resembles fine sand. Strain through several layers of cheesecloth, or through a very fine strainer. Serve over ice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]