[
    {
        "title": "Vanilla Sesame Cake",
        "ingredients": [
            "1 1/8 cups butter, softened ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2/3 cup black sesame seeds ADVERTISEMENT",
            "2 cups self-rising flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking dish.\nWith an electric mixer, beat the butter and sugar together in a mixing bowl until the mixture is creamy, about 5 minutes. Beat in the eggs, one at a time, beating until each egg is incorporated before adding the next one. Stir in the vanilla extract and black sesame seeds, mixing until well blended. Lightly stir in the flour to make a smooth batter, and pour the mixture into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 40 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kangaroo Burgers",
        "ingredients": [
            "2 pounds ground kangaroo meat ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1 teaspoon caraway seeds ADVERTISEMENT",
            "1/2 bunch fresh thyme ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup bread crumbs, or as needed ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "8 sandwich buns, split ADVERTISEMENT",
            "8 leaves lettuce ADVERTISEMENT",
            "8 thick slices tomato ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the kangaroo, onion, caraway seed, thyme, egg, and lemon zest together in a bowl; season with salt and pepper. If mixture is too wet and sticky add breadcrumbs. Shape the mixture into 8 balls and flatten.\nHeat the oil in a skillet over medium heat; cook the burgers in the hot oil until the burgers are cooked through and no longer pink in the middle, 5 to 7 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Serve the burgers on the split buns with lettuce and tomato.\n",
        "picture_link": "ffWHBerAsRCSpoD5hE5Le0kusqYdaNm"
    },
    {
        "title": "Ol' Man's Kidneys",
        "ingredients": [
            "8 fresh lamb kidneys, rinsed and outer membrane removed ADVERTISEMENT",
            "1 1/2 tablespoons butter ADVERTISEMENT",
            "1 large onion, thinly sliced ADVERTISEMENT",
            "1 clove garlic, minced, or more to taste ADVERTISEMENT",
            "1 teaspoon mild curry powder (optional) ADVERTISEMENT",
            "1 cup white wine, or as needed ADVERTISEMENT",
            "2 teaspoons tomato paste, or to taste ADVERTISEMENT",
            "2 1/2 tablespoons heavy cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make a slice the long way, partly through the back of each kidney (the side opposite the ducts), and spread the kidney, cut side down, onto a cutting board. With a sharp knife, slice as much meat off each side of the kidney as possible, leaving the duct \"tree\" intact. Discard the duct portion. Repeat with each kidney.\nHeat the butter in a large skillet over medium heat, and cook and stir the onion, garlic, and curry powder until the onion is soft and translucent, 5 to 8 minutes. Pour about 1/4 cup of white wine into the onion mixture, turn the heat to low, and stir to scrape up and dissolve any brown bits of flavor from the bottom of the skillet. Place the kidneys into the skillet, and gently simmer until tender but not overcooked, about 10 minutes. Turn the kidneys over about halfway through cooking. As the wine reduces, continue to add more, about 1/4 to 1/3 cup at a time.\nWhen the kidneys are no longer pink and the wine has reduced, stir in tomato paste until well combined. Serve hot with a dollop of cream drizzled over each serving, if desired.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pesarattu",
        "ingredients": [
            "2 cups skin-on, whole green lentils (sabut moong dal) ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "5 green chile peppers ADVERTISEMENT",
            "1 (1/2 inch) piece fresh ginger root, peeled ADVERTISEMENT",
            "1 tablespoon cumin seeds ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "6 tablespoons chopped onion (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the lentils and rice into a large container and cover with several inches of cool water; let stand 4 hours to overnight.\nBlend the lentils, rice, green chile peppers, and ginger together into a smooth paste using a blender or food processor. Stir the cumin seed and salt into the paste.\nPrepare a flat griddle (tawa) or large, flat-bottomed skillet and place over medium-low heat. Ladle the lentil batter onto the middle of the heated surface and spread into a thin circle using the back of the ladle. Sprinkle with 1 tablespoon of onions and press the onions onto the pesarattu using your ladle or spatula. Cook for a few minutes and flip over to the other side. Cook a few more minutes, transfer to a plate and serve immediately. Dosas are best eaten hot and crispy right off the tawa.\n",
        "picture_link": "u.e8xbNxA4OAvLrZLE5nr0lNc5IT2dm"
    },
    {
        "title": "Khara Pongal",
        "ingredients": [
            "1/4 cup cooking oil ADVERTISEMENT",
            "12 cashews ADVERTISEMENT",
            "2 dried red chile peppers ADVERTISEMENT",
            "1 teaspoon cumin seed ADVERTISEMENT",
            "1 teaspoon mustard seed ADVERTISEMENT",
            "10 black peppercorns ADVERTISEMENT",
            "1 pinch asafoetida powder ADVERTISEMENT",
            "1 cup split yellow lentils (moong dal) ADVERTISEMENT",
            "1 cup rice ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "2 green chile peppers, chopped ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "3 1/2 cups water ADVERTISEMENT",
            "2 tablespoons ghee ADVERTISEMENT",
            "1/4 cup chopped cilantro leaves ADVERTISEMENT",
            "1/4 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a pressure cooker. Fry the cashews in the hot oil until golden brown; remove from oil and set aside. Cook the red chile peppers, cumin seed, mustard seed, peppercorns, and asafoetida in the hot oil for 2 minutes. Stir the lentils into the mixture and cook another 2 minutes. Add the rice, 1/2 cup coconut, green chile peppers, turmeric, salt, and water; stir.\nClose the lid of the pressure cooker and bring to 15 pounds of pressure; cook about 35 minutes. Relieve the pressure from the cooker; stir the cashews and ghee into the mixture. Garnish with the cilantro and 1/4 cup shredded coconut to serve.\n",
        "picture_link": "WQ199draoDWWWpNq9SJhhAWqx/z3EkK"
    },
    {
        "title": "Flat Iron Steak Marinade",
        "ingredients": [
            "1 (8 ounce) flat iron steak ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3/4 cup cola-flavored carbonated beverage ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place steak into a casserole dish and season with salt and black pepper.\nWhisk cola-flavored beverage, ketchup, Worcestershire sauce, garlic, chili powder, salt, mustard, and cayenne pepper together in a bowl; pour over steak.\nMarinate steak in the refrigerator, at least 1 hour to overnight.\n",
        "picture_link": "85W1pzHbS0OK6LsIvtyivPzEjc7KAhi"
    },
    {
        "title": "Easy Banana Ice Cream",
        "ingredients": [
            "2 peeled and chopped bananas, frozen ADVERTISEMENT",
            "1/2 cup skim milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine frozen bananas and 1/4 cup skim milk in a blender; blend for 30 seconds. Add remaining 1/4 cup milk and blend on high speed until smooth, about 30 seconds more.\n",
        "picture_link": "v1Lcia7LSyF4cW/mzv0Decy2RcnlHPO"
    },
    {
        "title": "Peanut Butter Banana Ice Cream",
        "ingredients": [
            "4 ripe bananas, cut into 1-inch slices ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange banana slices on a baking sheet and freeze, 8 hours to overnight.\nProcess frozen bananas in a food processor until evenly chopped; add peanut butter and process until thick and creamy.\n",
        "picture_link": ".oAXkAaYwchahGPu6LSgvqHzPWwz8Ka"
    },
    {
        "title": "Soymilk Flaxseed Pancakes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup soy milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons flax seeds ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir flour, soy milk, egg, flax seeds, baking powder, sugar, and vanilla extract together in a bowl.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "aVtPpGiAxTfzbAIQKebysTQEmfmwWqm"
    },
    {
        "title": "Oven-Roasted Root Vegetables from Swanson®",
        "ingredients": [
            "3 medium red potatoes, cut into 1-inch pieces ADVERTISEMENT",
            "2 cups peeled baby carrots ADVERTISEMENT",
            "1 pound celery root (celeriac), peeled and cut into 1-inch pieces ADVERTISEMENT",
            "2 (3 pound) rutabaga, peeled and cut into 1-inch pieces ADVERTISEMENT",
            "2 medium red onions, peeled and cut into 8 wedges each ADVERTISEMENT",
            "2 medium parsnips, peeled and cut into 1-inch pieces ADVERTISEMENT",
            "5 cloves garlic, cut into thin slices ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary leaves or fresh thyme leaves ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup Swanson® Vegetable Broth or Swanson® Certified Organic Vegetable Broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set the oven to 425 degrees F. Spray a roasting pan with vegetable cooking spray.\nStir the potatoes, carrots, celery root, rutabaga, onions, parsnips, garlic, rosemary and oil in the pan. Roast the vegetables for 30 minutes. Pour the broth over the vegetables and stir.\nRoast for 20 minutes or until the vegetables are fork-tender. Season to taste.\n",
        "picture_link": "k0oC3Yd/bx8PpZA7vVe.PxrOkxtxiBa"
    },
    {
        "title": "Chocolate Blueberry Bark",
        "ingredients": [
            "16 ounces milk chocolate chips ADVERTISEMENT",
            "8 ounces dried blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with aluminum foil.\nPlace chocolate chips into a microwave-safe bowl; heat in microwave for 1 minute. Stir. Heat in microwave for 1 minute more; stir again. Add dried blueberries and mix well.\nPour chocolate mixture onto the prepared baking sheet and refrigerate until set, about 30 minutes. Break into pieces.\n",
        "picture_link": "L.GcJUqztTIYX28G0T8ywbmlT5Pp3FC"
    },
    {
        "title": "Pork Roast Strata with Green Chiles and Goat Cheese",
        "ingredients": [
            "12 ounces crusty Italian or French bread, cut or torn into 3/4-inch pieces ADVERTISEMENT",
            "1/2 Smithfield® Garlic & Herb or Golden Rotisserie Seasoned Pork Sirloin Roast, cooked and shredded ADVERTISEMENT",
            "1 (7 ounce) can chopped green chilies ADVERTISEMENT",
            "3 tablespoons chopped fresh sage ADVERTISEMENT",
            "4 ounces chevre spreadable goat cheese, well chilled ADVERTISEMENT",
            "7 large eggs ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat 13x9x2-inch baking pan with nonstick cooking spray. Arrange half of the bread in bottom of pan. Top with half the meat, half the green chiles and half the sage. Crumble half the goat cheese over top. Repeat layers with remaining ingredients.\nHeat oven to 350 degrees F. Whisk together eggs, milk, salt and pepper in large bowl. Pour over casserole, pressing down bread to soak up liquid. Let stand 20 to 30 minutes at room temperature.\nBake casserole at 350 degrees F for 1 hour until knife inserted near center comes out clean. Let stand 10 minutes before cutting to serve.\n",
        "picture_link": "sYtAIWr0LlD0.ijHKw9OVB5tZdIisv."
    },
    {
        "title": "Mal's Killer Cashew Maca Energy Bites",
        "ingredients": [
            "1 cup raw cashew nuts ADVERTISEMENT",
            "2 pinches sea salt ADVERTISEMENT",
            "8 Medjool dates, pitted ADVERTISEMENT",
            "3 tablespoons raw maca powder ADVERTISEMENT",
            "1 tablespoon ground cardamom ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put cashews and salt in a food processor fitted with the S-blade; pulse until cashews are finely chopped but not a paste. Add dates, maca powder, cardamom, and olive oil; blend until mixture is evenly combined and holds together.\nShape mixture into 10 to 12 balls and refrigerate until firm, at least 30 minutes.\n",
        "picture_link": "I/S7kTxuLn7AIhE/BnCKCbtPnUQ6pTy"
    },
    {
        "title": "Chilapachole (Spicy Tomato Crab Soup)",
        "ingredients": [
            "1 small onion, peeled and cut into quarters ADVERTISEMENT",
            "1 tomato, cut into quarters ADVERTISEMENT",
            "1 small red bell pepper, seeded and cut into quarters ADVERTISEMENT",
            "4 serrano chili peppers, cut in half lengthwise and seeded ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 (14.5 ounce) can Swanson® Vegetable Broth or Swanson® Certified Organic Vegetable Broth ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 (8 ounce) container refrigerated lump crabmeat, drained ADVERTISEMENT",
            "6 limes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the onion, tomato, red pepper and chili peppers into a large bowl. Add the oil and toss to coat.\nHeat a 10-inch nonstick skillet over medium heat. Add the vegetables and cook for 3 minutes, stirring occasionally. Add the garlic and cook for 2 minutes or until the vegetables are well browned, stirring occasionally. Remove and reserve the chili peppers from the skillet.\nRemove the remaining vegetables to a blender. Add the broth and parsley. Cover and blend for 2 minutes or until the mixture is smooth. Pour the vegetable mixture into a 2-quart saucepan and cook over medium heat until the mixture is hot and bubbling. Stir in the crabmeat and cook for 2 minutes or until the mixture is hot. Season with kosher salt and ground black pepper.\nMince the reserved chili peppers. Sprinkle the soup with the chili peppers and serve with the lime wedges.\n",
        "picture_link": "vcC97dLO.f3.3r9i5mnZV0K68ghmwLq"
    },
    {
        "title": "Deep-Fried Creamy Chicken Gravy",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/2 yellow onion, finely chopped ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 pinch freshly grated nutmeg ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "2 1/2 cups whole milk ADVERTISEMENT",
            "1 teaspoon salt, plus more to taste ADVERTISEMENT",
            "2 cups finely chopped, cooked chicken meat ADVERTISEMENT",
            "1/2 cup finely chopped ham ADVERTISEMENT",
            "2 tablespoons freshly chopped Italian parsley ADVERTISEMENT",
            "Breading: ADVERTISEMENT",
            "1 cup all-purpose flour, or as needed for dredging ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 cups bread crumbs ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in pan over medium heat. Add onions; cook and stir until onions begin to turn translucent, about 5 minutes. Stir in 1/2 cup flour and cook until flour loses its raw taste, 3 or 4 minutes. Add black pepper, nutmeg, and cayenne pepper; stir. Remove from heat.\nPour milk into butter-onion mixture to make the bechamel sauce. Whisk until incorporated. Return pan to medium-high heat and continue whisking until mixture thickens, 1 or 2 minutes; continue to cook and stir 3 or 4 minutes. Remove from heat and stir in salt.\nPlace chopped chicken, ham, and parsley in bowl. Add bechamel sauce and mix thoroughly. Allow mixture to cool to room temperature; cover with plastic wrap and refrigerate until firm, 2 or 3 hours.\nHeat oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C).\nPlace 1 cup flour, beaten eggs, and bread crumbs in 3 separate shallow bowls.\nScoop out chilled mixture into evenly-sized portions (about the size of a golf ball) to form croquettes. Roll balls first in flour, then in beaten eggs, and then in bread crumbs.\nFry croquettes in batches until crispy, about 4 minutes. Drain on paper towels and transfer to rack.\n",
        "picture_link": "WoaQM4v7xsMkW2MU3mRZEPfV5m7KoSe"
    },
    {
        "title": "Lentil Rice Salad",
        "ingredients": [
            "1 3/4 cups Swanson® Chicken Broth or Swanson® Certified Organic Chicken Broth or Swanson® Natural Goodness® Chicken Broth ADVERTISEMENT",
            "1/2 cup uncooked long grain white rice ADVERTISEMENT",
            "1/3 cup dried lentils ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 dash ground red pepper ADVERTISEMENT",
            "1 stalk celery, sliced ADVERTISEMENT",
            "1 medium red onion, chopped ADVERTISEMENT",
            "1/2 cup diced green pepper or red pepper ADVERTISEMENT",
            "1/2 cup fat free vinaigrette dressing ADVERTISEMENT",
            "6 lettuce leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the broth to a boil in a 2-quart saucepan over medium-high heat. Stir in the rice and lentils. Reduce the heat to low. Cover and cook for 20 minutes or until done. Let stand for 5 minutes or until the liquid is absorbed.\nToss the lentil mixture, parsley, ground red pepper, celery, onion, green pepper and vinaigrette in large bowl until coated. Cover and refrigerate for at least 2 hours or overnight. Season to taste. Serve on the lettuce leaves.\n",
        "picture_link": "ioRH6pvim.S0CwE6kw2QDDRmDonYVd6"
    },
    {
        "title": "Mint-Chip Coconut Milk Ice Cream",
        "ingredients": [
            "24 fluid ounces canned coconut milk ADVERTISEMENT",
            "1/3 cup agave syrup, or to taste ADVERTISEMENT",
            "1 teaspoon peppermint extract, or to taste ADVERTISEMENT",
            "3 ounces dark chocolate, chopped into small pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chill all the ingredients prior to preparing to quicken the freezing process.\nBlend coconut milk in a blender until smooth and evenly mixed; add agave syrup and peppermint extract and blend until smooth.\nTransfer coconut milk mixture to an ice cream maker and follow manufacturer's instructions for ice cream, adding chocolate pieces when indicated. Freeze for 2 hours before serving.\n",
        "picture_link": "C/hKElq5O4tsVlXVZWQ9U/gRSymp1iG"
    },
    {
        "title": "Easiest Creamiest Fudge",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (11 ounce) package chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9x9-inch baking pan with aluminum foil.\nCombine sweetened condensed milk and chocolate chips together in a microwave-safe bowl; melt in the microwave until smooth, 1 to 3 minutes. Stir until smooth. Pour mixture into the prepared pan.\nRefrigerate until set, at least 1 hour. Lift fudge out of pan by pulling up by the foil. Flip fudge onto a work surface and cut into 12 to 16 pieces.\n",
        "picture_link": "nVOiuoctO5aUQlUfuXmPGwD/K8ND9nO"
    },
    {
        "title": "Pescado con Queso (Cuban Fish with Cheese Sauce)",
        "ingredients": [
            "1 onion, chopped ADVERTISEMENT",
            "1/2 pound shredded Cheddar cheese ADVERTISEMENT",
            "2 pounds swai fish ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nMix onion and Cheddar cheese together in a bowl. Sprinkle 1/2 of the cheese mixture into the prepared baking dish; top with swai fish. Sprinkle the remaining cheese mixture over fish.\nWhisk milk, Worcestershire sauce, mustard, salt, and black pepper together in a bowl; pour over fish.\nBake in the preheated oven until fish flakes easily with a fork and the cheese is melted, about 45 minutes.\n",
        "picture_link": "NFirywzoxZssuLfyvNzNhABUveu/KCG"
    },
    {
        "title": "Fast Grilled Chicken Breast Marinade",
        "ingredients": [
            "1/2 cup sweet Japanese plum wine ADVERTISEMENT",
            "1/4 cup soy sauce (such as Kikkoman®) ADVERTISEMENT",
            "1/4 cup clover honey ADVERTISEMENT",
            "1 bunch green onions, finely chopped, or to taste ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "cracked black pepper to taste ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine plum wine, soy sauce, honey, green onions, garlic, and black pepper in a resealable plastic bag; seal and massage bag to thoroughly mix marinade.\nUsing a fork or meat tenderizer, score chicken lightly without pounding. Add chicken to marinade, massage gently to coat, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 20 minutes.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate. Remove chicken from the marinade and shake off excess. Discard the remaining marinade.\nCook chicken on the preheated grill until no longer pink in the center and the juices run clear, 5 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "E0fU6YiaNDfenDEAhD36Lsz2yi8DZ/O"
    },
    {
        "title": "Super Simple Perfect Chocolate Ganache",
        "ingredients": [
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour cream into a microwave-safe bowl; heat in microwave on high until very hot, 1 to 2 minutes. Add chocolate chips to heated cream; whisk until smooth.\nPlace chocolate-cream mixture in the freezer until ganache is cold and starting to thicken, stirring every 5 minutes, about 10 to 12 minutes.\nSpoon ganache into a resealable plastic bag and refrigerate until completely cooled, 15 to 30 minutes.\nCut a corner from the plastic bag and pipe ganache.\n",
        "picture_link": "ShVZIQ5RvFTre9Y03tcRjqM.TFKY/02"
    },
    {
        "title": "Chocolate Chia Pudding",
        "ingredients": [
            "2 cups coconut milk ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2/3 cup chia seeds ADVERTISEMENT",
            "1 tablespoon unsweetened shredded coconut ADVERTISEMENT",
            "1 teaspoon coconut sugar ADVERTISEMENT",
            "1 tablespoon coconut milk, or as needed ADVERTISEMENT",
            "1 tablespoon whipped cream, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 2 cups coconut milk, cocoa powder, maple syrup, vanilla extract, and salt together in a bowl; fold in chia seeds. Transfer mixture to a large jar with a lid; allow to rest for 5 minutes. Alternate gently rotating jar (30 seconds) and resting (4 minutes) for another 20 minutes.\nRefrigerate chia mixture, 8 hours to overnight.\nTransfer chia pudding to a bowl. Mix shredded coconut and coconut sugar together in a bowl. Drizzle 1 tablespoon coconut milk over pudding; top with whipped cream and shredded coconut mixture.\n",
        "picture_link": "yY3SwkCf/edq40hhNSfgigdiZbSbSze"
    },
    {
        "title": "Skinny Girl Chocolate Chip Cookies",
        "ingredients": [
            "2/3 cup whole wheat pastry flour ADVERTISEMENT",
            "1/2 cup cocoa nibs ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons pureed prunes ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix flour, cocoa nibs, honey, prunes, vanilla extract, baking powder, and sea salt together in a bowl until batter is smooth. Scoop batter using a cookie scoop and drop into a baking sheet.\nBake in the preheated oven until cookies are lightly browned, about 8 minutes.\n",
        "picture_link": "2HV8U.VdnyGYAQSqURhoE54Pz1wuI/6"
    },
    {
        "title": "Canadian Flag Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "3 eggs, at room temperature ADVERTISEMENT",
            "1/2 cup sour cream, at room temperature ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup milk, at room temperature ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "Decoration: ADVERTISEMENT",
            "2 cups sliced fresh strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 11X17-inch baking pan with 1-inch high sides.\nBeat 1 1/2 cups sugar and butter together in a large bowl with an electric mixer on medium speed until light and fluffy. Beat one egg at a time into the butter mixture; beat in sour cream and 2 teaspoons vanilla extract.\nSift flour, baking powder, baking soda, and salt together in a bowl. With mixer at low speed, add flour mixture to butter mixture alternately with milk just until combined. Scrape sides and bottom of bowl and finish mixing with a rubber spatula. Pour batter into prepared pan; spread to corners of pan and smooth top with a spatula.\nBake in the preheated oven until a toothpick inserted near the center comes out clean, about 20 minutes. Cool cake completely, about 30 minutes. To remove cake from pan, run a paring knife between cake and pan. Cover cake pan with plate or cooling rack; invert to transfer cake onto plate.\nBeat cream cheese, 1/2 cup sugar, and 1 teaspoon vanilla extract together in a bowl with an electric mixer on medium speed until fluffy, about 2 minutes. Reduce mixer speed to low; slowly pour in cream. Once cream is incorporated, turn mixer speed to medium-high; beat until stiff peaks form, about 2 minutes.\nSpread cream cheese mixture evenly over top and sides of cake, smoothing the top. Place 2 to 3 rows of overlapping strawberry slices parallel to short sides of cake for the two red stripes of the Canada flag. Trace out a maple leaf shape in center of cake with a toothpick; use points of strawberry slices to create points of maple leaf. Cut a strip of strawberry for the leaf stem; fill in the area of the maple leaf with sliced strawberries. Refrigerate cake until ready to serve.\n",
        "picture_link": "C7HvHe4DwrSiiPAnhBR5BtgIjuuugT6"
    },
    {
        "title": "Marinated Chickpeas",
        "ingredients": [
            "1 (15 ounce) can chickpeas (garbanzo beans), drained and rinsed ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon minced garlic ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chickpeas in a bowl. Add olive oil, oregano, lemon juice, lemon zest, parsley, garlic, and sea salt and mix well. Marinate chickpeas in the refrigerator, 8 hours to overnight.\n",
        "picture_link": "xfwlG3gp7/caBYxk2bcLwAFpBVj0xRS"
    },
    {
        "title": "Labneh (Lebanese Yogurt)",
        "ingredients": [
            "1 1/2 cups Greek yogurt ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh mint ADVERTISEMENT",
            "1 tablespoon chopped fresh dill ADVERTISEMENT",
            "1/2 teaspoon kosher salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix Greek yogurt, olive oil, mint, dill, and kosher salt together in a bowl. Cover and refrigerate up to 12 hours.\n",
        "picture_link": "KUzu8Xcf29q/cF.IyARyMpGu5mPPHpm"
    },
    {
        "title": "Southern Coffee Punch",
        "ingredients": [
            "2 cups boiling water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (2 ounce) jar instant coffee granules (such as Nescafe®) ADVERTISEMENT",
            "1 gallon 2% milk ADVERTISEMENT",
            "1/2 gallon vanilla ice cream ADVERTISEMENT",
            "1/2 gallon chocolate ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir boiling water, sugar, and instant coffee together in a bowl until dissolved; cool in refrigerator, 30 minutes to overnight.\nPour coffee mixture into a punch bowl; add milk, vanilla ice cream, and chocolate ice cream. Stir until ice cream begins to melt.\n",
        "picture_link": "mRk9imC4Zc7Ny8R8Mi6Ynk8e3MhNcRC"
    },
    {
        "title": "Faux Cookie Dough Dip",
        "ingredients": [
            "1 1/2 cups cooked chickpeas ADVERTISEMENT",
            "6 tablespoons brown sugar ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "3 tablespoons oats ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon baking soda ADVERTISEMENT",
            "1/3 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend chickpeas, brown sugar, peanut butter, oats, milk, vanilla extract, salt, and baking soda together in a food processor until smooth; fold in chocolate chips.\n",
        "picture_link": "kGwfVIwV9uB7b/40xW2CdvN0Rk9CmpO"
    },
    {
        "title": "Steak Fajita Soup",
        "ingredients": [
            "4 cups beef stock ADVERTISEMENT",
            "1 (15 ounce) can seasoned black beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "8 ounces leftover steak strips, cut into bite-size strips ADVERTISEMENT",
            "1 (6 ounce) can tomato sauce ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "2 tablespoons fajita seasoning ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 cup long-grain white rice (optional) ADVERTISEMENT",
            "1 (8 ounce) package shredded Monterey Jack cheese ADVERTISEMENT",
            "1 avocado - peeled, pitted, and sliced (optional) ADVERTISEMENT",
            "1 cup tortilla chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine beef stock, black beans, tomatoes, steak, tomato sauce, onion, green bell pepper, red bell pepper, milk, cumin, fajita seasoning, garlic, lime juice, and red pepper flakes in a large pot over medium heat. Cover pot and simmer for 30 minutes. Add rice and cook until rice is tender, about 30 minutes.\nGarnish soup with Monterey Jack cheese, avocado, and tortilla chips.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baked Autumn Veggighetti",
        "ingredients": [
            "2 large carrots, cut into spirals using a spiral slicer ADVERTISEMENT",
            "1 zucchini, cut into spirals using a spiral slicer ADVERTISEMENT",
            "1 small sweet potato, cut into spirals using a spiral slicer ADVERTISEMENT",
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "1 tablespoon butter, cut into small pieces ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 teaspoons lemon zest, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking dish with aluminum foil.\nPlace carrots, zucchini, and sweet potato in a large bowl; stir in olive oil, butter, lemon juice, and lemon zest until combined; season with salt and pepper. Pour vegetable mixture into prepared baking dish.\nBake in the preheated oven 10 minutes; toss mixture again. Continue baking until vegetables are tender, about 10 minutes more. Transfer vegetables to individual serving bowls; sprinkle with parsley.\n",
        "picture_link": "0.35ZWjqJEObOK5UikgjEBIQag0MzFm"
    },
    {
        "title": "Berry Smoothie Bowl",
        "ingredients": [
            "Smoothie: ADVERTISEMENT",
            "1 cup frozen strawberries ADVERTISEMENT",
            "1 cup frozen pineapple chunks ADVERTISEMENT",
            "1 cup plain Greek yogurt ADVERTISEMENT",
            "1/2 cup coconut water ADVERTISEMENT",
            "2 tablespoons frozen acai berry pulp, or as desired ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "1 kiwi, peeled and sliced ADVERTISEMENT",
            "1/2 banana, sliced ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "1/2 cup fresh raspberries ADVERTISEMENT",
            "2 tablespoons sliced almonds ADVERTISEMENT",
            "2 tablespoons granola ADVERTISEMENT",
            "1 teaspoon chia seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend strawberries, pineapple, yogurt, coconut water, and acai pulp in a blender until smooth; pour into a bowl. Top smoothie with kiwi, banana, blueberries, raspberries, almonds, granola, and chia seeds.\n",
        "picture_link": "g.RWX8XhKG5jdMuoWV.ozFXiwxwHsn6"
    },
    {
        "title": "Mushroom and Black Bean Quesadillas",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 cup rinsed and drained canned black beans ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "2 whole wheat tortillas ADVERTISEMENT",
            "3/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "2 tablespoons lime juice (optional) ADVERTISEMENT",
            "1/4 cup salsa, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium-high heat; saute mushrooms and onions until lightly browned, about 1 minute. Add black beans, cilantro, salt, and pepper; saute until mushrooms and onions are lightly browned, 2 to 3 minutes more.\nPlace tortillas in a clean, dry skillet. Evenly distribute mushroom mixture onto 1 half of each tortilla. Top filling with mozzarella cheese and lime juice; fold each tortilla over filling. Turn burner to medium heat and cook until quesadillas are browned and crispy, about 2 minutes per side. Cut into wedges and serve with salsa.\n",
        "picture_link": "bmhWYKCli2K/XyeUCoADhUkUZl6B.Tq"
    },
    {
        "title": "Cold Pasta Primavera Salad from Hidden Valley®",
        "ingredients": [
            "1/2 (1 ounce) packet Hidden Valley® Original Ranch® Salad Dressing & Seasoning Mix ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "3 tablespoons olive oil or vegetable oil ADVERTISEMENT",
            "2 zucchini, cut into 1/4-inch slices ADVERTISEMENT",
            "1 cup frozen broccoli florets, steamed ADVERTISEMENT",
            "1 red bell pepper or green bell pepper, cut into small chunks ADVERTISEMENT",
            "1 cup cherry tomatoes, halved ADVERTISEMENT",
            "4 medium radishes, thinly sliced ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1 (16 ounce) package rotini (corkscrew) pasta ADVERTISEMENT",
            "2 tablespoons drained capers (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to package directions. Rinse with cool water and drain. Combine Hidden Valley(R) Original Ranch Salad(R) Dressing & Seasoning Mix with milk and mayonnaise in a bowl, creating 1 cup dressing.\nIn a small bowl, whisk the dressing together with the oil until emulsified.\nIn a large bowl, add the pasta and the remaining ingredients.\nAdd the dressing and toss until well coated.\nChill covered for 1 hour before serving.\n",
        "picture_link": "NGgV9uMupX/now/WEQj0v04.Rnx10Ey"
    },
    {
        "title": "Taco Stuffed Poblano Peppers",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (6.8 ounce) package Spanish-style rice mix ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "3 large poblano peppers, halved lengthwise and seeded ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 tablespoon water, or as needed ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 2 cups water and butter to a boil in a saucepan; add rice and seasoning packet. Return to a boil, cover saucepan, reduce heat to low, and simmer until most water is absorbed, 20 to 25 minutes. Fluff rice using a fork.\nSpray a 9x13-inch baking dish with cooking spray.\nBring a pot of water to a boil; cook poblano peppers until slightly tender, about 5 minutes. Transfer peppers to a bowl of ice water to stop the cooking process; drain. Pat peppers dry and place in the prepared baking dish.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Season beef with black pepper. Mix 1/2 cup water, chili powder, cumin, onion powder, garlic powder, and cayenne pepper into ground beef; cook and stir until liquid evaporates, 2 to 3 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nMix rice into beef mixture; cook and stir until evenly mixed and all liquid is evaporated, 5 to 10 minutes. Spoon mixture into the peppers.\nStir tomato soup and about 1 tablespoon water together in a bowl until soup is thinned to a gravy consistency, adding more water if needed. Pour tomato gravy over stuffed peppers; top with mozzarella cheese. Cover baking dish with aluminum foil.\nBake in the preheated oven for 20 minutes. Remove aluminum foil and continue baking until cheese is slightly browned, 10 to 15 minutes more.\n",
        "picture_link": "aGxOjl6OidktY/ODj84rxtxJknNIuNu"
    },
    {
        "title": "Pork with Apples and Mushrooms",
        "ingredients": [
            "1 pound boneless pork tenderloin, cut into 1/2-inch thick slices ADVERTISEMENT",
            "1/2 teaspoon dried thyme, crushed ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 large onion, cut in half and sliced ADVERTISEMENT",
            "8 ounces assorted sliced mushrooms (baby bellas, shiitake, and oyster) ADVERTISEMENT",
            "1 medium apple, sliced ADVERTISEMENT",
            "1 (10.5 ounce) can Campbell's® Healthy Request® Condensed Cream of Mushroom Soup ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "3/4 cup Swanson® Natural Goodness® Chicken Broth ADVERTISEMENT",
            "2 cups hot cooked instant brown rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the pork with the thyme and black pepper.\nHeat the oil in a 12-inch nonstick skillet over medium-high heat. Add the pork and cook until browned on both sides. Remove the pork from the skillet.\nCook the mushrooms and onion in the skillet for 5 minutes, stirring occasionally. Stir in the apple and cook for 5 minutes or until the apple is tender-crisp. Stir in the soup, vinegar and broth and heat to a boil. Return the pork to the skillet. Reduce the heat to low. Cover and cook for 5 minutes or until the pork is cooked through. Serve the pork and sauce with the rice.\n",
        "picture_link": "zCBYxrZQZrsWgFNuxmlrNmfaLaBHrvm"
    },
    {
        "title": "Vegan \"Grated\" Parmesan Cheese",
        "ingredients": [
            "1/4 cup nutritional yeast flakes ADVERTISEMENT",
            "1/4 cup almond meal ADVERTISEMENT",
            "1 pinch sea salt (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine nutritional yeast, almond meal, and sea salt in a blender. Using short pulses, blend the ingredients just enough to come together.\n",
        "picture_link": "bn5PPKp4reDg/krRNEJnovfaG1Oh3Ye"
    },
    {
        "title": "Buffalo Chicken Lasagna",
        "ingredients": [
            "1 1/2 pounds bone-in chicken breasts with skin ADVERTISEMENT",
            "2 cups chicken stock, or as needed ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon salt, or more to taste ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "12 lasagna noodles ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 tablespoon olive oil, or more as needed ADVERTISEMENT",
            "2 stalks celery, finely chopped ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "2/3 cup buffalo wing sauce ADVERTISEMENT",
            "1/2 cup crumbled blue cheese ADVERTISEMENT",
            "1 (16 ounce) container ricotta cheese ADVERTISEMENT",
            "1 cup blue cheese dressing ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in a single layer in a large pot and add enough chicken stock to cover; season with paprika, 1 teaspoon salt, and cayenne pepper. Bring stock to a boil, reduce heat to medium, and simmer until chicken is no longer pink in the center, 15 to 20 minutes. Shred chicken.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Drain. Arrange noodles on a sheet of aluminum foil or parchment paper and spray with cooking spray to prevent sticking.\nHeat olive oil in a skillet over medium heat; cook and stir celery and onion until just starting to soften, about 5 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine onion mixture and shredded chicken in a bowl; add about 1/3 the buffalo wing sauce and blue cheese and mix well.\nMix ricotta cheese, blue cheese dressing, and remaining buffalo wing sauce in a separate bowl; season with salt and cayenne pepper to taste. Stir egg into mixture.\nSpread a layer of ricotta mixture in the bottom of a 9x13-inch baking dish; top with a layer of 3 noodles. Spread 1/4 of the remaining ricotta mixture over noodle layer; top with 1/3 the chicken mixture, and 1/4 the mozzarella cheese. Layer 3 lasagna noodles over cheese layer and repeat layering 2 times more ending with a layer of ricotta mixture and mozzarella cheese.\nBake in the preheated oven until cooked through and top is lightly browned, about 45 minutes. Cool lasagna at least 20 minutes before cutting.\n",
        "picture_link": "U1w1dTHBAUspV.qX1CDOIf93Y06mJ2."
    },
    {
        "title": "Jumpstart Chocolate Workout Smoothie",
        "ingredients": [
            "1 1/4 cups almond milk ADVERTISEMENT",
            "12 ice cubes ADVERTISEMENT",
            "1 banana, broken into chunks ADVERTISEMENT",
            "1/2 cup strong brewed coffee, chilled ADVERTISEMENT",
            "1/3 cup chocolate-flavored whey protein powder ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon unsalted natural peanut butter, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend almond milk, ice cubes, banana, coffee, protein powder, honey, and peanut butter in a blender on low speed. Gradually turn speed up to high and blend until smooth, 20 to 30 seconds.\n",
        "picture_link": "cXVPLGyMe9U6lQ0YnjuPJyTwGrQaE92"
    },
    {
        "title": "Butternut Squash Pie",
        "ingredients": [
            "2 prepared pie crusts ADVERTISEMENT",
            "2 1/2 cups cooked butternut squash cubes ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Press each pie crust into 2 pie plates.\nBlend butternut squash, eggs, brown sugar, milk, cream, flour, butter, cinnamon, salt, ginger, vanilla extract, nutmeg, and cloves in a blender until smooth; pour into pie crusts.\nBake in the preheated oven until pies are set in the middle, 35 to 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Linguine With Red Clam Sauce",
        "ingredients": [
            "1 (16 ounce) package linguine (such as Barilla®) ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 (2 ounce) can anchovy fillets, drained ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1/2 cup dry red wine ADVERTISEMENT",
            "2 (14 ounce) cans baby clams, 1 can drained ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain.\nHeat a large skillet over medium heat and add olive oil. Place anchovies in the hot oil, pressing with the back of a wooden spoon until anchovies are melted in the oil, 2 to 3 minutes. Add garlic, shallot, kosher salt, red pepper flakes, thyme, oregano, and basil; cook for 1 minute. Increase heat to medium-high and cook, stirring frequently, until onion and garlic start to soften, 3 to 4 minutes.\nPour wine over onion mixture and cook 1 to 2 minutes. Mix clams and their juice into onion mixture; cook and stir for 2 to 3 minutes. Stir tomatoes into clam mixture and cook until sauce is heated through, 2 to 3 minutes; season with salt and black pepper. Add linguine and 1/2 of the parsley to sauce and mix. Garnish with remaining parsley and lemon zest.\n",
        "picture_link": "AGfgz0W9SMnjjmsabpSeWSdKsI3WbW2"
    },
    {
        "title": "Pesto Cream Cheese Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2/3 cup basil pesto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread cream cheese evenly in the bottom of an 8-inch round baking dish. Layer pesto evenly over cream cheese.\nBake in the preheated oven until bubbling, about 20 minutes.\n",
        "picture_link": "PZ.2NRjUCb.DvqwwXcxDuKBzG/UJWXC"
    },
    {
        "title": "No-Workout-Needed Chocolate Cake",
        "ingredients": [
            "1 teaspoon coconut oil, or as needed ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "1 (15.25 ounce) package dark chocolate cake mix ADVERTISEMENT",
            "1 (12 ounce) package soft tofu ADVERTISEMENT",
            "1/2 cup brewed coffee ADVERTISEMENT",
            "Chocolate Topping: ADVERTISEMENT",
            "1/4 cup dark chocolate chips ADVERTISEMENT",
            "3 tablespoons almond milk ADVERTISEMENT",
            "2 tablespoons powdered peanut butter (such as PB2®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Rub enough coconut oil into a 9-inch springform pan to lightly coat bottom and sides.\nBlend cake mix and tofu together in a food processor until well mixed, 1 to 2 minutes. Add brewed coffee and blend until well mixed, scraping sides down as needed. Pour batter into the prepared springform pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 25 to 30 minutes.\nMix chocolate chips, almond milk, and powdered peanut butter together in a microwave-safe bowl; heat in microwave for 30 seconds. Mix and heat for 30 seconds more. Spoon chocolate topping over cake.\n",
        "picture_link": "xq/vxVEkvnet/Pvfuh2L7NXiQDqFTve"
    },
    {
        "title": "JB Buffalo Wing Sauce",
        "ingredients": [
            "3/4 cup hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine hot pepper sauce, butter, vinegar, Worcestershire sauce, cayenne pepper, garlic powder, black pepper, red pepper flakes, and flour in a small saucepan over low heat; cook and stir, adding more flour if needed to thicken, until smooth, 5 to 10 minutes.\n",
        "picture_link": "mY/9KWPf.w3LzejgWDaPbc.WYoecYDe"
    },
    {
        "title": "Buttermilk French Toast with Maple Syrup",
        "ingredients": [
            "French Toast: ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon nutmeg ADVERTISEMENT",
            "4 thick slices Texas toast ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "Syrup: ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon maple-flavored extract ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs in a bowl until smooth. Add buttermilk, almond extract, cinnamon, and nutmeg and beat well until batter is smooth. Dip bread into batter until evenly coated.\nSpray a skillet with cooking spray and heat over medium heat. Cook coated bread until golden brown, 4 to 5 minutes per side.\nCombine white sugar, water, and brown sugar in a saucepan; bring to a boil and cook for 1 minute. Remove saucepan from heat and cool syrup for 2 minutes. Stir maple-flavored extract and vanilla extract into syrup. Serve syrup over French toast.\n",
        "picture_link": "Emub4rtLhXZTkNwVA6CnVf5jg1s3h9K"
    },
    {
        "title": "3-Ingredient Slow Cooker Sweetened Condensed Milk",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 teaspoons vanilla extract (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Turn slow cooker on High. Mix milk and sugar together in the crock of the slow cooker.\nCook for 3 hours, stirring every 10 minutes in the last 30 minutes to prevent burning. Mix butter and vanilla extract into condensed milk and let cool.\n",
        "picture_link": "0HThHJOHzt1ikOjFYMaaGDCk7VWQqSa"
    },
    {
        "title": "Poppy Seed Salad",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "2 heads romaine lettuce, torn into bite-size pieces ADVERTISEMENT",
            "3 (15 ounce) cans mandarin oranges, drained ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "5 ounces slivered almonds ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 1/2 tablespoons poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix lettuce, oranges, green onions, and almonds in a large mixing bowl.\nBlend sugar, vinegar, salt, and mustard in a blender. Stream oil into the dressing while blending. Continue to blend until the dressing emulsifies. Add poppy seeds and blend briefly to mix. Drizzle dressing over the salad and toss to coat.\n",
        "picture_link": "me0XtcdLC0Ncn5nr0l1hx7CnLr9ddPm"
    },
    {
        "title": "Lamb Chops with Minted Yogurt Sauce",
        "ingredients": [
            "8 (3/4-inch thick) rib lamb chops ADVERTISEMENT",
            "1/2 ounce Crosse & Blackwell® Mint Sauce, divided ADVERTISEMENT",
            "1 cup Greek-style plain yogurt ADVERTISEMENT",
            "6 tablespoons Crisco® 100% Extra Virgin Olive Oil, divided ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lamb chops and 1/4 cup mint sauce in large resealable plastic bag. Seal bag. Turn to coat chops. Chill 30 minutes.\nWhisk yogurt, remaining 1/4 cup olive oil, parsley, garlic, salt, pepper and remaining 1/4 cup mint sauce in medium bowl until combined. Chill until ready to serve.\nHeat remaining olive oil in large skillet over medium heat. Add lamb chops to skillet. Cook 3 to 5 minutes on each side until internal temperature reaches 145 degrees F. Cover. Let rest 3 minutes. Serve with minted yogurt sauce.\n",
        "picture_link": "XCY0jiBpv5sGf3AHWKdIwuuEulNRvU2"
    },
    {
        "title": "Bison Dog Roll-Ups",
        "ingredients": [
            "3 tablespoons yellow cornmeal ADVERTISEMENT",
            "1 (4 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "1/4 cup honey mustard, divided ADVERTISEMENT",
            "2 slices American cheese, halved diagonally ADVERTISEMENT",
            "4 bison dogs ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F. Sprinkle about 1 tablespoon of the cornmeal on a baking sheet. Unroll crescent rolls and place on top of cornmeal. Spread each crescent with 1 teaspoon of the honey mustard and sprinkle with 1 teaspoon of the cornmeal.\nTop each crescent with 1/2 slice of cheese and place a bison dog at the wide end. Roll up the crescents around the bison dogs. Place roll-ups, seam sides down, on the prepared baking sheet. Sprinkle rolls with remaining cornmeal. Bake for 12 to 15 minutes or until crescents are golden. Combine remaining honey mustard and mayonnaise in a small bowl; serve with roll-ups.\n",
        "picture_link": "DQ63RmoDIEaTgCUqTNN/uDV2R3/VC6G"
    },
    {
        "title": "Honey-Orange Bison Back Ribs",
        "ingredients": [
            "5 pounds bison back ribs, cut into 2- to 3-rib portions ADVERTISEMENT",
            "2 (12 ounce) bottles chili sauce ADVERTISEMENT",
            "1 1/2 cups orange juice ADVERTISEMENT",
            "2 teaspoons finely shredded orange zest ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1/3 cup cider vinegar ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bison back ribs in a 4- to 6-quart pot. Cover with water. Bring to boiling; reduce heat. Simmer, covered, for 1 hour or until tender. Drain; cool for 30 minutes. Place bison back ribs in a large resealable plastic bag set in a shallow dish.\nFor marinade, combine chili sauce, orange juice, orange zest, onion, vinegar, honey, garlic, salt, and pepper in a large bowl. Pour 3 cups over the bison back ribs. Marinate bison back ribs in the refrigerator for 4 to 24 hours, turning bag occasionally. Cover remaining marinade; chill until needed. Drain bison back ribs; reserve the drained marinade for brushing on ribs while grilling.\nFor charcoal grill, arrange preheated coals around a drip pan. Test for medium heat above pan. Place bison back ribs on grill rack over drip pan. Cover and grill for 15 to 20 minutes or until heated through, brushing once with some of the drained marinade; discard any remaining marinade used for brushing. (For gas grill, preheat grill. Reduce heat to medium-high. Adjust for indirect grilling. Grill as above.)\nPlace the reserved marinade (not used for marinating or brushing) in a medium saucepan. Bring to boiling; reduce heat. Simmer, uncovered, for 10 minutes; pass with bison back ribs.\n",
        "picture_link": "B1FxRqM8D7TmgCtfARUDKJcC19PsGu6"
    },
    {
        "title": "Cream of Fiddlehead Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 large onion, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "6 cups chicken stock, divided ADVERTISEMENT",
            "2 cups chopped fiddlehead ferns ADVERTISEMENT",
            "1 carrot, diced ADVERTISEMENT",
            "1 potato, diced ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce (optional) ADVERTISEMENT",
            "1 tablespoon soy sauce (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium-high heat until foamy, about 1 minute. Stir in onion and garlic; cook and stir until onion has softened and turned translucent, about 5 minutes. Stir in flour and cook, stirring constantly, for 2 minutes.\nPour 4 cups chicken stock into the onion mixture, and bring to a full boil; stir in fiddleheads, carrot, and potato. Reduce heat to medium-low, cover, and simmer until vegetables are tender, about 30 minutes.\nBlend soup until smooth with a hand blender. Stir in cream; cook and stir until heated through, about 5 minutes. Taste soup, and stir in Worcestershire sauce and soy sauce. If you prefer a thinner soup, add additional chicken stock up to 2 cups. Season with salt and pepper. Garnish with Cheddar cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Andre's Easy Fruit Dip",
        "ingredients": [
            "1 (12 ounce) package whipped cream cheese ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "4 ounces sour cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese, marshmallow creme, sour cream, and vanilla extract together in a bowl using an electric mixer. Refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "/NPHn5Wne5p/aMXxAyLOIiiCoXeDxxy"
    },
    {
        "title": "Moroccan Shepherd's Pie",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound cubed lamb stew meat ADVERTISEMENT",
            "1 teaspoon ground cumin, divided ADVERTISEMENT",
            "1/2 teaspoon salt, divided ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "4 garlic cloves, minced ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 1/2 (10.5 ounce) cans low-sodium chicken broth ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons olives, or to taste ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, divided ADVERTISEMENT",
            "1 cup frozen green peas ADVERTISEMENT",
            "4 cups peeled and chopped sweet potatoes ADVERTISEMENT",
            "1 large egg, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray four 10-ounce ramekins with cooking spray.\nHeat a large skillet over medium-high heat. Add oil to pan; swirl to coat.\nSprinkle lamb evenly with 1/2 teaspoon cumin and 1/4 teaspoon salt. Cook and stir lamb in the hot oil until browned on all sides, about 4 minutes. Transfer lamb to a bowl. Cook and stir onion in the same skillet until slightly softened, about 3 minutes; add garlic and cook until fragrant, about 30 seconds.\nStir tomato paste into onion mixture until evenly coated, about 30 seconds. Pour broth and water into onion mixture; bring to a boil, scraping skillet with a wooden spoon to loosen browned bits of food. Return lamb to skillet.\nStir remaining 1/2 teaspoon cumin, olives, raisins, honey, cayenne pepper, turmeric, and 1/8 teaspoon cinnamon into lamb mixture. Reduce heat and simmer, stirring occasionally, until lamb is fully cooked and flavors have blended, about 30 minutes. Remove from heat and stir in peas.\nPlace sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 10 minutes. Drain and cool for 5 minutes. Transfer sweet potatoes to a bowl and sprinkle with 1/4 teaspoon salt and 3/8 teaspoon cinnamon. Beat potato mixture with a hand mixer on high speed until smooth. Add egg; beat until incorporated.\nSpoon lamb mixture into each ramekin; spread sweet potato mixture over lamb mixture. Place ramekins on a baking sheet.\nBake in the preheated oven until bubbling, about 25 minutes.\n",
        "picture_link": "o0PvEzbmDCgZVQ62ajYfwBL0IGXWp3K"
    },
    {
        "title": "Egg White and Avocado Salad",
        "ingredients": [
            "2 cups fresh baby spinach ADVERTISEMENT",
            "1 avocado - peeled, pitted, and cut into 1/2-inch pieces ADVERTISEMENT",
            "6 hard-boiled egg whites, chopped into 1/2-inch pieces ADVERTISEMENT",
            "2 tablespoons light mayonnaise ADVERTISEMENT",
            "1 celery stalk, cut into 1/4-inch pieces (optional) ADVERTISEMENT",
            "2 tablespoons sliced black olives, or to taste ADVERTISEMENT",
            "2 teaspoons freshly squeezed lemon juice ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 pinch ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place spinach, avocado, egg whites, and mayonnaise in a large bowl; gently toss to coat. Add celery, olives, lemon juice, salt, and pepper; lightly toss to combine.\n",
        "picture_link": "l2dUDs8X0rPUWaSs4xk1uJsaopUrH5q"
    },
    {
        "title": "Marshmallow Toast",
        "ingredients": [
            "1 slice white bread ADVERTISEMENT",
            "1 teaspoon margarine ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup miniature marshmallows, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast bread in a toaster oven until lightly browned, 1 to 2 minutes. Spread margarine over toast and sprinkle with cinnamon; top with marshmallows. Return toast to toaster oven and toast until marshmallows are golden brown, 1 to 2 minutes.\n",
        "picture_link": "gmiEkVNS71sJBgtAgc6.Nj0PEWQS5ky"
    },
    {
        "title": "Spring Fiddleheads and Sweet Peppers",
        "ingredients": [
            "1/2 pound fiddlehead ferns, ends trimmed ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 yellow bell pepper, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of lightly salted water to a boil. Boil fiddlehead ferns for 10 minutes; drain.\nHeat olive oil in a skillet over medium heat, and cook and stir red pepper, yellow pepper, and garlic until peppers begin to soften, about 5 minutes.\nStir fiddleheads into the skillet, and continue to cook and stir until fiddleheads are tender, about 2 minutes. Season with salt and pepper.\n",
        "picture_link": "i4EPa250XhjJBbTbV5L59uNY9UNhRqu"
    },
    {
        "title": "Bison Souvlaki Skewers",
        "ingredients": [
            "1 1/2 pounds bison skirt steak ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "3 teaspoons finely shredded lemon zest ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "25 to 30 6- to 8-inch skewers* ADVERTISEMENT",
            "Yogurt-Cucumber Sauce: ADVERTISEMENT",
            "2 cups plain Greek yogurt ADVERTISEMENT",
            "1 cup peeled, seeded, and diced cucumber ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut bison skirt steak across the grain into 1-inch wide strips. Place bison strips in a resealable plastic bag set in a shallow bowl.\nFor marinade, combine oil, lemon juice, lemon zest, the 3 cloves garlic, the 1 teaspoon salt, the oregano, and the 1/4 teaspoon pepper in a small bowl. Pour marinade over bison strips. Seal bag; turn to coat bison strips. Marinate in the refrigerator for 2 to 4 hours, turning bag occasionally.\nDrain bison strips; discard marinade. Thread bison strips accordion-style onto skewers, trimming as necessary.\nFor a charcoal or gas grill, place bison skewers on the rack of a covered grill directly over medium heat. Grill for 4 to 6 minutes, turning once halfway through grilling. (Or place skewers on the unheated rack of a broiler pan. Broil for 3 to 4 inches from the heat for 5 to 7 minutes, turning once.) Serve with Yogurt-Cucumber Sauce.\nYogurt-Cucumber Sauce: Combine yogurt, cucumber, green onion, the 2 cloves minced garlic, the 1/2 teaspoon salt, and the 1/8 teaspoon pepper in a small bowl. Cover and chill until ready to serve.\n",
        "picture_link": "l1xIFiMC.jNa9Q44BKyokj7HacdYXMG"
    },
    {
        "title": "Chicken and Rice Noodle Stir Fry",
        "ingredients": [
            "1 large skinless, boneless chicken breast, cut in bite-sized pieces ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch onion powder, or to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package dried rice noodles ADVERTISEMENT",
            "4 cups hot water, or as needed ADVERTISEMENT",
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 cup white cooking wine, or to taste ADVERTISEMENT",
            "1/4 cup soy sauce, or to taste ADVERTISEMENT",
            "2 tablespoons teriyaki sauce, or to taste ADVERTISEMENT",
            "1 (6 ounce) can sweet baby corn, drained ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle chicken with garlic powder, onion powder, and black pepper.\nSoak rice noodles in a bowl with hot water until softened, about 10 minutes; drain and cut noodles in half with scissors.\nHeat 1 1/2 tablespoons vegetable oil in a wok or large skillet over medium-high heat; cook and stir garlic in the hot oil until fragrant, about 1 minute. Add onion and green bell pepper; cook, stirring constantly, until onion and pepper are softened, about 5 minutes. Add remaining 1 1/2 tablespoons vegetable oil; cook and stir chicken into onion mixture until chicken is no longer pink in the center, 5 to 7 minutes.\nStir wine, soy sauce, and teriyaki sauce into chicken mixture; simmer until liquid is slightly reduced, about 3 minutes. Add baby corn and green onions; toss to evenly coat with sauce. Mix rice noodles into stir fry mixture; toss to coat. Cook and stir until heated through, about 2 more minutes.\n",
        "picture_link": "9P9D.J32ejPAQc0roje899pNP5.3VDa"
    },
    {
        "title": "Bulgarian Tarator - Cold Cucumber Soup",
        "ingredients": [
            "2 cucumbers, peeled and cut into small cubes ADVERTISEMENT",
            "1 (16 ounce) container plain yogurt ADVERTISEMENT",
            "1/4 cup minced fresh dill ADVERTISEMENT",
            "4 cloves garlic, pressed ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon water, or as needed (optional) ADVERTISEMENT",
            "10 ice cubes, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumbers in a large bowl. Whisk yogurt in a separate bowl using a fork until yogurt is smooth and liquefied; pour over cucumbers. Add dill, garlic, oil, and salt to cucumber mixture; toss to coat. Stir in enough water to reach desired consistency. Refrigerate until chilled, at least 30 minutes.\nLadle soup into serving bowls; add about 2 ice cubes to each bowl.\n",
        "picture_link": "0tnLYmblPihV3Wm09Agk0laOdYpaQLm"
    },
    {
        "title": "Sweet Corn on The Cob Without the Cob",
        "ingredients": [
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon salted butter ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir corn, butter, and sugar together in a saucepan over low heat; cook and stir until simmering, about 5 minutes. Season with salt and black pepper to taste.\n",
        "picture_link": "uraiqBi6NTdayatBKTzumH2pPr5OgbS"
    },
    {
        "title": "Easy Sausage Biscuit Bites",
        "ingredients": [
            "1 (12 ounce) can refrigerated biscuit dough (such as Pillsbury Grands Jr.®) ADVERTISEMENT",
            "2 tablespoons sweet hot mustard ADVERTISEMENT",
            "9 ounces fully cooked sausage links ADVERTISEMENT",
            "4 teaspoons finely grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSpread each biscuit into a 2x4-inch oval using your hands. Brush hot mustard onto each biscuit. Place a sausage link across the short edge of each biscuit oval and roll up lengthwise. Cut each rolled biscuit into 4 round slices. Lay 'bites' onto a baking sheet. Sprinkle each 'bite' with Parmesan cheese.\nBake in the preheated oven until biscuits are browned, 18 to 20 minutes.\n",
        "picture_link": "gn2j1YaPH1Qsc7BU.JROvLY41lr.Z7i"
    },
    {
        "title": "Two Meatballs in One",
        "ingredients": [
            "Small Meatballs: ADVERTISEMENT",
            "4 sweet Italian pork sausage, casings removed ADVERTISEMENT",
            "1/2 cup water, or as needed ADVERTISEMENT",
            "Large Meatballs: ADVERTISEMENT",
            "2 1/4 pounds ground beef ADVERTISEMENT",
            "1/2 cup Italian-seasoned bread crumbs ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 teaspoons granulated garlic ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 sweet onion, minced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (15 ounce) can no salt-added diced tomatoes with Italian herbs ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried sweet basil ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Form pork sausage into small 1/2-inch meatballs using a small scoop. Fill a skillet with enough water to make a 1-inch depth; bring to a boil, reduce heat to medium-low, and simmer. Cook meatballs in the simmering water until cooked through, about 15 minutes. Remove meatballs with a slotted spoon and cool on a paper towel-lined plate. Drain water.\nPreheat oven to 350 degrees F (175 degrees C).\nMix ground beef, bread crumbs, ketchup, Parmesan cheese, Worcestershire sauce, egg, granulated garlic, and 1 teaspoon black pepper in a large bowl. Scoop ground beef mixture into about 1-inch portions using an ice cream scooper; form each portion around 1 small pork meatball to cover completely. Arrange double meatballs on a baking sheet.\nBake in the preheated oven until meatballs are browned and partially cooked, about 25 minutes.\nHeat olive oil in a pot over medium heat; cook and stir onion and garlic in the hot oil until onion is softened, about 10 minutes. Add crushed tomatoes, diced tomatoes, sugar, Italian seasoning, 1 teaspoon black pepper, basil, and lemon juice; bring to a boil. Reduce heat and simmer sauce for 20 minutes. Add meatballs to sauce and simmer, stirring gently, until meatballs are fully cooked, about 20 more minutes.\n",
        "picture_link": "VWB5T/rYhqbAtkS7Qm7ImzQyjLQLrqO"
    },
    {
        "title": "Mincemeat Spice Cake",
        "ingredients": [
            "1/2 cup butter, softened, plus additional for preparing pan ADVERTISEMENT",
            "1 1/2 cups Pillsbury BEST® All Purpose Flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup Crosse & Blackwell® Mincemeat Filling & Topping or Crosse & Blackwell® Rum & Brandy Mincemeat Filling & Topping ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "Grated peel of 1 lemon ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 cup Crosse & Blackwell® Mincemeat Filling & Topping ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1/4 cup rolled oats ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F. Line bottom of springform cake pan with wax paper and butter the sides.\nPlace flour, baking powder, sugar and 1/2 cup butter in large bowl. Stir in milk, mincemeat, eggs and lemon peel. Mix on low speed of electric mixer 2 minutes or until thoroughly combined. Pour into prepared pan.\nBake 30 minutes. While cake is baking, mix all topping ingredients in small bowl. Remove cake from oven and spoon on topping. Return cake to oven and bake an additional 30 minutes or until toothpick inserted in center comes out clean.\n",
        "picture_link": "LA.UcD7b4HqXqw2Jdj2ugwpoZuy1dQ."
    },
    {
        "title": "Chicken Adobo with Noodles Filipino-Mexican Fusion",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil, or as needed ADVERTISEMENT",
            "8 large skinless, boneless chicken thighs ADVERTISEMENT",
            "1/2 Spanish sweet onion, chopped ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "1/2 cup rice wine vinegar ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "2 tablespoons chipotle sauce ADVERTISEMENT",
            "1 1/2 tablespoons arrowroot powder, or as desired ADVERTISEMENT",
            "1 (16 ounce) package dry flat rice noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Cook chicken thighs in hot oil until no longer pink on the outside, 1 to 2 minutes per side. Add onion and continue to cook until the onion is translucent, 5 to 7 minutes. Stir garlic into the chicken mixture; cook and stir until fragrant, about 1 minute. Add vinegar, soy sauce, cumin, and bay leaves to the pot. Stir tomato paste and chipotle paste into the liquid in the pot.\nBring the mixture to a simmer and cook until the chicken is no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Stir arrowroot powder into the liquid at the bottom of the pot; continue cooking until the liquid thickens, about 5 minutes.\nBring a large pot of lightly salted water to a boil. Cook rice noodles in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 4 minutes; drain. Ladle sauce and chicken over the noodles to serve.\n",
        "picture_link": "9V3WsoWWnL/RWv4OfKG2EM2ScwJOF72"
    },
    {
        "title": "Macaroni with Four Cheeses",
        "ingredients": [
            "1 (16 ounce) package macaroni ADVERTISEMENT",
            "1 (8 ounce) package feta cheese, cut into small cubes ADVERTISEMENT",
            "8 ounces halloumi cheese, cut into cubes ADVERTISEMENT",
            "2 tablespoons sunflower seed oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "4 tomatoes, peeled and shredded ADVERTISEMENT",
            "1 teaspoon dried mint ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup grated Edam cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a large baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until cooked through but firm to the bite, 8 minutes; drain. Pour macaroni into prepared baking dish. Stir feta cheese and halloumi cheese into the macaroni.\nHeat oil in a large skillet over medium heat. Cook and stir onion and garlic in hot oil until tender, about 5 minutes. Add tomatoes, mint, and ground black pepper; continue to cook and stir until the tomato softens, about 3 minutes. Melt the cream cheese into the tomato mixture; pour over macaroni mixture and stir to coat. Sprinkle Edam cheese evenly over the macaroni mixture.\nBake in the preheated oven until the top is bubbling, about 20 minutes.\n",
        "picture_link": "dT3RZyXWzXnPLaQhSvtB68dHqLoknni"
    },
    {
        "title": "Zesty Layered Shrimp Spread",
        "ingredients": [
            "1 pound peeled and deveined frozen cooked small or salad shrimp, thawed and patted dry ADVERTISEMENT",
            "2 tablespoons finely chopped fresh parsley, divided ADVERTISEMENT",
            "1 teaspoon lemon juice (optional) ADVERTISEMENT",
            "1/4 teaspoon coarsely ground pepper ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (12 ounce) bottle Crosse & Blackwell® Zesty Shrimp Sauce ADVERTISEMENT",
            "1 cup shredded Mexican cheese blend ADVERTISEMENT",
            "3/4 cup finely chopped red bell pepper ADVERTISEMENT",
            "2 green onions, finely chopped ADVERTISEMENT",
            "Assorted crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Press shrimp between layers of paper towels to remove excess moisture. Repeat if necessary. Combine shrimp, 1 tablespoon parsley, lemon juice, if desired, and pepper in medium bowl; mix well.\nSpread cream cheese in bottom of a 9-inch tart or pie plate or spread into a 9-inch circle on large rimmed serving platter.\nTop evenly with shrimp mixture and shrimp sauce. Sprinkle evenly with cheese, red pepper, green onions and remaining 1 tablespoon parsley. Cover and chill until ready to serve. Serve with assorted crackers.\n",
        "picture_link": "FBMbKffnmK0MUVbdM9ORax44yiyoRKC"
    },
    {
        "title": "Bison Pepperoni Macaroni",
        "ingredients": [
            "2 cups dried elbow macaroni ADVERTISEMENT",
            "1/2 cup chopped green pepper or frozen peas ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/3 cup finely chopped onion ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt or to taste ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 1/2 cups shredded American and Cheddar cheese blend ADVERTISEMENT",
            "1 cup shredded part-skim mozzarella cheese ADVERTISEMENT",
            "4 ounces bison sausage with pepperoni seasoning, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook macaroni according to package directions, adding green pepper or peas during the last 3 minutes of cooking; drain. Cover and keep warm.\nMeanwhile, for sauce, melt butter over medium heat in a large skillet. Cook onion in hot butter for 4 to 5 minutes or until onion is tender. Stir in flour, salt, and black pepper. Add milk all at once. Whisk constantly until thick and bubbly. Cook, whisking constantly, for 2 more minutes. Reduce heat to low.\nAdd American & cheddar cheese blend and mozzarella cheese, stirring until sauce is smooth and cheese is melted. Stir the sauce and bison pepperoni into the pasta. Heat through.\n",
        "picture_link": "i2CLCD0gMERxMM8Ow6zXyUzSmQiMTnS"
    },
    {
        "title": "Autumn Harvest Relish",
        "ingredients": [
            "8 cups peeled and chopped apples ADVERTISEMENT",
            "2 1/2 cups cane sugar ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 (12 ounce) package fresh cranberries ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup chopped crystallized ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine apples, sugar, water, cranberries, and vinegar in a large saucepan; bring to a boil. Reduce heat and simmer until cranberries begin to break down, about 20 minutes. Stir walnuts, ginger, and nutmeg into apple mixture; cook until apples are tender and flavors of relish have blended, 10 to 15 more minutes. Pour relish into jars and cool to room temperature before covering with lids. Refrigerate.\n",
        "picture_link": "DjCKU6wtB5YLkkrbHuX.TiJPmRJ8j5y"
    },
    {
        "title": "CJ's Epic Strawberry Banana Smoovie",
        "ingredients": [
            "2 cups ice ADVERTISEMENT",
            "3 frozen bananas, cut into small chunks ADVERTISEMENT",
            "1 cup skim milk ADVERTISEMENT",
            "1/4 cup white sugar, or to taste ADVERTISEMENT",
            "6 fresh strawberries, sliced ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "2 tablespoons whipped dairy topping, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put ice in a blender; add bananas, milk, sugar, strawberries, and vanilla extract. Blend until smooth. Top with whipped topping; blend again until smooth.\n",
        "picture_link": "8yKr0HrZBmwR0uXQA1hA3vYfi1F9Xma"
    },
    {
        "title": "Cranberry Fluff",
        "ingredients": [
            "3 cups miniature marshmallows ADVERTISEMENT",
            "2 cups ground cranberries ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 cups diced apple ADVERTISEMENT",
            "1/2 cup seedless grapes, halved ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir marshmallows, cranberries, and sugar together in a saucepan over low heat; cook and stir until the marshmallows melt completely, about 15 minutes. Transfer marshmallow mixture to a bowl and refrigerate 4 hours to overnight.\nStir apples, grapes, walnuts, and salt into the marshmallow mixture.\nBeat whipping cream in a chilled bowl using an electric mixer until stiff peaks form; fold into the marshmallow mixture.\n",
        "picture_link": "psl7ceqlZmKq70jEHt2hm.EQUihcG5O"
    },
    {
        "title": "Orange Cinnamon Smoothie",
        "ingredients": [
            "6 cups orange juice ADVERTISEMENT",
            "3 cups vanilla yogurt ADVERTISEMENT",
            "3 large navel oranges, peeled and cut into 1-inch chunks ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend orange juice, yogurt, oranges, and cinnamon together in a blender until smooth.\n",
        "picture_link": "X7OgIazKkyslWM/iwmV9SuwSvbMmegi"
    },
    {
        "title": "Butternut Squash and Apple Cider Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 butternut squash - peeled, seeded, and cut into large chunks ADVERTISEMENT",
            "2 white potatoes, peeled and chopped ADVERTISEMENT",
            "1 apple, peeled and chopped ADVERTISEMENT",
            "1 large carrot, peeled and diced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "1/2 gallon apple cider ADVERTISEMENT",
            "3/4 cup half-and-half cream ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/2 cup sour cream, or as needed ADVERTISEMENT",
            "1 pinch ground nutmeg, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a large pot over medium heat; cook and stir onion in the melted butter until translucent, 5 to 10 minutes. Add butternut squash, potatoes, apple, carrot, and celery to onion; pour in chicken broth and enough apple cider to cover vegetables. Bring mixture to a boil and cover pot. Reduce heat and simmer, adding more apple cider as needed, until vegetables are tender, 35 to 40 minutes.\nBlend vegetable mixture with an immersion blender until smooth; stir in cream, cinnamon, and cloves. Simmer until heated through, 5 to 10 minutes. Spoon soup into serving bowls; top each with about 1 tablespoon sour cream and a pinch of nutmeg.\n",
        "picture_link": "btAZN7GNPWuluuwOCa2oDANd4qotStG"
    },
    {
        "title": "Re:Bar Re:Vive Shake",
        "ingredients": [
            "1 (6 ounce) tub vanilla-flavored yogurt (such as Yoplait®) ADVERTISEMENT",
            "6 frozen peach slices ADVERTISEMENT",
            "3 fluid ounces orange juice ADVERTISEMENT",
            "6 tablespoons slivered almonds ADVERTISEMENT",
            "6 tablespoons granola ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend yogurt, peach slices, orange juice, almonds, and granola in a blender until smooth.\n",
        "picture_link": "trqTykv9JNvNXFg2ZK2axT2mrxxGVrW"
    },
    {
        "title": "Five Spice Chicken",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon dry sherry ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "2 teaspoons Chinese five-spice powder ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken breast, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk soy sauce, olive oil, sherry, orange juice, garlic, ginger, and Chinese five-spice powder together in a bowl; pour into a resealable plastic bag. Add chicken, coat with the marinade, squeeze bag to remove excess air, and seal the bag. Marinate in the refrigerator at least 1 hour.\nPreheat grill for medium heat and lightly oil the grate.\nRemove chicken slices from the marinade; shake to remove excess moisture. Discard remaining marinade.\nGrill chicken until no longer pink in the center and the juices run clear, about 3 minutes per side.\n",
        "picture_link": "QsCTXI9FjiGRwpJI9D.JDZl0jBtv/SS"
    },
    {
        "title": "Vanilla Almond Cocoroons",
        "ingredients": [
            "1 1/2 cups unsweetened coconut ADVERTISEMENT",
            "3/4 cup almond flour ADVERTISEMENT",
            "9 tablespoons maple syrup ADVERTISEMENT",
            "4 1/2 tablespoons coconut oil ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C). Line a baking sheet with parchment paper.\nPut coconut, almond flour, maple syrup, coconut oil, vanilla extract, almond extract, and sea salt in a food processor or blender; pulse, scraping down sides as needed, until thoroughly combined but not liquefied. Scoop mixture using a cookie scoop or spoon and form into mounds on the prepared baking sheet.\nBake in the preheated oven for 20 minutes. Turn off heat, keeping cookies in the oven until it is completely cooled and cookies are dried out, 8 hours to overnight.\n",
        "picture_link": "k8AFrzgz0o1HAGKYe8KTh5L7QR14Lgy"
    },
    {
        "title": "4th of July Pulled Pork",
        "ingredients": [
            "1 (8 pound) pork butt, trimmed ADVERTISEMENT",
            "18 cloves garlic ADVERTISEMENT",
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "4 teaspoons Creole seasoning (such as Tony Chachere's®) ADVERTISEMENT",
            "2 teaspoons dark brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons smoked paprika ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon dry mustard ADVERTISEMENT",
            "1/8 teaspoon ground cumin ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut rows of deep slits into both sides of pork butt using a sharp knife; insert a garlic clove into each slit. Rub vegetable oil over pork butt.\nMix Creole seasoning, brown sugar, white sugar, paprika, garlic powder, black pepper, mustard, cumin, and ginger together in a bowl; coat pork butt with spice mixture. Wrap coated pork butt with aluminum foil and refrigerate for 8 hours to overnight.\nHeat an infrared turkey fryer or a large skillet over medium-high heat; remove aluminum foil from pork butt. Sear all sides of pork butt in the fryer or hot skillet until an internal temperature of 145 degrees F (63 degrees C) is reached, 1 to 1 1/2 hours.\nWrap the seared pork butt tightly in aluminum foil.\nPreheat the roaster or oven to 265 degrees F (130 degrees C).\nPlace wrapped pork butt in the preheated roaster or oven until pork is easily shredded, 3 to 4 hours. Remove pork butt from aluminum foil and pull meat apart.\n",
        "picture_link": "4sIlas/Tasb7xBp3.yPaLrPgvDYkM1G"
    },
    {
        "title": "Rum-beer Float",
        "ingredients": [
            "1 (12 fluid ounce) can or bottle root beer ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger spiced rum ADVERTISEMENT",
            "2 scoops vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour root beer into a mug; stir in rum. Spoon ice cream into root beer mixture; let ice cream melt slightly into the liquid, about 5 minutes.\n",
        "picture_link": "oHC6R72XrutNNuySim7PtDeiFuwHJbq"
    },
    {
        "title": "Garlic Cheese Quinoa",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 1/2 cups quinoa ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "3/4 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "3/4 cup cubed processed cheese food (such as Velveeta®) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup panko bread crumbs, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water, quinoa, garlic, and onion powder to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, about 15 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Prepare a 9x13-inch baking dish with cooking spray.\nWhisk milk and eggs together in a large bowl. Stir Cheddar cheese and processed cheese food into quinoa mixture until cheeses begin to melt; season with salt and black pepper. Mix quinoa mixture into milk mixture. Transfer quinoa-milk mixture to the prepared baking dish; top with panko bread crumbs.\nBake in the preheated oven until topping is lightly browned, 30 to 35 minutes.\n",
        "picture_link": "EqfFNaGj3sFnzARITINwHg45gUFhV52"
    },
    {
        "title": "Hot Vidalia® Onion Dip",
        "ingredients": [
            "1 large sweet onion (such as Vidalia®), finely chopped ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nStir onion, mayonnaise, Cheddar cheese, and sugar together in a pie plate.\nBake in preheated oven until bubbly and brown around the edges, 25 to 30 minutes.\n",
        "picture_link": "rcD0TZrEWEeZxDPQnMVXHEPTe00sRyG"
    },
    {
        "title": "Pumpkin Spritz Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup canned pumpkin ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBeat butter and sugar with an electric mixer in a large bowl until smooth and creamy, about 2 minutes. Mix in canned pumpkin, egg, cinnamon, vanilla, nutmeg, pumpkin pie spice, and ground ginger until well combined.\nStir flour and baking powder together in a small bowl. Add flour mixture to pumpkin mixture in thirds, mixing dough well between each addition.\nSpoon cookie dough into a cookie press fitted with a pumpkin-shaped die and press dough onto a baking sheet.\nBake in preheated oven until edges just begin to brown, about 8 minutes. Cool cookies on baking sheet for 5 minutes before transferring to a wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Golden Egg Loaves (or Braids)",
        "ingredients": [
            "1 1/2 cups warm water (110 to 115 degrees F/43 to 46 degrees C) ADVERTISEMENT",
            "6 tablespoons honey ADVERTISEMENT",
            "1 1/2 tablespoons active dry yeast ADVERTISEMENT",
            "6 cups bread flour, divided, or more as needed ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3 tablespoons vital wheat gluten ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, honey, and yeast in a stand mixer fitted with the dough hook. Let sit until mixture becomes foamy, about 10 minutes.\nPour 3 cups flour, olive oil, eggs, wheat gluten, and butter into the yeast mixture; mix on speed 2 (or low speed) in the stand mixer until flour mixture is incorporated, 2 to 3 minutes. Add salt and 3 cups flour and mix on speed 2 until flour is incorporated into the dough. If dough is pulling away from the sides of the bowl, continue mixing, 5 to 7 minutes. If dough is still sticky, add 1/4 cup flour at a time and knead for 2 minutes after each addition until dough pulls away from the sides of the bowl; mix for 5 to 7 minutes.\nGrease a large bowl.\nTransfer dough to greased bowl and cover with a damp towel. Set aside in a warm area of the kitchen until dough has doubled in size, 60 to 90 minutes.\nPunch down dough and divide into 2 loaves. Place each dough half into a 9x5-inch loaf pan or on a baking sheet. Let rise until doubled in size, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until golden brown and an instant-read thermometer registers an internal temperature of 200 degrees F (93 degrees C), 25 to 30 minutes.\n",
        "picture_link": "9TmmDfsxjTlCXzPH.YnaJVnkYfuEjh."
    },
    {
        "title": "Vanilla Raspberry Trifle",
        "ingredients": [
            "2 (3 ounce) packages ladyfingers ADVERTISEMENT",
            "1/2 cup rum, or to taste ADVERTISEMENT",
            "1 pint raspberries ADVERTISEMENT",
            "4 cups cold milk ADVERTISEMENT",
            "2 (3.5 ounce) packages instant vanilla pudding mix ADVERTISEMENT",
            "1 orange, zested ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "1 (2.25 ounce) package slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line the bottom of a deep glass dish with 1/2 the ladyfingers. Pour 1/2 the rum over ladyfingers; top with 1/2 the raspberries.\nBeat cold milk, pudding mix, and orange zest together in a bowl using an electric mixer until smooth, about 2 minutes. Spoon 1/2 the pudding over raspberry layer. Arrange the remaining lady fingers atop pudding layer and around sides of bowl. Pour remaining rum over ladyfingers; top with remaining raspberries and pudding. Refrigerate trifle for flavors to set, about 1 hour.\nBeat heavy cream in a bowl using an electric mixer on medium-low speed until fluffy. Spoon whipped cream over trifle and sprinkle with almonds.\n",
        "picture_link": "dL9CEG0OFA/EIBzY2Z33VRe.mgg5yym"
    },
    {
        "title": "Tzatziki Sauce with Dill",
        "ingredients": [
            "cheesecloth ADVERTISEMENT",
            "1 (16 ounce) container plain yogurt ADVERTISEMENT",
            "1 cucumber - peeled, seeded, and grated ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh dill ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a colander with two layers of cheesecloth and place over a bowl. Scoop yogurt onto the cheesecloth and cover the colander with plastic wrap. Put in refrigerator to drain, 8 hours to overnight.\nPlace grated cucumber in a fine mesh strainer over a bowl; drain until most of the water is released, 1 to 2 hours.\nStir the drained yogurt, drained cucumber, garlic, lemon juice, parsley, and dill together in a bowl; season with salt and pepper. Cover bowl with plastic wrap and refrigerate at least 2 hours before serving.\n",
        "picture_link": "X343VYOGxska7ujVdgHyp9KMK089Pxu"
    },
    {
        "title": "Cheesy BBQ Bread",
        "ingredients": [
            "3/4 pound butter ADVERTISEMENT",
            "1 large onion, minced ADVERTISEMENT",
            "2 tablespoons poppy seeds, or to taste ADVERTISEMENT",
            "1 (1 pound) loaf sourdough French bread ADVERTISEMENT",
            "1 pound white American cheese, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt butter in a small saucepan over medium-low heat; cook and stir onion in the melted butter until translucent, 5 to 10 minutes. Stir poppy seeds into onion mixture.\nCut bread into slices, leaving them still attached on the bottom of the loaf. Put an American cheese slice into each slit; spoon poppy seed mixture into each slit. Wrap loaf with aluminum foil.\nBake in the preheated oven until cheese is melted, about 30 minutes.\n",
        "picture_link": "v2Q3n5z0TDHIFk4dV0Nuotk0jgroU6W"
    },
    {
        "title": "Dave's Spicy Hominy",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "1/4 white onion, chopped ADVERTISEMENT",
            "2 (14 ounce) cans hominy, drained ADVERTISEMENT",
            "3 fresh jalapeno peppers, chopped ADVERTISEMENT",
            "3 cloves garlic, pressed ADVERTISEMENT",
            "2 pinches red pepper flakes ADVERTISEMENT",
            "2 pinches ground white pepper ADVERTISEMENT",
            "2 pinches ground black pepper ADVERTISEMENT",
            "2 tomatoes, cut into 8 wedges each ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels, reserving bacon grease in the skillet. Crumble bacon.\nCook and stir onion in reserved bacon grease over medium heat until caramelized, about 15 minutes. Stir hominy, jalapenos, and garlic into onion. Season with red pepper flakes, white pepper, and black pepper. Continue to cook and stir until flavors are combined, 7 to 10 minutes.\nStir bacon and tomatoes into onion mixture; cook and stir until tomatoes are heated through, about 5 minutes.\n",
        "picture_link": "LK5Jx4wRIrO.m6u/lkkqgWpVvzK6P/e"
    },
    {
        "title": "Breakfast Sweet Tooth",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend milk, egg, sugar, cinnamon, and vanilla extract in a blender until smooth.\n",
        "picture_link": "Iw00oabiMTxztJiG6a7wj3alxAN6Yt2"
    },
    {
        "title": "Big Moe's Pork Burgers",
        "ingredients": [
            "3 (1 pound) packages Farmland® Fresh Ground Pork ADVERTISEMENT",
            "1 small sweet onion, chopped ADVERTISEMENT",
            "3/4 cup feta cheese crumbles ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup hot sauce ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "Fresh cracked black pepper ADVERTISEMENT",
            "Coarse sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat charcoal or gas grill to medium. Combine ground pork, onion, cheeses, Worcestershire sauce, hot sauce and garlic in large bowl; mix well with hands. Shape into 1-inch thick patties (9 to 12); sprinkle pepper and salt on both sides.\nIf a smokier flavor is wanted, add a small handful of pecan or oak wood chips to fire about 10 minutes before putting patties on.\nGrill burgers approximately 15 minutes until internal temperature reaches 165 degrees F, turning every 5 minutes.\n",
        "picture_link": "n4syD5/BP.Hxw0YopAiPAG6P1/qLIlO"
    },
    {
        "title": "Super-Easy Sausage and Peppers",
        "ingredients": [
            "7 sweet Italian sausages, or more to taste, removed from the casings and cut into bite-size pieces ADVERTISEMENT",
            "1 tablespoon olive oil, or more to taste ADVERTISEMENT",
            "1 large sweet onion, halved and sliced ADVERTISEMENT",
            "2 (14.5 ounce) cans tomato sauce ADVERTISEMENT",
            "3 green bell peppers, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spread sausage pieces into a baking dish.\nBake sausage in preheated oven until heated through, about 20 minutes.\nHeat olive oil in a large skillet over medium-high heat. Saute onion in oil until translucent, 5 to 7 minutes.\nStir sausage with the onion. Pour tomato sauce over the sausage mixture; bring to a simmer and cook for 20 minutes.\nStir bell pepper into the mixture to coat in tomato sauce; cook until the bell pepper is tender, about 20 minutes more.\n",
        "picture_link": "Mus7Bw5aVa6R/4O/UNEH9OezH87bp7i"
    },
    {
        "title": "Paul Newman Crab Salad",
        "ingredients": [
            "1 (12 ounce) package rotini pasta ADVERTISEMENT",
            "1 cup frozen petite peas, or more to taste ADVERTISEMENT",
            "1 (8 ounce) package imitation crabmeat, flaked ADVERTISEMENT",
            "2/3 cup shredded Swiss cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, or more to taste ADVERTISEMENT",
            "2/3 (8 ounce) bottle bottled oil and vinegar salad dressing (such as Newman's Own®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook rotini at a boil until tender yet firm to the bite, about 8 minutes.\nPut frozen peas into a large colander. Drain rotini over the peas. Fill the now-empty pot with cold water. Plunge pasta and peas into the cold water to chill completely; drain.\nMix imitation crabmeat, Swiss cheese, and parmesan cheese in a large bowl; add pasta mixture and toss to mix. Pour dressing over the salad and toss to lightly coat.\n",
        "picture_link": "xcrOEH3Ojhs0ppQIg4dgn4o6fkrwfnK"
    },
    {
        "title": "Matcha Frappe",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon matcha green tea powder, or more to taste ADVERTISEMENT",
            "2 ice cubes, or as needed ADVERTISEMENT",
            "1 tablespoon vanilla-flavored syrup (such as Torani®) ADVERTISEMENT",
            "1 tablespoon whipped cream, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk, matcha green tea powder, ice, and vanilla syrup, respectively in a blender; blend to desired consistency. Serve with whipped cream on top.\n",
        "picture_link": "qOjataFDtiL9pUalI4LDtcVGMPw6JLe"
    },
    {
        "title": "Whole30® Baked Eggs in Marinara Sauce",
        "ingredients": [
            "1 cup water, plus more as needed ADVERTISEMENT",
            "1 cup marinara sauce ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat water in a kettle or pot until it begins to steam; remove from heat. Pour 1 cup steaming water into the bottom of a casserole dish.\nSpoon 1/4 cup marinara sauce into each ramekin. Crack 1 egg over marinara in each ramekin. Arrange ramekins in the water in the casserole dish. Fill casserole dish with enough water to reach the midpoint of each ramekin.\nBake in the preheated oven until yolks are firm, about 25 minutes.\n",
        "picture_link": "ykDV3/VIczCJudJGy7fSTnsEerIgOl."
    },
    {
        "title": "Blueberry Summer Squash Bread",
        "ingredients": [
            "1 1/2 cups grated yellow squash ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup blueberry syrup (such as Stonewall Kitchen® Wild Maine) ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup blueberries ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch bread pan.\nWhisk squash, honey, blueberry syrup, oil, egg, and vanilla extract together in a bowl. Mix all-purpose flour, whole wheat flour, baking soda, baking powder, and salt together in a separate bowl; add blueberries and walnuts. Stir flour mixture into squash mixture just until combined; pour into prepared bread pan.\nBake in the preheated oven until the top is brown and a toothpick inserted in the center comes out clean, about 1 hour.\n",
        "picture_link": "ga/Q0.V0cVCMZKIFPF3ZNjZe2o28N2S"
    },
    {
        "title": "Dairy-Free Vanilla Brownies",
        "ingredients": [
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 cup barley flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a small baking dish.\nBeat eggs, vegetable oil, and vanilla extract together in a large bowl. Mix barley flour, sugar, baking powder, and salt together in a separate bowl; add to eggs mixture and stir to make a smooth batter. Pour batter into prepared baking dish.\nBake in preheated oven until brown on top and set in the center, 20 to 30 minutes.\n",
        "picture_link": "YKZu26aH2wLPFPzEa.G7vPrEY0dEANC"
    },
    {
        "title": "Sweet and Spicy Barbecue Meatballs",
        "ingredients": [
            "Meatballs: ADVERTISEMENT",
            "2 1/2 pounds ground chuck beef ADVERTISEMENT",
            "2 pounds ground pork ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "2 teaspoons steak seasoning ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 (32 ounce) container barbecue sauce ADVERTISEMENT",
            "1 (32 ounce) jar grape jelly ADVERTISEMENT",
            "Hot sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F and line 4 baking sheets with Reynolds(R) NonStick Aluminum Foil (dull side up).\nCombine the meat with all other meatball ingredients and form into about 80 bite-size meatballs. Place 20 meatballs on each pan, and bake for 35 minutes or until browned all the way through.\nWhile the meatballs are baking, pour the barbecue sauce and the grape jelly into a sauce pan and heat over medium until they are well combined. If you want your meatballs to have a little extra kick, add some hot sauce to the mix. Once the meatballs are finished, you can slide them right off the pan and into your serving dish. Pour your sauce on top and serve immediately. The finished dish does well in the microwave if you are taking it to a party and need to reheat it.\n",
        "picture_link": "h02RkQZAED7L1Uwbk.o1KOg6JZJpIuu"
    },
    {
        "title": "Honey Walnut Cream Cheese",
        "ingredients": [
            "10 walnut halves ADVERTISEMENT",
            "1 (8 ounce) package cream cheese (such as Philadelphia®), softened ADVERTISEMENT",
            "1/4 cup orange blossom honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace walnuts on a baking sheet. Bake until toasted and fragrant, about 10 minutes. Transfer walnuts to a plate to cool. When walnuts are cool, transfer to a resealable plastic bag and crush with a rolling pin.\nCombine cream cheese, honey, and walnuts in a food processor and pulse until creamy.\n",
        "picture_link": "2q/mxky1PHT/0p/V7jBgbUmqjs509G6"
    },
    {
        "title": "Sweet & Spicy Asian Style BBQ Back Ribs",
        "ingredients": [
            "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed ADVERTISEMENT",
            "Rub: ADVERTISEMENT",
            "1/4 cup packed light brown sugar ADVERTISEMENT",
            "3 tablespoons fine sea salt ADVERTISEMENT",
            "4 1/2 teaspoons onion powder ADVERTISEMENT",
            "4 1/2 teaspoons chili powder ADVERTISEMENT",
            "4 1/2 teaspoons paprika ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "3/4 cup clover honey ADVERTISEMENT",
            "1/2 cup reduced-sodium soy sauce ADVERTISEMENT",
            "2 tablespoons red plum jam ADVERTISEMENT",
            "1 tablespoon apple cider vinegar ADVERTISEMENT",
            "1 tablespoon chili garlic sauce* ADVERTISEMENT",
            "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional) ADVERTISEMENT",
            "3/4 cup tamarind juice, in a spray bottle* ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "About one hour before you plan to start grilling, make the rub: In a small bowl, combine the brown sugar, salt, onion powder, chili powder, paprika and pepper. Pat the ribs dry with paper towels, then sprinkle both sides of each rack with the rub. Set aside at room temperature for one hour.\nPreheat the grill for indirect cooking at 250 to 300 degrees F. Add the drained wood chips, if using.\nPlace the ribs, meaty side up, over a drip pan, close the grill, and cook for 2 hours, adding about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nMeanwhile, make the sauce: In a medium saucepan over medium heat, combine the honey, soy sauce, jam, vinegar and garlic sauce and bring to a boil. Reduce to a simmer and cook 15 minutes, stirring frequently, until lightly thickened. Set aside to cool to room temperature, then refrigerate.\nContinue to cook the ribs until they're so tender the rack will easily break when bent with tongs, 1 to 2 more hours, spraying on both sides with the tamarind juice every 20 to 30 minutes. Brush the ribs on both sides with the sauce and continue to cook for about 5 minutes, until the sauce is set. Remove from the grill and let stand for 5 minutes.\nCut the racks into 3- or 4-rib sections and serve. Pass any remaining sauce at the table.\n",
        "picture_link": "RyDf9ffKJzyxHSXA1T7av908t/NKnU6"
    },
    {
        "title": "Kids' Favorite Cauliflower",
        "ingredients": [
            "1 head cauliflower, cut into bite-size pieces ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 (12 ounce) box vanilla wafer cookies (such as Nilla®), crushed very fine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cut cauliflower in a large saucepan and cover with water. Bring to a boil and cook until just fork tender, about 10 minutes; drain and transfer to a bowl.\nMelt butter in a saucepan over low heat; add cooked cauliflower and vanilla wafer crumbs and stir until evenly coated.\n",
        "picture_link": "B.VdxsL4S/yD7hrH77/91XJhHq1tI42"
    },
    {
        "title": "Spicy Smoked Back Ribs with Maple Glaze",
        "ingredients": [
            "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed ADVERTISEMENT",
            "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional) ADVERTISEMENT",
            "1 cup apple juice, in a spray bottle ADVERTISEMENT",
            "Rub: ADVERTISEMENT",
            "1/3 cup kosher salt ADVERTISEMENT",
            "1/4 cup light brown sugar ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon chipotle chile powder ADVERTISEMENT",
            "1 teaspoon fresh cracked black pepper ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "3 cups ketchup ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "3/4 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "2 teaspoons smoked paprika ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon chipotle chile powder ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "1/4 cup light brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "About 30 minutes before smoking, make the dry rub. Combine all rub ingredients in small bowl; mix well. Generously coat both sides of ribs with rub. Set aside at room temperature for 30 minutes.\nMeanwhile, make the sauce. Whisk together all ingredients in large saucepan; bring to a boil over medium-high heat. Reduce heat and simmer 20 minutes until thickened, stirring occasionally.\nHeat charcoal or gas grill for indirect cooking at 275 degrees F. Add drained wood chips, if using.\nPlace the ribs, meaty side up, over a drip pan and cook for 2 hours, spraying with apple juice every 30 minutes. Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nRemove ribs from grill. Place each rack on double stack of large aluminum foil. Drizzle maple syrup and butter on each rack; sprinkle with brown sugar and spray with apple juice; wrap each rack tightly with foil.\nReturn wrapped ribs to the grill and cook for 1 1/2 to 2 hours more over indirect heat, until very tender. Add more coals as needed to maintain temperature for a charcoal grill.\nRemove ribs from grill and unwrap. Place ribs over direct heat on grill and brush with barbecue sauce. Cook for about 5 minutes, until the sauce is set. Turn ribs and repeat with more sauce.\nServe ribs with remaining barbecue sauce.\n",
        "picture_link": "9oJVKf14GGJvI.vUX/RxmJCTtdPBYMO"
    },
    {
        "title": "Purple Fiddle Hummus",
        "ingredients": [
            "1 (15 ounce) can garbanzo beans, drained and 1/4 cup liquid reserved ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon extra-virgin olive oil, or to taste ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse garbanzo beans, cilantro, and onion in a blender or food processor until roughly chopped; stir. Add garlic, cumin, cayenne pepper, and sea salt; pulse, adding reserved garbanzo liquid until desired thickness is reached. Pour olive oil and lemon juice into hummus and stir.\n",
        "picture_link": "lrD79pG9TcrIpYFfAqujsgZTRj2u0Ga"
    },
    {
        "title": "Michelle's Hot Chicken Salad",
        "ingredients": [
            "2 cups cubed cooked chicken ADVERTISEMENT",
            "1 cup diced celery ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup toasted slivered almonds ADVERTISEMENT",
            "4 slices cooked bacon, crumbled ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon sliced green onion ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2/3 cup crushed potato chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix chicken, celery, Cheddar cheese, mayonnaise, almonds, bacon, lemon juice, green onion, salt, and black pepper together in a 1 1/2-quart baking dish; top with potato chips.\nBake in the preheated oven until cooked through and bubbling, about 20 minutes.\n",
        "picture_link": "CwBIvgCGhlNzB3J.fKJYwLij50tebES"
    },
    {
        "title": "Rustic Fall Fruit Tart",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, chilled ADVERTISEMENT",
            "1/2 cup cream cheese ADVERTISEMENT",
            "1 tablespoon water, or as needed ADVERTISEMENT",
            "4 apples - peeled, cored, and thinly sliced ADVERTISEMENT",
            "2/3 cup fresh cranberries ADVERTISEMENT",
            "1/4 cup brown sugar, or more to taste ADVERTISEMENT",
            "1/4 cup white sugar, or more to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1/3 cup roughly chopped walnuts, or more to taste ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon raw sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 2 cups flour in a bowl. Cut butter and cream cheese into flour using a knife or pastry blender until mixture resembles coarse crumbs. Gently mix water into flour mixture until dough forms into a ball.\nMix apples and cranberries with brown sugar, white sugar, 2 tablespoons flour, cinnamon, and nutmeg in a bowl until coated.\nPreheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet.\nRoll dough onto a lightly floured work surface, forming about an 11-inch circle. Transfer dough to the prepared baking sheet. Arrange apple-cranberry mixture decoratively on the dough, leaving a 2-inch rim of exposed dough. Sprinkle walnuts over apple-cranberry mixture. Fold exposed crust up and over the edge of the fruit.\nBrush egg over the crust and around the edge of the tart; sprinkle with raw sugar.\nBake in the preheated oven until crust is browned and filling is tender, 30 to 35 minutes.\n",
        "picture_link": "728o4XT/z20Osp5wnyqizwCYjugbtRa"
    }
]