[
    {
        "title": "Poppy Seed Rolls",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 cup warm milk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 pound poppy seeds ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1 cup finely chopped walnuts ADVERTISEMENT",
            "1 1/2 cups raisins ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the poppy seeds in a bowl and cover with boiling water. Let soak for 1 hour.\nStir together milk, sugar, shortening, and salt. Stir until shortening melts. Cool mixture to lukewarm. Mix yeast with 2 cups flour; mix into milk mixture. Stir in eggs. Work in enough of the remaining flour to make a moderately stiff dough. Turn dough out onto a lightly floured surface, and knead until smooth. Place in a well oiled bowl, and turn to coat the surface. Cover, and let rise until doubled in size.\nDrain poppy seeds well, and put through the finest blade of a grinder 3 times. Cream butter or margarine and honey. Add cream, and stir in poppy seeds, nuts, raisins and grated peel. Add more cream if necessary to spread thinly over dough.\nDeflate dough, and divide in half. Roll each half to a 12 x 8 inch rectangle. Spread with poppy seed filling. Roll up, jelly-roll fashion, from long edge. Slice each into 12 pieces, and place cut side down in greased 9 inch round cake pans. Let rise until doubled in bulk.\nBake at 375 degrees F (190 degrees C) for 18 to 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Seminole Pumpkin Bread",
        "ingredients": [
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook, peel and mash the sugar pumpkin.\nSift flour, baking powder and baking soda together. Gradually add pumpkin, sugar and water to make a soft dough.\nWhen it just holds together, knead several minutes. Divide dough into 4 - 6 equal parts. Knead each portion again several minutes or until it becomes a soft, smooth ball. Roll out each portion 1/4 inch thick. Another method is to pinch off small pieces of dough and form into individual cakes 2 - 3 inch across.\nIn a large iron skillet, fry in very hot vegetable oil (about 1inch in depth) until brown on one side. Flip over and brown other side. The bread will puff up and get crisp and chewy. Sprinkle with granulated sugar.\n",
        "picture_link": "UMTRQhDqcn6T4CQeyDPOVTdUpgxe.vS"
    },
    {
        "title": "Ruby's Special Cornbread",
        "ingredients": [
            "1 cup cornmeal ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 (8.75 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (4 ounce) jar diced pimento peppers, drained ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons chopped jalapeno peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the cornmeal, milk, oil, eggs, chopped green bell pepper, chopped onion, garlic powder, salt, baking soda, sugar, drained corn kernels, pimentos and jalapeno peppers. Mix until combined, and pour into a well greased 10 to 14 inch cast iron skillet.\nBake for 45 minutes.\n",
        "picture_link": "fEYMAj0H/SFPXrFWHY7pBuYAMOLU9OK"
    },
    {
        "title": "Ron's Fruit Bread",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons dry milk powder ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground mace ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup candied mixed fruit peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in order suggested by your manufacturer.\nSelect sweet bread setting. Add the raisins and mixed peel when the machine beeps, or 5 minutes before kneading is complete.\n",
        "picture_link": "Ccn1ig0eplRDtJWj5YMxOK1jjOyULqe"
    },
    {
        "title": "Paris-Brest",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 tablespoons unsalted butter, softened ADVERTISEMENT",
            "1/4 cup sliced almonds ADVERTISEMENT",
            "2 1/2 cups pastry cream ADVERTISEMENT",
            "1 cup heavy cream, chilled ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place a small pan containing about 2-3 cups of hot water onto the bottom of your oven ( directly onto the bottom of the oven) to generate steam. Lightly grease a large baking sheet with shortening and then dust lightly with flour. Use a 10 inch pan as a template and draw a 10 inch circle onto the flour dusted sheet using a toothpick. Set aside.\nPlace the 4 eggs into a small measuring cup and mix with a fork to combine, set aside.\nCombine the milk, water, salt and butter in a saucepan over medium heat. When it comes to a full boil, add the flour all at once and stir to make a paste. Continue to stir over the heat for about 40 seconds until the paste dries a little. Remove from heat and place paste into a mixing bowl. Let cool about 4 minutes.\nWith a mixer on low, mix the paste and slowly add the beaten eggs. Mix slowly but thoroughly until all of the eggs have been added. Place the paste into a pastry bag fitted with a 1/2 inch round decorating tip. Pipe the paste out onto the sheet pan following the 10 inch ring you outlined. Pipe a second ring around the inside next to this ring. Finally, pipe another ring on top of these two rings. Lightly paint the set of rings with the remaining 1 beaten egg and press the sliced almonds into the paste.\nPlace in the oven on the lowest shelf and bake at 425 degrees F (220 degrees C) for 20 minutes. Reduce the temperature to 375 degrees F (190 degrees C) and bake about 12 minutes more or until brown. Remove form the oven and using a long serrated knife slice off the top half of the puffed ring. Remove any bits of raw dough on the inside of the ring. Replace the top and place back in the oven to crisp the dough, about 5 more minutes. Cool on a rack.\nTo Make The Filling: Whip the pastry cream until smooth. Place the heavy cream into a bowl along with the vanilla and beat on high until soft peaks are formed. Add in the confectioners' sugar and beat a little more. Fold the pastry cream in with the whipped cream and transfer to a piping bag fitted with a star tip. Pipe the cream mixture into the ring and then replace the top. If you wish, sprinkle with additional powdered sugar.\n",
        "picture_link": "9MghJ1AQWq9rGblEyrO2ai9DKCnAzi."
    },
    {
        "title": "Thai Chicken Spaghetti",
        "ingredients": [
            "1 (8 ounce) package thin spaghetti, broken in half ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 1/2 pounds chicken tenders, cut into bite-size pieces ADVERTISEMENT",
            "4 stalks celery, sliced ADVERTISEMENT",
            "2 red bell peppers, sliced ADVERTISEMENT",
            "1 red onion, sliced ADVERTISEMENT",
            "2/3 cup shredded carrots ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon sesame oil ADVERTISEMENT",
            "3/4 cup unsalted peanuts ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, 4 to 5 minutes. Drain.\nHeat oil in a large non-stick pan or wok over medium heat; cook and stir chicken until no longer pink in the center, about 5 minutes. Add celery, red bell peppers, red onion, and carrots; cook and stir until vegetables are slightly tender, about 5 minutes.\nMix chicken broth, soy sauce, cornstarch, garlic powder, and sesame oil in a small saucepan; bring to a boil. Reduce heat and simmer until desired thickness of sauce is reached, 5 to 10 minutes.\nStir peanuts, garlic, and red pepper flakes into chicken-vegetables mixture; cook for 2 minutes more. Pour sauce over chicken-vegetable mixture; add spaghetti and toss to coat.\n",
        "picture_link": "XVpcKiQ0piiQa.yoJXbEHOxjIftNxMG"
    },
    {
        "title": "Shrimp and Corn Chowder",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 leeks (white and pale green parts only), chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3 cups half-and-half ADVERTISEMENT",
            "1 pound potatoes, peeled and chopped ADVERTISEMENT",
            "1 (8 ounce) bottle clam juice ADVERTISEMENT",
            "1 pound cooked shrimp ADVERTISEMENT",
            "2 (8 ounce) bags frozen corn ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a Dutch oven over medium heat. Stir leeks into the butter and season with salt and black pepper; cook and stir until the leeks are tender, 4 to 5 minutes.\nStir flour into the leek mixture until dissolved completely and the mixture begins to thicken; add half-and-half, potatoes, and clam juice. Bring the mixture to a boil, reduce heat to medium-low, and cook at a simmer for 10 minutes.\nStir shrimp and corn into the potato mixture; continue cooking until the potatoes are completely tender, about 10 minutes more. Remove pot from heat, add lemon juice and chives, and stir.\n",
        "picture_link": "fYm2O95.zBkxgNopKNid4pFcdEh6tCe"
    },
    {
        "title": "Easy Barbecue Sauce",
        "ingredients": [
            "1 cup ketchup ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1/4 cup teriyaki sauce ADVERTISEMENT",
            "1/4 cup hot sauce ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir ketchup, brown sugar, onion, teriyaki sauce, hot sauce, and liquid smoke together in a bowl until sauce is well combined. Transfer sauce to a jar and refrigerate until flavors blend, 8 hours to overnight.\n",
        "picture_link": "FKNeVtrg/0FsN3O6zBlkaE660aV0aJO"
    },
    {
        "title": "Brandy Baked Peaches",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 fresh peaches, halved and pitted ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon sliced almonds ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 tablespoons brandy ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Prepare a baking dish with cooking spray.\nArrange peaches cut-side up in the prepared baking dish.\nPut butter in a saucepan over medium-low heat, add almonds, and heat together until butter melts, about 2 minutes. Stir honey, brown sugar, and cinnamon into the melted butter; bring to a simmer and add brandy and salt. Stir to dissolve the salt, remove saucepan from heat, and add vanilla extract; pour the mixture over the peaches.\nBake peaches in preheated oven until the peaches are cooked through, about 30 minutes.\n",
        "picture_link": ".hs3/NiGuT7L.eJS9GPOTUIhczvG6Gi"
    },
    {
        "title": "Indian Spiced Chicken",
        "ingredients": [
            "1 (28 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "2 tablespoons grated fresh ginger ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "ground black pepper ADVERTISEMENT",
            "1 small head cauliflower, cored and cut into florets ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken thighs, cut into halves ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir tomatoes, tomato paste, ginger, curry powder, kosher salt, and black pepper together in a slow cooker crock until smooth; add cauliflower, chicken, onion, and raisins and stir.\nCook on Low until the chicken is cooked through, 6 to 7 hours (or on High for 4 to 5 hours). Garnish with cilantro.\n",
        "picture_link": "j9rBSJJr6ZvG4fSF07UAbNMpyGyhK6m"
    },
    {
        "title": "Bacon-Cheese Appetizer Toasts",
        "ingredients": [
            "1 cup shredded processed cheese food (such as Velveeta®) ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "7 slices cooked bacon, crumbled ADVERTISEMENT",
            "1 1/2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "2 tablespoons butter, or as needed ADVERTISEMENT",
            "1 (12 ounce) loaf cocktail-size rye bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix processed cheese food, Cheddar cheese, bacon, Worcestershire sauce, and dry mustard together in a bowl.\nHeat skillet over medium heat.\nButter both sides of each slice of bread and toast in skillet until browned, 1 to 2 minutes per side; arrange onto a baking sheet. Repeat toasting with remaining butter and bread slices.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nSpoon cheese-and-bacon mixture atop the toasts. Arrange toasts on a baking sheet.\nHeat toasts under the broiler until the topping is hot and bubbling, about 2 minutes.\n",
        "picture_link": "KxFeghCVkvQHJncAI8jsIyFv40si5nq"
    },
    {
        "title": "Taco Salad with Spinach",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "1/2 cup chopped mushrooms ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 (10 ounce) package spinach leaves ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef, onion, red bell pepper, mushrooms, salt, and chili powder together in the hot skillet until the beef is completely browned, 7 to 10 minutes; drain and discard grease.\nSpread spinach leaves into a salad bowl; top with beef mixture. Add black beans and chopped tomato.\n",
        "picture_link": "ZOMGuVhUdX4wQjY8fnkfZAhV5A1s4qy"
    },
    {
        "title": "Egg Bhurji",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "3 green chile peppers, sliced ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat; add garam masala, turmeric, coriander, and salt. Cook and stir onion and green chile peppers in the seasoned oil until onion is slightly tender, about 5 minutes.\nCrack eggs into the skillet and season with salt; cook and stir until eggs are set and scrambled, about 5 minutes.\n",
        "picture_link": "i/apZlYucki2G0N/vljct/aPVFBu5PW"
    },
    {
        "title": "Delightfully Exotic Mango Cake",
        "ingredients": [
            "1 1/2 cups canned sweetened mango pulp ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "2 medium eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 tablespoons whole almonds, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nBeat mango pulp, sugar, margarine, and eggs together in a bowl using an electric mixer on medium speed until light and well mixed, 3 to 5 minutes.\nSift flour, baking powder, and baking soda together in a bowl. Stir mango mixture into flour mixture just until batter is combined. Pour batter into the prepared baking dish.\nBake in the preheated oven for 15 minutes. Gently press almonds into batter. Continue baking until a toothpick inserted in the middle comes out clean, about 20 minutes.\n",
        "picture_link": "2vDUXkf8ZR05XHVQx7kvsO2bfVJ5pKK"
    },
    {
        "title": "Thanksgiving Muffins",
        "ingredients": [
            "1/2 cup sweetened dried cranberries (such as Craisins®) ADVERTISEMENT",
            "1 cup hot water, or as needed ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup oat flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 (15 ounce) can sweet potatoes, undrained ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup coconut oil ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 6 jumbo muffin cups or line with paper liners.\nSoak dried cranberries in a bowl of hot water until plump, about 10 minutes; drain.\nCombine whole wheat flour, white sugar, oat flour, baking powder, baking soda, salt, cinnamon, and nutmeg together in a bowl. Beat sweet potatoes, eggs, and coconut oil together in a separate bowl until smooth; stir into flour mixture until batter is smooth. Fold plump sweetened cranberries and pecans into batter; spoon into prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, 25 to 30 minutes.\n",
        "picture_link": "MFqNrKV/bd4f.ceM/NLMHVF844/sATi"
    },
    {
        "title": "Scrambled Eggs Fraiche",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "2 tablespoons minced fresh parsley ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground white pepper (optional) ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons creme fraiche, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs in a bowl with an electric mixer until thick and frothy, 1 to 2 minutes. Fold in parsley, black pepper, salt, and white pepper.\nMelt butter and olive oil together in a nonstick skillet over medium heat; reduce heat to low. Cook and stir egg mixture in hot butter and oil until eggs begin to set, about 1 minute. Stir in 1 tablespoon creme fraiche; cook and stir until eggs are set, 2 to 3 minutes more. Transfer to a plate and garnish with remaining creme fraiche.\n",
        "picture_link": "8vsFdoqfAkqVY6rYXPKAiFlxm3evedK"
    },
    {
        "title": "Saturday Morning Blueberry Pancakes",
        "ingredients": [
            "1 cup oat bran ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1/3 cup granola ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 apple, peeled and cored ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract, or to taste ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oat bran, flour, granola, baking powder, and cinnamon in a bowl.\nBlend apple, banana, milk, egg, and vanilla extract in a blender until smooth; mix into oat bran mixture until batter is well mixed. Gently fold blueberries into batter.\nHeat a lightly oiled griddle or skillet over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "awT2Mtcw2dwzXvVb1COMiuBjD0XqZ0m"
    },
    {
        "title": "Spelt Flat Bread",
        "ingredients": [
            "1 cup spelt flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon white sugar ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nWhisk flour, salt, onion powder, and sugar together in a bowl; add water and whisk until smooth. Cover bowl with a towel and set bowl aside.\nPour olive oil into a 12-inch cast iron skillet and place in oven until oil is hot, about 5 minutes. Pour batter into oiled skillet.\nBake in the preheated oven for 20 minutes. Flip flat bread and cook until browned, about 10 minutes more.\n",
        "picture_link": "7TkEP0GjDKuVvhLeSVPDhZqFkKLhzGu"
    },
    {
        "title": "Lemon Chicken & Broccoli Alfredo",
        "ingredients": [
            "1 (16 ounce) package frozen broccoli florets ADVERTISEMENT",
            "1 (16 ounce) package uncooked rotini ADVERTISEMENT",
            "Olive oil cooking spray ADVERTISEMENT",
            "1 1/4 pounds boneless, skinless chicken breasts, pounded to 1/2-inch thickness ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "1 (16 ounce) jar Ragu® Classic Alfredo Sauce ADVERTISEMENT",
            "1 1/2 lemon zest ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "Parmesan cheese, for serving (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook broccoli florets and rotini according to package directions. Set aside.\nSpray both sides of chicken with olive oil and evenly sprinkle with lemon pepper chicken.\nHeat 1 tablespoon olive oil in large skillet over medium high heat. Cook chicken in skillet until cooked through, about 4 minutes per side (instant-read thermometer reads 165 degrees F). Remove chicken from skillet; cut into cubes and keep warm.\nWipe out skillet and return it to stove. Stir together Ragu(R) Classic Alfredo sauce, lemon zest, and lemon juice in skillet. Heat over medium-low heat until warmed through, stirring occasionally. Add pasta, broccoli, and chicken to skillet, and stir to combine. Cook until heated through.\nServe with grated Parmesan cheese, if desired.\n",
        "picture_link": "WZzljWfn7lwoD4y8.cZgeQdrHZPWPfe"
    },
    {
        "title": "Ang's Creamy Potato Soup",
        "ingredients": [
            "1 (49.5 fluid ounce) can low fat, low sodium chicken broth ADVERTISEMENT",
            "5 pounds russet potatoes, peeled and cut into cubes ADVERTISEMENT",
            "4 carrots, peeled and diced ADVERTISEMENT",
            "4 stalks celery, diced ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1 cup broccoli florets ADVERTISEMENT",
            "1 (10 ounce) can fat-free cream of celery soup ADVERTISEMENT",
            "1 (10 ounce) can fat-free cream of chicken soup ADVERTISEMENT",
            "8 ounces Monterey Jack cheese, shredded ADVERTISEMENT",
            "8 ounces pepperjack cheese, shredded ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon parsley flakes ADVERTISEMENT",
            "1 (14.5 ounce) can fat-free reduced-sodium chicken broth, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 49.5 ounce can chicken broth into a 5-quart pot; add potatoes, carrots, celery, and onions; bring to boil, reduce heat to medium-low, and cook, stirring occasionally, and cook until the potatoes are completely tender, 20 to 25 minutes.\nGently mash potatoes into the soup to thicken to your desired texture.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil; add broccoli, cover, and steam until tender, 2 to 6 minutes.\nStir broccoli, celery soup, chicken soup, Monterey Jack cheese, pepperjack cheese, pepper, and parsley into the soup; add 14.5 ounce can chicken broth. Cook and stir until the cheese is melted, about 5 minutes.\n",
        "picture_link": "rk3PtyTGZ/ShYggBi9xrL03JVTZhf4u"
    },
    {
        "title": "Spring Herb Hummus Vegetable Garden",
        "ingredients": [
            "2 (15 ounce) cans chickpeas (garbanzo beans), drained and rinsed ADVERTISEMENT",
            "1/2 cup tahini ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "1 clove garlic, peeled ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 small carrots with greens still attached, or as desired ADVERTISEMENT",
            "6 sugar snap peas, or as desired ADVERTISEMENT",
            "6 fresh asparagus, or as desired ADVERTISEMENT",
            "6 radishes with greens, halved, or as desired ADVERTISEMENT",
            "6 small stalks celery hearts with leaves, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend chickpeas, tahini, water, lemon zest, lemon juice, basil, parsley, chives, mint, garlic, and salt in a blender until smooth. Spread hummus in a 2-inch deep baking dish.\nArrange carrots, sugar snap peas, asparagus, radishes, and celery in neat rows in the hummus to resemble a garden.\n",
        "picture_link": "KcjkTBCVcMIHUZy.xn66JTOvX5.jVL2"
    },
    {
        "title": "Carla's Veggie-Loaded Chicken Cacciatore",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken thighs ADVERTISEMENT",
            "3 onions, sliced ADVERTISEMENT",
            "8 ounces baby bella (crimini) mushrooms, sliced ADVERTISEMENT",
            "2 tablespoons cooking sherry ADVERTISEMENT",
            "2 zucchini, cut into chunks ADVERTISEMENT",
            "2 red bell peppers, sliced ADVERTISEMENT",
            "1 large yellow squash, cut into chunks ADVERTISEMENT",
            "4 cloves garlic, sliced ADVERTISEMENT",
            "3 sprigs fresh rosemary, leaves stripped ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "3 cups tomato sauce, or more to taste ADVERTISEMENT",
            "1/4 cup chicken stock, or more as desired ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large Dutch oven or heavy pot over medium-high heat; cook chicken in hot oil until browned, 3 to 4 minutes per side. Transfer chicken and accumulated juices to a bowl.\nMix onions and mushrooms together in the same large Dutch oven; add sherry. Cook and stir until onions and mushrooms are soft, 5 to 6 minutes. Add zucchini, red bell peppers, yellow squash, garlic, rosemary, Italian seasoning, oregano, 1 teaspoon salt, 1 teaspoon black pepper, and red pepper flakes; cook and stir until heated through, 3 to 4 minutes. Mix tomato sauce and chicken stock into vegetable mixture.\nArrange chicken on top of vegetable mixture; pour in any accumulated juices left in the bowl. Season with salt and black pepper. Cover Dutch oven.\nBake in the preheated oven until chicken is no longer pink in the center, about 1 hour 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "d8bZ53K3SxEnnsifWMx3iTYfs9QFyrG"
    },
    {
        "title": "Watermelon Salad with Grapes and Citrus",
        "ingredients": [
            "4 cups coarsely chopped seedless watermelon ADVERTISEMENT",
            "4 cups seedless red grapes, halved ADVERTISEMENT",
            "2 tablespoons grated lemon zest ADVERTISEMENT",
            "2 tablespoons grated lime zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine watermelon and red grapes in a bowl. Sprinkle lemon zest and lime zest over fruit and toss lightly. Cover bowl and refrigerate, about 1 hour.\n",
        "picture_link": "MXnba97zCfGape1G0JdYlx4aloHENcu"
    },
    {
        "title": "One-Pot Chicken Parmesan Pasta",
        "ingredients": [
            "1 1/2 pounds boneless, skinless chicken breasts, cubed ADVERTISEMENT",
            "1 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 (24 ounce) jar Ragu® Old World Style® Traditional Pasta Sauce ADVERTISEMENT",
            "1 (8 ounce) package uncooked spaghetti, broken in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat chicken cubes in 1/2 cup Parmesan cheese and Italian seasoning.\nHeat olive oil in a medium skillet over medium/high heat. Cook chicken in skillet, turning occasionally, until cooked through (no longer pink inside) about 5 minutes.\nPour water and Ragu(R) sauce into a saucepan and bring to a boil. Add pasta and simmer until pasta is tender, about 15 minutes. Stir frequently to prevent pasta from sticking to bottom. Add the remaining 1/2 cup Parmesan cheese and stir in chicken. Serve immediately. Enjoy!\n",
        "picture_link": "9nL7aUo0xRvy0OoMMf08ino9Wp21hjS"
    },
    {
        "title": "Polish Nalesniki",
        "ingredients": [
            "2 cups ricotta cheese ADVERTISEMENT",
            "3 ounces cream cheese, softened ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "12 crepes ADVERTISEMENT",
            "1 tablespoon butter, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process ricotta cheese and cream cheese in a food processor until smooth and creamy; add egg yolk, melted butter, sugar, vanilla extract, and salt and process until fluffy.\nDivide cheese mixture between the crepes. Spread filling into a thin layer and roll crepes around the filling.\nMelt 1 teaspoon butter in a skillet over medium heat. Fry 3 crepes in melted butter until heated through, 1 to 2 minutes per side; repeat with remaining butter and crepes.\n",
        "picture_link": "2WbW0xpuGGd6PL4QFaK1WaX3pDMq3Tq"
    },
    {
        "title": "Fruit Punch Salad",
        "ingredients": [
            "1 cup green grapes, some halved and some whole ADVERTISEMENT",
            "8 fresh strawberries, chopped ADVERTISEMENT",
            "1 fresh peach, chopped ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "1/2 Granny Smith apple, chopped ADVERTISEMENT",
            "1/2 orange, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix grapes, strawberries, peach, blueberries, and apple together in a bowl. Pour orange juice over fruit salad and stir.\n",
        "picture_link": "64oTscljDeD9jlguTb2Sa6fU1lwZ2kW"
    },
    {
        "title": "Chicken Taco Bowls with Pinto Beans and Rice",
        "ingredients": [
            "6 (8 inch) flour tortillas ADVERTISEMENT",
            "1 (18 ounce) package cooked chicken breast strips ADVERTISEMENT",
            "1 (8.8 ounce) pouch UNCLE BEN'S® READY RICE® Pinto Beans & Rice ADVERTISEMENT",
            "2 cups prepared pico de gallo ADVERTISEMENT",
            "1/2 cup shredded Mexican blend cheese ADVERTISEMENT",
            "1 avocado - peeled, pitted and sliced ADVERTISEMENT",
            "2 jalapeno peppers, thinly sliced ADVERTISEMENT",
            "1/2 cup avocado ranch dressing, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace each tortilla in a non-stick tortilla bowl maker; bake for 12 minutes. Allow to cool and remove from bowl maker.\nPrepare chicken strips according to package directions.\nPrepare rice according to package directions.\nDivide chicken strips, beans and rice, and pico de gallo among the tortilla bowls. Garnish with shredded cheese, avocado slices, and jalapeno slices. Top with avocado ranch dressing.\n",
        "picture_link": "/gBidnRssebb1E6N4DAgJQ9VQqGIJvi"
    },
    {
        "title": "Kid-Friendly Fruit Salad",
        "ingredients": [
            "1/4 fresh pineapple, cut into bite-size chunks ADVERTISEMENT",
            "1 orange, peeled and cut into bite-size pieces ADVERTISEMENT",
            "1/2 red apple, cut into bite-size pieces ADVERTISEMENT",
            "5 seedless red grapes, halved ADVERTISEMENT",
            "5 seedless green grapes, halved ADVERTISEMENT",
            "2 cups strawberry yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir pineapple, orange, apple, red grapes, and green grapes together in a bowl. Pour yogurt over the top and stir to coat completely.\n",
        "picture_link": "paaEXZTCBFZg8STeqHBEPKRWXkrWUbm"
    },
    {
        "title": "Orange Citrus Cheesecake",
        "ingredients": [
            "Reynolds Wrap® Heavy Duty Aluminum Foil ADVERTISEMENT",
            "1 large orange ADVERTISEMENT",
            "1 3/4 cups crushed vanilla wafers ADVERTISEMENT",
            "1/4 cup finely chopped pecans (optional) ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "3 ounces white baking chocolate, chopped ADVERTISEMENT",
            "Cranberry Orange Sauce: ADVERTISEMENT",
            "1 cup fresh cranberries, coarsely chopped ADVERTISEMENT",
            "1/4 cup granulated sugar ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Line the outside of a 9-inch springform pan with a double layer of 18-inch-wide Reynolds Wrap(R) Heavy Duty Aluminum Foil. Bring edges of the foil up and mold the foil around the sides of the springform pan to form a watertight seal outside of the pan.\nZest 1 teaspoon orange zest from the orange. Juice 1/4 cup orange juice from the orange set both aside.\nCombine vanilla wafers, pecans (if using), and 1 tablespoon granulated sugar in a medium bowl. Stir in melted butter. Press the mixture onto the bottom and about 1 1/2 inches up the sides of the prepared springform pan. Place in a roasting pan.\nBeat cream cheese, 3/4 cup granulated sugar, flour, and orange zest together in a large bowl using an electric mixer on low speed until combined. Add orange juice and beat until smooth. Beat in eggs and white chocolate.\nPour filling into crust-lined pan. Place roasting pan on the oven rack. Pour enough boiling water into roasting pan to reach halfway up the sides of the springform pan.\nBake 1 hour or until top is just set and edges jiggle slightly when pan is gently shaken. Turn oven off and allow cheesecake to stand in oven for 1 hour (it will continue to set up during standing time in oven).\nRemove springform pan from water bath and cool on a wire rack for 15 minutes. Using a small sharp knife, loosen the crust from sides of the springform pan cool for 30 minutes. Remove sides of springform pan cool cheesecake on wire rack for 2 hours.\nCover and chill for at least 4 hours before serving. Top with Cranberry Orange Sauce to serve.\nCranberry Orange Sauce: Combine 1 cup fresh cranberries, coarsely chopped 1/4 cup granulated sugar and 2 tablespoons orange juice in a small saucepan over medium heat. Bring to a simmer and cook, stirring frequently, until the sugar is dissolved and the cranberries start to break down. Remove from heat and cool completely before serving.\n",
        "picture_link": "1Xew/yvT3NV32CFBu84.nhBLeakGjMi"
    },
    {
        "title": "Mexican Quinoa Salad",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained and rinsed ADVERTISEMENT",
            "1 1/2 cups cooked quinoa ADVERTISEMENT",
            "1 cup frozen corn ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "1/2 cup finely chopped cilantro, plus more for garnish ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "6 pickled jalapeno pepper slices, chopped ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir black beans, quinoa, corn, red bell pepper, green onion, cilantro, and garlic together in a large bowl.\nWhisk olive oil, lime juice, honey, jalapeno, mustard, and paprika together in a bowl until dressing is smooth and creamy. Pour dressing over quinoa mixture and toss to coat. Garnish with cilantro.\n",
        "picture_link": "GkorbYY1odPNCaG4LHikQ8eA0vC39Z6"
    },
    {
        "title": "Easy Balsamic Glaze",
        "ingredients": [
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/3 cup white vinegar ADVERTISEMENT",
            "1/4 cup teriyaki sauce ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk brown sugar, water, vinegar, teriyaki sauce, and cornstarch together in a small saucepan; bring to a boil, reduce heat to low, and simmer, stirring frequently, until glaze thickens, 5 to 10 minutes.\n",
        "picture_link": "dwPGxFJqzPkFreMMJQ1iNBzDg0wDDVS"
    },
    {
        "title": "Simple Kale Salad",
        "ingredients": [
            "1/4 avocado, peeled and pitted ADVERTISEMENT",
            "1 tablespoon coconut oil, melted ADVERTISEMENT",
            "1/4 lime, juiced ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 cucumber, diced ADVERTISEMENT",
            "1/2 bunch kale, roughly chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash avocado into coconut oil in a bowl; add lime juice, cayenne pepper, and garlic powder and mix well.\nPlace cucumber and kale in a bowl; add dressing and toss to coat. Season salad with salt.\n",
        "picture_link": "bBEXu0qDGB9OTq8QnrMTRUW8GJL2cn6"
    },
    {
        "title": "Key Lime Pie Martini",
        "ingredients": [
            "1 fluid ounce vanilla-flavored vodka ADVERTISEMENT",
            "1 fluid ounce pineapple juice ADVERTISEMENT",
            "1 fluid ounce sweet and sour mix ADVERTISEMENT",
            "1/2 fluid ounce triple sec (orange-flavored liqueur) ADVERTISEMENT",
            "1/2 fluid ounce sweetened lime juice ADVERTISEMENT",
            "1/4 fluid ounce heavy whipping cream, or to taste ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour vanilla-flavored vodka, pineapple juice, sweet and sour mix, triple sec, lime juice, and heavy whipping cream into a cocktail shaker; add ice. Cover shaker and shake vigorously. Strain cocktail into a chilled martini glass.\n",
        "picture_link": "nLOhrcvPrZ2DPit2ANo4.qwaLKlCjFa"
    },
    {
        "title": "Buffalo Chicken Tacos",
        "ingredients": [
            "4 ounces grilled chicken, chopped ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "3 white corn taco shells ADVERTISEMENT",
            "1/4 cup hot Buffalo wing sauce (such as Frank's® REDHOT Buffalo Wing Sauce) ADVERTISEMENT",
            "1/4 cup crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in a bowl and season with chili powder, cumin, and garlic powder. Spoon chicken into taco shells. Pour Buffalo wing sauce over seasoned chicken and top with blue cheese.\n",
        "picture_link": "HT4Uv2GqeCQkZzv0ipLaz9bqXVmOJw6"
    },
    {
        "title": "Easy Mexican Quinoa",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1/2 cup quinoa ADVERTISEMENT",
            "1 ounce taco seasoning mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a saucepan over medium-high heat; saute onion in hot oil until slightly softened, 1 to 2 minutes. Stir in quinoa and taco seasoning; saute until fragrant, about 1 minute.\nPour water into quinoa mixture. Bring to a boil, reduce heat to low, cover the saucepan with a lid, and simmer for 15 minutes. Stir beans and tomatoes into quinoa mixture, cover the saucepan again with the lid, and simmer until quinoa is tender and water is absorbed, about 5 minutes more. Stir Cheddar cheese into quinoa, spoon into bowls, and top each with a dollop of sour cream.\n",
        "picture_link": "EE7R3TD48Tu5acziEgiV1Oyecd5lUbu"
    },
    {
        "title": "Homemade Worcestershire Sauce",
        "ingredients": [
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine apple cider vinegar, water, soy sauce, brown sugar, mustard powder, onion powder, garlic powder, ground cinnamon, and black pepper together in a saucepan; bring to a boil and cook until fragrant, about 45 seconds. Cool to room temperature.\n",
        "picture_link": "9UbrBBDjQmZ4/SVA1VoGCZE5uEW4fUS"
    },
    {
        "title": "Spinach and Artichoke Casserole",
        "ingredients": [
            "2 (10 ounce) packages frozen chopped spinach ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 (8 ounce) can sliced water chestnuts, drained ADVERTISEMENT",
            "garlic powder, or to taste ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and halved ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "2 tablespoons butter, cut into small pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPut spinach into a microwave-safe bowl. Pour water over the spinach. Cover bowl tightly with plastic wrap.\nCook in microwave oven on High, stirring occasionally, until the spinach is heated through, 9 to 11 minutes; transfer to a colander to drain, pressing to remove as much moisture from the spinach as possible.\nMelt 1/2 cup butter in a saucepan over medium heat; add spinach, cream cheese, water chestnuts, and garlic powder. Cook and stir until the cheese melts, 5 to 7 minutes.\nSpread artichoke hearts into the bottom of a baking dish. Spread spinach mixture over the artichoke hearts. Sprinkle bread crumbs over the spinach mixture. Dot top of casserole with butter pieces.\nBake in preheated oven until heated through, 20 to 25 minutes.\n",
        "picture_link": "8NmzViGmHRY9a8XOJ4SuybTO.zJKv/C"
    },
    {
        "title": "Sweet Summer Squash Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "2 cups grated yellow squash ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 cup chopped nuts (optional) ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9x5-inch loaf pans.\nMix flour, sugar, squash, oil, pineapple, nuts, eggs, vanilla extract, cinnamon, baking soda, salt, and baking powder together in a bowl; pour into prepared loaf pans.\nBake in the preheated oven until a toothpick inserted in the middle comes out clean, about 1 hour. Cool bread for 10 minutes in pan before transferring to a wire rack to cool completely.\n",
        "picture_link": "drFalQIbzUe/9N5i.OaHxYCbNBX8rCO"
    },
    {
        "title": "Greek-Style Beef Pita",
        "ingredients": [
            "1 pound beef sirloin tip steaks, cut 1/8 to 1/4-inch thick ADVERTISEMENT",
            "1 tablespoon lemon pepper ADVERTISEMENT",
            "3 teaspoons vegetable oil, divided ADVERTISEMENT",
            "3/4 cup plain or seasoned hummus ADVERTISEMENT",
            "4 whole wheat pita breads, cut crosswise in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stack beef steaks; cut lengthwise in half, then crosswise into 1-inch wide strips. Combine beef and lemon pepper in medium bowl.\nHeat 2 teaspoons oil in large nonstick skillet over medium-high heat until hot. Add 1/2 of beef; stir-fry 1 to 3 minutes or until outside surface of beef is no longer pink. (Do not overcook.) Remove from skillet. Repeat with remaining beef, adding remaining 1 teaspoon oil to skillet, if necessary.\nSpread hummus evenly in pita pockets. Fill with equal amounts of beef and toppings, as desired.\n",
        "picture_link": "kmLlThv26uZot.BHNeYfQWEORxnZFxe"
    },
    {
        "title": "Crusty Garlic Bread",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "3 tablespoons dried minced garlic ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 loaf French bread, halved lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBeat butter, garlic, basil, and salt together in a bowl until smooth. Spread butter mixture onto each half of bread. Wrap each half of bread in aluminum foil and place on a baking sheet.\nBake in the preheated oven until golden and crusty, about 20 minutes.\n",
        "picture_link": "dLbutZQwmuo0R7cSKlqwFUr8iJte29C"
    },
    {
        "title": "Dogs 'n' Beans Rice Bowl",
        "ingredients": [
            "4 beef or turkey hot dogs, sliced into 1-inch pieces ADVERTISEMENT",
            "1 (16 ounce) can baked beans (such as Bush's Original®) ADVERTISEMENT",
            "2 (8.8 ounce) packages UNCLE BEN'S® Ready Rice - Whole Grain Brown ADVERTISEMENT",
            "1 cup frozen green petite peas, thawed ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese, plus more for topping if desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a non-stick skillet over medium heat. Cook and stir hot dog pieces until lightly browned, about 4 minutes. Stir in baked beans and bring to a low simmer; cook about 10 minutes.\nPlace peas in small saucepan over medium heat; cook until heated through.\nCook rice according to package directions. Stir in peas and Cheddar cheese.\nSpoon rice mixture into four serving bowls. Spoon hot dogs and beans mixture over the rice. Top with additional shredded Cheddar cheese, if desired.\n",
        "picture_link": "mxB.6XzFCpXtC3zOnprPO.IpT6BPDca"
    },
    {
        "title": "Dairy-Free Chocolate Peanut Banana Smoothie",
        "ingredients": [
            "1 cup unsweetened almond milk ADVERTISEMENT",
            "1 frozen banana, cut into chunks ADVERTISEMENT",
            "2 tablespoons smooth peanut butter ADVERTISEMENT",
            "2 teaspoons cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend almond milk, banana, peanut butter, and cocoa powder together in a blender until smooth.\n",
        "picture_link": "HnEZ7eVCirYs/T.SlNumuQUgRpS/kni"
    },
    {
        "title": "Baked Fried Rice Cakes",
        "ingredients": [
            "2 (8.8 ounce) pouches UNCLE BEN'S® Ready Rice® Garden Vegetable ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "4 teaspoons soy sauce ADVERTISEMENT",
            "3/4 teaspoon sesame oil ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a large baking sheet with parchment paper.\nEmpty contents of Ready Rice pouches in mixing bowl and break up any clumps. Add panko bread crumbs, soy sauce, sesame oil, and beaten eggs. Stir together until well combined.\nPlace a 3 1/2-inch biscuit cutter on the parchment paper. Using a large cookie or ice cream scoop (about 1/4 cup), place a level scoop of rice into the biscuit ring. Press mixture gently to fill the space evenly. Gently remove the ring (don't worry if it's not perfect). Then repeat making a total of about 10 fried rice cakes.\nBake in pre-heated oven until heated through, 10 to 15 minutes.\n",
        "picture_link": "JLiZSwowI6CsiuWjqR6O/4P.0HRyC32"
    },
    {
        "title": "Slow Cooker Chicken Tacos with Chipotle Cream Sauce",
        "ingredients": [
            "4 frozen chicken thighs ADVERTISEMENT",
            "2 frozen chicken breast halves ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup diced green onions ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "Chipotle Cream Sauce: ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 chipotle peppers in adobo sauce ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons minced fresh cilantro ADVERTISEMENT",
            "10 flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken thighs and chicken breasts in a slow cooker. Whisk red wine vinegar, green onions, lime juice, and garlic together in a bowl; pour over chicken.\nCook on High for 4 hours.\nBlend sour cream, chipotle peppers in adobo sauce, and 1/4 teaspoon salt together in a food processor until sauce is smooth; refrigerate until ready to use.\nPlace chicken on a work surface and shred into bite-size chunks; season with salt and pepper. Measure 1/2 cup cooking liquid in slow cooker and discard the rest. Return shredded chicken and 1/2 cup cooking liquid to slow cooker and add cilantro; cook and stir until chicken is heated through, about 5 minutes.\nSpoon chicken into tortillas and top with chipotle cream sauce.\n",
        "picture_link": "wE/cq8ifuhPTHJyReohKi6pxgwirp7q"
    },
    {
        "title": "Crawfish Etouffee Georgia Style",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "2 cups finely chopped sweet onions (such as Vidalia®) ADVERTISEMENT",
            "1 cup celery root (celeriac), peeled and finely chopped ADVERTISEMENT",
            "2 1/2 tablespoons chopped green bell pepper ADVERTISEMENT",
            "3 tablespoons chopped red bell pepper ADVERTISEMENT",
            "2 1/2 tablespoons chopped yellow bell pepper ADVERTISEMENT",
            "1 pound peeled crawfish tails ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup low-sodium chicken broth ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon coarse smoked salt flakes ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "3 tablespoons finely chopped fresh parsley ADVERTISEMENT",
            "3 tablespoons green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large cast iron skillet over medium heat. Stir in onion, celery root, and bell peppers; cook and stir until the onion has softened and turned translucent, 8 to 10 minutes.\nStir in crawfish, garlic, and bay leaves. Cook, stirring occasionally, for 10 to 12 minutes.\nWhisk flour into chicken broth and water in a bowl until smooth; pour into crawfish mixture. Season with smoked salt and cayenne pepper.\nBring mixture to a boil. Reduce heat to medium; cook and stir until mixture thickens, about 4 minutes. Stir in parsley and green onions; cook 2 minutes more.\n",
        "picture_link": "Vvohvdg4Mc7D5VZ2Yq4FiIhK1IZhB12"
    },
    {
        "title": "Sausage Bread Ring",
        "ingredients": [
            "1 pound bulk breakfast sausage ADVERTISEMENT",
            "1 (16 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (16 ounce) package refrigerated pizza dough (such as Pillsbury®) ADVERTISEMENT",
            "1 egg yolk, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat; cook and stir sausage, breaking meat into chunks, until crumbly and no longer pink, about 10 minutes. Transfer sausage to a paper towel-lined plate to drain.\nMix cooked sausage, mozzarella cheese, Parmesan cheese, and egg together in a bowl.\nRough dough into a 10x14-inch rectangle on a baking sheet. Spread sausage-cheese mixture onto dough, leaving a 1-inch border. Roll dough around filling, starting from the long edge, creating a long log. Form the log into a circle and pinch edges together to seal. Brush top of roll with egg yolk.\nBake in the preheated oven until ring is dark golden brown, 1 hour. Cool for 15 minutes before slicing into pieces to serve.\n",
        "picture_link": "x0t5I/eP0ZAFDevAp6VKC6w131XUf7C"
    },
    {
        "title": "Taco Bites",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/3 cup salsa ADVERTISEMENT",
            "1 green onion, finely chopped ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray mini muffin cups with cooking spray.\nMix cream cheese, Cheddar cheese, salsa, green onion, garlic powder, and sugar together in a bowl. Add eggs and mix well; spoon into the prepared muffin cups.\nBake in the preheated oven until each taco bite is set in the middle, about 15 minutes.\n",
        "picture_link": "NYZqpDZmneRgJnvInx1svXLW.M34A9a"
    },
    {
        "title": "Carrot Cake Martini",
        "ingredients": [
            "1 cup ice cubes, or as needed ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
            "1 1/2 (1.5 fluid ounce) jiggers butterscotch schnapps ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger red cinnamon schnapps ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice; pour in Irish cream liqueur, butterscotch schnapps, and cinnamon schnapps. Cover the shaker and shake until frothy. Strain into a martini glass.\n",
        "picture_link": "h.vcB7F87O3xUkQaKCbxDJlqT/q/5xC"
    },
    {
        "title": "Broiled Scallops with Chanterelles",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 pound chanterelle mushrooms ADVERTISEMENT",
            "7 tablespoons butter ADVERTISEMENT",
            "1 tomato - peeled, seeded, and chopped ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 pound scallops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 2 tablespoons butter in a skillet over medium heat; cook and stir chanterelles in hot butter until tender, 5 to 8 minutes. Transfer chanterelles to a bowl. Melt remaining 7 tablespoons butter in the same skillet and reduce heat to low. Cook butter until it turns pale brown and gives off a nutty fragrance, about 5 minutes.\nStir tomato and balsamic vinegar into browned butter; cook and stir until tomato is soft, about 2 minutes. Stir cooked tomato and browned butter into mushrooms.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace scallops onto a broiler pan and broil in oven until just opaque, about 2 minutes per side. Serve scallops on a platter topped with chanterelles and sauce.\n",
        "picture_link": "a2hIgp.9oU6CHy5jzsce0u4GW.XePB2"
    },
    {
        "title": "Mediterranean Chicken Sandwich",
        "ingredients": [
            "4 skinless, boneless chicken breast halves , cut into cubes ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 pinch salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 yellow bell pepper, diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1/4 cup pitted kalamata olives, diced ADVERTISEMENT",
            "1/4 cup capers, drained ADVERTISEMENT",
            "1 cup halved cherry tomatoes ADVERTISEMENT",
            "1 pound shredded mozzarella cheese ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "4 Italian-style hoagie buns, split lengthwise and toasted ADVERTISEMENT",
            "1/4 cup artichoke aioli (see footnote for recipe link) ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken, olive oil, garlic, red pepper flakes, salt, and black pepper in a large bowl; toss to coat.\nHeat a large pot or Dutch oven over medium-high heat. Add chicken mixture and cook, stirring frequently, until chicken is no longer pink in the center, about 5 minutes. Add yellow bell pepper and onion; cook until onion begins to soften, about 5 minutes. Mix in olives and capers until combined. Stir in mozzarella cheese until melted. Remove from heat and stir in feta cheese.\nSpread each hoagie roll with 1 tablespoon artichoke aioli. Evenly distribute the chicken mixture among the 4 sandwiches. Sprinkle each sandwich with 1 tablespoon basil.\n",
        "picture_link": "ScClGDBkBORvUCkkgjnJcsvFVeKOfwm"
    },
    {
        "title": "Home Town Drive-In Pasta Salad ",
        "ingredients": [
            "1 (12 ounce) package tri-color rotini pasta ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons hot water ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 large tomato, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1/4 cup finely diced sweet onion ADVERTISEMENT",
            "1 (8 ounce) package shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 pinch ground black pepper to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook rotini pasta at a boil until tender yet firm to the bite, about 8 minutes; drain and rinse with cold water to cool.\nWhisk sugar, salt, and hot water in a large salad bowl until sugar has dissolved. Stir vinegar, vegetable oil, and oregano into sugar mixture to make a dressing. Mix tomato, red bell pepper, and onion in the dressing. Gently fold rotini into dressing and vegetables, mix in Cheddar cheese, and season with black pepper.\n",
        "picture_link": "eUXY9H8W7n7XFIXWynwQ7NpetdfH1Ey"
    },
    {
        "title": "Soy Pancakes",
        "ingredients": [
            "2 large eggs ADVERTISEMENT",
            "1/3 cup fat-free plain yogurt ADVERTISEMENT",
            "1/4 cup soy flour ADVERTISEMENT",
            "4 (1 gram) packets stevia sugar substitute (such as Truvia®) ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon ground flaxseed ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a lightly oiled griddle over medium-high heat.\nWhisk eggs, yogurt, soy flour, sugar substitute, olive oil, flaxseed, vanilla, baking powder, salt, and cinnamon together in a bowl until smooth.\nLadle batter onto griddle by 1/4 cupful; spread lightly with the back of the ladle.\nCook until bubbles form and the edges are dry, 2 to 3 minutes. Flip carefully and cook until browned on the other side, another 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "g2J99T5hWzH/6c53hROlCKMC3ljzdqm"
    },
    {
        "title": "Spicy Chipotle Tuna",
        "ingredients": [
            "2 (7 ounce) packages chunk light tuna in water, drained and flaked ADVERTISEMENT",
            "1/3 cup ranch dressing ADVERTISEMENT",
            "1/2 teaspoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "4 chipotle peppers in adobo sauce, chopped ADVERTISEMENT",
            "1/4 cup green onions, chopped ADVERTISEMENT",
            "salt to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tuna, ranch dressing, Dijon mustard, and Parmesan cheese in a bowl. Add chipotle peppers and green onions; fold through the tuna mixture. Season with salt.\n",
        "picture_link": "T1QiKK9hQdweQuSC3GepeCZB1Kbs2FO"
    },
    {
        "title": "Cheesy Chicken with Ranch",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 teaspoon seasoned salt (such as LAWRY'S®) ADVERTISEMENT",
            "1 cup crushed cheese-flavored crackers ADVERTISEMENT",
            "3/4 cup ranch dressing ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, cut into chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Coat a 9x13-inch baking dish with olive oil.\nStir seasoned salt into crackers in a bowl. Pour ranch dressing in a separate bowl. Dip chicken chunks into ranch dressing and press into cracker mixture until coated. Spread chicken in prepared baking dish.\nBake in preheated oven until chicken is no longer pink in the center, about 15 minutes.\n",
        "picture_link": "MjMOPbtBSihXsbi7Fb8DJveribIEPHa"
    },
    {
        "title": "Winter Citrus Salad",
        "ingredients": [
            "3 oranges, peeled and sectioned ADVERTISEMENT",
            "1 grapefruit, peeled and sections cut away from membrane ADVERTISEMENT",
            "2 tangerines, peeled and sectioned ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine orange, grapefruit, and tangerine sections with walnuts in a bowl. Squeeze lime juice over salad; drizzle with honey. Stir to combine.\n",
        "picture_link": "FCC2da1vGX.XCpvPGPkSG2uIckETFRe"
    },
    {
        "title": "Biscochitos II",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 cup margarine ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon anise extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup wine ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together shortening, margarine and sugar with a mixture until well blended. Mix in the rest of the ingredients until smooth.\nRoll out on a floured board to 1/2 or 1/4 inch thickness.\nCut into desired shapes and place on baking sheets. Bake until golden brown, about 10 - 12 minutes. Garnish as desired or leave plain.\n",
        "picture_link": "DTlpXX0F/rHI5Je8QrlsBY7zrOJ1B5W"
    },
    {
        "title": "Bruti Ma Buoni",
        "ingredients": [
            "1 cup egg whites ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "5 1/3 cups chopped blanched almonds ADVERTISEMENT",
            "2 cups hazelnuts, skinned and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nLet egg whites stand until at room temperature. Beat the whites until lightly foamy. Add the sugar gradually as you beat. Beat until soft peaks are formed. Fold in the nuts.\nTransfer this all to a large saucepot. Cook over low heat, stirring all the time, until it thickens and turns a little brown, about 10 minutes.\nSpoon the cookies onto greased baking sheets by the teaspoonful, about 1 to 1-1/2 inches apart. Bake about 22 minutes, or until dry. Remove and place on a wire rack to cool.\n",
        "picture_link": "9H9XFbf7wfC5z/J/H.lBCuf7ULKoHHS"
    },
    {
        "title": "Basic Chocolate Drop Cookies",
        "ingredients": [
            "1/4 cup sifted cocoa ADVERTISEMENT",
            "2 cups Basic Cookie Mix ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nSift cocoa into Basic Cookie Mix. Beat egg lightly and stir into mixture. Melt butter over low heat and stir into mixture. Add water and vanilla and mix well. Drop by teaspoonfuls onto greased baking sheet.\nBake for 12 to 15 minutes in the preheated oven.\n",
        "picture_link": "lpa5Q4kiwdGm0i2kGj/JZ.GbExXQr/a"
    },
    {
        "title": "Zwieback",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons butter, cut into pieces ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk over low heat until just below boiling. Remove from heat;stir in butter, honey and salt. Set aside and let cool.\nIn a large bowl, combine yeast and lukewarm water. Set aside 5 minutes for yeast to soften. Add cooled milk mixture to softened yeast and beat in 4 cups flour.\nKnead dough in a bowl, adding up to 1/2 cup more flour if necessary, until a smooth, soft dough forms. Divide dough into 8 balls 3 inches in diameter. Place balls 4 inches apart on lightly greased cookie sheets; pat into 4 inch rounds. Set aside, lightly covered with kitchen towels, about 1 hour, or until doubled in size.\nPreheat oven to 350 degrees F (180 degrees C).\nBake raised rounds 30 minutes, or until golden brown. Remove from oven; leave oven on. Let cool on sheets 10-15 minutes, or until cool enough to handle.\nWith a serrated knife, cut each round into six 1/2-inch slices. Place slices, cut sides down, on cookie sheets and return to oven 5 minutes. Turn slices and bake 5 to 7 min. longer, or until golden on both sides. Turn off heat and leave zwieback in unopened oven until cool, about 45 minutes. Store in a tightly covered container.\n",
        "picture_link": "i5YoVnJQ1uZ3xdZ.SR3eInqdhkY9SN2"
    },
    {
        "title": "Lucky Stars",
        "ingredients": [
            "1 1/3 cups all-purpose flour, sifted ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 cups ground walnuts ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/8 teaspoon maple flavored extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together 1 1/3 cups flour and 1 1/2 teaspoons double-acting baking powder. Set aside. Cream 1/4 cup butter or margarine. Gradually add 1/4 cup sugar, creaming well. Blend in 1 teaspoon vanilla, 1 teaspoon almond extract, 1/8 teaspoon salt and unbeaten egg. Gradually add the flour and baking soda mixture, mixing thoroughly.\nTo Make Nut Filling: Combine 1 1/4 cups walnuts or pecans, ground or chopped very fine, 1/3 cup sugar and 1/16 teaspoon salt. Add 1 Tablespoon melted butter, 2 Tablespoons water and 1/16 teaspoon maple flavoring. Mix thoroughly.\nRoll out dough on a floured surface to 1/8-inch thickness. Cut with star-shaped cookie cutter. Place a teaspoonful of Nut Filling in the center of each star. Bring the 5 points upright; starting at the base, pinch sides together so points stand up, allowing filling to show. Place on ungreased baking sheet. Bake at 400 degrees F (200 degrees C) 7 to 10 minutes until light golden brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cashew Nut Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup chopped salted cashews ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend together 1/2 cup butter, brown sugar, egg, vanilla, and sour cream. Add in the baking powder, soda, and flour. Stir in the nuts.\nDrop dough by teaspoonfuls onto buttered baking sheets. Cook at 375 degrees F (190 degrees C) for 8 to 10 minutes. Remove from oven, and cool on wire racks.\nTo Make the Icing: Heat 1/2 cup butter or margarine in a saucepan until it is light amber colored. Remove pan from heat, and stir in confectioners' sugar and the milk. I sometimes have to use more milk to get the icing smooth and creamy. Frost cookies.\n",
        "picture_link": "Trfhuz.RekFyS7G1tT4R2GAfZBUJQsq"
    },
    {
        "title": "Sandtarts I",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sugar, butter or margarine and eggs. Add dry ingredients and mix well.\nLet dough stand for 20 minutes.\nPreheat oven to 350 degrees F (180 degrees C).\nDrop 1/2 teaspoon-full 2 inches apart on greased, floured cookie sheet. Bake 10 minutes or less, until edges tan. Sprinkle with cinnamon or sugar.\n",
        "picture_link": "0Y0KVDMP4yKqMk0MBowhp3uTVYe7rzO"
    },
    {
        "title": "Meringue Squares",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter or margarine and sugar. Add eggs one at a time, beating after each addition.\nIn another bowl, sift flour, salt, and baking powder together. Blend in to the creamed mixture, and then add 1/2 teaspoon vanilla to the dough.\nSpread dough in 9 x 13 inch greased baking pan, and sprinkle chopped nuts over top.\nIn a small mixing bowl, beat egg white until stiff but not dry. Add brown sugar and 1/2 teaspoon vanilla to the whipped egg white, and beat thoroughly. Spread meringue over the dough and nuts already in the pan.\nBake at 375 degrees F (190 degrees C) for 20 to 30 minutes. Cool, and cut into bars.\n",
        "picture_link": "qg0GMsT.jtvQ9yjIF0irFFeISL/3h22"
    },
    {
        "title": "Chocolate Squares I",
        "ingredients": [
            "1 cup dates, pitted and chopped ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nCook chopped dates and water over low heat until soft. Set aside.\nCream together sugar and shortening. Add eggs and beat well. Stir in flour, salt, baking soda, cocoa and vanilla and mix well. Stir in date mixture.\nPour in 9 x 11 inch pan and top with chocolate chips and chopped nuts. Bake until toothpick comes out clean. (10 - 15 minutes)\n",
        "picture_link": "ybgtPi1CEPkRJOchCoh2U5s4t4UBOf."
    },
    {
        "title": "Chocolate Covered Cherry Cookie Frosting",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups sifted confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In double boiler, over boiling water, cook the milk, butter, chocolate and salt until thick.\nRemove from heat and stir in the vanilla and confectioner's sugar until of spreading consistency. Spread on Chocolate Covered Cherry Cookies III.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Children's Delight Cookies",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "3 cups raisins ADVERTISEMENT",
            "2 cups shortening ADVERTISEMENT",
            "8 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil water and raisins together for 5 minutes. Set aside.\nCream sugar, shortening, eggs and vanilla until light. Pour in the warm raisin mixture, combining well. Stir in dry ingredients that have been combined and blend well.\nDrop by tablespoonful on a lightly oiled cookie sheet. Bake at 350 degrees F (175 degrees C) for 12 to 15 minutes.\n",
        "picture_link": "91v5Z5c1l5tsWk7jEN9LFbVv/bMtIRq"
    },
    {
        "title": "Sponge Fingers",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon anise extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nBeat six eggs. Add sugar, oil, and anise flavoring and mix well.\nMix in the flour and baking powder. Beat well.\nSmooth batter into a 10 x 15 inch greased and floured pan. Bake for 25 - 30 minutes. Cool then cut in strips.\n",
        "picture_link": "P7uUEYyk3nE3pzhNY2Y7UQxjA43j.vG"
    },
    {
        "title": "Make Ahead Butter Balls",
        "ingredients": [
            "2 cups Make Ahead Cookie Mix ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine Make Ahead Cookie Mix with sugar, butter, vanilla, egg and chopped nuts. Mix well.\nShape dough into balls. Bake 11 to 16 minutes. Let cool. Roll in confectioners' sugar.\n",
        "picture_link": "miXid82ElFwi1WuZFu3.VVkZKAG/Uv2"
    },
    {
        "title": "Powdered Sugar Cookies II",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream shortening and butter. Gradually add confectioners' sugar (powdered sugar), creaming well. Add egg and flavorings. Beat until fluffy.\nSift flour with baking soda and cream of tartar; add and mix well. Stir in pecans.\nDrop small teaspoonfuls (or shape into small balls) on ungreased baking sheets. Bake at 400 degrees F (205 degrees C) for 8 to 10 minutes or until creamy tan in color. While hot, roll in confectioners' (powdered) sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Biscotti Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "6 tablespoons shortening ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees F). Grease 2 baking sheets.\nIn a medium bowl, combine flour, sugar, and baking powder. Cut in the vegetable shortening until mixture resembles coarse crumbs.\nIn a large bowl, beat the eggs until thick and light-colored. Gradually beat the eggs into the flour mixture. Fold in the walnuts.\nOn a floured surface, roll out the dough 1/4 inch thick. Using a cookie cutter, cut into desired shapes and place 1 1/2 inches apart on baking sheets.\nBake for 12 to 14 minutes, until lightly colored. Transfer to wire racks to cool.\n",
        "picture_link": "zMQkI5znm18zuBJ3m6KX6ywjsaPcZ0W"
    },
    {
        "title": "German Chocolate Snacking Bars",
        "ingredients": [
            "4 (1 ounce) squares German sweet chocolate ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup baking mix ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (8 ounce) package flaked coconut ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, melt chocolate and butter or margarine over low heat. Remove pan from heat.\nStir 1/2 cup sweetened condensed milk, eggs, biscuit mix, and vanilla into chocolate mixture.\nSpread batter evenly into a greased 13 x 9 inch baking dish.\nIn a medium bowl, combine the remaining condensed milk with the coconut; spoon evenly over batter in baking dish. Sprinkle nuts over the top; press them down firmly.\nHeat oven to 325 degrees F (165 degrees C). Bake for 25 minutes, or until done. Cool and cut into bars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rocks",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together butter or margarine and sugar until light and fluffy. Add the eggs one at a time, and beat well after each addition.\nSift and measure flour, and reserve two tablespoons. Mix remaining flour with soda and spices; stir into the creamed mixture.\nDredge raisins in the 2 reserved tablespoons of flour, then stir them into the batter along with the walnuts.\nDrop dough by tablespoonfuls onto lightly greased baking sheet. Bake at 375 degrees F (190 degrees C) for 8 to 10 minutes. Remove and cool cookies on a wire rack.\nDrop by tablespoonfuls onto lightly greased baking sheet. Bake at 375 degrees F (190 degrees C) 8 - 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lepp Cookies I",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the 1 cup flour, 1/2 cup brown sugar and 1/2 cup shortening. Mix until it reaches a coarse crumb mixture.\nStir together eggs, sugar, oil, and buttermilk. Then add dry ingredients and vanilla. Drop from tablespoon onto ungreased cookie sheet. Sprinkle crumb mixture on dough.\nBake until slightly browned, 8 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chewy Breakfast Bars",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1/2 cup chocolate flavored cereal puffs ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 teaspoons dry milk powder ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in baking pan.\nMelt the milk in the water.\nMix the ingredients with the butter in the following order: sugar, oatmeal, vanilla extract, eggs, flour, baking powder, cereal and milk. Pat into a greased 9 x 13 inch pan.\nBake at 325 degrees F (175 degrees C) for 15 minutes or until golden brown. Slice into desired sizes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Covered Cherry Cookies III",
        "ingredients": [
            "1 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup maraschino cherry juice ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup maraschino cherries, chopped ADVERTISEMENT",
            "18 large marshmallows ADVERTISEMENT",
            "36 walnut halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nSift together flour, soda and salt and set aside.\nCream shortening and gradually add 2/3 cup brown sugar. Blend in 1 unbeaten egg. Beat well. Stir in HALF of the flour mixture.\nAdd 1/4 cup maraschino cherry juice and 2 tablespoons milk. Stir in the remaining dry ingredients and mix well.\nBlend in 2 squares of melted chocolate, walnuts, and maraschino cherries. Drop by rounded teaspoons onto ungreased baking sheets.\nBake for 12 to 15 minutes.\nCut the marshmallows in half and place cut side down on hot cookies. Cool on rack and frost with Chocolate Covered Cherry Cookie Frosting from this site (see footnote for the link) and top each with a nut half.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rachel's Raspberry Punch",
        "ingredients": [
            "1 (12 fluid ounce) can frozen raspberry lemonade concentrate ADVERTISEMENT",
            "12 fluid ounces lemon-flavored vodka ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle lime-flavored beer ADVERTISEMENT",
            "12 fluid ounces water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pitcher or punch bowl, stir together the raspberry lemonade concentrate, lemon vodka, lime-flavored beer, and water until thoroughly combined.\n",
        "picture_link": "QHVwI/1uTFoNNntQkpZXszy4lHBjyqm"
    },
    {
        "title": "Savory Blue Cheese Cheesecake with Cherry Pear Compote and Cherry Balsamic Glaze",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "4 ounces freshly shredded Parmesan cheese ADVERTISEMENT",
            "1 teaspoon minced fresh thyme leaves ADVERTISEMENT",
            "1/2 teaspoon Kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup chopped toasted pecans ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "8 ounces blue cheese, crumbled ADVERTISEMENT",
            "6 ounces freshly shredded Parmesan cheese ADVERTISEMENT",
            "4 large eggs at room temperature ADVERTISEMENT",
            "1/4 cup heavy cream at room temperature ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 large sweet onions, thinly sliced ADVERTISEMENT",
            "2 pears - peeled, cored and chopped ADVERTISEMENT",
            "1/2 cup dried cherries ADVERTISEMENT",
            "2 tablespoons black cherry balsamic vinegar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "2 ounces freshly shredded Parmesan cheese ADVERTISEMENT",
            "4 ounces blue cheese, crumbled ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup candied pecans ADVERTISEMENT",
            "1 firm green pear, cored and thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat 1/2 cup butter, 4 ounces Parmesan cheese, thyme, 1/2 teaspoon salt, and 1/2 teaspoon black pepper with an electric mixer in a large bowl until light and fluffy. Add the flour, and mix on low until mixture resembles large crumbles. Turn dough out and shape into a log. Wrap dough with plastic wrap, and refrigerate until chilled, about 1 hour.\nPreheat an oven to 350 degrees F (175 degrees C). Slice the prepared dough into 1/4-inch thick pieces and place on a baking sheet.\nBake in the preheated oven until golden brown, about 22 minutes. Cool crackers on the sheets for 10 minutes before removing to cool completely on a wire rack. Reduce oven heat to 300 degrees F (150 degrees C). Line the bottom of a 10-inch springform pan with parchment paper, then butter the paper and the sides of the pan.\nPlace the toasted pecans, baked crackers, and 1 tablespoon melted butter in a food processor. Pulse until crumbled. Press the crumbs into the bottom of the prepared pan. Chill in the refrigerator while preparing the filling.\nBeat three 8-ounce packages of cream cheese, 8 ounces of blue cheese, and 6 ounces of Parmesan cheese with an electric mixer in a large bowl until smooth and creamy. Add the eggs one at a time, allowing each egg to blend into the mixture before adding the next. Beat in the heavy cream and 1 teaspoon pepper with the last egg. Pour the mixture into prepared pan.\nBake in the preheated oven for about 1 1/2 hours. The cheesecake is ready when the edges have nicely puffed and the surface of the cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken. Run the tip of a paring knife around the edges of the pan, set the pan on a wire rack, and allow the cheesecake to cool at room temperature for 1 hour before placing into the refrigerator, and cooling 4 hours to overnight.\nHeat the olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. Add in the chopped pears, dried cherries, balsamic vinegar, brown sugar, and 1/4 teaspoon salt. Cook and stir until pears are tender. Remove the onion and fruit from the skillet using a slotted spoon. Drain the juice back into the skillet, then mash the fruit in a bowl with a fork. Simmer the juice in the skillet over medium heat until thickened, about 5 minutes. Transfer glaze to a separate bowl.\nBeat the remaining 8-ounce package of cream cheese, 4 ounces of blue cheese, 2 ounces of Parmesan cheese, and 1/2 teaspoon of black pepper with an electric mixer in a bowl until smooth. Spread the cheese mixture over the cooled cheesecake. Sprinkle with candied pecans. Serve with cherry pear compote, sliced pear, and vinegar glaze on the side.\n",
        "picture_link": "IukkxTAAuYy1YaN1GzMfOYZE8rWGLyK"
    },
    {
        "title": "Southern Spiced Chocolate Chip Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup vegetable shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper or a silicone liner. Whisk together the flour, cinnamon, ginger, cloves, baking soda, and salt in a bowl until thoroughly combined.\nIn a large bowl, mash vegetable shortening and sugar together until smooth and creamy; mix in the egg and molasses. Stir the flour mixture into the molasses mixture to make a smooth dough, and mix in the chocolate chips. Drop by scant tablespoon or small dough scoop about 2 inches apart onto the prepared baking sheets.\nBake in the preheated oven until slightly golden brown, 10 to 12 minutes. Allow to cool on sheets 1 to 2 minutes before removing to finish cooling on wire racks.\n",
        "picture_link": "KkgLNDifGtT06eeZ8Kn5fFVen1G7Aci"
    },
    {
        "title": "Garlic Infused Broccoli Rabe and Chickpeas",
        "ingredients": [
            "1 bunch broccoli rabe, trimmed ADVERTISEMENT",
            "2/3 cup extra-virgin olive oil ADVERTISEMENT",
            "3 large cloves garlic, thinly sliced ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of heavily salted water to a boil. Add the broccoli rabe, and cook uncovered until the stems are tender, about 5 minutes. Drain in a colander.\nMeanwhile, heat the olive oil in a large skillet over medium-low heat. Stir in half of the garlic slices, and cook until browned, about 10 minutes. Remove and discard the garlic. Stir in the remaining garlic, then add the drained broccoli rabe. Sprinkle with red pepper flakes, and cook for 5 minutes. Stir in the garbanzo beans, and continue to cook and stir until the beans are hot. Season to taste with salt and black pepper before serving.\n",
        "picture_link": "RCJxmucuJdRW0CDKli0ZFnWCjTkIICW"
    },
    {
        "title": "Almond Sherbet",
        "ingredients": [
            "2 (10 ounce) cans sweetened condensed milk ADVERTISEMENT",
            "7 1/3 cups water ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 drop green food coloring, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the sweetened condensed milk and water together in a bowl, and stir in the sugar and almond extract until the drink is smooth and the sugar has dissolved. Mix in a drop or two of green food coloring, or as desired; chill to serve.\n",
        "picture_link": "tWAzTrELIBU58A0k92vka25dSnhmpBS"
    },
    {
        "title": "Boat Cruisin' Punch",
        "ingredients": [
            "1 1/2 cups orange juice ADVERTISEMENT",
            "1 (6 ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "1 (6 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "2/3 cup vodka, or to taste ADVERTISEMENT",
            "1 1/2 (6 ounce) cans water, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine orange juice, lemonade concentrate, limeade concentrate, vodka, and water in a large bowl; stir until blended. Serve over crushed ice.\n",
        "picture_link": "zLfL3C3pu5mdSSDObcS0M12v8C.GX52"
    },
    {
        "title": "Strawberry Freeze",
        "ingredients": [
            "1 cup buttermilk ADVERTISEMENT",
            "3 cups fresh strawberries ADVERTISEMENT",
            "1 cup white sugar, or to taste ADVERTISEMENT",
            "3 cups buttermilk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1 cup buttermilk, strawberries, and sugar into a blender. Cover, and puree until smooth. Pour in the remaining 3 cups buttermilk and blend until combined. Pour into ice pop molds and freeze or if using an ice cream maker, freeze according to manufacturer's directions.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hoppin' John in the Summertime",
        "ingredients": [
            "1 1/2 cups cooked long grain and wild rice mix ADVERTISEMENT",
            "1 (15 ounce) can black-eyed peas, rinsed and drained ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "1/2 cup finely chopped green bell pepper ADVERTISEMENT",
            "1/2 pound fresh crabmeat, picked over for cartilage and shell fragments ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/3 cup fresh lemon juice ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 dash hot pepper sauce, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 large tomato, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cooked rice mix with the black-eyed peas, red onion, green pepper, crabmeat, parsley, lemon juice, olive oil, hot sauce, salt, and black pepper in a large bowl. Serve with tomato slices.\n",
        "picture_link": "dzxP6fB66Mw.0315I65N0OIOmDDLSG."
    },
    {
        "title": "Turkey Filled Omelette",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons unsalted butter ADVERTISEMENT",
            "1 tablespoon chopped fresh shiitake mushroom ADVERTISEMENT",
            "1 shallot, finely chopped ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 fresh sage leaf, minced ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/4 cup shredded cooked turkey ADVERTISEMENT",
            "1 teaspoon dry vermouth (optional) ADVERTISEMENT",
            "2 eggs, chilled ADVERTISEMENT",
            "1 pinch ground white pepper ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 tablespoon creme fraiche ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon of olive oil and butter in a skillet over medium-low heat, and stir in the shiitake mushroom, shallot, salt, red pepper flakes, and sage. Cook and stir until the shallot is translucent, about 5 minutes. Mix in the turkey and vermouth, and stir for a minute or two just to heat; remove from heat.\nBeat the eggs with a fork in a bowl until well blended, and season with a pinch of salt and white pepper. Heat 2 teaspoons of olive oil in an omelette pan over medium heat until hot, and pour the beaten eggs into the pan. Use a spatula to gently stir the eggs just until they begin to set, 1 to 2 minutes; shake the pan to cover the bottom completely with egg. Smooth out the top of the partially set eggs with the spatula, cook just until the bottom is firm and the top is still slightly soft, and turn off the heat.\nSpoon turkey filling into the center of the omelette, filling about the middle third of the omelette; dot with small dollops of creme fraiche. Do not overfill omelet. With spatula, fold the upper third of the egg over the filling, and gently tip the skillet and shake the omelette towards the edge of the skillet. With spatula, fold the omelet over one more time, forming a loose cigar shape, and gently tip the omelet onto a serving plate.\n",
        "picture_link": "qokkmvsnFdZ3QlpyimMum6G6L73LonG"
    },
    {
        "title": "Chef John's Miso-Glazed Barramundi",
        "ingredients": [
            "2 tablespoons yellow miso paste ADVERTISEMENT",
            "2 tablespoons seasoned rice vinegar ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 (5 ounce) barramundi (Asian sea bass) fillets ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk miso paste, rice vinegar, brown sugar, and soy sauce together in a bowl until glaze is smooth.\nPlace barramundi fillets, rounded-side up, onto a plate; spread 1/2 of the glaze onto rounded side of fish.\nHeat oil over high heat in a nonstick skillet. Place fish, glazed-side down, in hot skillet and spread remaining glaze over other side; cook until slightly white around the edges, 1 to 2 minutes. Flip fish and cook until flaky and white, 1 to 2 minutes more.\n",
        "picture_link": "lOJqwh55PdrbgfYcT4j2KHNeFvrmG0u"
    },
    {
        "title": "Cut-Out Sugar Cookies",
        "ingredients": [
            "4 egg yolks ADVERTISEMENT",
            "1/2 cup almond paste, broken into pieces ADVERTISEMENT",
            "2 cups unsalted butter, chopped and softened ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 3/4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg yolks and almond paste together in a bowl using a mixer on medium speed until crumbly, about 2 minutes. Add butter, sugar, and salt to almond paste mixture and beat until creamy, about 3 minutes; reduce speed to low and gradually beat in flour just until blended.\nDivide dough into 4 pieces and flatten each into a disk on a lightly floured surface. Wrap each disk in plastic wrap and chill for 2 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nPlace 1 dough piece on a lightly floured surface and roll into 1/4-inch thickness using a floured rolling pin. Cut dough into shapes using floured cookie cutters. Arrange cookies 1-inch apart on a large baking sheet. Form any remaining scraps into a disk and refrigerate.\nBake in the preheated oven until lightly browned, 10 to 12 minutes. Transfer cookies to a wire rack to cool. Repeat with remaining dough.\n",
        "picture_link": "v7t.SveEQy8Ro7Mh/XRZXu/Ezzlf9jm"
    },
    {
        "title": "Nani's Mashed Potato Casserole",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 teaspoons instant minced onion ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground thyme ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 cups instant mashed potato flakes ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir water, butter, minced onion, parsley, salt, and thyme together in a saucepan; bring to a boil. Remove from heat and stir in milk. Mix in potato flakes, add sour cream, and beat until fluffy. Pour potato mixture into a casserole dish and sprinkle Cheddar cheese over the top.\nBake until cheese is melted and bubbling, 15 to 20 minutes.\n",
        "picture_link": "o88i.0btdYInXGE71sQAnNlZ8S6mRX2"
    },
    {
        "title": "Leftover Ham Salad",
        "ingredients": [
            "8 ounces diced cooked ham ADVERTISEMENT",
            "1 cup finely diced celery ADVERTISEMENT",
            "1 cup finely diced red onion ADVERTISEMENT",
            "1/3 cup mayonnaise, or more to taste ADVERTISEMENT",
            "1 teaspoon dried rosemary leaves, crumbled ADVERTISEMENT",
            "2 cups torn romaine lettuce, or to taste ADVERTISEMENT",
            "1/4 cup ranch dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ham, celery, and red onion in a large bowl; add mayonnaise and rosemary and stir to coat.\nRefrigerate ham mixture for at least 1 hour.\nPut lettuce into a large bowl. Spoon ham mixture over the lettuce. Serve with ranch dressing on the side.\n",
        "picture_link": "lqIPcp/lIr29b98mlqe/0VslS/Rz7.m"
    },
    {
        "title": "Easy Warm Chickpea Salad",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "2 (14 ounce) cans chickpeas (garbanzo beans), drained ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon chopped fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat. Cook and stir onion in the hot oil until softened, 5 to 10 minutes. Add chickpeas and garlic to onion; cook and stir until heated through, about 5 minutes. Mix red pepper flakes, lemon juice, salt, and pepper into chickpea mixture; cook and stir for 3 minutes more. Stir parsley and mint into salad.\n",
        "picture_link": "yMTjbgDduSX9ul.rl1G01echx1HYid6"
    },
    {
        "title": "Pomegranate Dip",
        "ingredients": [
            "1 large pomegranate, peeled and seeds separated ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently stir pomegranate seeds into the softened cream cheese so as to keep the seeds from bursting; shape into a ball.\n",
        "picture_link": "IpR7rchcJZHZmj1KN8wzV5w/cFaWoQi"
    },
    {
        "title": "Grandma's Carrot Salad ",
        "ingredients": [
            "1 pound shredded carrots ADVERTISEMENT",
            "1 1/4 cups raisins ADVERTISEMENT",
            "2 tablespoons mayonnaise, or to taste ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix carrots and raisins together in a large bowl. Whisk mayonnaise, lemon juice, and salt together in a small bowl until smooth. Pour lemon juice mixture over carrot mixture and stir until carrots are completely coated. Refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "Sv4vuGRejjuOhTBaeVSZIgRmXRS9UoC"
    },
    {
        "title": "Dutch Apple Baby",
        "ingredients": [
            "2/3 cup Mott's® Original Applesauce ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "4 tablespoons melted butter, divided ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon granulated sugar ADVERTISEMENT",
            "Pinch of salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons confectioners' sugar (optional) ADVERTISEMENT",
            "Streusel Topping: ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 tablespoons granulated sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nHeat applesauce in a small saucepan over medium heat until hot but not boiling. Pour applesauce into blender. Add the eggs. Blend until combined; about 5 seconds. Add vanilla, sugar, salt and flour. Blend until evenly mixed. Add two tablespoons of melted butter. Blend another 30 seconds.\nHeat oven-proof skillet on medium heat. Pour a tablespoon of melted butter into skillet and swirl it around to coat the bottom and sides of the pan. Immediately pour the batter into the skillet; place in middle rack of oven.\nBake until golden brown around the edges and the pancake is puffed, about 20 minutes.\nBrush the last tablespoon of melted butter evenly over pancake. Sift powdered sugar over top, if desired.\nMix together 2 tablespoons flour, 1/4 cup sugar, and 1/2 teaspoon cinnamon in a small bowl. Cut in butter until mixture resembles coarse crumbs. Sprinkle over the Dutch Baby. Serve immediately.\n",
        "picture_link": "UOVcU9zlG1VZMpdre5STQAplj.dkzhq"
    },
    {
        "title": "Beef on Weck, Part 2: Roast Beef",
        "ingredients": [
            "2 pounds beef top-sirloin roast ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 teaspoons all-purpose flour, or as needed ADVERTISEMENT",
            "2 1/2 cups cold beef broth ADVERTISEMENT",
            "2 teaspoons aged balsamic vinegar, or to taste ADVERTISEMENT",
            "4 kummelweck dinner rolls, split ADVERTISEMENT",
            "1/4 cup extra-hot prepared horseradish, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season beef with salt and black pepper.\nHeat oil in a large skillet over medium-high heat. Cook beef roast in hot oil until browned on all sides on each side, 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read 125 degrees F (52 degrees C). Transfer beef to a plate to rest.\nRemove skillet from heat and whisk flour into skillet until flour taste cooks off, about 1 minute. Pour cold beef broth into skillet; place skillet over medium-high heat. Stir balsamic vinegar, black pepper, and any accumulated juices from the roast beef plate into beef broth mixture; cook until jus reduces slightly, about 5 minutes. Season with salt.\nSlice sirloin as thinly as possible against the grain. Pile meat onto the base of each roll. Spread a thick layer of horseradish on the top bun and place top bun over meat. Serve with jus for dipping.\n",
        "picture_link": "1uBzgFbWowct8IDFTGdVNa6cI4IhYL2"
    },
    {
        "title": "Creamy Cilantro Lime Dressing",
        "ingredients": [
            "1 cup buttermilk ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/3 bunch fresh cilantro, or to taste ADVERTISEMENT",
            "1 fresh tomatillo, husk removed, or more to taste ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1/2 jalapeno pepper, stemmed and seeded, or more to taste ADVERTISEMENT",
            "1 (1 ounce) package dry ranch dressing mix (such as Hidden Valley Ranch®) ADVERTISEMENT",
            "1 clove garlic, peeled ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend buttermilk, mayonnaise, cilantro, tomatillo, lime juice, jalapeno pepper, ranch dressing mix, garlic, and black pepper together in a blender until smooth. Refrigerate until flavors blend, at least 1 hour.\n",
        "picture_link": "WimwNKftm6CDKp.58sIwRn6CecZZ8uS"
    },
    {
        "title": "World's Best Sweet Potato Pie",
        "ingredients": [
            "3 large sweet potatoes ADVERTISEMENT",
            "1 cup butter (such as Land O'Lakes®), melted ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk (such as PET®) ADVERTISEMENT",
            "1 cup white sugar, or to taste ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "3 pie shells, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sweet potatoes into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, 40 to 50 minutes. Drain water, peel sweet potatoes, and mash in a bowl.\nPreheat oven to 425 degrees F (220 degrees C).\nMix butter and eggs together in a bowl until smooth; stir into mashed sweet potatoes. Mix milk, sugar, flour, vanilla extract, nutmeg, baking powder, and lemon juice into sweet potato mixture; pour into the 3 pie shells.\nBake in the preheated oven for 10 minutes. Lower oven temperature to 350 degrees F (175 degrees C) and continue to bake until a toothpick inserted in the center of a pie comes out clean, about 40 minutes more. Cool pies for 15 to 30 minutes before refrigerating to cool completely, 1 to 2 hours.\n",
        "picture_link": "R7BXEom6fs5LvuJFKO1A9yp0PdaJnD6"
    },
    {
        "title": "Azteca Cocoa Rice Pudding",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "2 cups white rice ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, rice, and cinnamon in a large pot; bring to a boil. Reduce heat to medium low, cover pot, and simmer until all the water has been absorbed, about 20 minutes.\nMix milk, sugar, cocoa powder, cayenne pepper, and vanilla extract into rice mixture, increase heat to high; cook, stirring constantly, until thickened, 5 to 10 minutes.\nRemove pot from heat and pour pudding into a large glass bowl; let sit for 30 minutes before serving.\n",
        "picture_link": "NhPC4sixHGbeV1XIuBVBlrfgOvRmxnC"
    },
    {
        "title": "Mock and Cheese",
        "ingredients": [
            "2 cups chopped cauliflower ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "2 cups grated Cheddar cheese ADVERTISEMENT",
            "1 (12 ounce) package extra-firm tofu, chopped ADVERTISEMENT",
            "1 (4 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "1/2 teaspoon sea salt, or to taste ADVERTISEMENT",
            "1 cup diced cooked ham ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover the saucepan, and steam cauliflower until tender, 2 to 6 minutes.\nMelt butter in a saucepan over medium heat. Cook onion in butter, stirring regularly, until caramelized, 15 to 20 minutes. Remove saucepan from heat. Stir Cheddar cheese, tofu, cream cheese, garlic powder, white pepper, mustard powder, and sea salt with the onion; add steamed cauliflower and ham and stir. Transfer the mixture into a casserole dish. Sprinkle Parmesan cheese over the top of the dish.\nBake in preheated oven until heated through, about 10 minutes.\n",
        "picture_link": "x8dq4cnd78GVxk1tul0oQMiFHU17SCC"
    },
    {
        "title": "Pina Colada Fruit Jellies",
        "ingredients": [
            "1 cup granulated sugar ADVERTISEMENT",
            "3/4 cup Mott's® Natural Applesauce ADVERTISEMENT",
            "1 (3 ounce) package pineapple-flavored gelatin mix (such as Jell-O®) ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "3 teaspoons freshly squeezed lime juice ADVERTISEMENT",
            "3/4 teaspoon coconut extract ADVERTISEMENT",
            "1/2 cup granulated sugar for coating ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray an 8x8-inch baking dish with non-fat cooking spray. Place dish in refrigerator.\nCombine granulated sugar, applesauce, pineapple-flavored gelatin, unflavored gelatin, lime juice, and coconut extract in saucepan.\nBring to a boil over medium heat, stirring constantly. Boil for about 1 minute. Remove saucepan from heat, and cool at room temperature for about 10 minutes. (Do not pour boiling hot liquid into a chilled glass dish.)\nRemove baking dish from refrigerator, and pour warm mixture into the cooled baking dish. Refrigerate until firm, 1 to 2 hours.\nWhen firm, remove from refrigerator, lift one side with a spatula, and turn out onto a cutting board or parchment paper sprinkled with granulated sugar.\nUsing a sharp knife, cut gelatin into squares or use a small cookie cutter for decorative shapes. Coat the jellies on all sides with sugar. Place on a rack, and allow to dry overnight.\nStore in an airtight container.\n",
        "picture_link": "JgL6UPfHbc3ydj1TQuOj7/Wr56BO.be"
    },
    {
        "title": "Holiday Painted Cookies",
        "ingredients": [
            "2 1/3 cups flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon McCormick® Cinnamon, Ground ADVERTISEMENT",
            "1/4 teaspoon McCormick® Nutmeg, Ground ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 teaspoons McCormick® Pure Vanilla Extract ADVERTISEMENT",
            "2 (16 ounce) containers white frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, baking soda, cinnamon, nutmeg and salt in medium bowl. Set aside. Beat sugar and butter in large bowl with electric mixer on medium speed until light and fluffy. Add egg and vanilla; mix well. Gradually stir in flour mixture on low speed until well mixed. Refrigerate 2 hours or until firm.\nPreheat oven to 375 degrees F. Roll dough on generously floured surface to 1/4-inch thickness. Cut out shapes with holiday cookie cutters. Place on ungreased baking sheets.\nBake 8 to 10 minutes or until lightly browned. Cool on baking sheets 1 minute. Remove to wire racks; cool completely.\nSpoon 1 container of the frosting into medium microwavable bowl. Microwave on HIGH 20 to 30 seconds, stirring every 10 seconds. (Frosting should be a pourable consistency.) Dip tops of cookies into frosting. Microwave remaining container of frosting as needed. Place frosted cookies on wire rack set over foil-covered baking sheet. (The baking sheet will catch drips.) Let stand 10 minutes or until frosting is dried.\nPrepare desired colors of Holiday Flavor Paints (see tips). Using small clean paint brushes, paint designs on cookies.\n",
        "picture_link": "A0lVNPzKNaxZJLZAER69kswE2LOoDb2"
    },
    {
        "title": "Orange, Fig, and Gorgonzola Salad",
        "ingredients": [
            "2 heads romaine lettuce, chopped ADVERTISEMENT",
            "2 oranges - peeled, pith removed, and cut into segments ADVERTISEMENT",
            "1/2 cup crumbled Gorgonzola cheese ADVERTISEMENT",
            "2 fresh figs, cut into 1-inch cubes ADVERTISEMENT",
            "1/4 cup vinaigrette dressing, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lettuce, oranges, Gorgonzola cheese, and figs in a large bowl. Drizzle dressing over salad and toss to coat.\n",
        "picture_link": "vs9aCd8bEdFVJJxdi92w5xYr398fv7q"
    }
]