[
    {
        "title": "Strawberry Oatmeal Cream Cheese Bread",
        "ingredients": [
            "1/3 cup milk ADVERTISEMENT",
            "1/3 cup strawberries, mashed ADVERTISEMENT",
            "1/3 cup cream cheese, diced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1 1/2 cups bread flour ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order suggested by the manufacturer. Start.\n",
        "picture_link": "7nNyDIJLcLUgEDOgshfslq.zQlhvaUy"
    },
    {
        "title": "Tina's Avocado Salsa",
        "ingredients": [
            "2 (16 ounce) jars salsa ADVERTISEMENT",
            "2 avocados - peeled, pitted and diced ADVERTISEMENT",
            "1 cup chopped green onions ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 cup chopped fresh cilantro ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (14.5 ounce) package tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine salsa, avocado, green onions, garlic, cilantro and salt and pepper. Cover and refrigerate for 1 hour. Serve with tortilla chips.\n",
        "picture_link": "tIgXejALxfhgZTcdp/9Gnehdn7JUP4W"
    },
    {
        "title": "Suzy's Potato Skins",
        "ingredients": [
            "10 potatoes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1 cup chopped tomatoes ADVERTISEMENT",
            "1 (4 ounce) can diced green chiles ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPierce potatoes deeply with a fork and bake for 45 minutes or until tender.\nIncrease the heat of the oven to 375 degrees F (190 degrees C).\nWhen the potatoes are cool enough to handle cut them in half lengthwise and scoop out nearly all of the potato (reserve rest of potato for a later use of your choice). Salt and pepper the potato skins to taste. Sprinkle green onions, tomatoes, chilis and cheese into the potato skin. Arrange potato skins on a baking sheet.\nBake 10 minutes, or until cheese has melted. You may want to cut the baked skins in half crosswise before serving for tidy eating. Serve with sour cream on the side, for people to scoop onto their potato skins if they'd like.\n",
        "picture_link": "MhFo2vpATTUE2e/TM7bAkpy/s4ok4ci"
    },
    {
        "title": "Easy a la King",
        "ingredients": [
            "3 cups cooked, diced chicken meat ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "2 (4.5 ounce) cans mushrooms, drained ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, combine the chicken, milk, soup, water, spinach or broccoli, mushrooms, hot pepper sauce and salt and pepper to taste. Cook, stirring, for about 10 to 15 minutes or until heated through. Serve over cooked egg noodles, if desired.\n",
        "picture_link": "4MiDdyLiJGy9FIa8XPRjaxdrvtTkBQG"
    },
    {
        "title": "Yummy Fruit Pizza",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "32 large marshmallows ADVERTISEMENT",
            "5 cups crisp rice cereal ADVERTISEMENT",
            "8 ounces cream cheese ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "16 small strawberries, halved ADVERTISEMENT",
            "1 banana, peeled and sliced ADVERTISEMENT",
            "2 kiwis, peeled and chopped ADVERTISEMENT",
            "2 tablespoons apricot jam ADVERTISEMENT",
            "1 1/2 teaspoons water ADVERTISEMENT",
            "2 teaspoons heavy cream ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan combine the butter and marshmallows. Stir over low heat until melted. Remove pan from heat and stir in the crisp rice cereal. Prepare a pizza pan by lightly coating with vegetable oil spray. Press the cereal mixture evenly onto the pizza pan. Place into the refrigerator to cool.\nTo make the sauce, combine cream cheese, confectioners' sugar and cocoa in a small bowl. Beat until smooth and creamy. Spread evenly over the pizza crust. Arrange the strawberries, bananas, and kiwi slices over the crust to look like pizza toppings, or make a fancy design.\nIn a small cup, mix together the apricot jam with the water. Dab onto the fruit with a brush. This will keep the fruit from turning brown. Whip the heavy cream, sugar, and vanilla until stiff, drop dabs of whipped cream onto the pizza. Slice like a pizza, but thinner. This is a very rich dessert.\n",
        "picture_link": "1eIxXwDZTBS0iUO1DR2yBTiuplTAQFq"
    },
    {
        "title": "Capirotada (Mexican Bread Pudding)",
        "ingredients": [
            "1 (1 pound) loaf white bread ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup pineapple chunks, drained ADVERTISEMENT",
            "4 ounces Colby longhorn cheese ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "10 cinnamon sticks ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine water, cinnamon, and sugar in a medium saucepan. Bring to a boil and let simmer for about 15 minutes. Set aside.\nToast bread and butter each slice on one side. Arrange toast in a single layer in a large casserole dish. Sprinkle bread with raisins, nuts, and pineapple. Slice cheese and place over this mixture. Repeat layers until all bread is used, making sure enough cheese is left over for the top. Pour the cinnamon syrup mixture over everything in baking dish.\nBake for 30 minutes. Remove from oven and cool for at least 15 minutes.\n",
        "picture_link": "1X7WxME.VwJV8dyLIsPe7jy/rlP/o0O"
    },
    {
        "title": "Vendakka Paalu",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 bell pepper, seeded and sliced into strips ADVERTISEMENT",
            "2 jalapeno peppers, seeded and sliced into strips ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground red pepper ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon cumin seeds ADVERTISEMENT",
            "1/8 teaspoon ground cardamom ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1 small tomato, sliced ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "1 cup sliced okra ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet; cook and stir the bell pepper in the hot oil until softened slightly, about 3 minutes. Stir the jalapeno peppers, ginger, garlic, and bay leaves into the bell pepper; cook until fragrant, about 2 to 3 minutes more. Season with the coriander, red pepper, turmeric, cumin seeds, cardamom, black pepper, and cinnamon; cook and stir another 2 minutes. Add the tomato slices and raisins to the mixture; continue cooking 3 more minutes. Mix the okra thoroughly into the mixture to coat with the spices.\nStir the coconut milk and water together in a small bowl; pour into the mixture. Cover the skillet and cook covered until the okra is tender, 8 to 10 minutes. Add water if needed to keep moist. Season with salt. Serve warm.\n",
        "picture_link": "qJByyfj2UF81nlrT.a6/.F/O6EF37e."
    },
    {
        "title": "Blame the Dog Bean Casserole (Kielbasa and Bean Dish)",
        "ingredients": [
            "1 pound fully cooked kielbasa or Polish sausage, cut into 1/4-inch slices ADVERTISEMENT",
            "1 pound smoked sausage, sliced ADVERTISEMENT",
            "1 (28 ounce) can baked beans ADVERTISEMENT",
            "1 (15.5 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped celery ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nCombine sausages, baked beans, kidney beans, tomato sauce, ketchup, red wine, onion, celery, garlic, mustard, and Worcestershire sauce in a 3-quart baking dish. Bake in preheated oven until hot and bubbly, about 1 hour.\n",
        "picture_link": "Cm96I0BQCXrDMi2CVuoDAYq3uNnJBKG"
    },
    {
        "title": "Garbanzo Bean and Sausage Stew",
        "ingredients": [
            "3 cups dry garbanzo beans ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 pounds sweet Italian pork sausage, cut into 1-inch pieces ADVERTISEMENT",
            "1 bell pepper, cut into bite-sized pieces ADVERTISEMENT",
            "1/2 large onion, thinly sliced ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with garlic and herbs ADVERTISEMENT",
            "4 cups chicken stock, or more if needed ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "2 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup pipette pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the garbanzo beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Or, bring the beans and water to a boil in a large pot over high heat. Once boiling, turn off the heat, cover, and let stand 1 hour. Drain and rinse before using.\nHeat olive oil in a large skillet or Dutch oven over medium-high heat, then stir in the sausage. Cook and stir until the sausage is evenly browned and no longer pink. Remove sausage and set aside, leaving any grease from the sausage in the skillet. Return the skillet to the stove and reduce the heat to medium, then add the bell pepper and onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes; stir in the garlic. Continue cooking and stirring until the onion is golden brown, about 5 more minutes.\nReduce heat to medium-low. Stir in the flour until the mixture becomes paste-like and light golden brown, about 5 minutes. Gradually stir the tomatoes and chicken stock into the flour mixture, and bring to a simmer over medium heat. Cook and stir until the mixture is thick and smooth, 10 to 15 minutes. Season with basil, parsley, red pepper flakes, salt, and pepper. Stir in the sausage. Cover and cook over low heat for 2 hours, then add the prepared garbanzo beans. Cook for an additional hour.\nMeanwhile, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the pipette pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Stir the pasta into the stew, adding more chicken stock, if necessary.\n",
        "picture_link": "q42li4FHTlNLgpdBy7NIpSHn5sccgJO"
    },
    {
        "title": "Punjabi Sukha Urad Dal",
        "ingredients": [
            "1 cup skin-on, split black lentils (urad dal) ADVERTISEMENT",
            "2 tablespoons cooking oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 green chile peppers, cut into large chunks ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the lentils into a large container and cover with several inches of cool water; let soak 4 hours to overnight. Drain and rinse.\nHeat the oil in a heavy-bottomed sauce pan over medium heat; cook the onion, green chile peppers, garlic, and ginger in the hot oil until the onions are golden brown, about 5 minutes. Stir the lentils into the onion mixture with 1 cup water; season with salt. Reduce heat to low and simmer until the lentils are tender, about 30 minutes. Stir the tomato, garam masala, and turmeric into the mixture. Cook until the lentils are cooked through, about 10 minutes more. Garnish with the cilantro to serve.\n",
        "picture_link": "MjyKSyLPylYfw8J7gcdlRlP9gQRR8ae"
    },
    {
        "title": "Besan (Gram Flour) Halwa",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "3/4 cup ghee (clarified butter) ADVERTISEMENT",
            "1 cup chickpea flour (besan) ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the milk and water to a simmer in a saucepan over medium-low heat; stir the cardamom into the mixture. Set aside.\nMelt the ghee in a shallow skillet over medium heat; stir the chickpea flour into the melted ghee and cook until fragrant, about 10 minutes. Add the sugar and stir to incorporate. Slowly pour the milk mixture into the skillet while stirring to avoid lumps. Continue cooking and stirring until the halwa pulls away from the sides of the pan, 10 to 15 minutes. Serve hot or spread the mixture into a rimmed plate and allow to cool. Cut into squares and serve.\n",
        "picture_link": "nrUSuCXztSXcYOUdn9MEdPZO2wKKAMG"
    },
    {
        "title": "Cranberry Red Wine Relish",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup dry red wine ADVERTISEMENT",
            "1 (12 ounce) package fresh cranberries, rinsed and sorted ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "2 tablespoons orange zest, cut into slivers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sugar with red wine in a medium saucepan, and bring to a boil over medium heat. Add the cranberries, cinnamon stick and orange peel. Bring the mixture back to a boil, reduce heat, and simmer, stirring often, for 10 to 15 minutes, until most of the cranberries have burst.\nRemove from heat, allow relish to cool slightly, and spoon into sterilized glass jelly jars with tight-fitting lids. Store in refrigerator.\n",
        "picture_link": "WGvsjlAMlQ1hwuX0D9x1oLjAQLlrvkK"
    },
    {
        "title": "Sophie's Shepherds Pie",
        "ingredients": [
            "4 large baking potatoes, peeled and cubed ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 pounds ground lamb ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "12 button mushrooms, sliced ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 (16 ounce) can baked beans ADVERTISEMENT",
            "1 (12 ounce) can canned diced tomatoes ADVERTISEMENT",
            "3 tablespoons brown gravy mix (optional) ADVERTISEMENT",
            "1 (15 ounce) can carrots, drained (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nPlace the potatoes into a saucepan and fill with enough water to cover. Bring to a boil, then cook over medium heat until tender enough to pierce with a fork, about 10 minutes. Drain and mash with butter and milk to your desired texture.\nMeanwhile, crumble the ground lamb into a large skillet. Cook and stir until no longer pink. Season with Worcestershire sauce and beef bouillon. Add the mushrooms and onion; continue to cook and stir until tender. Transfer the contents of the skillet to a large casserole dish.\nMix the baked beans, diced tomatoes, gravy mix and carrots in with the lamb. Dollop big blobs of mashed potatoes over the top and carefully spread evenly to cover the entire top. Rake over it with a fork to create a crispy texture on top when it browns.\nBake for 10 minutes in the preheated oven, until the top is browned and crisp.\n",
        "picture_link": "N3UF1WpdrNiAnG7Ffoa3Xmkfjb2.5Ja"
    },
    {
        "title": "Traditional Swedish Pepparkakor",
        "ingredients": [
            "3 3/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar, packed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons dark corn syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift the flour together with the baking soda, cinnamon, cloves, ginger, and cardamom in a mixing bowl.\nBeat the butter together with the white and brown sugars in a mixing bowl until light and fluffy. Mix in the egg and corn syrup until smooth. Gradually stir in the flour mixture until evenly blended. Divide the dough into 4 equal portions and wrap tightly each with plastic wrap. Refrigerate at least 1 hour, or overnight.\nPreheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets.\nUsing 1 portion at a time, work on a floured surface and roll out dough to 1/8 inch thick. Cut into shapes with cookie cutter, and place 1 inch apart on prepared baking sheets.\nBake in preheated oven until set, about 5 minutes. Cool completely. Store in tightly covered tins.\n",
        "picture_link": "MaaBKf114/fIFuT.RkjZ4mXgSCqFeGC"
    },
    {
        "title": "Almond and Baby Bok Choy Asian Salad",
        "ingredients": [
            "1/2 cup canola oil ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon mirin (Japanese sweet rice wine) ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "1/2 head romaine lettuce, chopped ADVERTISEMENT",
            "2 heads baby bok choy, cleaned and sliced ADVERTISEMENT",
            "1 carrot, cut into matchsticks ADVERTISEMENT",
            "1/4 cup toasted sliced almonds ADVERTISEMENT",
            "1/2 cup croutons ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the oil, vinegar, soy sauce, mirin, and sesame seeds in a small bowl, then set aside. Toss together the romaine, bok choy, carrot, almonds, and croutons in a large bowl. Pour the dressing over the salad, toss to coat, and serve immediately.\n",
        "picture_link": "Pw.XEQViaN.xnXGtsi43IK/7HlHSI2K"
    },
    {
        "title": "BLT Bacon Bowls",
        "ingredients": [
            "18 slices bacon ADVERTISEMENT",
            "1 1/2 cups cherry tomatoes, halved ADVERTISEMENT",
            "1 head butter lettuce - rinsed, and torn ADVERTISEMENT",
            "1 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Turn two muffin tins upside down, and cover the outside of 9 cups with aluminum foil. Set aside.\nWeave the bacon into a mat that is 9 strips across and 9 strips wide. Cut into 9 even squares. Place each square over one of the foil covered muffin cups.\nBake the bacon in the preheated oven until crisp, about 10 minutes. Remove the bacon cups from the pan and allow to cool completely. Once cooled, fill each with some lettuce and tomato halves. Top with shredded Cheddar cheese. Serve at room temperature.\n",
        "picture_link": "Bu60d9H6SwcnDDjtCqiJ4p.vuLOQX2e"
    },
    {
        "title": "Toasted Almond Green Bean Salad",
        "ingredients": [
            "2 pounds fresh green beans, trimmed ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beans in a large saucepan, and cover with water. Boil beans until soft but still bright green, about 15 minutes. Transfer beans immediately to an ice water bath to cool. Drain after 3 minutes. Place beans in large bowl. Toss with balsamic vinegar, stir in th olive oil.\nPlace the almonds in a heavy skillet over low heat; cook until golden. Toss almonds into the green bean salad. Serve at room temperature or chilled.\n",
        "picture_link": "GQ5t9ecFcH94HmjLS8v98V4DJtfUfQK"
    },
    {
        "title": "Flat Iron Steak Simplicity!",
        "ingredients": [
            "2 (8 ounce) flat iron steaks ADVERTISEMENT",
            "1/2 teaspoon lemon pepper seasoning, or to taste ADVERTISEMENT",
            "1/2 teaspoon onion powder, or to taste ADVERTISEMENT",
            "1/2 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the steaks with lemon pepper, onion powder and garlic powder on both sides. Wrap in plastic wrap and marinate for at least 2 hours in the refrigerator.\nPreheat the grill for medium-high heat and allow the steaks to come to room temperature.\nUnwrap steaks and place on the preheated grill. Cook to your desired degree of doneness, about 3 minutes per side for medium rare. Allow steaks to rest for a few minutes before serving.\n",
        "picture_link": "sSBziF4nED6dB.F88X5WqhrWrVusbFO"
    },
    {
        "title": "Avocado and Orange Sandwich",
        "ingredients": [
            "8 (1 ounce) slices whole-wheat bread ADVERTISEMENT",
            "1 large navel orange, peeled and cut into 1/4-inch thick slices ADVERTISEMENT",
            "2 large avocados - peeled, pitted, and sliced ADVERTISEMENT",
            "1 (5 ounce) package alfalfa sprouts ADVERTISEMENT",
            "2 teaspoons balsamic vinaigrette ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange four of the bread slices on a flat surface; top each slice with two slices of orange, even amounts of avocado slices, and even amounts of sprouts. Sprinkle each sandwich with 1/2 teaspoon of balsamic vinaigrette. Top each with remaining bread slices and serve.\n",
        "picture_link": "D8Pge8P/ZToRrOUHL5Rb1zdA/IY5DAu"
    },
    {
        "title": "Chicken Pa Nang",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves, thinly sliced ADVERTISEMENT",
            "1 teaspoon red curry paste ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1 red bell pepper, cut into strips ADVERTISEMENT",
            "1 green bell pepper, cut into strips ADVERTISEMENT",
            "1 small onion, cut into strips ADVERTISEMENT",
            "1 (10 ounce) can coconut milk ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large skillet over medium heat. Stir in chicken, and cook until the pieces are no longer pink in the center, about 5 minutes. Remove chicken, then stir in the red curry paste and sugar; cook and stir for 1 minute. Add the bell peppers and onion to the pan, and cook for 2 minutes. Pour in the coconut milk, return the chicken to the pan, and bring to a simmer over medium-high heat. Cook until the onions and peppers are tender, about 5 minutes. Stir in the fish sauce and serve.\n",
        "picture_link": "TB0Vjy/muliqVT3fIGGsqHTRyrt1vlu"
    },
    {
        "title": "Barb's Famous Broccoli and Cheese",
        "ingredients": [
            "5 (10 ounce) packages frozen broccoli florets ADVERTISEMENT",
            "2 (1 pound) loaves processed cheese (i.e. Velveeta®), cubed ADVERTISEMENT",
            "1 pint sour cream ADVERTISEMENT",
            "1 cup margarine, melted ADVERTISEMENT",
            "2 1/2 cups coarsely crushed buttery round crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace the broccoli into a large saucepan and fill with about 1 inch of water. Bring to a boil, and cook just until tender, about 3 minutes. Drain and transfer to a 4 quart casserole dish.\nIn a separate pan, combine the processed cheese and margarine. Cook over medium heat, stirring constantly, until cheese has melted. Remove from the heat and stir in the sour cream. Pour evenly over the broccoli in the casserole. Stir together the crackers and margarine; spread over the top of everything.\nBake in the preheated oven until the top is browned, about 25 minutes.\n",
        "picture_link": "CNHgWKtmY3LxiY88b3LZhNL6p7Q6au."
    },
    {
        "title": "Jenn's Catfish Sandwich Sauce",
        "ingredients": [
            "2 cups mayonnaise ADVERTISEMENT",
            "1/2 cup prepared brown mustard ADVERTISEMENT",
            "2 teaspoons dill pickle juice ADVERTISEMENT",
            "2 teaspoons ketchup ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 canned chipotle pepper ADVERTISEMENT",
            "1 teaspoon adobo sauce from canned chipotle peppers ADVERTISEMENT",
            "2 cloves garlic, peeled ADVERTISEMENT",
            "1/4 cup fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, combine the mayonnaise, mustard, pickle juice, ketchup, Worcestershire sauce, chipotle pepper, adobo sauce, garlic and parsley until smooth.\n",
        "picture_link": "wlfnhA4ayxyqHBiyMP0duFu4CXLNlwC"
    },
    {
        "title": "Top Shelf Margaritas on the Rocks",
        "ingredients": [
            "2/3 cup sugar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "1 1/2 cups fresh lemon juice ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "2 cups ice cubes ADVERTISEMENT",
            "2 cups premium tequila ADVERTISEMENT",
            "1 cup Cointreau ADVERTISEMENT",
            "1/2 cup lime juice ADVERTISEMENT",
            "16 lime wedges ADVERTISEMENT",
            "coarse kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make a simple syrup by stirring together and bringing 2/3 cup sugar and 1/3 cup water to a boil until the sugar dissolves; set aside to cool.\nMake the sour mix by briskly stirring together the 2 1/4 cups water, lemon juice, 1/4 cup sugar, and egg white; set aside.\nCombine the ice cubes, tequila, Cointreau, lime juice, 1 ounce of the simple syrup, and 1/2 cup of the sour mix in a pitcher; stir vigorously to infuse the ice, 8 to 15 seconds.\nRun a lime wedge along the rim of an 8-ounce glass. Spread the kosher salt onto a plate and dip the glass rims in the salt to coat; add ice if desired. Strain the mixture from the cocktail shaker into the glass to serve.\n",
        "picture_link": "9CM6TuwoY1EdXa3vwIhpxCNoZgS5J6O"
    },
    {
        "title": "Codfish with Cream",
        "ingredients": [
            "12 ounces dried salted cod fish ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "4 large potatoes, peeled and cut into very small cubes ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 large onion, sliced thin ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 cup hot milk ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 1/3 cups heavy cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2/3 cup heavy cream ADVERTISEMENT",
            "1 ounce grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak the dried salted cod in cold water with the skin side up for 24 hours, changing the water about 4 times. Drain and discard the water.\nPreheat an oven to 350 degrees F (175 degrees C).\nPlace the cod in a pan with enough water to cover; bring to a boil and cook for 10 minutes. Remove the cod from the pan; remove and discard the skin and bones. Cut the cod into chunks and set aside.\nHeat 1/2 inch vegetable oil in large skillet over medium-high heat. Working in batches if necessary, fry the potatoes in the hot oil until just cooked, about 5 minutes. Transfer to a plate lined with paper towels to drain.\nPour the olive oil into a Dutch oven or heat-proof casserole dish over medium heat. Cook the onion and garlic in the oil until the onion is translucent, about 5 minutes. Add the cod and cook another 3 minutes; stir the potatoes into the mixture and cook another 1 to 2 minutes. Reduce heat to low.\nMelt the butter in a separate pan over medium-low heat; vigorously stir the flour into the melted butter. Slowly stream the hot milk into the mixture while stirring; cook and stir until thick. Season with the nutmeg. Pour into the casserole with 1 1/3 cups cream; stir to coat. Allow the mixture to simmer together for about 2 minutes. Season with salt and pepper. Drizzle remaining 2/3 cup cream over the mixture; sprinkle with the Parmesan cheese.\nBake in the preheated oven until the top is browned, 30 to 40 minutes. Serve hot.\n",
        "picture_link": "7aczzt4nchxDxG7niRasyb5HP1rPVse"
    },
    {
        "title": "Raspberry Hot Barbecue Sauce",
        "ingredients": [
            "1 (36 ounce) bottle ketchup ADVERTISEMENT",
            "1 1/4 cups raspberry preserves ADVERTISEMENT",
            "1 (8 ounce) jar honey ADVERTISEMENT",
            "1 cup dill pickle juice ADVERTISEMENT",
            "2 tablespoons prepared spicy mustard ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "1 tablespoon dried minced onion flakes ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 dash hot pepper sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the ketchup, raspberry preserves, honey, pickle juice, mustard, brown sugar, vinegar, red pepper flakes, onion flakes, garlic powder, and black pepper in a saucepan over medium heat. Bring to a boil while stirring. Reduce heat to low and stir in the hot sauce; allow to simmer about 1 hour.\n",
        "picture_link": "jxP1ATGoBQgmr1VPvhNRyL8rfhBwZha"
    },
    {
        "title": "Nopalitos Con Papas",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3 potatoes, peeled and cut into strips ADVERTISEMENT",
            "1 (16 ounce) jar sliced nopalitos, drained and rinsed ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 small tomato, diced ADVERTISEMENT",
            "1 minced jalapeno pepper (optional) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a large skillet over medium heat. Add the potatoes, cover, and cook, stirring occasionally until they begin to soften, about 10 minutes. Stir in the nopalitos, onion, tomato, and jalapeno. Season to taste with salt, and continue cooking and stirring until the onion has softened and turned translucent, and the potatoes are tender, about 10 minutes more.\n",
        "picture_link": "PB4YUAqHwsaPy8DfZ08kLD2reVq84wC"
    },
    {
        "title": "Carne Asada Steak Sandwich with Avocado Salad",
        "ingredients": [
            "2 tablespoons cayenne pepper ADVERTISEMENT",
            "6 tablespoons paprika ADVERTISEMENT",
            "3 tablespoons ground black pepper ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "3 tablespoons onion powder ADVERTISEMENT",
            "3 tablespoons garlic powder ADVERTISEMENT",
            "1 tablespoon ground allspice ADVERTISEMENT",
            "1 tablespoon ground dried thyme ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "4 pounds flat iron steaks ADVERTISEMENT",
            "3 avocados - peeled, pitted, and cubed ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 large red bell pepper, diced ADVERTISEMENT",
            "1 red onion, diced ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "2 tomatoes, seeded and chopped ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "2 (1 pound) French baguettes ADVERTISEMENT",
            "1/2 pound thinly sliced Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together cayenne pepper, paprika, black pepper, cumin, onion powder, garlic powder, allspice, thyme, and 1/4 cup olive oil in a large bowl until evenly mixed. Smear the flat iron steaks with this paste, then wrap with plastic wrap, or place into a resealable plastic bag. Marinate in refrigerator for 6 hours.\nPrepare avocado salad by gently mixing cubed avocado, green onion, red bell pepper, red onion, cilantro, and tomatoes. Drizzle with lime juice and olive oil; season to taste with salt and pepper. Cover and refrigerate until ready to use.\nPreheat an outdoor grill for medium-high heat and lightly oil grate.\nGrill flat iron steaks until cooked to desired degree of doneness, or to an internal temperature of 135 degrees F (57 degrees C) for medium-rare, about 4 minutes per side. Remove from grill and allow to rest for 5 to 10 minutes. While the steaks are resting, cut each baguette into three pieces, then halve the pieces horizontally. Toast bread, cut-side down on grill until golden brown. Turn baguettes over, and place sliced cheese on the cut sides; allow cheese to melt.\nTo assemble sandwiches, thinly slice the flat iron steaks across the grain, and pile onto baguettes. Top with avocado salad before serving.\n",
        "picture_link": "dTPHzlD/9IGXmUAYSeuCfbRj1Vr2VkW"
    },
    {
        "title": "Carrot and Tuna Bites",
        "ingredients": [
            "1 large carrot, sliced diagonally into 1/4 inch thick slices ADVERTISEMENT",
            "1 (5 ounce) can tuna packed in water, drained ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange slices of carrot on a plate or serving tray. In a small bowl, mix together the tuna, green onions and mayonnaise. Spoon some onto each slice of carrot and serve immediately.\n",
        "picture_link": "c04ueQ.8jT9GKMr6zFRp7DyfcLVQkGe"
    },
    {
        "title": "Pumpkin Soup the Easy Way",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 pounds cubed fully cooked ham ADVERTISEMENT",
            "3 (29 ounce) cans pumpkin puree ADVERTISEMENT",
            "1 (32 ounce) carton chicken broth ADVERTISEMENT",
            "2/3 cup cream ADVERTISEMENT",
            "1 teaspoon fresh thyme ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon fresh rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a skillet over medium heat. Cook the onion and garlic in the butter until soft.\nCombine the onion, garlic, ham, pumpkin puree, chicken broth, cream, thyme, pepper, and rosemary in a slow cooker set to Low; cook 8 to 10 hours.\n",
        "picture_link": "GKLhUMzwzJ5a2c/IjznwpGqTsiC.pRK"
    },
    {
        "title": "Lynchburg Lemonade",
        "ingredients": [
            "1 cup ice cubes ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger Tennessee whiskey ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger sweet and sour mix ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger triple sec (orange-flavored liqueur) ADVERTISEMENT",
            "3/4 cup chilled lemon-lime soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a tall glass with ice cubes and pour in the whiskey, sweet and sour mix, triple sec and lemon-lime soda. Stir with a straw and enjoy!\n",
        "picture_link": "COV.HGEETXdLM6ywitQ0hHJZFAQM9x."
    },
    {
        "title": "Aromatic Asian Burgers (Abalos Style)",
        "ingredients": [
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1 (5 ounce) can water chestnuts, drained and diced ADVERTISEMENT",
            "1 tablespoon peanut oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Knead together the sesame oil, soy sauce, garlic powder, ground ginger, onion powder, pepper, ground beef, green onion, and water chestnuts in a bowl until evenly combined; form into four patties.\nHeat the peanut oil in a skillet over medium-high heat. Cook in the skillet until the burgers are cooked to your desired degree of doneness, about 5 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\n",
        "picture_link": "3Y7jnrgVGvNjP/2kn.9K7byTntc5..q"
    },
    {
        "title": "R and R Pudding",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup long-grain white rice ADVERTISEMENT",
            "1 pound rutabaga, peeled and cut into 1 1/2 inch cubes ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 dash ground nutmeg ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the water into a saucepan, add the rice, and bring to a boil over medium-high heat. Stir once, cover, reduce heat to low; and simmer until all moisture is absorbed and rice is tender, about 20 minutes.\nMeanwhile, place the rutabaga into a large pot, and fill with enough water to cover. Bring to a boil over medium-high heat, and cook until the rutabaga are tender and can be pierced with a fork, about 10 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a 2 quart casserole dish.\nDrain the rutabaga, and place into a mixing bowl. Add the milk, butter, sugar, salt, pepper, and ground nutmeg. Beat or mash the rutabaga until smooth. Stir in the cooked rice, and beat in the egg yolks.\nBeat the egg whites in a separate bowl until stiff peaks form. Fold gently into the rutabaga mixture. Spoon mixture into prepared casserole dish.\nBake in preheated oven until top is lightly browned, about 1 hour.\n",
        "picture_link": "gKHay30v0cm4xQFbWUTrKUDu2Q1.aUi"
    },
    {
        "title": "Cinnamon Chicken Nuggets",
        "ingredients": [
            "4 cups oil for frying ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/3 cup ground cinnamon ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in skillet or fryer to 350 degrees F (175 degrees C). Arrange paper towels on a baking sheet.\nIn a medium bowl, beat together eggs, milk , and honey; set aside. Combine flour, sugar, and cinnamon in a large resealable plastic bag; shake until blended. Dip chicken in egg mixture, and then add to flour mixture. Seal the bag, and shake to coat chicken with flour mixture.\nPlace 10 to 12 coated chicken nuggets into hot oil. Cook till done, about 7 to 10 minutes (nuggets will be a dark bronze color). Remove nuggets from oil, and drain well on paper towels. Repeat till all nuggets are cooked.\n",
        "picture_link": "7gco87zWjn44kaOl8YcvUrbq9tE4VPu"
    },
    {
        "title": "Tuna Steaks with Melon Salsa",
        "ingredients": [
            "1 small cantaloupe, flesh removed and finely diced ADVERTISEMENT",
            "1/2 red chile pepper, seeded and chopped ADVERTISEMENT",
            "10 fresh basil leaves, cut into thin strips ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 (5 ounce) tuna steaks ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the cantaloupe, chile pepper, basil, 2 tablespoons olive oil, lime juice, salt, and sugar in a bowl.\nHeat 2 tablespoons olive oil in a skillet. Season tuna steaks with salt and pepper. Cook tuna in oil for 3 minutes per side. Spoon cantaloupe mixture over each steak to serve.\n",
        "picture_link": "ewGwhDTLR1mjllJgFbyjtgxw2v2NrH6"
    },
    {
        "title": "Ultimate Grilled Cheese Sandwich",
        "ingredients": [
            "1/4 cup finely chopped Granny Smith apple ADVERTISEMENT",
            "1 tablespoon finely chopped pecans ADVERTISEMENT",
            "1 tablespoon creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "8 slices Colby cheese ADVERTISEMENT",
            "8 slices sourdough bread ADVERTISEMENT",
            "4 thick slices ham ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the apple, pecans, salad dressing, and sour cream; set aside. Place a slice of Colby cheese onto 4 of the bread slices, the add the ham, followed by the remaining slice of cheese and bread. Spread the margarine on the outside of the sandwiches.\nPlace the sandwiches into a large skillet and cook over medium-high heat until the bread is golden brown on both sides and the cheese has melted, about 3 minutes per side. Spread the apple mixture into the middle of each sandwich before serving.\n",
        "picture_link": "1af3cZNTglxmv1fqh5p.Ylh3a8ToYEO"
    },
    {
        "title": "Brussels Sprouts and Barley Soup",
        "ingredients": [
            "12 cups chicken broth ADVERTISEMENT",
            "1 cup chopped fresh green beans ADVERTISEMENT",
            "1 1/4 cups cubed turnips ADVERTISEMENT",
            "1/2 cup chopped leeks ADVERTISEMENT",
            "1/2 cup chopped carrots ADVERTISEMENT",
            "1/3 cup barley ADVERTISEMENT",
            "1 1/2 pounds Brussels sprouts, trimmed and cut in half ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure the chicken broth into a large soup pot. Bring to a boil. Add the beans, turnips, leeks, carrots and barley; simmer over medium heat for 30 minutes. Add the Brussels sprouts and green pepper. Season with salt and pepper. Simmer until the sprouts are tender, about 30 minutes more.\nMelt the butter in a small saucepan over medium heat, stirring until it starts to brown. Whisk in the flour until smooth. Stir this into the soup and simmer until thickened, about 10 minutes.\n",
        "picture_link": "JNV180.UVwNqMGgHyRVwq97MbI/lr76"
    },
    {
        "title": "Pasta Deli Salad",
        "ingredients": [
            "1 (16 ounce) package tri-color pasta ADVERTISEMENT",
            "1 (8 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "1/2 pound hard salami, cubed ADVERTISEMENT",
            "1/2 pound provolone cheese, cubed ADVERTISEMENT",
            "2 small red onions, diced (optional) ADVERTISEMENT",
            "1 cup diced green bell pepper ADVERTISEMENT",
            "1 cup diced red bell pepper ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 stick pepperoni, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a rolling boil over high heat. Cook the pasta in boiling water, until the pasta has cooked through but is still firm to the bite, about 12 minutes. Drain.\nCombine the pasta and the Italian dressing in a large bowl. Add the salami, provolone, red onions, bell peppers, Parmesan, and pepperoni; stir until well combined. Cover, and chill 2 hours or overnight.\n",
        "picture_link": "JoqDbIzQSayAwVSDDvtpLAcwxRsmGZy"
    },
    {
        "title": "Fried Frog's Legs",
        "ingredients": [
            "24 frog's legs, skin removed ADVERTISEMENT",
            "1 (4 ounce) packet saltine crackers, crushed ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1 teaspoon minced onion ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "1 cup peanut oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse the frog's legs and pat dry; set aside. In a large resealable bag, combine the saltine cracker crumbs, flour, cornmeal, onion, salt and pepper. Shake to mix. In a shallow bowl, whisk together eggs and milk.\nHeat the vegetable oil and peanut oil in a large skillet over medium-high heat. The oil should be about 1/2 inch deep.\nDip the frog's legs into the milk and egg, then dip into the cracker mixture until evenly coated. Carefully place them in the hot oil. Cook until golden brown on each side, about 5 minutes per side. If the legs start to brown too quickly, reduce the heat to medium. Drain on paper towels before serving.\n",
        "picture_link": "hqAvhqb4xqWItHpT3.5DnrCDrPEk1BC"
    },
    {
        "title": "Chicken with Wild Rice and Vegetables Casserole",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 (4.3 ounce) boxes long grain and wild rice mix ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 cups frozen California blend vegetables ADVERTISEMENT",
            "12 frozen chicken tenders ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13 inch baking dish with nonstick cooking spray.\nPour the contents of the long grain and wild rice boxes into prepared baking dish. Drizzle rice with 2 tablespoons of olive oil. Pour chicken broth and water over the rice. Top with frozen vegetables and frozen chicken tenders. Drizzle chicken with the remaining tablespoon of olive oil. Season with salt and pepper; sprinkle with paprika. Cover tightly with aluminum foil.\nPlace casserole in preheated oven. Bake until rice is soft and chicken juices run clear, approximately one hour.\n",
        "picture_link": "zK9oK5U1eEwYTegJdHjYZ5raUnH96Hm"
    },
    {
        "title": "Dad's Candied Salmon",
        "ingredients": [
            "1 (2 pound) whole salmon fillet ADVERTISEMENT",
            "3 tablespoons dry mustard ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nPlace the salmon onto a baking sheet lined with aluminum foil with the skin side down. Rub the mustard into the flesh of the salmon and then spread the brown sugar evenly over the fish. Squeeze the lemon over the salmon. Bring the edges of the foil together and seal into a packet.\nBake in the preheated oven until the fish flakes easily with a fork, 25 to 30 minutes.\n",
        "picture_link": "a5UqMeLiOShr8ViVMxW7jNbCSeIYMcC"
    },
    {
        "title": "Heavenly Mix",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups corn syrup ADVERTISEMENT",
            "1 (17.5 ounce) package crispy corn and rice square cereal ADVERTISEMENT",
            "1 (17.5 ounce) package crispy rice cereal squares ADVERTISEMENT",
            "1 1/2 cups sliced almonds ADVERTISEMENT",
            "1 cup sweetened flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl or disposable roasting pan, toss together the corn and rice cereal, rice cereal, almonds and coconut.\nCombine the butter, sugar and corn syrup in a large saucepan and bring to a boil. Once boiling, continue to cook for 3 minutes. Pour over the cereals, using a large wooden spoon to stir the mixture until evenly coated. Spread out on a cookie sheet to cool. Store in an airtight container at room temperature.\n",
        "picture_link": "eiyP6U6vYGZ/E5JKGP37SN//9TzWxNS"
    },
    {
        "title": "Creamy Dip for Fruit",
        "ingredients": [
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the cream cheese with an electric mixer on the lowest speed until smooth. Gradually add the sour cream, beating continually. Mix in the brown sugar, vanilla, and milk. Cover and chill at least 1 hour before serving.\n",
        "picture_link": "N8GiVIcYuR1/2SGemDdfa0V3.j229fi"
    },
    {
        "title": "Brazilian-Style Moist Coconut Cake",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 3/4 cups milk ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch pan. Sift together flour and baking powder.\nBeat the egg whites to soft peaks, then continue beating while slowly adding the sugar until stiff peaks have formed. Fold in egg yolks until evenly mixed, then fold in the flour mixture alternately with the orange juice. Pour batter into the prepared pan.\nBake cake in preheated oven until the top has turned golden brown, and a toothpick inserted into the center comes out clean, about 40 minutes.\nWhen the cake is done, remove from the oven, and use a fork to poke all over the top of the cake, in 1 inch intervals. In a small bowl, stir together the milk, coconut milk, and sweetened condensed milk. Evenly pour the milk mixture over the cake, then sprinkle with coconut flakes. Chill cake in the refrigerator until cold, about 3 hours.\n",
        "picture_link": "ireo388qKzK6F7VL/3fHyAFRQLs16YW"
    },
    {
        "title": "Skillet Garlic Chicken Dinner",
        "ingredients": [
            "Vegetable cooking spray ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 3/4 cups Swanson® Chicken Stock ADVERTISEMENT",
            "3/4 cup uncooked regular long-grain white rice ADVERTISEMENT",
            "1 (16 ounce) bag frozen vegetable combination (broccoli, cauliflower, carrots) ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "Paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 12-inch skillet with the cooking spray and heat over medium-high heat for 1 minute. Add the chicken and garlic and cook for 10 minutes or until the chicken is well browned on both sides. Remove the chicken from the skillet.\nStir the stock, rice and vegetables in the skillet and heat to a boil. Reduce the heat to low. Cover and cook for 15 minutes. Stir in the cheese.\nReturn the chicken to the skillet. Sprinkle the chicken with the paprika. Cover and cook for 10 minutes or until the chicken is cooked through and the rice is tender.\n",
        "picture_link": "yuko.2zH9Rtgv7ei.YA5Iv0JjNl0BOi"
    },
    {
        "title": "Delicious Oat Bran Cereal",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "5 dried pitted prunes, chopped ADVERTISEMENT",
            "1 teaspoon sugar substitute (such as Splenda) ADVERTISEMENT",
            "1/4 cup oat bran ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, cinnamon, prunes, and sugar substitute in a saucepan over medium heat; bring to a boil; stir in the oat bran and boil for 2 minutes.\n",
        "picture_link": "ysZojv4n6VBjSfOhHze6ivdiOmhtaSq"
    },
    {
        "title": "Eggnog Fruit Bread",
        "ingredients": [
            "1/4 cup butter, melted ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup eggnog ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped red and green candied cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease an 8x4 inch loaf pan.\nBeat the butter, sugar, and eggs together in a mixing bowl. Stir in the flour, baking powder, and sat, alternating with the eggnog, just until the dry ingredients are moistened. Fold in the pecans, raisins, and cherries until evenly blended. Spoon the batter into the prepared pan.\nBake in preheated oven until top is golden and springs back when lightly touched, about 70 minutes. Cool in pan 10 minutes, then turn out onto a wire rack to cool completely.\n",
        "picture_link": "MiF0H66FnfNH7BHfUwk7ovau6rkGOBK"
    },
    {
        "title": "Fort Worth Fish Tacos",
        "ingredients": [
            "Fish: ADVERTISEMENT",
            "8 (3 ounce) fillets tilapia ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons hot pepper sauce ADVERTISEMENT",
            "Cilantro Cream Sauce: ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 (5.3 ounce) container plain Greek yogurt ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "Beer Batter: ADVERTISEMENT",
            "1 cup flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "cayenne pepper to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup dark beer ADVERTISEMENT",
            "3 cups peanut oil for frying ADVERTISEMENT",
            "For the Tacos: ADVERTISEMENT",
            "8 (8 inch) flour tortillas ADVERTISEMENT",
            "1/4 medium head cabbage, finely shredded ADVERTISEMENT",
            "1 (8 ounce) jar prepared salsa ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "2 small limes, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tilapia fillets on plate and sprinkle with salt and hot sauce; cover and refrigerate while making cilantro cream sauce.\nCombine cream cheese, 2 tablespoons cilantro, mayonnaise, and yogurt in a small bowl or large measuring cup; mix well. Stir lime juice into cream sauce. Cover and refrigerate.\nWhisk flour, salt, garlic powder, cayenne, and pepper in a bowl until thoroughly combined; whisk in beer to make a smooth batter.\nHeat oil in a large, deep frying pan to 375 degrees F (190 degrees C).\nRemove fish from refrigerator; dip in beer batter and fry fillets 3 at a time in the hot oil, turning when golden (approximately 2 minutes on each side, depending on the thickness). Transfer to paper towels to drain; set fish on a covered plate to keep warm. Repeat with remaining fillets.\nWrap tortillas in a clean kitchen towel and heat in the microwave until warm, about 20 seconds. Assemble tacos by placing a fish fillet on a warm tortilla. Top with shredded cabbage, a dollop of cilantro cream sauce, a spoonful of salsa, and a sprinkle of chopped cilantro. Serve each taco with a lime quarter for squeezing.\n",
        "picture_link": "ARduuTI2m6aBUeWgxQ1NLeUHVUCzHmS"
    },
    {
        "title": "Mom's New Years Pig's Feet",
        "ingredients": [
            "8 pig feet, split ADVERTISEMENT",
            "2 celery ribs, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3/4 cup white vinegar ADVERTISEMENT",
            "2 tablespoons red pepper flakes (optional) ADVERTISEMENT",
            "2 tablespoons seasoned salt ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "water, or as needed to cover ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thoroughly wash pig feet in cold water and place into a large pot or Dutch oven. Add celery, onion, vinegar, red pepper flakes, seasoned salt, garlic, black pepper, and bay leaves to the feet; pour in water to cover.\nBring to a boil, reduce heat to low, and simmer until meat is tender and falling off the bones, about 2 hours.\n",
        "picture_link": "JSwyDyeXZ2sXnQD3Nb8UMtBUZq92.7y"
    },
    {
        "title": "Banana Pudding Surprise",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk (such as Eagle Brand®) ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "3 cups frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (12 ounce) package vanilla wafer cookies ADVERTISEMENT",
            "4 bananas, sliced ADVERTISEMENT",
            "1 1/2 cups sliced fresh strawberries ADVERTISEMENT",
            "1/4 cup fresh blueberries ADVERTISEMENT",
            "1/4 cup fresh raspberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk water, sweetened condensed milk, and pudding mix together in a bowl until smooth and thickened, 2 to 5 minutes. Refrigerate until firm, about 5 minutes.\nStir whipped topping and cream cheese together in a bowl until smooth; fold into the pudding mixture.\nArrange a layer of vanilla wafer cookies into the bottom of a 2 1/2-quart glass dessert bowl. Top with a layer of banana slices, strawberry slices, and the pudding mixture, respectively. Repeat layering with remaining ingredients. Garnish with blueberries and raspberries to serve.\n",
        "picture_link": "slOocwisE0P3KgNL7d/5YaMVrCacrVG"
    },
    {
        "title": "Creme Anglaise Sauce",
        "ingredients": [
            "2 large egg yolks ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 tablespoon brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk egg yolks, cream, sugar, brandy-based orange liqueur, and vanilla extract in a small saucepan until smooth.\nPlace saucepan over medium-low heat and cook, stirring constantly with a rubber spatula scraping the bottom, until the mixture is hot and thickens slightly, and a thermometer reaches 180 degrees F (82 degrees C), 8 to 10 minutes.\nRemove from heat, strain to remove any over-cooked particles of egg, and allow cool.\n",
        "picture_link": "lFX3DdX/G0riWfY.slQ21aT8u5RUSKe"
    },
    {
        "title": "Corn Souffle from PHILADELPHIA Cream Cheese",
        "ingredients": [
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, cubed, softened ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (14.75 ounce) can cream-style corn ADVERTISEMENT",
            "1 (8.5 ounce) package corn muffin mix ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup KRAFT Shredded Cheddar Cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nMix butter and cream cheese in large bowl until blended. Add next 4 ingredients; mix well.\nPour into 2-qt. casserole sprayed with cooking spray; top with Cheddar.\nBake 45 to 50 min. or until knife inserted in center comes out clean.\n",
        "picture_link": "/ZHUuR33m/Zs1DqqgHfyy7nbWi3FYZS"
    },
    {
        "title": "Applesauce Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 cup unsweetened applesauce ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1/4 cup crushed walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 12 muffin cups with paper liners.\nMix flour, baking soda, allspice, nutmeg, cinnamon, cloves, ginger, and salt together in a bowl.\nBeat shortening with an electric mixer in a separate large bowl until smooth; add honey and mix for 2 minutes. Stir flour mixture into shortening mixture, alternating with applesauce, until batter is smooth. Fold in raisins and walnuts. Spoon about 2 1/2 tablespoons batter into each muffin cup.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, 20 to 25 minutes.\n",
        "picture_link": "dB/bZPMiaZ5fMcdBD5Z41X12D8oMkwu"
    },
    {
        "title": "Oven Roasted Baked Potatoes",
        "ingredients": [
            "8 fingerling potatoes, cubed ADVERTISEMENT",
            "1 large onion, cubed ADVERTISEMENT",
            "2 tablespoons coconut oil, melted ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a large baking sheet with foil.\nToss fingerling potatoes, onion, coconut oil, garlic, and sea salt in a large bowl. Spread mixture onto baking sheet; bake, stirring every 10 minutes, until potatoes are tender, about 30 to 40 minutes.\n",
        "picture_link": "qhfby/RtVjdlbvxIANaDyW3zKVDG4Ga"
    },
    {
        "title": "Thick and Chewy Chocolate Chip Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup unsalted butter at room temperature ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 jumbo egg ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk both amounts of flour, baking soda and salt in a bowl. Beat butter, brown sugar, and pudding mix in another bowl with an electric mixer until blended; beat in egg, egg yolk, and vanilla extract until combined. Stir flour mixture into egg mixture until just combined. Fold in chocolate chips.\nRoll the dough into 2-inch balls and place 2 inches apart onto ungreased baking sheets.\nBake until golden brown, about 15 minutes.\n",
        "picture_link": "sQbXD5x7e6Kf61iXKovHyU5OshxnPQy"
    },
    {
        "title": "Caraway Rye Bread (for the bread machine)",
        "ingredients": [
            "1 1/4 cups lukewarm water (100 degrees F/38 degrees C) ADVERTISEMENT",
            "2 tablespoons dry milk powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "1 3/4 cups bread flour ADVERTISEMENT",
            "3/4 cup rye flour ADVERTISEMENT",
            "1 1/2 tablespoons caraway seeds ADVERTISEMENT",
            "1 3/4 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put lukewarm water, milk powder, salt, brown sugar, molasses, butter, whole wheat flour, bread flour, rye flour, caraway seeds, and yeast into the pan of a bread machine in the order suggested by the manufacturer. Select the Grain setting and 2-pound loaf size.\n",
        "picture_link": "wab2.rB4qXSRlrW.PV0Q8Kyb1qTDkk."
    },
    {
        "title": "Summer Peach, Basil & Cheddar Muffins",
        "ingredients": [
            "4 fresh peaches, cut into 1/2-inch pieces ADVERTISEMENT",
            "4 teaspoons finely minced fresh basil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup shredded extra-sharp Cheddar cheese (such as Sargento® Off the Block) ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "7 tablespoons brown sugar ADVERTISEMENT",
            "2 eggs, room temperature ADVERTISEMENT",
            "1/4 cup shredded extra-sharp Cheddar cheese (such as Sargento® Off the Block) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line with paper liners.\nMix peaches, basil, and 1 tablespoon brown sugar in a bowl; let sit until sugar dissolves, about 15 minutes.\nSift flour, baking powder, baking soda, and salt together in a large bowl. Mix 1 cup Cheddar cheese into flour mixture.\nBeat butter and 7 tablespoons brown sugar in a bowl with an electric mixer until smooth and creamy. Add eggs, one at a time, until just combined; gently fold in peaches. Mix flour mixture, a little at time, into peach mixture until batter is just combined.\nSpoon batter into the prepared muffin cups. Sprinkle 1/4 cup Cheddar cheese over batter.\nBake in the preheated oven until a toothpick inserted in the middle of a muffin comes out clean, about 25 minutes.\n",
        "picture_link": ".sSc6/7x0OM5gIHcLADCqEBT3euPfVC"
    },
    {
        "title": "Essanaye's Sesame Beef Stir Fry",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup rice wine vinegar ADVERTISEMENT",
            "1/3 cup minced garlic ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1 pound round steak, thinly sliced ADVERTISEMENT",
            "1/4 cup peanut oil ADVERTISEMENT",
            "2 cups 1-inch sliced asparagus ADVERTISEMENT",
            "1 cup sliced fresh mushrooms, or more to taste ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 bunch green onions, chopped into 1-inch pieces ADVERTISEMENT",
            "1 cup whole cashews ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1 tablespoon cornstarch (optional) ADVERTISEMENT",
            "1 tablespoon water (optional) ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk soy sauce, sugar, rice wine vinegar, garlic, and 1 tablespoon sesame seeds in a bowl; pour into a resealable plastic bag. Add beef, coat with marinade, squeeze out excess air, and seal bag. Marinate beef in the refrigerator overnight.\nHeat peanut oil in a wok or large skillet over medium-high heat; cook and stir beef and marinade until beef is well-browned, about 5 minutes. Stir in asparagus, mushrooms, onion, bell pepper, and green onions; cook and stir until vegetables begin to soften, 3 to 4 minutes. Add cashews and 1 tablespoon sesame seeds; continue cooking until vegetables are tender, 2 to 3 minutes more.\nMix cornstarch and water in a small bowl; stir into beef stir fry until sauce is thickened, about 3 minutes. Sprinkle with remaining 1 tablespoon sesame seeds.\n",
        "picture_link": "ySWOY6.9BwAD8aUfB.PTLInhA01kUDW"
    },
    {
        "title": "Vegan Whole Wheat Biscuits",
        "ingredients": [
            "2 cups whole wheat pastry flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon stevia powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup coconut oil, at room temperature ADVERTISEMENT",
            "1 cup almond milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nMix flour, baking powder, stevia powder, and salt in a bowl. Cut in coconut oil with a pastry cutter or knife until mixture resembles coarse crumbs. Stir in almond milk until dough is just moistened.\nTurn dough out onto a lightly floured surface; knead gently 8 to 10 times. Pat or roll the dough out into a 3/4 inch thick round. Cut circles with a 2 1/2-inch biscuit cutter and arrange biscuits on a baking sheet.\nBake in preheated oven until lightly browned, 8 to 10 minutes.\n",
        "picture_link": "raDxY44UXNAuXuBYgjLoFJcXThunmVC"
    },
    {
        "title": "Quick Creamy Zucchini Soup",
        "ingredients": [
            "4 cups shredded zucchini ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon basil ADVERTISEMENT",
            "2 cups warm milk ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir zucchini, water, salt, and basil together in a pot; bring to a boil, reduce heat to medium-low, and simmer until zucchini is tender, about 15 minutes.\nPour zucchini mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend until smooth. Puree in batches.\nWhisk warm milk, flour, and salt together in a bowl until smooth.\nMelt butter in a skillet over medium heat. Cook and stir onion in melted butter until translucent, 5 to 7 minutes. Pour pureed zucchini and milk mixture into the skillet; bring to a boil while stirring continually. Season with pepper.\n",
        "picture_link": "/0qGBkZSr/clvciSrpkG/3n8/vVLRTW"
    },
    {
        "title": "Easy Cheeseburger Tacos ",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "6 (8 inch) flour tortillas ADVERTISEMENT",
            "1 (8 ounce) package shredded Mexican cheese blend ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13-inch baking dish.\nHeat a large skillet over medium-high heat. Cook and stir beef with black pepper, salt, and garlic powder in the hot skillet until meat is browned and crumbly, 5 to 7 minutes; drain and discard grease. Reduce heat to low and mix 1/2 cup ketchup into beef.\nLay a tortilla onto a work surface and place about 1/3 cup beef mixture and 1/4 cup shredded cheese onto tortilla in a line down the center. Roll tortilla over meat and cheese, fold in top and bottom to enclose filling, and finish rolling into a burrito shape. Repeat with remaining tortillas and filling. Place filled tortillas into prepared baking sheet and sprinkle remaining Mexican cheese blend on top. Cover dish with aluminum foil.\nBake in the preheated oven until dish is heated through and cheese topping has melted, 20 to 25 minutes. Stir sour cream with 1/3 cup ketchup in a bowl and top each serving with the sour cream sauce.\n",
        "picture_link": "bCi9DBWLttaYDQVEkQxRbh5yhauw3kS"
    },
    {
        "title": "Slow Cooker Chicken and Mushroom Stew",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried rubbed sage ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "5 chicken thighs, quartered ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1 large yellow onion, diced ADVERTISEMENT",
            "1 large bell pepper, diced ADVERTISEMENT",
            "8 ounces chorizo sausage, thinly sliced ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can cream of celery soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 teaspoons Cajun seasoning ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, basil, thyme, sage, and black pepper in a large resealable bag; add chicken, seal bag, and shake until chicken is evenly coated.\nHeat olive oil in a large skillet over medium heat; cook and stir onion and bell pepper until slightly tender, 5 to 10 minutes. Add chorizo sausage and garlic; cook and stir until sausage is cooked, about 5 minutes. Transfer mixture to a slow cooker and top with mushrooms.\nCook and stir coated chicken (including all the flour) in the same skillet, adding more oil if needed, until chicken is browned, 5 to 10 minutes. Transfer chicken to the slow cooker.\nPour chicken stock into the same skillet, and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Pour all the liquid and brown bits into slow cooker.\nMix cream of mushroom soup, cream of celery soup, sour cream, Cajun seasoning, and cayenne pepper in a bowl; spoon into slow cooker.\nCook on High for 2 hours; reduce setting to Low and cook for 4 more hours.\n",
        "picture_link": "npb4fzg9brhoTP0ithBKJssLQe6cgUO"
    },
    {
        "title": "Grandma's Slow Cooker Swiss Steak",
        "ingredients": [
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 pounds beef round steak, cut into strips ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (14.5 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 (14.5 ounce) can Cheddar cheese soup ADVERTISEMENT",
            "1/2 small onion, chopped ADVERTISEMENT",
            "1 tablespoon chopped green bell pepper, or more to taste ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon browning sauce (such as Kitchen Bouquet®), or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour into a bowl. Dredge strips of round steak in flour to coat.\nHeat vegetable oil in a large skillet over medium heat; brown strips of round steak in the hot oil, 7 to 8 minutes per side.\nTransfer beef strips to a slow cooker. Add cream of mushroom soup, Cheddar cheese soup, onion, green bell pepper, garlic, Worcestershire sauce, and browning sauce; stir. Season mixture with salt and black pepper.\nCook on High and cook 4 hours.\n",
        "picture_link": "yHVG9y6m.x6bR9yKjWN5TdnUZIZv8Y2"
    },
    {
        "title": "Nutella Hot Chocolate",
        "ingredients": [
            "1 quart half-and-half ADVERTISEMENT",
            "1 (13 ounce) jar chocolate-hazelnut spread (such as Nutella®) ADVERTISEMENT",
            "3/4 cup hazelnut liqueur (such as Frangelico®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat half-and-half in a saucepan over low heat; whisk in chocolate-hazelnut spread. Cook and stir until hot chocolate is heated through and smooth, about 10 minutes. Stir in hazelnut liqueur just before serving.\n",
        "picture_link": "FZ.t2oT7KeRxwcxqVHMRPf1p64y.Vmy"
    },
    {
        "title": "Evana's Pinto Beans",
        "ingredients": [
            "2 pounds dried pinto beans ADVERTISEMENT",
            "8 cloves garlic, crushed ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 large ripe tomatoes, diced ADVERTISEMENT",
            "1 large yellow onion, diced ADVERTISEMENT",
            "2 bunches cilantro, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pick over beans and wash in cold water 4 times. Place beans into a large pot, pour in enough fresh water to cover by 2 inches, and soak overnight.\nBring beans and soaking water to a boil; stir in garlic and salt. Reduce heat to low and simmer beans until they begin to soften, 2 to 3 hours, stirring often. If beans start to dry out, add more boiling water.\nHeat vegetable oil in a large skillet over medium heat; cook and stir tomatoes and onion in the hot oil until onion becomes translucent, about 5 minutes. Stir cilantro, 5 to 6 large spoonfuls of beans, and cooking liquid into tomato mixture. Mash beans and stir tomato mixture back into simmering beans. Continue simmering until flavors are blended, about 1 hour more.\n",
        "picture_link": "oUULug.TSh648VyHOW66euN3rpa/Uwi"
    },
    {
        "title": "Frozen Pineapple 'Ice Cream' Sandwich",
        "ingredients": [
            "1 (16 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (20 ounce) can canned crushed pineapple, drained ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding ADVERTISEMENT",
            "36 graham cracker squares ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat together the thawed whipped topping, crushed pineapple and vanilla pudding mix for 2 minutes. Spread pineapple mixture 1/2 inch thick between two graham crackers. Wrap gently in plastic and freeze for 2 hours.\n",
        "picture_link": "BE4CnA84pHW2xqxctLS.G9DTCSWzp7S"
    },
    {
        "title": "Molasses Raisin Muffins",
        "ingredients": [
            "2 cups plain yogurt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/3 cup molasses ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1/2 cup wheat germ ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 1/4 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups.\nBeat together the yogurt, egg, molasses, raisins, wheat germ, oats, and butter in a large bowl until evenly mixed. Sift the flour, baking soda, cinnamon, ginger, cloves, and salt on top of the molasses mixture. Fold the flour mixture into the molasses until a batter has formed. Pour batter into muffin cups, filling to the top.\nBake in preheated oven until a toothpick inserted into the middle of a muffin comes out clean, about 25 minutes.\n",
        "picture_link": "C4Tq6TOtXBqp77V1KihmzDSoFZQ/uXS"
    },
    {
        "title": "Sage Apple Chicken with Brie",
        "ingredients": [
            "1 cup red wine ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon salt, divided ADVERTISEMENT",
            "1 tablespoon dried sage, divided ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 Red Delicious apple, cored and sliced ADVERTISEMENT",
            "4 slices Brie cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable bag, combine the red wine, olive oil, 1/2 teaspoon of salt and 1/2 teaspoon sage. Place the chicken in the bag, seal and shake to coat. Place in the refrigerator to marinate overnight.\nPreheat the oven to 400 degrees F (200 degrees C). Place the chicken on a baking sheet. Season with the remaining sage and salt. Discard marinade.\nBake for about 25 minutes, or until chicken juices run clear. Remove from the oven and top each piece of chicken with slices of apple and Brie cheese. Return to the oven and set it to Broil.\nBroil the chicken for about 5 minutes, or until the apple and cheese are toasted.\n",
        "picture_link": "A2ruM/4N6.a/1C6.nxMU4l93NSgwCcG"
    },
    {
        "title": "Mexican Mango",
        "ingredients": [
            "1/4 cup water ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1 mango - peeled, seeded, and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a small saucepan. Stir in chili powder, salt, and lemon juice until smooth and hot. Add sliced mango and toss to coat; allow to soak up the chili sauce for a few minutes before serving.\n",
        "picture_link": "G66G6P40UbVPI4d1aBuxAEM/qGiZ2Oq"
    },
    {
        "title": "Honey Butter Zucchini Bread",
        "ingredients": [
            "3 cups self-rising flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 2/3 cups white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "3 cups grated unpeeled zucchini ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9x5 inch loaf pans. Stir together the flour, cinnamon, nutmeg, and salt in a bowl until blended. Set aside.\nWhisk eggs, sugar, oil, butter, honey, and vanilla together in a large bowl. Stir in zucchini, walnuts, and coconut. Add the flour mixture and stir until well combined. Divide the batter between the prepared loaf pans.\nBake until a toothpick inserted in the center comes out clean, about 1 hour. Cool completely. Store loaves overnight in plastic bags for best flavor.\n",
        "picture_link": "UU6xMcCaQX2TpF4KieHmuWE5A443rBq"
    },
    {
        "title": "Dennis' Honey-Mustard Salad Dressing",
        "ingredients": [
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 tablespoon fresh parsley ADVERTISEMENT",
            "1/3 cup apple cider vinegar ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 teaspoons lime zest ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the onion, parsley, vinegar, mustard, mayonnaise, honey, salt, pepper, and lime zest in the bowl of a small food processor or blender. Process until thoroughly blended. Serve immediately, or place in a covered container and refrigerate until needed.\n",
        "picture_link": "90jzxsF6m.cDgZlY9peWKWgZFOwOYFS"
    },
    {
        "title": "Pastitsio",
        "ingredients": [
            "Meat Layer: ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 pounds lean ground beef ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "2 tablespoons ground allspice ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "Macaroni Layer: ADVERTISEMENT",
            "1 pound uncooked macaroni ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "Cream Sauce Layer: ADVERTISEMENT",
            "4 eggs, well beaten ADVERTISEMENT",
            "3/4 cup half-and-half ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ground nutmeg to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon of butter in a large skillet over medium-high heat. Stir in onion and cook until it begins to soften, about 3 minutes. Stir in the ground beef, and cook until crumbly and no longer pink. Pour in the water and tomato paste. Season with salt, pepper, allspice, nutmeg, and cinnamon; cover, and simmer for 5 minutes. Remove from heat, adjust salt to taste, then refrigerate until cold. Once cold, remove any congealed fat, and thoroughly mix with 2 beaten eggs, and set aside.\nPreheat oven to 400 degrees F (200 degrees C).\nBring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain, and rinse under cold water to cool. Mix the macaroni in 2 beaten eggs until well coated.\nEvenly spread half of the macaroni mixture into a 11x14x2 inch baking pan, sprinkle with 1/2 cup of the grated parmesan cheese, and drizzle with 1/2 cup of melted butter. Spread the meat mixture overtop, then finish with the remaining macaroni. Sprinkle the macaroni with another 1/2 cup of Parmesan cheese, and drizzle with 1/2 cup of melted butter.\nWhisk together 4 beaten eggs with the half-and-half, 1 cup of Parmesan cheese, flour, and salt; whisk until well blended. Pour the cream mixture evenly over top of the pastitsio, and sprinkle with nutmeg.\nCover the pan with foil, and bake in the preheated oven for 15 minutes. Remove the foil, and bake until the top has turned golden brown, about 30 minutes. Remove from oven, and allow to stand for 15 minutes before serving.\n",
        "picture_link": "hsrj6JzE72Zlp8EUkqql6VaL76Ebxh2"
    },
    {
        "title": "Spiced Up Hot Cereal",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup cream of wheat ADVERTISEMENT",
            "1/4 cup white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, milk, vanilla extract, cinnamon, salt, nutmeg, and butter into a large saucepan and place over medium-high heat. Once the butter has melted and the water is steaming but not boiling, whisk in the cream of wheat cereal. Stir constantly until thickened, then reduce heat to low, and cook for 5 minutes, stirring occasionally. Stir in sugar to taste before serving.\n",
        "picture_link": "7bCjSuOzIJMH7WHFyFcDS7IuptPFNMy"
    },
    {
        "title": "Peanut Butter Crunch Apples",
        "ingredients": [
            "6 Granny Smith apples ADVERTISEMENT",
            "6 wooden sticks ADVERTISEMENT",
            "1 (14 ounce) package individually wrapped caramels, unwrapped ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups chopped peanut butter filled sandwich cookies ADVERTISEMENT",
            "4 ounces milk chocolate, chopped ADVERTISEMENT",
            "4 ounces white chocolate, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Insert wooden sticks 3/4 of the way into the stem end of each apple. Place apples on a cookie sheet covered with lightly greased aluminum foil.\nCombine caramels and water in a saucepan over low heat. Cook, stirring often, until caramel melts and is smooth. Stir in the vanilla. Dip each apple into the caramel and gently run apples around insides of saucepan to scrape off some of the caramel. Scrape excess caramel from the apple bottoms using the side of the saucepan.\nSpread the chopped cookies out on a dinner plate. Roll caramel apples in the cookies and place on the aluminum foil. Place the milk chocolate and white chocolate into separate microwave-safe bowls. Heat in the microwave at 30 second intervals, stirring between each, until melted and smooth. Drizzle milk chocolate over the apples, then drizzle the white chocolate over the milk chocolate. Refrigerate until ready to serve.\n",
        "picture_link": "tmBNoj86jj2JLR7jenKfqG5ARQYovAe"
    },
    {
        "title": "Licuado de Mango",
        "ingredients": [
            "1 mango - peeled, seeded and diced ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the mango, milk, honey and ice cubes into a blender. Cover and blend until smooth. Serve immediately.\n",
        "picture_link": "/zVP3BQGxeHnYBUnU1WOmAUwvnpbm4y"
    },
    {
        "title": "Chunky Pear Butter with a Lemon Twist",
        "ingredients": [
            "5 pounds pears - peeled, cored and diced ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 teaspoons grated lemon zest ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "2 tablespoons limoncello liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pears and water into a pot or large saucepan. Cook over medium heat until pears are soft, about 30 minutes. Sterilize six half-pint jars and keep warm.\nTransfer pears to a food processor and pulse until they reach your desired consistency. Return to the pan, and stir in the brown sugar, lemon zest, nutmeg, almond extract and limoncello. Cook over medium-low heat, stirring occasionally, until the mixture reaches a thick consistency like butter, about 1 hour.\nLadle the pear butter into the sterile jars, leaving 1/4 inch headspace. Seal with lids and rings. Process in a hot water bath for 10 minutes to ensure a seal.\n",
        "picture_link": "JExN/JYWAevExU6fyTKpAERyMdlCHSe"
    },
    {
        "title": "Summa Borscht",
        "ingredients": [
            "5 cups diced red potatoes ADVERTISEMENT",
            "7 cups water ADVERTISEMENT",
            "4 teaspoons salt ADVERTISEMENT",
            "1 1/4 cups green onions, chopped ADVERTISEMENT",
            "1/3 cup chopped fresh dill ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place diced potatoes into a large saucepan, and cover with water. Bring to a boil over high heat, then reduce heat, and simmer until potatoes are tender, about 25 minutes. Stir in the green onions, dill, and buttermilk; bring back to a simmer. Stir in the half-and-half before serving.\n",
        "picture_link": "GXd8mwf9DiTekcsh96GI4LTov1FzTy2"
    },
    {
        "title": "Italian-Style Quinoa-Stuffed Sole",
        "ingredients": [
            "1/4 cup quinoa ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "4 (2 ounce) sole fillets ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "4 lemon slices ADVERTISEMENT",
            "ground black pepper ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the quinoa, 1/2 cup water, parsley, basil, and lemon zest in a small saucepan over high heat. Bring to a boil, then reduce heat to medium-low, cover, and simmer until the quinoa is tender, about 20 minutes. Pour into a mixing bowl, fold in the Parmesan cheese, and allow the mixture to cool.\nPreheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Lightly grease a small baking dish.\nSpoon a quarter of the quinoa mixture onto one end of each sole fillet. Fold the other side of the sole overtop, sprinkle with black pepper, and place a lemon slice on top. Place the sole into the prepared baking dish, and add the vinegar and remaining water.\nBroil in the preheated oven until the sole flakes easily with a fork, and the flesh is opaque, 3 to 4 minutes.\n",
        "picture_link": "HZCBrV298cpvBJloaIvbt7qaiXlgsgO"
    },
    {
        "title": "Big E's BBQ Rub",
        "ingredients": [
            "1 tablespoon ground mustard ADVERTISEMENT",
            "1 tablespoon seafood seasoning, such as Old Bay™ ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 tablespoon ground white pepper ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together mustard, seafood seasoning, garlic powder, white pepper, black pepper, red pepper flakes, paprika, salt, cumin, white sugar, and brown sugar in a bowl until evenly combined.\nTo use, rub the mixture on up to 5 pounds of meat and refrigerate from 2 to 12 hours before smoking or grilling.\n",
        "picture_link": "LGFvum/RFBgJ3dD/FUGz2hcuWPSRJui"
    },
    {
        "title": "Gazpacho a la Mrs. Landesman",
        "ingredients": [
            "3 cloves garlic, crushed ADVERTISEMENT",
            "1 onion, coarsely chopped ADVERTISEMENT",
            "1 cucumber, sliced ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped ADVERTISEMENT",
            "5 tomatoes, peeled and quartered ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 (12 fluid ounce) can tomato juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the container of a food processor or blender, combine the garlic, onion, cucumber, bell pepper, tomatoes, olive oil, vinegar, parsley, salt and pepper. Cover and blend to your desired texture. Stir in the tomato sauce and paprika and transfer to a bowl or container. Refrigerate for at least 1 hour to blend the flavors.\n",
        "picture_link": "VhkjBVQgh8j8p5lxlwFqYpj3922FwZ2"
    },
    {
        "title": "Chocolate and Blueberry Smoothie",
        "ingredients": [
            "2 teaspoons cocoa powder ADVERTISEMENT",
            "1 teaspoon hot water ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "4 tablespoons frozen blueberries ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "4 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the cocoa powder and water in a small bowl until the cocoa is dissolved.\nPlace the cocoa mixture, milk, blueberries, sugar, and ice cubes into a blender; cover and blend until smooth, 30 to 45 seconds. Serve cold.\n",
        "picture_link": "oiEVFg/MF2TZ0eANqNFf5CVYcospRTe"
    },
    {
        "title": "Microwave Flan",
        "ingredients": [
            "3 cups white sugar, divided ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 cup of sugar (dry) in a saucepan over medium heat. Do not stir until you start to see the sugar melting and bubbling. When the sugar is completely melted and golden brown, pour it into a 9 inch glass or ceramic pie plate and tilt to coat.\nIn a large bowl, mix the milk, remaining sugar, vanilla and eggs until well blended. Pour into the pie plate.\nCook in the microwave at 50% power for 7 minutes, then cook at 100% power for 8 minutes. A knife inserted into the center of the flan should come out clean when it is done. If it is not done after the 8 minutes, cook at one minute intervals, checking each time. Cool and refrigerate before serving.\nTo serve, warm the bottom of the pie plate over a pan of simmering water to loosen the caramelized sugar. Place a serving plate on top of the dish, and invert so that the flan is on the serving dish and the caramelized coating is on top.\n",
        "picture_link": "yvdTAEUiThIljiqeTY/DqLZ6fHSsjiO"
    },
    {
        "title": "Fresh Fruit Breakfast Lasagna",
        "ingredients": [
            "1 1/2 cups milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 cups sliced fresh strawberries ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1 cup whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the crepes, whisk together the milk, flour, eggs, oil, almond extract, and sugar in a bowl until you have a smooth batter. Lightly grease a small skillet and place over medium heat. Spoon in 2 tablespoons of batter and gently tilt the skillet to spread the batter to the edges of the pan. Cook until brown, 1 to 2 minutes. Flip the crepe and cook the other side until brown. Remove to a plate. Repeat with remaining batter until it is all used.\nTo make the filling, whisk together the pudding mix, orange juice, and sour cream in a bowl. Gently fold the strawberries, bananas and blueberries into the sour cream mixture.\nLightly grease the bottom of a baking dish. Cover the bottom of the dish with 1/3 of the crepes. Spoon 1/2 of the fruit mixture over the crepes. Repeat with remaining fruit and crepes, finishing with the crepes as the top layer. Garnish with whipped cream. Allow to sit 30 minutes before serving.\n",
        "picture_link": "8Ma3svTdPm9tkyET7yti4H1VhKRmtme"
    },
    {
        "title": "Italian Ribollita (Vegetable and Bread Soup)",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large red onion, diced ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "4 potatoes, diced ADVERTISEMENT",
            "10 (5 inch) zucchini, diced ADVERTISEMENT",
            "1 leek, sliced ADVERTISEMENT",
            "1 quart hot water ADVERTISEMENT",
            "1 bunch Swiss chard, chopped ADVERTISEMENT",
            "1 head Savoy cabbage, quartered, cored and shredded ADVERTISEMENT",
            "1 bunch kale, shredded ADVERTISEMENT",
            "2 (15.5 ounce) cans cannellini beans, drained and rinsed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons tomato puree ADVERTISEMENT",
            "8 slices day-old bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the olive oil in a deep pan and heat over medium-high heat. Stir in the onion, and cook until transparent, about 5 minutes. Mix in the carrots, celery, potatoes, zucchini, and leek. Stir and cook 5 minutes more. Pour in the hot water to cover the vegetables. Stir in the Swiss chard, Savoy cabbage, and kale. Cover, reduce heat to medium, and simmer for 1 hour.\nPlace 1 can of beans in a blender or food processor bowl. Blend until smooth. Stir pureed beans into the vegetable mixture along with the second can of beans. Season to taste with salt and pepper. Reduce heat to low, and simmer for 20 minutes, stirring occasionally. Stir in the tomato puree.\nPrepare the soup by layering slices of bread with the vegetable mixture in a casserole or soup dish. Cover, and refrigerate for at least 8 hours, or overnight.\nTo serve the soup, place in a pot, and reheat over medium heat. Serve hot.\n",
        "picture_link": "esL5duhxc28asuOcHk.nFK2.brHM5XK"
    },
    {
        "title": "Costa Rican Coffee Panna Cotta with Bittersweet Chocolate-Rum Sauce",
        "ingredients": [
            "2 teaspoons unflavored gelatin ADVERTISEMENT",
            "1/4 cup dark rum ADVERTISEMENT",
            "1 1/4 cups whipping cream ADVERTISEMENT",
            "1/2 cup dark brown sugar ADVERTISEMENT",
            "1 tablespoon instant espresso powder ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "3/4 cup whipping cream ADVERTISEMENT",
            "2 tablespoons dark colored corn syrup ADVERTISEMENT",
            "8 ounces bittersweet chocolate, chopped ADVERTISEMENT",
            "1 tablespoon dark rum ADVERTISEMENT",
            "8 sprigs fresh mint for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle the unflavored gelatin over 1/4 cup of dark rum and allow to soften for 5 minutes.\nMeanwhile, stir together 1 1/4 cups of whipping cream, brown sugar, and espresso powder in a saucepan over medium-high heat. Bring to a simmer, stirring until brown sugar has dissolved. Remove from heat, then whisk in gelatin mixture until dissolved.\nWhisk in the coconut milk, vanilla extract, and sour cream until smooth. Evenly divide the mixture between eight 3/4 cup custard cups or molds, cover each with plastic wrap, and chill at least 4 hours to overnight.\nBring 3/4 cup whipping cream and corn syrup to a simmer over medium-high heat. Once simmering, remove from heat, and stir in the chocolate until melted and smooth, about 2 minutes. Stir in 1 tablespoon of rum and set aside.\nTo serve, run a knife around the edge of each mold, then set each cup into a shallow bowl of hot water for 10 seconds to loosen. Invert the mold over a serving plate and remove the panna cotta. Spoon chocolate sauce around each panna cotta and garnish with a sprig of mint.\n",
        "picture_link": "0glpzikS8qLbqeUDW9HaMfX.K1rH1vm"
    },
    {
        "title": "Kid-Friendly Chicken Nuggets",
        "ingredients": [
            "2 cups crushed potato chips ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves, cut into 1 1/2-inch cubes ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPour potato chips into a shallow dish. Beat egg and milk together in a separate shallow dish. Dip chicken cubes in egg mixture and press into potato chips until evenly coated; transfer coated chicken to a baking sheet. Drizzle coated chicken with melted butter.\nBake in the preheated oven until chicken is no longer pink in the center and the coating is golden brown, 15 to 18 minutes.\n",
        "picture_link": "UAVt1F40lnxAr3b67/qeLUgJ5ei7gzy"
    },
    {
        "title": "French Toast Sausage Fluffins",
        "ingredients": [
            "1 (9.6 ounce) box pre-cooked maple flavored pork sausage links ADVERTISEMENT",
            "2 3/4 cups all-purpose flour* ADVERTISEMENT",
            "1 (.25 ounce) envelope Fleischmann's® RapidRise Yeast ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup very warm milk (120 to 130 degrees F) ADVERTISEMENT",
            "1 tablespoon Mazola® Corn Oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon Spice Islands® Pure Vanilla Extract ADVERTISEMENT",
            "Cinnamon Sugar Topping: ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "1/2 teaspoon Spice Islands® Ground Saigon Cinnamon ADVERTISEMENT",
            "2 tablespoons butter OR margarine, melted ADVERTISEMENT",
            "For Dipping (optional): ADVERTISEMENT",
            "Pancake syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Reheat sausage according to package directions (this will remove any excess moisture). Cool on paper towels for 5 minutes; pat dry. Slice into very thin slices and set aside.\nCombine 1-1/2 cups flour, undissolved yeast, sugar and salt in large mixer bowl. Add milk, oil, egg and vanilla; beat 2 minutes on medium speed. Gradually add remaining 1-1/4 cups flour to make a stiff yet sticky dough. Stir in sausage. Cover bowl and let rest 10 minutes.\nPortion dough into 12 (2-1/2 inch) generously greased muffin cups using a scoop or two spoons (do not use paper liners). Cover and let rise 35 to 45 minutes. Dough will rise, but not double in size. Combine sugar and cinnamon for topping in a small bowl; set aside.\nBake in preheated 375 degrees F oven for 20 to 25 minutes until well browned. Let cool on wire rack for 2 minutes. Brush with butter and sprinkle with cinnamon sugar mixture. Run a knife around each roll to remove from pan. Serve warm with pancake syrup, if desired. Refrigerate any leftovers.\n",
        "picture_link": "f7ApKEbbkFTGqoS1I2FT/PDNH.nTBpy"
    },
    {
        "title": "Baked Whiting",
        "ingredients": [
            "4 whiting fish fillets, or more to taste ADVERTISEMENT",
            "1/2 cup milk, or as needed ADVERTISEMENT",
            "1 pinch garlic powder, or more to taste ADVERTISEMENT",
            "1 pinch onion powder, or more to taste ADVERTISEMENT",
            "1 pinch paprika, or more to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 Roma (plum) tomato, diced ADVERTISEMENT",
            "4 teaspoons butter, or more to taste ADVERTISEMENT",
            "2 lemon, juiced, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace whiting fillets in a baking dish and add enough milk to cover the entire bottom of the dish. Season fillets with garlic powder, onion powder, paprika, and salt. Top each fillet with at least 3 pieces tomato. Add butter to each fillet. Squeeze 1 lemon half over each fillet.\nBake in the preheated oven until fish flakes easily with a fork, 30 to 45 minutes.\n",
        "picture_link": "pY6O0afewx.n.TNyzGW11/XtUtEKfLK"
    },
    {
        "title": "Gluten Free Pumpkin Cheesecake",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 cup almond meal ADVERTISEMENT",
            "1/2 cup crushed slivered almonds ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 3/4 cups pumpkin puree ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk almond meal, slivered almonds, 1/4 cup sugar, baking soda, and 1/4 teaspoon cinnamon together in a bowl; stir in butter until almond mixture is evenly moistened. Pour almond mixture into a 10-inch springform pan and press firmly into the bottom.\nBake in the preheated oven until crust is set, about 10 minutes. Remove crust from oven and reduce temperature to 325 degrees F (165 degrees C). Place a pan of hot water onto the bottom rack of the oven to help reduce cracking in the cheesecake.\nBeat cream cheese, sour cream, pumpkin puree, 1 cup sugar, eggs, 1 teaspoon cinnamon, ginger, vanilla extract, and salt together in a large bowl using an electric mixer, scraping bottom and sides of bowl frequently, until filling is smooth. Pour filling over hot crust.\nPlace pan on the center rack in oven and bake until cheesecake peaks in the center, 1 hour to 1 hour 15 minutes. Cool to room temperature before removing sides of pan. Transfer cheesecake to a serving plate and cover loosely with plastic wrap. Chill in refrigerator before serving, at least 2 hours.\n",
        "picture_link": "iWubuxG1P35oPcrHxybW2/v2LxyQpm."
    },
    {
        "title": "Great Chicken Taquitos",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "3 1/2 cups vegetable oil (such as Crisco®), divided ADVERTISEMENT",
            "1 cup finely chopped tomatoes ADVERTISEMENT",
            "1/2 cup minced green onions ADVERTISEMENT",
            "6 tablespoons chicken broth ADVERTISEMENT",
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "12 (6 inch) corn tortillas ADVERTISEMENT",
            "12 wooden picks ADVERTISEMENT",
            "1 cup shredded lettuce, or to taste ADVERTISEMENT",
            "1/4 cup guacamole, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a simmer in a skillet over medium heat; add chicken. Cover skillet and cook until chicken is no longer pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from water and cool; shred with a fork.\nHeat 1 tablespoon vegetable oil in a skillet over medium heat; cook and stir chicken, tomatoes, green onions, chicken broth, flour, garlic, cumin, oregano, chili powder, and salt until heated through, 3 to 5 minutes.\nHeat remaining vegetable oil in a heavy 10-inch skillet over medium heat; carefully dip tortillas in the hot oil to soften, about 1 minute. Remove tortillas with tongs and drain on paper towels, reserving oil. Heat oil to 375 degrees F (190 degrees C).\nSpoon about 2 tablespoons chicken mixture down the center of each tortilla. Tightly roll each tortilla around the filling and secure with a wooden toothpick.\nFry rolled-up tortillas, working in batches, in hot oil until golden brown, 3 to 5 minutes. Remove taquitos with a slotted spoon and drain on paper towels. Serve taquitos on a bed of shredded lettuce with guacamole on the side.\n",
        "picture_link": "lVp65eHmRfa8wODU2X.7zmbuagM6fTW"
    },
    {
        "title": "Stuffed Orange Peppers",
        "ingredients": [
            "6 orange bell peppers, tops and seeds removed ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, or more to taste ADVERTISEMENT",
            "1/2 cup white rice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "1 cup shredded Gouda cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil; cook orange bell peppers until slightly softened, about 5 minutes. Drain.\nHeat a large skillet over medium-high heat. Cook and stir turkey and onion in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nPreheat oven to 350 degrees F (175 degrees C).\nStir tomatoes, rice, 1/2 cup water, and liquid smoke into turkey mixture; cover skillet and simmer until rice is tender, about 15 minutes. Remove skillet from heat; stir Gouda cheese into turkey mixture.\nStuff each orange bell pepper with turkey mixture and place peppers, open-side up, in a baking dish. Cover dish with aluminum foil.\nBake in the preheated oven until heated through and cheese is melted, 25 to 35 minutes.\n",
        "picture_link": "JUBNj5q1DreR.xDmEdrBWHxJMMamXI2"
    },
    {
        "title": "Chef John's Truffled Potato Gratin",
        "ingredients": [
            "1 1/3 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "5 cups sliced mushrooms ADVERTISEMENT",
            "2 teaspoons butter, softened ADVERTISEMENT",
            "1 clove garlic, minced (optional) ADVERTISEMENT",
            "5 russet potatoes, peeled and very thinly sliced ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon minced fresh thyme, divided ADVERTISEMENT",
            "6 ounces sottocenere (Italian semi-soft truffle cheese), shredded ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 1/3 tablespoon butter with olive oil in a large saucepan over medium-high heat; cook mushrooms in the hot butter-oil mixture, stirring often, until browned on the edges, 15 to 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Combine 2 teaspoons softened butter with garlic in a small bowl; butter a 9x13-inch baking dish with garlic butter.\nSpread 1/3 the potatoes into the bottom of the prepared baking dish in a layer; season with salt, black pepper, 1/2 the thyme leaves, and 1/2 the cooked mushrooms. Sprinkle almost half the sottocenere cheese over potatoes, reserving about 3 tablespoons for the top. Layer next 1/3 the potatoes over cheese, season with salt and black pepper, remaining 1/2 thyme leaves, 1/2 the remaining cheese, remaining mushrooms, and last layer of potatoes. Season potatoes with more salt and black pepper. Pour chicken stock and cream over the top. Sprinkle with more salt and black pepper and reserved 3 tablespoons of sottocenere cheese. Cover dish loosely with aluminum foil; tent the foil a little so it doesn't touch the potatoes.\nBake in the preheated oven until potatoes are bubbly, about 45 minutes. Remove foil and cook until top is browned, about 15 more minutes. Let cool slightly before serving.\n",
        "picture_link": "t4fKZzrnsqPUnaxTd0pf4pHt1dZzcJK"
    },
    {
        "title": "Easy Curried Cauliflower Soup",
        "ingredients": [
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1/2 onion, sliced, or to taste ADVERTISEMENT",
            "3 carrots, cut into 1/2-inch slices ADVERTISEMENT",
            "1/2 red bell pepper, sliced ADVERTISEMENT",
            "3 cloves garlic, peeled, or more to taste ADVERTISEMENT",
            "1 head cauliflower, chopped ADVERTISEMENT",
            "1 (32 fluid ounce) container chicken stock, or as needed ADVERTISEMENT",
            "2 tablespoons yellow curry powder ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 dashes hot sauce (such as Tapatio®), or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat; cook and stir onion, carrots, red bell pepper, and garlic until tender and softened, 5 to 10 minutes. Add cauliflower to vegetable mixture and pour in chicken broth; bring to a boil. Cook soup until cauliflower is tender, about 10 minutes.\nRemove pot from heat and blend soup using a hand blender until smooth.\nPlace pot over low heat and add curry powder, butter, hot sauce, salt, and pepper to soup; simmer until flavors have blended, about 15 minutes more.\n",
        "picture_link": "SwPX3Kv4iy3UimdXnB0lRlfRFG.sZja"
    },
    {
        "title": "Eggless Peanut Butter Chocolate Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/3 cups oats ADVERTISEMENT",
            "2/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "1/2 cup chocolate chips, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line muffin cups with paper liners.\nWhisk flour, sugar, oats, cocoa powder, and baking powder together in a bowl.\nCombine milk and peanut butter in a saucepan; cook and stir over medium-low heat until mixture is smooth, about 5 minutes. Remove saucepan from heat and slightly cool peanut butter mixture, about 5 minutes. Stir peanut butter mixture into flour mixture until batter is just combined; fold in chocolate chips. Spoon batter into prepared muffin cups, about 2/3 full.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 13 minutes.\n",
        "picture_link": "YcuVHuPk80t/TcFGaA.nzDZmdyzAYF2"
    },
    {
        "title": "Banana Bread from Mott's®",
        "ingredients": [
            "1/2 cup Mott's® Natural Applesauce ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "4 medium ripe bananas, mashed ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F. Spray 8 1/2 x 4 1/2-inch loaf pan with nonstick cooking spray. In large bowl, combine flour, baking powder, baking soda and allspice.\nIn medium bowl, whisk together bananas, sugar, applesauce, egg whites, oil and vanilla.\nBake 60 minutes or until toothpick inserted into center comes out clean. Cool in pan 10 minutes. Invert onto wire rack. Turn right side up. Cool completely.\n",
        "picture_link": "OLGVd/UY9TITPGppUZ7QY35Kdy2Pn0."
    },
    {
        "title": "Four-Cheese Truffled Macaroni and Cheese",
        "ingredients": [
            "1 (16 ounce) package cavatappi (corkscrew macaroni) ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1/2 cup flour ADVERTISEMENT",
            "5 1/2 cups milk, divided ADVERTISEMENT",
            "2 1/2 cups shredded smoked Gouda cheese ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups shredded Swiss cheese ADVERTISEMENT",
            "1 1/2 cups grated Parmesan cheese, divided ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1 tablespoon truffle oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook cavatappi in boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain.\nMelt butter in a large pot over medium-low heat. Whisk flour into butter until mixture has a thick, paste-like consistency, about 30 seconds. Slowly whisk 2 cups milk into butter-flour mixture until smooth. Stir in remaining milk, increase heat to medium high, and cook, whisking constantly, until mixture is thick and almost boiling, 5 to 10 minutes.\nStir Gouda cheese, Cheddar cheese, Swiss cheese, and 1 cup Parmesan cheese into milk mixture until cheese melts and cheese sauce is smooth. Fold cavatappi into cheese sauce; pour mixture into prepared baking dish.\nStir remaining Parmesan cheese and bread crumbs together in a small bowl. Sprinkle bread crumbs mixture over cavatappi mixture and drizzle truffle oil over the top.\nBake in the preheated oven until golden and bubbling, about 30 minutes. Cool for 10 minutes before serving.\n",
        "picture_link": "NYSrQ0a.BZwfC6K1QJuYEfiP9Yl/5sW"
    },
    {
        "title": "Skillet Dinner Rolls",
        "ingredients": [
            "2 1/2 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "2 (.25 ounce) envelopes Fleischmann's® RapidRise Yeast ADVERTISEMENT",
            "3 tablespoons sugar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons Mazola® Vegetable Plus! Oil ADVERTISEMENT",
            "4 tablespoons butter, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1 cup flour, undissolved yeast, sugar and salt in a large mixer bowl. Heat water, oil and 2 tablespoons butter until very warm (120 to 130 degrees F). Add to flour mixture. Beat 2 minutes at medium speed of electric mixer, scraping bowl occasionally. Add 1/2 cup flour; beat 2 minutes at high speed. Stir in enough remaining flour to make soft dough. Knead on lightly floured surface until smooth and elastic, about 5 to 7 minutes. Cover; let rest 10 minutes.\nDivide dough into 12 equal pieces; shape into balls. Place in a greased 10-inch iron skillet. Cover; let rise in warm, draft-free place until doubled in size, about 30 to 45 minutes. Melt remaining 2 tablespoons of butter and brush over rolls.\nBake in preheated 375 degrees F oven for 18 to 20 minutes or until lightly browned. Remove from pan; brush with any remaining butter, if desired. Serve warm.\n",
        "picture_link": "3r4PMU5nXHJ/fMB8TfuIgqgsLngg9Gy"
    },
    {
        "title": "Banana Layer Cake",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/3 cup buttermilk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3 large ripe bananas, mashed ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (8 inch) round pans.\nIn a large bowl, cream together 1/2 cup butter and 1 1/2 cups sugar until light and fluffy. Beat in the egg yolks one at a time. Dissolve soda in buttermilk; add to creamed mixture alternately with flour, beginning and ending with flour. Stir in the mashed bananas and pecans.\nIn a large glass or metal mixing bowl, beat egg whites until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain. Pour batter into prepared pans.\nBake in the preheated oven for 30 to 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pans for 10 minutes, then turn out onto a wire rack and cool completely. Spread Caramel Frosting between layers and on top and sides of cooled cake.\nTo make the Caramel Frosting: In a heavy saucepan, combine 1 1/4 cup sugar, 3/4 cup brown sugar, evaporated milk and 1/2 cup butter. Cook over medium heat, stirring frequently, until mixture reaches softball stage (240 degrees F; 116 degrees C). Remove from heat, and beat until spreading consistency; add additional milk if necessary. Spread immediately on cooled cake.\n",
        "picture_link": "yzl6PHy8rGxlmes9AlqTlcTlpo3Cu8u"
    },
    {
        "title": "Native American Galette",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.\nIn a large bowl, stir together flour, salt and baking powder. Cut in butter until mixture resembles coarse crumbs. Stir in milk, mixing just until dough holds together. Form dough into a round and place onto prepared baking sheet.\nBake in preheated oven for 30 minutes, or until a butter knife inserted into center of the loaf comes out clean.\n",
        "picture_link": "wbOtxr8WeVmm2uOpCfJzlorOvqIfMpi"
    },
    {
        "title": "Luscious Raspberry Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/3 cup raspberry syrup ADVERTISEMENT",
            "1/3 cup buttermilk ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "1 cup raspberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet.\nIn a large bowl, stir together flour, baking soda and baking powder. Mix in butter and raspberry syrup. Add buttermilk and cream; mix just until moistened. Fold in raspberries. Form into an oblong loaf and place on a baking sheet.\nBake in preheated oven for 12 to 15 minutes. Remove from the oven and cut loaf into 6 wedge shaped pieces. Place pieces on baking sheet and continue baking for 15 minutes, until golden.\n",
        "picture_link": "Ds5HkacBeUPXQ4cGUu0xDj4bFNnfWKm"
    },
    {
        "title": "Bubble 'n' Squeak II ",
        "ingredients": [
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 medium head cabbage, quartered ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add farfalle pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet over medium heat, saute cabbage in olive oil. If skillet gets dry add a bit more oil. Saute about 10 minutes then add cooked farfalle pasta. Reduce heat to low and cook, stirring occasionally, for about 20 minutes more. Sprinkle on pepper to taste.\n",
        "picture_link": "3naxmSZqoU5a0EWrTOcwM2qb.0kDysW"
    }
]