[
    {
        "title": "Iced Mochas",
        "ingredients": [
            "1 1/2 cups cold coffee ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/4 cup chocolate syrup ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour coffee into ice cube tray. Freeze until solid, or overnight.\nIn a blender, combine coffee ice cubes, milk, chocolate syrup and sugar. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "YJJ3Pt3hS2eWbB4KwSx0rs54Rmb3DL6"
    },
    {
        "title": "Baked Havarti Chicken",
        "ingredients": [
            "4 boneless, skinless chicken breast halves ADVERTISEMENT",
            "Italian dressing ADVERTISEMENT",
            "1 tablespoon Greek seasoning, or to taste (optional) ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon white cooking wine ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 (4 ounce) cans whole green chili peppers, drained, and sliced lengthwise ADVERTISEMENT",
            "4 ounces sliced Havarti cheese with dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMarinate chicken in Italian dressing and Greek seasoning in a bowl, at least 30 minutes.\nPlace chicken in a 9x13-inch baking dish. Sprinkle top with additional Greek seasoning.\nBake in preheated oven until no longer pink in center and juices run clear, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nMelt butter in a skillet over medium-high heat until bubbling. Pour in wine, Worcestershire sauce, and garlic salt; bring to a boil. Stir in mushrooms; reduce to a simmer, cover, and cook until mushrooms are tender, about 3 to 5 minutes. Seasoning mixture with salt.\nArrange green chili peppers lengthwise and Havarti cheese on top of chicken. Return to the oven and bake until cheese has melted, about 5 minutes. Top chicken with mushrooms and pan juices.\n",
        "picture_link": "cQNxib4B0o4HJUTO57DPMxQyJpYdUtC"
    },
    {
        "title": "Our Favorite Balsamic Vinaigrette",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the olive oil, balsamic vinegar, honey, Dijon mustard, shallot, garlic, salt, and black pepper together in a glass jar with a lid. Replace lid on the jar and shake vigorously until thoroughly combined.\n",
        "picture_link": "wCC4pHXPadrn.PeOmMXV3W4CFh1Hij."
    },
    {
        "title": "Quick Chicken with Asparagus and Provolone",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "5 tablespoons olive oil ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup Italian-style dry bread crumbs ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 (10 ounce) can asparagus, drained ADVERTISEMENT",
            "4 slices provolone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large 2-inch deep skillet. Dip chicken in egg beat, then coat in bread crumbs. Brown in skillet on both sides.\nWhen chicken is browned, add broth and place asparagus evenly over chicken. Lay a slice of cheese over each chicken piece.\nCover skillet and cook over medium heat for 15 minutes, or until chicken is cooked through and no longer pink inside.\n",
        "picture_link": "en.jSj4o/BE0IDVzPn6DJgpMaeTvgFi"
    },
    {
        "title": "Chocolate Meringue Cookies",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1/3 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nCombine egg whites, cream of tartar, and vanilla. Beat until the whites form soft peaks. Slowly add sugar; beat until stiff peaks form, and mixture becomes glossy. Fold in cocoa and chocolate chips.\nDrop mixture by teaspoonfuls on to a greased cookie sheet. Bake for 25 to 30 minutes.\n",
        "picture_link": "sZI1fqu2WCfcAhhGjrBCLv5MRofDDc2"
    },
    {
        "title": "Perfect Lemon Curd",
        "ingredients": [
            "3/4 cup fresh lemon juice ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup unsalted butter, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 2 quart saucepan, combine lemon juice, lemon zest, sugar, eggs, and butter. Cook over medium-low heat until thick enough to hold marks from whisk, and first bubble appears on surface, about 6 minutes.\n",
        "picture_link": "479g4o2qT2ZkIIpFogUaBGdMW0axDr6"
    },
    {
        "title": "Italian Chicken Marinade",
        "ingredients": [
            "1 (16 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow baking dish, mix the salad dressing, garlic powder, and salt. Place the chicken in the bowl, and turn to coat. Marinate in the refrigerator at least 4 hours. (For best results, marinate overnight.)\nPreheat the grill for high heat.\nLightly oil grate. Discard marinade, and grill chicken 8 minutes on each side, or until juices run clear.\n",
        "picture_link": "pAFraf6U4CEh9iliBe23Pbd4hPyMD2y"
    },
    {
        "title": "Potato Skillet",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "2 peeled and diced potatoes ADVERTISEMENT",
            "1/8 teaspoon garlic salt ADVERTISEMENT",
            "1/8 teaspoon seasoning salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Remove bacon slices, reserving grease. Crumble bacon and set aside.\nAdd potatoes to bacon grease and season with garlic salt, seasoned salt and black pepper. Cook until potatoes are soft.\nWhen potatoes are tender, add crumbled bacon. Pour eggs over potatoes and cook until firm. Spread with cheese and cover with lid until melted.\n",
        "picture_link": "jE3/oGzgNUgJmP4QtmsH50H6ABMmQLy"
    },
    {
        "title": "Quick and Easy Cheese Bread",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, mix together flour, sugar, baking powder, salt and cheese. In another large bowl, beat together egg, milk and oil. Stir the flour/cheese mixture into the egg mixture, stirring until just moistened. Pour batter into prepared pan.\nBake in preheated oven for 35 minutes, until a toothpick inserted into center of loaf comes out clean.\n",
        "picture_link": "psELlOd6aNnmm38tVZSSxLavnyu8rj."
    },
    {
        "title": "Chicken and Peppers with Balsamic Vinegar",
        "ingredients": [
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "1 yellow bell pepper, thinly sliced ADVERTISEMENT",
            "1 orange bell pepper, thinly sliced ADVERTISEMENT",
            "1 medium onion, thinly sliced ADVERTISEMENT",
            "4 large cloves garlic, finely chopped ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1/4 cup balsamic vinegar, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Place the chicken in the skillet, season with salt and pepper, and brown on both sides. Remove from heat, and set aside.\nHeat remaining oil in the skillet over medium heat, and stir in the red bell pepper, yellow bell pepper, orange bell pepper, and onion. Cook about 5 minutes, until tender. Mix in the garlic, and cook and stir about 1 minute. Mix in the basil and 2 tablespoons balsamic vinegar.\nReturn the chicken to the skillet. Reduce heat to low, cover, and simmer 20 minutes, or until chicken is no longer pink and juices run clear. Stir in remaining balsamic vinegar just before serving.\n",
        "picture_link": "ZWG.NOpXxG0WiZRm.9QclC9N3ERjJ9u"
    },
    {
        "title": "Quick and Easy Sauteed Spinach",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 (10 ounce) bag spinach leaves ADVERTISEMENT",
            "1 1/2 teaspoons garlic salt ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium heat. Add the spinach to the skillet and cover; allow to cook 5 minutes. Stir in the garlic salt and cover again for another 5 minutes; remove from heat. Sprinkle with Parmesan cheese to serve.\n",
        "picture_link": "LOaD/pw6ANU5AxibzUoBgimKx0fO1Vm"
    },
    {
        "title": "Ed Zieba's Famous Family Pork Chops",
        "ingredients": [
            "8 bone-in pork chops ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "3 onions, sliced ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nSeason the pork chops with seasoned salt and place in a glass baking dish. Arrange onion slices on top of pork chops, then pour the water into the pan. Cover with aluminum foil.\nBake for 1 hour in the preheated oven, then reduce the oven temperature to 300 degrees F (150 degrees C). Continue to cook until an instant-read thermometer inserted into the center reaches 145 degrees F (63 degrees C), about another 30 minutes.\n",
        "picture_link": "PQE0UBLRYluK1jmLSz.OBdGLe3s4Wva"
    },
    {
        "title": "Chicken Oreganato",
        "ingredients": [
            "7 chicken thighs ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nWash chicken well and pat dry. Mix oregano with salt and pepper to taste. Rub well over all of the chicken pieces. Put chicken in a greased 9x13 inch baking dish.\nWhisk the oil with the lemon juice and drizzle half over the chicken. Bake in preheated oven for 15 minutes. Turn the chicken pieces and drizzle with the remaining oil/lemon mixture. Bake for another 15 to 20 minutes. Serve warm, cold or at room temperature!\n",
        "picture_link": "8IwI5HXFphgT0Sz8hqW/u2TpSzWBxji"
    },
    {
        "title": "Jambalaya II",
        "ingredients": [
            "1 (2 to 3 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "1 pound smoked sausage, sliced ADVERTISEMENT",
            "3 green bell peppers, diced ADVERTISEMENT",
            "2 onions, diced ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 (14.5 ounce) cans peeled and diced tomatoes ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "5 bay leaves ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken and sausage in a large pot and cover with water. Bring to a boil, then reduce heat and simmer until chicken is opaque and falls from the bone, 45 minutes. (I usually do this the night before and refrigerate to skim the fat.) Remove chicken and sausage, reserving broth. Shred chicken.\nIn a large pot over medium heat, cook bell pepper, onion and garlic until onion is translucent, adding reserved chicken broth if necessary. Stir in tomatoes, chili powder, pepper sauce, cayenne, Worcestershire and bay leaves; reduce heat and simmer 15 minutes.\nStir the shredded chicken, sausage and tomato paste into the spiced vegetables. Continue to simmer until flavor is as spicy as you like, adding reserved liquid as needed to thin.\nStir in 1 cup reserved liquid with the rice. Simmer 20 minutes, until rice is tender. Serve or continue to simmer, as desired.\n",
        "picture_link": "qiZVHu02Lz7RhF5S6yw.Gd5xR6lzQmO"
    },
    {
        "title": "Mexican Wedding Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup chopped almonds ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream the butter and sugar. Stir in vanilla and water. Add the flour and almonds, mix until blended. Cover and chill for 3 hours.\nPreheat oven to 325 degrees.\nShape dough into balls or crescents. Place on an unprepared cookie sheet and bake for 15 to 20 minutes in the preheated oven. Remove from pan to cool on wire racks. When cookies are cool, roll in confectioners' sugar. Store at room temperature in an airtight container.\n",
        "picture_link": "6MqU/oEtLOFs4ugpxIJhTXePyg6c6W6"
    },
    {
        "title": "White Chocolate Gorp",
        "ingredients": [
            "2 pounds white chocolate ADVERTISEMENT",
            "6 cups crispy rice cereal squares, e.g., Rice Chex ™ ADVERTISEMENT",
            "3 cups toasted oat cereal ADVERTISEMENT",
            "2 cups thin pretzel sticks ADVERTISEMENT",
            "2 cups cashews ADVERTISEMENT",
            "1 (12 ounce) package mini candy-coated chocolate pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate in a large saucepan over low heat or in microwave until just until soft. Stir until melted. Combine all the other ingredients in big roaster pan or bowl. Stir chocolate into mixture. Turn out on waxed paper. Of course anything you like can be added or substituted-but this recipe is a great combination!\nCombine the crispy rice cereal squares, toasted oat cereal, pretzels, cashews and candy in big roaster pan or bowl. Stir chocolate into mixture. Turn out on waxed paper and let cool.\n",
        "picture_link": "UuldshgCBvNdQIonJfDs.EujBf88vau"
    },
    {
        "title": "Dominican Style Oatmeal",
        "ingredients": [
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup quick cooking oats ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk, oats, sugar, cinnamon, nutmeg, and salt in a saucepan. Bring to a boil, stirring constantly for 2 minutes.\n",
        "picture_link": "bAbhHYxL686Kx8iMIpqezLyToUWJPge"
    },
    {
        "title": "Quick Tuna Casserole",
        "ingredients": [
            "1 (7.25 ounce) package macaroni and cheese mix ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (9 ounce) can tuna, drained ADVERTISEMENT",
            "1 (10 ounce) can peas, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare macaroni and cheese mix according to package directions. Stir in the cream of mushroom soup, tuna and peas. Mix well, and heat until bubbly.\n",
        "picture_link": "Eq6jk6kJI.yPNqKI1Rq5cGixUDtIxI2"
    },
    {
        "title": "Yummy Quiche",
        "ingredients": [
            "8 ounces bacon ADVERTISEMENT",
            "1 (9 inch) unbaked 9 inch pie crust ADVERTISEMENT",
            "2 cups sharp Cheddar cheese, shredded ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "5 eggs, lightly beaten ADVERTISEMENT",
            "1 1/2 cups half-and-half ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 (4 ounce) can diced green chile peppers, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nPlace crust in a 9 inch glass pie plate. Sprinkle bacon inside of crust. In a small bowl, combine Cheddar cheese, Monterey jack cheese and flour. In a separate bowl, beat together eggs, cream, onion and green chiles. Add cheese mixture; stir well. Pour mixture into pie crust.\nBake in preheated oven for 60 to 70 minutes, until set. Let stand 10 minutes before serving.\n",
        "picture_link": "Wte69GQDnOkUPtGO.tkIsRA9dLPFI4S"
    },
    {
        "title": "Tomato, Cucumber and Red Onion Salad with Mint",
        "ingredients": [
            "2 large cucumbers - halved lengthwise, seeded and sliced ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 large tomatoes, seeded and coarsely chopped ADVERTISEMENT",
            "2/3 cup coarsely chopped red onion ADVERTISEMENT",
            "1/2 cup chopped fresh mint leaves ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the cucumbers, vinegar, sugar and salt. Let stand at room temperature for an hour, stirring occasionally.\nAdd tomatoes, onion, mint and oil to cucumbers and toss to blend. Season to taste with salt and pepper.\n",
        "picture_link": "H7QxB6Bhrvt1SPHua1K.Qk5KLkvDhSO"
    },
    {
        "title": "Easy Baking Powder Drop Biscuits",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 cup chilled butter, diced ADVERTISEMENT",
            "1 1/4 cups whole milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C).\nMix flour, baking powder, salt, and sugar in a bowl. Cut in the cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. Add milk a little at a time, stirring lightly between additions.\nDrop the batter by spoonfuls onto a cookie sheet, and bake for 12 to 15 minutes, until the tops are golden.\n",
        "picture_link": "8QuCwrorxXCo6bZGeVLSAj1b2q2gUVO"
    },
    {
        "title": "Chocolate Wave Zucchini Bread",
        "ingredients": [
            "1/3 cup shortening ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups grated zucchini ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/3 cup mini semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9 x 5 inch loaf pan.\nIn a large bowl, cream shortening and sugar together. Mix in eggs. Add zucchini, water, and vanilla; stir. Blend in flour, baking soda, salt , baking powder, and pumpkin pie spice. Stir in nuts.\nDivide batter in half, and add cocoa powder and chocolate chips to one of the halves. Pour plain batter into bottom of the loaf pan. Pour chocolate batter on top of plain batter.\nBake until wooden pick inserted into center comes out clean, about 1 hour. Cool 10 minutes, and remove from pan. Store in refrigerator.\n",
        "picture_link": "ssjAoA6.hOnSn45WhsZJzvuZoz4seHi"
    },
    {
        "title": "Chip Chicken Lollipops",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - cut into 1/2 inch cubes ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 cups crushed potato chips ADVERTISEMENT",
            "lollipop sticks from a craft or party store ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nCrush potato chips onto a plate. In a large bowl, whisk together egg and milk. Dip the chicken cubes into the egg mixture, then coat well with potato chips. Spread the nuggets onto the baking sheet.\nBake for 10 minutes. Turn nuggets over, and bake for 10 minutes more, until golden brown. Remove baking sheet from oven, and insert a lollipop stick into each nugget.\n",
        "picture_link": "9.1469eKvlc/53JoovW9gJsx1d9BLFe"
    },
    {
        "title": "Thick Cut-Outs",
        "ingredients": [
            "6 egg yolks ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups butter, softened ADVERTISEMENT",
            "2 1/8 cups white sugar ADVERTISEMENT",
            "7 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon hot water or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the butter and sugar until smooth. Beat in the eggs, one at a time, mixing well after each. Combine flour, baking powder, and salt; stir into the sugar mixture. Cover dough and chill for at least one hour.\nPreheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. On a floured surface, roll the dough out to 1/2 inch thick and cut into desired shapes using cookie cutters. Place 2 inches apart on to the prepared baking sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. To make frosting, mix together the confectioners' sugar, oil and 1 teaspoon vanilla until smooth. gradually add enough hot water to achieve a spreadable consistency.\n",
        "picture_link": "M73d1QXW972xBLWbAkpHKQNItA5pWq."
    },
    {
        "title": "Creamy Potato Casserole",
        "ingredients": [
            "1 (2 pound) package frozen hash brown potatoes ADVERTISEMENT",
            "1/3 cup chopped green onions ADVERTISEMENT",
            "2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of potato soup ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a small pot, heat the soup, butter or margarine and sour cream over low heat.\nCombine potatoes, green onion and 1 cup cheese into a large mixing bowl. Mix in the heated soup mixture. Season with salt and pepper. Pour into a 9x13 inch dish. Sprinkle one cup of cheese over the top of the casserole.\nBake 30 to 45 minutes. Serve warm.\n",
        "picture_link": "EkuH.V7toj.pTEVZr3aN978BLbQNuuW"
    },
    {
        "title": "Amy's Chocolate Chip Cookies",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup margarine, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3/4 cup packed light brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium-sized mixing bowl, combine flour and baking soda. Set aside. In another large mixing bowl, combine butter, white sugar, brown sugar, vanilla, and pudding mix. Beat until smooth and creamy. Beat in eggs. Gradually stir in flour mixture. Stir in chocolate chips.\nDrop batter by heaping teaspoonfuls, about 2 inches apart, onto an ungreased cookie sheet. Bake for 9 to 9 1/2 minutes, or until browned.\n",
        "picture_link": "xA60A8/s/4lEkpmCt5hxI4aR4aACiku"
    },
    {
        "title": "Jimmy Dean Breakfast Casserole",
        "ingredients": [
            "1 (16 ounce) package Regular Flavor Jimmy Dean Pork Sausage ADVERTISEMENT",
            "10 eggs, lightly beaten ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "2 teaspoons dry mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 cups cubed bread ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 cup sliced mushrooms (optional) ADVERTISEMENT",
            "1 medium tomato, seeded and chopped (optional) ADVERTISEMENT",
            "1/2 cup thin-sliced green onion (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 F. In large skillet, cook sausage over medium-high heat, stirring frequently until thoroughly cooked and no longer pink. In large mixing bowl, combine eggs, milk, mustard and salt; stir well.\nDistribute half the bread evenly in a buttered 9 x 13 x 2 inch baking dish. Sprinkle with half the pepper, half the cheese, half the sausage and half of each optional ingredient. Repeat layering using remaining bread, pepper, cheese, sausage and optional ingredients. Pour egg mixture evenly over casserole.\nBake uncovered for 55-60 minutes, or until eggs are set. Tent with foil if top begins to brown too quickly.\n",
        "picture_link": "w74m7wRbhFSsVXraB5Wf.jIqMNpSIhi"
    },
    {
        "title": "North Carolina-Style Pulled Pork",
        "ingredients": [
            "1 tablespoon mild paprika ADVERTISEMENT",
            "2 teaspoons light brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons hot paprika ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "8 pounds pork butt roast ADVERTISEMENT",
            "2 cups cider vinegar ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "5/8 cup ketchup ADVERTISEMENT",
            "1/4 cup firmly packed brown sugar ADVERTISEMENT",
            "5 teaspoons salt ADVERTISEMENT",
            "4 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "2 pounds hickory wood chips, soaked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix mild paprika, light brown sugar, hot paprika, celery salt, garlic salt, dry mustard, ground black pepper, onion powder, and salt. Rub spice mixture into the roast on all sides. Wrap in plastic wrap, and refrigerate 8 hours, or overnight.\nPrepare a grill for indirect heat.\nSprinkle a handful of soaked wood over coals, or place in the smoker box of a gas grill. Place pork butt roast on the grate over a drip pan. Cover grill, and cook pork until pork is tender and shreds easily, about 6 hours. Check hourly, adding fresh coals and hickory chips as necessary to maintain heat and smoke.\nRemove pork from heat and place on a cutting board. Allow the meat to cool approximately 15 minutes, then shred into bite-sized pieces using two forks. This requires patience.\nIn a medium bowl, whisk together cider vinegar, water, ketchup, brown sugar, salt, red pepper flakes, black pepper, and white pepper. Continue whisking until brown sugar and salt have dissolved. Place shredded pork and vinegar sauce in a large roasting pan, and stir to coat pork. Serve immediately, or cover and keep warm on the grill for up to one hour until serving.\n",
        "picture_link": "8f8Av.iLID.gHd1PTqLenac8jI51OFC"
    },
    {
        "title": "Real Homemade Tamales",
        "ingredients": [
            "Tamale Filling: ADVERTISEMENT",
            "1 1/4 pounds pork loin ADVERTISEMENT",
            "1 large onion, halved ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "4 dried California chile pods ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "Tamale Dough: ADVERTISEMENT",
            "2 cups masa harina ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2/3 cup lard ADVERTISEMENT",
            "1 (8 ounce) package dried corn husks ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork into a Dutch oven with onion and garlic, and add water to cover. Bring to a boil, then reduce heat to low and simmer until the meat is cooked through, about 2 hours.\nUse rubber gloves to remove stems and seeds from the chile pods. Place chiles in a saucepan with 2 cups of water. Simmer, uncovered, for 20 minutes, then remove from heat to cool. Transfer the chiles and water to a blender and blend until smooth. Strain the mixture, stir in salt, and set aside. Shred the cooked meat and mix in one cup of the chile sauce.\nSoak the corn husks in a bowl of warm water. In a large bowl, beat the lard with a tablespoon of the broth until fluffy. Combine the masa harina, baking powder and salt; stir into the lard mixture, adding more broth as necessary to form a spongy dough.\nSpread the dough out over the corn husks to 1/4 to 1/2 inch thickness. Place one tablespoon of the meat filling into the center. Fold the sides of the husks in toward the center and place in a steamer. Steam for 1 hour.\nRemove tamales from husks and drizzle remaining chile sauce over. Top with sour cream. For a creamy sauce, mix sour cream into the chile sauce.\n",
        "picture_link": "A0mROpWYzGDaE5eupd2zqL.6OTs53KK"
    },
    {
        "title": "Beignets",
        "ingredients": [
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "1 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "7 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, dissolve yeast in warm water. Add sugar, salt, eggs, evaporated milk, and blend well. Mix in 4 cups of the flour and beat until smooth. Add the shortening, and then the remaining 3 cups of flour. Cover and chill for up to 24 hours.\nRoll out dough 1/8 inch thick. Cut into 2 1/2 inch squares. Fry in 360 degree F (180 degrees C) hot oil. If beignets do not pop up, oil is not hot enough. Drain onto paper towels.\nShake confectioners' sugar on hot beignets. Serve warm.\n",
        "picture_link": "9E5Q5cK/7pKReUisWkFYb/XwJqaikNC"
    },
    {
        "title": "Buttery Cinnamon Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2/3 cup shortening ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and lightly flour a 10 inch Bundt pan. Stir together the flour, baking powder, 1 teaspoon ground cinnamon and salt; set aside.\nIn a large bowl, beat shortening, 1 1/3 cups white sugar and 1 1/2 teaspoon vanilla until light and fluffy. Add eggs one at a time, beating for at least 1 minute after each egg. Beat in the flour mixture alternately with the milk. Pour batter into prepared pan.\nBake in the preheated oven for 40 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack. Remove cake from pan while it is still warm, and poke holes around the top of the cake with a fork. Pour the warm cinnamon syrup into the holes and onto the top and sides of the cake.\nTo Make Cinnamon Syrup: In a saucepan, combine 1/2 cup white sugar, butter, water, 1 teaspoon vanilla and 3/4 teaspoons ground cinnamon. Heat and stir until butter melts.\n",
        "picture_link": "z.P1syLCfgQW47Rt8W99EcD2MrlxANm"
    },
    {
        "title": "Sesame Chicken for Slow Cooker",
        "ingredients": [
            "1 1/2 pounds skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons dried minced onion ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "sesame seeds, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread chicken into the crock of a slow cooker.\nStir honey, soy sauce, ketchup, minced onion, vegetable oil, and garlic powder together in a bowl; pour over the chicken.\nCook on Low until the chicken is tender, 3 to 4 hours.\nRemove chicken from the sauce in the slow cooker to a cutting board. Stir water and cornstarch together to dissolve cornstarch completely; pour into the sauce in the slow cooker until smooth.\nCook on High until slightly thickened, about 10 minutes.\nCut chicken into bite-size pieces and stir into the sauce. Sprinkle sesame seeds over the chicken and sauce mixture.\n",
        "picture_link": "zPDurufXdfAd3MaZnz1uXt84ax9ajyS"
    },
    {
        "title": "Sweet Potato Pound Cake",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups cooked and mashed sweet potatoes ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup sifted confectioners' sugar ADVERTISEMENT",
            "5 teaspoons orange juice ADVERTISEMENT",
            "2 tablespoons grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch tube pan. Sift together flour, baking powder, cinnamon, baking soda, nutmeg and salt. Set aside.\nIn large mixing bowl, cream butter and sugar until light and fluffy. Add mashed sweet potatoes and vanilla. Beat until well blended. Add eggs, one at a time (the batter will look curdled). Add flour mixture to potato mixture. Beat on low until combined.\nPour batter into 10 inch tube pan. Bake at 350 degrees F (175 degrees C) for about 1 hour and 20 minutes, or until a wooden toothpick inserted into cake comes out clean. Cool cake for 20 minutes in the pan, then invert onto serving plate.\nTo make the glaze: in a small bowl, combine confectioners sugar with 3 to 5 teaspoons orange juice to achieve drizzling consistency. Spoon over warm cake and sprinkle with orange zest if desired.\n",
        "picture_link": "HFh13PeU7vIZIYquRzfqZCVKAoKM./C"
    },
    {
        "title": "Mom's Cucumbers",
        "ingredients": [
            "3 large cucumbers ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/8 cup water ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel the cucumbers and slice wafer thin. Sprinkle with salt. Let stand 30 minutes, then squeeze cucumbers to release moisture.\nIn a medium size bowl mix sugar, water, vinegar, celery seed, and onion. Add cucumbers to mixture. Mix well. Refrigerate 1 hour.\n",
        "picture_link": "GdPEodTXyDchJnJRWaMNoHkiLoaD.aW"
    },
    {
        "title": "Thousand Island Dressing II",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 cup sweet pickle relish ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together the mayonnaise, ketchup, relish, salt and pepper until thoroughly combined, and serve.\n",
        "picture_link": "AnQ0oXhJCGw5HdiQoo1WoyoEpY8Y7Ri"
    },
    {
        "title": "Herbed Pork and Apples",
        "ingredients": [
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 pounds pork loin roast ADVERTISEMENT",
            "4 tart apples - peeled, cored, cut into 1 inch chunks ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 cup apple juice ADVERTISEMENT",
            "2/3 cup real maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine the sage, thyme, rosemary, marjoram, salt and pepper. Rub over roast. Cover, and refrigerate roast for 6 to 8 hours, or overnight.\nPreheat oven to 325 degrees F (165 degrees C).\nPlace roast in a shallow roasting pan, and bake in the preheated oven for 1 to 1 1/2 hours. Drain fat.\nIn a medium bowl, mix apples and onion with brown sugar. Spoon around roast, and continue to cook for 1 hour more, or until the internal temperature of the roast is 145 degrees F (63 degrees C). Transfer the roast, apples and onion to a serving platter, and keep warm.\nTo make the gravy, skim excess fat from meat juices. Pour drippings into a medium heavy skillet. Stir in apple juice and syrup. Cook and stir over medium-high heat until liquid has been reduced by half, about 1 cup. Slice the roast, and serve with gravy.\n",
        "picture_link": "zEAlj0NwobasRdjkRQsm1ioy40IApxS"
    },
    {
        "title": "Easy Mashed Potato and Roasted Vegetable Enchiladas",
        "ingredients": [
            "1 head broccoli, cut into florets ADVERTISEMENT",
            "8 ounces whole button mushrooms ADVERTISEMENT",
            "3 small zucchini, chopped ADVERTISEMENT",
            "2 cups chopped carrots ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (7.6 ounce) package instant mashed potato flakes ADVERTISEMENT",
            "1 (12 ounce) package corn tortillas ADVERTISEMENT",
            "3 cups enchilada sauce ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a large mixing bowl, combine broccoli, mushrooms, zucchini, and carrots. Drizzle the vegetables with olive oil, and season with salt and pepper. Spread vegetables in a single layer in a shallow baking dish. Roast vegetables in the preheated oven for 30 to 40 minutes; stir halfway through their cooking time. When finished cooking, remove from the oven, and reduce oven temperature to 350 degrees F (175 degrees C).\nBring water, milk, and butter to a boil in a large pot. Remove the pot from heat, and mix in the mashed potato flakes. Let stand two minutes, then stir the mashed potatoes with a fork until they are smooth. Stir in roasted vegetables.\nIn a dry, nonstick skillet over medium heat, quickly heat each tortilla on both sides to make pliable. Dip the tortillas in enchilada sauce. Put a large spoonful (approximately 1/4 to 1/3 cup) of potato-veggie mixture into the center of each tortilla. Top mixture with about 1 to 2 tablespoons cheese, and roll tortillas. Place seam-side down in a 9x13 inch baking dish. Pour extra sauce over top, and sprinkle with remaining cheese.\nBake at 350 degrees F (175 degrees C) for approximately 20 to 30 minutes, or until the enchiladas are heated through.\n",
        "picture_link": "ObJVE5RuK6sFPUpJUwhq8B9zgaER06C"
    },
    {
        "title": "Fortune Cookies I",
        "ingredients": [
            "1 egg white ADVERTISEMENT",
            "1/8 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 cup unbleached all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F. Butter a cookie sheet. Write fortunes on strips of paper about 4 inches long and 1/2 inch wide. Generously grease 2 cookie sheets.\nMix the egg white and vanilla until foamy but not stiff. Sift the flour, salt, and sugar and blend into the egg white mixture.\nPlace teaspoonfuls of the batter at least 4 inches apart on one of the prepared cookie sheets. Tilt the sheet to move the batter into round shapes about 3 inches in diameter. Be careful to make batter as round and even as possible. Do not make too many, because the cookie have to be really hot to form them and once they cool it is too late. Start with 2 or 3 to a sheet and see how many you can do.\nBake for 5 minutes or until cookie has turned a golden color 1/2 inch wide around the outer edge of the circle. The center will remain pale. While one sheet is baking, prepare the other.\nRemove from oven and quickly move cookie with a wide spatula and place upside down on a wooden board. Quickly place the fortune on the cookie, close to the middle and fold the cookie in half. Place the folded edge across the rim of a measuring cup and pull the pointed edges down, one on the inside of the cup and one on the outside. Place folded cookies into the cups of a muffin tin or egg carton to hold their shape until firm.\n",
        "picture_link": "UenyVQjDdH4S/szHEVzbD52IUYyB70."
    },
    {
        "title": "Yummy Blueberry Cobbler",
        "ingredients": [
            "3 cups fresh blueberries ADVERTISEMENT",
            "1/2 lemon ADVERTISEMENT",
            "1 1/8 cups white sugar ADVERTISEMENT",
            "4 1/2 tablespoons butter, softened ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 cup whole milk ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 tablespoons cornstarch ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "3/4 cup boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease an 11x7 inch baking dish.\nSpread the blueberries out to cover the entire bottom of the baking dish. Squeeze the juice from the lemon over them. In a medium bowl, stir together the butter and 1 1/8 cups sugar until smooth. Stir in flour and baking powder alternately with the milk until smooth. Batter will be thin. Spoon over the berries, and spread evenly.\nIn a small bowl, stir together 1 1/2 cups of sugar, salt, and cornstarch. Sprinkle over the top of the batter. Dust with a pinch of cinnamon, then pour the boiling water over the entire dish.\nBake for 45 minutes in the preheated oven, or until golden brown.\n",
        "picture_link": "eNAuuqCQ0Ar8D9lx1S0MygHV3ugWtqK"
    },
    {
        "title": "Citrus Turkey Brine",
        "ingredients": [
            "1 cup salt ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "1 orange, cut into wedges ADVERTISEMENT",
            "1 medium onion, cut into wedges ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "4 bay leaves ADVERTISEMENT",
            "1 tablespoon dried thyme ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 1/2 gallons cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub salt onto your turkey, and place remaining salt, lemons, oranges, onion, garlic, bay leaves, thyme and pepper into a large pot. Place the turkey in the pot, and fill with water. Refrigerate overnight. Discard brine after removing turkey.\n",
        "picture_link": "HcdcBhDmw9/EVH7MTtUEegS2KI3PcVe"
    },
    {
        "title": "Chicken and Lentils",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 pounds bone-in chicken pieces ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "1 small carrot, finely chopped ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "3/4 cup dried lentils ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (10 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a skillet over medium heat, and cook the chicken pieces 5 minutes on each side, or until juices run clear. Remove chicken from skillet, and set aside.\nPlace onion in the skillet, and cook 5 minutes, until tender. Mix in the carrot and garlic. Stir in the lentils and broth, and season with salt. Bring to a boil, cover, reduce heat to low, and simmer 20 minutes.\nReturn chicken to skillet. Cover, and continue cooking 20 minutes. If the mixture becomes too dry, add a little water to just moisten.\nStir tomato sauce into the skillet. Season with rosemary and basil. Continue cooking 10 minutes, or until lentils are tender. Stir in lemon juice, and serve warm.\n",
        "picture_link": "CY8mvC6O07CR51RWHvECtNEQOi5iqSe"
    },
    {
        "title": "Onion Pan-Fried Pork Chops",
        "ingredients": [
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "2 pork chops ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup olive oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Before opening the onion soup mix, use your hands to crush the larger bits of onion in the packet. Open the packet, and pour the mix into a shallow bowl. Stir in the flour.\nHeat the oil in a heavy skillet over medium heat. The oil is hot enough when a pinch of the flour mixture sizzles when tossed into the oil. Coat pork chops in the onion soup mixture, and shake off the excess. Carefully place in the hot oil. Turn chops over after about 30 seconds to quickly sear both sides. Cook for about 4 minutes per side, or to desired degree of doneness.\n",
        "picture_link": "QwFsQyjYNO5dOMHSJr9SW6O6bxI824e"
    },
    {
        "title": "Vegetarian Chili",
        "ingredients": [
            "1 (12 ounce) package frozen burger-style crumbles ADVERTISEMENT",
            "2 (15 ounce) cans black beans, rinsed and drained ADVERTISEMENT",
            "2 (15 ounce) cans dark red kidney beans ADVERTISEMENT",
            "1 (15 ounce) can light red kidney beans ADVERTISEMENT",
            "1 (29 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (12 fluid ounce) can tomato juice ADVERTISEMENT",
            "5 onions, chopped ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, combine meat substitute, black beans, kidney beans, diced tomatoes, tomato juice, onions, chili powder, cumin, garlic powder, bay leaves, salt and pepper. Bring to a simmer and cover. Let the chili simmer for at least 1 hour before serving.\n",
        "picture_link": "R0Wag4ufMcrLuoYl/QLBfrJCEKqscUq"
    },
    {
        "title": "Death By Chocolate III",
        "ingredients": [
            "1 (19.8 ounce) package brownie mix ADVERTISEMENT",
            "2 (3.9 ounce) packages instant chocolate pudding mix ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "3 (1.4 ounce) bars chocolate covered English toffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare brownies according to package directions. Let cool.\nMix pudding according to package directions.\nIn a glass punch bowl, layer in the following order: 1/2 of the brownie, crumbled; 1/2 of the pudding; 1 toffee bar, crushed; 1/2 of the whipped topping.\nRepeat layers in the same order. Save the last toffee bar to crumble and sprinkle on top before serving.\nRefrigerate. Best if made the day before you serve it.\n",
        "picture_link": "khIRjMqZUohgOJAfqo5vxCc2/qjEL/K"
    },
    {
        "title": "Grilled Marinated Swordfish",
        "ingredients": [
            "4 cloves garlic ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon pepper ADVERTISEMENT",
            "4 swordfish steaks ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley (optional) ADVERTISEMENT",
            "4 slices lemon, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a glass baking dish, combine the garlic, white wine, lemon juice, soy sauce, olive oil, poultry seasoning, salt and pepper. Mix just to blend. Place swordfish steaks into the marinade, and refrigerate for 1 hour, turning frequently.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nGrill swordfish steaks for 5 to 6 minutes on each side. Garnish with parsley and lemon wedges.\n",
        "picture_link": "2r2CVocLIKMs1DG5663k6KGcR5L/GAK"
    },
    {
        "title": "Refreshing Cucumber Salad",
        "ingredients": [
            "2 small cucumbers, thinly sliced ADVERTISEMENT",
            "1/2 small red onion, thinly sliced ADVERTISEMENT",
            "1 large tomato, halved and sliced ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, toss together the cucumbers, red onion and tomato. Gently stir in the mayonnaise, vinegar, salt and pepper until coated. Cover and refrigerate for at least 1 hour before serving.\n",
        "picture_link": "86Rfneh6V.FS2ITqqykM6GE1ugB6OBa"
    },
    {
        "title": "Aunt Mary's Eggplant Balls",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 cups cubed eggplant, with peel ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3/4 cup dried bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nHeat a medium skillet over medium heat. Pour in olive oil and saute garlic just until lightly browned. Mix in eggplant and water. Reduce heat to low and cover skillet. Allow eggplant to steam until soft, about 20 minutes. Place eggplant in a large bowl and allow to cool slightly.\nMix cheese, parsley, eggs, and bread crumbs into eggplant. Stir with a wooden spoon or your hands until ingredients are thoroughly combined and mixture can be rolled into balls. Add more bread crumbs as needed to make mixture workable. Refrigerate mixture for 15 minutes, then roll into balls or form into patties.\nPlace eggplant balls on prepared baking sheet. Bake in preheated oven for 30 minutes. Serve immediately.\n",
        "picture_link": "cS8nkntoHF7r3yGm5SamXc5DOI6NC2u"
    },
    {
        "title": "Easy Tuna Patties",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "10 tablespoons Italian-seasoned bread crumbs ADVERTISEMENT",
            "3 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "3 tablespoons diced onion ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs and lemon juice in a bowl; stir in Parmesan cheese and bread crumbs to make a paste. Fold in tuna and onion until well-mixed. Season with black pepper. Shape tuna mixture into eight 1-inch-thick patties.\nHeat vegetable oil in a skillet over medium heat; fry patties until golden brown, about 5 minutes per side.\n",
        "picture_link": "Lx0VW6C6SA7CEet1uFJVZl0X4ACSSSi"
    },
    {
        "title": "Mozzarella Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 slices mozzarella cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 cups all-purpose flour for coating ADVERTISEMENT",
            "1 cup seasoned dry bread crumbs ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken breasts between 2 sheets of wax paper. Pound each to 1/4 inch thickness. Spread butter/margarine over the inside, then add salt and pepper to taste.\nPlace slice of cheese on breast, roll and close with toothpicks. Repeat with each breast. Dip rolled breasts in flour, then egg, then breadcrumbs. Place coated breasts in a lightly greased 9x13 inch baking dish.\nTo Make Sauce: In a saucepan, melt 1/4 cup butter and add garlic. Add wine and simmer all together. Pour sauce over chicken and bake in the preheated oven for 30 to 45 minutes.\n",
        "picture_link": "ph/.b.rD53SfrsrNuwSvv3vloyoRABu"
    },
    {
        "title": "Shrimp and Crab Bisque",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon white pepper ADVERTISEMENT",
            "1 teaspoon chicken bouillon granules ADVERTISEMENT",
            "2 tablespoons finely chopped onion ADVERTISEMENT",
            "1 1/2 cups half-and-half cream ADVERTISEMENT",
            "1/2 pound medium shrimp - peeled and deveined ADVERTISEMENT",
            "1/2 pound pre-cooked crab meat ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, melt butter over a low heat. Stir in flour, salt, white pepper, bouillon granules, and onion. Blend 3/4 cup half-and-half cream into the mixture. Mix in shrimp and crab meat. Turn the temperature to medium heat and continue stirring until the mixture thickens.\nBlend the remaining half-and-half cream and wine into the mixture. Serve and enjoy!\n",
        "picture_link": "L7EwzC.sFMELdXsAFKb2Lgai9YkqQAG"
    },
    {
        "title": "Loaded Cauliflower",
        "ingredients": [
            "1 head cauliflower ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 teaspoon dry ranch salad dressing mix (such as Hidden Valley Ranch®) ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon butter, cut into small pieces, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until very tender, 15 to 20 minutes. Transfer cauliflower to a bowl, mash, and strain excess water.\nMix cauliflower, sour cream, Cheddar cheese, ranch dressing mix, onion powder, and garlic powder together in a 9-inch baking dish; top with butter.\nBake in the preheated oven until bubbling, 30 to 45 minutes.\n",
        "picture_link": "DI0jQ0FiXkiLHrRhC9E3awIPdnfItki"
    },
    {
        "title": "Campbell's® Slow Cooker Savory Pot Roast",
        "ingredients": [
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Mushroom Soup (Regular, 98% Fat Free or Healthy Request) ADVERTISEMENT",
            "1 (2 ounce) pouch Campbell's® Dry Onion Soup and Recipe Mix ADVERTISEMENT",
            "6 small red potatoes, halved ADVERTISEMENT",
            "6 medium carrots, cut into 2-inch pieces ADVERTISEMENT",
            "1 (3 pound) boneless beef bottom round roast or chuck pot roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the soup, onion soup mix, potatoes and carrots in a 4 1/2-quart slow cooker. Add the beef and turn to coat.\nCover and cook on LOW for 8 to 9 hours* or until the beef is fork-tender.\n",
        "picture_link": "b5I8D2dgTLRNht9MTq7V6WmoT/aLMwC"
    },
    {
        "title": "Aunt Carol's Spinach and Fish Bake",
        "ingredients": [
            "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry ADVERTISEMENT",
            "1 cup sharp Cheddar cheese ADVERTISEMENT",
            "1/3 cup dry bread crumbs ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 pound cod fillets ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a bowl, mix the spinach, 1/2 cup Cheddar cheese, about 5 tablespoons dry bread crumbs, and the egg. Spread the mixture into the bottom of a small baking dish. Arrange the cod fillets on top of the spinach mixture, and season with salt and pepper. Top with the remaining Cheddar cheese and bread crumbs.\nCover, and bake 20 minutes in the preheated oven, or until fish flakes easily with a fork.\n",
        "picture_link": "qSttFeiE6zcwC0zQf7PjaGQC8WqEkLu"
    },
    {
        "title": "The Best Clam Sauce",
        "ingredients": [
            "1 (16 ounce) package dry linguini ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "4 (6.5 ounce) cans minced clams ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons dry white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil, add linguini and return water to a boil. Let linguini cook until al dente; drain well.\nIn a large skillet, saute the onion and garlic in olive oil until the onions are translucent. Drain the cans of minced clams, reserving half of the juice.\nStir the clams, reserved juice, butter, salt and pepper, and wine. Simmer the mixture for 20 minutes, until the sauce has reduced 1/3 and has thickened.\nSpoon the clam sauce over the linguini and serve.\n",
        "picture_link": "ZqDYzp1EkB6H0x6Axjnta0F3TchYn9C"
    },
    {
        "title": "Comforting Cube Steaks",
        "ingredients": [
            "4 (4 ounce) cube steaks ADVERTISEMENT",
            "1/2 teaspoon Cajun seasoning, or to taste ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x13 inch baking dish.\nSeason the steaks on both sides with Cajun seasoning and black pepper. Place the steaks into the prepared baking dish. Pour the lemon-lime beverage over them. Combine the cream of mushroom soup and dry onion soup mix, and pour over the steaks.\nBake, uncovered, for about 1 hour, or until meat reaches desired doneness. Do not open the oven door during the first hour of cooking. Serve steaks with gravy spooned over.\n",
        "picture_link": "XHZOdvF2AAGptbant/KSqtrnz.ohijy"
    },
    {
        "title": "Frozen Chocolate Chip Cookie Dough Balls",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups brown sugar, packed ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup mini semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup chopped walnuts, if desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream the butter and sugar in a mixing bowl. Stir in the vanilla, water, flour, chocolate chips, and walnuts, if desired, and mix until well blended. Roll dough into bite-sized balls (or use a small ice cream scoop). Place on a baking sheet and freeze until firm, about 2 hours. Store balls in resealable plastic bags in the freezer.\n",
        "picture_link": "4N64MtITSkmhUcfqC4pitJxCwOzgaG."
    },
    {
        "title": "Hot Pepper Jelly",
        "ingredients": [
            "2 1/2 cups finely chopped red bell peppers ADVERTISEMENT",
            "1 1/4 cups finely chopped green bell peppers ADVERTISEMENT",
            "1/4 cup finely chopped jalapeno peppers ADVERTISEMENT",
            "1 cup apple cider vinegar ADVERTISEMENT",
            "1 (1.75 ounce) package powdered pectin ADVERTISEMENT",
            "5 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sterilize 6 (8 ounce) canning jars and lids according to manufacturer's instructions. Heat water in a hot water canner.\nPlace red bell peppers, green bell peppers, and jalapeno peppers in a large saucepan over high heat. Mix in vinegar and fruit pectin. Stirring constantly, bring mixture to a full rolling boil. Quickly stir in sugar. Return to full rolling boil, and boil exactly 1 minute, stirring constantly. Remove from heat, and skim off any foam.\nQuickly ladle jelly into sterile jars, filling to within 1/4 inch of the tops. Cover with flat lids, and screw on bands tightly.\nPlace jars in rack, and slowly lower jars into canner. The water should cover the jars completely, and should be hot but not boiling. Bring water to a boil, and process for 5 minutes.\n",
        "picture_link": "9AXpO9Hmld7nJZVUsnm4UQ.UwW42ct."
    },
    {
        "title": "Easy Rum Cake",
        "ingredients": [
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1/2 cup dark rum ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "Glaze ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/8 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch tube or Bundt pan. Sprinkle nuts over the bottom of the pan.\nMix together the cake mix, 1/2 cup dark rum, eggs, 1/2 cup water, oil, and vanilla pudding mix. Pour batter over the nuts in the pan.\nBake for 1 hour. Cool, and invert cake on a serving plate. Prick the top of the cake.\nTo Make The Glaze: Melt the butter in a saucepan. Stir in 1/8 cup water and the 1/2 cup sugar. Boil for 5 minutes, stirring constantly. Remove glaze from heat, and stir in 1/4 cup rum. Drizzle and smooth evenly over the top and sides.\n",
        "picture_link": "3FRzqDWuYEyY6mCMpxbz2UkPM1bI/W2"
    },
    {
        "title": "Sausage and Bow-Tie Pasta Florentine",
        "ingredients": [
            "1 pound hot Italian sausage links ADVERTISEMENT",
            "1 (12 ounce) package bow-tie pasta (farfalle) ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 (16 ounce) jar Alfredo sauce ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Place the sausage links onto a broiler pan, and broil in the preheated oven until the sausage is crispy on the outside and no longer pink on the inside, about 8 minutes. Turn the sausage once as it cooks.\nBring a large pot of lightly salted water to a boil. Add the bow-tie pasta, and cook until al dente, 8 to 10 minutes. Drain and return to the pot along with the spinach; keep warm over medium-low heat.\nHeat the olive oil in a separate pot over medium heat, and stir in the garlic, and cook until the garlic softens and the aroma mellows, about 3 minutes. Add the Alfredo sauce and black pepper, then bring to a simmer over medium-high heat. Cut the cooked sausage into bite-sized pieces, and add to the simmering Alfredo sauce along with the pasta and spinach. Stir until the pasta is hot and well coated with the sauce.\n",
        "picture_link": ".QzvHLLh2oP9lqTlwmlWA2JCVbmRPQ6"
    },
    {
        "title": "Egg-Free Dairy-Free Nut-Free Cake",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "5 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8 inch baking pan.\nIn a large bowl, combine flour, salt, sugar, cocoa powder, and baking soda. Mix well with a fork, then stir in oil, vinegar, and vanilla extract. When dry ingredients are thoroughly moistened, pour in cold water and stir until batter is smooth. Stir in chocolate chips and pour batter into prepared pan.\nBake in preheated oven for 30 to 35 minutes, until a toothpick inserted in center comes out clean. Cool on a rack.\n",
        "picture_link": "10iw1SgzcBbM9Ko2xnHeG7QwpDMD8Ya"
    },
    {
        "title": "Cream Cheese Kolacky",
        "ingredients": [
            "3 ounces cream cheese ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup any flavor fruit jam ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese and butter until smooth. Add flour slowly until well blended. Shape into a ball and chill overnight or for several hours.\nPreheat oven to 350 degrees F (180 degrees C). Roll dough out 1/8 inch thick on a floured pastry board. Cut into 2 1/2 inch squares and place 1/2 tsp (approx) of jam or preserves. Overlap opposite corners and pinch together. Place on ungreased cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Cool. Sprinkle lightly with confectioner's sugar.\n",
        "picture_link": "zjbEW52D.dKSXSq/v.bzhSZUtlmUx2."
    },
    {
        "title": "Whipped Cream Frosting",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat cream cheese, sugar salt and vanilla until smooth. In a small bowl, whip the heavy cream until stiff peaks form. Fold into the cream cheese mixture.\n",
        "picture_link": "9Ikyrxh90SMpfX1KrBDmIbUZmrRnHfW"
    },
    {
        "title": "Beef Taco Skillet",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Tomato Soup (Regular or 25% Less Sodium) ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "6 (6 inch) flour tortillas, cut into 1-inch pieces ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook beef in 10-inch skillet until well browned, stirring to break up meat. Pour off fat.\nStir in soup, salsa, water, tortillas. Heat to a boil. Reduce heat to low and cook for 5 minutes Stir. Top with cheese.\n",
        "picture_link": "oDdQlYIlJYepwZrj/w7NINRUFs6xeO2"
    },
    {
        "title": "Honey Oatmeal Bread II",
        "ingredients": [
            "2 cups boiling water ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "4 cups bread flour ADVERTISEMENT",
            "2 tablespoons honey, warmed slightly ADVERTISEMENT",
            "2 tablespoons rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, combine boiling water, oats, 1/2 cup honey, butter and salt. Let stand for 1 hour.\nIn a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nPour the yeast mixture into the oat mixture. Add 2 cups of flour; mix well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 20 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes.\nPreheat an oven to 350 degrees F (175 degrees C).\nBake in the preheated oven for about 30 minutes or until the top is golden brown and the bottom of the loaf sounds hollow when tapped. Remove loaves from pans, brush tops of loaves with 2 tablespoons honey and sprinkle with oats.\n",
        "picture_link": "WToyPAbiXZ0YWXlg4pi79LEycsdLzL6"
    },
    {
        "title": "Rachel's Tomato Basil Soup",
        "ingredients": [
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (11.5 ounce) can tomato-vegetable juice cocktail ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "20 fresh basil leaves, cut into thin strips ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/4 cup butter or margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, combine the tomatoes, vegetable juice, and chicken broth. Bring to a boil, and cook for 30 minutes. Remove from heat, and stir in the basil. At this point, you may puree the soup if you wish. Add the cream and butter; return to medium-low heat, and stir until butter is melted. Serve immediately.\n",
        "picture_link": "7jPZYfJtE/me2y2dVwbCDJ.n2DloNjW"
    },
    {
        "title": "Kellogg's® Chocolate Scotcheroos",
        "ingredients": [
            "1 cup light corn syrup ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "6 cups Kellogg's® Rice Krispies® cereal or Kellogg's® Cocoa Krispies™ cereal ADVERTISEMENT",
            "1 cup semi-sweet chocolate morsels ADVERTISEMENT",
            "1 cup butterscotch chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place corn syrup and sugar into 3-quart saucepan. Cook over medium heat, stirring frequently, until sugar dissolves and mixture begins to boil. Remove from heat. Stir in peanut butter. Mix well. Add Kellogg's(R) Rice Krispies(R) cereal. Stir until well coated. Press mixture into 13 x 9 x 2-inch pan coated with cooking spray. Set aside.\nMelt chocolate and butterscotch chips together in 1-quart saucepan over low heat, stirring constantly. Spread evenly over cereal mixture. Let stand until firm. Cut into 2 x 1-inch bars when cool.\n",
        "picture_link": "DRUszN6yvFfkPHsAhi2hKTBCi5AW3MO"
    },
    {
        "title": "Kay's Shortbread",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the flour, baking powder, salt and confectioners' sugar. Stir in the butter and vanilla, and mix until a stiff dough forms. Pat dough into 9-inch round cake pan, and prick well with a fork. Sprinkle remaining sugar over dough.\nBake for 30 to 35 minutes in the preheated oven, or until golden. Cut into wedges while warm. Cool on wire rack; separate cookies.\n",
        "picture_link": "eBnf0BSSLZUjLwBbUfToYd/VwMgMFXO"
    },
    {
        "title": "Cut-Out Cookies in a Flower Pot",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon butter flavored extract ADVERTISEMENT",
            "7 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter and sugar. Add eggs and flavorings and mix well. Stir flour, baking powder and salt together. Add to batter and mix well.\nChill 3-4 hours or overnight before using.\nRoll cookies out approximately 1/4 inch thick and insert cookie sticks at least 1/3 to 1/2 way into cookie.\nBake cookies at 350 degrees F (175 degrees C) for 8-10 minutes. This dough keeps well in a covered container in the refrigerator for a couple of weeks.\nDecorate as desired. Display 3-7 cookies in a 6 inch clay pot (depending on size of cookie). Weigh pot down with dried beans and cut a circle of Styrofoam to fit snugly into top. Add ribbons and enjoy.\n",
        "picture_link": "qQonKcgs7F3OOw2rnCqsDdFT/f2eoP6"
    },
    {
        "title": "Pecan Snack",
        "ingredients": [
            "1 egg white ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 pound pecans ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nIn a large bowl, beat egg white with water until frothy. Stir in pecans and mix to coat. Combine sugar, cinnamon and salt and stir into pecan mixture. Spread on a baking sheet.\nBake in preheated oven 1 hour, stirring every 15 minutes. Store in an airtight container.\n",
        "picture_link": "78vABWAmwDLfuPIycXtKPHUeQuRidCC"
    },
    {
        "title": "Royal Icing I",
        "ingredients": [
            "4 egg whites ADVERTISEMENT",
            "4 cups sifted confectioners' sugar ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites in clean, large bowl with mixer at high speed until foamy (use only grade A clean, uncracked eggs). Gradually add sugar and lemon extract. Beat at high speed until thickened. NOTE: When dry, Royal Icing is very hard and resistant to damage that can occur during shipping/handling.\n",
        "picture_link": "EvD8h3eqdGuTY7rFD7NUwW9IgWcfDF."
    },
    {
        "title": "White Bread I",
        "ingredients": [
            "1 1/4 cups lukewarm milk ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order suggested by the manufacturer.\nSelect Basic or White Bread setting, and press Start. When done, place on wire rack for at least 10 minutes before slicing.\n",
        "picture_link": "4w/ihzfzJGNpIidfem7alkPD.oqOYk."
    },
    {
        "title": "Scrumptious Salmon Cakes",
        "ingredients": [
            "2 (14.75 ounce) cans salmon, drained and flaked ADVERTISEMENT",
            "3/4 cup Italian-seasoned panko (Japanese bread crumbs) ADVERTISEMENT",
            "1/2 cup minced fresh parsley ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "2 teaspoons seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix salmon, panko, parsley, eggs, green onions, seafood seasoning, black pepper, garlic powder, Worcestershire sauce, Parmesan cheese, Dijon mustard, and creamy salad dressing together in a large bowl; divide and shape into eight patties.\nHeat enough olive oil in a large skillet to cover the cooking surface over medium heat. Fry salmon patties in batches until browned, 5 to 7 minutes per side. Repeat with more olive oil, as needed.\n",
        "picture_link": "S/BELhjUThqI0ysA.dbq79bXN.LW/pu"
    },
    {
        "title": "Slow Cooker Tapioca Pudding",
        "ingredients": [
            "4 cups milk ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup small pearl tapioca ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the milk, sugar, tapioca, and eggs in a slow cooker. Cover, and cook on Medium for 3 hours, or on Low for 6 hours, stirring occasionally. Serve warm.\n",
        "picture_link": "xB/VmxcUgSY/xbl6QfBhVEbnLwTr34u"
    },
    {
        "title": "Herbed Mushrooms with White Wine",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 pounds fresh mushrooms ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a skillet over medium heat. Place mushrooms in the skillet, season with Italian seasoning, and cook 10 minutes, stirring frequently.\nMix the wine and garlic into the skillet, and continue cooking until most of the wine has evaporated. Season with salt and pepper, and sprinkle with chives. Continue cooking 1 minute.\n",
        "picture_link": "7KEE7.hIdeZVd0p9DUtvn7gHRt5rhBu"
    },
    {
        "title": "Apple Bars",
        "ingredients": [
            "1/2 cup melted butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup apples - peeled, cored and finely diced ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8x8-inch baking pan.\nIn a large bowl, mix melted butter with sugar and egg. Mix in flour, baking soda, and cinnamon, and then stir in apple and walnuts. Spread batter into prepared pan.\nBake for approximately 40 minutes, or until a small knife inserted in the center comes out clean.\n",
        "picture_link": "14lzTrMx1hmznVksoOVBGbhvNgtIH3m"
    },
    {
        "title": "Aunt Fannie's Dinner",
        "ingredients": [
            "1/2 cup uncooked elbow macaroni ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup stewed, diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and saute for 5 to 10 more minutes. Season with garlic powder, salt and pepper to taste. Add the tomato sauce, stewed OR diced tomatoes, corn and cooked macaroni. Stir well and allow to heat through, about 5 to 7 minutes.\n",
        "picture_link": "wrbVrklFi6o0eC76E7njEtyObCXdkFq"
    },
    {
        "title": "Twelve Minute Pasta Toss",
        "ingredients": [
            "16 ounces rotini pasta ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, cut into bite size pieces ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 1/4 teaspoons garlic powder ADVERTISEMENT",
            "1 1/4 teaspoons dried basil ADVERTISEMENT",
            "1 1/4 teaspoons dried oregano ADVERTISEMENT",
            "1 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook rotini at a boil until tender yet firm to the bite, about 8 minutes; drain.\nHeat oil in a large pot over medium-high heat. Saute chicken, garlic, salt, garlic powder, basil, and oregano in hot oil until chicken is no longer pink in the middle, 5 to 10 minutes. Add sun-dried tomatoes and cook until heated through, about 2 minutes. Remove from heat.\nPour pasta into pot and toss with chicken until combined. Top with Parmesan cheese.\n",
        "picture_link": "smiXt0r3geb1ZHyvd6MSpMHfXTSgu0."
    },
    {
        "title": "Eggless Chocolate Cake II",
        "ingredients": [
            "4 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 tablespoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C), grease and flour a 9x13 inch pan.\nIn a large bowl, sift together flour, cocoa powder, soda and salt. Add sugar and mix together.\nAdd oil, water and vanilla and mix thoroughly.\nPour into a 9x13 inch pan. Bake at 350 degrees F (175 degrees C) for 1 hour or until toothpick inserted in center comes out clean.\n",
        "picture_link": "2ZaFZkr.7j4S57RbjI62TQIv1uLEoae"
    },
    {
        "title": "Spinach Salad with Warm Bacon-Mustard Dressing",
        "ingredients": [
            "1 (10 ounce) bag baby spinach leaves ADVERTISEMENT",
            "4 hard-cooked eggs, peeled and sliced ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "4 strips crisply cooked bacon, crumbled ADVERTISEMENT",
            "10 ounces Swiss cheese, shredded ADVERTISEMENT",
            "1/2 cup toasted sliced almonds ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large shallot, minced ADVERTISEMENT",
            "1 teaspoon garlic, minced ADVERTISEMENT",
            "1/3 cup white wine vinegar ADVERTISEMENT",
            "1/3 cup Dijon mustard ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "2 strips crisply cooked bacon, crumbled ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place spinach into a large serving bowl, top with hard-cooked eggs, mushrooms, 4 crumbled strips of bacon, Swiss cheese, and almonds.\nHeat olive oil in a small skillet over medium heat. Stir in shallots and garlic, and cook until softened and translucent, about 2 minutes. Whisk in the vinegar, Dijon mustard, honey, and 2 crumbled strips of bacon; season to taste with salt and pepper, then cook until hot.\nPour hot dressing over spinach and toss to coat.\n",
        "picture_link": "ouOKvuilHckJ/fr9tR8Dw0PXnS7mUJK"
    },
    {
        "title": "Vegetarian Sweet and Sour Meatballs",
        "ingredients": [
            "Meatballs: ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup cottage cheese ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1 cup finely chopped pecans ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon dried sage ADVERTISEMENT",
            "2 cups Italian seasoned bread crumbs ADVERTISEMENT",
            "Sweet and Sour Sauce: ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "3/4 cup apricot jam ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the eggs, Cheddar cheese, and cottage cheese until well blended. Mix in 1/2 cup onion, pecans, basil, salt and sage. Stir in bread crumbs. Form the mixture into 2 inch balls, and place them in a 9x13 inch baking dish.\nIn another bowl, whisk together the vegetable oil, vinegar, apricot jam, ketchup, 1/4 cup onion, oregano and hot pepper sauce. Pour over meatballs.\nBake uncovered for 35 to 40 minutes in the preheated oven, until meatballs are firm, and sauce is thick and bubbly.\n",
        "picture_link": "u2XFtjgfQiCF9ZHl1yY4DpDezGOcDT2"
    },
    {
        "title": "Stuffed Mushrooms with Spinach",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "5 slices bacon ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "12 large mushrooms ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons finely chopped onion ADVERTISEMENT",
            "2 cloves garlic, peeled and minced ADVERTISEMENT",
            "3/8 cup heavy cream ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Butter a 9x13 inch baking dish with 2 tablespoons butter.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nPlace frozen spinach in a medium saucepan with 1/4 cup water. Bring water to a boil, then reduce heat to medium and cook spinach covered 10 minutes. Uncover and stir. Remove from heat and drain.\nRemove stems from mushrooms. Arrange caps in the baking dish. Finely chop stems.\nMelt 3 tablespoons butter in a medium saucepan over medium heat, and mix in onion and garlic. Cook 5 minutes, or until tender, then mix in bacon, spinach, chopped mushroom stems and heavy cream. Bring cream to a boil. Remove from heat and mix in Parmesan cheese, salt and pepper.\nStuff mushroom caps generously with the mixture. Drizzle with 2 tablespoons melted butter. Bake in the preheated oven 30 minutes until lightly browned.\n",
        "picture_link": "Rc5rMKf2j88gGOexz6aoH4tlJdoAmMe"
    },
    {
        "title": "Mushroom and Swiss Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "2 cloves crushed garlic ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "1 tablespoon Cajun-style seasoning ADVERTISEMENT",
            "1 cup chopped green onion ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "4 slices Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine oil and garlic in a 9x13 inch baking dish. Add chicken breasts and coat well with the oil and garlic. Sprinkle with the vinegar and Cajun seasoning.\nBake at 350 degrees F (175 degrees C) for 30 minutes.\nRemove chicken from oven and cover with green onion and mushrooms; then add a few more sprinkles of oil and vinegar and return dish to oven for 15 to 20 minutes more. Remove from oven and immediately place 1 slice of cheese on top of each chicken breast; cheese will melt. Serve immediately.\n",
        "picture_link": "RwJdtCMOn/d5CiIKU215HaNEjqEINm."
    },
    {
        "title": "Turkey in a Bag",
        "ingredients": [
            "12 pounds whole turkey ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "5 stalks celery ADVERTISEMENT",
            "2 large onions, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRinse turkey and remove giblets. Salt and pepper to taste.\nSprinkle the bottom of a turkey size oven bag with flour. Place turkey, celery and onions in the bag. Seal bag and poke several holes in it with a fork.\nBake 3 to 3 1/2 hours, or until internal temperature of the thigh meat reaches 180 degrees F (85 degrees C).\n",
        "picture_link": "PUwVeFsD0iUhXyImraK5FK1/pnlCctW"
    },
    {
        "title": "Chocolate Chess Pie II",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix sugar and cocoa together. Beat the eggs then add to the cocoa mixture. Beat in the milk, butter and vanilla.\nPour mixture into 9 inch unbaked pie shell and bake at 350 degrees F (175 degrees C) for 45 minutes or until set. Let cool before slicing.\n",
        "picture_link": "FW9nJ6ctrsfr7cGiQ9qUrsyYaK/EiOC"
    },
    {
        "title": "Neiman Marcus Chocolate Chip Cookie",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons instant espresso coffee powder ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a cookie sheet.\nIn a medium bowl, cream together the butter, brown sugar and white sugar until smooth. Beat in the egg and vanilla. Sift together the flour, baking soda, baking powder, salt and espresso powder; stir into the creamed mixture. Finally, stir in the chocolate chips.\nDrop dough by heaping tablespoonfuls onto the prepared baking sheet. Cookies should be 1 1/2 to 2 inches apart. You should have 12 to 15 large cookies.\nBake for 8 to 10 minutes in the preheated oven. For crispier cookies, bake 2 minutes longer. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "Npf/qhnwTuxDrsOVU5U.tE1g9L5s.2m"
    },
    {
        "title": "Chicken Paprikash II",
        "ingredients": [
            "2 tablespoons bacon grease ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "3 tablespoons paprika ADVERTISEMENT",
            "1 (2 to 3 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat bacon grease in a large skillet over medium heat. Add onion, garlic, salt, red pepper flakes and paprika. Stir together and saute until onion is translucent. Add chicken pieces and pour water over all. Cook over medium heat for 1 hour, adding more water if necessary.\nStir in tomatoes, reserving liquid. Stir liquid into a medium bowl with flour and sour cream; mix until well blended, then slowly add mixture to chicken, stirring constantly. Cook until mixture is thick.\n",
        "picture_link": "GbHu3SQRigw3N0SKHZ79EN836nAXgTu"
    },
    {
        "title": "Blueberry Oat Muffins",
        "ingredients": [
            "1/2 cup quick cooking oats ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 12 cup muffin pan. In a small bowl, mix the oats and orange juice together. Set aside.\nIn a medium bowl, mix flour, 1/2 cup sugar, baking powder, salt, and baking soda. Thoroughly blend in the oil and egg. Stir in the oat mixture, and fold in blueberries. Spoon batter into the prepared muffin cups.\nMix 2 teaspoons sugar and cinnamon in a small bowl, and sprinkle evenly over the tops of the muffins.\nBake 18 to 20 minutes in the preheated oven, or until a knife inserted in the center of a muffin comes out clean.\n",
        "picture_link": "RF4IxxBAVvgMQFHKt1jAk05kQ2Kah42"
    },
    {
        "title": "Chicken, Asparagus, and Mushroom Skillet",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1 1/2 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons white cooking wine ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves, sliced ADVERTISEMENT",
            "1/2 pound fresh asparagus, trimmed and cut into thirds ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter with the olive oil in a skillet over medium-high; stir the parsley, basil, oregano, garlic, salt, lemon juice, and wine into the butter mixture. Add the chicken; cook and stir until the chicken is browned, about 3 minutes. Reduce heat to medium; cook, stirring occasionally, until the chicken is no longer pink inside, about 10 more minutes.\nAdd the asparagus; cook and stir until the asparagus is bright green and just starting to become tender, about 3 minutes. Stir in the mushrooms and cook an additional 3 minutes to let the mushrooms release their juice. Serve hot.\n",
        "picture_link": "PWr1zQGcHdY8mcPBaZqHud/M8nBuA8a"
    },
    {
        "title": "Ann's Shrimp Etouffee",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 large white onions, chopped ADVERTISEMENT",
            "6 stalks celery, chopped ADVERTISEMENT",
            "3 cloves garlic, pressed ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "5 pounds fresh shrimp, peeled, deveined and chopped ADVERTISEMENT",
            "1 cup chopped fresh mushrooms ADVERTISEMENT",
            "3 tablespoons paprika ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "crushed red pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, melt butter and saute onions, celery and garlic for about 45 minutes or until they are cooked down.\nStir in flour and cook briefly, do not brown. Stir in chopped shrimp and cook for 20 minutes.\nPour in 2 to 3 cups of water and mushrooms. Stir in paprika and season with salt, pepper and red pepper flakes. Cook for 30 minutes. Should be a thick and have a gravy-like consistency.\n",
        "picture_link": "kzqOH2xEetIthMvXRvkHPBzVQgMfcCG"
    },
    {
        "title": "Caramel Apples",
        "ingredients": [
            "6 apples ADVERTISEMENT",
            "1 (14 ounce) package individually wrapped caramels, unwrapped ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the stem from each apple and press a craft stick into the top. Butter a baking sheet.\nPlace caramels and milk in a microwave safe bowl, and microwave 2 minutes, stirring once. Allow to cool briefly.\nRoll each apple quickly in caramel sauce until well coated. Place on prepared sheet to set.\n",
        "picture_link": "UAHK2oU6UTYMBwoZ5jetCim2BEbiJgy"
    },
    {
        "title": "Octoberfest German Potato Salad",
        "ingredients": [
            "3 pounds potatoes, peeled and sliced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add peeled and cut potatoes; cook until tender but still firm, about 15 minutes. Drain, and transfer to a large bowl. Add onions.\nIn a large bowl, whisk together the mayonnaise, oil, vinegar, sugar, parsley, salt and pepper. Gently stir in the potatoes and onion. Let stand for 1 hour before serving to enhance flavors.\n",
        "picture_link": "X64f/36hJN2wapuIYhO9v6MZsUPCIFO"
    },
    {
        "title": "Marinated Scallops Wrapped in Bacon",
        "ingredients": [
            "3/4 cup maple syrup ADVERTISEMENT",
            "1/4 cup low sodium soy sauce ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "12 large sea scallops, halved ADVERTISEMENT",
            "12 slices smoked bacon, halved ADVERTISEMENT",
            "24 toothpicks ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together maple syrup, soy sauce, and Dijon mustard in a bowl until smooth. Add the scallops, and toss to coat. Cover bowl with plastic wrap, and marinate at least one hour.\nPreheat oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with a sheet of aluminum foil.\nArrange bacon pieces on baking sheet so they do not overlap. Bake in preheated oven until some of the grease has rendered out of the bacon; the bacon should still be very soft and pliable, about 8 minutes. Remove bacon from the baking sheet and pat with paper towels to remove excess grease. Drain or wipe grease from the baking sheet.\nWrap each scallop piece with a piece of bacon, and secure with a toothpick. Place onto baking sheet. Sprinkle the scallops with brown sugar.\nBake in preheated oven until the scallops are opaque and the bacon is crisp, 10 to 15 minutes, turning once.\n",
        "picture_link": "bgUa6nao5qg/lTCEcAfRvNiPjjTiAPS"
    },
    {
        "title": "Grandma's Sour Cream Pound Cake",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "6 eggs, room temperature ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground mace ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 tablespoon confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch Bundt pan or 9-inch tube pan.\nBeat the butter and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg.\nPour the flour mixture into the bowl alternately with the sour cream, mixing until just incorporated. Transfer the batter into the prepared pan and spread it smooth.\nBake in the preheated oven until a toothpick inserted in the cake comes out clean, about 1 hour and 20 minutes. Cool for at least 10 minutes before inverting pan onto a cooling rack, and tapping out the cake. Dust with confectioners' sugar before serving.\n",
        "picture_link": "FflOC3ltrvxFlBtAQcFu6Elxoz33Che"
    },
    {
        "title": "Calzone",
        "ingredients": [
            "1 1/4 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1 teaspoon dry milk powder ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "3/4 cup pizza sauce ADVERTISEMENT",
            "4 ounces pepperoni sausage, chopped ADVERTISEMENT",
            "1 1/4 cups shredded mozzarella cheese ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, salt, bread flour, dry milk, sugar, and yeast in the pan of the bread machine in the order suggested by the manufacturer. Select Dough cycle.\nAfter cycle ends, roll out dough on a lightly floured surface; shape into a 16 x 10 inch rectangle. Transfer to a lightly greased cookie sheet. In a small bowl, mix together chopped pepperoni and mozzarella. Spoon pizza sauce in a stripe down the center of dough lengthwise; add sausage and cheese filling. Make diagonal cuts 1 1/2 inches apart down each side, cutting within a 1/2 inch of the filling. Criss cross strips over filling, sealing with water. Brush top with melted butter.\nBake at 350 degrees F (175 degrees C) for 35 to 45 minutes.\n",
        "picture_link": "f8h40PftoPINTzFndcsW.aeSuiN0Y2K"
    },
    {
        "title": "Rum or Bourbon Balls",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons corn syrup ADVERTISEMENT",
            "1/2 cup rum ADVERTISEMENT",
            "2 1/2 cups crushed vanilla wafers ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chocolate chips into a microwave-safe medium bowl. Heat in the microwave for 1 minute, stir and then continue to heat at 20 second intervals, stirring between each, until melted and smooth. Stir in sugar and corn syrup. Blend in rum. Add crushed vanilla wafers and chopped nuts. Mix until evenly distributed. Cover and refrigerate until firm.\nRoll the chilled chocolate mixture into bite-size balls. Roll balls in a mixture of ground nuts and confectioner's sugar, or just plain confectioner's sugar. Store in a covered container for a week before serving to blend the flavors.\n",
        "picture_link": "ZSjofJvS2bijxCIxcTk9dLl0i9aQt8K"
    },
    {
        "title": "Savory Turkey Gravy",
        "ingredients": [
            "5 cups turkey stock ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon celery salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, bring the turkey stock to a boil. In a small bowl, dissolve flour in water.\nGradually whisk into the turkey stock. Season with poultry seasoning, salt, pepper, and celery salt. Bring to a boil, reduce heat, and simmer for 8 to 10 minutes, or until thickened.\n",
        "picture_link": "uwx73tZs1T4s62/jEiCQ5r635qZZjAy"
    },
    {
        "title": "The Best Chocolate Cake You Ever Ate",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour one 9 x 13 inch pan.\nSift 2 cups white sugar and 2 cups flour together; set aside.\nIn a sauce pan; combine 1/2 cup butter or margarine, oil, water, and 1/4 cup cocoa. Bring mixture to a boil, remove from heat and add to dry ingredients.\nDissolve baking soda in buttermilk; add with eggs, salt, cinnamon and 1 teaspoon vanilla to cocoa, flour mixture and stir well.\nPour batter into a 9 x 13 inch pan. Bake at 375 degrees F (190 degrees C) for 20 minutes.\nTo Make Frosting: Five minutes before cake is done combine 1/2 cup butter,1/4 cup cocoa and 1/4 cup milk in saucepan and bring to a boil.\nRemove from heat and stir in confectioners' sugar, 1 teaspoon vanilla, and chopped pecans. Pour frosting over hot cake. Cake remains moist and may be frozen. Serves 20.\n",
        "picture_link": "UgxWYnXvJ8V95xFx4hIE5a/.ARTFhJ6"
    },
    {
        "title": "Feta Chicken Salad",
        "ingredients": [
            "3 cups diced cooked chicken ADVERTISEMENT",
            "2 large stalks celery, diced ADVERTISEMENT",
            "1 red bell pepper, seeded and diced ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "6 tablespoons mayonnaise ADVERTISEMENT",
            "6 tablespoons sour cream ADVERTISEMENT",
            "1 (4 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "2 teaspoons dried dill weed ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a serving bowl, mix together the chicken, celery, and red onion. In a separate bowl, stir together the mayonnaise, sour cream, feta cheese, and dill. Pour over the chicken mixture, and stir to blend. Taste, and season with salt and pepper as needed. Serve immediately, or refrigerate until serving.\n",
        "picture_link": "19STf1T/onEZoU8oWzBszaE3unC4Pfa"
    },
    {
        "title": "Party Potatoes",
        "ingredients": [
            "9 large potatoes ADVERTISEMENT",
            "8 ounces cream cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 teaspoons onion salt ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart casserole dish, and set aside.\nBring a large pot of lightly salted water to a boil. Cook potatoes in boiling water until tender. Drain, and transfer to a large mixing bowl. Mash until smooth. Stir in cream cheese, sour cream, onion salt, salt, and pepper. Beat until light and fluffy. Transfer to the prepared casserole dish, and dot with pieces of butter.\nBake for 30 minutes in the preheated oven, or until heated through.\n",
        "picture_link": "CiY45v7qathmDvcmWIXx7poIUVtartW"
    },
    {
        "title": "Triple the Ginger Cookies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 tablespoons minced fresh ginger root ADVERTISEMENT",
            "1/2 cup chopped crystallized ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the butter and brown sugar until smooth. Beat in the egg and molasses. Combine the flour, ground ginger, baking soda, and salt; stir into the molasses mixture using a wooden spoon. Mix in the fresh and crystallized gingers. Cover, and refrigerate dough for at least 2 hours, or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Shape dough into 1 inch balls, and place about 2 inches apart onto ungreased cookie sheet.\nBake for 10 minutes in the preheated oven, or until lightly browned. Cool on wire racks.\n",
        "picture_link": "YBjdgJgAtaqGe2rKc/cDg8z7Y87YuRW"
    }
]