[
    {
        "title": "Peas Supreme",
        "ingredients": [
            "1 (16 ounce) package frozen green peas, thawed ADVERTISEMENT",
            "4 strips bacon, cut into bite-size pieces ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 teaspoons cooking sherry ADVERTISEMENT",
            "1 pinch monosodium glutamate (such as Ac'cent®), or to taste ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 dash Worcestershire sauce, or to taste ADVERTISEMENT",
            "1 (4 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour peas in a saucepan and cover with water. Bring water to a boil, reduce heat to medium-low, and simmer until peas are hot and tender, 5 to 7 minutes; drain.\nCook and stir bacon in a large skillet over medium-high heat until the fat renders and the bacon is crisp, 7 to 10 minutes. Stir onion into the bacon dripping; cook and stir with the bacon until tender, 5 to 7 minutes.\nPour cream over the bacon mixture; cook and stir until the cream thickens, about 5 minutes. Season thickened cream with monosodium glutamate, salt, and pepper. Pour sherry into the thickened cream. Add drained peas and mushrooms to the skillet; gently stir to coat.\n",
        "picture_link": "4n7.HFEppnKc4tPp94ydZMmWmOY4OCC"
    },
    {
        "title": "Pork Wonton Soup",
        "ingredients": [
            "1 tablespoon rice wine ADVERTISEMENT",
            "1/2 teaspoon cornstarch ADVERTISEMENT",
            "3/4 pound ground pork ADVERTISEMENT",
            "2 tablespoons finely chopped green onion (white and light green parts) ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon minced fresh ginger ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "25 wonton wrappers ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "3 heads bok choy, sliced ADVERTISEMENT",
            "10 sugar snap peas, sliced ADVERTISEMENT",
            "1 carrot, thinly sliced ADVERTISEMENT",
            "2 tablespoons finely chopped green onion (white and light green parts) ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup finely chopped green onion (white and light green parts) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk rice wine and cornstarch together in large bowl. Add ground pork, 2 tablespoons green onion, soy sauce, ginger, sesame oil, and sugar; stir until well combined and paste-like, about 10 minutes. Cover and refrigerate for 1 hour.\nPlace about 1 tablespoon pork mixture in the middle of a wonton wrapper. Brush edges with beaten egg and pinch edges to seal, creating a small pouch. Repeat with remaining wonton wrappers and pork mixture. Refrigerate until ready to use.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add bok choy, snap peas, carrot, and 2 tablespoons green onion, cover, and steam until tender, 2 to 6 minutes. Remove and distribute evenly among 4 soup bowls.\nPlace wontons in steamer basket and steam until pork is no longer pink inside, about 10 minutes. Remove and place in soup bowls alongside vegetables.\nHeat chicken broth and water in a saucepan until hot, 5 to 7 minutes. Pour hot broth mixture evenly into soup bowls atop vegetables and wontons. Sprinkle 1/4 cup chopped green onion evenly over each bowl.\n",
        "picture_link": "FQRITU7FT//U3/29vsgT5Amy0o48MAa"
    },
    {
        "title": "Amber's Penne Alla Vodka",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 fresh whole tomatoes, chopped ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "7 cloves garlic, chopped ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes ADVERTISEMENT",
            "1 (12 ounce) can tomato paste ADVERTISEMENT",
            "1 cup chopped fresh basil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup vodka ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "1 pound penne pasta ADVERTISEMENT",
            "1/2 teaspoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 3 tablespoons olive oil in a large skillet over medium heat; cook and stir fresh tomatoes, onion, and garlic in the hot oil until onion is tender, 1 to 2 minutes. Stir canned tomatoes and tomato paste into the tomato-onion mixture, breaking down the whole tomatoes with a fork. Mix basil, salt, and pepper into the tomato mixture; simmer until liquid has slightly reduced, 15 minutes.\nStir vodka into the tomato mixture; simmer vodka sauce until slightly reduced, 15 minutes. Stir cream into vodka sauce and cook until heated through, 15 minutes.\nBring a large pot with lightly salted water and 1/2 teaspoon olive oil to a boil. Cook pasta, stirring occasionally, at a boil until tender yet firm to the bite, about 10 minutes; drain. Fold pasta into vodka sauce to coat.\n",
        "picture_link": "ATlcS8aKSGOT9UlsB7hjOVUwtrhVv0O"
    },
    {
        "title": "Quick Hawaiian Haystacks",
        "ingredients": [
            "2 (10.5 ounce) cans cream of chicken soup ADVERTISEMENT",
            "3 cooked chicken breasts, cut into bite-sized pieces ADVERTISEMENT",
            "1/2 cup milk, or more as needed ADVERTISEMENT",
            "4 cups cooked rice ADVERTISEMENT",
            "1 (5 ounce) can chow mein noodles ADVERTISEMENT",
            "1 (8 ounce) can pineapple tidbits, drained ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "1 teaspoon soy sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chicken soup and chicken together in a saucepan; stir in enough milk to make a gravy-like consistency. Cook and stir chicken sauce over medium heat until smooth and heated through, 5 to 10 minutes.\nSpoon 1/2 cup rice onto 8 plates. Layer each serving of rice with chow mein noodles, the chicken mixture, pineapple, Cheddar cheese, celery, green peppers, green onions, coconut, almonds, and a drizzle of soy sauce, respectively.\n",
        "picture_link": "2ELaxinp9.b.5UakWSDr2Dwe1j5re0K"
    },
    {
        "title": "Crazy Delicious Turkey Meatloaf",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (14 ounce) package frozen mixed red, yellow, and green bell pepper strips, thawed and drained ADVERTISEMENT",
            "2 pounds 93% lean ground turkey ADVERTISEMENT",
            "1 cup Italian-seasoned bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Cover a baking sheet with aluminum foil. Spray foil with nonstick cooking spray.\nPuree peppers in a blender until smooth; pour into a bowl. Add turkey and bread crumbs to bowl; mix. Form the turkey mixture into a loaf and place on the prepared baking sheet.\nBake in preheated oven until no longer pink in the center, 45 to 60 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "AoUZuULwryL3tnfSol63ch7nP/e5J4O"
    },
    {
        "title": "Standing Roast Beef (Brined)",
        "ingredients": [
            "8 cups warm water ADVERTISEMENT",
            "8 cups brewed French-roast coffee ADVERTISEMENT",
            "1 cup kosher salt ADVERTISEMENT",
            "1 (1 ounce) package dry French onion soup mix ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1/4 cup minced garlic ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 (6 pound) standing beef rib roast ADVERTISEMENT",
            "2 teaspoons garlic powder, or to taste ADVERTISEMENT",
            "2 teaspoons onion powder, or more to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir warm water, coffee, kosher salt, onion soup mix, onion, garlic, and Worcestershire sauce in a 16-quart stock pot until salt and onion soup mix has dissolved. Lay roast in the brine and cover pot; refrigerate at least 8 hours. Turn roast over at least twice during brining.\nPreheat oven to 375 degrees F (190 degrees C).\nRemove roast from brine and pat dry with paper towels. Place roast on a rack in a roasting pan with the fat side down; sprinkle with garlic powder, onion powder, and black pepper. Flip roast and season other side the same way. Let roast stand until it reaches room temperature, about 1 hour.\nPlace roast into preheated oven and bake for 1 hour.\nTurn off heat and leave meat in the hot oven, without opening oven door, for 3 hours. Turn oven back on and set heat for 375 degrees F (190 degrees C). Let roast reheat until an instant-read meat thermometer inserted into the center of the roast reads 130 degrees F (54 degrees C) for medium-rare, 30 to 40 minutes.\n",
        "picture_link": "dqGBa8M2Fut.0oLl4du6cp72FUse5OO"
    },
    {
        "title": "Club Chicken Casserole",
        "ingredients": [
            "3 cups cooked rice ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 2/3 cups half-and-half ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1/4 teaspoon rosemary ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups diced cooked chicken ADVERTISEMENT",
            "1 (4 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1/3 cup chopped green bell pepper ADVERTISEMENT",
            "1 (2 ounce) jar pimentos ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 1/2-quart casserole dish.\nSpread the rice into the bottom of the prepared casserole dish.\nMelt butter in a saucepan over medium heat. Cook and stir flour in melted butter until frothy, 2 to 3 minutes; add half-and-half, chicken broth, rosemary, and salt to the saucepan. Stirring continually, cook the broth mixture until slightly thickened, about 5 minutes. Stir cooked chicken, mushrooms, bell pepper, and pimentos into the sauce; cook until the chicken is hot, 2 to 3 minutes. Pour the chicken mixture over the rice; stir lightly.\nBake in preheated oven until heated through and the rice is very tender, about 30 minutes.\n",
        "picture_link": "JY.7V0LqoUtDPiylNaOVVNXX.MoZkJy"
    },
    {
        "title": "Cinnamon Lemon Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter and 1 cup sugar with an electric mixer in a large bowl until smooth. Beat egg and vanilla extract into the butter until completely blended. Add flour, cinnamon, baking powder, lemon zest, and salt; continue mixing until flour is just incorporated. Cover bowl with plastic wrap; refrigerate until firm, about 2 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nStir 1/2 cup sugar and cinnamon together in a bowl; spread onto a flat surface.\nDivide dough into about 60 small balls. Roll balls in cinnamon-sugar mixture to coat. Arrange onto baking sheets.\nBake in preheated oven until edges are lightly browned, about 10 minutes.\n",
        "picture_link": "NAvQF708NTUOjQUANAi1125tA.XD/jG"
    },
    {
        "title": "Big Game Dip",
        "ingredients": [
            "1 (2 pound) loaf processed cheese (such as Velveeta®), cubed ADVERTISEMENT",
            "1 pound bulk spicy pork sausage ADVERTISEMENT",
            "1 (24 ounce) jar hot salsa ADVERTISEMENT",
            "1/2 cup hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "3 large jalapeno peppers, chopped (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt processed cheese in a slow cooker on Low. Cook and stir pork sausage in a large skillet over medium heat until browned and crumbly, about 10 minutes; drain excess grease. Mix sausage into processed cheese in the cooker, stir in salsa, hot sauce, and jalapeno peppers. Cook for 2 hours; serve hot.\n",
        "picture_link": "Mt1Afk9z0Yoe0XSctWzuSbgTngEwO.6"
    },
    {
        "title": "Cinnabon® Cupcakes",
        "ingredients": [
            "Cinnamon syrup: ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "Cake batter: ADVERTISEMENT",
            "2 1/2 cups sifted cake flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup whole milk at room temperature ADVERTISEMENT",
            "2 large egg whites at room temperature ADVERTISEMENT",
            "1 egg at room temperature ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1/2 cup unsalted butter at room temperature ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup cold heavy whipping cream ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "Cream cheese frosting: ADVERTISEMENT",
            "1/4 cup unsalted butter at room temperature ADVERTISEMENT",
            "1 (8 ounce) package cream cheese at room temperature ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 drop vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon for sprinkling, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 24 cupcake cups or line with paper liners.\nMelt 1/2 cup unsalted butter in a saucepan over low heat; stir brown sugar and 2 tablespoons cinnamon into butter until brown sugar has dissolved and cinnamon syrup is hot, about 2 minutes. Set aside.\nSift cake flour with baking powder and salt into a bowl. Whisk milk, egg whites, egg, 1/4 teaspoon vanilla extract, and almond extract together in a separate bowl. Mix 1/2 cup butter at room temperature with white sugar in a large bowl, using an electric mixer until pale yellow and creamy, about 5 minutes. Gradually beat flour mixture into creamed butter mixture, alternating with milk mixture, until batter is well blended. Continue beating for 2 more minutes.\nBeat cold cream with an electric mixer and clean beaters in a chilled glass or metal bowl until the cream is fluffy and holds soft peaks, about 4 minutes; fold whipped cream into batter. Divide batter among the prepared cupcake cups, filling them about 2/3 full.\nSpoon 1 teaspoon of cinnamon syrup into batter in each cupcake cup. Set remaining cinnamon syrup aside.\nBake cupcakes in the preheated oven until lightly browned and a toothpick inserted into the center of a cupcake comes out with moist crumbs, about 16 minutes. Remove cupcakes from pans and let cool upside down on racks.\nPlace saucepan with remaining cinnamon syrup over medium heat, stir in pecans, and bring mixture to a low boil. Immediately remove from heat and pour pecan mixture out onto a wooden cutting board. Let pecan mixture cool completely and chop the pecan candy finely.\nBeat 1/4 cup butter at room temperature with an electric mixer in a bowl until soft and creamy; beat in cream cheese until blended. Add confectioners' sugar and a drop of vanilla extract and continue to beat on high speed until frosting is fluffy, at least 5 minutes.\nFrost cooled cupcakes with frosting and decorate each with a pinch of chopped pecan candy and a sprinkle of cinnamon.\n",
        "picture_link": "VEoIG98BJ5CzqyKjDH1n2q3/4oEid4m"
    },
    {
        "title": "Beer and Gouda and Soup",
        "ingredients": [
            "1 teaspoon butter ADVERTISEMENT",
            "1 sweet onion (such as Vidalia), minced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle light beer ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup shredded Gouda cheese ADVERTISEMENT",
            "1/2 cup shredded sharp white Cheddar cheese ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 slices cooked bacon, crumbled ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 teaspoon butter in a large saucepan over medium heat; add sweet onion and cook until softened, about 4 minutes. Stir garlic into the onion; cook and stir together until garlic is fragrant, about 1 minute. Pour light beer into the saucepan, bring to a simmer, and cook until onion is completely tender, about 10 minutes.\nStir chicken broth into the beer mixture; bring to a boil. Stream milk into the saucepan while stirring to form the base of the soup.\nHeat 1/4 cup butter in a microwave-safe bowl in microwave oven until melted and hot, 30 to 60 seconds. Stir flour into the melted butter until the mixture binds into a roux; pour into the soup. Cook and stir soup until it begins to simmer and thicken, 7 to 10 minutes.\nRemove soup from heat. Melt Gouda cheese and Cheddar cheese into the soup a handful at a time, stirring each addition into the liquid until smooth; season with black pepper. Ladle soup into bowls; garnish with bacon and chives to serve.\n",
        "picture_link": "g9NSTcmgaihS3J8ScUYCOf1iVrRn7g."
    },
    {
        "title": "Norris' Sesame Pasta Salad",
        "ingredients": [
            "1 pound spaghetti ADVERTISEMENT",
            "1/2 cup sesame oil ADVERTISEMENT",
            "7 tablespoons honey ADVERTISEMENT",
            "6 tablespoons soy sauce ADVERTISEMENT",
            "1/4 cup corn oil ADVERTISEMENT",
            "2 teaspoons red pepper flakes, or to taste ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup chopped fresh cilantro, or more to taste ADVERTISEMENT",
            "3/4 cup shaved green onions, or more to taste ADVERTISEMENT",
            "1/3 cup honey-roasted peanuts, or more to taste ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes; drain.\nMix spaghetti, sesame oil, honey, soy sauce, corn oil, red pepper flakes, and salt together in a large bowl until spaghetti is evenly coated. Cover bowl with plastic wrap and refrigerate for at least 4 hours. Add cilantro, green onions, peanuts, and sesame seeds; toss to combine.\n",
        "picture_link": "zneLEodWurqGqJXQmhtzlYyQ47653K2"
    },
    {
        "title": "Tasty Spicy Rice Pilaf",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 roasted red pepper, diced ADVERTISEMENT",
            "6 mushrooms, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "2 cups uncooked instant rice ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "2 teaspoons red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat; cook and stir onion, red pepper, mushrooms, and garlic until tender, about 10 minutes. Stir in rice. Add chicken stock; cover and boil until liquid is absorbed, about 10 minutes. Season with red pepper flakes, salt, and black pepper.\n",
        "picture_link": "ihz/InbsRpnnBe83rlcB5oxsQl/Zzre"
    },
    {
        "title": "Zucchini and Ricotta Casserole",
        "ingredients": [
            "3 large zucchini, cut into bite-size pieces ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "1/4 cup (packed) finely chopped fresh mint ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 teaspoon smoked paprika ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 cup ricotta cheese, or as needed ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nMix zucchini, garlic, mint, olive oil, smoked paprika, and salt in a large bowl until zucchini is evenly coated; transfer to a baking dish.\nDrop dollops of ricotta cheese atop zucchini mixture. Season with cayenne pepper.\nBake in the preheated oven until zucchini is tender and cheese is browned, about 30 minutes.\n",
        "picture_link": "4Ph4i9qWc.Wkke6TNYOZGHDFPoar/pq"
    },
    {
        "title": "Grain-Free Chicken Tenders",
        "ingredients": [
            "1 cup almond flour ADVERTISEMENT",
            "1 cup finely grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon dried basil, or to taste ADVERTISEMENT",
            "1/2 teaspoon dried thyme, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken breast halves, cut into strips ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil.\nMix almond flour, Parmesan cheese, basil, thyme, salt, and pepper together in a bowl.\nDip chicken strips in the melted butter; press strips into almond flour mixture until completely coated. Transfer coated strips to the prepared baking sheet.\nBake in the preheated oven on the middle rack until strips are golden brown and no longer pink in the center, at least 20 minutes.\n",
        "picture_link": "TPi./dzZXJSKh..QQX45I6Ngo27PEim"
    },
    {
        "title": "Chocolate Covered Bacon Strips",
        "ingredients": [
            "12 slices thick-cut bacon ADVERTISEMENT",
            "12 wooden skewers ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 tablespoon vegetable shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place a baking rack on top of a large baking sheet.\nThread each slice of bacon onto a skewer; place skewered bacon on the baking rack.\nBake bacon in the preheated oven until crisp; 20 to 25 minutes. Remove from oven and cool completely.\nCombine chocolate chips and shortening in a microwave-safe bowl. Heat in the microwave in 30 second intervals until chocolate is melted and smooth, stirring after each interval.\nCoat each side of the skewered bacon with the chocolate mixture using a pastry brush. Place coated bacon on a sheet of waxed paper. Refrigerate until firm, at least 30 minutes. Store in refrigerator until ready to serve.\n",
        "picture_link": "gzg1lKDvm1iOP6b4gL8RfjeklRvS9We"
    },
    {
        "title": "Cheater Pierogi",
        "ingredients": [
            "2 teaspoons butter ADVERTISEMENT",
            "4 slices bacon, chopped ADVERTISEMENT",
            "2 tablespoons bacon drippings ADVERTISEMENT",
            "1/2 yellow onion, diced ADVERTISEMENT",
            "5 medium Yukon Gold potatoes, peeled and halved ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 1/2 cups farmer’s cheese, or any cheese blend ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "50 wonton wrappers, or as needed ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Add chopped bacon and onions; cook and stir until the bacon is crisp and the onions are browned, 6 to 8 minutes. Remove bacon and onions to a small dish, reserving about 2 tablespoons of the bacon fat for frying the pierogi.\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and mash until smooth. Allow to cool for 10 minutes. Season with salt, black pepper, and cayenne pepper. Stir in 1 egg and farmer's cheese. Cover and refrigerate until chilled, about 30 minutes.\nBeat 1 egg with 1 tablespoon water in a bowl for the egg wash.\nPlace 2 to 3 wonton wrappers at a time on a lightly floured work surface. Brush the edges lightly with the egg wash. Place about 2 tablespoons of filling in the center of each wrapper. Fold each pierogi in half and lightly press the edges together to seal.\nBring a pot of salted water to a boil and cook pierogi in the boiling water until they float, 2 to 3 minutes. Drain.\nTransfer pierogi to the skillet with reserved bacon drippings in batches and cook over medium heat until lightly browned, about 2 minutes per side. Transfer to a bowl, toss with the bacon and onions, and serve garnished with sour cream and chives.\n",
        "picture_link": "nj/z/OjiKVnhcebi/qicI4WqS1yRRaq"
    },
    {
        "title": "Parmesan Zucchini Patties",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 cups shredded zucchini ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "2 tablespoons chopped parsley ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground thyme ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1 cup crushed saltine crackers ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup vegetable oil, or as needed ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons vegetable oil in a large skillet over medium heat. Cook and stir zucchini, onion, and garlic in hot oil until vegetables are limp and moisture evaporates, about 5 minutes. Stir basil, parsley, black pepper, and thyme into the vegetables; remove from heat. Transfer zucchini mixture to a large mixing bowl.\nStir eggs, crushed crackers, and 1 cup Parmesan cheese into the zucchini mixture until it binds together; shape into 14 3-inch patties.\nPour enough vegetable oil in a skillet to reach about 1/2 inch deep; heat over medium-high heat.\nCook patties, 3 to 4 at a time, in hot oil until well browned, about 2 minutes per side. Sprinkle with additional Parmesan cheese to serve.\n",
        "picture_link": "VT57lzWjWL3AtpCyA7ned2irBKKeyUK"
    },
    {
        "title": "Cranberry Apple Cake",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 3/4 cups brown sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "2 cups chopped apples ADVERTISEMENT",
            "2 cups fresh cranberries ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch fluted-tube pan (such as Bundt(R)).\nWhisk eggs, brown sugar, oil, and vanilla extract together in a bowl until smooth.\nSift flour, baking soda, salt, cinnamon, and nutmeg together in a separate bowl; stir into egg mixture. This is a very thick mixture so use a solid spoon to mix together. Fold in apples, cranberries, and pecans until evenly incorporated. Pour batter in the prepared pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 1 hour 15 minutes.\n",
        "picture_link": "vSdoz7PHGyEmMXW5/YAqE5.XlS8UIK6"
    },
    {
        "title": "Prosciutto Wrapped Chicken Breasts with Orange-Cranberry Jus",
        "ingredients": [
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup softened butter ADVERTISEMENT",
            "4 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "8 thin slices prosciutto ADVERTISEMENT",
            "1 1/4 cups chicken stock ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 cups fresh cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a glass baking dish.\nMix the minced garlic into the softened butter. Cut a slit into the side of each chicken breast to make a pocket, and fill with the garlic butter. Wrap each chicken breast with two slices of prosciutto to form a bundle. Place into baking dish, seam-side down, and pour in chicken stock.\nBake chicken in preheated oven until no longer pink, about 30 minutes. Once finished, remove chicken from oven and cover with a sheet of aluminum foil. Allow to rest for 10 minutes.\nMeanwhile, bring the cooking liquid from the chicken, the orange juice and the sugar to a simmer in a saucepan over medium-high heat. Stir in cranberries, and cook until they begin to pop, about 10 minutes. Strain through a mesh sieve, pressing to expel all of the juice. Discard the solids. To serve, cut each breast into several slices, place the slices onto serving plates, and drizzle with cranberry jus.\n",
        "picture_link": "Z9i/QSFjLtFVRx3NL9JEg4h0Rqn6Bee"
    },
    {
        "title": "Pork with Linguine and Blue Cheese Mushroom Sauce",
        "ingredients": [
            "4 ounces linguine pasta ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 pound pork tenderloin, cut into 1 inch medallions ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup crumbled blue cheese ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMeanwhile, melt 1 tablespoon of butter in a skillet over medium heat. Add the pork tenderloin, and cook until meat is no longer pink inside. Remove from skillet and keep warm.\nMelt 2 tablespoons of butter in the same skillet over medium-high heat; stir in mushrooms and cook until tender. Pour in chicken broth and bring to a simmer. Once the broth is hot, stir the blue cheese and salt until the cheese has melted.\nMix together the water and cornstarch and slowly add to the simmering broth. Cook for 1 minute until thick and clear, stirring continually. Serve over linguine and pork medallions.\n",
        "picture_link": "UY8c6/UwgHselG6VOO/T1.m5DKPF1Wa"
    },
    {
        "title": "Vonciel's Seafood Salad",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "1 pound scallops, rinsed and patted dry ADVERTISEMENT",
            "1 (6 ounce) can crabmeat, drained and flaked ADVERTISEMENT",
            "1 (12 ounce) can water packed tuna, drained and flaked ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon seafood seasoning, such as Old Bay™ ADVERTISEMENT",
            "1 cup mayonnaise, or to taste ADVERTISEMENT",
            "2 tablespoons yellow mustard ADVERTISEMENT",
            "1/2 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "5 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 hard-cooked egg, sliced ADVERTISEMENT",
            "1/2 teaspoon paprika, as garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil over medium heat in a large skillet and add onions, stirring until translucent, about 7 minutes. Add shrimp, scallops, crab meat and tuna. Cook until shrimp are pink and the scallops are opaque, 8 to 10 minutes. Season with salt, pepper, and Old Bay Seasoning. Remove from heat.\nWhisk together the mayonnaise, mustard, garlic powder, oregano, turmeric and sugar in a large bowl. Mix in the bell pepper, celery and chopped eggs.\nAdd seafood and toss until evenly combined. Garnish with eggs slices and sprinkle with paprika.\nCover and refrigerate for 2 to 3 hours or overnight before serving to let flavors blend.\n",
        "picture_link": "TjtBg59v4IlCyb8St8E3ZUYNSow9zhK"
    },
    {
        "title": "Roasted Potatoes and Apples",
        "ingredients": [
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons yellow mustard ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 pound potatoes, scrubbed and cubed with skin ADVERTISEMENT",
            "1 pound apples, cored and cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13 inch baking dish.\nWhisk together the vinegar, soy sauce, mustard, brown sugar, paprika, and salt in a large bowl until well mixed. Whisk in the olive oil until smooth, then add potatoes and apples, and toss to coat. Pour mixture into prepared baking dish.\nBake in preheated oven until the potatoes are tender and golden brown, 30 to 35 minutes.\n",
        "picture_link": "r96NKOd8mHBaWUY8JFr6DlJdh6fKEKO"
    },
    {
        "title": "Christine's Meat Loaf",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 pound ground turkey ADVERTISEMENT",
            "1/2 pound bulk Italian sausage ADVERTISEMENT",
            "1 (10.75 ounce) can vegetable beef soup (such as Campbell's®) ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1/2 cup plain bread crumbs ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1/4 teaspoon prepared yellow mustard ADVERTISEMENT",
            "1 teaspoon minced garlic, or to taste ADVERTISEMENT",
            "2 dashes Worcestershire sauce ADVERTISEMENT",
            "2 dashes browning sauce (such as Kitchen Bouquet®) ADVERTISEMENT",
            "2 pinches seasoned salt (such as Johnny's Seasoning Salt®) ADVERTISEMENT",
            "2 pinches ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground beef, ground turkey, Italian sausage, vegetable soup, eggs, bread crumbs, barbeque sauce, ketchup, yellow mustard, garlic, Worcestershire sauce, browning sauce, seasoned salt, and black pepper in a bowl until thoroughly combined. Form into a loaf and place meat loaf into a 9x13-inch baking dish.\nBake in the preheated oven until meat loaf is browned and no longer pink inside, 60 to 75 minutes. An instant-read meat thermometer inserted into the thickest part of the loaf should read at least 160 degrees F (70 degrees C). Let meat loaf rest for 10 minutes before cutting into 1/2-inch thick slices.\n",
        "picture_link": "og.4ZdsC02VHNidSmTAusGnq2lydiWu"
    },
    {
        "title": "Ginger Orange Brussels Sprouts",
        "ingredients": [
            "1/2 pound Brussels sprouts ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1 tablespoon freshly grated ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Shred Brussels sprouts in a food processor.\nHeat olive oil in a skillet over medium heat; cook and stir shredded Brussels sprouts in the hot oil until slightly softened, about 5 minutes. Reduce heat to low; cook and stir pecans into the Brussels sprouts until pecans are fragrant and toasted, about 2 minutes.\nStir orange juice into Brussels sprouts mixture; fold in cranberries and ginger. Simmer mixture until juice is mostly evaporated, about 5 minutes.\n",
        "picture_link": "dy4s16WJQHzSyO9qlNLjWTrurelHyC2"
    },
    {
        "title": "Impossibly Easy Ham and Asparagus Pie",
        "ingredients": [
            "2 cups diced ham ADVERTISEMENT",
            "2 cups shredded Swiss or Cheddar cheese ADVERTISEMENT",
            "2/3 cup chopped green onion ADVERTISEMENT",
            "2 cups diced asparagus ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 1/2 cups all-purpose baking mix (such as Bisquick®) ADVERTISEMENT",
            "7 eggs, lightly whisked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease or spray a 13 x 9-inch (33 x 23 cm) baking dish. Layer ham, cheese, green onion and asparagus in dish.\nWhisk milk into baking mix a little at a time so mixture doesn't get lumpy. Whisk in eggs just until blended. Pour mixture carefully over ingredients in baking dish.\nBake in a preheated 400 degrees F (200 degrees C) oven until puffed and golden brown, and a knife inserted in centre comes out clean, 35 to 45 minutes.\nLet cool for 5 minutes before slicing and serving.\n",
        "picture_link": "ZWccInK0frKLkK33HdQO9JXnMrUfr1."
    },
    {
        "title": "Pomegranate Martini II",
        "ingredients": [
            "4 fluid ounces pomegranate juice ADVERTISEMENT",
            "2 fluid ounces cranberry juice cocktail ADVERTISEMENT",
            "2 fluid ounces raspberry vodka ADVERTISEMENT",
            "2 fluid ounces orange-flavored liqueur ADVERTISEMENT",
            "1 fluid ounce grenadine syrup ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pomegranate juice, cranberry juice, raspberry vodka, orange-flavored liqueur, grenadine syrup, and crushed ice in a shaker. Shake vigorously to chill. Pour into martini glasses, and serve.\n",
        "picture_link": "ZyU0bqh8/VCnF88i6U/.dgB5TzP1Suy"
    },
    {
        "title": "Pumpkin Cheesecake",
        "ingredients": [
            "1 teaspoon butter, softened ADVERTISEMENT",
            "1 1/4 cups graham cracker crumbs ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "2 pounds cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 (16 ounce) cans solid-pack pumpkin ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 tablespoon pumpkin pie spice ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Brush the inside of a 10-inch springform pan with 1 teaspoon softened butter.\nMix graham cracker crumbs, cinnamon, 1/4 cup white sugar, and 1/4 cup melted butter together in a bowl until incorporated. Press mixture into the bottom of the springform pan.\nBeat cream cheese and 1 1/2 cup white sugar together in a bowl until smooth. Add eggs, 1 at a time, blending in each egg before adding the next. Stir in cream, pumpkin, 2 teaspoons vanilla extract, and pumpkin pie spice until thoroughly blended. Pour cream cheese mixture over the graham cracker crust.\nBake in the preheated oven until cheesecake is set in the middle, 1 1/2 hours. Remove from oven and let rest for 10 minutes, or leave on oven rack with door ajar for up to several hours.\nBeat sour cream, 1/2 cup sugar, and 2 teaspoons vanilla extract together in a bowl until smooth. Pour sour cream topping over cheesecake. Chill in refrigerator before removing sides of pan, about 3 hours.\n",
        "picture_link": "yeNl.tUQNgSDAqe2q9khLAdZ.2xlIcS"
    },
    {
        "title": "Spicy and Sweet Spinach",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 pound fresh spinach ADVERTISEMENT",
            "1 teaspoon dried red pepper flakes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/3 cup golden raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in large skillet over medium-high heat; stir in the garlic and cook until just beginning to brown. Add the fresh spinach and stir to coat with the oil. Season with red pepper flakes, salt, and ground black pepper. Cover the skillet and cook for 4 to 5 minutes. Pour in a little bit of liquid (water or broth) if your skillet seems dry. As the spinach cooks, it will wilt and reduce in size. Once the spinach is cooked through, add raisins and stir for 1 more minute, until heated through.\n",
        "picture_link": "PbytvTdbnQzdfLQk5S4Zcc.TROokxxC"
    },
    {
        "title": "Kristen's Brown Sugar Crepe Filling",
        "ingredients": [
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "16 crepes (see footnote) ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix brown sugar and sour cream until no lumps remain. Spoon mixture into crepes and top with sliced bananas. Fold the crepes decoratively and sprinkle with confectioners' sugar.\n",
        "picture_link": "vVsaH8rBMijvO7i6JvyeI3z4bkXq.HK"
    },
    {
        "title": "Sweet and Smoky Slow-Cooked Pulled Pork Loin",
        "ingredients": [
            "3 (1 1/2 pound) pork tenderloins ADVERTISEMENT",
            "4 cups chopped onions ADVERTISEMENT",
            "1 (18 ounce) bottle hickory smoke-flavored barbecue sauce ADVERTISEMENT",
            "1 (14.5 ounce) can crushed tomatoes ADVERTISEMENT",
            "1/2 (12 fluid ounce) can or bottle diet pepper-type soda (such as Diet Dr Pepper®) ADVERTISEMENT",
            "1/4 cup reduced-sodium Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons liquid smoke flavoring ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut each pork tenderloin into 4 pieces and place into a slow cooker; set to High.\nStir onions, barbecue sauce, crushed tomatoes, diet soda, Worcestershire sauce, garlic, liquid smoke flavoring, paprika, red pepper flakes, cinnamon, and nutmeg in a bowl; pour mixture over pork tenderloin pieces. Cover and cook until tenderloin pieces begin to shred at the edges, 3 to 4 hours.\nShred meat using 2 forks; reduce slow cooker setting to Low and cook 1 more hour.\n",
        "picture_link": "pQwSIixi2ZMam9KBj/wSIVXua9zMPJ2"
    },
    {
        "title": "Louisiana Crawfish Boil",
        "ingredients": [
            "2 heads garlic, unpeeled ADVERTISEMENT",
            "5 bay leaves ADVERTISEMENT",
            "2 (3 ounce) packages dry crab boil ADVERTISEMENT",
            "1 tablespoon liquid shrimp and crab boil seasoning ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 large oranges, halved ADVERTISEMENT",
            "3 large lemons, halved ADVERTISEMENT",
            "2 large whole artichokes ADVERTISEMENT",
            "15 red potatoes, washed ADVERTISEMENT",
            "30 pieces baby corn ADVERTISEMENT",
            "2 large onions, sliced ADVERTISEMENT",
            "2 (16 ounce) packages mushrooms, cleaned ADVERTISEMENT",
            "1/2 pound fresh green beans, trimmed ADVERTISEMENT",
            "2 (16 ounce) packages smoked sausage, cut into 1/2 inch slices ADVERTISEMENT",
            "50 live crawfish, rinsed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a very large pot about 1/3 full with water. Add the garlic, bay leaves, dry and liquid crab boil seasonings, salt, pepper, oranges, lemons, artichokes, and potatoes. Bring to a boil over high heat, then reduce to a simmer, and cook for 20 minutes.\nStir in the corn, onions, mushrooms, and green beans; cook 15 minutes more. Stir in the sausage; cook 5 minutes more. Add the crawfish, return mixture to boil, then simmer until the crawfish shells turn bright red and the tails pull out easily, about 5 minutes. Test for doneness by peeling a crawfish. Be sure not to overcook, or crawfish will become tough.\nDrain well. Serve crawfish hot, Louisiana-style, spread over a picnic table covered with newspapers.\n",
        "picture_link": "GDxz3jXgNBblAF9B.30h1Bxy7c4plRa"
    },
    {
        "title": "Breaded Chicken Limone",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 cups bread crumbs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 tablespoons butter, divided ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (10 ounce) package frozen Brussels sprouts, thawed and diced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 (16 ounce) can navy beans, drained ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, for garnish ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nSeason flour, eggs, and bread crumbs with salt and pepper. Mix cayenne pepper into the flour only. Dip each breast into flour, then into the beaten eggs, and then into the bread crumbs, coating evenly. Place onto a greased cookie sheet. Bake for 15 minutes on each side or until brown and crispy.\nWhile chicken bakes, heat oil and 2 tablespoons of the butter in a skillet over medium heat. Add garlic and Brussels sprouts and stir until garlic releases its fragrance and sprouts are heated through, about 2 minutes.\nStir in the flour. Then add the water, lemon juice, drained beans, and sugar. Stir over medium heat until sauce thickens, about 8 minutes. Add additional water if sauce is too thick. Remove from the heat and stir in remaining butter, 1/4 cup Parmesan cheese, salt and pepper.\nPlace each piece of chicken onto a serving plate. Spoon the sauce over it and garnish with chopped parsley and remaining Parmesan cheese.\n",
        "picture_link": "GP4PB7GB57734f5oJBa4bVymKa3Fe9S"
    },
    {
        "title": "Church Supper Macaroni and Cheese",
        "ingredients": [
            "2 tablespoons salt ADVERTISEMENT",
            "2 cups elbow macaroni ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1/2 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 1/2 pounds extra-sharp Cheddar cheese, shredded ADVERTISEMENT",
            "1 pinch paprika, or to taste ADVERTISEMENT",
            "1/4 cup butter (optional) ADVERTISEMENT",
            "1/2 cup soft bread crumbs (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2-quart casserole with butter.\nDissolve salt in a large pot of water. Bring to a boil and cook macaroni, stirring often, until pasta is tender but still slightly firm to the bite, about 8 minutes. Rinse macaroni under cool water, drain, and transfer to a bowl. Stir 1/4 cup softened butter into macaroni and toss a few times to melt butter and coat macaroni.\nBeat eggs in a bowl; whisk evaporated and condensed milks into eggs.\nSpread a layer of macaroni into the bottom of the prepared casserole; sprinkle with a layer of Cheddar cheese. Continue layering macaroni and cheese, ending with a layer of cheese on top. Pour egg-milk mixture over the layers. Use a fork to gently dig into the layers, assuring that the egg-milk mixture flows into all the layers. Sprinkle with paprika.\nMelt 1/4 cup butter in a small skillet over medium heat; cook bread crumbs in the hot butter, stirring constantly, until fragrant and golden, 2 to 3 minutes. Sprinkle crumb topping over casserole.\nBake in the preheated oven until casserole is browned and bubbling, about 45 minutes.\n",
        "picture_link": "s9icg46dTGon2BTadl1TXzmfl2OISGa"
    },
    {
        "title": "Easy Breakfast Sausage Burgers",
        "ingredients": [
            "1 (16 ounce) package bulk hot pork sausage ADVERTISEMENT",
            "2 tablespoons butter or margarine, softened ADVERTISEMENT",
            "5 hamburger buns, split ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "15 dill pickle slices ADVERTISEMENT",
            "5 slices pepperjack cheese ADVERTISEMENT",
            "1 small red onion, sliced ADVERTISEMENT",
            "10 pickled jalapeno slices (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Form the bulk hot pork sausage into 5 patties. Heat a large skillet, and fry the patties over medium high heat. Remove the sausage from the skillet and drain on paper towels.\nMelt butter in a second large skillet, and toast the buns over medium heat until golden brown.\nMeanwhile, break the eggs into the same skillet used for frying the sausage; reduce the heat to medium-low. Cook until the white is completely set and the yolk thickens. Flip the eggs and continue cooking for another 30 seconds, or until the yolk is to the diners' preferences.\nStack your toasted buns starting with the pickles and jalapeno slices on the bottom, then the cooked sausage patty, pepperjack cheese, fried egg, and onion. Cover with the top half of the bun. Enjoy as the cheese melts between the egg and the sausage.\n",
        "picture_link": "tiG/SUIxdZoGJHLWdAYkkIYT4fBm0hi"
    },
    {
        "title": "Pea Shoots and Chicken in Garlic Sauce",
        "ingredients": [
            "2 skinless, boneless chicken breast halves - cut into thin strips ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 1/2 teaspoons sesame oil ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 bunch pea shoots, trimmed ADVERTISEMENT",
            "3/4 cup chicken broth ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the strips of chicken breast with the cornstarch in a mixing bowl. Sprinkle with the sesame oil and toss until evenly mixed.\nHeat the vegetable oil in a wok or large skillet over high heat. Stir in the chicken and cook until lightly browned, about 5 minutes. Add the garlic and cook until fragrant. Stir in the pea shoots just until wilted; pour in the chicken broth and bring to a simmer. Cook and stir a few minutes until the chicken broth has thickened. Season to taste with salt and pepper.\n",
        "picture_link": "YZcUG2K2JHtGzkO9kplyo/w3/iVG/2G"
    },
    {
        "title": "Really Raspberry ",
        "ingredients": [
            "1 cup firm tofu ADVERTISEMENT",
            "2 cups apple juice ADVERTISEMENT",
            "2 cups frozen raspberries ADVERTISEMENT",
            "4 tablespoons raspberry jelly ADVERTISEMENT",
            "3 bananas, frozen and chunked ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine tofu, apple juice, frozen raspberries, jelly, frozen bananas and almond extract. Blend until smooth.\n",
        "picture_link": "FqfQI/SLUqtdkiSmxbwJ7ptVWisuvDC"
    },
    {
        "title": "Old Fashioned Caramel Pie",
        "ingredients": [
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "4 egg yolks, beaten ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, mix together 1 cup sugar, flour, salt, milk, and egg yolks, stirring until smooth. Cook over medium heat until thick and bubbly, stirring constantly. Remove from heat and set aside.\nSprinkle remaining 1 cup sugar in a 10 inch cast iron skillet. Cook over medium heat, stirring constantly until sugar is caramelized. Remove from heat and carefully pour into warm cream mixture. Stir until smooth. Pour mixture into pastry. Chill completely and serve with whipped cream\n",
        "picture_link": "eNTi2jcE7CccQwSsFOkH4jI1t5xihKa"
    },
    {
        "title": "Peanut Butter Ice Cream Pie II",
        "ingredients": [
            "1 quart chocolate ice cream, softened ADVERTISEMENT",
            "1/2 (16 ounce) jar crunchy peanut butter ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix ice cream and peanut butter together. Pour into pie crust and freeze until ice cream is firm. Serve and enjoy!\n",
        "picture_link": "Fh.rpqRkfb6Q3gBVixnVgdw6kBvaMyC"
    },
    {
        "title": "Summer Pasta D'lite",
        "ingredients": [
            "6 large black olives, chopped ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "1 (5 ounce) can tuna, drained ADVERTISEMENT",
            "1/2 cucumber, chopped ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 ounces angel hair pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In medium bowl, combine olives, tomatoes, tuna, cucumber, onion, garlic, olive oil, salt and pepper. Stir well and chill in refrigerator for 2 hours.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and rinse with cold water until cool. Toss with tomato mixture, and serve.\n",
        "picture_link": "eX.s2CyZiJd7.lOMA5fhwBwuVNwJkCO"
    },
    {
        "title": "Toffee and Cinnamon Apples",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "4 apples - peeled, cored and cut into thin wedges ADVERTISEMENT",
            "10 caramels ADVERTISEMENT",
            "4 tablespoons heavy cream ADVERTISEMENT",
            "1/2 cup pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large skillet over medium heat, stir together butter, sugar and cinnamon until sugar is dissolved. Place apples in pan and stir and cook until apples begin to soften and color, 5 minutes. Stir in caramels, reduce heat, and stir until caramels are melted. Stir in cream and pecans and simmer 1 minute more. Remove from heat and cool slightly before serving.\n",
        "picture_link": "Fn2T/z0LhQj4kyPfAVd3Mv6.BDw6hTW"
    },
    {
        "title": "Coffee Ice Cream Fudge Cake",
        "ingredients": [
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "10 ounces semisweet chocolate, chopped ADVERTISEMENT",
            "16 graham crackers, broken into 1/2-inch pieces ADVERTISEMENT",
            "1 cup toasted almonds ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 1/2 quarts coffee ice cream, softened ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make fudge sauce, combine heavy cream and corn syrup in heavy saucepan. Bring to a boil, remove from heat, add chocolate and whisk until smooth. Refrigerate until cool, about 45 minutes.\nTo make ice cream cake, preheat oven to 350 degrees F (175 degrees C). Finely grind graham crackers and almonds in food processor or blender. Stir in sugar. Add butter and process until moist crumbs form. Press mixture into bottom and sides of 9 inch spring form pan. Bake until golden, about 12 minutes. Allow to cool, then spread 2 cups softened ice cream over crust. Spoon 3/4 cup fudge sauce over ice cream. Freeze until set, then repeat layering. Cover and freeze 8 hours or overnight. Refrigerate remaining fudge sauce.\nThe next day, preheat the oven broiler. Warm the remaining fudge sauce in the microwave or a small saucepan. Place the cake pan on a cookie sheet. Spread the marshmallow creme over cake and sprinkle miniature marshmallows on top. Place under broiler until marshmallows are deep brown. Loosen cake with knife and remove sides of pan. Serve immediately with warmed fudge sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Black Bean Cakes",
        "ingredients": [
            "3 cups dry black beans ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place black beans in a large pot with enough water to cover. Bring to a boil, reduce heat, and simmer 1 hour, or until tender.\nIn an electric blender or food processor, process black beans until smooth. Stir in cumin, chili powder, salt, and cilantro; blend. Roll the mixture into balls, allowing 3 tablespoons of mixture per ball.\nPlace balls between sheets of wax paper and press down on the wax paper to form 1/8 inch thick rounds.\nHeat oil in a large non-stick skillet. Fry the cakes 2 or 3 minutes per side.\nIn a bowl, combine yogurt, milk, and cayenne pepper (to taste). Serve the sauce over the hot black bean cakes.\n",
        "picture_link": "IGShMQ7KVHD6xbS6LzO5cnVf5jlSXna"
    },
    {
        "title": "Potato Skins",
        "ingredients": [
            "5 large baking potatoes ADVERTISEMENT",
            "4 cups shredded Gouda cheese ADVERTISEMENT",
            "3 chopped green onions ADVERTISEMENT",
            "1 pound pepperoni sausage sticks, quartered and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBake potatoes in the preheated oven 1 hour, or until tender. Remove from heat.\nLower oven temperature to 350 degrees F (175 degrees C).\nCut baked potatoes in half. Scoop out potato, leaving a small layer on the skins. Cut halves into four strips. Place strips on a medium baking sheet.\nSprinkle 1 cup Gouda cheese thinly over potato strips. Top with pepperoni, followed by green onions and remaining Gouda cheese.\nBake topped potato strips in the 350 degrees F (175 degrees C) oven 30 minutes, or until cheese is bubbly and lightly browned.\n",
        "picture_link": "qbaJ50IlNETWGa0t8DlDpjD6t6deY9e"
    },
    {
        "title": "Thousand Island Dressing III",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons chili sauce ADVERTISEMENT",
            "2 tablespoons minced green bell pepper ADVERTISEMENT",
            "2 tablespoons minced pimento ADVERTISEMENT",
            "2 tablespoons minced sweet pickle ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the mayonnaise, chili sauce, green pepper, pimento and pickle. Chill until ready to serve.\n",
        "picture_link": "ppCGmNoPDvUvUnf55OW8Il9hFPrlfU6"
    },
    {
        "title": "County Fair Corn Dogs",
        "ingredients": [
            "10 beef frankfurters ADVERTISEMENT",
            "1/2 cup all-purpose flour for dusting ADVERTISEMENT",
            "2/3 cup cornmeal ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons corn flour (optional) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch ground cayenne pepper ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons corn oil ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Insert skewers into frankfurters and dust with flour; set aside.\nTo Make Batter: In a large bowl combine the cornmeal, 1/3 cup flour, corn flour, salt, cayenne pepper, egg, 2 tablespoons oil and water. Whisk all together.\nHeat 1 quart oil in a large skillet over high heat (to about 375 degrees F, 190 degrees C). Roll or dip franks in batter, then fry until lightly browned. Drain on paper toweling and serve.\n",
        "picture_link": "SuyudqaecPf3c53ThcHBosvKQvjia8C"
    },
    {
        "title": "Almond Buttercrunch Candy II",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups crushed almonds ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13 inch baking pan with butter. Spread the crushed nuts evenly in the greased pan.\nIn a medium saucepan melt the butter and sugar. Let it cook, stirring constantly, for five minutes until it is brown and almost smoking. Pour the mixture into the pan over the nuts. Immediately sprinkle the chocolate chips over the top of the mixture so they will melt and spread the melted chocolate over the mixture. Sprinkle additional ground nuts on top if you wish. Let the candy cool before cutting it into bars.\n",
        "picture_link": "mK301LDI1fEjJVSrSUjKBxavOC8w5hK"
    },
    {
        "title": "Spaetzle II",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour in a medium bowl, making a well for the eggs. Introduce the eggs, and mix with a fork; then knead to form a stiff dough. Pinch off half-inch pieces of batter with fingers, and cook in a large pot of boiling water until dumplings float to the top, 5 to 15 minutes.\n",
        "picture_link": "IbOumJHaZMRhkXXA8ORfySnYLBg4SJK"
    },
    {
        "title": "Vanilla Ice Cream II",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "6 (12 fluid ounce) cans evaporated milk ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine eggs, evaporated milk, condensed milk, sugar, and vanilla and mix well.\nPour mixture into an ice cream maker. Add milk, if necessary, for mixture to reach the fill line. Freeze according to manufacturer's directions.\n",
        "picture_link": "AgDLb7XwMaB1B3C2pcoiXYWVnyhCeIS"
    },
    {
        "title": "Pumpkin Bars IV",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 12x18 inch half sheet pan.\nIn a large bowl, using a wooden spoon, mix together the eggs, oil, sugar and pumpkin until well blended. Combine the flour, baking powder, baking soda, salt, cinnamon, ginger, cloves and nutmeg; stir into the pumpkin mixture until just blended. Spread evenly into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, until bars spring back when lightly touched. Cool before cutting into bars.\n",
        "picture_link": "fH9Vf917Of5HFFP8eoa0LCXwfbN5IF6"
    },
    {
        "title": "Strawberry Banana Blend",
        "ingredients": [
            "2 bananas, sliced ADVERTISEMENT",
            "15 strawberries, hulled ADVERTISEMENT",
            "1/2 cup fresh peaches, pitted and chopped ADVERTISEMENT",
            "1 3/4 cups strawberry sorbet ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine the bananas and strawberries. Blend on medium speed until smooth. Blend in the peaches and orange juice. Scoop in the sorbet. Blend until smooth.\n",
        "picture_link": "Zu0C4g/g/XfDRl0iGYY9esgNj/efIFq"
    },
    {
        "title": "Nutty Buddy Pies",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2/3 cup crunchy peanut butter ADVERTISEMENT",
            "2 cups frozen whipped topping, thawed ADVERTISEMENT",
            "3 (9 inch) prepared graham cracker crusts ADVERTISEMENT",
            "3/4 cup chocolate syrup ADVERTISEMENT",
            "1 cup chopped salted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat the cream cheese and milk until blended. Mix in the sugar and peanut butter until smooth, then fold in the whipped topping.\nSpoon mixture into all 3 graham cracker crusts. Drizzle each with chocolate syrup and a sprinkle of peanuts. Cover and freeze for about 2 to 3 hours.\nLet stand 30 minutes at room temperature before serving.\n",
        "picture_link": "UInV/lexVY3TajsqTI0G7gmY2AP8heW"
    },
    {
        "title": "Blondies I",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 3/4 cups self-rising flour ADVERTISEMENT",
            "2 cups white chocolate chips ADVERTISEMENT",
            "1/2 cup chopped macadamia nuts ADVERTISEMENT",
            "1/3 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the butter, shortening, brown sugar and white sugar until smooth. Beat in the egg and vanilla. Stir in the flour just until blended then fold in the white chocolate chips, macadamia nuts and coconut. Roll the dough into walnut sized balls. Place the cookies 3 inches apart onto the cookie sheet.\nBake for 8 to 10 minutes in the preheated oven, until golden brown on top. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "zcurQNLZ4OjVcBz3XdX6f3Vvp69jCLi"
    },
    {
        "title": "Citrus Chicken",
        "ingredients": [
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (6 ounce) can frozen orange juice concentrate, thawed ADVERTISEMENT",
            "1/2 cup vegetable stock ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat chicken with flour, salt and pepper. Heat oil in a large skillet over medium high heat, and sautee garlic until tender. Add chicken and sautee until browned.\nPour orange juice concentrate over chicken and cover; cook for 3 to 5 minutes, then stir in vegetable stock, cover and simmer for 15 minutes, basting with skillet juices.\nAdd oregano, thyme, pepper and onion; mix well and simmer for another 5 minutes. Stir in mushrooms, cover and cook for another 5 minutes. Add olives, cook for 1 more minute and serve.\n",
        "picture_link": "GpK6IJiRLnr6AqH.Z86oXOMebYOegry"
    },
    {
        "title": "Submarine Flavors",
        "ingredients": [
            "1 cup extra virgin olive oil ADVERTISEMENT",
            "2 teaspoons Italian seasoning ADVERTISEMENT",
            "2 cloves garlic, halved ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine all ingredients in a jar, and let sit for at least an hour to steep the flavors in the oil. Sprinkle generously on the lettuce in your sub or directly on the insides of the bun.\n",
        "picture_link": "PMTnm5nzpxAsHNZnwXwSIelK/9tbEIW"
    },
    {
        "title": "Chicken MacRanch Salad",
        "ingredients": [
            "1 pound macaroni, cooked ADVERTISEMENT",
            "1 cup chopped cooked chicken breast ADVERTISEMENT",
            "4 cups frozen mixed vegetables, thawed ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup Ranch-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl toss together the macaroni, chicken, vegetables, cheese and dressing. Chill for 20 minutes and serve.\n",
        "picture_link": "LOa819fNlVZBKQYi0eGXczcleS9NTGq"
    },
    {
        "title": "Spicy Pecan Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "3 cups pecan pieces ADVERTISEMENT",
            "3 tablespoons finely chopped canned chipotle chile in adobo sauce ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup chopped pecans for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large saucepan over medium heat. Cook and stir the onion and garlic in the butter until soft but not brown. about 5 minutes.\nPour the chicken stock into the pot and whisk in the tomato paste, heavy cream, and lemon juice. Turn the heat to high and bring the soup to a boil. Turn the heat down to medium-low, add the 3 cups of pecan pieces and the chopped chipotle peppers, and simmer the soup until the pecans soften, about 30 minutes.\nSet aside 2 cups of soup. Pour the rest of the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the contents moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.\nStir the reserved 2 cups of soup back into the pot and bring to a simmer and season with salt to taste. Serve, hot, with a sprinkle of chopped pecans for garnish.\n",
        "picture_link": "jpfnRyIKwmKcViweZt3QSh6BLpykswa"
    },
    {
        "title": "Mexican Potato Pancakes",
        "ingredients": [
            "2 cups diced tomatoes ADVERTISEMENT",
            "1/2 small onion, chopped ADVERTISEMENT",
            "1 small jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "5 potato, peeled and grated ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 dash hot pepper sauce, or to taste ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tomatoes, onion, jalapeno, and water into the bowl of a blender; blend until smooth. Heat 1/4 cup canola oil in a saucepan over medium heat. Carefully stir in tomato puree, and cook for 15 minutes until thickened.\nWhile the sauce is cooking, season the shredded potato to taste with salt, pepper, and hot pepper sauce. Mix in onion, eggs, and jalapeno; sprinkle with flour and mix until thoroughly combined. Heat canola oil in a large skillet over medium-high heat.\nDrop potato mixture into hot oil by the heaping tablespoon. Flatten slightly, and cook until golden brown on both sides, about 2 minutes per side. Drain on paper towels, and continue with remaining potato mixture. Serve the potato pancakes with sauce spooned overtop.\n",
        "picture_link": "SEsLjMqU8iWwIJyk6qZyR1ftxUWHuZ2"
    },
    {
        "title": "Tahini Spinach",
        "ingredients": [
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon tahini ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "cayenne pepper, or to taste ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the spinach and water into a saucepan, and bring to a boil over high heat. Reduce heat to medium-low, cover, and simmer 4 to 6 minutes until tender.\nMeanwhile, whisk together the tahini, garlic, cumin, paprika, cayenne pepper, and red wine vinegar. Season to taste with salt and pepper. Drain the cooked spinach, and top with the tahini sauce to serve.\n",
        "picture_link": "xCp6w14kCVzy7V2WfudFIvGnFoqhOwG"
    },
    {
        "title": "Honey Carrots With a Hint of Ginger",
        "ingredients": [
            "1 1/4 cups butter ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "2 pounds baby carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the butter, honey, ginger and lemon juice in a large pot. Bring to a boil over medium-high heat. Add carrots and reduce heat to medium. Cover and simmer for about 10 minutes, or until carrots are tender. Simmer longer if you desire more tender carrots.\n",
        "picture_link": "T6AobndZexbtkFVnq9kp7nDtw05uvAG"
    },
    {
        "title": "Sweet Seduction",
        "ingredients": [
            "1 fluid ounce Malibu rum ADVERTISEMENT",
            "1 fluid ounce banana liqueur ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "1 tablespoon grenadine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure the rum, banana liqueur and pineapple juice into a cocktail shaker. Add a generous scoop of ice. Cover and shake until the outside is frosty, about 30 seconds. Strain into a glass filled with ice and gently pour the grenadine on top. It should float.\n",
        "picture_link": "hlNvSWX6Wr7Cmc4nQ8N5GCHaZ0Im04m"
    },
    {
        "title": "Black Friday Turkey Salad",
        "ingredients": [
            "1/2 cup mayonnaise (such as Hellman's®) ADVERTISEMENT",
            "3 tablespoons prepared yellow mustard (such as Plochman's®) ADVERTISEMENT",
            "2 tablespoons crumbled cooked bacon ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons dill pickle relish ADVERTISEMENT",
            "1/2 cup finely chopped pepperoncini ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper ADVERTISEMENT",
            "salt, to taste ADVERTISEMENT",
            "2 cups coarsely chopped leftover turkey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together mayonnaise, mustard, bacon, Cheddar cheese, relish, pepperoncini, red pepper, and salt in a large bowl; add the turkey and stir to coat.\n",
        "picture_link": "sEAtUbsP0UpOllVImlgWPVgSPEhmnca"
    },
    {
        "title": "Amy's Cheesy Green Bean Casserole",
        "ingredients": [
            "2 (15.5 ounce) cans French cut green beans, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon fresh minced garlic ADVERTISEMENT",
            "1 tablespoon garlic and herb seasoning blend ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (6 ounce) can French fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8 inch baking dish.\nMix the green beans with the mushroom soup, Cheddar cheese, garlic, and garlic and herb seasoning blend. Season to taste with salt and pepper. Spoon the bean mixture into the prepared baking dish.\nBake in preheated oven until bubbly, about 30 minutes. Remove from oven, and sprinkle the top with French fried onions. Return to oven, and bake until onions are golden brown, about 5 minutes more.\n",
        "picture_link": "2snEdZsNx49WFUqavAR8WmuSaARu8RW"
    },
    {
        "title": "Texatini",
        "ingredients": [
            "coarse salt (optional) ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger tequila ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger orange liqueur (Cointreau, Triple Sec or Grand Marnier) ADVERTISEMENT",
            "1/2 cup sweet and sour mix ADVERTISEMENT",
            "1 fluid ounce orange juice ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "1 jalapeno-stuffed green olive ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slightly moisten rim of a large martini glass, and dip in course salt to rim the glass.\nCombine tequila, orange liqueur, sweet and sour mix, orange juice, and ice in a shaker. Shake vigorously, and strain into martini glass. Garnish with jalapeno-stuffed green olives.\n",
        "picture_link": "LSwv9HTEXr0FpaT0V.Kwf..OQm28oKO"
    },
    {
        "title": "Orange-Scented Grilled Lobster Tails",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon chili powder ADVERTISEMENT",
            "1/8 teaspoon aromatic bitters ADVERTISEMENT",
            "4 (6 ounce) lobster tails ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat, and lightly oil grate.\nMelt the butter in a saucepan over medium heat, and stir in the lemon juice, orange zest, ginger, chili powder, and bitters. Simmer gently for 2 minutes, then set aside. Cut away the membrane on the underside of the lobster tails, and insert a metal skewer into each one. This will prevent them from curling up as they cook.\nCook the lobster tails shell-side up on the preheated grill for 10 minutes, then turn the tails over, and spoon the butter sauce over the meat. Continue cooking until the meat is no longer translucent in the middle, about 10 minutes more.\n",
        "picture_link": "EDtHw.dcwOoKGKAiwFcubvIDyUC0nOi"
    },
    {
        "title": "Mediterranean Made Rights (Loose Meat Sandwiches)",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound ground lamb ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1 teaspoon minced lemon zest ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (6 ounce) container plain yogurt ADVERTISEMENT",
            "3 ounces crumbled feta cheese ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon lemon zest ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 pita bread rounds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Stir in the lamb, and cook until it begins to crumble. Add the onions, and continue cooking until the lamb has browned and the onions have softened, about 5 minutes more. Drain off any excess fat, then reduce the heat to medium-low, and stir in 1 teaspoon lemon zest, 1/2 teaspoon dried oregano, 1/2 teaspoon garlic powder, 1/2 teaspoon salt, and 1/2 teaspoon black pepper. Stir 1/4 cup lemon juice into the water, then pour 1/4 cup of this mixture into the lamb. Cook until the liquid has mostly evaporated, then stir in another 1/4 cup, and cook again until mostly evaporated. Continue adding the liquid 1/4 cup at a time until you have used all of it. This should take about 30 minutes in all. The meat should look moist, but not be sitting in liquid.\nWhile the meat is cooking, make the feta sauce by placing the yogurt, feta cheese, 1 tablespoon lemon juice, 1/4 teaspoon dried oregano, 1/4 teaspoon garlic powder, and 1/4 teaspoon lemon zest into a blender. Puree until smooth, then season to taste with salt and pepper. Set aside.\nSpoon the lamb mixture onto warmed pita bread. Top with the feta sauce to serve.\n",
        "picture_link": "d6fNmW2.AFyCF/F/cKR5lPKa6wxesJy"
    },
    {
        "title": "Pfefferkuchen",
        "ingredients": [
            "1 1/2 cups molasses ADVERTISEMENT",
            "1 1/2 cups honey ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon ground anise seed ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "3/4 teaspoon ground cloves ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons grated lemon zest ADVERTISEMENT",
            "1/2 cup butter, cut into pieces ADVERTISEMENT",
            "2 tablespoons baking soda ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring molasses, honey, and sugar to a simmer in a large saucepan over medium heat, then remove from heat and allow to cool for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nStir in anise, cardamom, ginger, nutmeg, clove, cinnamon, lemon zest, and butter. Dissolve baking soda in water, then stir into the molasses mixture. Sift together 6 cups of flour with the baking powder and cocoa powder into a large bowl. Stir in molasses mixture and eggs until smooth. Stir in remaining 3 cups flour until a stiff dough has formed.\nDivide dough into 4 pieces to make it more manageable. Roll the dough to 1/4-inch thick on a well floured surface and cut into shapes with a cookie cutter.\nBake cookies on ungreased baking sheets 8 to 10 minutes until lightly browned around the edges. Cool completely on a wire rack.\n",
        "picture_link": "FCofN6R9h8N5y0HycprGR5ZjwUiQNTS"
    },
    {
        "title": "Georgia's Tennessee Jam Cake",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 cups seedless blackberry jam ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons ground cloves ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 cup chopped black walnuts (optional) ADVERTISEMENT",
            "1/2 cup golden raisins (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease three 8 or 9 inch round cake pans and set aside.\nIn a large bowl, beat butter and sugar until light and fluffy. Add eggs one at a time, mixing until each one is blended in. Dissolve the baking soda in the water; stir into the batter along with the blackberry jam. Combine the flour, cloves, nutmeg, cinnamon and salt; stir into the batter by hand, alternating with the buttermilk. Fold in the black walnuts and raisins if using. Divide the batter equally between the three pans, and spread in an even layer.\nBake in the preheated oven until the top of the cakes spring back when lightly touched, about 35 minutes. Cool in the pans until cool enough to handle, then invert the cakes over a wire rack and remove pans to cool completely.\n",
        "picture_link": "le0XCAzgT50vyNMwPED6aYIBR/My8a."
    },
    {
        "title": "Poached Eggs and Asparagus",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 cube chicken bouillon (optional) ADVERTISEMENT",
            "1 pound fresh asparagus, trimmed ADVERTISEMENT",
            "4 slices whole wheat bread ADVERTISEMENT",
            "4 slices Cheddar cheese ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a saucepan half way full of water. Bring to a boil and stir in the bouillon cube until dissolved. Crack one egg into a measuring cup or large spoon and gently slip it into the boiling water. Repeat with remaining eggs. Simmer for about 5 minutes over medium heat. Remove with a slotted spoon and keep warm\nMeanwhile, Place the asparagus into a saucepan and fill with enough water to cover. Bring to a boil, and cook until asparagus is tender, about 4 minutes. Drain.\nToast the bread to your desired darkness. Spread butter onto each piece of toast. Top with a slice of cheese, then a poached egg and finally, asparagus. Season with salt and pepper and serve immediately.\n",
        "picture_link": "S5uRhNsZxB6G7X3GpsfQyu9vp6NGtyq"
    },
    {
        "title": "Bistecca alla Fiorentina (Tuscan Porterhouse)",
        "ingredients": [
            "4 sprigs fresh rosemary, chopped ADVERTISEMENT",
            "1 (2 1/2 pound) choice or prime porterhouse steak ADVERTISEMENT",
            "3 tablespoons Tuscan olive oil ADVERTISEMENT",
            "Moist, grey sea salt and freshly cracked pepper to taste ADVERTISEMENT",
            "6 lemon wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Press chopped rosemary onto both sides of porterhouse steak; set onto a plate and allow to marinate at room temperature for 1 hour.\nStart an outdoor grill using hardwood charcoal, such as hickory. When coals are white and glowing, arrange for high heat.\nGently brush or rub olive oil onto steak, then season to taste with sea salt and pepper.\nPlace steak onto grill, and cook until a dark, golden brown (not burnt) crust forms, 5 to 10 minutes depending on thickness of meat. Turn over, and continue cooking until golden on the other side, 5 to 10 minutes more. When finished, place steak onto a platter, and allow to rest for 10 minutes.\nTo serve, remove the two pieces of meat from the bone, and replace the bone onto the serving platter. Trim any unwanted fat from the round (tenderloin) steak, slice into 6 equal pieces at an angle to the grain, and fan out on one side of the bone. Slice the rectangular (loin) steak into 1/4-inch slices at an angle to the grain. Fan out on the other side of the bone. Finish by garnishing the platter with lemon wedges and a sprinkle of additional sea salt.\n",
        "picture_link": "GXOnIrwvZUoO6Q5MtEVy8VqQ34XBQpG"
    },
    {
        "title": "Courtney's Three Tomato Pasta Sauce",
        "ingredients": [
            "1/2 pound bulk mild Italian sausage ADVERTISEMENT",
            "1/2 pound bulk hot Italian sausage ADVERTISEMENT",
            "1/4 cup olive oil from jar of sun-dried tomatoes ADVERTISEMENT",
            "1/2 large onion, coarsely chopped ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "1 (28 ounce) can Italian-style diced tomatoes ADVERTISEMENT",
            "1 1/2 cups oil-packed sun-dried tomatoes, drained and sliced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Italian seasoning to taste ADVERTISEMENT",
            "1 cup cream ADVERTISEMENT",
            "1 pound cherry tomatoes, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook mild and hot Italian sausage in a large skillet over medium heat until crumbly and no longer pink. Drain excess grease and set aside. Heat olive oil in the same pan over medium heat; stir in onion and garlic, and cook until the onion has softened and turned translucent.\nStir in diced and sun-dried tomatoes, and the crumbled sausage; season with salt, pepper, and Italian seasoning to taste. Bring to a boil, then reduce heat to medium-low and simmer for 10 minutes until sun-dried tomatoes have softened.\nBefore serving, stir in cream and garnish with cherry tomatoes.\n",
        "picture_link": "cC9VmfyQRwWzB3DC99cUyc78UyLdzgO"
    },
    {
        "title": "Tom Collins",
        "ingredients": [
            "2 fluid ounces gin ADVERTISEMENT",
            "2 fluid ounces lemon juice ADVERTISEMENT",
            "1 fluid ounce simple syrup ADVERTISEMENT",
            "1 dash bitters ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "1/4 cup cold club soda ADVERTISEMENT",
            "1 slice lemon, for garnish ADVERTISEMENT",
            "1 maraschino cherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice. Pour in the gin, lemon juice, simple syrup and a dash of bitters. Cover and shake until the outside of the container is frosty, about 15 seconds. Strain into a highball glass full of ice. Top off with club soda and garnish with a lemon slice and maraschino cherry.\n",
        "picture_link": "rRIv3skbZkcBmRYlG/hw1tnfjNxptia"
    },
    {
        "title": "Chicken Matzo Ball Soup",
        "ingredients": [
            "2 eggs, lightly beaten ADVERTISEMENT",
            "2 tablespoons melted butter or margarine ADVERTISEMENT",
            "1/2 cup matzo meal ADVERTISEMENT",
            "1 teaspoon chopped fresh flat-leaf parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 dash white pepper ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "1 medium carrot, cut into 2 inch julienne strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix eggs with the melted butter or margarine. Stir in matzo meal, parsley, salt, pepper, and water to form a soft dough. Cover and refrigerate for at least 30 minutes.\nBring chicken broth and carrots to a boil in a large pot. Reduce heat to a simmer. Shape the matzo dough into 12 balls. (For easier shaping, dip hands in cold water from time to time). Drop the matzo balls into the simmering broth. Cover and cook for 30 to 40 minutes.\n",
        "picture_link": "3320lxYdurBmcMXeDTUxEWZtZH.i5Vi"
    },
    {
        "title": "Rich, Easy, Old-Fashioned Chocolate Pudding",
        "ingredients": [
            "2 cups cold fat-free half-and-half ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 (11.5 ounce) package Ghirardelli 60% cocoa bittersweet chocolate chips ADVERTISEMENT",
            "3 fluid ounces Amaretto liqueur (or rum) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, stir together 1 cup half and half and the cornstarch until smooth. Add remaining half and half. Over low heat, bring mixture to a simmer, stirring constantly to prevent sticking. Remove from heat.\nPut chocolate and Amaretto in a small bowl; microwave on high 20 seconds. Stir until chips are mostly melted.\nReturn milk to low heat. Add chocolate; stir continuously, scraping pan, until thick.\nCool. Serve chilled or at room temperature.\n",
        "picture_link": "eMxY2CHux0HBI0AyTAe.MUyWZ9Mej76"
    },
    {
        "title": "Frozen Mocha",
        "ingredients": [
            "2 (1 ounce) envelopes hot cocoa mix ADVERTISEMENT",
            "1/2 cup cold milk ADVERTISEMENT",
            "1 1/2 cups vanilla ice cream ADVERTISEMENT",
            "1 1/4 teaspoons instant coffee granules ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "2 tablespoons whipped cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the hot cocoa mix, milk, ice cream, coffee, and ice in a blender; blend until smooth. Pour into a tall glass and garnish with whipped cream if desired.\n",
        "picture_link": "v7Jl05MrRLvcDZ7e8vMHqTvJDu3Is5W"
    },
    {
        "title": "Fantasio Bars",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup almonds, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nMelt the butter in a saucepan; remove from heat and stir in the sugar and graham cracker crumbs. Spread the mixture into the bottom of a 9x13-inch baking dish. Bake in the preheated oven until slightly firm, about 10 minutes.\nStir the coconut and condensed milk together in a bowl; spread over the baked crust and return to oven for 12 minutes more. Set aside to cool at least 10 minutes.\nMelt the chocolate in the top of a double boiler over just-barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Stir the almonds into the melted chocolate; spread evenly over the cooled coconut layer. Allow to cool until the chocolate sets.\n",
        "picture_link": "0V4DO7iuYCrNfcaz0dIFgF64c1LBxX2"
    },
    {
        "title": "Hermano Roberto's Simple Salsa",
        "ingredients": [
            "3 jalapeno peppers, or more to taste ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes with juice ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1 tablespoon chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of lightly salted water to a boil; add jalapeno peppers. Reduce heat to medium and boil peppers for 15 minutes; drain. When cool enough to handle, remove stems of peppers.\nPlace jalapeno peppers, tomatoes, garlic salt, cumin, black pepper, white pepper, and cilantro in a blender. Blend to your desired texture, 30 seconds to 1 minute.\n",
        "picture_link": "FKmcIZbA6/Fw3KZ.G6ZFyLyLpRUCD7e"
    },
    {
        "title": "Bibimbap (Korean Rice With Mixed Vegetables)",
        "ingredients": [
            "1 English cucumber, cut into matchsticks ADVERTISEMENT",
            "1/4 cup gochujang (Korean hot pepper paste) ADVERTISEMENT",
            "1 bunch fresh spinach, cut into thin strips ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "2 carrots, cut into matchsticks ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 pound thinly-sliced beef top round steak ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "4 cups cooked white rice ADVERTISEMENT",
            "4 teaspoons toasted sesame oil, divided ADVERTISEMENT",
            "1 teaspoon sesame seeds ADVERTISEMENT",
            "2 teaspoons gochujang (Korean hot pepper paste), divided (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cucumber pieces with 1/4 cup gochujang paste in a bowl; set aside.\nBring about 2 cups of water to a boil in a large nonstick skillet and stir in spinach; cook until spinach is bright green and wilted, 2 to 3 minutes. Drain spinach and squeeze out as much moisture as possible; set spinach aside in a bowl and stir soy sauce into spinach.\nHeat 1 teaspoon olive oil in large nonstick skillet and cook and stir carrots until softened, about 3 minutes; stir in garlic and cook just until fragrant, about 1 more minute. Stir in cucumber pieces with gochujang paste; sprinkle with red pepper flakes, and set the mixture aside in a bowl.\nBrown beef in a clean nonstick skillet over medium heat, about 5 minutes per side, and set aside. In a separate nonstick skillet, heat 1 more teaspoon olive oil over medium-low heat and fry the eggs just on one side until yolks are runny but whites are firm, 2 to 4 minutes each.\nTo assemble the dish, divide cooked rice into 4 large serving bowls; top with spinach mixture, a few pieces of beef, and cucumber mixture. Place 1 egg atop each serving. Drizzle each bowl with 1 teaspoon of sesame oil, a sprinkle of sesame seeds, and a small amount of gochujang paste if desired.\n",
        "picture_link": "dEa9aXzivo4kiFixUuS6M7UpvIV1ofq"
    },
    {
        "title": "Sous Vide New York Strip Steak",
        "ingredients": [
            "2 (12 ounce) New York strip steaks ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup clamshell mushrooms, separated ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 teaspoon balsamic vinegar ADVERTISEMENT",
            "1 tablespoon cold butter ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large Dutch oven about 2/3 full with water. Bring water to 130 degrees F (54 degrees C) over medium heat. Attach a candy/oil thermometer to the side of the Dutch oven in order to monitor and maintain the water temperature.\nGenerously season steaks with salt and black pepper. Heat vegetable oil in a large skillet over high heat. Place steaks in skillet and cook until just browned, 1 minute per side. Transfer steaks to a resealable plastic bag, squeeze out all air, and seal.\nPlace plastic bag containing steaks in the Dutch oven, adjusting the heat as necessary to maintain the temperature at 130 degrees F (54 degrees C). Cook for 2 1/2 hours, moving the bag around occasionally and maintaining the temperature.\nWhile the steaks are cooking, heat 1 tablespoon butter in the skillet over medium-low heat. Add mushrooms; cook, stirring, until mushrooms are soft, 5 minutes. Transfer to a plate and set aside.\nRemove steaks from plastic bag (reserving any accumulated juices) and pat dry. Generously season with salt and pepper. Heat 1 teaspoon vegetable oil in the skillet over high heat. Place steaks in skillet and cook to form a crust, 2 minutes per side. Transfer steaks to a plate.\nStir garlic and reserved mushrooms into skillet, reduce heat to medium, and cook until mushrooms are reheated, 2 minutes. Stir in reserved juices, water, and balsamic vinegar. Remove from heat.\nStir in 1 tablespoon cold butter until completely melted and incorporated. Season with salt and pepper to taste. Spoon sauce over steaks and serve.\n",
        "picture_link": "eIq2BPNh6kDYHcpJM.Lqg2wI/F1FfKC"
    },
    {
        "title": "Spicy Ham and Cheese Squares",
        "ingredients": [
            "olive oil cooking spray (such as PAM®) ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "1/4 pound deli ham ADVERTISEMENT",
            "1/4 pound sliced pepperoni ADVERTISEMENT",
            "1/4 pound sliced salami ADVERTISEMENT",
            "1/4 pound Swiss cheese ADVERTISEMENT",
            "1/4 pound provolone cheese ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpray a 9x13-inch baking dish with cooking spray.\nPress 1 package crescent rolls into prepared baking dish, pushing seams together.\nLayer ham, pepperoni, salami, Swiss cheese, and provolone cheese atop crescent rolls.\nPour beaten eggs over meat and cheese layers, reserving about 1 tablespoon egg.\nLayer the second package of crescent rolls atop meat and cheese filling; brush with reserved egg.\nBake in the preheated oven until cheese is melted and crescent rolls are browned.\nCut into squares and serve.\n",
        "picture_link": "djoZKe2ooX31Kn4uPJG//skJz17UsOq"
    },
    {
        "title": "Spinach Mushroom Lasagna",
        "ingredients": [
            "1 (8 ounce) package lasagna noodles ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 cups cottage cheese ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "2 teaspoons dried Italian seasoning ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "6 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "2 (10 ounce) packages frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a 9x13-inch baking dish.\nBring a large bowl of salted water to a boil. Stir in lasagna noodles and return to a boil. Cook the pasta uncovered, stirring occasionally, until the noodles have cooked through but are still slightly firm, about 8 minutes. Drain.\nMix eggs, cottage cheese, ricotta cheese, and Italian seasoning in a bowl; set aside.\nHeat olive oil in a skillet over medium-high heat. Cook and stir mushrooms, onion, and garlic in the hot oil until vegetables are tender, 5 to 8 minutes.\nStir flour and black pepper into mushroom mixture until thoroughly combined; add milk. Cook and stir until sauce is thick and bubbly.\nRemove skillet from heat and stir spinach and 1/2 cup Parmesan cheese into the mushroom sauce.\nArrange 3 lasagna noodles in a single layer in the prepared baking dish.\nSpread 1/3 of the cottage cheese mixture over the noodles.\nSpread 1/3 of the mushroom sauce over the cottage cheese mixture.\nSprinkle 1/3 of the mozzarella cheese on top. Repeat the layers twice more.\nSprinkle remaining 1/4 cup Parmesan cheese over the lasagna.\nBake in the preheated oven until cheese is melted and sauce is bubbly, about 35 minutes. Allow lasagna to rest for 10 minutes before slicing and serving.\n",
        "picture_link": "sp.YiPqyLP9ZoIJvS6K3Vj3gO3Z/5te"
    },
    {
        "title": "Sweet Corn Muffins",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup cornmeal ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (14.5 ounce) can cream-style corn ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 18 muffin cups.\nMix flour, sugar, cornmeal, baking powder, and salt together in a large mixing bowl. Add cream-style corn, eggs, applesauce, and 1/2 cup milk to the flour mixture and beat with an electric hand mixer for 1 minute. Pour remaining milk into the batter and beat until just blended. Fill muffin tins 3/4 full of batter.\nBake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, 25 to 30 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "O5IFrbTm3Xnu.5tzYKe1g6f7IN7OxGS"
    },
    {
        "title": "Black Lemon Chicken Salad",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 cup lemon juice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 pinch ground cumin ADVERTISEMENT",
            "1 (5 pound) whole chicken ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 3/4 cups chicken broth, divided ADVERTISEMENT",
            "1 head romaine lettuce, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nDrizzle vegetable oil in a large roasting pan.\nWhisk lemon juice, olive oil, black pepper, salt, cayenne pepper, and cumin in large bowl.\nPlace chicken in lemon mixture and turn it several times to coat each side. Place chicken breast side down in the marinade, and set aside for 30 minutes.\nPlace chicken breast side up in the prepared roasting pan. Pour about 1/4 of of marinade into the chicken cavity. Brush remaining marinade on the top and sides of the chicken.\nSprinkle rosemary, thyme, and salt over top of chicken.\nTie chicken legs together with kitchen twine.\nRoast chicken uncovered in the preheated oven for 45 minutes; remove from oven and spoon juices accumulated in the pan over chicken. Pour 1 cup of chicken broth into the pan and continue roasting until chicken skin is browned and meat is no longer pink, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from the oven, spoon juices accumulated in the pan over chicken again, and cover loosely with aluminum foil for 20 minutes.\nRemove chicken to a platter, draining any juices from the cavity into the pan; cover chicken with aluminum foil and set aside.\nSet the roasting pan on the stove top over medium-high heat; add 3/4 cup chicken broth and boil, scraping any browned bits from the bottom of the pan. Simmer, stirring occasionally, until sauce is reduced by about half, about 10 minutes.\nSlice chicken into 8 pieces and serve over shredded lettuce in a large bowl. Pour 2 to 3 tablespoons of pan sauce over the top, tossing to slightly wilt the lettuce leaves. Serve with additional sauce on the side.\n",
        "picture_link": "oYIUqHWt99qjDrtforfhOSCiMsMoNku"
    },
    {
        "title": "Orzo Tomato Artichoke  Salad",
        "ingredients": [
            "2 cups uncooked orzo pasta ADVERTISEMENT",
            "1/2 cup extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1 tablespoon chopped fresh basil, or to taste ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 (6 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook orzo in the boiling water, stirring occasionally, until cooked through but firm to the bite, 8 to 10 minutes; drain.\nWhisk olive oil, balsamic vinegar, and basil together in a small bowl for the dressing.\nCombine cooked orzo, artichoke hearts, tomatoes, olives, and Parmesan cheese in a large bowl. Stir dressing into the orzo mixture until all ingredients are well coated. Can be served warm or chilled.\n",
        "picture_link": "lZ.KkiTz67T8bi7dNLNhRnVcc0/56SG"
    },
    {
        "title": "Elise's Favorite Waldorf Salad",
        "ingredients": [
            "6 cups diced apples ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine apples, celery, and pecans in a bowl.\nWhisk mayonnaise, sugar, lemon juice, and cinnamon together in a separate bowl until well combined.\nWhip heavy cream with an electric mixer until soft peaks form; fold into mayonnaise mixture to form a creamy dressing.\nFold apple mixture into the dressing until coated; chill in refrigerator for about 1 hour.\n",
        "picture_link": "CabR43wVIEvJ3vfhcCLrqThMz/g9sn2"
    },
    {
        "title": "Easter Lemon Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "4 eggs, room temperature ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1 cup milk, room temperature ADVERTISEMENT",
            "2 tablespoons grated lemon zest ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "6 tablespoons lemon juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour 2 loaf pans.\nCombine the flour, baking powder, and salt and set aside.\nBeat the butter and 2 1/2 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the almond extract with the last egg.\nPour in the flour mixture alternately with the milk, mixing until just incorporated. Fold in the lemon zest and chopped walnuts, mixing just enough to evenly combine. Pour the batter into the prepared pans.\nBake in the preheated oven until the loaves are very lightly browned and a toothpick inserted into the middle comes out clean, 60 to 70 minutes.\nMix the lemon juice with the 1/2 cup sugar in a bowl until the sugar has dissolved. Pour the lemon glaze over the hot cakes; allow to stand for 10 minutes before removing cakes from the pans. Cool before serving.\n",
        "picture_link": "n8RRuQNZKUz1dBcrJHYi.zvZW/GuFeW"
    },
    {
        "title": "Shrimp and Grits With Kielbasa",
        "ingredients": [
            "2 cups dry polenta ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 kielbasa sausage, chopped ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "2 tablespoons red pepper flakes ADVERTISEMENT",
            "1 pound uncooked shrimp - peeled, deveined, and tails removed ADVERTISEMENT",
            "8 ounces shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring polenta, water, and salt to a boil in a saucepan; reduce heat to low and simmer until polenta is thickened, 10 to 15 minutes.\nHeat olive oil in a large skillet over medium heat and cook kielbasa sausage until browned, 5 to 8 minutes; stir in garlic, rosemary, and red pepper flakes and cook, stirring often, until garlic is fragrant, about 1 minute. Mix in shrimp and stir gently until shrimp are pink and no longer translucent inside, about 5 minutes.\nTransfer shrimp mixture and any pan juices to a large serving bowl and stir grits into the mixture. Stir Cheddar cheese into the hot mixture until melted.\n",
        "picture_link": "6192yXurMy8XCxrsc2cQf76TteZczz."
    },
    {
        "title": "Healthier Taco Seasoning I",
        "ingredients": [
            "1 clove garlic, peeled ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crush garlic with salt until it forms a paste. Stir in chili powder, red pepper flakes, oregano, paprika, cumin, and pepper in a small bowl. Alternatively, combine all ingredients in a bowl of a mini-food processor until well mixed. Store in an airtight container in the refrigerator.\n",
        "picture_link": "584jyckN4NcGk2WaSagDDCK8qy0rFey"
    },
    {
        "title": "A Memorial Day Carrot Cake Recipe",
        "ingredients": [
            "3 cups almond flour ADVERTISEMENT",
            "2 teaspoons celtic sea salt ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1/2 cup agave nectar ADVERTISEMENT",
            "1/4 cup grapeseed oil ADVERTISEMENT",
            "3 cups grated carrots ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nGenerously grease 2 9-inch round cake pans.\nStir almond flour, sea salt, cinnamon, baking soda, and nutmeg together in a large bowl.\nBeat eggs, agave nectar, and grapeseed oil together in a separate large bowl.\nStir carrots, raisins, and walnuts into the egg mixture.\nStir carrot mixture into flour mixture to form a batter; pour into prepared cake pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 35 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "WWmTrxkXj7P1sh/PsjSQ6xl21hAC61y"
    },
    {
        "title": "Cajun Shrimp with Cheese Grits",
        "ingredients": [
            "2 1/4 cups 2% low-fat milk ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 teaspoons chicken soup base (paste) ADVERTISEMENT",
            "1/2 teaspoon smoked salt ADVERTISEMENT",
            "1 cup regular grits, uncooked ADVERTISEMENT",
            "1/2 pound andouille sausage, cut into 1/4-inch slices ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 cup diced green bell pepper ADVERTISEMENT",
            "3/4 cup diced yellow onion ADVERTISEMENT",
            "3/4 cup diced celery ADVERTISEMENT",
            "1/2 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes, with juice ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "1 pound fresh large shrimp, shelled and deveined ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh chives (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring milk, water, chicken soup base, and smoked salt to a boil in a saucepan; slowly whisk in grits, reduce heat to low, and cover pan. Simmer until grits are tender and thick, about 20 minutes. Keep grits warm.\nBrown andouille sausage slices with vegetable oil in a large skillet over medium heat; remove sausage and set aside.\nCook and stir green bell pepper, yellow onion, celery, and jalapeno pepper in the same skillet until onion is tender and translucent, about 10 minutes. Stir in garlic and Cajun seasoning; cook until fragrant, about 1 minute.\nStir flour into the vegetables until well coated; gradually stir in fire-roasted tomatoes and white wine, cooking until the sauce begins to thicken, about 3 minutes. Reduce heat to low, stir bay leaf into the sauce, and simmer for 5 minutes; season with salt and black pepper.\nMix cooked andouille sausage and shrimp into the sauce and cook, stirring often, until sausage is hot and shrimp are pink and no longer translucent, 5 to 8 minutes.\nJust before serving, stir Cheddar and Parmesan cheeses into grits until melted.\nTo serve, spoon grits onto a serving plate and top with shrimp, sausage slices, and sauce. Garnish with chopped chives.\n",
        "picture_link": "7IsZscfhnvRJljDV6Iu./TTMOFpHvnu"
    },
    {
        "title": "Ham and Cheese Pasta Casserole",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 (8 ounce) package Cheddar cheese, cubed ADVERTISEMENT",
            "1 cup cubed, cooked ham ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until cooked through but firm to the bite, 8 minutes; drain.\nCombine macaroni, Cheddar cheese, ham, and mayonnaise in a 9x13 baking dish until well mixed.\nSprinkle bread crumbs over the macaroni casserole.\nBake casserole in the preheated oven until bread crumbs are lightly browned, about 25 minutes.\n",
        "picture_link": "qrM21RTIga3ipjSUJC5si6ioiw3VM7m"
    },
    {
        "title": "Brown Rice and Corn Cakes",
        "ingredients": [
            "2 (15.25 ounce) cans whole kernel sweet corn, drained ADVERTISEMENT",
            "2 cups cooked brown rice, cooled ADVERTISEMENT",
            "1/2 cup skim milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "2/3 cup whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine corn, rice, milk, eggs, and chives in a large bowl.\nMix flour, baking powder, nutmeg, salt, and black pepper together in a separate bowl.\nStir flour mixture into corn mixture until well combined.\nHeat olive oil on a griddle or a large skillet over medium heat.\nScoop 1/4-cup portions of corn mixture onto heated griddle. Cook until golden brown, 3 to 4 minutes per side.\n",
        "picture_link": "rzKkI5sMKntD8Xmbp8Gn9V8ZbLRb0ea"
    },
    {
        "title": "Outrageous Lemon Berry Trifle",
        "ingredients": [
            "2 cups heavy whipping cream ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 (3.4 ounce) packages instant lemon pudding mix ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "1 dash vanilla extract ADVERTISEMENT",
            "1 (9 inch) angel food cake, cubed ADVERTISEMENT",
            "3 cups sliced fresh strawberries ADVERTISEMENT",
            "2 cups fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir 2 cups whipping cream, milk, lemon pudding mixes, and lemon juice in a large bowl until creamy and smooth. Cover and refrigerate until set, about 1 hour.\nBeat remaining 2 cups whipping cream in a bowl until foamy. Gradually add confectioners' sugar and vanilla extract, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the whipped cream will form sharp peaks.\nLayer half the angel food cake in a trifle bowl. Top with half the lemon pudding mixture, half the strawberries and half the blueberries. Spread half the whipped cream over the berries. Repeat the layers. Cover and refrigerate until ready to serve.\n",
        "picture_link": "y26mHbGhx7COz/VdpeC5GVoLPICAMgy"
    },
    {
        "title": "Sous Vide Duck Breast",
        "ingredients": [
            "2 (8 ounce) boneless duck breast halves, skin on ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 teaspoons fresh thyme leaves ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut several very shallow crosswise slashes across the skin of each duck breast about 1/2 inch apart. The cuts should only barely cut into the skin and fat; don't cut into the meat. Season skin sides with salt. Generously season meat sides with salt, black pepper, and thyme.\nPlace duck breasts in a heavy-duty resealable plastic bag, squeeze out all air, and seal. Refrigerate for 1 hour.\nFill a large Dutch oven about 2/3 full with water. Bring water to 135 degrees F (57 degrees C) over medium heat. Attach a candy or oil thermometer to the side of the Dutch oven in order to monitor and maintain the water temperature. Place a silicone hot pad into bottom of the pan to keep the plastic bag from contacting the hot bottom of the pan.\nPlace plastic bag containing duck breasts in the Dutch oven, adjusting the heat as necessary to maintain the temperature at 135 degrees F (57 degrees C). Cook for 1 hour, moving the bag around occasionally and maintaining the temperature.\nRemove duck breasts from plastic bag and pat dry. Generously season skin sides with salt.\nHeat vegetable oil in a skillet over high heat. Place duck breasts with skin sides down in skillet and cook until fat renders and skin is golden brown, 5 minutes. Turn breasts over and cook until lightly browned and meat still pink in the center, 1 minute. Let duck breasts rest for 2 minutes before slicing.\n",
        "picture_link": "22cY5IOK7uK4JiE6/G8bty8QbQgzZf2"
    },
    {
        "title": "Banana Peanut Butter Cheesecake aka \"The Elvis\"",
        "ingredients": [
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "3/4 teaspoon banana extract ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 cup peanut butter chips ADVERTISEMENT",
            "1/4 cup half-and-half ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese at room temperature ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 eggs at room temperature ADVERTISEMENT",
            "2 large ripe bananas, mashed ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon banana extract ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch cake pan and line the bottom with a circle of waxed paper.\nMix graham cracker crumbs, melted butter, 3/4 teaspoon banana extract, and 3 tablespoons sugar in a bowl until mixture holds together; transfer into bottom of prepared cake pan. Use a second 8-inch cake pan to press the crust firmly.\nBake in the preheated oven until crust is lightly browned, about 8 minutes. Set aside to cool.\nPour water to a depth of about 1 inch into the bottom of a double boiler and bring to a boil. Place peanut butter chips and half-and-half into the top of the boiler and set over the bottom of the boiler (boiling water shouldn't touch top boiler). Stir until the chips have melted and the mixture is smooth; set aside to cool.\nPlace cream cheese into the mixing bowl of a stand mixer and slowly mix, using paddle attachment, until cream cheese is smooth. Increase speed to medium and beat in 1/2 cup sugar. Beat eggs into mixture, 1 at a time, blending the next egg in after the previous one is fully incorporated. Beat in bananas, vanilla extract, 1/2 teaspoon banana extract, and lemon juice, stopping occasionally to scrape the sides of the bowl. Finally, beat in peanut butter chip mixture until cheesecake batter is smooth and even. Pour filling into the graham cracker crust.\nSet the cheesecake on a large baking pan. Pour enough water into the baking pan to reach most of the way up the sides of the cheesecake pan, creating a water bath. Bake cheesecake in the preheated oven until filling is set, about 1 hour. Turn off oven, open door, and let cheesecake cool slowly in the oven for 1 hour.\nRun a knife around the inside of the cheesecake pan and flip the pan over onto a cooling rack. Place a dish towel on the bottom of the pan. Use a hot water-filled tea kettle to rub the dish towel, gently heating the bottom of the cheesecake; slowly remove pan. Place a serving platter on top and use the wire rack to flip the cake back over onto platter. Refrigerate cheesecake for 8 hours.\n",
        "picture_link": "4WDkSfGJawpadxIJTxnyQb8.3uM7nFG"
    },
    {
        "title": "Best Ever Strawberry Cake",
        "ingredients": [
            "1 cup pureed strawberries ADVERTISEMENT",
            "1/4 cup 2% milk ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups sifted cake flour ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nGrease and flour two 8-inch cake pans.\nMix pureed strawberries, milk, eggs, and 1 tablespoon vanilla extract together in a small bowl; transfer to the bowl of a stand mixer.\nBeat flour, white sugar, baking powder, and salt into strawberry mixture on Low; add butter and continue beating on Low until evenly combined.\nStop mixer, scrape sides, and beat again for about 30 seconds.\nDivide batter evenly between the two prepared cake pans.\nBake in the preheated oven until a toothpick inserted into the center of each cake comes out clean, about 25 minutes. Cool the cakes in the pans for about 10 minutes; transfer to wire racks to completely cool, about 30 minutes.\nBeat cream cheese and butter together in a medium bowl until smooth. Gradually beat confectioners' sugar into cream cheese mixture until creamy and fluffy; stir in 1 teaspoon vanilla extract.\nSpread about 1/2 the frosting on top of 1 cake. Place second cake on top of frosting layer; spread the remaining frosting on top of second cake and around sides of both cakes.\n",
        "picture_link": "iCICMXPPJNj8LiTQ5daP4Rdaa06AJV."
    },
    {
        "title": "Spicy Beef Vegetable Stew",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 (30 ounce) jar meatless spaghetti sauce ADVERTISEMENT",
            "3 1/2 cups water ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 cup sliced celery ADVERTISEMENT",
            "1 teaspoon beef bouillon granules ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat and stir in ground beef and onions. Cook and stir until beef is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease.\nTransfer beef mixture to a slow cooker. Stir in spaghetti sauce, water, mixed vegetables, diced tomatoes, celery, beef bouillon, and pepper. Cover and cook on Low until vegetables are tender, about 8 hours.\n",
        "picture_link": "kJ/jdZ7n3LHUBqxNn5B60PMrlD/RN4K"
    },
    {
        "title": "Lemon Garlic Hummus",
        "ingredients": [
            "2 cups garbanzo beans (chickpeas), rinsed and drained ADVERTISEMENT",
            "5 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/4 cup olive oil, or more to taste ADVERTISEMENT",
            "1 1/2 tablespoons tahini (sesame seed paste) ADVERTISEMENT",
            "4 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1 pinch coarse salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine garbanzo beans, lemon juice, olive oil, tahini, garlic, and salt in a food processor and pulse several times to mix. Process until hummus is smooth, about 1 minute.\n",
        "picture_link": "QaTFQX8D66Ua7KMParzYz.MmKmMfpS2"
    },
    {
        "title": "Paleo Maryland Crab Cakes ",
        "ingredients": [
            "1 large egg ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1/4 teaspoon lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons seafood seasoning, such as Old Bay™ ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 pound fresh lump crabmeat ADVERTISEMENT",
            "1/4 cup almond flour ADVERTISEMENT",
            "1 tablespoon finely diced red pepper ADVERTISEMENT",
            "2 teaspoons sliced green onion ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/3 cup almond flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a baking sheet.\nWhisk together egg, mayonnaise, Dijon mustard, Worcestershire sauce, hot sauce, lemon juice, seafood seasoning, and black pepper in a bowl.\nPlace crab meat in a separate bowl and pour egg and mayonnaise mixture in; gently combine with hands. Mix in 1/4 cup almond flour, peppers, green onions, and parsley.\nForm mixture into 6 patties. Place 1/3 cup almond flour in a shallow bowl. Dredge each cake in almond flour and set on prepared sheet pan; refrigerate for at least 1 hour.\nPreheat oven to 400 degrees F (200 degrees C).\nBake crab cakes in the oven until golden brown, 15 to 20 minutes.\n",
        "picture_link": "URkbZvC83fZ29f5Z0hY0z0Byb2qVLO."
    },
    {
        "title": "Spicy and Creamy Vegetable Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 white onion, chopped ADVERTISEMENT",
            "1/2 cup diced carrot ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "4 large cloves garlic, finely chopped ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "3 tablespoons chicken soup base ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 cup peeled and cubed potatoes ADVERTISEMENT",
            "1/2 cup fresh green beans, trimmed and snapped (optional) ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (8 ounce) package fresh mushrooms, sliced ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/2 bunch kale, stemmed and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon olive oil in a large pot over medium heat; cook and stir onion, carrot, and celery until onion is translucent, about 5 minutes. Add garlic, bay leaves, parsley, thyme, rosemary, and dill weed; cook until garlic is fragrant, 1 to 2 minutes.\nPour water into onion mixture and bring to a boil. Stir chicken base into the boiling water until dissolved, 1 to 2 minutes. Add tomatoes with green chiles, potatoes, and green beans; bring soup to a boil. Reduce heat and simmer until potatoes are tender, 10 to 15 minutes.\nMeanwhile, heat 1 tablespoon olive oil in a large skillet over medium heat; cook and stir mushrooms until golden brown, 10 to 15 minutes. Add browned mushrooms to the soup. Stir heavy cream and kale into soup; cook until kale is tender and soup is heated through, about 5 minutes.\n",
        "picture_link": "O3phrWDMzQFZfxkpDUscrNVII08cH1G"
    }
]