[
    {
        "title": "Jewel's Chicken Giardino",
        "ingredients": [
            "Chicken: ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast halves, cut into 1/2-inch strips ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "2 small sprigs fresh rosemary, chopped ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 teaspoons garlic pepper seasoning ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 teaspoon sea salt and ground black pepper to taste ADVERTISEMENT",
            "Vegetables: ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1 bunch fresh asparagus, cut into 1-inch pieces ADVERTISEMENT",
            "2 Roma (plum) tomatoes, diced ADVERTISEMENT",
            "1 cup broccoli florets ADVERTISEMENT",
            "1 cup spinach, cut into 1/2-inch pieces ADVERTISEMENT",
            "1 zucchini, cut into rounds ADVERTISEMENT",
            "1 pound yellow squash, cut into rounds ADVERTISEMENT",
            "1/2 red bell pepper, cut into strips ADVERTISEMENT",
            "1/2 cup frozen peas ADVERTISEMENT",
            "1/2 cup matchstick-cut carrots ADVERTISEMENT",
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken, 1/4 cup olive oil, 1/2 juiced lemon, chopped fresh rosemary, and garlic in a bowl; marinate chicken in refrigerator, at least 30 minutes.\nMelt butter in a saucepan over medium heat. Stir garlic pepper, thyme, and dried rosemary into melted butter and cook for 1 minute.\nWhisk chicken broth, water, wine, milk, and 4 teaspoons lemon juice together in a bowl. Add cornstarch and whisk until lumps have dissolved; pour into butter mixture. Whisk sauce and bring to a boil; season with salt and pepper and remove saucepan from heat.\nHeat a large skillet over medium-high heat; add 1/4 cup olive oil. Remove chicken from marinade, discarding the marinade. Cook and stir chicken in the hot olive oil until no longer pink in the center, about 8 minutes. Add asparagus, tomatoes, broccoli, spinach, zucchini, yellow squash, red bell pepper, peas, and carrots to chicken; cook and stir until vegetables are tender, about 10 minutes.\nBring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain.\nMix pasta and sauce in with chicken and vegetables; stir until evenly combined.\n",
        "picture_link": "enkre0XoZ.xn2nK5NQNkjFERqOjJnbi"
    },
    {
        "title": "Spicy Lentil Vegetable Soup",
        "ingredients": [
            "1 red bell pepper ADVERTISEMENT",
            "1/2 green bell pepper ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup brown lentils ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 broccoli floret, chopped ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon dried thyme leaves ADVERTISEMENT",
            "1 teaspoon dried rubbed sage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil.\nCut the peppers in half from top to bottom; remove the stem, seeds, and ribs, then place the peppers cut-side-down onto the prepared baking sheet.\nBake in the preheated oven until limp, 30 to 40 minutes. Turn the peppers over halfway through cooking. Once ready, place the peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard. Chop the peppers\nMeanwhile, bring the water and lentils to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the lentils are tender, about 30 minutes. Drain, rinse, and set aside.\nHeat the olive oil in a large saucepan over medium heat. Stir in the carrot, onion, and broccoli; cook and stir until the onion has softened, about 5 minutes. Pour in some of the vegetable broth, cover, and steam the vegetables until tender. Pour in the remaining vegetable broth and chopped peppers; season with the red pepper flakes, ginger, black pepper, thyme, and sage. Simmer until the flavors come together and the vegetables are very tender, about 20 to 30 minutes. Add water if needed to maintain your desired consistency. Stir in the cooked lentils until hot.\nIf desired, pour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.\n",
        "picture_link": "zPSuoABJX6zoU8u5tNCHhJraiHqp09q"
    },
    {
        "title": "Berry Breakfast Cobbler",
        "ingredients": [
            "2 1/2 cups mixed frozen berries ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/2 cinnamon stick, ground ADVERTISEMENT",
            "2 tablespoons flax seeds, ground ADVERTISEMENT",
            "1/4 cup unsweetened flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the berries and brown sugar together in a microwave-safe bowl; heat on High until the berries are hot, about 2 minutes, stirring once about 1 minute into the heating process. Stir the ground cinnamon, ground flax seeds, and coconut into the heated berries and serve.\n",
        "picture_link": "prpizaw3dBwVZkh7Aywtgm8vtIukroS"
    },
    {
        "title": "Finadene",
        "ingredients": [
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "3 fresh hot chile peppers, seeded and chopped ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the soy sauce, onion, chile peppers, and vinegar in a small bowl.\n",
        "picture_link": "5XfZHj6A0F.sp8IoFqhHtNMHUc8KTkS"
    },
    {
        "title": "Apple Bread II",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "2 eggs, room temperature ADVERTISEMENT",
            "2 cups applesauce ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup chopped dried apples ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\nSift the flour, baking soda, and salt together in a bowl. Beat the butter and brown sugar together with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the first egg, allowing it to blend into the butter mixture before adding the other. Blend the applesauce and 3/4 teaspoon cinnamon into the mixture. Pour the flour mixture into the butter mixture, mixing until just incorporated. Fold in the dried apple pieces; mixing just enough to evenly combine. Pour the batter into prepared pan. Stir 1 teaspoon cinnamon and the white sugar together in a small bowl; sprinkle over the batter.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pan 10 to 15 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "JnIR9I2MgRIIlCuNnuswTM8y8VecZqu"
    },
    {
        "title": "Corned Beef and Cabbage Casserole",
        "ingredients": [
            "1 small head cabbage, cored and cut into large chunks ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 (12 ounce) cans corned beef ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring cabbage pieces to a boil in a pot and simmer until just tender, about 5 minutes. Drain, then transfer cabbage to a 2-quart baking dish.\nMelt 1/4 cup butter in a skillet over medium heat. Stir in corned beef and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Break up any large chunks of corned beef.\nSpread corned beef mixture over cabbage.\nMelt remaining 1/3 cup butter in the same skillet over medium heat; whisk in flour.\nPour in milk and season with salt and pepper. Continue whisking until sauce comes to a simmer and is thickened, about 5 minutes.\nPour sauce over corned beef and cabbage mixture.\nBake in the preheated oven until bubbly, about 30 minutes.\n",
        "picture_link": "ts9PujXitiq1yTiNDS9FvybV3n1uAwG"
    },
    {
        "title": "Pink Grapefruit Blueberry Sorbet",
        "ingredients": [
            "3 cups fresh pink grapefruit juice ADVERTISEMENT",
            "3 cups fresh or frozen blueberries ADVERTISEMENT",
            "1 1/2 cups white sugar, or to taste ADVERTISEMENT",
            "1/2 cup vodka (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the grapefruit juice, blueberries, sugar, and vodka into a blender, and blend until the sugar is dissolved and the mixture is smooth, 2 to 3 minutes.\nPour the mixture into a container, and freeze until solid, 3 to 4 hours. Thoroughly stir the sorbet to break up the ice crystals to a slushy consistency, and return to freezer until firm, about 3 hours. Store in the freezer in a covered container.\n",
        "picture_link": "bQwjevKvP6oHOLX./NSKfxs41dy8yzO"
    },
    {
        "title": "Summer Italian Marinade",
        "ingredients": [
            "1 3/4 cups white cooking wine ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 teaspoon whole black peppercorns ADVERTISEMENT",
            "1 tablespoon crushed black peppercorns ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the wine, lemon juice, olive oil, onion, garlic, whole peppercorns, crushed peppercorns, oregano, basil, thyme and salt together in a large bowl. Use mixture to marinate meat 2 to 24 hours before cooking.\n",
        "picture_link": "/Dt8S9i4tdcy6Pt0/9LvnS432wF6KeO"
    },
    {
        "title": "Easy Smeezy Cheese Ball",
        "ingredients": [
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1/4 cup bacon bits ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon grated onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix Cheddar cheese, pecans, bacon bits, mayonnaise, and grated onion in a bowl. Shape into a ball and wrap in plastic wrap. Refrigerate over night.\n",
        "picture_link": "43lNZrHgafxUIDg8VtFAA1zulilEYjO"
    },
    {
        "title": "Creamy Pomegranate Ice Cream",
        "ingredients": [
            "1 cup heavy cream ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup pomegranate juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the heavy cream and sugar. Stir in the pomegranate juice, vanilla extract, and salt. Add the mixture to an ice cream maker and freeze according to the manufacturer's directions.\n",
        "picture_link": "En.Xw1iL.XWETe57uhlqg2LCzf.fZ0G"
    },
    {
        "title": "Melon Ice Candy",
        "ingredients": [
            "4 pounds cantaloupe, shredded ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cantaloupe, evaporated milk, water, and sugar in a large pitcher, stirring until combined. Refrigerate for 10 minutes. Divide shredded cantaloupe and liquid into molds and freeze until firm, about 6 hours.\n",
        "picture_link": "p87PM.ROGenhoBq7UCdEJk4P6ioZrWa"
    },
    {
        "title": "Chickpea Coconut Salad",
        "ingredients": [
            "1 (15 ounce) can garbanzo beans (chickpeas), rinsed and drained ADVERTISEMENT",
            "1/3 cup freshly grated coconut ADVERTISEMENT",
            "1 teaspoon chopped green chile peppers (optional) ADVERTISEMENT",
            "1/3 cup chopped fresh cilantro ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine garbanzo beans, coconut, green chile peppers, and cilantro in a large bowl. Stir in lemon juice, and season with salt. Refrigerate for 2 hours before serving for best flavor.\n",
        "picture_link": "J4aS0GIh8VMDc29xgonrueqgRM9O10G"
    },
    {
        "title": "Jamaican Curry Powder",
        "ingredients": [
            "1/4 cup whole coriander seeds ADVERTISEMENT",
            "2 tablespoons whole cumin seeds ADVERTISEMENT",
            "2 tablespoons whole mustard seeds ADVERTISEMENT",
            "2 tablespoons whole anise seeds ADVERTISEMENT",
            "1 tablespoon whole fenugreek seeds ADVERTISEMENT",
            "1 tablespoon whole allspice berries ADVERTISEMENT",
            "5 tablespoons ground turmeric ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the coriander seeds, cumin seeds, mustard seeds, anise seeds, fenugreek seeds, and allspice berries in a skillet. Toast over medium heat until the color of the spices slightly darkens, and the spices are very fragrant, about 10 minutes. Remove the spices from the skillet, and allow to cool to room temperature. Grind the spices with the turmeric in a spice grinder. Store in an airtight container at room temperature.\n",
        "picture_link": "sVCgU3ujZiGGa0HDRjHQmHlYSgoyQPm"
    },
    {
        "title": "Spicy and Cheesy Egg and Tomato Frittata",
        "ingredients": [
            "10 egg whites ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup shredded reduced-fat Cheddar cheese, divided ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chilies, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Prepare an oven-safe skillet with cooking spray and place over medium heat.\nWhisk the egg whites, eggs, and 1/2 cup of the Cheddar cheese together in a bowl. Cook the egg mixture in the hot skillet until the bottom of the eggs turn opaque, about 1 minute. Cover the skillet with a lid and cook until the eggs are nearly set, 4 to 5 minutes more. Spread the diced tomatoes with chiles and the remaining cheese over the eggs.\nMove the skillet to the oven and cook under the broiler until the eggs finish setting and the cheese is completely melted, 2 to 3 minutes. Allow the frittata to rest 5 minutes before slicing to serve.\n",
        "picture_link": "gvQ7Z4W8OopkSc3Th2xUu5Hlb/QCKni"
    },
    {
        "title": "Mojito Sorbet ",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup mint leaves, packed ADVERTISEMENT",
            "1/4 cup grated lime zest ADVERTISEMENT",
            "1 cup freshly squeezed lime juice ADVERTISEMENT",
            "1 1/2 cups citrus-flavored sparkling water ADVERTISEMENT",
            "2 tablespoons rum (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the water, sugar, and mint leaves in a saucepan over medium heat, and stir until the sugar is dissolved. Bring the mixture to a boil, reduce heat, and simmer for 3 to 5 minutes to extract the mint flavor. Set the mixture aside to cool, and strain out the mint leaves.\nPour the cooled mint mixture, lime zest, lime juice, sparkling water, and rum into a bowl and mix well. Pour into the container of an ice cream maker, and freeze according to the manufacturer's instructions. Serve immediately for a softer texture, or freeze in a sealed container for a harder sorbet. Let hard-frozen sorbet thaw a few minutes before serving.\n",
        "picture_link": "6c6hXu5Is4.zozL9AzZ0D5Mw5ySBkzS"
    },
    {
        "title": "Cajun Chow Mein",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 small green bell pepper, finely chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can dark red kidney beans, undrained ADVERTISEMENT",
            "1 cup converted long-grain white rice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nHeat a large saucepan over medium-high heat and stir in the ground beef. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the garlic, onion, and green bell pepper; cook and stir until the onion has softened and turned translucent, about 7 minutes. Pour in the tomatoes, and simmer until the liquid has been absorbed, about 5 minutes.\nOnce the liquid from the tomatoes has been absorbed, stir in the kidney beans, rice, and water. Season with the chili powder and salt and pepper to taste. Pour into a 9x13-inch baking dish and cover tightly with aluminum foil.\nBake in the preheated oven until the rice has absorbed the liquid and is tender, 45 minutes to 1 hour.\n",
        "picture_link": "oGA6lPTh5CXvFUgz5ad2JKi3/LUv4sq"
    },
    {
        "title": "Papaya-Stuffed Chicken and Basmati Rice",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 papaya, peeled, seeded and sliced ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "1/3 cup melted margarine ADVERTISEMENT",
            "1 cup crushed buttery round crackers (such as Ritz®) ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "1 cup basmati rice ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple in its own juice ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nLay a chicken breast flat onto your work surface. Use the tip of a sharp boning or paring knife to cut a pocket in the chicken breast through a 2 inch slit in the side. Repeat with the remaining chicken breasts. Place the slices into the pocket of each chicken breasts, then sprinkle papaya slices with cinnamon to taste. Dip the chicken breast halves one at a time into the melted margarine, then the cracker crumbs.\nHeat 1 tablespoons of margarine in a skillet over medium-high heat. Arrange the chicken breasts in the skillet and cook until golden brown on each side, about 10 minutes. Place browned chicken breasts on the prepared baking sheet.\nBake in the preheated oven for about 20 minutes, then flip each chicken breast. Continue baking until the chicken breasts are no longer pink in the center and the juices run clear, about 20 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nBring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.\nMeanwhile, melt the remaining 1 tablespoon of margarine in the same skillet used to brown the chicken over medium-high heat, scraping up any browned bits. Stir in the orange juice, pineapple, brown sugar, 1/2 teaspoon of cinnamon, nutmeg, cayenne, salt and pepper. Reduce heat to medium and simmer until reduced, about 30 minutes. Reduce the heat once more to low and continue simmering until the sauce is thickened. Serve the chicken breasts over the rice with the pineapple sauce spooned on top.\n",
        "picture_link": "kA0qjvyuSrJxdNIqEB8RsS1X883gAOS"
    },
    {
        "title": "You Won't Believe It's Not Dairy Chocolate Pudding",
        "ingredients": [
            "1 (16 ounce) package silken tofu ADVERTISEMENT",
            "1/3 cup cocoa powder ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 tablespoons powdered non-dairy creamer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tofu, cocoa powder, sugar, vanilla extract, and non-dairy creamer in a blender or food processor. Blend until smooth, adjusting sugar and cocoa powder to your taste. Transfer pudding to a bowl and cover and refrigerate for at least 1 hour before serving.\n",
        "picture_link": "XDxb/.KBDNUA0cF0LDgW4HGXdRuK5sK"
    },
    {
        "title": "Veggies with Cheese Gravy",
        "ingredients": [
            "1/4 cup soy milk ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large zucchini, julienned ADVERTISEMENT",
            "1 large yellow squash, julienned ADVERTISEMENT",
            "1 large orange bell pepper, julienned ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "1 dash pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the soy milk, soy sauce, honey, and Cheddar cheese together in a small bowl; set aside.\nHeat the olive oil in a large saucepan over medium heat; cook the zucchini, squash, and bell pepper in the hot oil, stirring occasionally, for about 3 minutes. Pour the soy milk mixture over the vegetables. Increase heat to high and bring the mixture to a boil. Reduce heat to medium-low; cook and stir until the vegetables are tender, about 5 minutes. Season with salt and pepper to serve.\n",
        "picture_link": "MF0X8v84quaTAMGTdXm7/fHI531CvOW"
    },
    {
        "title": "Meatball and Olive Stew (Albondigas Verdes)",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "2 tablespoons uncooked white rice ADVERTISEMENT",
            "1/2 small onion, minced ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 pound fresh tomatillos, husks removed ADVERTISEMENT",
            "2 jalapenos (optional) ADVERTISEMENT",
            "1 1/2 small white onions, quartered ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 cup chopped cilantro ADVERTISEMENT",
            "8 ounces pitted green olives ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the ground beef, ground pork, white rice, minced onion, and eggs together in a large bowl. Form into 1 inch meatballs; set aside.\nPlace the tomatillos and jalapenos in a saucepan and cover with water. Bring to a boil and simmer until tomatillos have softened and begin to turn a yellow color, about 15 minutes. Drain, then transfer contents of saucepan to a blender along with the quartered onions, garlic, cilantro, green olives, and 1 cup of water. Blend until almost smooth.\nHeat the oil in the saucepan used to cook the tomatillos. When hot, pour in the tomatillo sauce and bring to a boil, stirring. Pour in 3 cups of water and return to a boil. Season to taste with salt.\nStir in the meatballs. Add water, if needed, to cover completely. Simmer, covered, until meatballs are cooked through and the soup is thick, about 30 minutes.\n",
        "picture_link": "rg5ougDymojXue7vDQQ3hJmJCGQoVya"
    },
    {
        "title": "Poor Man's Pudding",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups brown sugar ADVERTISEMENT",
            "1 1/2 cups hot water ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Whisk the flour and baking powder together in a small bowl.\nBeat the white sugar, oil, and egg together in a bowl until smooth. Stir in the flour mixture alternately with the milk. Pour into a 9-inch square pan. Dissolve the brown sugar in the hot water, then pour stir in the melted butter. Drizzle the syrup over the pudding.\nBake in the preheated oven until the pudding firms and becomes golden brown on top, about 40 minutes.\n",
        "picture_link": "CCFGI0WRtjSbqzECeiBdOUxwuHcKUaO"
    },
    {
        "title": "Crab Omelet",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 small potato, peeled and diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 pound fresh crabmeat, drained and flaked ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 small tomato, diced ADVERTISEMENT",
            "1 (1.5 ounce) box raisins ADVERTISEMENT",
            "1/4 cup peas ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat. Fry the potato in the hot oil until fork-tender, 5 to 7 minutes. Transfer the potatoes to a plate lined with paper towels and set aside. Return the skillet to medium heat. Cook the onion and garlic in the remaining oil until tender, about 5 minutes. Add the crab to the skillet and season with salt and pepper; stir. Cover the skillet and cook for 2 minutes. Stir the tomatoes into the mixture and cook another 2 minutes. Add the raisins, peas, and red bell pepper to the mixture; stir and cook another 2 minutes.\nPour the eggs over the mixture. Cook until he eggs set, 2 to 3 minutes. Flip the omelet and cook 1 minute more. Transfer to a serving plate and serve hot.\n",
        "picture_link": "ahpsurYMBZOeYDCX0YyqTSb5IvoZ9iy"
    },
    {
        "title": "Mexican-Style Deviled Eggs",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons canned chopped green chiles ADVERTISEMENT",
            "1 tablespoon chopped pitted ripe olives ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/8 teaspoon ground cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Remove from the heat and let the eggs stand in the hot water for 15 minutes. Drain. Cool the eggs under cold running water. Peel once cold. Halve the eggs lengthwise and scoop the yolks into a bowl. Mash the yolks with a fork.\nStir the mayonnaise, chopped green chiles, olives, chili powder, and cayenne pepper until well combined; spoon into the egg white halves.\n",
        "picture_link": "cH8I.xZgnuihqi9r.JHLPahY0ysV8me"
    },
    {
        "title": "Lemon-Lime 3-Herb Pasta",
        "ingredients": [
            "1 (8 ounce) package rotini pasta ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 tablespoon dried cilantro ADVERTISEMENT",
            "1 tablespoon dried sage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of lightly salted water to a boil. Cook the rotini in the boiling water until cooked through yet firm to the bite, about 8 minutes. Remove 1/3 cup of the water from the pot and set aside. Drain the pasta.\nCombine the pasta and reserved water in a large bowl; stir the lemon juice, lime juice, parsley, cilantro, and sage through the pasta until evenly mixed. Serve hot.\n",
        "picture_link": "fJEiqnOLO2MrZX2TFVEUG06taqcPqmC"
    },
    {
        "title": "Stuffed Chicken with Pastry Crust",
        "ingredients": [
            "6 tablespoons cold butter ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup water, or more as needed ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup shredded White American cheese, divided ADVERTISEMENT",
            "2 1/2 cups fresh spinach leaves, divided ADVERTISEMENT",
            "3 tablespoons dried basil ADVERTISEMENT",
            "3 teaspoons garlic powder ADVERTISEMENT",
            "3 pinches garlic salt ADVERTISEMENT",
            "1 beaten egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the butter into 1/4-inch thick slices; combine in the bowl of a food processor with the flour and salt. Pulse until the mixture resembles coarse crumbs; drizzle in water with the machine running, 1 tablespoon at a time, until the dough resembles lumpy oatmeal. Gather the dough into a ball, cover with plastic wrap, and refrigerate for at least 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nPlace each chicken breast between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken breast with the smooth side of a meat mallet to a thickness of 1/2 inch. Spread each chicken breast with a third of the cheese and spinach, and fold each chicken breast in half. Sprinkle each chicken breast with 1 tablespoon of basil, 1 teaspoon of garlic powder, and a pinch of garlic salt.\nOn a well-floured work surface, roll the dough ball out into a rectangle about 1/8-inch thick and cut into 3 equal-size pieces. Wrap each folded chicken breast in pastry and pinch the edges together to enclose the chicken in the pastry dough. Place the wrapped chicken breasts onto the prepared baking sheet, brush each pastry package with beaten egg, and bake until the chicken is no longer pink inside and the crust is golden brown, 40 to 45 minutes.\n",
        "picture_link": "Kiu9obuN/cUu3ls0v7PqJBD3GzneDTy"
    },
    {
        "title": "Savory Mussels",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "1 stalk celery, sliced ADVERTISEMENT",
            "3 1/4 cups chicken broth ADVERTISEMENT",
            "2 1/4 pounds mussels, cleaned and debearded ADVERTISEMENT",
            "1 bunch fresh spinach, leaves torn in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium heat. Cook the onion and garlic in the hot oil until softened, 5 to 7 minutes. Stir the carrot and celery into the mixture and continue cooking until the carrot and celery have also softened, another 7 to 10 minutes.\nPour the chicken broth into the pot and bring to a boil; cook at a boil for 5 minutes. Add the mussels; cover the pot and allow the mussels to simmer in the broth mixture just until they begin to open, about 5 minutes. Discard any mussels which do not open. Stir the spinach into the broth just before serving hot.\n",
        "picture_link": "jvpKucwvO4ZmWJ5V3jT653xN1OUJSDa"
    },
    {
        "title": "Kare Kare Pata (Oxtail Stew)",
        "ingredients": [
            "4 1/2 pounds beef oxtails ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 beef bouillon cubes ADVERTISEMENT",
            "1/2 pound bok choy, chopped ADVERTISEMENT",
            "1/2 pound long beans, cut into bite-sized pieces ADVERTISEMENT",
            "1/2 pound eggplant, cubed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon achiote powder ADVERTISEMENT",
            "3 tablespoons smooth peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the oxtails and water in a large pot; bring to a boil, reduce heat to medium-low, and simmer at least 2 hours.\nSkim as much fat from the top of the liquid as possible. Crumble the beef bouillon cubes into the liquid and allow to dissolve. Remove the meat from the broth and set aside. Add the bok choy, long beans, and eggplant to the broth and simmer until tender.\nWhile the vegetables simmer in the broth, heat the olive oil in a large pot over medium heat. Cook and stir the onion and garlic in the hot oil until tender. Stir the achiote powder into the mixture to add a little color. Add the peanut butter and stir until it's melted into the mixture. Add about half the broth to the pot; bring to a simmer for 5 minutes. Add the oxtails and cook another 5 minutes before adding the remaining broth with the vegetables. Serve hot.\n",
        "picture_link": "mA7jkmyEN5uJ09iIJ9JS6FcFsPg8QOu"
    },
    {
        "title": "Mommy's Lemonade (Margaritas)",
        "ingredients": [
            "1 (12 fluid ounce) can frozen limeade concentrate (such as Minute Maid®), thawed ADVERTISEMENT",
            "3 (12 fluid ounce) cans cold water ADVERTISEMENT",
            "1 (12 fluid ounce) can tequila (such as Cuervo® Especial) ADVERTISEMENT",
            "1/2 (12 fluid ounce) can brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "kosher salt for rimming glasses (optional) ADVERTISEMENT",
            "1 lime, cut into wedges (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the limeade concentrate into a pitcher, and fill the can with cold water. Pour into the pitcher; repeat twice more (3 cans of water). Fill the can with tequila, and pour into the pitcher; fill half the can with orange liqueur, and pour into the pitcher. Stir well, chill thoroughly, and serve over ice in salt-rimmed glasses with a lime wedge.\n",
        "picture_link": "QWlILl43fpYZqLa1r1I1zmKxT/q402q"
    },
    {
        "title": "Easy Tiramisu Pie",
        "ingredients": [
            "48 NILLA Wafers, divided ADVERTISEMENT",
            "1/4 cup brewed strong MAXWELL HOUSE Coffee, cooled, divided ADVERTISEMENT",
            "4 ounces PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1 1/2 cups cold milk ADVERTISEMENT",
            "1 pkg. (4 serving size) JELL-O Vanilla Flavor Instant Pudding ADVERTISEMENT",
            "2 cups thawed COOL WHIP Whipped Topping ADVERTISEMENT",
            "1 square BAKER'S Semi-Sweet Baking Chocolate, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange 36 of the wafers on bottom and up side of 9-inch pie plate. Drizzle with 2 Tbsp. of the coffee.\nBeat cream cheese in large bowl with electric mixer until creamy. Gradually beat in milk. Add dry pudding mix. Beat on low speed 1 min. Gently stir in COOL WHIP. Spread half of the pudding mixture over wafers on bottom of crust; top with layers of half of the chocolate and the remaining wafers. Drizzle with remaining coffee. Cover with remaining pudding mixture and remaining chocolate.\nRefrigerate at least 3 hours. Store leftovers in refrigerator.\n",
        "picture_link": "sqdRV70mRZYcU19ojSugyTr7EJ8SyrS"
    },
    {
        "title": "Sweet Mexican Corn Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups unsalted butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "4 cups fresh corn kernels ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour a 10x15-inch baking pan. Sift the flour, baking powder, cinnamon, and salt together into a bowl. Set aside.\nBeat the butter and sugar together with an electric mixer in a large bowl until light and fluffy. Blend the eggs into the mixture one at a time. Stir the condensed milk and evaporated milk into the mixture. Add the flour mixture and mix until just incorporated. Fold the corn kernels into the batter, mixing just enough to evenly combine. Pour the batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "ieZ9tWjILaJ6WDmSuOuROiqRpw0ODTe"
    },
    {
        "title": "Rainforest Chicken and Pasta",
        "ingredients": [
            "3 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion salt ADVERTISEMENT",
            "2 dashes red pepper, or to taste (optional) ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup fresh corn kernels ADVERTISEMENT",
            "1 cup grape tomatoes, halved ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 (12 ounce) package dry fettuccini pasta ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat and lightly oil the grate.\nStir together the paprika, garlic powder, onion salt, and red pepper in a shallow bowl. Coat the chicken breasts with the seasoning, and set aside.\nHeat 1 tablespoon of olive oil in a skillet over medium heat; cook and stir the corn, grape tomatoes, and green onions until the tomatoes are soft and begin to release their juice, about 5 minutes. Remove from the heat.\nGrill the seasoned chicken on the preheated grill until the chicken is no longer pink in the center and shows grill marks, 4 to 5 minutes per side. Transfer the grilled chicken breasts to a platter and allow to stand about 5 minutes.\nBring a large pot of lightly salted water to a rolling boil; cook the fettuccini in the boiling water until cooked through yet firm to the bite, about 8 minutes. Drain.\nCombine the fettuccini, Cajun seasoning, 1 tablespoon olive oil, and any juices from the chicken in a large bowl; toss to coat evenly. Slice the chicken diagonally across the grain. Divide the pasta between 4 plates and top each plate with sliced chicken and corn-tomato mixture.\n",
        "picture_link": "w7e47foE/ebPfpGHZn1MxzWmAA6aWfS"
    },
    {
        "title": "Maja Blanca Maiz (Corn Pudding)",
        "ingredients": [
            "1 2/3 cups coconut milk ADVERTISEMENT",
            "1 (14.5 ounce) can cream-style corn ADVERTISEMENT",
            "1 cup rice flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix thoroughly the coconut milk, cream-style corn, rice flour, and sugar in a non-stick pot over medium heat. Stir frequently while cooking until thick, about 30 minutes. Pour into a serving platter with ridges, or a tray, and let cool completely before serving.\n",
        "picture_link": "ZAVMlBzFV8GLXF6gROeZovLzm7ULK8C"
    },
    {
        "title": "Maraschino Cherry Almond Cookies",
        "ingredients": [
            "1 cup unsalted butter, at room temperature ADVERTISEMENT",
            "2/3 cup sifted confectioners' sugar ADVERTISEMENT",
            "1 1/2 teaspoons almond extract ADVERTISEMENT",
            "2 eggs, at room temperature ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2/3 cup chopped drained maraschino cherries ADVERTISEMENT",
            "Royal Icing: ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups sifted confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the butter in a mixing bowl, and beat with an electric mixer on high speed until smooth and creamy, about 2 minutes. Gradually beat in 2/3 cup of confectioners' sugar, then add almond extract, eggs, and salt, and beat until the mixture is fluffy and well combined, about 3 more minutes. Reduce mixer speed to medium, and gradually beat in flour until the dough is smooth, about 1 minute. Gently stir in the maraschino cherries.\nForm the dough into 2 logs about 1 inch in diameter, roll each log in plastic wrap or waxed paper, and refrigerate until thoroughly chilled, at least 2 hours.\nPreheat oven to 350 degrees F (175 degrees C). Line several baking sheets with parchment paper.\nCut each dough log into about 25 slices about 1/2-inch thick, and place the cookies on the prepared baking sheets, leaving about 1/2 inch of space between each cookie.\nBake in the preheated oven until the cookies are set but not browned, 12 to 14 minutes. Remove to cooling racks to cool to room temperature, about 15 minutes.\nTo make icing, beat egg whites with lemon juice until frothy, about 1 minute, then beat in vanilla extract and confectioners' sugar, a cupful at a time, until the icing is smooth and spreadable. Spread about 1 teaspoon of icing on each cooled cookie, and let the icing harden before stacking.\n",
        "picture_link": "YKVxozHu1EHTiBQOeJ7dGsAnXubiF4m"
    },
    {
        "title": "Chocolate and Peanut Butter Ribbon Dessert",
        "ingredients": [
            "12 NUTTER BUTTER Peanut Butter Sandwich Cookies, divided ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1/2 cup creamy peanut butter ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "2 teaspoons vanilla ADVERTISEMENT",
            "1 (12 ounce) tub COOL WHIP Whipped Topping, thawed, divided ADVERTISEMENT",
            "2 squares BAKER'S Semi-Sweet Chocolate, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crush 8 of the cookies in resealable plastic bag with rolling pin. Mix cookie crumbs and butter. Press onto bottom of foil-lined 9x5-inch loaf pan.\nMix cream cheese, peanut butter, sugar and vanilla with electric mixer on medium speed until well blended. Gently stir in 3 cups of the whipped topping. Spoon 1/2 cup of the cream cheese mixture into small bowl. Stir in melted chocolate until well blended; set aside. Spoon half of the remaining cream cheese mixture over crust. Top evenly with chocolate mixture; cover with remaining cream cheese mixture.\nFreeze 4 hours or overnight until firm. Invert onto plate. Remove foil, then re-invert onto serving platter so that crumb layer is on bottom. Coarsely break the remaining 4 cookies. Top dessert with remaining whipping topping and cookies.\n",
        "picture_link": "o8gmGP9JdUYfpfWX7rR5.FjbuZkOZYm"
    },
    {
        "title": "Cheese Blintzes II",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups cottage cheese ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 teaspoon melted butter ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons butter, or as needed ADVERTISEMENT",
            "2 tablespoons cinnamon sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the milk, whole eggs, salt, and flour into a blender. Blend until smooth. Refrigerate at least 20 minutes. Meanwhile, make the filling by beating together the cottage cheese, egg yolk, melted butter, sugar, lemon juice, and vanilla extract in a bowl with an electric mixer until smooth.\nPreheat an oven to 425 degrees F (220 degrees C). Lightly grease a baking sheet.\nMelt some of the 2 tablespoons of butter in a skillet over medium-high heat. Pour in about 2 tablespoons of the batter and tilt the pan to completely coat with the batter. Cook until golden on the bottom, and no longer wet on the top, about 2 minutes per crepe. Repeat with remaining batter.\nPlace 1 to 2 tablespoons of the filling near one edge of a crepe. Fold this side up towards the center, then fold the sides in. Fold the top over the filling, and place seam-side-down onto the prepared baking sheet. Repeat with the remaining crepes and filling.\nBake in the preheated oven 10 minutes, then sprinkle with cinnamon sugar, and continue baking until lightly golden, about 5 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick Lemon Chambord® Tiramisu",
        "ingredients": [
            "1 pint heavy cream ADVERTISEMENT",
            "3 tablespoons raspberry flavored liqueur (such as Chambord®) ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, at room temperature ADVERTISEMENT",
            "1 (16 ounce) prepared lemon pound cake, cut into 1/4-inch slices ADVERTISEMENT",
            "1 (10 ounce) package frozen raspberries in syrup, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat the cream, raspberry liqueur, vanilla extract, and confectioners' sugar together with an electric mixer until the mixture forms stiff peaks. Cut the cream cheese into pieces, and beat into the whipped cream mixture until fully combined.\nLayer half the pound cake slices into the bottom of a 9x9-inch square dish. Spoon half the raspberries and syrup onto the pound cake slices, and smooth on half the whipped cream mixture. Top with the remaining pound cake slices, remaining raspberries and syrup, and the rest of the whipped cream topping. Cover and refrigerate at least 1 hour. Serve cold.\n",
        "picture_link": "l4QtbdBshe21v6m6OsazUm/peSxcgCS"
    },
    {
        "title": "Mexican Oxtail Beef Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 pounds beef oxtail, cut into pieces ADVERTISEMENT",
            "1 pound cubed beef stew meat (optional) ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "3/4 teaspoon ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 ears corn on the cob, broken in half ADVERTISEMENT",
            "3 carrots, coarsely chopped ADVERTISEMENT",
            "2 russet potatoes, cut into bite-sized pieces ADVERTISEMENT",
            "1/3 cup lentils, picked over and rinsed ADVERTISEMENT",
            "1/3 cup long grain rice ADVERTISEMENT",
            "1 cup frozen mixed vegetables (optional) ADVERTISEMENT",
            "1 head cabbage, cored and cut into 8 wedges ADVERTISEMENT",
            "8 corn tortillas (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large soup pot over medium heat, and brown the oxtails and beef stew meat on all sides. Add water to cover the meat, bring to a boil, reduce heat to a simmer, and cook for 30 minutes. Skim off and discard any foam that collects at the top.\nDrop in the bouillon cube, onion, celery, chili powder, cumin, salt, pepper, and corn ears, stir to combine, and simmer the soup until the meat is very tender, about 2 hours. Stir in the carrots and potatoes, simmer for 30 more minutes, then stir in the lentils, rice, mixed vegetables, and cabbage. Simmer until the rice, lentils, and cabbage are tender, about 30 more minutes. Serve with a half ear of corn in each bowl, with hot steamed tortillas for dipping in the broth.\n",
        "picture_link": "N45Xw0ljn7MNNTiPpgG91tWyF7T41b."
    },
    {
        "title": "Bringhe",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "2 chicken leg quarters, meat removed and cut into bite-sized pieces ADVERTISEMENT",
            "1/2 pound tiger prawns, peeled and deveined ADVERTISEMENT",
            "1/2 pound cubed fully cooked ham ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (16 ounce) can coconut milk ADVERTISEMENT",
            "1 cup uncooked glutinous white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium heat; cook and stir the onion and garlic in the hot oil until translucent, 5 to 7 minutes. Season with the curry powder and stir to evenly coat. Add the chicken and stir. Cover the skillet and cook for 2 minutes. Stir the prawns into the mixture and cook another 2 minutes. Add the ham and bay leaves; season with salt and pepper and mix thoroughly. Again cover the skillet and cook another 2 minutes.\nPour the coconut milk into the skillet. Add the rice and stir. Reduce heat to low and cover; cook, stirring occasionally, until the rice is tender, about 30 minutes. Serve hot.\n",
        "picture_link": "WmpXUhbz8E16UZjTQeHclcUu8pFAfIG"
    },
    {
        "title": "Quebecois Maple Cream Pie",
        "ingredients": [
            "3/4 cup real maple syrup (dark amber) ADVERTISEMENT",
            "2 1/4 cups heavy cream ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Place the pie crust in its plate in a large, shallow baking pan lined with foil in case of a boil-over.\nBring maple syrup to a boil in a heavy saucepan over medium heat, and cook for 5 to 7 minutes, to reduce syrup down by about one-quarter. Stir in cream, bring the mixture to a simmer, then remove from heat.\nWhisk egg yolks and egg together in a large bowl. Very gradually add the cream mixture to the eggs, about 1/4 cup at a time, whisking constantly. Stir in salt, vanilla extract, and vinegar. Pour the batter into the prepared pie crust.\nBake until the pie is mostly set but jiggles slightly when moved, about 1 hour. Let cool before serving.\n",
        "picture_link": "dA2Mai9RQbGNGyW1L9Zyr/O6AWSRtDC"
    },
    {
        "title": "Chicken Salad Puffs II",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup red onion, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 tablespoon raisins ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/4 cup plain yogurt ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "2 cups chopped cooked chicken breast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Grease a baking sheet.\nCombine the water and butter with 1/8 teaspoon salt in a saucepan. Bring to a boil over medium-high heat. Once boiling, reduce heat to medium, and pour in the flour all at once. Stir vigorously until the mixture forms a semi-translucent ball. Remove from the heat and allow to cool for 10 minutes.\nMix in the eggs into the dough, one at a time, adding the next egg only after the first has been completely incorporated. Drop the dough onto the prepared baking sheet by the heaping tablespoon.\nBake in the preheated oven until puffed and golden brown, 30 to 35 minutes. The puffs should be hollow on the inside, and just browned on the bottom. Remove from the oven, and cool to room temperature on a wire rack.\nTo prepare the filling, stir together the onion, celery, raisins, mustard, mayonnaise, yogurt, 1/2 teaspoon salt, and dill in a bowl until combined. Fold in the chopped chicken meat until evenly combined. Cut the tops from the puffs, and spoon the chicken filling inside. Replace the tops before serving.\n",
        "picture_link": "XOoGsG8zC786fhzLmRBcuqZ/j7UEmm2"
    },
    {
        "title": "Heavenly Chicken Salad",
        "ingredients": [
            "1 (8 ounce) can water chestnuts, drained and halved ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 pounds cooked and chopped chicken breast ADVERTISEMENT",
            "1/2 bunch celery, chopped ADVERTISEMENT",
            "1 pound red seedless grapes, halved ADVERTISEMENT",
            "1 cup toasted slivered almonds ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 (8 ounce) jar Major Grey's chutney ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the water chestnuts with the lemon juice in a large bowl. Add the chicken, celery, grapes, and almonds to the water chestnuts. Stir the mayonnaise, chutney, curry powder, and salt together in a separate bowl. Fold the chicken mixture into the mayonnaise mixture; stir to coat evenly. Chill in refrigerator at least 30 minutes before serving.\n",
        "picture_link": "5qRzUnpx9Cq3hwkJSJzUQSrYNW6sL2q"
    },
    {
        "title": "Prune Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 cup pitted prunes ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 tablespoon ground allspice ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons corn syrup, such as Karo® ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine prunes and water in a small saucepan over medium-high heat. Bring to a boil, reduce heat to low, and simmer until prunes are tender, about 5 minutes. Drain and set aside.\nPreheat oven to 350 degrees F (175 degrees C). Grease and flour a fluted tube pan (such as a Bundt(R)).\nMix flour, 1 1/2 cups sugar, allspice, baking soda, nutmeg, cinnamon, and salt together in a mixing bowl. Combine vegetable oil, 1 cup buttermilk, and eggs in a separate bowl; pour them into the flour mixture. Mix until fully incorporated. Use an electric mixer to blend in the drained prunes; the mixer will break them up a bit. Stir in the chopped pecans.\nPour batter into prepared pan and bake in preheated oven until a tester comes out clean, about 45 minutes. Remove cake from oven and allow it to cool for at least 10 minutes on a wire rack.\nTo make icing, combine 1 cup sugar, margarine, 1/2 cup buttermilk, vanilla extract, and corn syrup in a saucepan and bring it to a boil over medium-high heat. Boil for a full 5 minutes, stirring occasionally.\nInvert cake onto a platter and pour hot icing over the cake.\n",
        "picture_link": ".Zojm4A935oIj.bjPudhNgGYQYZ3zkK"
    },
    {
        "title": "Baked Indian Pudding With Maple Syrup",
        "ingredients": [
            "4 cups hot milk ADVERTISEMENT",
            "1/2 cup yellow cornmeal ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup cold milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 4 cups hot milk into the top of a double boiler and place over simmering water. Slowly stir cornmeal into milk and cook until thickened, about 20 minutes. Stir occasionally.\nPreheat oven to 300 degrees F (150 degrees C). Grease a 2-quart round baking dish.\nWhisk maple syrup, brown sugar, molasses, eggs, melted butter, salt, ginger, and cinnamon together in a bowl. Stir maple syrup mixture into cornmeal-milk mixture until thoroughly combined; pour into prepared baking dish. Pour 1/2 cup cold milk over top of pudding.\nBake until set but still slightly quivery on top, about 2 hours. Let stand 30 minutes before serving.\n",
        "picture_link": "W/5xz23jXB6Dsobm.HSNkHdM4AH0R0u"
    },
    {
        "title": "Vegan Caribbean Stew",
        "ingredients": [
            "1 cup uncooked brown rice ADVERTISEMENT",
            "water ADVERTISEMENT",
            "1/2 pound collard greens, chopped ADVERTISEMENT",
            "2 cloves garlic, peeled ADVERTISEMENT",
            "1 (10 ounce) package frozen okra ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, chopped, with liquid ADVERTISEMENT",
            "1 chayote squash, diced ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1/4 teaspoon ground ginger, or more to taste ADVERTISEMENT",
            "1/4 teaspoon dried dill weed, or more to taste ADVERTISEMENT",
            "1/4 teaspoon ground cumin, or to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro, or to taste ADVERTISEMENT",
            "1 (16 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring brown rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low; cover and simmer until rice is tender and the liquid has been absorbed, 45 to 50 minutes.\nPlace collard greens and 2 peeled whole garlic cloves in a pot; add enough water to cover. Boil until collards are tender, about 15 minutes. Drain.\nCombine okra, tomatoes, chayote squash, and 2 crushed garlic cloves in a separate large pot; bring to a boil and cook until okra has thawed, about 5 minutes. Reduce to a simmer; season with ground ginger, dill weed, ground cumin, and cilantro to taste. Add collard greens; simmer until flavors have blended, at least 40 minutes (1 hour for best flavor).\nMash kidney beans together with tomato paste in a bowl; add to the stew. Stir in cooked rice and mix well. Add a spoonful of flour to thicken, if desired. Adjust seasonings to taste.\n",
        "picture_link": "7BuQMZ2ovrll4nbrr5IViXIOIMmtV9m"
    },
    {
        "title": "Grain Free Dutch Babies",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1/3 cup arrowroot powder ADVERTISEMENT",
            "1/4 cup chestnut flour ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "1 (1 gram) packet stevia powder ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Put butter in a 9x13-inch casserole dish and place in the oven until butter melts and starts to brown, about 5 minutes.\nPlace eggs in a blender and pulse until smooth; add coconut milk, arrowroot powder, chestnut flour, lemon extract, stevia powder, and sea salt. Blend until smooth, 45 to 60 seconds. Pour batter over browned butter in the casserole dish.\nBake in the preheated oven until pancake is set in the middle and edges are lightly browned, about 23 minutes.\n",
        "picture_link": "9XvxJ0CzURhL1riu107C7YU7lzX9g3i"
    },
    {
        "title": "Chux Beef Tips",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "1 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "1 teaspoon cracked black pepper ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup dry red wine (such as Carlo Rossi Paisano®) ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1 (.75 ounce) package dry brown gravy mix ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over high heat; cook and stir onion in hot oil until browned, about 15 minutes. Add beef, garlic, ground black pepper, and cracked pepper to the hot oil; cook until stew meat is browned and garlic is golden, about 10 more minutes.\nPour water, red wine, soy sauce, and Worcestershire sauce into a slow cooker and stir brown gravy mix and kosher salt into wine mixture until gravy mix dissolves; add beef mixture to slow cooker and stir to combine. Cook on High until mixture nearly comes to a boil, about 1 hour; reduce heat to Low and cook until beef is tender and sauce has thickened, 1 more hour.\n",
        "picture_link": "jtec25msdwn7U0JxNZCE9PzCilQqvWu"
    },
    {
        "title": "Gourmet Pub Burgers",
        "ingredients": [
            "1 1/3 pounds ground beef ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 pinch kosher salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "6 slices pancetta ADVERTISEMENT",
            "6 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground beef, bread crumbs, shallot, Dijon mustard, egg, garlic, salt, and black pepper together in a large bowl. Refrigerate mixture to incorporate flavors, 20 minutes to 2 hours.\nForm ground beef mixture into 6 patties.\nHeat a skillet over medium heat; lay pancetta slices in a single layer in the hot skillet. Cook until pancetta begins to sweat, 3 to 5 minutes. Remove pancetta from skillet and keep warm.\nPreheat grill for medium heat and lightly oil the grate.\nCook patties on the preheated grill until burgers are cooked to your desired degree of doneness, about 4 minutes per side for medium-well burgers. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\nPlace 1 burger into each of the buns; top burger with a pancetta slice.\n",
        "picture_link": "t0gZfjXMdNdciiwpncTF4zjNmEsgBTi"
    },
    {
        "title": "Slow Cooker Pork with Mushrooms and Barley",
        "ingredients": [
            "3 cloves garlic, finely chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 pork chops ADVERTISEMENT",
            "1/2 cup barley ADVERTISEMENT",
            "8 ounces white mushrooms, sliced ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub chopped garlic and 1 teaspoon salt into pork chops.\nPlace barley in slow cooker and top with pork chops. Cover with white mushrooms and chopped onion. Add chicken broth, water, Worcestershire sauce, bay leaf, salt and a few grinding of fresh black pepper.\nSet slow cooker to low. Cover and cook 8 hours.\n",
        "picture_link": "H7im2yL63K7hE7JZmETmN4Y3qTdi7ua"
    },
    {
        "title": "Lemon Poppy Seed Muffins",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 (3 ounce) package instant lemon pudding mix ADVERTISEMENT",
            "1/4 cup poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line muffin cups with paper liners.\nBeat cake mix, eggs, hot water, vegetable oil, pudding mix, and poppy seeds together in a large bowl with an electric mixer on low until blended, about 4 minutes; pour into lined muffin cups to about 1/3 full.\nBake in the preheated oven until golden and the tops spring back when lightly pressed, about 20 minutes.\n",
        "picture_link": "w9OpsphwntCj1PBi5e9yd53FExPahZS"
    },
    {
        "title": "Vegan Breaded Tofu",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup vegan mayonnaise (such as Follow Your Heart® Veganaise®) ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/4 cup bread crumbs, or as needed ADVERTISEMENT",
            "1 (12 ounce) package tofu, sliced into 1/2-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat the inside of a 9x13-inch baking dish with olive oil.\nStir mayonnaise and water together in a bowl. Place bread crumbs in a separate bowl.\nDip tofu slices in the mayonnaise mixture; press tofu into the bread crumbs until fully coated. Place coated tofu in the prepared baking dish.\nBake in the preheated oven until tofu is fully cooked and breading is browned, about 45 minutes.\n",
        "picture_link": "ss1eXUUPbfpNZ.Ygn5RklHSz.bN0lTu"
    },
    {
        "title": "Freckle Cake",
        "ingredients": [
            "1 package yellow cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (4 ounce) package sweet baking chocolate (such as Baker's German's Sweet Chocolate®), grated ADVERTISEMENT",
            "1 (12 ounce) package miniature chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Generously grease a 10-inch fluted tube pan (such as a Bundt(R)).\nBeat yellow cake mix, vanilla pudding mix, eggs, vegetable oil, and water in a bowl with an electric mixer to make a smooth batter, about 2 minutes. Stir grated chocolate and chocolate chips into batter and pour into prepared tube pan.\nBake until a toothpick inserted into center of cake comes out clean, 50 to 55 minutes. Let cool completely in the pan before turning out onto a cake plate.\n",
        "picture_link": "jxE7Aoi13g3DypB5qkPpdNgo2BJLHuu"
    },
    {
        "title": "Italian Pasta Sauce",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3 large cloves garlic, minced ADVERTISEMENT",
            "2 (28 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "3/4 cup Merlot wine ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3 tablespoons chicken bouillon granules ADVERTISEMENT",
            "3 tablespoons dried basil leaves ADVERTISEMENT",
            "3 tablespoons Italian seasoning ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat. Cook and stir onion and garlic in hot oil until the onion is translucent, 5 to 7 minutes.\nSit tomato sauce, diced tomatoes, wine, tomato paste, chicken bouillon granules, basil, Italian seasoning, salt, and pepper with the onion mixture. Bring the mixture to a boil, reduce heat to low, and cook at a simmer, stirring frequently, for 1 hour.\n",
        "picture_link": "BUp0CYFzjW72IaApVtkhOHnY3W85zwO"
    },
    {
        "title": "Lebanese Fattoush",
        "ingredients": [
            "6 lettuce leaves, chopped ADVERTISEMENT",
            "3 cabbage leaves, chopped ADVERTISEMENT",
            "2 small radishes, minced ADVERTISEMENT",
            "1 medium cucumber, diced ADVERTISEMENT",
            "1 red bell pepper, minced ADVERTISEMENT",
            "1 carrot, shredded ADVERTISEMENT",
            "1/4 cup sweet corn kernels ADVERTISEMENT",
            "1 large tomato, finely diced ADVERTISEMENT",
            "1 small onion, sliced thin ADVERTISEMENT",
            "2 large cloves garlic, crushed ADVERTISEMENT",
            "12 sprigs parsley, minced ADVERTISEMENT",
            "12 mint leaves, minced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup pomegranate seeds (optional) ADVERTISEMENT",
            "1/4 cup pomegranate syrup ADVERTISEMENT",
            "2 (6 inch) pita bread rounds (optional) ADVERTISEMENT",
            "2 cups vegetable oil for frying (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss together the lettuce, cabbage, radish, cucumber, red bell pepper, carrot, corn, tomato, onion, garlic, parsley, mint, olive oil, pomegranate seeds, and pomegranate syrup in a large bowl.\nHeat oil in a deep-fryer or saucepan to 350 degrees F (175 degrees C). Fry the pita breads until golden in color. Remove to cool on paper towels. Crush the bread into small pieces; sprinkle over the salad.\n",
        "picture_link": "YXN9xqflB832CUxJ5n9rA7AfB8k72Fq"
    },
    {
        "title": "Curry Chipotle Satay",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons peanut oil ADVERTISEMENT",
            "1 tablespoon chipotle chile powder ADVERTISEMENT",
            "1/2 tablespoon red curry powder ADVERTISEMENT",
            "3/4 teaspoon sea salt ADVERTISEMENT",
            "1 pound lean beef sirloin tip, sliced into 1/8 inch strips ADVERTISEMENT",
            "1 cup peanut satay sauce (such as A Taste of Thai™ Peanut Satay Sauce) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, whisk together the soy sauce, vinegar, peanut oil, chipotle chile powder, red curry powder and sea salt. Add the meat to the mixture and toss to coat. Cover and refrigerate for at least 30 minutes to marinate.\nPreheat your oven's broiler. Thread the meat onto skewers. Pour any leftover sauce into a small saucepan or microwave safe dish. Bring the sauce to a boil, and cook for a few minutes.\nBroil the skewers, turning frequently, for about 10 minutes, or until meat reaches your desired degree of doneness. Baste frequently with the sauce. Serve with Thai peanut sauce for dipping.\n",
        "picture_link": "wpU7kZFztisSnZifUKnHDv26SgczBLy"
    },
    {
        "title": "Uncle Shaf's Bohemian Dumplings",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "6 slices white bread, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk together the eggs, milk, salt and flour to make a batter. Mix in the bread cubes using your hands or a sturdy wooden spoon. Divide the dough into two pieces and roll each piece into a log about 3-inches long.\nBring a large pot of lightly-salted water to a fast boil. Add the dumplings, cover, and simmer over medium heat for 20 minutes. Use a slotted spoon to carefully remove the dumplings from the water and let drain. Slice and serve while very hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Chocolate Sherbet",
        "ingredients": [
            "1 cup sugar ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "2 tablespoons amaretto (almond flavored liqueur) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, whisk together sugar, cocoa, water, and amaretto until smooth.\nPour mixture into an ice cream freezer container, and follow the manufacturer's instructions to freeze.\n",
        "picture_link": "Z493v9WfMQ1AKgyXLGm5rRLzZjsDlKS"
    },
    {
        "title": "Algerian Flafla (Bell Pepper Salad)",
        "ingredients": [
            "3 green bell peppers ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon finely chopped red onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 roma (plum) tomato, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Place the whole peppers on aluminum foil. Bake until the skin is spotted black and the peppers are soft, 30 to 45 minutes, turning the peppers once if necessary.\nRemove peppers from the oven and set aside to cool for 10 minutes. Peel off the skin and remove the stem and seeds. Chop the roasted peppers into half-inch pieces.\nHeat the olive oil in a skillet over medium heat. Stir in the onion and cook, stirring frequently, until the onion has softened and turned translucent, about 5 minutes. Add the garlic, salt, and pepper; stir in the chopped peppers and tomato. Cook over medium heat, stirring occasionally, until the tomato is soft and the mixture is well incorporated, about 5 minutes.\n",
        "picture_link": "8ZwESWtnrDmqozHa5Le6hKXlRgqwZoO"
    },
    {
        "title": "Caramel Apple Roll-Ups",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "vegetable oil for deep frying ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 apples - peeled, cored and diced ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, at room temperature ADVERTISEMENT",
            "2 tablespoons caramel ice cream topping ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "9 (7 inch square) egg roll wrappers ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish, mix together 3/4 cup of white sugar and 1/2 teaspoon of cinnamon. Set aside. Heat oil in a deep fryer or electric skillet to 375 degrees F (190 degrees C).\nIn a separate bowl, mix together 1/3 cup of white sugar, 1 teaspoon of cinnamon and cream cheese until smooth. Mix in the vanilla and caramel ice cream topping, then fold in the apples. Lay out the egg roll wrappers on a clean surface. Place 3 tablespoons of filling onto the center of each one. Mix together the cornstarch and water; brush the edges of the egg roll wrappers. Roll up according to package directions.\nFry the rolls in hot oil until golden brown, 4 to 6 minutes. Remove and drain briefly, then roll in the shallow dish of cinnamon sugar while still hot. Serve hot and enjoy.\n",
        "picture_link": "5uQpKqGJ5kx2C5XWZuqOOiS0LLS9x.K"
    },
    {
        "title": "Armenian Pizzas (Lahmahjoon)",
        "ingredients": [
            "1 pound lean ground lamb ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1 tablespoon freshly ground cumin seed ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 pinch fenugreek seeds, finely crushed (optional) ADVERTISEMENT",
            "1 lemon wedge ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1 cup chopped flat-leaf parsley ADVERTISEMENT",
            "6 (6 inch) pita bread rounds ADVERTISEMENT",
            "1/3 cup crumbled feta cheese (optional) ADVERTISEMENT",
            "1 lime, cut into wedges ADVERTISEMENT",
            "1 tablespoon chopped fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Season lamb with salt and pepper, and set aside.\nHeat olive oil in large skillet over medium-high heat. Add onion, garlic, and bell pepper and stir until just beginning to brown. Stir in the cumin, turmeric, paprika, and fenugreek.\nImmediately add the ground lamb. Squeeze lemon wedge over lamb, and drop the peel into the mixture. Break up the meat and stir until it has browned. Remove lemon peel.\nStir in the tomatoes, ketchup, and parsley. Continue to simmer until most of the liquid has evaporated, 10 to 15 minutes. The mixture should be spreadable but not too wet or the pitas will become soggy.\nArrange pitas on a large baking sheet unless you are baking them directly on the oven rack. Spoon meat mixture onto pitas and smooth into an even layer to within 1/8 inch of the edge of the pita. Sprinkle feta cheese on the meat mixture.\nBake pitas until the edges are slightly crisp and meat is lightly browned but not dried out, about 10 to 20 minutes depending on whether pitas are on a baking sheet or on the oven rack. Squeeze lime lightly over the top, sprinkle with chopped mint and enjoy!\n",
        "picture_link": "aHBGYNv8VRGUaH8dB6MyJtUlo3wVbNe"
    },
    {
        "title": "Seafood Alfredo Dip",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "2 (4 ounce) cans shrimp, drained ADVERTISEMENT",
            "1 (6 ounce) can crabmeat, drained ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a pan over medium heat. Whisk in the flour, and cook to make a smooth paste, about 5 minutes. Gradually stir in the heavy cream. Continue to whisk the mixture until thick and smooth, about 5 minutes. Stir in the shrimp and crabmeat. Add the Parmesan cheese, and stir until melted. Season to taste with salt and white pepper. Serve warm as a dip.\n",
        "picture_link": "5h.Q6BPYD3/Z3RgC.RE0in2CP8bLBZq"
    },
    {
        "title": "Spiced Percolator Punch",
        "ingredients": [
            "1 (64 fluid ounce) bottle unsweetened pineapple juice ADVERTISEMENT",
            "1 (64 fluid ounce) bottle cranberry juice cocktail ADVERTISEMENT",
            "4 1/2 cups water ADVERTISEMENT",
            "1 cup brown sugar, packed ADVERTISEMENT",
            "2 tablespoons whole cloves ADVERTISEMENT",
            "4 (4 inch) cinnamon sticks, broken ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the pineapple juice, cranberry juice, and water into a clean, well-washed coffee percolator. Place the brown sugar, cloves, cinnamon sticks, and salt in the basket of the percolator, and assemble the coffee percolator. Cover, plug in the cord, and perk. Serve hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Red Wine Chicken",
        "ingredients": [
            "1 cup red wine ADVERTISEMENT",
            "1/2 cup balsamic vinaigrette salad dressing ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 shallots, finely chopped ADVERTISEMENT",
            "1/2 teaspoon chopped fresh thyme leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the red wine and vinaigrette into a resealable plastic bag. Sprinkle the chicken breasts with salt and pepper, and place into the bag. Coat the chicken with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 1 hour.\nPour the marinade into a skillet over high-medium heat, and cook, stirring frequently, until the marinade begins to reduce and the oil separates, about 15 minutes. Place the chicken into the skillet and brown on both sides, about 4 minutes per side. Stir in the shallots, and cook, stirring, until translucent, about 10 minutes. Stir in the thyme leaves and cook until the sauce is reduced and the chicken is browned and no longer pink in the center, about 4 to 5 minutes.\n",
        "picture_link": "F/aQ7eEdRGdIkAGEL6doZb4CK3IaZpO"
    },
    {
        "title": "Crepe Syrup",
        "ingredients": [
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the brown sugar on your plate next to your crepes. Drip the coffee onto the sugar and stir with your fork. Dip your crepes in the mixture.\n",
        "picture_link": "A0Arz1QD7l8GAKeICAHEmsxa6vm9nE."
    },
    {
        "title": "Oma Kiener's Hazelnut Christmas Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups all-purpose flour, sifted ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup ground hazelnuts ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 cup multicolored candy sprinkles (jimmies), or amount needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the butter, sugar, egg, and salt together in a mixing bowl until light and fluffy. Stir in the flour and baking soda, and mix just until blended. Mix in the hazelnuts.\nTurn the dough out onto a lightly floured surface and shape into 2 1/2 inch log. Wrap snugly in wax paper, and refrigerate overnight.\nPreheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets.\nUnwrap, and cut the log into 1/8 inch thick slices. Place on prepared baking sheets 2 inches apart. Brush tops with beaten egg and, if desired, decorate with sprinkles.\nBake in preheated oven until edges are lightly browned, 12 to 15 minutes. Cool on racks, and store in an airtight tin.\n",
        "picture_link": "v9I43zh0eyrqy74XHOgMyPsBQToEyUi"
    },
    {
        "title": "Marinated Mushrooms with Red Bell Peppers",
        "ingredients": [
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 tablespoons corn oil ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon fresh ground black pepper ADVERTISEMENT",
            "2 (16 ounce) packages fresh mushrooms, stems removed ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the vinegar, water, oil, sugar, onion, parsley, basil, garlic, salt, and pepper; bring to a boil. Stir in the mushrooms and red bell pepper; return mixture to a boil; reduce heat and simmer until the mushrooms are tender, 5 to 10 minutes. Remove from heat and allow to cool to room temperature. Transfer to a covered container and store in refrigerator at least 4 hours before serving.\n",
        "picture_link": ".pwz9S/TXCom65BBX40eblZewyVmPoC"
    },
    {
        "title": "Avocado Icing",
        "ingredients": [
            "2 avocados, peeled and pitted ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the avocado and lime juice in a bowl; mix with a hand mixer about 2 minutes. Add the sugar in small amounts while continually mixing until smooth. Mix in the vanilla extract.\n",
        "picture_link": "2xgtMkNkzXO7BYd0DCXza1XbJRgrw5u"
    },
    {
        "title": "BBQ Nachos",
        "ingredients": [
            "20 tortilla chips ADVERTISEMENT",
            "1/4 pound smoked beef sausage ADVERTISEMENT",
            "1/2 cup Cheddar cheese ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange the tortilla chips on a microwave-safe platter. Shred the sausage with a cheese grater; scatter evenly over the chips; top with Cheddar cheese. Drizzle the barbeque sauce over the nachos.\nHeat in the microwave until the cheese melts, 15 to 30 seconds.\n",
        "picture_link": "UJ/YnGDULbEyc8rOxSf3PnfqlUp3sVa"
    },
    {
        "title": "Fresh Organic Catsup",
        "ingredients": [
            "4 pounds tomatoes, seeded and diced ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/4 cup unsweetened apple juice ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "1/2 teaspoon whole cloves ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1 teaspoon black peppercorns ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the tomatoes, onion, garlic, apple juice, and cayenne pepper in a soup pot. Bring to a boil. Place the bay leaf, cloves, celery seed and peppercorns into a spice bag or wrap in cheesecloth. Add to the pot and continue to boil, stirring frequently until the mixture has reduced by half.\nRemove the spice bag and stir in the lemon juice. Continue to boil for 10 more minutes, then remove from the heat. Pour into a container with a lid and refrigerate until using. Use or freeze within 1 week.\n",
        "picture_link": "KMAtcZg1BIFZDqaQO.KQvOiZ1JIqikC"
    },
    {
        "title": "Samoan Green Banana",
        "ingredients": [
            "3 (13.5 ounce) cans coconut milk ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "6 small unripe (green) bananas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the coconut milk and onion in a bowl; set aside.\nBring a large pot of water to a boil over medium heat. Boil the bananas in their skin for 30 to 40 minutes; drain. Run the bananas under cold water until they are cool enough to handle. Remove the bananas whole from their skins.\nHeat a large saucepan over medium-high heat. Place the bananas in the pan. Pour the coconut milk mixture over the bananas. Cook until the coconut milk is foamy. Allow to cool 5 minutes before serving.\n",
        "picture_link": "Zifb7texeNkqtGF.ZnQkAaa.ODBM4Ne"
    },
    {
        "title": "Holiday Cranberry Relish",
        "ingredients": [
            "4 large naval oranges, peeled and cut into chunks ADVERTISEMENT",
            "4 large apples, cored and cut into chunks ADVERTISEMENT",
            "1 (12 ounce) package frozen cranberries ADVERTISEMENT",
            "1 (3 ounce) package strawberry flavored Jell-O® mix ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the oranges in the bowl of a food processor, and pulse until chopped, 2 or 3 pulses. Remove and place the chopped oranges into a large bowl. Chop the apples in the food processor for 2 or 3 pulses, and place in the bowl. Chop the cranberries in the food processor for 2 or 3 pulses, and place in the bowl with the oranges and apples.\nStir the gelatin mix, sugar, and chopped pecans into the chopped fruit, and mix well. Cover and refrigerate until set, at least 4 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange-Pumpkin Poppy Seed Cake",
        "ingredients": [
            "1 (18.25 ounce) package orange cake mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2/3 cup orange juice ADVERTISEMENT",
            "1 (15 ounce) can 100% pure pumpkin ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch cake pans.\nBeat the cake mix, eggs, and orange juice together in a mixing bowl on low speed until moistened. Increase speed to medium and beat in the pumpkin. Stir in the poppy seeds. Pour the batter into the prepared pans, dividing evenly.\nBake in preheated oven until the top springs back when lightly touched, 28 to 31 minutes. Cool in pans for 10 minutes, then remove and place on wire racks to cool completely.\n",
        "picture_link": "fZl3IUWvET6U1TbteAmJc.J6yz5kKLu"
    },
    {
        "title": "Oven Fried Buttermilk Halibut",
        "ingredients": [
            "2 cups buttermilk ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "4 (3/4 inch thick) halibut fillets ADVERTISEMENT",
            "1 (8 ounce) package seasoned rye crackers ADVERTISEMENT",
            "2 tablespoons Greek seasoning ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set a large resealable plastic bag in a bowl. Pour in the buttermilk and salt. Add the halibut fillets and close the bag. Refrigerate for at least 4 hours and up to 1 day.\nPreheat the oven to 250 degrees F (120 degrees C).\nPlace half of the crackers and half of the Greek seasoning into a blender. Cover and pulse until they become fine crumbs. Pour into a shallow bowl, and repeat with remaining crackers and Greek seasoning. Whisk eggs with water in a separate bowl.\nRemove halibut from the bag and discard the marinade. Dip fish into the egg and then in the crumbs until evenly coated. Place coated fillets into a lightly greased 9x13 inch baking dish. Do not let them touch, as they will weld themselves together. Drizzle the butter on top of the fish.\nBake uncovered in the preheated oven until fish is opaque and flakes easily with a fork, about 45 minutes.\n",
        "picture_link": "qOVqzGBZcy3B/XQuZnnxcuTpVVSqFKG"
    },
    {
        "title": "Spicy Pan-Fried Squash",
        "ingredients": [
            "1 acorn squash, halved and seeded ADVERTISEMENT",
            "1/2 onion, cut into chunks ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ground red pepper to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut squash into chunks and remove rind. Shred squash and onion in a food processor. Place in a colander and press with a potato masher to drain any excess liquid. Transfer to a bowl and mix with flour and egg. Season with cumin, salt, pepper, and red pepper.\nHeat the oil in a large skillet over medium heat. Place walnut-sized scoops of the squash mixture into the hot oil. Press flat with a spatula. Cook 3 to 5 minutes on each side, until golden brown. Drain on paper towels.\n",
        "picture_link": "CEzLN/7FNx.HOpTZ2TYmDLVFdkkbMX2"
    },
    {
        "title": "Calimocho (Kalimotxo)",
        "ingredients": [
            "1 1/4 liters cola-flavored carbonated beverage ADVERTISEMENT",
            "1 (750 milliliter) bottle red wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 1 gallon serving jar with a lid or in the 2 liter bottle from the cola, combine the cola and red wine. Put the lid on and gently rock the container to mix. Let rest for a few minutes before serving in glasses over ice.\n",
        "picture_link": "5m.DmYZoPJh5eLgY8B0ypAJXjTyAogC"
    },
    {
        "title": "Parma Chicken",
        "ingredients": [
            "2 (5 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 lemon wedges ADVERTISEMENT",
            "freshly ground pepper to taste ADVERTISEMENT",
            "chipotle powder to taste (optional) ADVERTISEMENT",
            "2 slices Brie cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "6 slices prosciutto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Prepare a small baking dish or sheet by spraying with cooking spray.\nSlice each chicken breast horizontally nearly in half to butterfly. Open up, and sprinkle with lemon juice on both sides. Sprinkle with pepper and chipotle powder to taste, then add a slice of Brie, and sprinkle with chives. Fold the chicken breasts back together firmly.\nPlace 3 slices of prosciutto side by side, pointing away from you, with each overlapping by 1/3. Place a stuffed breast upside down onto the bottom edge of the prosciutto. Roll one complete turn (so the breast is upside down again) fold in the sides, then continue rolling to the end of the prosciutto.\nPlace chicken packets seam-side down onto oiled baking dish. Bake in preheated oven until the internal temperature of the chicken reaches 160 degrees F (70 degrees C), about 40 minutes. Allow to rest for 5 minutes before serving.\n",
        "picture_link": "YvKBq22KgZDtM0F3lAhzyNj0Sfnu2Xu"
    },
    {
        "title": "Empanadas Fritas de Queso",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons lard ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "1 egg, well beaten ADVERTISEMENT",
            "1 cup queso chanco (or Swiss cheese or Havarti), cut into 1/2-inch cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift the flour, baking powder, and salt into a large mixing bowl. Combine the lard and milk in a saucepan, and heat until the milk is hot. Pour the hot milk into the flour mixture, and stir until a dough forms. Turn out onto a floured surface, and knead until smooth and elastic. Cover, and allow to rest for 15 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nRoll the dough out on a floured surface 1/4-inch thick. Cut into 4-inch rounds. Brush the outer edges of each circle with beaten egg, and fill with a small mound of cheese. Fold each circle in half to form a half-moon; press the edges with your fingers or a fork to seal. Place the empanadas onto a parchment paper-lined baking sheet. Brush the tops with remaining egg.\nBake in preheated oven until golden-brown, about 20 minutes.\nAlternatively, the empanadas may be deep fried in 375 degrees F (190 degrees C) oil. If deep frying, do not brush the outsides of the empanadas with egg. Drain on paper towels.\n",
        "picture_link": "TC6w7ovuG4zTRQ9auudGE1aI9bTuAeq"
    },
    {
        "title": "Scallop-Avocado Appetizer",
        "ingredients": [
            "1 pound dry-pack scallops (16-20 count) ADVERTISEMENT",
            "1 cup chopped tomato ADVERTISEMENT",
            "1 cup sliced green onions ADVERTISEMENT",
            "1 avocado, cubed ADVERTISEMENT",
            "1 cup chopped cilantro ADVERTISEMENT",
            "6 tablespoons fresh lime juice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon hot pepper flakes, or to taste ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small pan, bring 4 cups of water to a boil. Add scallops, reduce heat and simmer 1 1/2 minutes -- do not overcook. Drain and refrigerate for 2 hours. Cut into small (1-inch) pieces. Combine all ingredients. Serve in cocktail glasses.\n",
        "picture_link": "gmaP7qiLePjVSeN4JrlgYGMovTsx3I2"
    },
    {
        "title": "Cherry Cola Chicken",
        "ingredients": [
            "2 cups hickory smoke flavored barbeque sauce ADVERTISEMENT",
            "1 (2 liter) bottle cherry cola ADVERTISEMENT",
            "1 cup grape jelly ADVERTISEMENT",
            "1 (4 pound) whole chicken, cut into 6 pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a Dutch oven, large enough to hold your chicken, combine the barbeque sauce, 1 liter of cola and grape jelly. Add the chicken and pour in more cola if needed to cover it. Bring to a boil, then simmer over medium-low heat for 1 hour, adding more cola as needed to keep the chicken covered.\nPreheat a grill for medium heat. Remove the chicken from the sauce, and place on the grill.\nCook, turning frequently for about 20 minutes, just until the skin is crispy. Heat the leftover sauce over high heat and boil for about 10 minutes to serve alongside the chicken.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Australian Potato Salad",
        "ingredients": [
            "4 pounds white potatoes, cut into 1 inch cubes ADVERTISEMENT",
            "3/4 cup bottled French salad dressing ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1 1/4 cups mayonnaise ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 tablespoon coarse grained mustard ADVERTISEMENT",
            "1/2 cup chopped fresh mint leaves ADVERTISEMENT",
            "1/2 cup chopped fresh dill weed ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes in a large pot and fill with enough water to cover. Bring to a boil with the pot uncovered, then remove from the heat, cover and let stand for 25 minutes. Drain and transfer to a serving bowl. Stir in the French salad dressing while the potatoes are still warm. Cool for at least 1 hour.\nAdd the celery and green onions to the potatoes and mix in the mayonnaise, sour cream, mustard, mint, dill and pepper. Refrigerate until serving.\n",
        "picture_link": "p3ve6cHm/qAyvHXAmBNXihb5NdjX1jO"
    },
    {
        "title": "Leche Asada",
        "ingredients": [
            "1 quart whole milk ADVERTISEMENT",
            "1 lemon, zest cut off in 1/2-inch-wide strips ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup pisco (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPour the milk into a saucepan along with the lemon zest and cinnamon sticks. Bring to a simmer over medium-high heat, then reduce heat to low, and cook for 5 minutes. Turn heat off, and allow to steep for 15 minutes.\nGently beat the eggs and sugar together until the sugar has dissolved. Slowly beat in 1 cup of the hot milk, a little at a time, until it has been incorporated. Stir the egg mixture back into the hot milk, pour in the pisco, and mix until well combined.\nPour the custard through a fine mesh sieve into a 2-quart ceramic casserole dish to remove the lemon zest and cinnamon. Bake in preheated oven until set, and browned on top, about 30 minutes. Chill before serving.\n",
        "picture_link": "feUmiIyzXxaoFrQYV78w2uZ2q7OqjMu"
    },
    {
        "title": "Lemon Poppyseed Scones",
        "ingredients": [
            "2 cups oat flour ADVERTISEMENT",
            "1 1/4 cups whole wheat pastry flour ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "2/3 cup buttermilk ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, stir together the oat flour, whole wheat flour, all-purpose flour, baking powder, salt and sugar. Cut in shortening and 1/2 cup of butter until the lumps are smaller than peas. Stir in the lemon zest and poppy seeds. Make a well in the center and pour in the buttermilk. Stir just until the dry ingredients are moistened.\nDivide the dough into 2 pieces. Pat each one into a 1 inch thick circle. Cut circles into 6 wedges like a pie. Place pieces onto a baking sheet, and brush the tops with melted butter.\nBake for 12 to 15 minutes in the preheated oven, until lightly browned. Cool on a wire rack so they do not get too crumbly.\n",
        "picture_link": "oOisqMtSC2EpXEqtc8GnULUTpvbvm8m"
    },
    {
        "title": "Elderberry Soup",
        "ingredients": [
            "5 ounces elderberries ADVERTISEMENT",
            "1 quart water, divided ADVERTISEMENT",
            "1 1/2 teaspoons cornstarch ADVERTISEMENT",
            "1/2 pound apples - peeled, cored and diced ADVERTISEMENT",
            "1 lemon peel ADVERTISEMENT",
            "white sugar to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the elderberries in a pot with 2 cups water, and bring to a boil. Reduce heat to low, and simmer 10 minutes. Remove from heat, puree in a blender until smooth, and return to the pot. In a small bowl, mix the cornstarch with 1 tablespoon of the puree, and stir into the pot to thicken.\nIn a separate pot, bring the apples and remaining water to a boil. Place the lemon peel in the pot. Reduce heat to low, and simmer 10 minutes. Remove peel. Mix the elderberry puree into the apple mixture, and sweeten to taste with sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Garbanzo Bean Soup II",
        "ingredients": [
            "1 1/2 cups chicken broth, divided ADVERTISEMENT",
            "1 (15.5 ounce) can garbanzo beans ADVERTISEMENT",
            "2 tablespoons tahini ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender or food processor, blend 1/2 the chicken broth, garbanzo beans, tahini, mustard, garlic, and red bell pepper until smooth.\nTransfer the blended mixture to a saucepan over medium heat. Mix in the remaining chicken broth, and cook until heated through.\n",
        "picture_link": "p80a078NpXb/3hrcJAlA3fgOsmbg2zW"
    },
    {
        "title": "Lamb and Bulgur Soup (Shorba Freek)",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "3/4 pound lamb shoulder with bones, cut into pieces ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "1 cup canned garbanzo beans, drained ADVERTISEMENT",
            "1 (14.5 ounce) can whole peeled tomatoes with juice ADVERTISEMENT",
            "1/4 cup bulgur (cracked wheat), uncooked ADVERTISEMENT",
            "7 cups water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon dried mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a stock pot over medium-high heat. Add the lamb, onion, garlic, and cinnamon. Season lightly with salt and pepper. Cook stirring frequently, until meat is browned and onions are almost tender. Pour in water and garbanzo beans, and bring to a boil.\nSimmer over low heat for 45 minutes to an hour, skimming the scum from the top occasionally. Meanwhile, pour the tomatoes into a blender or food processor, and puree until smooth.\nWhen the meat is tender, remove the pieces with a slotted spoon. Remove the fat and bones from the meat, and return it to the pot. Discard the fat and bones. Remove cinnamon sticks. Add the tomato puree and bulgur wheat. Simmer for about 10 minutes, or until the bulgur is puffed and tender.\nTransfer to a soup tureen, and garnish with parsley and mint before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Duck and Yellow Rice",
        "ingredients": [
            "4 cups uncooked jasmine rice ADVERTISEMENT",
            "15 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon whole peppercorns ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon yellow curry powder ADVERTISEMENT",
            "1 teaspoon ground turmeric (optional) ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 (4 pound) duck, boned ADVERTISEMENT",
            "5 tablespoons vegetable oil ADVERTISEMENT",
            "6 1/2 cups water ADVERTISEMENT",
            "6 small green onion, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, soak rice in cold water to soak while preparing the rest of the recipe.\nIn a small bowl, using the back of a spoon, smash into a paste the garlic, pepper, salt, curry, and turmeric. Drizzle in the soy sauce as you continue to smash. Set spice aside.\nCut the duck into a dozen pieces, removing the fat and thick skin.\nDrain soaking rice, and set aside. Heat 2 tablespoons vegetable oil in a wide pot over medium-high heat, stir in the spice paste, and cook for 30 seconds. Stir in duck pieces; cook about 10 minutes, stirring frequently until lightly browned. Pour in 2 cups water, bring to a boil, and simmer 10 minutes. Pour in remaining water and vegetable oil; return contents to boil. Add rice to pot. Water should cover the rice by 1/2 inch. Return to a boil and cook, covered tightly, 15 to 20 minutes, until rice is tender.\nRemove pot from heat. Let stand, covered, 5 to 10 minutes. Turn out onto serving platter, and garnish with green onions.\n",
        "picture_link": "SsnSHcTuMbKbuRvtYjPfXrZxx/xGFDW"
    },
    {
        "title": "Toasted Coconut Cream Cake ",
        "ingredients": [
            "2 cups flaked sweetened coconut ADVERTISEMENT",
            "1 (3.5 ounce) package instant coconut cream pudding mix ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 cup vanilla yogurt ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup flaked sweetened coconut ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, at room temperature ADVERTISEMENT",
            "1 cup confectioners' sugar, or to taste ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray 2 9-inch round cake pans with cooking spray, and set aside.\nSpread 2 cups of flaked coconut onto a baking sheet, and toast in the preheated oven, stirring often, until lightly browned and fragrant, 8 to 10 minutes. Set the toasted coconut aside.\nPlace the pudding mix and coconut milk in the work bowl of an electric mixer, and mix on Low speed until thoroughly combined, about 1 minute. Add the cake mix, yogurt, vegetable oil, eggs, and remaining 1/2 cup flaked coconut and mix on Medium speed until the batter is smooth, about 2 minutes. Pour the batter into the prepared cake pans, smoothing the top with a spatula if necessary.\nBake in the oven until the top is lightly browned and the cake springs back when pressed gently, about 40 minutes. Let the cakes cool in the pans for 20 minutes before removing to a wire rack to finish cooling.\nTo make frosting, place the cream cheese into the work bowl of an electric mixer and beat on Low speed until the cream cheese is softened, about 30 seconds. Beat in the confectioners' sugar, milk, and vanilla extract, and beat on Medium speed until the frosting is thick and fluffy, about 2 minutes.\nSpread the cream cheese frosting over the top of one of cooled cake rounds, place the second cake round on top of the frosted round and spread the remaining frosting evenly over the layered cake. Press the toasted coconut gently into the top and sides of the cake.\n",
        "picture_link": "yXMLcRyBAa4FTRbbD/TcpKGDPhPPEPe"
    },
    {
        "title": "Lemon Drop II",
        "ingredients": [
            "4 fluid ounces citron vodka ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "4 fluid ounces triple sec liqueur ADVERTISEMENT",
            "4 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place one maraschino cherry into each of 4 shot glasses or cordial glasses. Combine the vodka, lemon juice and triple sec in a chilled cocktail shaker. Shake then pour over maraschino cherries in the glasses.\n",
        "picture_link": "ufb3tfFq7C.b3fjhvdH2xn83KKJUQu6"
    },
    {
        "title": "Algerian Bouzgene Berber Bread with Roasted Pepper Sauce",
        "ingredients": [
            "2 red bell peppers ADVERTISEMENT",
            "4 tomatoes ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 jalapeno pepper, chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 pounds semolina ADVERTISEMENT",
            "1 1/2 teaspoons salt, or to taste ADVERTISEMENT",
            "3 cups water, or as needed ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "6 tablespoons olive oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler. Place red bell peppers and tomatoes on a baking sheet, and roast under the broiler for about 8 minutes, turning occasionally. This should blacken the skin and help it peel off more easily. Cool, then scrape the skins off of the tomatoes and peppers, and place them in a large bowl. Remove cores and seeds from the bell peppers.\nHeat 1 tablespoon of olive oil in a skillet over medium heat. Add the jalapenos and garlic, and cook until tender, stirring frequently. Remove from heat, and transfer the garlic and jalapeno to the bowl with the tomatoes and red peppers. Using two sharp steak knives (one in each hand), cut up the tomatoes and peppers to a coarse and soupy consistency. Stir, and set sauce aside.\nPlace the semolina in a large bowl, and stir in salt and 4 tablespoons of olive oil. Gradually add water while mixing and squeezing with your hand until the dough holds together without being sticky or dry, and molds easily with the hand. Divide into 6 pieces and form into balls.\nFor each round, heat 1 tablespoon of olive oil in a large heavy skillet over medium heat. Roll out dough one round at a time, to no thicker than 1/4 inch. Fry in the hot skillet until dark brown spots appear on the surface, and they are crispy. Remove from the skillet, and wrap in a clean towel while preparing the remaining flat breads.\nTo eat the bread and sauce, break off pieces of the bread, and scoop them into the sauce. It will slide off, but just keep reaching in!\n",
        "picture_link": "pWwFzVMKavJPARyTAzq8lrNoFaICxmG"
    },
    {
        "title": "Chicken Livers with Gorgonzola Polenta",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound chicken livers, trimmed and chopped ADVERTISEMENT",
            "1 medium onion, sliced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "7 mushrooms, sliced ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes, drained ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 cup dry polenta ADVERTISEMENT",
            "4 ounces Gorgonzola cheese, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Add the onion and bell pepper, and season with a little salt and pepper. Cook, stirring frequently, until tender. Add mushrooms and garlic to the skillet, and cook for a few minutes until fragrant. Move the vegetables to the sides of the skillet, and add the chicken livers. Cook livers for 5 minutes, turning frequently.\nStir tomatoes and wine into the skillet, and turn the heat to medium-high. Simmer for 20 minutes, or until most of the liquid is gone. Taste and season with salt and pepper.\nMeanwhile, pour chicken stock into a saucepan, and bring to a boil. Slowly pour in polenta while stirring vigorously. Cook for a few minutes, then stir in milk. Reduce heat to low, cover and simmer for about 5 minutes, until thick. Stir gorgonzola into the polenta until melted.\nSpoon polenta onto plates, and cover with the chicken liver sauce.\n",
        "picture_link": "rQ.dyp5tTluIxjNZHXlz/3zy35u4ofG"
    },
    {
        "title": "Chicken with Herb Dumplings",
        "ingredients": [
            "3 tablespoons vegetable shortening ADVERTISEMENT",
            "1 cup all-purpose baking mix ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 1/2 pounds bone-in chicken parts ADVERTISEMENT",
            "2 (10.5 ounce) cans cream of chicken soup, undiluted ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "Dumplings: ADVERTISEMENT",
            "2 cups all-purpose baking mix ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon poultry seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat shortening in a large skillet over medium-high heat. In a medium bowl, stir together 1 cup baking mix, salt, paprika, and pepper. Coat chicken with mixture, and fry in shortening, turning until browned. Remove chicken to paper towels, and drain fat.\nWipe out skillet, and return to stove. Stir soup and milk together in skillet. Place chicken in pan, and heat to boiling. Reduce heat to low; cover skillet, and simmer 45 minutes, turning chicken from time to time.\nMeanwhile, in a medium bowl, combine 2 cups baking mix, milk, parsley, and poultry seasoning, stirring together until a soft dough forms. Once the chicken has cooked 45 minutes, drop the dumpling mixture by tablespoonfuls into the simmering gravy. Cook uncovered for 10 minutes; cover, and cook 10 minutes more, until dumplings expand.\n",
        "picture_link": "/q8MeLog5I1nClCoQVAKKsv/FRzYrZO"
    },
    {
        "title": "Traditional Abalone",
        "ingredients": [
            "1/2 pound abalone without shell ADVERTISEMENT",
            "1 1/2 cups seasoned dry bread crumbs ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 cup olive oil for frying ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "1 teaspoon lime juice ADVERTISEMENT",
            "chopped fresh parsley for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice the abalone into 1/4 inch thick steaks, making sure to trim off any meat that is not white, as this part tends to be very tough. Place the steaks on a cutting board, and pound with a meat tenderizer until pliable.\nIn a small bowl, stir together the ketchup, horseradish, and lime juice to make a cocktail sauce. Refrigerate until ready to use.\nHeat olive oil in a large heavy skillet over medium heat for about 5 minutes. Whisk eggs and milk together in a shallow dish. Place bread crumbs in a large resealable plastic bag. Dip the abalone steaks in egg, then place in the bag with the crumbs and shake to coat.\nFry coated abalone for 3 to 5 minutes on each side, until golden brown. Remove to paper towels to drain. Place on a platter, and garnish with lime slices and parsley. Serve with the cocktail sauce for dipping.\n",
        "picture_link": "7cQ8HrjPxhu..DoHMSOtlhrTdMf57IW"
    },
    {
        "title": "Raspberry Chocolate Smoothie",
        "ingredients": [
            "3/4 cup chocolate flavored soy milk ADVERTISEMENT",
            "3/4 cup chocolate sorbet ADVERTISEMENT",
            "1 1/4 cups frozen unsweetened raspberries ADVERTISEMENT",
            "1/2 banana, peeled and sliced ADVERTISEMENT",
            "1 leaf fresh mint, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, blend the soy milk, sorbet, raspberries, and banana until smooth. Garnish with mint to serve.\n",
        "picture_link": "Bx2bzKityXHk7DCkRan8dhOslgEGy9q"
    },
    {
        "title": "Tandoori Chicken Salad",
        "ingredients": [
            "1 cup honey mustard dressing ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 (8 ounce) container mango yogurt ADVERTISEMENT",
            "2 tablespoons garam masala ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "4 (4 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup blanched slivered almonds ADVERTISEMENT",
            "3/4 cup drained canned pineapple tidbits ADVERTISEMENT",
            "8 cups mixed salad greens ADVERTISEMENT",
            "4 sprigs fresh mint ADVERTISEMENT",
            "4 wedges lime ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, whisk together honey mustard dressing, ground cumin, and curry powder. Cover, and refrigerate until serving.\nIn a baking dish, whisk together yogurt, garam masala, and lemon juice. Place chicken breasts in the dish, and turn to coat. Cover, and refrigerate for at least 1 hour, turning occasionally.\nPreheat an outdoor grill for high heat. Lightly brush oil over grill grate. Grill chicken until done, about 6 to 8 minutes per side.\nIn a small bowl, mix together onion, raisins, almonds, and pineapple.\nIn a large bowl, toss salad greens with salad dressing and 3/4 of the almond mixture. Divide salad among 4 plates. Sprinkle equal amounts of reserved almond mixture over each salad. Top each with grilled chicken, and garnish with a mint sprig and a lime wedge.\n",
        "picture_link": "T.NNCIvXISHogAsYnCYYUBsCyPdwx06"
    },
    {
        "title": "Black Walnut Ice Cream",
        "ingredients": [
            "1/2 cup superfine sugar ADVERTISEMENT",
            "2 cups light cream ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1/2 teaspoon black walnut extract ADVERTISEMENT",
            "1/2 cup chopped black walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the sugar, light cream, half-and-half and black walnut extract. Pour into the container of an ice cream maker, and freeze according to the manufacturer's instructions. When ice cream is done, fold in walnuts, and transfer to a freezer container. Freeze until solid.\n",
        "picture_link": "d0mlF7t.zfXiRlAhC3Gu3z7VBy.vMNq"
    },
    {
        "title": "Chunky Chili Cornbread",
        "ingredients": [
            "1 1/4 cups water ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup nonfat dry milk powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "3 cups bread flour or all-purpose flour ADVERTISEMENT",
            "1/3 cup cornmeal ADVERTISEMENT",
            "2/3 cup frozen corn kernels, thawed and drained ADVERTISEMENT",
            "1 1/2 teaspoons red pepper flakes ADVERTISEMENT",
            "1 teaspoon bread machine yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ingredients into the pan of a bread machine in the order recommended by the manufacturer. Set the pan in the machine and close the lid. Select the Dough cycle, and press start.\nWhen the cycle is complete, remove the dough to a lightly floured surface, and press out all of the air. Roll dough up into a tight loaf, and pinch the seam. Place into a 9x5 inch loaf pan. Let rise for about 40 minutes, or until your finger leaves an impression when you poke the bread gently.\nPreheat the oven to 375 degrees F (190 degrees C). Bake the loaf for 30 to 35 minutes in the preheated oven, until nicely browned. When done, the loaf should sound hollow when tapped on the bottom.\n",
        "picture_link": "Zt8ZuD5rpUNbkwk8FBNWc58kKhC93pa"
    },
    {
        "title": "Mexican Martinis",
        "ingredients": [
            "4 limes, juiced ADVERTISEMENT",
            "coarse salt ADVERTISEMENT",
            "2 jalapeno-stuffed green olives ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers premium tequila ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger orange liqueur ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger sweetened lime juice ADVERTISEMENT",
            "1/2 teaspoon superfine sugar ADVERTISEMENT",
            "crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Moisten the edges of two martini glasses with a little lime juice, and then dip moistened edges into coarse salt. Place an olive in each glass.\nPour remaining lime juice into a cocktail shaker, and then add tequila, orange liqueur, sweetened lime juice, and sugar. Fill shaker with ice, shake vigorously, and strain into prepared glasses.\n",
        "picture_link": "BUTXmTMR3pgOHGjW4fLXPJLRhMdVo7e"
    },
    {
        "title": "Karithopita",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup finely chopped walnuts ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch square baking dish.\nIn a medium bowl, stir together the flour, 3/4 cup of sugar, baking powder, salt, cinnamon and cloves. Cut in the shortening until it is in very small pieces, then mix in the milk and egg using an electric mixer on low speed. Mix for about 1 minute, scraping the bottom of the bowl at least once to avoid lumps. Stir in walnuts by hand. Pour into the prepared pan, and spread evenly.\nBake for 35 to 40 minutes in the preheated oven, until a knife inserted into the center of the cake comes out clean. Cool cake in the pan for about 30 minutes while you prepare the honey syrup.\nIn a saucepan, stir together 1/4 cup of sugar and the water. Bring to a boil, reduce heat to low, and simmer for about 5 minutes. Stir in the honey and lemon juice, and remove from heat.\nMake slashes in the top of the cake in a diamond pattern using a knife. Pour the hot syrup over the top of the cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Horseradish Sauce II",
        "ingredients": [
            "1 cup heavy cream ADVERTISEMENT",
            "1/4 cup crumbled blue cheese ADVERTISEMENT",
            "1/4 cup prepared horseradish ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour cream into the container of a blender. Blend on low speed for a minute to thicken slightly. Add blue cheese gradually, then add horseradish and mustard, and blend well. Pour into small sterile jars, and refrigerate for up to one week to blend flavors together.\n",
        "picture_link": "3vJ2Bki7JU.ib8/SiO8TE..syYo4tTO"
    },
    {
        "title": "Tasty Tarragon and Tomato Rice Dish",
        "ingredients": [
            "1 cup uncooked long-grain white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1 tablespoon dry vermouth (optional) ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 teaspoons dried tarragon ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "1 dash ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pot, bring the rice and water to a boil. Reduce heat to low, cover, and simmer 20 minutes.\nIn a separate pot over medium heat, mix the tomatoes, vermouth, brown sugar, tarragon, basil, sea salt, and pepper. Cook, stirring occasionally, 20 minutes, until most of the liquid has been reduced. Serve over the cooked rice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Trainor Family Cranberry Salad",
        "ingredients": [
            "1 (3 ounce) package strawberry flavored Jell-O® mix ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "3/4 cup cold water ADVERTISEMENT",
            "2 oranges - peeled, sectioned, and cut into bite-size pieces ADVERTISEMENT",
            "1 lemon - peeled, seeded and chopped ADVERTISEMENT",
            "3 medium tart apples, peeled and chopped ADVERTISEMENT",
            "2 cups cranberries, coarsely chopped ADVERTISEMENT",
            "1/4 cup white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, whisk together the gelatin mix and boiling water until gelatin is dissolved. Stir in the cold water. Transfer to a gelatin mold, or keep in a bowl; cover and refrigerate.\nPlace the oranges, lemon, apples, and cranberries into a bowl. Sprinkle the sugar over the top. Set aside so the fruit has time to bleed.\nWhen the gelatin is partially set, stir in the fruit. Chill until set, preferably overnight. It becomes tastier with age!\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]