[
    {
        "title": "Streusel-Topped Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F (205 degrees C). Grease bottoms only of 12 muffin cups or line with baking cups.\nIn a medium bowl, combine flour, 1/2 cup white sugar, baking powder and salt; mix well. In a small bowl, combine milk, oil and egg; blend well. Add dry ingredients all at once; stir just until dry ingredients are moistened (batter will be lumpy.)\nFill cups 2/3 full. In small bowl, blend 1/4 cup firmly packed brown sugar, 1 tablespoon butter (softened), 1/2 teaspoon cinnamon and 1/4 cup chopped nuts or flaked coconut with fork until crumbly. Sprinkle over muffins before baking.\nBake for 20 to 25 minutes or until toothpick inserted in center comes out clean. Cool 1 minute before removing from pan. Serve warm.\n",
        "picture_link": "AnWf040yrNlG7XF3v2XrcHoWxBqnY.u"
    },
    {
        "title": "Stained Glass Window Cookies",
        "ingredients": [
            "2/3 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "40 fruit flavored hard candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter and sugar. Stir in vanilla and eggs.\nIn another bowl, sift together flour, baking powder and salt; add to egg mixture alternately with milk.\nOn a lightly floured surface, roll the dough 1/4 inch thick. Cut into 1/4 to 1/2 inch wide strips and, on a well-buttered baking sheet, form into window frames.\nKeeping the colors separate, place candy in plastic bags and crush with a meat mallet. Place crushed candies inside window frames.\nBake for six minutes, or until candy is just melted. Cool on baking sheet for 5 minutes, until candy is hard. Carefully lift cookies off baking sheet with spatula.\n",
        "picture_link": "p/.HkL6W5iZK6FmJofKQPSj3FdXAdkq"
    },
    {
        "title": "Mock Lemon Chiffon Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant lemon pudding mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "1 pint fresh strawberries, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cake and pudding mix together then follow cake mix directions (I substitute Mayonnaise for oil in cake recipe) and bake as directed for 2 - 9 inch round pans. Allow to cool.\nTo Make Filling: Mix together instant pudding mix with milk until thickened. Fold in 8 ounces of the whipped topping. Spread half of lemon pudding mixture on one cake layer and top with sliced strawberries.\nAdd second cake layer and spread with remaining lemon filling. Arrange sliced strawberries over top of lemon filling. Frost sides of cake with remaining 8 ounces whipped topping.\n",
        "picture_link": "B9kPz/Lg5rxjRZzqF0Js2/z3ArprEFm"
    },
    {
        "title": "Pasta, Chicken and Artichokes",
        "ingredients": [
            "4 ounces uncooked pasta ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "1/4 cup fresh chopped broccoli ADVERTISEMENT",
            "1/4 cup chopped tomatoes ADVERTISEMENT",
            "1/4 (14 ounce) can artichoke hearts, drained and sliced ADVERTISEMENT",
            "1/4 cup fresh sliced mushrooms ADVERTISEMENT",
            "1/4 cup chopped red bell pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Cook pasta in boiling water until done. Drain, and set aside.\nIn a large saute pan, heat olive oil over medium high heat; brown the chicken and garlic in oil (about 5 minutes). Remove from the pan, and set aside.\nPour the chicken broth into the pan; then add the broccoli and tomato, and cook for about 5 minutes. Stir in the artichoke hearts, mushrooms, red bell pepper, cooked chicken, and pasta; cook for 3 to 5 more minutes, or until hot. Season to taste with salt and pepper.\nTransfer to a serving bowl, and top with Parmesan cheese and parsley. Serve.\n",
        "picture_link": "S6j0JFKWl4MRYxwWyK1LjAq/OXVzZuW"
    },
    {
        "title": "Oatmeal Cake II",
        "ingredients": [
            "1 1/4 cups boiling water ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the boiling water over the quick oats and let stand for 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease one 13x15 inch baking pan .\nCream the shortening with the sugar until light. Beat in the eggs. Then add the oats and vanilla, mixing well.\nCombine the baking soda, salt , cinnamon and flour. Mix until combined. Add the raisins to the flour mixture and coat well.\nAdd the raisin and flour mixture to the oatmeal mixture and stir to combine. Pour the batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 25 minutes or until a tester inserted near the center comes out clean. Dust with confectioners' sugar or serve with whipped topping, if desired.\n",
        "picture_link": "0QxiYHRaZaSpgCEy9fVvYVeMVpfn5bi"
    },
    {
        "title": "Peanut Butter Pie VIII",
        "ingredients": [
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "4 tablespoons cornstarch ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix confectioners' sugar and peanut butter until mixture has a crumbly texture. Sprinkle half over the bottom of the shell.\nIn the top of a double boiler, combine milk, 2/3 cup sugar, salt, vanilla, cornstarch, and egg yolks. Cook over medium-low heat until thick. Pour filling into crust.\nBeat egg whites until foamy. Add cream of tartar, and continue beating. Gradually add 6 tablespoons sugar, and continue beating until stiff peaks form. Spread over the top of the pie. Sprinkle with remaining peanut butter mixture.\nBake at 325 degrees F (165 degrees C) for 30 minutes.\n",
        "picture_link": "3HYKPjgwoVaDUonmPncLPmHXeiD/Xsu"
    },
    {
        "title": "Pork Chop Casserole I",
        "ingredients": [
            "2 (1 ounce) packages dry onion soup mix ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 cups instant rice ADVERTISEMENT",
            "1 (4.5 ounce) can mushrooms, drained ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 (3/4 inch) thick pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium size bowl, mix dry onion soup mix and water until dissolved. Pour mixture into a 10x15 baking dish. Add rice and mushrooms and mix to distribute well. Salt and pepper to taste. Add pork chops in a single layer on mixture. Push pork chops down into mixture and make sure they are covered with it.\nCover baking dish tightly with aluminum foil and bake in the preheated oven for 1 hour.\n",
        "picture_link": "OSqPUIkmyynWdCg3qGWM3visVTyMgtu"
    },
    {
        "title": "Spruced Up Mashed Potatoes",
        "ingredients": [
            "5 pounds potatoes, peeled and quartered ADVERTISEMENT",
            "3 cups cauliflower florets ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "1 large carrots, chopped ADVERTISEMENT",
            "1/2 cup skim milk ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add potatoes, cauliflower, garlic and carrots. Cook until potatoes are tender but still firm, about 15 minutes. Drain.\nAdd the milk, butter, salt and pepper. Beat until smooth. Sprinkle with parsley and serve.\n",
        "picture_link": "dGYe./zHgYv/4a2MCqHQ.7A8AuNAOPi"
    },
    {
        "title": "White BBQ Sauce",
        "ingredients": [
            "2 cups mayonnaise ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "6 tablespoons lemon juice ADVERTISEMENT",
            "6 tablespoons distilled white vinegar ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the mayonnaise, pepper, salt, lemon juice, vinegar and sugar. Mix all together until smooth. Use to baste chicken, pork chops or ribs as they cook on the grill. Serve extra as dipping sauce!\n",
        "picture_link": "c5pMSFLgVXGIgaW4deYzmfZe0uYjW8u"
    },
    {
        "title": "Shrimp and Crab Casserole",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 pound crab meat ADVERTISEMENT",
            "2 (12 ounce) packages frozen shrimp, thawed ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "10 buttery round crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 3 quart casserole dish.\nIn a saucepan, bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nCombine crab meat, shrimp, rice, mayonnaise, onion, milk, hot sauce, and almonds in casserole dish. Mix well.\nCover top of casserole with crumbled crackers. Bake, uncovered, in preheated oven for 30 to 40 minutes, or until casserole is bubbling.\n",
        "picture_link": "MeE.JZcBZRtZmo4rD4JV/cKP/7BBbtu"
    },
    {
        "title": "Special Cereal Bars I",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "7 cups high protein crisp rice and wheat cereal ADVERTISEMENT",
            "1 cup peanut butter chips ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9 x 13 inch pan.\nIn a large sauce pan, combine sugar and light corn syrup. Cook over medium heat until boiling. Stir in peanut butter until smooth. Remove from heat and stir in the cereal. Pat the cereal mixture into the greased pan.\nMelt peanut butter and chocolate chips over a double boiler or in the microwave. Spread the melted mixture over the cereal bars and refrigerate to set.\n",
        "picture_link": "mLRmL.UTUVHFkQzWWMKeYWTIiWcFQ2y"
    },
    {
        "title": "Cream Corn Pork Chops",
        "ingredients": [
            "2 (15 ounce) cans creamed corn ADVERTISEMENT",
            "4 pork chops ADVERTISEMENT",
            "1/4 tablespoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread corn in the bottom of a 9x13 inch baking dish, then place pork chops on top of corn. Press the chops down into the corn. Cover dish with aluminum foil and bake in the preheated oven for 1 1/2 to 2 hours, or until internal temperature of pork has reached 145 degrees F (63 degrees C).\n",
        "picture_link": "0hEFY8eQPk131VPyRvYa7snAxILUTq6"
    },
    {
        "title": "BBQ Meatballs",
        "ingredients": [
            "1 (16 ounce) package frozen meatballs ADVERTISEMENT",
            "1 (18 ounce) bottle barbecue sauce ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place prepared meatballs, barbeque sauce, and ketchup in a slow cooker. Let cook on a low heat for 4 hours, stirring occasionally.\n",
        "picture_link": "EMJlZjJ0tGeT1HBysUubpuGdQh65bka"
    },
    {
        "title": "Cajun Barbecued Chicken",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 tablespoons Cajun seasoning ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the oil, white wine, and Cajun seasoning. Place chicken in the bowl, and coat with the mixture. Cover, and refrigerate for at least 3 hours.\nPreheat the grill for high heat.\nLightly oil the grill grate. Discard marinade, and place chicken on the grill. Cook for 6 to 8 minutes on each side, until juices run clear.\n",
        "picture_link": "RRKHQf.EWOqAoFvAjd1fl7VouH5xEqG"
    },
    {
        "title": "Non-Edible Cinnamon Ornaments",
        "ingredients": [
            "1 cup ground cinnamon ADVERTISEMENT",
            "1 tablespoon ground cloves ADVERTISEMENT",
            "1 tablespoon ground nutmeg ADVERTISEMENT",
            "3/4 cup applesauce ADVERTISEMENT",
            "2 tablespoons glue ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the cinnamon, cloves, and nutmeg. Mix in the applesauce and glue. Work the mixture with your hands 2 to 3 minutes to form a ball. If mixture is too wet, add more cinnamon. If mixture is too dry, add more applesauce.\nLightly dust a clean surface with cinnamon. Roll out the dough to 1/4 inch thickness. Cut out shapes with cookie cutters, and use a toothpick to make a hole at the top for hanging with a ribbon.\nDry in a slow oven 200 degrees F (100 degrees C) for several hours, or air dry in a sunny spot for 4 or 5 days. When dry, decorate with gingham and/ or ribbon.\n",
        "picture_link": "40g7aeFcSgGwEg.BW3FKOYtGfn/9V8K"
    },
    {
        "title": "Roasted Italian Herb Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "2 cups Italian-style salad dressing ADVERTISEMENT",
            "1 cup Italian-style dried bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken breasts in a 9x13 inch baking dish. Pour salad dressing over chicken. Cover dish and refrigerate for 30 minutes to 1 hour.\nRoll each chicken piece in stuffing crumbs. Return to baking dish. Cover with aluminum foil and bake in the preheated oven for about 45 minutes or until chicken is cooked through and juices run clear.\n",
        "picture_link": "Z4Glu7zEKWfLlQpUH3.2YB4/Qyutc/i"
    },
    {
        "title": "Sesame Chicken",
        "ingredients": [
            "2 teaspoons cornstarch ADVERTISEMENT",
            "2 tablespoons rice wine ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1 clove crushed garlic ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves, cut into bite size pieces ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 ounces fresh mushrooms, quartered ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "4 green onions, sliced diagonally into 1/2 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Marinade: In a nonporous dish or bowl blend cornstarch with wine or sherry; then stir in lemon juice, soy sauce, hot pepper sauce, ginger and garlic. Blend together and stir in chicken strips. Cover dish and refrigerate to marinate for 3 to 4 hours.\nIn a wok or large skillet, place sesame seeds and dry-fry over medium heat, shaking the wok, until the seeds are a golden brown color. Remove seeds and set aside.\nTo same wok or skillet add sesame oil and vegetable oil and heat slowly. Drain chicken, reserving marinade, and stir-fry in wok a few pieces at a time, until browned. Remove chicken with a slotted spoon and set aside.\nAdd mushrooms and green bell pepper to same wok or skillet and stir-fry for 2 to 3 minutes. Add the scallions and stir-fry 1 minute more. Return chicken to wok, together with reserved marinade, and stir over medium high heat for another 2 to 3 minutes, or until the ingredients are evenly coated with the glaze. Sprinkle toasted sesame seeds on top and serve immediately.\n",
        "picture_link": "uV4Jm.SWE2421MK66SgHmipXmpcHxCq"
    },
    {
        "title": "Ganache I",
        "ingredients": [
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1 1/4 pounds bittersweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop the chocolate into small pieces and place it in a large stainless steel bowl.\nIn a large, high sided saucepan, heat cream over medium high heat, stirring frequently, until it starts to boil. At this point, the cream will want to boil over, so keep an eye on it! Immediately remove from heat and pour over chopped chocolate.\nStir until chocolate is completely melted and mixture is smooth. Cool completely and then store in refrigerator. Ganache can be reheated in a stainless steel bowl over hot, but not boiling, water.\n",
        "picture_link": "5Zlyw7jltTGvpi2kmOk0C5wvUpvL2mu"
    },
    {
        "title": "Wine Cookies (Original Italian)",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 cup dry red wine ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl combine the flour, baking powder and sugar. Add the wine and oil. Mix with a large fork and then with your hands.\nRoll small pieces of dough between hands to make \"logs\" then shape into circles. The circles should be no bigger than the 2 inches in diameter. Roll cookies in extra sugar and place on cookie sheet.\nBake at 350 degrees F (175 degrees C) for 25 minutes or until slightly brown. After cookies cool they should be hard and crisp.\n",
        "picture_link": "weccBvlaHE.KtUOtsljiftw3skN9keC"
    },
    {
        "title": "Easy Fettucine Alfredo",
        "ingredients": [
            "8 ounces dry fettuccine pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup evaporated skim milk ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1 1/2 lemons, juiced ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to package directions. Drain; immediately return to pan. Add olive oil; toss to coat. Add evaporated milk, 1/3 cup Parmesan cheese, dried basil, lemon juice, and pepper. Cook over medium-high heat until bubbly, stirring constantly. Top with additional Parmesan cheese and fresh basil.\n",
        "picture_link": "JQcKbwUwWcDNAO0shEV/3gGZzjY5RBm"
    },
    {
        "title": "Rhubarb Custard Pie II",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 cups diced rhubarb ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Roll out pastry for bottom crust, and place in a pie dish. Place rhubarb in crust.\nIn a large bowl, beat the eggs slightly. Mix in sugar, flour, vanilla, milk, and butter or margarine. Pour mixture over rhubarb. Cover with top crust, and seal the edges.\nBake at 400 degrees F ( 205 degrees C) for 50 to 60 minutes.\n",
        "picture_link": "zIGNX1xeJ8IY0fYfaEHhtWmMXwHUZN2"
    },
    {
        "title": "Cookie Press Butter Cookies",
        "ingredients": [
            "1 1/2 cups unsalted butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "3 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together the butter and sugar until light and fluffy. Mix in the egg yolks, 2 tablespoons water, flour, salt and vanilla. Chill the dough.\nPreheat the oven to 400 degrees F (205 degrees C).\nFill the cookie press and shape the cookies on an ungreased baking sheet. Brush the top of each cookie with the egg whites mixed with 2 tablespoons of the water. Decorate as desired.\nBake at 400 degrees F (205 degrees C) until the cookies are golden brown on top, about 10 minutes.\n",
        "picture_link": "T1HaToyXWgEv22YmAdxdlU1JfWNy/LO"
    },
    {
        "title": "Coconut Walnut Biscotti",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon coconut extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together the sugar and butter. Stir in the coconut extract and the eggs. Combine the flour, baking powder, and salt, stir into the creamed mixture. Finally, fold in the coconut and walnuts.\nDivide dough into 2 pieces. Roll each piece out into a log about 10 inches long. Place them on an unprepared cookie sheet and flatten them until they are about 3 inches wide.\nBake for 30 to 35 minutes in the preheated oven, until firm. Cool on baking sheet for 10 to 15 minutes.\nSlice the logs crosswise into 1/2 inch wide slices. Place slices cut side down onto the baking sheet.\nReturn to the oven for an additional 15 minutes, until crisp and light brown. Cool and store in an airtight container.\n",
        "picture_link": "yksyB8izPjTLFWkIfkcaF5Hoz1RFM.i"
    },
    {
        "title": "Artichoke Tetrazzini",
        "ingredients": [
            "1 (8 ounce) package linguini pasta ADVERTISEMENT",
            "1 cup fresh sliced mushrooms ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/8 teaspoon dried thyme ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (10.5 ounce) can condensed chicken broth ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 (6 ounce) can marinated artichoke hearts ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook linguini in a large pot of boiling salted water until tender.\nMeanwhile, saute mushrooms and onion in butter or margarine with thyme. Remove from heat. Stir in flour. Then stir in chicken broth and half and half. Return to heat, and stir until the sauce boils and thickens. Strain artichokes, and stir the liquid into the sauce. Add the fresh Parmesan.\nDrain linguini, and toss with sauce. Fold in the strained artichokes. Serve immediately.\n",
        "picture_link": "0knfDB4P6tzNIS.VSaCdOjoX5neig6q"
    },
    {
        "title": "Veggie Chicken Rice Casserole",
        "ingredients": [
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 whole cooked chicken, cut into pieces ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables, thawed ADVERTISEMENT",
            "2 cups cooked rice ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1/2 cup crushed buttery round crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl combine the soup, chicken, cooked vegetables, cooked rice and water. Mix well and spread mixture in a 9x13 inch baking dish. Sprinkle crushed cracker crumbs on top and bake in the preheated oven for about 15 to 20 minutes. Let cool 10 minutes and serve.\n",
        "picture_link": "MTIkFFApBHVYYskg/CjOIvbihezGlEK"
    },
    {
        "title": "Teriyaki Marinade III",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon ground black pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together soy sauce, brown sugar, orange juice, garlic, and pepper. Pour over beef, pork, or chicken. Cover, and marinate in the refrigerator for 4 hours, or overnight. The longer the meat is marinated, the stronger the flavor will be.\n",
        "picture_link": "Uszi/IOHxoM4WAfobL.AErTYsXKrRhS"
    },
    {
        "title": "Pumpkin Cookies VII",
        "ingredients": [
            "1 cup butter flavored shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup canned pumpkin puree ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (16 ounce) container cream cheese frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter flavored shortening and sugar. Beat in the egg and vanilla, then stir in the pumpkin puree. Combine the flour, baking soda, salt, cinnamon and vanilla instant pudding mix; gradually mix into the pumpkin mixture. Roll into walnut sized balls and place them 2 inches apart onto the prepared cookie sheets.\nBake for 12 to 15 minutes in the preheated oven, until lightly browned at the edges. Allow to cool completely before frosting with cream cheese frosting.\n",
        "picture_link": "IwYJ7PMUFnfSGic33S2FmemwUBQfoGu"
    },
    {
        "title": "Lazy Bruschetta",
        "ingredients": [
            "4 slices Italian bread, 1/2 inch thick ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 tablespoon garlic salt ADVERTISEMENT",
            "1 large tomato, sliced ADVERTISEMENT",
            "1 cup shredded Italian cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler.\nArrange the slices of bread in a single layer on a baking sheet. Mix together the olive oil and garlic powder in a cup or small bowl. Brush onto the slices of bread. Cover each piece of bread with tomato slices, then sprinkle with as much cheese as you like. Drizzle just a bit of the olive oil over the cheese.\nBroil for 3 to 5 minutes, until cheese is melted and bread is toasted. Make sure you keep an eye on it - it doesn't take long!\n",
        "picture_link": "so1YSWi96B5BEISsrMLyiZnlvHnf4Va"
    },
    {
        "title": "Sushi-Inspired Tuna Salad",
        "ingredients": [
            "1 (5 ounce) can solid white tuna packed in water, drained ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon wasabi paste, or to taste ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon minced green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the tuna, mayonnaise, wasabi paste, ginger and green onion. Serve on lettuce leaves or make a sandwich with white bread.\n",
        "picture_link": "vTSf6Gm7Wb1n4Ppnf8wf4FCnnW8TMvy"
    },
    {
        "title": "Tomato and Pepper Salad",
        "ingredients": [
            "3 medium tomatoes, chopped ADVERTISEMENT",
            "1 large cucumber, seeded and chopped ADVERTISEMENT",
            "1 medium green bell pepper, chopped ADVERTISEMENT",
            "1 stalk celery, thinly sliced ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the tomatoes, cucumber, green bell pepper, and celery. Mix the vinegar, sugar, salt, and pepper in a separate bowl, and pour over the salad. Gently toss to coat. Cover, and refrigerate at least 2 hours, stirring occasionally.\n",
        "picture_link": "wOZVajLY9j5t1M9CtPVp4ALbZVp2D3S"
    },
    {
        "title": "Chocolate Pumpkin Cake",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 (15 ounce) can pumpkin ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (16 ounce) container cream cheese frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nIn a large bowl, mix the cake mix, pumpkin, eggs and oil for 3 minutes using a mixer on medium speed. Pour into the prepared pan and spread evenly.\nBake for 35 to 40 minutes in the preheated oven, or until a toothpick inserted in the center comes out clean. Cool, then frost with cream cheese frosting.\n",
        "picture_link": "SFvW6WVJetRCl8sUMHi2lRKFwlrOq72"
    },
    {
        "title": "Famous Coconut-Almond Balls",
        "ingredients": [
            "4 cups flaked coconut ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1 (12 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "26 whole almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line two cookie sheets or large flat surface with waxed paper and place large cooling rack on top. Place coconut in large bowl. Heat corn syrup, one minute in microwave, until syrup boils. Pour immediately over coconut and stir until well mixed.\nUsing a tablespoon measure, shape coconut into 26 balls with hands and place on wire racks. Let rest 10 minutes, then re-roll each ball to keep loose ends from sticking out.\nMelt shortening and chocolate together in large glass bowl in microwave, or in saucepan on stovetop, stirring once or twice. Working quickly, spoon 1 tablespoon of chocolate over each ball. Lightly press an almond on top of each ball. Let balls stand until set.\n",
        "picture_link": "zx0dMmFTW7PZXo8W6C9Da8eoIUfx2Bm"
    },
    {
        "title": "Spinach Casserole",
        "ingredients": [
            "2 (10 ounce) packages frozen chopped spinach ADVERTISEMENT",
            "8 ounces crumbled feta cheese ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 cup cubed processed cheese food ADVERTISEMENT",
            "1 cup melted butter, divided ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package phyllo dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a large bowl, combine the spinach, feta cheese, mozzarella cheese, processed cheese food, 1/2 the butter, vinegar, garlic powder, salt and pepper. Mix well and set aside.\nPlace a layer of phyllo dough into the bottom of a lightly greased 2-quart casserole dish. Spread the spinach and cheese mixture into the dish and top with 4 layers of phyllo dough, spraying each layer with butter-flavored cooking spray. Drizzle the remaining butter over the top.\nBake at 425 degrees F (220 degrees C) for 20 minutes.\n",
        "picture_link": "inZBsdpf1anvcAtxkRCvMnJMT16zVMK"
    },
    {
        "title": "Honey Duck",
        "ingredients": [
            "1 (4 pound) whole duck, rinsed ADVERTISEMENT",
            "1 teaspoon chopped fresh basil leaves ADVERTISEMENT",
            "1 teaspoon chopped fresh ginger root ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 orange, quartered ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 cup undiluted, thawed orange juice concentrate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl mix together mix together the basil, ginger and salt and sprinkle mixture on inside and outside of duck. Stuff duck with orange quarters and lay in roaster. Add water.\nIn a small saucepan combine the honey, butter, lemon juice and orange juice concentrate. Simmer together over low heat until syrupy; pour a little of the mixture over the duck, saving the rest for basting. Cover roaster.\nBake/roast ducks in preheated oven for 30 minutes. Turn duck breast down, reduce heat to 300 degrees F (150 degrees C) and roast covered for another 2 to 2 1/2 hours, or until very tender. If desired, turn duck breast up during last few minutes of cooking, to brown.\n",
        "picture_link": "/6ZUyAK7D8hYOfwHGFx.zpGfrzz2/ee"
    },
    {
        "title": "Italian Vegetable Soup with Beans, Spinach & Pesto",
        "ingredients": [
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, cut into small dice ADVERTISEMENT",
            "3 medium carrots, peeled and sliced 1/4-inch thick ADVERTISEMENT",
            "3 medium celery stalks, sliced 1/4-inch thick ADVERTISEMENT",
            "1 medium bell pepper (red or yellow), stemmed, seeded and cut into medium dice ADVERTISEMENT",
            "1 pound all-purpose potatoes, unpeeled and cut into medium dice ADVERTISEMENT",
            "1 (16 ounce) can petite diced tomatoes ADVERTISEMENT",
            "2 (15.5 ounce) cans cannellini or other white beans, undrained ADVERTISEMENT",
            "6 cups low-sodium chicken broth in can or carton ADVERTISEMENT",
            "7 ounces loosely packed baby spinach ADVERTISEMENT",
            "1 cup frozen green peas ADVERTISEMENT",
            "Salt and ground black pepper ADVERTISEMENT",
            "Prepared pesto (found in grocer's refrigerated section) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a soup kettle over medium-high flame. Add onions, and saute until tender, about 5 minutes. Add carrots, celery, peppers, potatoes, tomatoes, bean and chicken broth; bring to a boil. Reduce heat to low and simmer until vegetables are just tender, about 15 minutes. Add spinach and peas; continue to simmer until spinach wilts, 3 to 4 minutes longer. Season to taste with salt and pepper. Ladle into bowls, adding a spoonful of pesto to each serving of soup.\nFor lunch, pack soup in separate leakproof containers. Warm soup in microwave and top with pesto.\n",
        "picture_link": "2BXH4In4EcYLHJL1uj4x5srJSd4MKye"
    },
    {
        "title": "Mrs. Strong's Casserole",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground beef in a large, deep skillet. Cook over medium high heat until evenly brown. Stir in crushed garlic, salt, sugar and tomato sauce; cover and simmer for 15 to 20 minutes\nBring a large pot of lightly salted water to a boil. Add noodles and cook for 8 to 10 minutes or until al dente; drain and set aside.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a small bowl combine green onions, cream cheese and sour cream. In a 9x13 inch baking dish, place 1/3 of the noodles, cheese mixture, and tomato sauce; repeat twice. Sprinkle Cheddar cheese on top of the casserole.\nBake in preheated oven for 20 minutes or until bubbly; serve.\n",
        "picture_link": "FgoQ8jcM7LRmeNGFu8mC/9ZDPSWPzO2"
    },
    {
        "title": "Orzo Delicioso",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 large white onion, chopped ADVERTISEMENT",
            "2 fresh jalapeno peppers, diced ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "1 (10 ounce) can corn, drained ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "4 fresh mushrooms, sliced ADVERTISEMENT",
            "1 (16 ounce) package dried orzo pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter and oil in a large skillet over medium heat. Stir in onion, jalapeno, and red, green, and yellow peppers. Pour in white wine; cook 5 minutes. Stir in tomato, corn, garlic, and mushrooms; cook 10 minutes.\nMeanwhile, cook orzo according to package directions. Drain, and toss orzo with sauteed vegetables.\n",
        "picture_link": "7KX4NeNFTGkWEeW4BQSHbDRkK3tGgOi"
    },
    {
        "title": "Spicy Indian (Gujarati) Green Beans",
        "ingredients": [
            "1 pound fresh green beans, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon black mustard seed ADVERTISEMENT",
            "4 cloves garlic, finely chopped ADVERTISEMENT",
            "1 dried red chile pepper, crushed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Place the green beans in the pot, and cook briefly, removing after 3 to 4 minutes. Drain, and rinse with cold water.\nHeat the oil in a skillet over medium heat. Stir in the mustard seed and garlic, and cook until golden brown. Mix in the chile pepper. Place the green beans in the skillet, and season with salt and sugar. Cook and stir 8 minutes, or until tender. Season with pepper to serve.\n",
        "picture_link": "dpBD0OuIFTUcqFRGY7NeYDdxOmo.RiS"
    },
    {
        "title": "Cali's Sinful Creme Brulee",
        "ingredients": [
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "5 egg yolks ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 300 degrees F (150 degrees C).\nPlace about 2 tablespoons of the chocolate chips into each of four 6 ounce ramekins. Place them in the microwave, and heat on full power for 30 second intervals. Stir, and continue heating until chocolate has melted. Spread to cover the sides and bottom of each ramekin.\nBring a large pot of water to a boil.\nMeanwhile, in a saucepan, whisk together the cream, 1/4 cup sugar, and salt. Set over medium heat, and warm until steam rises from the surface. Then in a separate bowl, whisk together the egg yolks and vanilla. When the cream is hot, ladle a little bit into the egg yolks while whisking quickly. Ladle in a bit more to bring the yolks up to a high temperature without scrambling them. Whisk the yolk mixture into the rest of the cream. Ladle into the chocolate lined ramekins.\nPlace a towel in the bottom of a baking dish, and place the filled ramekins on top of the towel. Place in the oven, and pour boiling water carefully into the baking dish until it comes half way up the sides of the ramekins. Cover the dish loosely with aluminum foil.\nBake for 35 to 40 minutes in the preheated oven, just until the custard is set. Remove ramekins from the dish, and refrigerate for 4 to 6 hours.\nBefore serving, sprinkle 1 tablespoon of sugar over the top of each creme brulee. Use a kitchen torch or your oven's broiler to caramelize the sugar. It may take 2 to 3 minutes in the broiler. Serve immediately.\n",
        "picture_link": "/gdnVxzOx9carXwOG8rf6cWgZR/mtL."
    },
    {
        "title": "Chicken, Avocado and Mango Salad",
        "ingredients": [
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/3 cup lime juice ADVERTISEMENT",
            "1/2 cup chili garlic sauce ADVERTISEMENT",
            "4 cups shredded, cooked chicken ADVERTISEMENT",
            "2 medium mangos - peeled, seeded and diced ADVERTISEMENT",
            "2 avocados - peeled, pitted and diced ADVERTISEMENT",
            "1 (10 ounce) package spring lettuce mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium-high heat, stir together the brown sugar and water. Bring to a boil, then pour into a medium bowl. Stir in the garlic chili sauce and lime juice. Set the dressing aside.\nIn a large bowl, toss together the chicken, mangos and avocados. Arrange the spring salad mix on serving plates, then top with a few spoonfuls of the chicken mixture. Pour dressing over the top.\n",
        "picture_link": "vDZcLVZu2lid00RuTXLeT09yuXa7cKW"
    },
    {
        "title": "Shrimp, Clams, and Scallops Pasta",
        "ingredients": [
            "2 teaspoons extra virgin olive oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 (16 ounce) package uncooked spaghetti ADVERTISEMENT",
            "1 pound clams ADVERTISEMENT",
            "2 teaspoons extra virgin olive oil ADVERTISEMENT",
            "1 pound shrimp ADVERTISEMENT",
            "1 pound scallops ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 teaspoons olive oil in a saucepan over medium heat, and cook the onion and garlic until tender. Mix in crushed tomatoes, tomato paste, wine, sugar, salt, oregano, red pepper, and bay leaf. Simmer uncovered 1 hour, stirring occasionally.\nBring a large pot of lightly salted water to a boil. Place spaghetti in the pot, cook 8 to 10 minutes, until al dente, and drain.\nPlace the clams in a pot fitted with a steamer basket over boiling water, and steam until opened. Discard clams that do not open. Stir into the sauce.\nHeat 2 teaspoons olive oil in a skillet over medium heat, and cook the shrimp and scallops 2 minutes, or until opaque. Mix in garlic. Stir into the sauce. Serve sauce with seafood over the cooked spaghetti, and top with Parmesan cheese.\n",
        "picture_link": "FT70LWKQCnKDiP92CsdkgFVFwkwt7kq"
    },
    {
        "title": "Kathy's Easy Chile Chicken and Rice",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "1 (4 ounce) can diced green chile peppers, drained ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "1 cup frozen peas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium casserole dish.\nMix the soup, milk, rice, and chile peppers into the casserole dish. Place chicken in the dish. Season with salt and pepper, and top with cheese.\nBake covered 1 hour in the preheated oven. Mix in the peas. Let stand covered 5 minutes before serving.\n",
        "picture_link": "maEaGrft1pr43fM0NdjHC0WQXNtcN8q"
    },
    {
        "title": "Cola Chicken",
        "ingredients": [
            "6 bone-in chicken breast halves ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "2 liters cola-flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breast halves into a 2 quart or slightly larger pot. Pour in ketchup and cola. Simmer over medium heat until the sauce is thick and sticky, about 2 hours. Eat chicken plain, or shred and serve on buns.\n",
        "picture_link": "zC2/7VnqBm7AIqO.YOjb3a5MR0xN71i"
    },
    {
        "title": "Grampa Dave's Texas Chainsaw Bar-B-Que Sauce",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 medium onion, finely chopped ADVERTISEMENT",
            "2 garlic, minced ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 cup cider vinegar ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 slices lemon ADVERTISEMENT",
            "1 cup real maple syrup ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons dry mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium heat. Add the onion and garlic; cook and stir until tender, about 5 minutes. Stir in the orange juice, cider vinegar, lemon juice, lemon slices, maple syrup, Worcestershire sauce, ketchup, molasses, and brown sugar. Season with dry mustard, salt, red pepper flakes, cumin and paprika. Simmer for 45 minutes to 1 hour. Remove lemon slices before using.\n",
        "picture_link": "QGMF7PEl8752EdBoS3AaswsdrH2gPxm"
    },
    {
        "title": "Chicken Pasta - Shannon Style",
        "ingredients": [
            "1 pound farfalle (bow tie) pasta ADVERTISEMENT",
            "4 tablespoons olive oil, divided ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 yellow bell pepper, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh mushrooms ADVERTISEMENT",
            "1 cup Greek salad dressing ADVERTISEMENT",
            "1/2 pint grape tomatoes ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil, and stir in the pasta. Cook 8 to 10 minutes, until al dente, and drain.\nHeat 3 tablespoons olive oil in a skillet over medium heat. Whisk together the egg and water in a bowl. Place bread crumbs in a separate bowl. Dip chicken pieces first into the egg mixture, then into the bread crumbs to coat. Place coated chicken pieces in the skillet, and cook 5 minutes on each side, or until coating is golden brown and juices run clear. Drain on paper towels.\nHeat remaining 1 tablespoon olive oil in a separate skillet over medium heat. Mix in garlic, onion, green bell pepper, red bell pepper, yellow bell pepper, and mushrooms. Cook and stir until vegetables are tender.\nIn a large bowl, toss the pasta, chicken, and vegetables with the Greek dressing. Serve topped with tomatoes and Parmesan cheese.\n",
        "picture_link": "aP.LLqkmhafGZcp8qyJAHIa7fDABUS2"
    },
    {
        "title": "Tarragon Lover's Scallops",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "5 tablespoons butter, divided ADVERTISEMENT",
            "1 1/2 pounds sea scallops, rinsed and drained ADVERTISEMENT",
            "1 teaspoon salt to taste ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "2 tablespoons chopped fresh tarragon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon olive oil and 1/2 tablespoon butter in a large skillet over medium heat. Season scallops with salt and pepper. Place half of the scallops in the skillet without crowding; cook until browned, about 2 to 3 minutes on each side. Remove scallops to a plate. Heat 1 tablespoon olive oil and 1/2 tablespoon butter in the skillet, and cook remaining scallops. Remove to plate.\nWipe out skillet, and return skillet to medium heat. Pour in wine, and boil 1 or 2 minutes, until reduced to about 2 tablespoons. Reduce heat to low, and whisk in the remaining 4 tablespoons butter; just softening butter to form a smooth sauce. Stir in salt, lemon zest, and tarragon. Pour sauce over scallops.\n",
        "picture_link": "8DH2amYlpVuaFwYQS9nfAY1WLlQ893K"
    },
    {
        "title": "Spanish-Style Chicken and Sausage",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 pound sweet Italian sausage, sliced ADVERTISEMENT",
            "1 (8 ounce) boneless, skinless chicken breast, cubed ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 medium green bell pepper, chopped ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1 2/3 cups hot water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground thyme ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 cup frozen green peas ADVERTISEMENT",
            "1 1/2 cups instant rice ADVERTISEMENT",
            "2 medium tomatoes, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Stir in sausage, and brown well, about 5 minutes. Remove, and drain fat. Stir chicken, onion, and green pepper into skillet, and cook 5 minutes.\nMeanwhile, in a small bowl, stir bouillon cubes into hot water to dissolve. Stir in salt, thyme, and garlic powder. Pour into skillet.\nStir peas into skillet, and bring to a boil. Cover, reduce heat to medium low, and simmer about 5 minutes. Stir in rice and tomatoes; cover, remove from heat, and let stand 5 minutes.\n",
        "picture_link": "psD5d3HsetMMrjFNuJdJcgvYy1qhjyi"
    },
    {
        "title": "Black Bean and Corn Salsa",
        "ingredients": [
            "4 (15 ounce) cans black beans, rinsed and drained ADVERTISEMENT",
            "1 yellow bell pepper, diced ADVERTISEMENT",
            "1 orange bell pepper, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1/4 red onion, finely chopped ADVERTISEMENT",
            "1 (16 ounce) package frozen corn, thawed ADVERTISEMENT",
            "2/3 cup olive oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/4 teaspoon hot sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the black beans, yellow bell pepper, orange bell pepper, green bell pepper, red onion, corn, olive oil, red wine vinegar, balsamic vinegar, apple cider vinegar, salt, cumin, cilantro, garlic, and hot sauce together in a non-reactive container. Chill in refrigerator overnight.\n",
        "picture_link": "CRjUgdwsxQtFO/TA4TrBzLHsJP4faxy"
    },
    {
        "title": "Salmon Spread II",
        "ingredients": [
            "1 pound salmon fillets ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 finely chopped green onions ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 drops hot pepper sauce ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan of simmering water, poach the salmon filets 10 minutes, or until flaky and tender.\nIn a medium bowl, mix together cream cheese, sour cream, green onions, salt, hot pepper sauce, lemon juice and Worcestershire sauce.\nFlake salmon into the mixture. Cover and refrigerate 8 hours, or overnight, before serving.\n",
        "picture_link": "aWRebNQXQNJIwU3xCIusG7fHLtBmZ8y"
    },
    {
        "title": "Egg Breakfast Pizza",
        "ingredients": [
            "1 pound ground sausage ADVERTISEMENT",
            "2 (12 inch) prepared pizza crusts ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 (3 ounce) can bacon bits ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1 small green bell pepper, chopped ADVERTISEMENT",
            "4 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble and set aside.\nPlace pizza crusts upside down on cookie sheets and bake for 5 to 7 minutes. Do not allow to brown.\nBeat eggs, milk, salt and pepper. Scramble eggs until firm.\nRemove crusts from oven, turn right side up, spread 1/2 can of cream of celery soup on top of each crust. Spread 1/2 of egg mixture on each crust. Sprinkle bacon bits on one pizza and cooked sausage on the other. Cover each with onions and peppers. Top each pizza with 2 cups of cheese.\nBake in preheated oven, for 25 to 30 minutes, until cheese is golden brown.\n",
        "picture_link": "QFUi63TBTRf7CDe6M.jmjvjxeQH5bG2"
    },
    {
        "title": "Chocolate Snaps Sugar Cookie",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the flour, baking soda and salt; set aside. In a medium saucepan over medium heat, melt margarine. Stir in cocoa, remove from heat and set aside to cool. In a large bowl, cream together the butter, 1 cup white sugar and brown sugar until fluffy. Beat in the eggs one at a time, then stir in the cocoa mixture and the vanilla. Blend in the sifted ingredients to form a soft dough. Cover dough and refrigerate for at least an hour or two.\nPreheat oven to 350 degrees F (175 degrees C). Roll chilled dough into 1 inch balls, roll them in the remaining sugar and place them 2 to 3 inches apart onto ungreased cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "RNg5bik0aQWtz3NXvHa27/VmrOEk5WW"
    },
    {
        "title": "Chickpea Salad",
        "ingredients": [
            "1 (15 ounce) can chickpeas (garbanzo beans), drained ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 cucumber, sliced ADVERTISEMENT",
            "1 small tomato, chopped ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl combine chickpeas, onion, cucumber, tomato, red wine vinegar and balsamic vinegar. Mix well and serve.\n",
        "picture_link": "ey0CrTYiiBFgh0DI2ooyC4Ij5C24pGe"
    },
    {
        "title": "Savory Breakfast Muffins",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon wheat germ ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 cup canned cream-style corn ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 12 muffin cups.\nPlace bacon in a skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nIn a large bowl, combine flour, baking powder, baking soda, sugar, wheat germ and salt. In a separate bowl, combine eggs, milk, corn, butter, oil and bacon. Stir egg mixture into dry ingredients, just until combined. Spoon batter into prepared muffin cups.\nBake in preheated oven for 20 to 25, until golden brown.\n",
        "picture_link": "Nugr9gpt78kuck/9eXFY7/wBTKtXvS6"
    },
    {
        "title": "Scrumptious Shrimp Scampi Linguine",
        "ingredients": [
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "1/2 cup chopped yellow bell pepper ADVERTISEMENT",
            "6 cloves garlic, sliced ADVERTISEMENT",
            "48 large shrimp - peeled, deveined, and tails removed ADVERTISEMENT",
            "1/2 cup dry white wine (such as Chardonnay) ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/4 cup clam juice ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons heavy cream ADVERTISEMENT",
            "1 1/2 teaspoons crushed red pepper flakes, or to taste ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Reserve 1 cup of the linguine cooking water, and drain pasta well in a colander set in the sink.\nMelt 2 tablespoons of butter and 1 1/2 tablespoon of olive oil together in a large skillet over medium heat, and cook and stir the red and yellow bell pepper and garlic until the peppers have softened, about 10 minutes. Stir in the shrimp, and cook and stir until the shrimp are opaque and pink, about 5 minutes. Remove the shrimp to a bowl and set aside, leaving the peppers and garlic in the skillet.\nStir the wine, lemon juice, and clam juice into the skillet, and bring to a boil over medium heat. Mix in 2 more tablespoons of butter and 1 1/2 tablespoons of olive oil, and return the shrimp to the skillet. Stir in reserved pasta cooking water, cream, red pepper flakes, parsley, and sea salt. Add the cooked linguine, and toss lightly with the shrimp and sauce in the skillet. Simmer the mixture over medium-low heat for 5 minutes to let the pasta absorb some of the sauce, and serve hot.\n",
        "picture_link": "j.x1AX4/DJmEsjgxUszi2fcb.LDC3TK"
    },
    {
        "title": "Rice with Goodies",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 1/2 cups uncooked white rice ADVERTISEMENT",
            "3 slices bacon ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "1/2 cup peas ADVERTISEMENT",
            "1 cup fresh mushrooms, sliced ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 Granny Smith apple - peeled, cored and diced ADVERTISEMENT",
            "1 cup cooked, chopped turkey meat ADVERTISEMENT",
            "1 teaspoon chicken soup base ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1/2 cup chopped parsley ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown.\nMix the onion, celery, carrot, peas, mushrooms, almonds, raisins and apple into the skillet. Slowly cook and stir over medium heat until tender.\nMix in the turkey, chicken soup base, soy sauce, parsley and pepper. Mix in the rice. Serve hot.\n",
        "picture_link": "EYqrOi4qJiz1qP2hC0nnTPCzXIQg412"
    },
    {
        "title": "Simple Tiramisu",
        "ingredients": [
            "16 ladyfingers ADVERTISEMENT",
            "2/3 cup strong brewed coffee, room temperature ADVERTISEMENT",
            "1/3 cup maple syrup ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder, for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Split ladyfingers lengthwise and use them to line the bottom and sides of an 8x8 inch dish. Stir together coffee and 1/3 cup maple syrup until smooth. Spoon mixture over ladyfingers.\nIn a large bowl, beat together cream cheese, sour cream and 1/2 cup maple syrup until smooth. Fold in whipped topping. Spread mixture over soaked ladyfingers. Cover and chill 15 minutes.\nDust with sifted cocoa just before serving.\n",
        "picture_link": "60nUFMQXHrDgI2xpdX2pzBQOitK2M1a"
    },
    {
        "title": "Christy's Awesome Hot Ham and Cheese",
        "ingredients": [
            "2 slices whole grain bread ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "2 slices Swiss cheese ADVERTISEMENT",
            "2 thin slices deli ham ADVERTISEMENT",
            "1 teaspoon mayonnaise ADVERTISEMENT",
            "1 teaspoon whole grain mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a skillet over medium-high heat.\nSpread one side of each slice of bread with 1 teaspoon butter. Place one slice, butter-side down in the hot skillet. Top with Swiss cheese and ham. Spread the unbuttered side of the second slice of bread with mayonnaise and mustard; place it, butter-side up on top of the sandwich. Cook until the sandwich is golden brown and the cheese is melted, about 3 minutes per side.\n",
        "picture_link": "jnqGS4KFM.qicVDXflRSpUY5gJVxoEW"
    },
    {
        "title": "Glenn's Marinated Pork Shoulder",
        "ingredients": [
            "1/4 cup chopped garlic ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 dash soy sauce ADVERTISEMENT",
            "1 tablespoon corn syrup ADVERTISEMENT",
            "2 tablespoons apple juice ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon molasses ADVERTISEMENT",
            "1/4 cup wine ADVERTISEMENT",
            "1/4 cup Italian-style salad dressing ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper ADVERTISEMENT",
            "1/4 teaspoon seasoning salt ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "8 pounds pork shoulder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix garlic, onion, soy sauce, corn syrup, apple juice, Worcestershire sauce, molasses, wine, Italian-style salad dressing, distilled white vinegar, garlic powder, salt, onion powder, Cajun seasoning, crushed red pepper, seasoning salt and brown sugar.\nScore pork shoulder 1/8 to 1/4 inch deep. Place in the bowl with the marinade mixture. Marinate at least 4 hours in the refrigerator.\nPreheat an outdoor grill for medium high heat and lightly oil grate.\nCook marinated pork shoulder on the prepared grill 3 hours, or until the internal temperature has reach a minimum of 165 degrees F (75 degrees C). Marinate frequently with the mixture while grilling.\n",
        "picture_link": "KOhCUqQDs/Go6e/OkGTMDEV183MwuPq"
    },
    {
        "title": "Hermit Bar Cookies",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup warm coffee ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the shortening and sugar until smooth. Stir in the molasses and egg. Dissolve the baking soda in warm coffee; stir into the molasses mixture. Combine the flour, salt, cinnamon and cloves; Gradually stir into the batter. Mix in raisins. Form dough into 4 long strips lengthwise on the cookie sheets.\nBake for 12 to 15 minutes in the preheated oven. Cool for 5 minutes on the cookie sheets then cut each strip into 2 inch bars while still warm.\n",
        "picture_link": "CkqXr9VJHA/xc5Qxs4HGzI5TYlCx6ua"
    },
    {
        "title": "White Chili IV",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "coarsely ground black pepper to taste ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "3 green chile peppers, seeded and minced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 (8 ounce) package mushrooms, sliced ADVERTISEMENT",
            "3 (15 ounce) cans pinto beans ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium-high heat, cook chicken in olive oil with black pepper until brown. Stir in onion, garlic and chiles and cook until onion begins to soften.\nStir in bell peppers, mushrooms, beans, green onions and parsley. Pour in wine and chicken broth. Season with bouillon, rosemary, thyme, oregano and cumin. Place bay leaves in pot, cover, reduce heat and simmer 90 minutes.\n",
        "picture_link": "cPqdAOTjzsKJ49A7xGEbnaGZdccJlQe"
    },
    {
        "title": "Gorgonzola Cheese Sauce",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1/3 cup crumbled Gorgonzola cheese ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a medium saucepan over medium-low heat. Stir in flour, then milk. When mixture begins to thicken, stir in cheese. Cook until cheese is melted and sauce reaches desired consistency. Season with salt and pepper.\n",
        "picture_link": "2SNgqKVM4lfmVQdSOoUNkWB.cUtbqS2"
    },
    {
        "title": "German Zwiebelkuchen (Onion Pie)",
        "ingredients": [
            "6 pounds onions, sliced ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "4 egg ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon caraway seed ADVERTISEMENT",
            "2 recipes pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a jelly-roll pan or large pizza pan with prepared dough, making sure dough extends up sides of pan.\nSaute onion in a skillet until translucent and pour cooked onion into a large mixing bowl. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, chop and add to onion; mix well.\nStir in sour cream. Beat eggs enough to break up yolks, then mix in to pie mixture. Add flour to thicken mixture (onions will create a lot of water), then add salt. Mix well and pour mixture into prepared pan. Sprinkle top with caraway seed.\nBake in preheated oven for about 1 hour, or until onions start to turn golden brown on top.\n",
        "picture_link": "XSJoMT0z6iS8WkY5.GspG.PUZqPirpq"
    },
    {
        "title": "Turkey Jambalaya",
        "ingredients": [
            "1 1/2 pounds hot turkey sausage ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "3 cloves garlic, pressed ADVERTISEMENT",
            "1 (14.5 ounce) can Italian-style diced tomatoes, undrained ADVERTISEMENT",
            "2 cups low-sodium chicken broth ADVERTISEMENT",
            "1 1/2 cups uncooked long-grain white rice ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 teaspoons Cajun seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grill or fry sausage until almost cooked through. Drain and set aside. When cooled, cut into bite-size pieces.\nIn a large skillet combine the celery, onion, bell pepper, garlic, tomatoes, broth, rice, bay leaf and seasoning. Mix well and bring to a boil over medium high heat.\nReduce heat to medium low and add sausage. Cover and simmer until rice is tender, about 40 to 45 minutes.\n",
        "picture_link": "LGjRzXXkevRZgP1pfRZDfAplJPu1kr."
    },
    {
        "title": "Chicken Diane Style",
        "ingredients": [
            "2 small onions, chopped ADVERTISEMENT",
            "1 pound fresh mushrooms ADVERTISEMENT",
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "2 teaspoons chopped fresh chives ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/4 cup brandy ADVERTISEMENT",
            "2 tablespoons prepared Dijon-style mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute onions and mushrooms in a large skillet over medium heat. Remove onion/mushroom mixture from skillet and reserve; add chicken breasts to skillet. Saute for 4 minutes, then turn over and add mushroom mixture on top.\nIn a small bowl mix salt, pepper, paprika, chives and parsley together then sprinkle mixture over chicken. In a medium bowl combine the broth, brandy and mustard and blend together. Pour over chicken, reduce heat to low and simmer for 20 to 25 minutes or until chicken is cooked through (no longer pink inside).\n",
        "picture_link": "OzmwyvhoqMJSNVopc2CcTTTZdUXagWy"
    },
    {
        "title": "Potato Chicken Stew",
        "ingredients": [
            "4 cups cooked, cubed chicken breast meat ADVERTISEMENT",
            "2/3 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 cup chopped onion, sauteed in butter ADVERTISEMENT",
            "1 1/2 cups chopped carrots ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 teaspoon dried basil leaves ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 (10 ounce) package frozen mixed vegetables, thawed ADVERTISEMENT",
            "3 cups cooked, diced red potatoes ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/8 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken, mushrooms, onion, carrots and stock in a large saucepan over medium heat. Simmer until carrots are tender, about 10 minutes.\nStir in sage, basil, garlic salt, parsley, mixed vegetables, potatoes and celery and cook until heated through. Stir in flour to thicken sauce, then serve.\n",
        "picture_link": "Zl1LBPlOuiPccka3LBtTYgnAblMhrIK"
    },
    {
        "title": "Blondies II",
        "ingredients": [
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 1/4 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "6 tablespoons peanut butter ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish. Sift together the flour, baking powder and salt; set aside.\nIn a large bowl, cream together 3/4 cup of butter, brown sugar and white sugar until light and fluffy. Beat in the eggs and yolk one at a time, then stir in the vanilla and 6 tablespoons peanut butter. Blend in the sifted ingredients and stir in the chocolate chips. Press the mixture evenly into the prepared pan.\nBake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center comes out with moist crumbs. Cool completely before frosting.\nTo make the frosting, mix the remaining 1/2 cup of butter and 1 cup peanut butter together in a medium bowl. Mix in the confectioners sugar until smooth, then gradually stir in milk until a spreadable consistency is reached. Cut, serve and enjoy!\n",
        "picture_link": "IpUlx68lEHactEQASwg1NOdYyPyUOF2"
    },
    {
        "title": "Sauza®-Rita",
        "ingredients": [
            "1 (12 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "12 ounces water ADVERTISEMENT",
            "1 (12 ounce) bottle light beer ADVERTISEMENT",
            "12 ounces Sauza® Blue Tequila ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour limeade can and water into pitcher. Then add a bottle of light beer (trust us, its really good). Fill limeade can with Sauza Blanco Tequila and pour into pitcher. Stir and serve over ice. Makes 9 delicious drinks, perfect for any ladies night in.\n",
        "picture_link": "BWafCYnwFW/.45.TVUh5yISMYn/d8qK"
    },
    {
        "title": "D'Amaretti Biscotti",
        "ingredients": [
            "3 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1/2 cup toasted almonds, finely chopped ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheet.\nCombine flour and baking powder; set aside. In a large bowl, cream together butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the lemon zest and almond extract. Stir in the flour mixture until smooth, then stir in the chopped almonds.\nDivide dough in two. Shape each portion into a loaf about 12 inches long and 2 inches wide. Place loaves onto the cookie sheet about 4 inches apart, and flatten slightly. Beat egg white until foamy, and brush over tops of loaves.\nBake 20 to 25 minutes, or until light brown. Cool on baking sheet for about an hour.\nPreheat oven to 325 degrees F (165 degrees C). Cut baked loaves diagonally into 1/2 inch thick slices. Lay slices cut side down on the baking sheet.\nBake 10 minutes, or until crisp. Cool on wire rack. Make several days before serving. Store in a paper bag to soften slightly. For longer storage place in a sealed container.\n",
        "picture_link": "tWQLtchOdRpSQJxgZjHgRVkRtlhW.ai"
    },
    {
        "title": "Pecan Crescents",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups chopped pecans ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (170 degrees C).\nCream butter or margarine, gradually adding confectioners' sugar and salt. Cream until light and fluffy.\nStir in pecans and vanilla. Add flour gradually. Mix well. Shape dough into crescents using a teaspoon full for each crescent. Place on ungreased cookie sheet and bake 15-30 minutes. Do not brown. Let cool slightly, then roll cookies in additional confectioners' sugar.\n",
        "picture_link": "/4sWW4wAAFE5wmlfvoZ6EXS19gTZnRK"
    },
    {
        "title": "Soda Cracker Cookies",
        "ingredients": [
            "35 soda crackers ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup finely chopped walnuts ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a 15 x 10 inch baking pan with foil and grease it well. Line the pan with soda crackers.\nIn a medium saucepan, melt the butter. Add the brown sugar and cook stirring it until it dissolves. Bring to a boil and cook about 3 minutes, stirring constantly. Immediately pour mixture over the soda crackers.\nBake for 3 to 5 minutes or until the mixture starts to bubble. Spread the chocolate chips over the hot cookies. Let set for a minute. Spread the chocolate evenly. Sprinkle with nuts. Let cool, then cut into bars.\n",
        "picture_link": "HYMLhDM/IHT3d0gg1xDmh7lM.KvGmhe"
    },
    {
        "title": "Salmon Quiche",
        "ingredients": [
            "1 (8 ounce) package Cheddar cheese, cubed ADVERTISEMENT",
            "1/4 onion, diced ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch dried parsley ADVERTISEMENT",
            "1 pinch dried sage ADVERTISEMENT",
            "1 (14.75 ounce) can salmon, drained, flaked and bones removed ADVERTISEMENT",
            "1 (9 inch) frozen pie crust ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nPlace 8 ounces of cubed Cheddar cheese, onion, eggs, and evaporated milk into a blender. Season with salt, pepper, garlic powder, parsley, and sage, then blend until smooth. Spread salmon over the pie crust. Sprinkle 1/4 cup of shredded Cheddar cheese then pour the egg mixture on top. Top with the remaining 1/4 cup of shredded Cheddar cheese.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes.\n",
        "picture_link": "9rAnjTRaGx6/g9UacPzpKdsrzyqN5o6"
    },
    {
        "title": "Pumpkin Mochi",
        "ingredients": [
            "2 1/2 cups mochiko (glutinous rice flour) ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (29 ounce) can pumpkin puree ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nSift together the mochiko, baking powder, and sugar in a large bowl. Mix together the eggs, pumpkin puree, condensed milk, butter, and vanilla extract in a separate bowl. Stir the egg mixture into the mochiko mixture. Pour into the prepared dish.\nBake in preheated oven for 1 hour. Allow to cool before serving.\n",
        "picture_link": "uM6EP3WAOZIa2NuyyiwRH4lnsZdnzEa"
    },
    {
        "title": "Thanksgiving Beets",
        "ingredients": [
            "2 pounds beets, peeled and sliced ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "3 tablespoons vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beets into a large saucepan. Pour in enough water to cover the beets by 1 inch. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the beets are easily pierced with a fork, about 10 minutes; drain.\nWhisk together the brown sugar, vinegar, water, cornstarch, cinnamon, nutmeg, and cloves in a saucepan. Add the beets and the butter, turn the heat to medium, and cook, stirring constantly, until the mixture comes to a boil. Cook until the sauce thickens slightly, about a minute or two. The sauce will not be sticky-thick, but will still pour nicely. Serve beets hot or cold.\n",
        "picture_link": "OTbsc/kgTbFfjeicjFoPFbeJqM4AaM2"
    },
    {
        "title": "Mustard Onion Pork Chops",
        "ingredients": [
            "4 boneless pork loin chops, butterflied ADVERTISEMENT",
            "1/2 cup prepared yellow mustard, or to taste ADVERTISEMENT",
            "1 cup canned French fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nPlace the pork chops in a shallow baking dish. Pour mustard over them, and turn to coat. Sprinkle fried onions over the top. Cover with aluminum foil.\nBake for 20 minutes in the preheated oven, or until pork chops are cooked through.\n",
        "picture_link": "DZhByBDhVnd.19jbuZbGilW5JlUArfu"
    },
    {
        "title": "Strawberry Rhubarb Sauce",
        "ingredients": [
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "5 teaspoons cornstarch ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups sliced fresh strawberries ADVERTISEMENT",
            "1 cup sliced rhubarb ADVERTISEMENT",
            "5 drops red food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sugar, orange juice, cornstarch, and vanilla in a large sauce pan. Bring to a boil over medium heat. Add strawberries and rhubarb; reduce heat and cook, stirring occasionally, until tender, 5 to 10 minutes. Remove from heat and mash the cooked berries with a fork. Stir in food coloring, if using. Serve warm or cold.\n",
        "picture_link": "XeygMwOWjdIYbLBqAJtqLlEcXIKUiXq"
    },
    {
        "title": "Collard Greens and Beans",
        "ingredients": [
            "3 slices bacon, coarsely chopped ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "2 tablespoons minced garlic, or to taste ADVERTISEMENT",
            "5 cups collard greens, stems and center ribs discarded and leaves chopped ADVERTISEMENT",
            "3/4 cup water, or as needed ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 teaspoons cider vinegar ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes, or to taste ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep pan with a lid, and cook over medium-high heat, stirring occasionally, until evenly browned, about 10 minutes. Remove the bacon pieces from the pan, and set aside.\nReduce the heat to medium-low, and stir the sliced onion into the hot bacon fat. Cook and stir the onion until it begins to brown, scraping the bits off the bottom of the pan, about 8 minutes. Add the garlic, and cook and stir 4 more minutes. Return the bacon to the pan, stir in the collard greens, and toss gently until the greens are wilted, about 3 minutes.\nPour in the water to almost cover the collard greens, and stir in the brown sugar, vinegar, crushed red pepper, and salt and pepper. Bring to a boil, cover, reduce heat to low, and simmer the collard greens until very tender, 1 to 2 hours.\nAbout 1/2 hour before serving, stir the cannellini beans into the collard greens, and return to a simmer.\n",
        "picture_link": "CRrTVpgD4LcM189sX4HoyRDavnn1CJC"
    },
    {
        "title": "Pear and Pomegranate Salad",
        "ingredients": [
            "3 cups green leaf lettuce, rinsed and torn ADVERTISEMENT",
            "1 Bartlett or Anjou pear ADVERTISEMENT",
            "1/3 cup pomegranate seeds ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 tablespoons pomegranate juice ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon prepared Dijon-style mustard ADVERTISEMENT",
            "1/2 tablespoon honey ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Divide the lettuce between two bowls. Halve and core the pear, then cut each half in slices. Divide the pear slices and pomegranate seeds among the two bowls and mix gently.\nCombine the vegetable oil, pomegranate juice, lemon juice, mustard, honey, and pepper in a saucepan. Bring to a boil over high heat; reduce heat and simmer, stirring frequently, until the dressing thickens slightly, about 2 minutes. Pour the warm dressing over the salads and serve.\n",
        "picture_link": "8iFc25KrY6YSUAX0rtFR3G8CUv3NXWa"
    },
    {
        "title": "Strawberry Vinaigrette",
        "ingredients": [
            "1 cup olive oil ADVERTISEMENT",
            "1/2 pint fresh strawberries, halved ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon dried tarragon ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender or food processor, mix olive oil, strawberries, balsamic vinegar, salt, pepper, tarragon and sugar. Blend until smooth.\n",
        "picture_link": "RYauluslyx6ElTVfYqVkjADCgyFGqVi"
    },
    {
        "title": "Coconut Pecan Chicken",
        "ingredients": [
            "1 1/2 cups plain fat-free yogurt ADVERTISEMENT",
            "2/3 cup sweetened coconut flakes ADVERTISEMENT",
            "2/3 cup panko (Japanese-style bread crumbs) ADVERTISEMENT",
            "1/2 cup finely chopped pecans ADVERTISEMENT",
            "1 1/2 pounds chicken breast, cut in 1-inch wide strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees.\nPut yogurt in a small bowl, and set aside. In a shallow pie plate, combine coconut, panko and pecans.\nDip chicken strips in yogurt to cover, then roll in panko mixture. Place strips on an oil-sprayed baking sheet. Spray top of chicken. Bake 15 minutes. Reduce heat to 350, and bake 15 more minutes. Check that coating browns but does not burn. If desired, broil 2 minutes for an even crunchier top.\n",
        "picture_link": "iwvFFCrzwEA.B1Nr0cjEBmF/d3tid16"
    },
    {
        "title": "Authentic Bangladeshi Beef Curry",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "5 green chile peppers, finely sliced ADVERTISEMENT",
            "1 teaspoon ginger paste ADVERTISEMENT",
            "3 whole cardamom seeds ADVERTISEMENT",
            "2 whole cloves ADVERTISEMENT",
            "1 1/2 (2 inch) cinnamon sticks ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 pounds boneless beef chuck, cut into 1-1/2-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat. Add onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more.\nStir in the garlic, green chiles, ginger paste, cardamom seeds, cloves, and cinnamon sticks. Cook and stir until the garlic begins to brown, 3 to 5 more minutes.\nMix cumin, coriander, turmeric, garlic powder, cayenne pepper, and water into the onion mixture. Simmer until most of the water has evaporated and the mixture has thickened.\nStir in beef chuck pieces until coated with spice mixture; simmer over medium-low heat, stirring occasionally, until the beef is cooked through and tender, about 1 to 1 1/2 hours.\n",
        "picture_link": "ERcVHl9TQhZzwtOYFAi4Y4LED4ASROC"
    },
    {
        "title": "New Orleans Chocolate Bourbon Pecan Pie",
        "ingredients": [
            "2/3 cup white sugar ADVERTISEMENT",
            "1 cup corn syrup ADVERTISEMENT",
            "2 tablespoons bourbon whiskey ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup melted butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup coarsely chopped pecans ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1 (9 inch) refrigerated pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBeat the sugar, corn syrup, bourbon, eggs, butter, and salt together in a mixing bowl until smooth and creamy. Fold in the pecans and chocolate chips. Pour the mixture into the prepared pie crust. If desired, cover the edges of the pie with aluminum foil strips to prevent excessive browning.\nBake in preheated oven until the center sets, about 50 minutes. Cool before serving.\n",
        "picture_link": "y6oDbNxHbWvwLXXdrbR3vhRKAR5WUja"
    },
    {
        "title": "Baked Leeks",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 cups skim milk ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper, to taste ADVERTISEMENT",
            "4 medium leeks, halved lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x12 inch baking pan.\nMelt butter over low heat. Stir in flour until smooth. Gradually stir in milk and cheese until cheese is melted. Season with garlic powder, salt, and pepper. Remove from heat. Arrange the leeks in a single layer in the prepared pan and cover with the cheese sauce.\nBake for 30 minutes in the preheated oven, until leeks are tender and sauce is bubbly.\n",
        "picture_link": "YI0G9QwOK4Ww9yX5udieQGelm16QF1W"
    },
    {
        "title": "Simple Creamy Lemon Chicken Sauce",
        "ingredients": [
            "1 (10.75 ounce) can cream of chicken soup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the chicken soup, water, lemon juice, butter, and garlic powder together in a pan and place over medium heat. Cook until hot, about 5 minutes.\n",
        "picture_link": "7zwGUXOVIeKOLQLPyeTisws8c384CMy"
    },
    {
        "title": "Pumpkin Pie French Toast",
        "ingredients": [
            "3 large eggs ADVERTISEMENT",
            "1/2 cup half-and-half cream ADVERTISEMENT",
            "1/4 cup canned pumpkin puree ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/4 cup finely chopped walnuts ADVERTISEMENT",
            "8 slices day-old bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a lightly oiled skillet over medium heat.\nWhisk eggs, half and half, pumpkin, cinnamon, vanilla extract, pumpkin pie spice, and walnuts together in a bowl. Soak one slice of bread at a time in the pumpkin mixture, then place in the prepared skilled. Repeat with the remaining slices of bread. Stir the pumpkin mixture between dips to keep the walnuts from settling. Cook the bread until golden brown, about 3 minutes on each side.\n",
        "picture_link": "dGYoe/PVOtEN8x1MxAwhPgSO1wTt0kG"
    },
    {
        "title": "Ghirardelli® Ultimate Chocolate Fondue",
        "ingredients": [
            "1 1/4 cups whole milk or heavy cream ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "6 ounces Ghirardelli 70% Cacao Extra Bittersweet Chocolate baking bar, broken or chopped into 1-inch pieces ADVERTISEMENT",
            "6 ounces Ghirardelli Milk Chocolate baking bar, broken or chopped into 1-inch pieces ADVERTISEMENT",
            "2 tablespoons chocolate liqueur (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, combine the milk, vanilla, and butter. Heat over medium heat until the mixture just simmers. Remove from the heat and stir in the bittersweet and milk chocolates and chocolate liqueur until completely melted and smooth.\nServe over a heat source that will keep the fondue warm, but not hot.\n",
        "picture_link": "fTiflB8NDPTWtVvStMspsuBVa/RDBwi"
    },
    {
        "title": "Homemade Vegetable Soup",
        "ingredients": [
            "2 cups chopped baby carrots ADVERTISEMENT",
            "2 baking potatoes, cut into cubes ADVERTISEMENT",
            "1 small sweet onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 (14 ounce) can great Northern beans, rinsed and drained ADVERTISEMENT",
            "1/2 small head cabbage, chopped ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes ADVERTISEMENT",
            "2 cups cut fresh green beans (1/2 inch pieces) ADVERTISEMENT",
            "1 (32 ounce) carton chicken broth ADVERTISEMENT",
            "2 (14 ounce) cans vegetable stock ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 pinch rubbed sage ADVERTISEMENT",
            "1 pinch dried thyme leaves ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the baby carrots, potatoes, onion, celery, beans, cabbage, tomatoes, green beans, chicken broth, vegetable stock, water, basil, sage, thyme, and salt in a large pot; bring to a boil. Reduce heat to low; cover. Simmer until vegetables are tender, about 90 minutes.\n",
        "picture_link": "s5OI0bpdrkgAM.EUjtDaShX3NbjqPTq"
    },
    {
        "title": "Rice, Asparagus and Cucumber Salad",
        "ingredients": [
            "1 3/4 cups water ADVERTISEMENT",
            "1 cup long-grain white rice ADVERTISEMENT",
            "1 pound thin asparagus spears, trimmed and cut into 1 inch ADVERTISEMENT",
            "1 1/2 cups English cucumber - peeled, seeded and chopped ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "2 1/2 tablespoons vegetable oil ADVERTISEMENT",
            "1/4 cup chopped fresh dill weed ADVERTISEMENT",
            "4 heads butter lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, bring 1 3/4 cups water to boil. Add rice; return to boil. Reduce heat to low, cover and cook until water is absorbed and rice is tender, about 20 minutes. Fluff with fork; transfer to bowl. Cool to room temperature.\nCook asparagus in a large saucepan of boiling salted water until tender, about 1 minute. Drain and rinse with cold water to cool. Cut the asparagus into 1-inch pieces. Add asparagus, cucumber and green onions to rice.\nWhisk together the mustard, sugar, vinegar, dry mustard, oil and chopped dill. Cover salad and dressing separately. Refrigerate until chilled.\nPour dressing into salad and season with salt and pepper. Line large bowl with lettuce and mound salad in bowl. Garnish with dill sprigs.\n",
        "picture_link": "ib1ExhUzJXQDMVVbPZfbJHsF7gcrkzq"
    },
    {
        "title": "Stuffed Celery",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "20 green olives with pimento, chopped ADVERTISEMENT",
            "1 bunch celery, cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the cream cheese and sour cream. Stir in the walnuts and chopped olives. Spread filling onto the celery pieces. It's also good on crackers.\n",
        "picture_link": "uQh7reVw1AAwBCl4wCvao2YDCNAIaia"
    },
    {
        "title": "Chocolate Pie I",
        "ingredients": [
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a cast iron skillet over medium low heat, melt the butter.\nCombine one cup of the sugar with cocoa and flour. Beat the egg yolks with the milk and add them to the sugar mixture.\nAdd the sugar and egg mixture to the skillet with the melted butter or margarine and cook gently, stirring constantly until thick. (Watch this mixture closely as it has a tendency to burn)! Add the vanilla. Pour the mixture into the baked crust.\nBeat the egg whites until soft peaks form; add the remaining 1/4 cup sugar and beat until meringue is glossy and stiff peaks form. Spread beaten egg whites over the hot filling be sure the whites touch the edges of the crust. Bake in the preheated oven for 10 to 15 minutes (or until the meringue is golden brown).\n",
        "picture_link": "hgdGTlBxjLQpp5lq3.Gg4UT/Ec3VpFm"
    },
    {
        "title": "Apple Pie III",
        "ingredients": [
            "3 transparent apples - peeled, cored and sliced ADVERTISEMENT",
            "3 Granny Smith apples - peeled, cored and sliced ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2/3 cup shortening ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 tablespoon half-and-half ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place apple slices into a large bowl. In a small bowl, mix together 1/4 cup flour, 1/3 cup sugar, and cinnamon, and then sprinkle over apples. Cover, and let sit overnight in refrigerator.\nWhen you are ready to make the pie, begin by making the pastry. In a large bowl, mix together 2 cups flour and salt. Cut in the shortening and 2 tablespoons butter until the mixture is the consistency of cornmeal. Make a well in the center of the mixture, and add cold water. Stir together to form a ball. Let rest 20 minutes.\nRoll out dough, and place in pie pan. Spread apple mixture into the pastry lined pan, and dot with 1 tablespoon butter. Cover with top crust, and seal the edges. Cut a few slits in the top to allow steam to escape. Using a pastry brush, lightly brush half-and-half over the top crust. Sprinkle with 1 teaspoon sugar.\nBake in a preheated 400 degrees F (205 degrees C) for 10 minutes. Turn oven to 350 degrees F (175 degrees C). Continue cooking for 30 to 40 minutes, or until crust is golden brown.\n",
        "picture_link": "XC36qlYeBMjxke4QAZTldcKhiBXFcWm"
    },
    {
        "title": "Slow Cooker Spaghetti Sauce I",
        "ingredients": [
            "5 (29 ounce) cans tomato sauce ADVERTISEMENT",
            "3 (6 ounce) cans tomato paste ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 tablespoons dried rosemary ADVERTISEMENT",
            "3 tablespoons dried oregano ADVERTISEMENT",
            "3 tablespoons dried thyme ADVERTISEMENT",
            "3 tablespoons dried parsley ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large slow cooker combine tomato sauce, tomato paste, garlic, onion, rosemary, oregano, thyme, parsley, bay leaf and red pepper. Cook on high for 3 to 4 hours, stir frequently.\n",
        "picture_link": "W/y07RV.RpsvX3Fc8bZ.qlkXz87LzEW"
    },
    {
        "title": "Caramel Corn Snack Mix",
        "ingredients": [
            "8 cups popped popcorn ADVERTISEMENT",
            "4 cups crispy rice cereal squares ADVERTISEMENT",
            "2 cups small pretzel twists ADVERTISEMENT",
            "1 cup pecan halves ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nIn a large bowl, combine the popcorn, cereal, pretzels and pecans.\nIn a saucepan over medium heat, combine the brown sugar, butter and corn syrup. Cook and stir until mixture comes to a boil. Reduce heat to medium low; cook without stirring for 5 minutes.\nRemove saucepan from heat and stir in vanilla and baking soda. Pour over popcorn mixture and toss until evenly coated.\nBake at 300 degrees F (150 degrees F) for 30 minutes, stirring after 15 minutes. Transfer to large piece of parchment paper and cool completely. Break into chunks once cool.\n",
        "picture_link": "lorr4nlrrSi8oS.ORR1VVy00r3Su/4a"
    },
    {
        "title": "Santa Fe Soup",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 pound processed cheese food (eg. Velveeta), cubed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn ADVERTISEMENT",
            "2 (15 ounce) cans ranch-style beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown ground beef and drain off fat.\nIn a large stock pot combine browned beef, diced onion, tomatoes with liquid, stewed tomatoes with chilies, corn with liquid, Ranch-style beans with liquid, and cubed processed cheese Simmer on low heat until the cheese is melted and the onion is tender. Serve hot..\n",
        "picture_link": "mABZIlHpTFZvRdM3WnAvHyFkeVfQwdG"
    },
    {
        "title": "Grilled Vegetables in Balsamic Tomato Sauce with Couscous",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 red bell pepper ADVERTISEMENT",
            "1 zucchini ADVERTISEMENT",
            "1 small eggplant ADVERTISEMENT",
            "1 large sweet onion ADVERTISEMENT",
            "3/4 cup frozen broad beans ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 cup couscous ADVERTISEMENT",
            "1 cup vegetable stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the seeds from the pepper, and chop into strips about 1 to 2 inches long. Cut the eggplant crossways into rounds about 1/3 to 1/2 inch thick, and cut each one into 6 to 8 even chunks. Peel the onion, and chop into 8 portions. Trim the zucchini, and cut into thick slices.\nHeat grill pan over a high heat with a generous splash of olive oil. When it is very hot, add all the vegetables to the pan. Press down occasionally to get grill lines across them. Turn occasionally to prevent burning. Cook for about 15 minutes, or until the vegetables are evenly browned and cooked through.\nStir broad beans into the vegetables. Add chopped tomatoes, and vinegar. Simmer for a few minutes while the couscous is prepared.\nPlace couscous into a medium bowl. Add boiling vegetable stock, and stir with a fork. Keep lifting the couscous occasionally to prevent it sticking. It only takes 2 to 3 minutes to become soft. Place couscous in a large bowl or serving platter, and serve the vegetables on top.\n",
        "picture_link": "dg5afw7OqWuMwHNV.33ctVfZJcETZ/m"
    },
    {
        "title": "Peanut Butter Pie X",
        "ingredients": [
            "2 cups chocolate cookie crumbs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "12 ounces cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups heavy whipping cream ADVERTISEMENT",
            "3/4 cup semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Make crust.\nIn a large bowl, combine chocolate crumbs, 1/2 cup sugar and 1/2 cup butter and press into a 10 inch round springform pan or fluted pie pan. Bake for 10 minutes. Remove from oven and cool.\nIn a large bowl, combine the cream cheese, peanut butter, sugar and vanilla. Beat on medium speed until smooth.\nIn a separate bowl, beat whipping cream until stiff peaks form. Fold into peanut butter mix. Pour into pie crust. In a microwave-safe bowl, microwave chocolate chips until melted. Stir occasionally until chocolate is smooth. Drizzle melted chocolate on top of pie.\nRefrigerate 4 hours or until set.\n",
        "picture_link": "RLXh6x4t.eGIjGZAKHk8aKfOM86Ki3S"
    },
    {
        "title": "Hearty Meatball Soup I",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cube beef bouillon cube ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "4 carrots, coarsely chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (11 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the ground turkey, egg, onion, garlic salt, and pepper. Form meatballs using a tablespoon measure.\nHeat the oil in a skillet over medium heat. Brown meatballs in oil. Transfer meatballs to a paper towel to drain.\nIn a soup pot, dissolve the bouillon cube in the boiling water. Stir in the undiluted mushroom soup. Add the carrots, celery, onion, and corn. Add the meatballs to the soup, and bring to a boil. Reduce heat, and simmer 25 to 30 minutes.\n",
        "picture_link": "4mkxJGjz9FV60I5o3soGSsbMYtJxsfq"
    },
    {
        "title": "Steamed Radishes",
        "ingredients": [
            "20 radishes ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim the ends off of the radishes and peel a band of radish-skin from around the middle of the radish.\nSteam the radishes in a covered microwave safe container for 8 minutes, or until fork tender. Drain and toss with butter, serve immediately.\n",
        "picture_link": "YSt65H6ipIheLM/Ey9FQeyZmxySdcAq"
    },
    {
        "title": "Amish Sugar Cookies",
        "ingredients": [
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together vegetable oil (yes, 1 1/2 cups of vegetable oil), sugar and eggs. Mix in the flour, baking soda, baking powder, buttermilk, salt and vanilla.\nPour teaspoon-sized amounts of batter onto cookie sheets, leaving plenty of room in between. These cookies will puff up and get large.\nBake for 8 to 10 minutes.\n",
        "picture_link": "ve6UOeNAAB4cYIKcdI4mnC9bYH2O1tG"
    },
    {
        "title": "Peanut Sauce I",
        "ingredients": [
            "1 cup natural peanut butter ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup tamari ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, whisk together peanut butter and water over low heat. Stir in vinegar, tamari, molasses, and cayenne pepper. Heat through, but do not simmer or boil; cooking can cause the sauce to curdle.\n",
        "picture_link": "2z53DFrjtOXKYau/lRX/QhUAAh1eRZ6"
    },
    {
        "title": "Cappuccino Bon-Bons",
        "ingredients": [
            "1 (19.8 ounce) package brownie mix ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 1/2 tablespoons instant coffee powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place mini muffin liners into pans.\nIn a medium bowl, stir together the eggs, oil, and water. Add the brownie mix and stir until combined. Finally, stir in the instant coffee and cinnamon.\nFill the muffin liners halfway to the top. Bake for 10 to 12 minutes in the preheated oven. Test for doneness with a toothpick. When the bon-bons are completely cool, dust with confectioners' sugar.\n",
        "picture_link": "jq0YHOy6P/D/1gEfot5YnGO5eBB1nH."
    }
]