[
    {
        "title": "Buffalo Chicken Mac and Cheese",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 (12 fluid ounce) bottle Buffalo wing sauce (such as Frank's®) ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "1 rotisserie chicken, meat removed and chopped ADVERTISEMENT",
            "2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nStir sour cream and cream cheese together in a bowl until smooth; add evaporated milk. Stir Buffalo wing sauce and ranch dressing into sour cream mixture; mix in shredded chicken, macaroni, and 1 1/2 cups Cheddar cheese. Pour macaroni mixture into prepared baking dish. Top with bread crumbs and remaining 1/2 cup Cheddar cheese; drizzle melted butter over the top.\nBake in the preheated oven until bubbling and golden, 20 to 30 minutes.\n",
        "picture_link": ".etjBG3oaPnYkrM9KITBRRvBIO/rJiC"
    },
    {
        "title": "Dark Guinness® Brownies",
        "ingredients": [
            "cooking spray with flour ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup dark cocoa powder (such as Hershey's® Special Dark) ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "8 ounces bittersweet chocolate (such as Ghirardelli®), chopped ADVERTISEMENT",
            "3/4 cup white chocolate chips (such as Ghirardelli®) ADVERTISEMENT",
            "6 tablespoons butter at room temperature, cut into cubes ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 eggs, room temperature ADVERTISEMENT",
            "1 1/4 cups Irish stout beer (such as Guinness® Extra Stout), room temperature and foam skimmed off ADVERTISEMENT",
            "1/2 cup chopped pecans (optional) ADVERTISEMENT",
            "1 cup semisweet chocolate chips (such as Nestle® Toll House®) ADVERTISEMENT",
            "1 tablespoon sifted confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place oven rack in the center position. Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nWhisk flour, cocoa powder, and salt together in a bowl.\nMelt bittersweet chocolate, white chocolate chips, and butter in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove from heat.\nBeat white sugar and eggs together in a large bowl with an electric mixer until light and fluffy, about 3 minutes. Slowly add melted chocolate mixture and beat until just combined. Add flour mixture, 2 to 3 tablespoons at a time, until just combined. Whisk in beer until batter is thin; fold in pecans.\nPour batter into the prepared baking dish; sprinkle semisweet chocolate chips over batter.\nBake in the preheated oven until a toothpick inserted in the center of the brownies comes out with moist crumbs, 25 to 30 minutes. Cool to room temperature; dust top with confectioners' sugar.\n",
        "picture_link": "qPCXU/PU5b0La4zEbEMDFi/iclh07jm"
    },
    {
        "title": "Almond 'You Must Be Nuts!' Crackers",
        "ingredients": [
            "1 cup almond flour ADVERTISEMENT",
            "2 tablespoons finely chopped walnuts ADVERTISEMENT",
            "1 1/2 teaspoons flax seed meal ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 1/2 teaspoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nMix almond flour, walnuts, flax seed meal, and salt together in a bowl until well combined. Add water and olive oil; mix until dough is moist and holds together.\nTurn dough onto prepared baking sheet. Place a second piece of parchment over dough. Roll dough, using a rolling pin, into a 1/16-inch thick rectangle. Remove top piece of parchment paper and cut sides of dough to make an even rectangle. Add excess dough to corners or 1 end of rectangle and re-roll to uniform thickness.\nCut dough into 1-inch squares using a pizza cutter, keeping dough still attached.\nBake in the preheated oven until outside edges of dough are browned, about 15 minutes. Cool crackers on the baking sheet; break into squares.\n",
        "picture_link": "BpL6hnaYUpPb0wnKZ9PEJvxhuvaI2yu"
    },
    {
        "title": "Uncle Dick's Mashed Potatoes",
        "ingredients": [
            "4 pounds potatoes, peeled and cut into chunks ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes; drain and transfer potatoes to a large bowl.\nMash sour cream, cream cheese, salt, white pepper, and garlic into the potatoes with a potato masher to your desired consistency; transfer to a baking dish, cover with plastic wrap and refrigerate 8 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nDrizzle melted butter and sprinkle paprika evenly over the top of the potatoes.\nBake in preheated oven until hot in the center, about 30 minutes. Garnish with chives.\n",
        "picture_link": "DqDmdBiyYhl/4t2Z7i8/atQxtIl5Q0u"
    },
    {
        "title": "Chef John's Homemade Croutons ",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "4 cloves garlic, finely minced ADVERTISEMENT",
            "1 (8 ounce) loaf French bread baguette, cut into 1/2-inch cubes ADVERTISEMENT",
            "3/4 cup finely grated Parmigiano-Reggiano cheese, divided ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300. Line a baking sheet with a silicone baking mat.\nStir olive oil and garlic together in a bowl. Let sit at room temperature until flavors are infused, about 3 hours.\nPlace bread cubes in a large bowl. Pour garlic oil through a strainer onto the bread; toss to coat bread with oil. Add 1/2 cup Parmigiano-Reggiano cheese, Italian seasoning, paprika, black pepper, salt, and cayenne pepper; toss to coat. Spread bread cubes out in a single layer on the prepared baking sheet.\nBake in the preheated oven for 15 minutes. Turn croutons and bake 15 minutes more. Push croutons together with a spatula so that they are in a compact rectangle on the baking sheet and no longer spread out; sprinkle remaining 1/4 cup cheese over the top. Bake until cheese is melted and the bread is crispy and crunchy, 10 to 15 minutes more.\n",
        "picture_link": "sOQlOFWEazwmrzOIxMEjXZNuGKbjEVa"
    },
    {
        "title": "Best Cream Of Broccoli and Potato Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "5 cloves garlic, crushed ADVERTISEMENT",
            "1 large white potato, cubed ADVERTISEMENT",
            "8 cups broccoli florets and stems ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 2 tablespoons butter in a stockpot over medium heat; cook and stir onion and garlic in the melted butter until tender, 8 to 10 minutes. Add potato and broccoli stems; generously season with salt and pepper. Pour broth into potato mixture, cover, and simmer until potatoes are softened, about 10 minutes.\nMix broccoli florets into soup and simmer until broccoli is tender, about 5 minutes. Blend soup with an immersion blender until smooth.\nMelt 3 tablespoons butter in a small saucepan over medium heat; whisk flour, milk, and heavy cream into melted butter. Season with salt and pepper. Whisk milk mixture until bubbling and thickened, about 5 minutes. Whisk thickened milk mixture into soup until incorporated; adjust salt and pepper.\n",
        "picture_link": "uGw0rQemsi8U1GwmWNjeOPizCdP56E6"
    },
    {
        "title": "Italian Spaghetti Squash",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1 spaghetti squash, halved and seeded ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with onion, celery, and green pepper ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese, plus more for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPour water in baking dish and place halved squash cut-sides down in the dish.\nBake squash in preheated oven until a fork pierces the skin very easily, about 45 minutes. Let squash cook while preparing remainder of recipe.\nMelt butter with olive oil in a large skillet over medium-high heat. Saute onion in hot butter until softened, about 5 minutes. Add garlic and continue to saute until fragrant, about 1 minute more. Pour diced tomatoes over the onion mixture; season with basil. Place a cover on the skillet, reduce heat to medium-low, and cook at a simmer until the tomatoes are soft, about 30 minutes; season with salt and pepper.\nOnce squash is cool enough to handle, use a fork to strip flesh from the skin in strands. Stir squash and Parmesan cheese into tomato mixture. Replace cover on skillet and cook until squash is heated through, 5 to 10 minutes more. Sprinkle additional Parmesan cheese over the dish to serve.\n",
        "picture_link": "9R44mIGE2BzraDUlTeOeSrM3lAA4a62"
    },
    {
        "title": "Meaty Stuffed Pepper Casserole",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "6 small green bell peppers, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 pound ground Italian sausage ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch dried oregano, or to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "1 cup cooked white rice ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "1/4 (10.75 ounce) can water ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt butter in a large pot over medium heat; cook and stir green bell peppers, onion, and garlic in the hot butter until vegetables are slightly soft, 2 minutes. Stir sausage and ground beef into bell pepper mixture; cook until meat is crumbly and browned, stirring often, 10 to 12 minutes. Drain grease. Season mixture with salt, black pepper, oregano, and garlic powder.\nMix diced tomatoes, rice, tomato paste, and Worcestershire sauce into meat mixture and bring to a simmer; cook until heated through, about 5 minutes, stirring occasionally. Pour mixture into a large baking dish.\nWhisk tomato soup with water in a bowl until smooth; pour soup over meat mixture. Spread Cheddar cheese over casserole.\nBake in the preheated oven until casserole is heated through and Cheddar cheese is browned and bubbling, about 30 minutes.\n",
        "picture_link": "EJBqPbJNOEEDzZzS0oJ6VYaYakCrO8a"
    },
    {
        "title": "Chicken Pot Pie Casserole",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "3 cups frozen shredded hash browns ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 cup chopped cooked chicken ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9-inch square baking dish.\nBeat eggs together in a bowl. Add hash browns and mix well; season with salt and pepper. Press hash brown mixture into the prepared baking dish.\nBake in the preheated oven until crust is lightly browned, about 15 minutes.\nMix vegetables, cream of mushroom soup, and chicken together in a bowl and spread over the crust; top with bread crumbs. Drizzle butter over bread crumb layer and season with salt and pepper.\nBake in the preheated oven until heated through and bread crumbs are lightly browned, about 30 minutes.\n",
        "picture_link": "oJIcbnqoVUKzPNaZE4TwT9F9wH7xW/a"
    },
    {
        "title": "NO YOLKS® Tuna Noodle Casserole",
        "ingredients": [
            "6 ounces NO YOLKS® Extra Broad Noodles ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "2 ribs celery, chopped ADVERTISEMENT",
            "1 1/2 cups frozen peas, thawed ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 quart vegetable broth ADVERTISEMENT",
            "Dash Worcestershire sauce ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "1 (8 ounce) package light cream cheese, softened ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 (5 ounce) cans tuna, drained and flaked ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "Fresh ground black pepper to taste (optional) ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "Salt and pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine topping ingredients and set aside.\nPreheat oven to 400 degrees F. Add olive oil to a 7-quart stock pot, and saute mushrooms, celery, onions and garlic powder for 3-4 minutes over medium heat. Add broth, Worcestershire sauce and thyme sprig and bring to a boil, stirring occasionally. Add cream cheese and noodles, stirring until creamy and smooth. Sprinkle flour over top of mixture. Stir and cook for 2 minutes, or until mixture begins to thicken. Fold in tuna and peas. Season with salt and pepper.\nPour into a 3-quart casserole dish. Sprinkle on Cheddar cheese and topping mixture. Bake uncovered 15 minutes. Remove from oven and let stand 10 minutes.\n",
        "picture_link": "oSSwhSCzoYn1yIzpFaE.5leBKznJtfi"
    },
    {
        "title": "Roasted Butternut Squash with Onions, Spinach, and Craisins®",
        "ingredients": [
            "1 butternut squash ADVERTISEMENT",
            "1 cup chopped red onion ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 ounces fresh spinach, stems removed and leaves torn in bite-size pieces ADVERTISEMENT",
            "1/3 cup sweetened dried cranberries (such as Craisins®) ADVERTISEMENT",
            "1/3 cup chopped pecans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Lightly grease a baking sheet.\nSlice butternut squash cross-wise into 1-inch slices; peel and clean each slice, removing and discarding seeds and stringy pulp from the center. Cut cleaned slices into 1-inch cubes.\nToss squash cubes, onion, and olive oil together in a bowl until coated; transfer to the prepared baking sheet.\nRoast in the preheated oven until squash is tender and starting to brown, 25 to 30 minutes.\nToss squash mixture, spinach, dried cranberries, and pecans together in a serving bowl and serve warm.\n",
        "picture_link": "bYejg.DOiFvgQ3E2e5FyvX5oj6ihRke"
    },
    {
        "title": "Pancake Casserole",
        "ingredients": [
            "2 cups baking mix (such as Bisquick ®) ADVERTISEMENT",
            "2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "5 tablespoons maple syrup ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "12 slices cooked bacon, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nMix baking mix, 1 cup Cheddar cheese, milk, maple syrup, eggs, and sugar together in a bowl; pour into prepared pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 20 to 25 minutes. Sprinkle bacon and remaining 1 cup Cheddar cheese over casserole; return to oven until cheese is melted, about 5 more minutes.\n",
        "picture_link": "oyfGRpwZ9FdZpu400FkK8wt3zI7Tmpu"
    },
    {
        "title": "Roast Peruvian Turkey ",
        "ingredients": [
            "1 (12 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "Spice rub: ADVERTISEMENT",
            "1/2 cup ground cumin ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "12 cloves garlic, peeled ADVERTISEMENT",
            "3 tablespoons paprika ADVERTISEMENT",
            "2 tablespoons freshly ground black pepper ADVERTISEMENT",
            "1 tablespoon smoked paprika ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "2 teaspoons kosher salt, or as needed ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 teaspoons water, or as needed ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 (8 ounce) container creme fraiche ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 jalapeno peppers, stemmed ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pat turkey dry with paper towels. Loosen skin over each side of breastbone with a spatula inserted beneath skin.\nPlace cumin, soy sauce, vinegar, vegetable oil, garlic, paprika, black pepper, smoked paprika, and oregano into a blender. Blend spice rub into a thick paste, about 1 minute. Set aside 1/2 cup of rub in a bowl for a later step; pour remaining rub all over turkey and use a spatula to work about 2 tablespoons of mixture beneath the loosened skin on each side of the breast. Rub the mixture over every nook and cranny of turkey. Let turkey stand for 1 hour at room temperature.\nPreheat oven to 325 degrees F (165 degrees C). Fold a piece of aluminum foil into a rounded piece about the size of the turkey breast; set foil aside.\nPlace turkey onto a rack set in a large roasting pan. Tie legs together at the bottom with a piece of kitchen twine. Spread 1/4 cup of reserved wet rub into cavity of turkey; retain remaining 1/4 cup for later. Sprinkle entire top and sides of turkey with kosher salt.\nRoast turkey in the preheated oven for 1 1/2 hours; place foil tent on turkey breast. Return to oven and continue to roast for about 1 hour and 15 more minutes. Combine remaining 1/4 cup of spice rub with 1 tablespoon vegetable oil and water in a small bowl. Brush mixture over turkey's top, legs, and sides. Roast until until an instant-read meat thermometer inserted into the thickest part of a thigh, not touching bone, reads 170 to 175 degrees F (75 to 80 degrees C), about 30 more minutes. Transfer turkey to a serving platter and let rest for at least 20 minutes, reserving drippings in roasting pan.\nPlace creme fraiche, chicken broth, lime juice, jalapeno peppers, and cilantro into a blender and blend until smooth. Pour excess grease out of turkey roasting pan, pour in creme fraiche mixture, and place the roasting pan over a burner set over medium-high heat. Scrape the browned pan drippings into the sauce mixture, bring to a boil, and cook until gravy is reduced by half and thickened, about 10 minutes. Whisk often to prevent lumps. Season gravy with salt, black pepper, and cayenne pepper. Carve and serve turkey with pan gravy.\n",
        "picture_link": "rtAgLJAjcCnUjWCB2EcMsf5jZHnfaRq"
    },
    {
        "title": "California Club Chicken Wraps",
        "ingredients": [
            "Chipotle Mayonnaise: ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "2 chipotle chiles in adobo sauce, finely chopped ADVERTISEMENT",
            "Wraps: ADVERTISEMENT",
            "2 large spinach tortillas ADVERTISEMENT",
            "1/2 cup shredded lettuce, or to taste ADVERTISEMENT",
            "1 1/2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "1 Haas avocado - peeled, pitted, and diced ADVERTISEMENT",
            "4 slices cooked bacon, chopped ADVERTISEMENT",
            "1 red onion, finely chopped ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "2 cooked chicken breasts, cut into chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, yogurt, and chipotle chiles together in a bowl.\nCook tortillas in the microwave until warm and pliable, about 30 seconds.\nSpread 1 tablespoon chipotle mayonnaise down the center of each tortilla. Spread 1/2 the lettuce, 1/2 the Monterey Jack cheese, 1/2 the avocado, 1/2 the bacon, 1/2 the red onion, 1/2 the tomato, and 1/2 the chicken, respectively, in the center of each tortilla. Fold opposing edges of the tortilla to overlap the filling. Roll 1 of the opposing edges around the filling into a wrap.\n",
        "picture_link": "Cb9W8W.YWEEoZJ5m8PohkhwdJI6wmYC"
    },
    {
        "title": "Chef John's Dark Chocolate Mousse ",
        "ingredients": [
            "3 1/2 ounces dark chocolate, chopped ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/8 teaspoon ground dried chipotle pepper ADVERTISEMENT",
            "1 tiny pinch salt ADVERTISEMENT",
            "2 large egg yolks ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 cup heavy whipping cream, chilled ADVERTISEMENT",
            "1 tablespoon heavy whipping cream, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of water to a simmer over low heat. Place chocolate, butter, 2 tablespoons water, ground chipotle pepper, and salt in a heatproof bowl; set bowl over the simmering water. When the butter melts, whisk the chocolate mixture gently until smooth and shiny. Set aside to cool for a few minutes.\nWhisk egg yolks, 2 tablespoons water, and sugar in another heatproof bowl over the same pan of simmering water until egg yolk mixture is foamy and hot to the touch, about 3 minutes. Pour hot egg mixture into warm chocolate mixture, whisk until smooth, and set over a bowl of ice to chill. Whisk constantly until mixture has cooled to room temperature or slightly cooler.\nPour 1/2 cup and 1 tablespoon cold cream into a chilled metal bowl; whisk until cream holds soft peaks. Place about half the whipped cream into the cooled chocolate mixture; gently fold the cream into the chocolate. Repeat with remaining half of whipped cream, folding gently until nearly all the streaks have disappeared. Divide mousse into 4 6-ounce ramekins.\nCover each ramekin with plastic wrap and refrigerate at least 4 hours (up to overnight) before serving.\n",
        "picture_link": "b2oUVPqM8brE/W6Kdfw/JzKvGFlSzDq"
    },
    {
        "title": "Creamy Garlic and Onion Spaghetti",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "3 white onions, halved and thinly sliced ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (12 ounce) package spaghetti ADVERTISEMENT",
            "1/2 cup dry Chardonnay ADVERTISEMENT",
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "cracked black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter with olive oil in a saucepan over low heat. Stir onions, garlic, sugar, and salt into the hot butter and oil. Cover pan and cook until onions are soft and translucent, stirring occasionally, about 20 minutes.\nMeanwhile, bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 7 minutes. Drain and keep warm.\nPour Chardonnay into onion mixture and bring to a boil; reduce heat to low and simmer until evaporated, 2 to 3 minutes. Stir heavy cream into mixture and simmer until slightly thickened, about 2 minutes.\nTransfer spaghetti to a serving bowl and pour onion sauce over pasta; sprinkle with Parmesan cheese and black pepper. Toss to coat.\n",
        "picture_link": "6lKuP7G/5An5wOYdN954/MR1d2qtOdu"
    },
    {
        "title": "Quick Banana Milkshake (Ice Cream Free)",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 ice cubes ADVERTISEMENT",
            "1 tablespoon white sugar, or to taste ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put banana, milk, ice, sugar, and cinnamon in a blender; puree until smooth.\n",
        "picture_link": "RCSvYZden3N4L3lUyEh2/vi66JEr5oK"
    },
    {
        "title": "Fluffy Gluten Free Cornbread",
        "ingredients": [
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 1/2 cups lukewarm water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 1/2 cups fine cornmeal ADVERTISEMENT",
            "1 cup millet flour ADVERTISEMENT",
            "1 cup rice flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Grease a 9x9 inch baking pan.\nWhisk together the eggs, water, and vegetable oil in a bowl until evenly blended; set aside. Stir together the cornmeal, millet flour, rice flour, sugar, baking powder and salt in a separate large bowl, and make a well in the center. Pour the liquid mixture into the well and stir just until combined.\nPour the batter into the prepared baking pan and bake in the preheated oven until golden and the top springs back when lightly pressed, about 20 minutes.\n",
        "picture_link": "3l2vJ3yzjLDANecFZL7TmranP54pUn6"
    },
    {
        "title": "Buffalo Casserole",
        "ingredients": [
            "1 (8 ounce) carton sour cream ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "3 tablespoons hot pepper sauce ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 cups cubed, cooked chicken ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix the sour cream, onion powder, garlic powder, dill, and parsley in a large bowl until combined; stir in the cream cheese, Cheddar cheese, and hot pepper sauce. Mix in the chicken broth, a little at a time, and gently stir in the rice and cooked chicken. Scrape into a 2-quart casserole dish.\nBake in the preheated oven until the casserole is browned and the rice is tender, about 1 hour.\n",
        "picture_link": "xLIxe.tb2wZ68Excqc4WXaTm3dafwW."
    },
    {
        "title": "Brandy's Blackberry Cobbler",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter at room temperature ADVERTISEMENT",
            "3 tablespoons ice water ADVERTISEMENT",
            "4 cups blackberries ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "6 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup cold butter, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nWhisk 1 cup of flour with the salt in a mixing bowl. Mix in the softened butter until the mixture resembles cornmeal. Stir in the ice water until a dough forms. Refrigerate until ready to use.\nPlace the berries in a mixing bowl, and sprinkle with 1 1/4 cups sugar and 6 tablespoons of flour. Stir in the water until moistened, and scrape into a 2-quart baking dish. Roll the dough on a floured work surface to 1/4-inch thick, and cut into 3/4-inch strips. Place onto the berries in a crisscross pattern. Scatter the diced butter over top.\nBake in the preheated oven until the berries are tender and the crust is golden brown, about 30 minutes.\n",
        "picture_link": "hxG65ZcVt0PjeY/grAJL9vahdtgq5.u"
    },
    {
        "title": "Chicken Breasts in a Date, Caper, and Mascarpone Sauce with Couscous",
        "ingredients": [
            "1 skinless, boneless chicken breast half ADVERTISEMENT",
            "1/2 cup couscous ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 tablespoon salted butter ADVERTISEMENT",
            "1/4 cup capers, drained ADVERTISEMENT",
            "3 dates, pitted and chopped ADVERTISEMENT",
            "1/4 cup mascarpone cheese ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "1 date, pitted and chopped ADVERTISEMENT",
            "1/4 cucumber, diced ADVERTISEMENT",
            "1/2 tomato, diced ADVERTISEMENT",
            "1 teaspoon lemon juice (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat, and lightly oil the grate.\nGrill the chicken breast until the meat is no longer pink inside and shows well-defined grill marks, 5 to 8 minutes per side. Cut the chicken breast in half, and set aside.\nBring the water, unsalted butter, and a pinch of salt to a boil in a saucepan over high heat. Remove from the heat, and stir in the couscous. Cover and let stand for 10 minutes, then fluff with a fork.\nMelt the salted butter in a skillet over medium heat, and gently stir in the capers and 3 dates. Stir a few times to heat the capers and dates, then stir in the mascarpone cheese and cream, stirring until the cheese and cream have melted together. Allow the mixture to simmer for about 3 minutes to reduce slightly, then season to taste with salt and pepper.\nPlace the couscous on a serving platter, and sprinkle with a chopped date. Arrange the 2 pieces of chicken breast onto the couscous, and cover with the mascarpone sauce. Sprinkle the dish with diced cucumber and tomato, and drizzle lemon juice over the top to serve.\n",
        "picture_link": "BpKM6OfAE47FfmcGa./h0SdLSFGOo/W"
    },
    {
        "title": "Zippy and Tangy Turkey Rice Soup",
        "ingredients": [
            "1 leftover turkey carcass, broken into pieces ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 tablespoon chopped celery leaves, or to taste ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "28 baby carrots, quartered ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes with juice ADVERTISEMENT",
            "1 cup long-grain rice ADVERTISEMENT",
            "10 green beans, cut into bite-size pieces ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1 tablespoon dried marjoram ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "2 sprigs fresh rosemary ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place turkey carcass pieces into a large soup pot and cover with cold water. Stir in onion, celery leaves, and bay leaves, bring to a boil, and reduce heat to medium-low. Simmer for 2 hours. Strain broth and pour back into soup pot. Pick turkey meat from the carcass and chop meat into bite-size pieces.\nHeat butter in a skillet; cook and stir carrots and celery until tender, about 8 minutes. Stir carrots, celery, stewed tomatoes with juice, rice, green beans, chicken bouillon cubes, marjoram, thyme, rosemary, ginger, cayenne pepper, salt, and black pepper into broth. Mix in chopped turkey meat.\nBring soup back to a boil, reduce heat to low, and simmer until rice is tender, 30 to 35 minutes. Remove and discard rosemary sprigs; stir corn into soup. Adjust salt, cayenne pepper, and black pepper to taste. Lay a paper towel on top of soup to absorb excess oil, if desired.\n",
        "picture_link": "ZxP5AO5qKkjoX8mZCgutLsyQYKc54Qi"
    },
    {
        "title": "Slow Cooker Texas Smoked Beef Brisket",
        "ingredients": [
            "Brisket Rub: ADVERTISEMENT",
            "3 tablespoons smoked paprika ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "2 tablespoons kosher salt ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 1/2 pounds beef brisket ADVERTISEMENT",
            "Barbeque Sauce: ADVERTISEMENT",
            "3/4 cup barbeque sauce ADVERTISEMENT",
            "1/4 cup water (optional) ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "1/2 onion, sliced into rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix paprika, pepper, salt, brown sugar, chili powder, and cumin together in a bowl; rub evenly over the surface of the brisket. Put brisket in a large, resealable plastic bag; refrigerate 30 minutes to overnight.\nStir barbeque sauce, water, Worcestershire sauce, and liquid smoke together in the bottom of a slow cooker. Lay brisket into the sauce mixture. Arrange onions atop the brisket.\nCook on Low until brisket is very tender, 6 to 7 hours. Rest brisket 10 minutes before slicing or shredding; serve with sauce from the slow cooker.\n",
        "picture_link": "x6n9J5KbhH8JWtnVI63TZi5JWRNrUaO"
    },
    {
        "title": "Slow Cooker White Chili with Chicken",
        "ingredients": [
            "1/2 pound dried Great Northern beans ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 tablespoon chopped jalapeno pepper ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground oregano ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 tomato, chopped (optional) ADVERTISEMENT",
            "4 ounces shredded Mexican cheese blend (optional) ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place Great Northern beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse beans.\nPlace beans, chicken, onion, chicken broth, jalapeno pepper, cumin, oregano, and garlic powder in a slow cooker.\nCook on High for 4 hours or on Low for 8 hours. Remove chicken breasts from the chili and place on a work surface; shred chicken breasts with a fork and mix back into chili.\nSpoon chili into 4 bowls; top each serving with 1/4 of the chopped tomato, 1 ounce Mexican cheese blend, and 1 tablespoon chopped cilantro.\n",
        "picture_link": "kiiyeZZTIun3BueCXflkI08of/UKMvy"
    },
    {
        "title": "Ghirardelli Chocolate Raspberry Cheesecake Hearts",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 1/2 cups chocolate graham cracker crumbs ADVERTISEMENT",
            "1/2 cup ground almonds ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "Cheesecake: ADVERTISEMENT",
            "4 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "Raspberry puree (recipe below) ADVERTISEMENT",
            "2 cups Ghirardelli® 60% Cacao Bittersweet Chocolate Chips ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "Raspberry puree: ADVERTISEMENT",
            "1 (10 ounce) package frozen raspberries ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "Chocolate Ganache (optional): ADVERTISEMENT",
            "8 ounces Ghirardelli® 60% Cacao Bittersweet Chocolate Chips ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "Additional Garnishes (optional): ADVERTISEMENT",
            "Fresh raspberries ADVERTISEMENT",
            "8 ounces white chocolate, melted for drizzling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat over to 325 degrees F (165 degrees C).\nCRUST: In a microwave safe bowl, melt the butter. Add the chocolate graham crackers, ground almonds, and sugar and mix until combined. Press mixture into the bottom of a 9-inch springform pan and set aside.\nPUREE: In a saucepan, combine raspberries and sugar. Bring to boil, and continue boiling 3-5 minutes, or until sauce is thick. Strain sauce through a mesh strainer to remove seeds and set aside.\nCHEESECAKE: In a small pot over low heat, bring the whipping cream to just boiling. Remove from heat and add the chocolate chips. Set aside for 5 minutes and then stir until smooth.\nIn a large bowl, mix together cream cheese and 3/4 cup sugar until smooth. Beat in eggs, one at a time. Remove approximately 1 1/2 cup of this batter and place into a smaller bowl and add 1/2 cup raspberry puree. Blend until combined. Add the melted chocolate to the remaining batter and mix until combined. Pour the chocolate cheesecake batter into the pan. Very carefully layer the raspberry cheesecake mixture on top of the chocolate mixture. Bake for 60 to 75 minutes, or until filling is set. Cool in pan, then cover with plastic wrap and refrigerate until cold before removing from pan.\n",
        "picture_link": "/k/Q/i/GMZJ8o0pwJLj8xt63Pu97gBe"
    },
    {
        "title": "Susan's Vinaigrette Coleslaw",
        "ingredients": [
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "3 tablespoons canola oil ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "1/4 teaspoon poppy seeds ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon hot pepper sauce (optional) ADVERTISEMENT",
            "4 cups shredded green cabbage ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk apple cider vinegar, canola oil, sugar, dry mustard, poppy seeds, black pepper, salt, and hot pepper sauce in a bowl, stirring until sugar has dissolved.\nMix cabbage with carrots in a large salad bowl and pour dressing over slaw. Stir to coat. Refrigerate at least 2 hours before serving.\n",
        "picture_link": "OyysX6Wba0ZFfJ7mXne4SgLTmBl91Ny"
    },
    {
        "title": "Apple Pancake",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 large apple, cored and sliced ADVERTISEMENT",
            "1/2 cup white sugar, divided ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in an oven-safe skillet over medium heat; cook and stir apple slices, about 1/4 cup sugar, and cinnamon in butter until apples are tender, about 5 minutes.\nBeat eggs, milk, flour, remaining 1/4 cup sugar, baking powder, vanilla extract, and salt in a large bowl until batter is smooth; pour batter evenly over apples.\nBake in the preheated oven until golden brown, about 10 minutes. Run a spatula around the edges of the pancake to loosen. Invert skillet over a large plate to serve.\n",
        "picture_link": "J50Nbt2fYxNdrs1JJ.eCd6aLn3Shc12"
    },
    {
        "title": "Almond Butter Cookies",
        "ingredients": [
            "Cooking spray ADVERTISEMENT",
            "3/4 cup all purpose flour ADVERTISEMENT",
            "1/2 cup whole wheat pastry flour, or regular whole wheat flour ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup unsalted butter, softened ADVERTISEMENT",
            "3/4 cup smooth, unsalted almond butter ADVERTISEMENT",
            "1/3 cup packed light brown sugar ADVERTISEMENT",
            "1/3 cup granulated sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "36 raw whole almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees. Spray two baking sheets with cooking spray. In a large bowl whisk together the flours, salt and baking soda. In another large bowl beat together the butter, almond butter and sugars until fluffy. Add the vanilla and egg and beat until well combined. Gradually stir in the flour mixture, blending well.\nShape the dough into 3/4 inch balls, and place on the baking sheets. Place an almond in center of each cookie and press down lightly. Bake for 10-12 minutes, until lightly browned. Cool on a wire rack.\n",
        "picture_link": "uSZbIL6o4KMUIU0HDlniVAYrDvD6JSe"
    },
    {
        "title": "Fast and Easy Turkey Pot Pie",
        "ingredients": [
            "1 (15 ounce) package pastry for a 9 inch double crust pie ADVERTISEMENT",
            "2 cups cooked turkey, cut into bite-size pieces ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1 teaspoon seasoned pepper blend ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables, thawed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line an 8-inch pie dish with 1 pastry crust; set the other crust aside.\nIn a bowl, mix together the turkey, cream of chicken soup, seasoned salt and pepper, Cheddar cheese, and mixed vegetables. Pour the mixture into the prepared pie dish. Top the pie with the remaining pie crust, then pinch and fold the edges of the crusts together to seal. Cut a slit into the top of the pie crust with a sharp knife to vent the steam.\nBake in the preheated oven until the crust is golden brown and the filling is bubbling, about 40 minutes.\n",
        "picture_link": "6HfluicCIzEzQvz.sci7rJDidpmSULO"
    },
    {
        "title": "Burek",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 tablespoon ground allspice ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "salt and freshly ground pepper to taste ADVERTISEMENT",
            "1 potato, finely chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (16 ounce) package phyllo dough ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nBrown ground beef in a large non-stick skillet over medium heat, 5 to 7 minutes. Drain fat; stir in allspice, paprika, salt, and pepper. Transfer beef to a large bowl and stir in potato and onion.\nUnroll phyllo pastry and transfer 2 sheets to a work surface; stack sheets. Spoon 1/8th of the ground beef mixture down one long edge of the phyllo pastry. Roll phyllo into a tube, encasing beef. Shape the tube into a coil (snail shape). Place the roll on an ungreased baking sheet; brush with melted butter. Repeat, placing finished rolls up against one another to keep them from unrolling.\nBake burek in the preheated oven until golden brown, 20 to 30 minutes.\n",
        "picture_link": "i7GqS4cQc8LYQhbhKyw9GwO9HerHiYq"
    },
    {
        "title": "Vanilla Spice Bread",
        "ingredients": [
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 cup dark brown sugar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/8 teaspoon ground cardamom ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "3 cups high-gluten bread flour ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, milk, vanilla extract, brown sugar, white sugar, cardamom, coriander, vegetable oil, and salt into the pan of a bread machine in that order. Pour the flour onto the other ingredients, and sprinkle the flour with yeast. Set the bread machine to the Dough cycle; turn on the machine.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch bread pan.\nWhen the Dough cycle is completed, remove the dough from the machine, punch down if necessary, form into a loaf, and place into the prepared bread pan with the seam side down. Cover and let rise until doubled, 20 to 30 minutes.\nBake in the preheated oven until the loaf is golden brown, 35 to 45 minutes. Let cool in the pan for 5 minutes before removing to finish cooling on a rack.\n",
        "picture_link": "KguH92tuJTiIzXJmTufmeb2zo8EaCHi"
    },
    {
        "title": "Red Velvet Crinkle Cookies",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "1 cup powdered sugar ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1 (18.25 ounce) box Duncan Hines® Red Velvet Cake Mix ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F. Melt butter; set aside to cool. Place powdered sugar and cornstarch in shallow dish. Mix with a fork to blend.\nPlace cake mix, cooled butter, eggs and lemon zest in large mixing bowl. Mix by hand until well blended and a dough forms.\nForm dough into 1-inch balls and roll in powdered sugar. Place on cool, ungreased baking sheets about 2 inches apart.\nBake, 1 sheet at a time, in center of oven for 9 to 11 minutes or until set. Cool 1 minute. Transfer to wire rack to cool completely.\nStore in airtight container with wax paper or parchment separating layers.\n",
        "picture_link": "3xlH3VBkNpzBEJm4JKZT3zvaBzpR4Ui"
    },
    {
        "title": "Savory Swiss Chard with Portobellos",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon crushed red pepper ADVERTISEMENT",
            "1 clove garlic, crushed and chopped ADVERTISEMENT",
            "1 (8 ounce) package portobello mushrooms, stemmed and cut into 1/2-inch wide by 2-inch long pieces ADVERTISEMENT",
            "1 leek, chopped ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 bunch Swiss chard, trimmed and chopped ADVERTISEMENT",
            "2 cups grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium-high heat. Stir in the red pepper, garlic, and portobello mushrooms. Cook and stir until the mushroom has softened and begun to release its liquid, 3 to 5 minutes. Stir in the leek, and continue cooking until the leek has softened, about 5 minutes.\nStir in the chicken broth and Swiss chard. Bring to a boil, then reduce heat to medium-low. Cover, and simmer until the chard leaves have wilted, about 10 minutes. Remove the lid, and continue cooking until the chard is tender and most of the liquid has evaporated, about 5 minutes. Sprinkle with the Parmesan cheese; let stand until melted.\n",
        "picture_link": "RpiI6XsN.eSbw3z38.8d.I4yaHcA49G"
    },
    {
        "title": "Southern Pork Tenderloin",
        "ingredients": [
            "2 cups panko bread crumbs ADVERTISEMENT",
            "1 tablespoon parsley flakes ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (1 pound) pork tenderloin, cut crosswise into 1/2-inch thick slices ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir panko bread crumbs, parsley flakes, garlic powder, onion powder, and black pepper together in a bowl. Dip tenderloin slices in the crumb mixture to coat both sides.\nHeat olive oil over medium-high heat in a skillet and fry the pork until the crumb coating is browned and the pork is no longer pink inside, 2 to 3 minutes per side. An instant-read meat thermometer inserted into the center of the pork should read at least 145 degrees F (65 degrees C).\n",
        "picture_link": "u1EX5MY/PvDvQQb90XML9NsHrLzbC8i"
    },
    {
        "title": "Coconut Avocado Smoothie",
        "ingredients": [
            "1 Hass avocado, diced ADVERTISEMENT",
            "1/2 cup low-fat vanilla yogurt ADVERTISEMENT",
            "1/2 cup whole milk ADVERTISEMENT",
            "1/4 cup cream of coconut ADVERTISEMENT",
            "8 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine avocado, yogurt, milk, cream of coconut, and ice cubes in a blender; blend until smooth.\n",
        "picture_link": "bZGuoYPBpiN9eigOhbF02uURDZgzOyi"
    },
    {
        "title": "Mexi-Cheesy Chip Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "8 ounces process cheese food, cubed ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 (15 ounce) can chili without beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese, processed cheese food, salsa, and chili in a large saucepan over a medium-low heat. Stir until the mixture has melted and become well blended.\n",
        "picture_link": "ky/OUPrTOU5tW/X2nTtxH3jC5hs51uS"
    },
    {
        "title": "Fruity Tart",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "1 (4.6 ounce) package non-instant vanilla pudding mix ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1/2 cup fresh strawberries, sliced ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "1 cup fresh peaches, pitted and sliced ADVERTISEMENT",
            "1/2 cup fresh raspberries ADVERTISEMENT",
            "1 cup kiwi, sliced ADVERTISEMENT",
            "1/4 cup any flavor fruit jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pudding mix and milk in a medium saucepan. Cook according to package directions. Pour pudding into pastry shell and refrigerate until cool and firm. Arrange fruit on top of pudding layer.\nPlace jam in a small saucepan over low heat, stirring occasionally until runny. Using a pastry brush, coat fruit with jam. Now hide in the closet and eat the whole thing yourself.\n",
        "picture_link": "XpKT2adkzMLa1m2S2d88MWaF220oetW"
    },
    {
        "title": "Homemade Barbecue Sauce",
        "ingredients": [
            "2 tablespoons butter, melted ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "1 tablespoon chopped green bell pepper ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "2 teaspoons mustard powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium nonporous bowl, combine the butter or margarine, onion, green bell pepper, water, ketchup, mustard powder, salt, celery seed, brown sugar and lemon juice. Mix well and use on your choice of meat.\n",
        "picture_link": "WfSdp/iUiQGNOgxLvIWxnfGnWOQ4mlO"
    },
    {
        "title": "Won Tons",
        "ingredients": [
            "1/2 cup sweet hot mustard ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 tablespoon wasabi ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 cups imitation crabmeat ADVERTISEMENT",
            "1 medium onion, minced ADVERTISEMENT",
            "1 (8 ounce) can water chestnuts, drained ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "1 (16 ounce) package small won ton wrappers ADVERTISEMENT",
            "2 cups vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mixing bowl, combine mustard, soy sauce and wasabi until the wasabi has dissolved. Cover and refrigerate.\nPlace cream cheese in a large bowl (preferably chilled metal). Mix in crab meat, onion, water chestnuts and parsley. Place one spoonful of the mixture in the center of each won ton wrapper. Bring points of the wrapper together (in a triangular shape) and pinch the edges closed. If the edges do not stick together, wet your fingertips lightly with water and pinch the ends together again (this will help to hold the won ton together).\nHeat oil in a large skillet. When oil is hot, place won tons (approximately 6 at a time) into hot oil. Remove the won tons when they are golden brown. Drain them on a paper towel lined tray. Repeat this process until all won tons are fried. Serve with dipping sauce.\n",
        "picture_link": "IixZSVxAj3WhrDliytEhE0dGnrAa4Rm"
    },
    {
        "title": "Date Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "1 1/2 cups chopped pitted dates ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the butter and sugar until light and fluffy. Add the eggs one at a time, beating well with each addition. Combine the flour, baking soda, cinnamon and cloves; gradually stir into the creamed mixture. Combine the water and dates; stir into the dough along with the chopped pecans. Cover and chill for 1 hour.\nPreheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Drop by rounded spoonfuls onto the prepared cookie sheet.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "o93L8oAqeVHj4zjsihIwbBx9PgYKc3y"
    },
    {
        "title": "Chocolate Chip Muffins II",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups self-rising flour ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 12 muffin cups.\nIn a large bowl, cream together butter and sugar. Beat in eggs one at a time then stir in the milk, yogurt and vanilla. Blend in the flour, then fold in the chocolate chips. Scoop batter into the prepared muffin cups.\nBake in prepared oven for 15 to 20 minutes. Move to a wire rack to cool.\n",
        "picture_link": "6UCa6CmAKlWrBHsmGhUFhCUcA/2ATFe"
    },
    {
        "title": "Muesli-Applesauce Muffins",
        "ingredients": [
            "1 cup applesauce ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups muesli cereal ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease one 12-cup muffin tin.\nIn a large bowl, beat the applesauce, oil egg, sugar and water together for 2 minutes at medium speed.\nIn a medium bowl, combine the flour, cinnamon, salt, baking soda, allspice and muesli together. Add the dry ingredients to the applesauce mixture. Beat on low speed until combined.\nSpoon batter into the prepared muffin tin filling each cup 3/4 full. Bake in the preheated oven for 20 to 25 minutes or until the tops are golden brown an spring back lightly when touched. Remove from pans immediately to cool.\n",
        "picture_link": "NHQFV9oLqbGgEnpgAc452DUNdfP5lx6"
    },
    {
        "title": "Gone with the Wind Cake",
        "ingredients": [
            "3/4 cup cold water ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 3/4 cups sifted cake flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat cold water and egg yolks together until mixture makes 1 quart--at least 10 minutes. Slowly add sugar and vanilla to egg yolk mixture, beating for at least 7 minutes more.\nSift the cake flour, baking powder, and salt together. Fold into the egg yolk mixture.\nBeat egg whites until medium-stiff peaks form. Fold one third of the egg white mixture into the batter to lighten; fold in remaining egg whites. Pour batter into an ungreased tube pan.\nBake in preheated oven until cake springs back when lightly touched with a fingertip, about 50 minutes. Turn upside down to cool in pan for 1 hour. Loosen sides and coax from pan.\n",
        "picture_link": "T.38fBWp26S1Nu4QU0iTPm9yZRcHdl."
    },
    {
        "title": "Gloria's Rum Cake",
        "ingredients": [
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant French vanilla pudding ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup rum ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/8 cup water ADVERTISEMENT",
            "1/8 cup rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat Bundt pan with 1 tablespoon melted butter. Sprinkle 1/4 cup of sugar and finely chopped pecans so that they coat the pan.\nIn a large bowl, combine the cake mix and instant pudding. Add 1/2 cup water, 1/2 cup oil, 1/2 cup rum and 4 eggs, mix until smooth and well blended. Spread evenly into the prepared pan.\nBake for 55 to 60 minutes in the preheated oven, or until a toothpick inserted into the cake comes out clean.\nIn a saucepan over medium heat, combine 1/4 cup butter, 1/2 cup sugar, 1/8 cup water and 1/8 cup rum. Bring to a boil, then remove from heat. Poke holes into the bottom of the cake using a fork. Pour glaze over the hot cake. Allow cake to cool completely before removing from pan.\n",
        "picture_link": "Lv8p18ar3En1gTQBdpuszM0Y8fkRUhe"
    },
    {
        "title": "Peanut Butter Pie XIII",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup creamy peanut butter ADVERTISEMENT",
            "1 1/2 cups sweetened whipped cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, whisk together egg yolks, salt and milk. Cook over low heat, stirring constantly until warm.\nIn a small bowl combine sugar and flour. Mix well and gradually whisk into milk mixture. Continue to stir mixture constantly until thickened. Remove from heat.\nAdd vanilla extract and peanut butter to milk mixture. Stir until smooth. Pour into baked pastry shell. Chill for at least 2 hours before serving. Top with whipped cream if desired.\n",
        "picture_link": "yRrUWvN0HfxnjGuh1n6mfO51VH0hrdS"
    },
    {
        "title": "Chicken Barbeque Sauce",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 cup cider vinegar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 1/2 teaspoons poultry seasoning ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender or food processor, combine the eggs, oil, vinegar, salt, poultry seasoning and ground black pepper. Blend together and baste on the chicken when grilling, or marinate the chicken in the sauce in the refrigerator for 1 to 1 1/2 hours before grilling.\n",
        "picture_link": "qUzJiSGk.hjVgaJ3LR/bXxm6HsSnQG6"
    },
    {
        "title": "Crusty Cornbread",
        "ingredients": [
            "1 1/3 cups warm water ADVERTISEMENT",
            "1/4 teaspoon hot pepper sauce ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "3/4 cup cornmeal ADVERTISEMENT",
            "3 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons instant yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select cycle; press Start.\n",
        "picture_link": "m3zoZR5zI0ZL1vaoU884rCp4Ah8BwcC"
    },
    {
        "title": "Kolaches I",
        "ingredients": [
            "2 1/2 cups warm milk ADVERTISEMENT",
            "1 1/2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "6 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup fruit preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour warm milk over yeast, and let dissolve. Then add sugar, shortening, salt, eggs, egg yolks, and flour. Stir until well combined. Remove dough to a well oiled bowl, and turn once to coat the surface. Cover, and place in a warm spot. Allow to rise until doubled in bulk, about 1 hour.\nDish out dough with a tablespoon, and roll into balls. Brush each with shortening, and let rise until doubled in bulk.\nFlatten the balls, and make a depression in the centers. Fill with fruit preserves. Allow to rise.\nBake at 375 degrees F (190 degrees C) for 15 to 20 minutes, or until lightly browned.\n",
        "picture_link": "yptB9Jr5qkP1O/RUniwMCDiXwxyY/G6"
    },
    {
        "title": "Angel Biscuits I",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/4 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "3/4 cup warm buttermilk (105 to 115 degrees F) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl combine flour, sugar, baking powder, and salt. With pastry blender or two knives, cut in shortening until mixture resembles course crumbs, set aside.\nPlace warm water in warm bowl. Sprinkle in yeast, stir until dissolved. Add yeast mixture and warm buttermilk to dry ingredients, blend well.\nRemove dough to floured surface. Knead dough 10 to 15 times, form into ball. Roll dough to 3/4 inch thickness. Cut into 2-1/2 inch biscuits. Cover and let rise until doubled in bulk, about 30 to 45 minutes.\nBake at 400 degrees F (205 degrees C) for 15 minutes or until done.\n",
        "picture_link": "ZJl2eTrTJaf8jLV6kpEEgTAgZFOYJXK"
    },
    {
        "title": "Chocolate Mocha Liqueur Cake I",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup coffee flavored liqueur ADVERTISEMENT",
            "1/4 cup vodka ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup hot water ADVERTISEMENT",
            "2 tablespoons coffee flavored liqueur ADVERTISEMENT",
            "2 tablespoons vodka ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a large bowl, combine the cake mix, pudding mix, oil, 3/4 cup water, eggs, 1/4 cup coffee liqueur and 1/4 cup Vodka. Mix well, then pour into greased and floured Bundt pan.\nBake in the preheated oven for 50 to 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Pour glaze over hot cake while still in pan. Let cake sit for 30 minutes.\nTo make the glaze: in a small saucepan combine sugar, butter and 1/4 cup hot water. Bring to a boil and cook for 1 minute. remove from heat and stir in 2 tablespoons coffee liqueur and 2 tablespoons vodka.\n",
        "picture_link": "k4jcckGNCMm8Oh.WUTFl7BA/D5Cvm8C"
    },
    {
        "title": "Southern Burgers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 slice bread, crumbled ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the beef, bread, egg, mustard and Worcestershire sauce and mix well. Form into 6 to 8 patties and season with garlic salt and salt and pepper to taste.\nIn a large skillet over medium heat, saute the patties for 10 to 15 minutes, or until fully cooked to desired doneness.\n",
        "picture_link": "oqA8AwSKae7JIoQJhAtrbg4aoW6Adm6"
    },
    {
        "title": "Cabbage Rolls I",
        "ingredients": [
            "10 leaves cabbage ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, chopped ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nBring a large pot of water to boil, introduce cabbage leaves and cook 2 minutes. Drain. Combine the rice and water is a small saucepan. Bring to a boil, then reduce heat and simmer for 20 minutes or until rice is tender. Remove from heat and set aside.\nIn a large bowl, combine beef, bread crumbs, cinnamon, drained and chopped tomatoes, onion and salt; stir until well combined. Spoon equal amounts of beef mixture onto the center of each cabbage leaf. Place a spoonful of rice onto the beef. Roll up leaves, tucking in edges, and seal with a toothpick. Wrap each roll in aluminum foil and place in a shallow baking dish.\nBake 40 minutes, or until beef is cooked through. Serve warm.\n",
        "picture_link": "C042pzHQZlZ9X3/4pOZh2BSEfEbSPIK"
    },
    {
        "title": "Marinara Sauce I",
        "ingredients": [
            "2 (28 ounce) cans whole peeled tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 tablespoon salt ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, blend the whole tomatoes and paste; reserve.\nIn a large saucepan, warm olive oil over medium-low heat and add garlic; cook for a few minutes, but make sure to not brown the garlic.\nPour tomato mixture in saucepan and stir; cook over medium heat for 10 minutes. Add parsley, salt and wine; reduce heat to low and simmer, stirring occasionally, until sauce thickens; serve.\n",
        "picture_link": "Uxt/sVnJUyAxfwkd06uD14c9lW7qIIK"
    },
    {
        "title": "Garlic and Herb Bread",
        "ingredients": [
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 tablespoons nonfat dry milk powder ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons garlic salt ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 1/2 teaspoons dried dill weed ADVERTISEMENT",
            "1 1/2 teaspoons celery seed ADVERTISEMENT",
            "1 1/2 tablespoons dried parsley ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For bread machine: Place all ingredients in bread pan as recommended by your manufacturer. Process on \"Regular\" or \"White Bread\" cycle. Remove promptly after baking cycle is complete.\n",
        "picture_link": "IIosFemBkiQN9r.mx/soux4l2kFHKRi"
    },
    {
        "title": "The Best Taco Dip",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1/2 cup hot taco sauce ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "3/4 cup chopped tomatoes ADVERTISEMENT",
            "3/4 cup black olives, chopped ADVERTISEMENT",
            "3/4 cup sliced jalapeno peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium heat, brown beef. Drain well. Stir in beans, taco sauce, chili powder and cumin. Heat until warm.\nSpread the meat and bean mixture into a 9x13-inch casserole. Spread sour cream over the beef and bean mixture, then sprinkle onions, tomatoes, olives and peppers. Top with cheese.\nBake at 350 degrees F (175 degrees C) for 30 minutes. Serve warm.\n",
        "picture_link": "SmgUoHFRHCzX5.osvTKhaxD9ai0ouK2"
    },
    {
        "title": "Turtles® Candy",
        "ingredients": [
            "72 pecan halves ADVERTISEMENT",
            "24 individually wrapped caramels, unwrapped ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "2 teaspoons shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease baking sheets.\nPlace three pecan halves in a Y shape on cookie sheet and place caramel in center. Repeat with remaining nuts and caramels.\nPlace in preheated oven 10 minutes, until caramel is melted.\nMelt chocolate chips with shortening in microwave, or in a small saucepan over low heat; stir until smooth. Spoon over candies on sheets. Chill 8 hours or overnight, until firm.\n",
        "picture_link": "KdQhe/usF/rNG6c/KaIMp9CzgKxExda"
    },
    {
        "title": "Whiskey Cake II",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup whiskey ADVERTISEMENT",
            "3/4 cup butter, cut into pieces ADVERTISEMENT",
            "1 (11 ounce) package butterscotch chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl, stir together cake mix and pudding mix. Make a well in the center and pour in eggs, milk, whiskey and butter. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Reserve a 1/4 cup each of the butterscotch chips and walnuts for the top of the cake. Stir in the remaining butterscotch chips and walnuts to the batter. Pour batter into prepared pan and sprinkle with reserved chips and nuts.\nPour batter into prepared pan. Bake in the preheated oven for 50 to 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "p6mk3tvkyEj40fTWFOLjZnKqx8s/wme"
    },
    {
        "title": "Perogie Casserole",
        "ingredients": [
            "12 lasagna noodles ADVERTISEMENT",
            "5 pounds potatoes ADVERTISEMENT",
            "4 cups shredded Cheddar cheese ADVERTISEMENT",
            "4 cups cottage cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pound bacon, sliced ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBring a large pot of lightly salted water to a boil. Add lasagna and cook for 8 to 10 minutes or until al dente; drain.\nRoast potatoes in oven for about 1 hour. Split potatoes and scoop out middle; discard skins. Mix Cheddar cheese into potatoes. In a bowl, blend together cottage cheese, eggs, salt and pepper; set aside.\nLayer lasagna noodles in a 9x13 inch baking dish. Spread cottage cheese mixture over noodles. Layer noodles again and spread potato and cheese mixture to cover noodles. Smooth top.\nIn a skillet, fry bacon until half way cooked. Spread over top of casserole. Sprinkle onions on top. Dot casserole with margarine.\nLower oven temperature to 350 degrees F (175 degrees C) and bake for 45 minutes.\n",
        "picture_link": "P/ESPMDNo8iJ7r6Xns.4kY1vqRGAELe"
    },
    {
        "title": "Nan's Potato and Egg Frittata",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large baking potato, peeled and sliced 1/4 inch thick ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet or frying pan over medium-high heat. Spread potato slices across bottom of the pan and cook, turning once, until golden on both sides. Remove slices from pan and drain.\nWhen all potato slices have been cooked, return them to the pan. Turn heat to high. Pour on the beaten eggs and season with salt and pepper. Tilt the pan so that the eggs flow to the bottom of the pan. Turn heat to medium low. Cover pan with a plate and flip pan so that frittata is turned out onto plate. Slide the frittata back into the pan with the uncooked side down. Cover and let cook another 2 minutes.\nWhen frittata is finished cooking, remove it from the pan and drain briefly on paper towels before serving.\n",
        "picture_link": "scL1VaflWcpmK/aalCokdSo8rr9Xvpq"
    },
    {
        "title": "Beef, Bean and Barley Stew",
        "ingredients": [
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "2 (14 ounce) cans beef broth ADVERTISEMENT",
            "3 1/2 cups water ADVERTISEMENT",
            "1 cup peeled and diced tomatoes with juice ADVERTISEMENT",
            "1 potato, cubed ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1/4 medium head cabbage, shredded ADVERTISEMENT",
            "1/3 cup quick-cooking barley ADVERTISEMENT",
            "1 (14.5 ounce) can great Northern beans, rinsed and drained ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried rosemary ADVERTISEMENT",
            "1/4 teaspoon caraway seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat a large pot or Dutch oven with cooking spray. Place over medium heat and cook beef until brown. Stir in onion and cook until translucent. Drain fat. Stir in salt, pepper and garlic and cook 1 minute. Pour in beef broth, water and tomatoes. Stir in potato, carrots, cabbage, barley and beans. And season with oregano, basil, rosemary and caraway. Bring to a boil, then reduce heat and simmer 20 minutes.\n",
        "picture_link": "Hug4K2L.PEEWy4Oft12Tmau5pXHhIQ."
    },
    {
        "title": "Chicken Soup II",
        "ingredients": [
            "5 chicken thighs ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "4 cubes chicken bouillon, crumbled ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "6 carrots, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "4 ounces thin egg noodles ADVERTISEMENT",
            "8 ounces meat tortellini ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with water and place chicken thighs in the pot. Bring to a boil, then reduce heat and simmer until meat falls from the bone, 45 minutes. Remove chicken, cut up meat and return meat to the pot.\nStir in chicken bouillon, onion, garlic, celery, carrots and bell pepper; simmer until vegetables are tender, 10 to 15 minutes.\nStir in frozen spinach and cook until tender, 5 to 10 minutes.\nMeanwhile, bring a large pot of water to a boil. Cook egg noodles in water until al dente, 8 to 10 minutes. Drain and reserve.\nStir tortellini into soup and cook until tender, 10 to 15 minutes. Stir in reserved egg noodles, salt and pepper. Heat through and serve.\n",
        "picture_link": "9cp97JNwbC47Cd.8M8Qnvu7Jriytz0O"
    },
    {
        "title": "Marinated Cauliflower",
        "ingredients": [
            "1 head cauliflower, broken into small florets ADVERTISEMENT",
            "1 (8 ounce) bottle Italian dressing ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup bacon bits ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cauliflower in a large bowl and cover with Italian dressing. Cover and refrigerate overnight.\nDrain cauliflower and stir in mayonnaise, bacon bits and cheese.\n",
        "picture_link": "HJA8tZtrJmBNM.W96m32XelsaJhAvcy"
    },
    {
        "title": "Polish Pickles",
        "ingredients": [
            "1 (32 ounce) jar dill pickle spears, drained ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, room temperature ADVERTISEMENT",
            "2 (2.5 ounce) packages thin-sliced beef luncheon meat ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dry excess moisture off of pickles.\nSpread cream cheese, about 1/4 inch thick, on two slices of lunch meat. Wrap meat around a pickle. Repeat with remaining ingredients.\nChill and slice into rounds.\n",
        "picture_link": "uO.1g1S1W01ckpta.a1HyUTDwggqH0e"
    },
    {
        "title": "Roasted Potato and Garlic Salad",
        "ingredients": [
            "8 red potatoes - unpeeled, scrubbed and cubed ADVERTISEMENT",
            "2 red bell peppers ADVERTISEMENT",
            "2 medium heads garlic ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/3 cup balsamic vinegar ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace 1/2 cup of olive oil in a large bowl. Toss the cubed potatoes in the oil until coated, and then spread them evenly on a baking sheet.\nPass the red peppers through the bowl of oil, making sure they are evenly coated. Place on a separate baking sheet.\nCut about 1/2 inch off the tops of the garlic and drizzle with the remaining oil from the bowl. Place on the baking sheet with the red peppers. Sprinkle the potatoes, peppers and garlic with salt and pepper, and then place both sheets in the oven for about 20 minutes.\nCheck the potatoes: they should be soft, brown and crispy. If not, return them to the oven for an additional 10 minutes or until they are done. The peppers and garlic will take longer, and are done when the skins on the peppers are black and garlic is dark brown (no more than 40 minutes total).\nOnce everything has been roasted, place the potatoes in a large bowl and seal the peppers in a plastic bag to let them steam for 10 minutes. (This will loosen their skins.)\nTake the peppers out of the bag, remove their skins and seeds and chop them up. Add to the bowl with the potatoes and stir to mix.\nTurn the garlic heads upside down and squeeze the softened garlic past into a separate, small bowl. Mix in the balsamic vinegar, 1/3 cup olive oil and oregano until smooth. Pour the dressing onto the potatoes and peppers and toss to coat. Season to taste with additional salt and pepper. Best when served warm or at room temperature. To prepare in advance for an occasion, refrigerate and then reheat in the microwave just until warmed through.\n",
        "picture_link": "4xRheMEWgFFfcfdSkKgnw8oA/E69r86"
    },
    {
        "title": "Joe's Favorite Hamburgers",
        "ingredients": [
            "1 sweet onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "4 cloves garlic, peeled and crushed ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "2 tablespoons steak sauce ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat and lightly oil grate.\nIn a blender or food processor, gradually place sweet onion. green bell pepper, garlic and tomato. Blend into a thick liquid. Mix steak sauce into the mixture.\nPour the blended mixture into a large bowl. Place ground beef into the bowl, and thoroughly mix together. Set aside approximately 15 minutes.\nMix again if liquid is present, then gradually introduce dry bread crumbs until the ground beef mixture is firm enough to form hamburger patties. Salt and pepper to taste.\nForm the ground beef mixture into hamburger patties. Cook on the prepared grill to desired doneness.\n",
        "picture_link": "fuJ1Zr6X8qXX6pCL1ytr7KSzOgPjlu."
    },
    {
        "title": "Cornbread II",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1/2 cup instant mashed potato flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x9 inch baking pan.\nMix egg, milk and oil together. In a separate bowl, stir together flour, sugar, baking powder, salt, cornmeal and potato flakes. Stir egg mixture into flour mixture just until combined. Pour batter into prepared pan.\nBake in preheated oven for 20 minutes, until a toothpick inserted into center of pan comes out clean.\n",
        "picture_link": "yuJoWbglMkswTEegdS52NQ4lDrxK5zK"
    },
    {
        "title": "Tomato Pie II",
        "ingredients": [
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "2 large tomatoes ADVERTISEMENT",
            "1/2 small onion, sliced ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 cup fat-free mayonnaise ADVERTISEMENT",
            "1 cup shredded reduced-fat Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C.) Bring a pot of water to boil and blanch the tomatoes for 1 minute. Peel and slice the tomatoes and drain on paper towels.\nPlace sliced tomatoes in the pie shell, sprinkle with Italian seasoning, then place the sliced onions on top. In a small bowl, mix the mayonnaise and cheese together. Spread on top of the tomatoes and onions.\nBake in preheated oven for 35 minutes. Remove from oven and let stand for 10 minutes before serving.\n",
        "picture_link": "E4j2XJu9jYUEoXDoP6oZFqETg47g3.2"
    },
    {
        "title": "Banana Margaritas",
        "ingredients": [
            "6 fluid ounces tequila ADVERTISEMENT",
            "1 (6 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "4 fluid ounces triple sec liqueur ADVERTISEMENT",
            "6 cups ice ADVERTISEMENT",
            "2 bananas ADVERTISEMENT",
            "1/4 cup coarse granulated sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sugar the rims of 4 large margarita glasses. To do so, pour sugar onto a small plate, moisten the rims of the glasses on a damp towel and press them into the sugar.\nIn a blender, combine tequila, limeade, triple sec and ice. Blend until smooth. Add bananas and blend again until smooth. Pour into glasses and serve.\n",
        "picture_link": "71Dv16bWAThCqzGzM6tDk9BGNrcAYie"
    },
    {
        "title": "Spicy Pumpkin and Sweet Potato Soup",
        "ingredients": [
            "1 tablespoon coriander seeds ADVERTISEMENT",
            "2 teaspoons cumin seeds ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 tablespoon fennel seeds ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon whole black peppercorns ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 medium sugar pumpkin ADVERTISEMENT",
            "4 orange-fleshed sweet potatoes ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 1/2 quarts chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a mortar or spice grinder, grind coriander, cumin, oregano, fennel, red pepper, salt and peppercorns into a coarse powder. Blend in garlic and 1 tablespoon olive oil to form a paste.\nWash pumpkin, and cut into 2-inch wide wedges, scraping away seeds. Peel potatoes and cut each potato lengthwise into 6 wedges. Smear the pumpkin and the potatoes with the spice paste and place in a baking dish.\nRoast in preheated oven 30 to 40 minutes, until tender and just beginning to blacken at the thinnest points.\nMeanwhile, in a large pot over medium heat, cook the onion in the remaining 1 tablespoon olive oil until translucent.\nChop pumpkin and potatoes into smaller chunks and puree in a blender or food processor with some of the chicken broth until smooth. Be sure to scrape the roasted spice paste off the baking dish and include it in the puree. It may be necessary to deglaze the dish with a little chicken broth.\nPour the pureed vegetables into the pot with the onions, and stir in as much additional chicken stock as needed to achieve the desired consistency. Heat through.\n",
        "picture_link": "6Avurc1T7rxnYB.Zwww.oZDuuMDQiYa"
    },
    {
        "title": "A Great Pepper Salad",
        "ingredients": [
            "1 1/2 (16 ounce) jars sliced pepperoncini peppers, drained ADVERTISEMENT",
            "1 (32 ounce) jar sweet pepper rings, drained ADVERTISEMENT",
            "1 (4 ounce) jar diced pimento peppers, drained ADVERTISEMENT",
            "1 pound pepperoni sausage, cubed ADVERTISEMENT",
            "1 pound provolone cheese, cubed ADVERTISEMENT",
            "1/2 pound Swiss cheese, cubed ADVERTISEMENT",
            "1/2 pound sharp Cheddar cheese, cubed ADVERTISEMENT",
            "1 (6 ounce) can mushrooms, drained and thinly sliced ADVERTISEMENT",
            "2 (6 ounce) cans black olives, drained and thinly sliced ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "4 1/2 tablespoons dried oregano ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl with a lid, stir together the pepperoncini peppers, sweet pepper rings, pimentos, pepperoni, Provolone, Swiss, Cheddar, mushrooms, olives, garlic, oregano, canola oil and olive oil until evenly coated. Cover tightly with the lid and let stand in fridge for 3 days. Shake the bowl often. This can be served cold, but is better when you let it come to room temperature!\n",
        "picture_link": "bJTmpcc9y30EB.a1X9RINir0nNpUBYe"
    },
    {
        "title": "Momma OB's Chicken Chili",
        "ingredients": [
            "2 pounds skinless, boneless chicken breast meat - cubed ADVERTISEMENT",
            "1/2 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "2 (28 ounce) cans whole peeled tomatoes ADVERTISEMENT",
            "1 (16 ounce) can chili beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "1 (1.25 ounce) package chili seasoning mix ADVERTISEMENT",
            "1 (4 ounce) can diced green chile peppers ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat, and add the chicken and half of the Italian seasoning. Cook, stirring frequently, until chicken is cooked through and evenly browned.\nPlace the remaining Italian seasoning, tomatoes, chili beans, kidney beans, chili seasoning, chile peppers, onion, garlic, and water in a slow cooker. Stir in chicken and juices\nCover, and cook on High for three hours.\n",
        "picture_link": "jNX6/7qURu1Kpjdh0eRt7Igy9J7JLZS"
    },
    {
        "title": "Broccoli Turkey Bake",
        "ingredients": [
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 cups cooked, chopped turkey meat ADVERTISEMENT",
            "1 (10 ounce) package frozen broccoli, thawed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (7 ounce) package whole wheat crackers, crushed ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a saucepan bring 2 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nIn a 9x13 inch baking dish combine turkey, broccoli, cheese and cooked rice.\nIn a small bowl combine crushed crackers and melted butter. Spread over rice mixture.\nBake in preheated oven for 20 to 30 minutes, or until crackers are crispy.\n",
        "picture_link": "FIvtU9x0H.O6TksPZT6QlW8md0zSULi"
    },
    {
        "title": "Raspberry Star Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (8 ounce) jar raspberry preserves ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter and sugar until smooth. Beat in the egg. Combine the flour and salt; stir into the creamed mixture. Dough will be stiff. On a lightly floured surface, roll half of the dough out to 1/8 inch thickness. Cut into star shapes using a cookie cutter. Set cookies 1 inch apart onto the prepared cookie sheets. Place a teaspoon of jam onto each cookie and spread out towards the points of the stars. Roll out remaining half of the dough and cut into stars the same size. cut holes in the center of each star, then place them onto the jam stars.\nBake for 7 to 10 minutes in the preheated oven, until golden around the edges. Remove from cookie sheets to cool on wire racks. In a small bowl, mix together the confectioners' sugar and almond extract to form a glaze. Add water a teaspoon at a time if the mixture is too thick to drizzle. Drizzle glaze over cooled cookies.\n",
        "picture_link": "OkAeS2MQ9/OaMUTbouTM.MdXtvNQP9G"
    },
    {
        "title": "Confetti Scalloped Potatoes",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "1 (16 ounce) package frozen hash brown potatoes, thawed ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 small green bell pepper, cut into thin strips ADVERTISEMENT",
            "1 dash pepper ADVERTISEMENT",
            "1 cup crushed cheese flavored crackers, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMelt butter in a large skillet over medium heat. Saute onion until tender. Stir in potatoes, soup, milk, cheese, bell pepper, black pepper, and 1/2 cup cracker crumbs. Transfer to a 2 quart casserole dish and top with remaining cracker crumbs.\nBake in preheated oven for 35 to 40 minutes.\n",
        "picture_link": "Kyu52w5vmDhfgxH/KBd4wOn3dzB4VBC"
    },
    {
        "title": "Chile Rice Casserole",
        "ingredients": [
            "1 cup uncooked instant rice ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn an 8x8 inch baking dish combine rice, soup, chile peppers and sour cream. Sprinkle Cheddar cheese on top.\nBake in preheated oven for 25 minutes.\n",
        "picture_link": "60ROCD/TbPOdtxRnvmdP9ej99k/412K"
    },
    {
        "title": "Creamy Pesto Chicken",
        "ingredients": [
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "4 large cloves garlic, sliced ADVERTISEMENT",
            "3 1/2 tablespoons sherry ADVERTISEMENT",
            "1/4 cup pine nuts ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "1 (8 ounce) container reduced fat sour cream ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat, and cook the chicken for about 5 minutes, until lightly browned. Mix the garlic and sherry into the skillet. Cook and stir until all the liquid has been reduced and the chicken is no longer pink and juices run clear.\nMix the pine nuts into the skillet, and cook 2 to 3 minutes over medium heat. Reduce the heat to low, and mix in the basil, sour cream, Parmesan cheese, and pepper. Continue cooking until heated through.\n",
        "picture_link": "xbmODbhnSvmNvl75a7ajlMmV4Y/S.zu"
    },
    {
        "title": "Liquor-Infused Chocolate Strawberries",
        "ingredients": [
            "16 large fresh strawberries with leaves ADVERTISEMENT",
            "1/2 cup brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1 pound bittersweet chocolate, chopped ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "2 tablespoons heavy cream ADVERTISEMENT",
            "1/4 cup brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1 (1 ounce) square chopped white chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse strawberries and dry thoroughly. Use a syringe or clean marinade injector to inject about 2 teaspoons of brandy into each berry. Place them on a baking sheet, and refrigerate for about 30 minutes.\nIn a metal bowl over a pan of simmering water, combine bittersweet chocolate and shortening. Stir occasionally until melted and smooth. Stir in heavy cream and 1/4 cup of brandy. Place white chocolate in a separate bowl, and when the dark chocolate has melted, place the bowl of white chocolate over the pan of simmering water, stirring occasionally until smooth. Be sure to remove from heat as soon as it is mostly melted, white chocolate can be sensitive.\nDip strawberries into chocolate, and let the excess drip off into the bowl before placing on waxed paper to set. When the strawberries have all been dipped in chocolate, dip a fork into the white chocolate, and drizzle back and forth over berries to stripe.\n",
        "picture_link": "74T/yKOu0jEItLgdkmTrLRX45ucQZA2"
    },
    {
        "title": "Lea's Hamburgers",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1/4 cup bacon bits ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "4 hamburger buns, split and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat.\nIn a medium bowl, mix together the ground beef, onion, egg, bread crumbs, and bacon bits. Season with garlic salt. (I like to use a lot.) Divide into four balls, and pat into patties.\nLightly oil the grate, and place patties onto the grill. Cook for about 5 minutes per side, or until firm and no longer pink in the center. Serve on toasted buns with your favorite hamburger toppings.\n",
        "picture_link": "sCuuR4mDmo7m9T4ua3N57pJK39wwIhe"
    },
    {
        "title": "Cheese Ball III",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 teaspoon lemon juice concentrate ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped green olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, blend cream cheese, mayonnaise and lemon juice concentrate. Mix in Cheddar cheese, onion and green olives. Form the mixture into a ball shape. Cover and chill in the refrigerator 3 hours, or until firm, before serving.\n",
        "picture_link": "TIlqDffKEa1y/Dp9ZqRdU/iCqru/nty"
    },
    {
        "title": "Hot Maryland Crab Dip",
        "ingredients": [
            "cooking spray (such as Pam®) ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1/4 cup creamy salad dressing ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon seafood seasoning (such as Old Bay®), or to taste ADVERTISEMENT",
            "2 cups fresh lump crabmeat, or more to taste ADVERTISEMENT",
            "1/2 cup grated Cheddar cheese ADVERTISEMENT",
            "2 small baguette loaves, sliced into about 4 to 5 pieces each ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a glass loaf pan with cooking spray.\nMix cream cheese, sour cream, mayonnaise, Worcestershire sauce, and seafood seasoning together in a bowl. Gently fold crabmeat into cheese mixture; pour into the prepared loaf pan and top with Cheddar cheese.\nBake in the preheated oven until dip is bubbling, about 20 minutes. Toast baguette slices on oven rack during the last 5 minutes of baking the dip.\n",
        "picture_link": "Yyd4ZW.ChH27bY4mnLFs4UjDbcs6stK"
    },
    {
        "title": "Tropical Baked Bananas",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 1/2 teaspoons orange juice ADVERTISEMENT",
            "6 bananas, peeled and halved lengthwise ADVERTISEMENT",
            "1/3 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 7x11 inch baking dish.\nIn a small bowl, cream together butter and sugar. Stir in cloves and orange juice until smooth. Place the bananas in the prepared dish and spread the butter mixture evenly over the bananas. Sprinkle with coconut.\nBake in preheated oven until bubbly and heated through, 10 minutes.\n",
        "picture_link": "guxtkqQ2W1To1nMhoOQKiCbDYtI0wVa"
    },
    {
        "title": "Apples by the Fire",
        "ingredients": [
            "1 Granny Smith apple, cored ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill the core of the apple with the brown sugar and cinnamon. Wrap the apple in a large piece of heavy foil, twisting the extra foil into a tail for a handle. Place the apple in the coals of a campfire or barbeque and let cook 5 to 10 minutes, until softened. Remove and unwrap, being careful of the hot sugar.\n",
        "picture_link": "4.k0I6muK0XEfuyYnMtrYfxOvdJCdBO"
    },
    {
        "title": "South African Malvapoeding (Marshmallow Pudding)",
        "ingredients": [
            "Pudding: ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 teaspoon white vinegar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup superfine sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon apricot jelly ADVERTISEMENT",
            "1 1/3 cups cake flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup water, orange juice, or sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a small saucepan over low heat, melt 2 tablespoons butter or margarine together with vinegar and milk. Remove from heat, and set aside. Meanwhile, sift flour, baking soda, and salt together into a separate bowl.\nBeat 1 cup sugar and eggs with an electric mixer on high speed until fluffy and light colored, about 5 minutes. Gradually mix in the apricot jam. Fold the dry ingredients into the egg mixture alternately with warmed milk mixture using a spatula. Pour batter into a greased, 1 quart oven-proof baking dish.\nBake approximately 45 minutes, or until a knife inserted into the center comes out clean.\nPlace cream, butter, 1/2 cup sugar, and water in a saucepan and stir over moderate heat until the butter has melted and sugar is dissolved. Do not allow the mixture to boil.\nRemove pudding from the oven, pierce several times with a skewer or fork, and pour the hot cream mixture immediately over the pudding. Serve hot or cold.\n",
        "picture_link": "o.wgyplv9iiqQXkOTDnEMeXH7X1KCya"
    },
    {
        "title": "Three Chile Dry Roasted Tomatillo Salsa",
        "ingredients": [
            "1 pound tomatillos, unhusked ADVERTISEMENT",
            "2 serrano chile peppers ADVERTISEMENT",
            "2 jalapeno chile peppers ADVERTISEMENT",
            "8 pequin chile peppers ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "1 small whole onion, peeled ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomatillos, chiles, garlic cloves, and onion in a dry, cast iron pan. Toast, turning occasionally over medium-high heat until the husks of the tomatillos have blackened and their skins turn translucent. The goal is to soften the tomatillos by blackening the skin without allowing them to split. Remove from pan, and allow to cool slightly.\nRemove the husks from the tomatillos and the stems from the peppers. Place into the bowl of a food processor with the cilantro and salt to taste; process to desired consistency. Pour the salsa into a saucepan, and cook over medium heat for about 5 minutes to mellow the flavors and remove the raw taste.\n",
        "picture_link": "vapcLgMLBzaMB6LNWjSnwwNF1AnyHhm"
    },
    {
        "title": "Carrot Gelatin Salad",
        "ingredients": [
            "1 (6 ounce) package lemon flavored Jell-O® mix ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained with juice reserved ADVERTISEMENT",
            "4 large carrots, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, prepare the lemon gelatin according to package directions using reserved pineapple juice in place of some of the water. Refrigerate until thickened, about 1 hour.\nWhen the gelatin has thickened, stir in pineapple and shredded carrot. Cover and refrigerate until set, at least 4 hours.\n",
        "picture_link": "HZbde6ylXbjj6Z9JHVPUdRGbFHFblnC"
    },
    {
        "title": "Marzipan Candy",
        "ingredients": [
            "8 ounces almond paste ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup corn syrup ADVERTISEMENT",
            "3 drops any color food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Break the almond paste into small pieces over a medium bowl. Add 1 cup of the confectioners' sugar, and work it in with your hands until incorporated. It will be crumbly. Add another 3/4 cup of sugar, and work it in really well. Pour in the corn syrup, and work it in until evenly blended. Spread remaining sugar out on a clean work surface, and knead the dough until smooth and uniform, 3 to 5 minutes. If the dough seems too sticky, knead in more sugar. Wrap the dough in plastic wrap, and refrigerate for about an hour. It should have the consistency of modeling dough.\nBreak off small pieces of marzipan to color, kneading in color thoroughly until you arrive at the desired color. Then blend the colored pieces into larger portions of dough. Dust a work surface and rolling pin with confectioners' sugar, and roll dough out to 1/4 inch thickness. Cut into desired shapes using small cookie cutters to make candies.\n",
        "picture_link": "IeMb/OCiFHBcFUdRDlpvWEkXq6Fszfe"
    },
    {
        "title": "Sweet and Sour Meatballs IV",
        "ingredients": [
            "5 teaspoons beef bouillon granules, divided ADVERTISEMENT",
            "1/4 cup boiling water ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "3/4 cup minced onion ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (20 ounce) can pineapple chunks, drained with juice reserved ADVERTISEMENT",
            "1/3 cup fresh lemon juice ADVERTISEMENT",
            "3 tablespoons packed brown sugar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon grated fresh ginger root ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, dissolve 2 teaspoons of the bouillon granules in 1/4 cup boiling water. In a large bowl, combine ground beef, bread crumbs, onion, and egg. Mix in the dissolved bouillon. Shape into meatballs, about 1 to 2 inches in diameter.\nIn a large saucepan over medium heat, brown the meatballs on all sides. In a small bowl, combine 1/4 cup of the reserved pineapple juice, lemon juice, brown sugar, soy sauce, remaining beef bouillon granules, and ginger. Pour into the pan with meatballs. Cover, and simmer for 25 minutes.\nIn a small bowl, combine remaining pineapple juice and cornstarch. Stir into meatball mixture, and simmer until thickened. Add green pepper and pineapple chunks; heat thoroughly.\n",
        "picture_link": "CuY5VPkwLxaXvI1k3xjB5GDVlxL5cuy"
    },
    {
        "title": "Mexican Meatloaf",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "4 (8 inch) flour tortillas ADVERTISEMENT",
            "3/4 cup fresh salsa ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix thoroughly the ground beef and taco seasoning; set aside. In a medium saucepan, heat the refried beans over medium low heat until they are completely heated through.\nPlace the ground beef mixture on a large piece of foil. Press the mixture into an approximately 1 inch thick square shape. Spread the refried beans evenly over the top of the flattened beef. Layer the flour tortillas on top of the refried beans, trimming the edges to fit the square. Layer tortillas with salsa and Cheddar cheese, staying 1/2 to 1 inch away from edges of the square.\nGently roll the layered beef into a Swiss roll shape, pressing and compacting the loaf as you go. Pinch and seal the edges. Wrap in the foil and seal.\nBake in preheated oven 40 to 45 minutes, or until no longer pink in the center. Cut loaf in half to test for doneness, if necessary.\n",
        "picture_link": "1jewjrH2WNkjphpb2d8nIKs15q.UtZi"
    },
    {
        "title": "Yam Soup",
        "ingredients": [
            "3 cups chicken broth ADVERTISEMENT",
            "2 pounds yams, diced ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup uncooked wild rice ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour chicken broth into a saucepan, with curry powder, salt, pepper, onion powder and garlic powder. Bring to a boil over medium heat. Add yam and onion, and simmer for about 20 minutes. Add rice, and cook for another 20 minutes, or until rice is tender.\n",
        "picture_link": "hOcWKUvKbGuV0K0nBtP0tUfBScoWS6W"
    },
    {
        "title": "Lebanese Garlic Sauce",
        "ingredients": [
            "4 bulbs garlic, cloves separated and peeled ADVERTISEMENT",
            "1 cup lemon juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the container of a blender, combine the garlic cloves, lemon juice and salt. Blend at medium speed until smooth. Continue blending while pouring olive oil into the blender in a thin stream. The mixture should become thick and white like salad dressing. Store refrigerated in a glass container.\n",
        "picture_link": "mJogVZ8LN6oMXrRXmomfUtSdEJvGKCO"
    },
    {
        "title": "Grilled Tropical Tuna Steaks",
        "ingredients": [
            "1/2 cup pineapple or other tropical fruit preserves ADVERTISEMENT",
            "1/4 cup hoisin sauce ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "4 (6 ounce) tuna steaks, about 1 inch thick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To prepare marinade, combine preserves, hoisin, lime juice, cilantro, ginger, and sesame oil in a small bowl. Stir well.\nPour into a resealable plastic bag or glass bowl; toss tuna with marinade to coat. Refrigerate for 1 hour.\nPreheat an outdoor grill for high heat and lightly oil grate.\nRemove tuna steaks from marinade, shake off excess, and discard remaining marinade. Cook on preheated grill for 4 to 5 minutes per side. Be careful not to overcook - the tuna should be lightly browned on the outside but still slightly pink in the middle. Serve immediately.\n",
        "picture_link": "3JRTMmcqJ/rEzgBLtXdULqFeu2EeLZq"
    },
    {
        "title": "Persian Fesenjun",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup finely ground walnuts ADVERTISEMENT",
            "1 (10 fluid ounce) bottle pomegranate paste or syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat. Cook and stir the onion until tender, and quickly brown the chicken on all sides. Remove from skillet, and set aside.\nPlace the ground walnuts in the remaining oil in the skillet. Over medium heat, cook and stir 5 to 10 minutes, until lightly browned.\nReturn the onion and chicken to the skillet with the walnuts, and blend in the pomegranate paste. Reduce heat to low, cover, and simmer 20 minutes, stirring occasionally, until chicken is no longer pink and juices run clear.\n",
        "picture_link": "MpknuWrJ7OQo1fD8/xJBQn1o.EZ0wtS"
    },
    {
        "title": "Donair",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/3 cup bread crumbs ADVERTISEMENT",
            "1 teaspoon cayenne pepper (optional) ADVERTISEMENT",
            "1 1/2 teaspoons paprika ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2/3 cup nonfat evaporated milk ADVERTISEMENT",
            "2/3 cup sugar ADVERTISEMENT",
            "1/3 cup vinegar ADVERTISEMENT",
            "6 pita bread rounds ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 300 degrees F (150 degrees C).\nIn a medium bowl, mix together the ground beef, bread crumbs, cayenne pepper, paprika, onion powder, garlic powder, ground black pepper, and salt. Press into an 8x8 inch square baking dish, or casserole dish.\nBake for 2 hours in the preheated oven, until cooked through. Set aside to cool for at least 1/2 hour, the meat will slice even better if it is actually chilled completely.\nTo make the sauce, combine the evaporated milk, sugar and vinegar in a jar with a lid, and shake well to blend. Set aside to thicken.\nHeat a large skillet over medium-high heat, and slice off thin slices of the meat loaf. Fry the slices briefly in the hot skillet, until browned on each side. Remove from the skillet, and keep warm. Flick a little water onto the hot skillet, and brown the pita breads a little on each side to soften.\nLoad up one side of pitas with meat slices, tomatoes and onion. Spoon sauce over the filling, and fold pitas in half, then towards the center. Voila, you're eating!\n",
        "picture_link": "jFyvL8AQbr9na392t52ii0JU59keTt2"
    },
    {
        "title": "Stuffed Butternut Squash",
        "ingredients": [
            "1 butternut squash, halved and seeded ADVERTISEMENT",
            "1/2 cup basmati rice ADVERTISEMENT",
            "6 Brussels sprouts, trimmed and quartered lengthwise ADVERTISEMENT",
            "1 medium carrot, peeled, sliced and julienned ADVERTISEMENT",
            "1/3 (15.5 ounce) can garbanzo beans ADVERTISEMENT",
            "1/4 cup soy milk ADVERTISEMENT",
            "3 tablespoons tamari ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Place squash in a baking dish with one inch of water, and cover with foil.\nBake squash in the preheated oven for 1 hour, or until flesh is fork-tender. Keep warm.\nIn a saucepan, bring water to a boil. Add rice and stir. Reduce heat, cover, and simmer for 20 minutes.\nMeanwhile, place Brussels sprouts, carrots, and garbanzo beans in a skillet over medium high heat. Stir together soy milk, tamari, turmeric, and garlic, and add to the skillet, tossing to coat. Cover, and simmer for 20 minutes, or until tender. Add a small amount of water or more soy-tamari mixture, as needed, to prevent drying out. Combine rice with vegetable mixture, and scoop into squash. Serve with additional tamari and season to taste. Enjoy!\n",
        "picture_link": "/qd7SjWjGhuZx2OdWt8/E4Kz0A5W2ty"
    },
    {
        "title": "Classic Irish Boiled Dinner",
        "ingredients": [
            "3 pounds smoked pork shoulder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 large onions, quartered ADVERTISEMENT",
            "6 potatoes, peeled ADVERTISEMENT",
            "8 ounces carrots, cut in half ADVERTISEMENT",
            "1 large head cabbage, quartered ADVERTISEMENT",
            "1 pound fresh green beans, trimmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the smoked pork into a large pot and fill with enough water to cover. Season with salt and pepper, cover and bring to a boil. Reduce heat to low and simmer for about 30 minutes.\nAdd the carrots, potato, cabbage and onions; cover and continue to simmer. Use kitchen string to tie the green beans into a bundle. Add them to the pot, cover and continue to cook until the carrots and potatoes are tender, about 25 minutes.\nTo serve, remove pork to a serving dish. Arrange vegetables around it. Allow the pork to rest about 10 minutes before slicing.\n",
        "picture_link": "GxVlEsvuLCXq6cnLXuGnKZ8A450NDLa"
    },
    {
        "title": "Lemon Chicken with Broccoli",
        "ingredients": [
            "1 large lemon ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 pounds chicken parts ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 packets Swanson® Flavor Boost™ Concentrated Chicken Broth ADVERTISEMENT",
            "3 cups fresh broccoli florets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grate 1 tablespoon zest and squeeze 1/4 cup juice from the lemon.\nHeat 1 tablespoon oil in a 12-inch skillet over medium-high heat. Add the chicken and cook until well browned on all sides. Remove the chicken from the skillet. Pour off any fat.\nReduce the heat to medium. Heat the remaining oil in the skillet. Add the onion and garlic and cook and stir for 2 minutes. Stir in the concentrated broth and lemon juice. Return the chicken to the skillet. Reduce the heat to low. Cover and cook for 20 minutes or until the chicken is cooked through.\nStir the broccoli and lemon zest in the skillet. Cover and cook until the broccoli is tender-crisp.\n",
        "picture_link": "row97tchitamcKHv2DJEi.w3Ecgi81S"
    },
    {
        "title": "Raw Vegan Brownies",
        "ingredients": [
            "1 cup raisins ADVERTISEMENT",
            "1 cup almonds ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place raisins, almonds, and cocoa powder in a food processor or blender. Blend until a 'dough' forms.\nPress dough into an 8x8 pan. Slice and serve.\n",
        "picture_link": "AQriSlvoiiOOHBIcjHZtqw2QmMz9R1e"
    },
    {
        "title": "Sweet and Sour Pickled Beets",
        "ingredients": [
            "1 (15 ounce) can sliced beets, drained with liquid reserved ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "6 whole cloves ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine the liquid from the beets, vinegar, sugar, cloves, cinnamon and salt. Stir to dissolve the sugar and bring to a boil. Simmer over medium heat for 5 minutes. Add the beets and simmer for 5 more minutes. Use tongs to transfer the beets to a jar. Pour the liquid over them to cover. Cover and cool to room temperature. Refrigerate until serving.\n",
        "picture_link": "fiSh7dDwx1xCrt/7BD81/1zqNWtbRte"
    },
    {
        "title": "Zucchini and Feta Cheese Fritters (Kolokithokeftedes)",
        "ingredients": [
            "1 potato ADVERTISEMENT",
            "3 zucchini, shredded ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 sweet onion, finely chopped ADVERTISEMENT",
            "10 fresh mint leaves, finely chopped ADVERTISEMENT",
            "1 (8 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "6 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup olive oil, or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of lightly salted water to a boil, and place the potato into the water. Boil until tender, about 20 minutes; remove and let cool. When cool enough to handle, finely dice.\nIn a bowl, mix together the cooked potato, zucchini, egg, onion, mint leaves, feta cheese, and bread crumbs to make a mixture that holds together when pressed lightly.\nPlace flour into a separate shallow dish. Form the zucchini mixture into small patties, and dredge patties in flour on both sides.\nHeat the olive oil in a skillet over medium heat. Pan-fry the zucchini patties until golden brown, 3 to 5 minutes per side. Drain the patties on paper towels; serve hot.\n",
        "picture_link": "Lfd7X8W9WKPTPL0KuAmM.ZIMJuTpxWa"
    },
    {
        "title": "Chocolate Chip Zucchini Bread",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 cups grated zucchini ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nGrease and flour two 4x8-inch loaf pans.\nBeat eggs in a large bowl until light and foamy; mix in vegetable oil, sugar, vanilla extract, and zucchini until thoroughly combined.\nWhisk flour, cocoa powder, salt, baking soda, and baking powder together in a separate bowl.\nStir the flour mixture into the zucchini mixture.\nMix in chopped walnuts and chocolate chips.\nPour the batter into the prepared loaf pans.\nBake in the preheated oven until a toothpick inserted into the center of the loaves comes out clean, about 1 hour.\nLet cool in pans for 10 minutes before removing to finish cooling on wire racks.\n",
        "picture_link": "qqMKZGCAzJexvG0WWkiBgKJ7gLWxrRC"
    }
]