[
    {
        "title": "Mocha Coffee Mix",
        "ingredients": [
            "1 1/4 cups instant coffee granules ADVERTISEMENT",
            "7 cups dry milk powder ADVERTISEMENT",
            "5 3/4 cups powdered chocolate drink mix ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 3/4 cups powdered non-dairy creamer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together instant coffee, milk powder, chocolate drink mix, confectioners' sugar and powdered creamer. Store in an airtight container.\nTo serve, place 4 tablespoons of mixture into a coffee mug. Stir in 1 cup boiling water.\n",
        "picture_link": "/iaDMmfTqP/Kiiy/vM/v937dls8KO.K"
    },
    {
        "title": "Honey Flaked Chicken",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "4 cups cornflakes cereal ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "4 boneless, skinless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\nPlace the flour in a small bowl and the cornflakes in a medium bowl. In a separate small bowl, mix the honey and milk. Dredge chicken in the flour, dip in the honey mixture, and thoroughly coat with the cornflakes.\nArrange chicken in the prepared baking dish. Bake 25 minutes in the preheated oven, or until no longer pink and juices run clear.\n",
        "picture_link": "9yGXQ2dbEHrdxrhBTbky9KApkCNXKT6"
    },
    {
        "title": "Best Potatoes You'll Ever Taste",
        "ingredients": [
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "5 potatoes, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix mayonnaise, garlic, oregano, salt , and pepper. Set aside.\nBring a large pot of salted water to a boil. Add potatoes, and cook until almost done, about 10 minutes. Don't overcook otherwise the potatoes will break apart. Drain, and cool.\nPreheat an outdoor grill for high heat. Lightly grease a large piece of aluminum foil.\nArrange potatoes in the prepared aluminum foil. Spoon the mayonnaise mixture over the potatoes. Place on the prepared grill, and cook until potatoes are tender and mayonnaise mixture is lightly browned, about 10 minutes.\n",
        "picture_link": "q36C5Ww3rkAas.zQkaTxM7ui/JYVZsC"
    },
    {
        "title": "Easter Surprise Cupcakes",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2/3 cup margarine, softened ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "24 small chocolate eggs, unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 24 muffin cups, or use paper liners. Sift together the flour, baking powder and salt. Set aside.\nCream together the margarine, brown sugar and white sugar in a large bowl until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the milk, mixing just until incorporated.\nFill each muffin cup 1/3 full, and place a chocolate egg in the center of each. Top with remaining batter until cups are 2/3 full.\nBake in preheated oven for 18 to 20 minutes, or until golden brown, and tops spring back when lightly tapped.\n",
        "picture_link": "KQj4sTPFBNl72/MKp1rKnyaDJcKH7hu"
    },
    {
        "title": "Grape Leaves Aleppo",
        "ingredients": [
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 pounds ground lamb ADVERTISEMENT",
            "2 (16 ounce) jars grape leaves, drained and rinsed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon ground allspice ADVERTISEMENT",
            "6 cloves garlic, sliced ADVERTISEMENT",
            "1 cup lemon juice ADVERTISEMENT",
            "2 kalamata olives (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak rice in cold water, and drain. In a large bowl, mix together the ground lamb, rice, allspice, salt and pepper until well blended. Place about 1 tablespoon of the meat mixture onto the center of each leaf. Fold the leaf over once, turn in the edges on each side, and then roll the leaf closed.\nStack the leaf-rolls in a large pot, covering each layer with slices of garlic. Add just enough water to cover the rolls, then pour in the lemon juice. Add the olives to the pot for flavoring, if desired. Place a plate on top of the rolls to keep them under water.\nBring to a boil, then reduce heat, cover and simmer for 1 hour and 15 minutes. Taste the rice for doneness. Grape leaves taste even better after sitting for several hours. Serve and enjoy.\n",
        "picture_link": "p7EdLPrLXDyDC3iMgJVykvAjNV7RFBe"
    },
    {
        "title": "A Potato Salad Sandwich",
        "ingredients": [
            "1 hamburger bun ADVERTISEMENT",
            "1 1/2 tablespoons mayonnaise ADVERTISEMENT",
            "2 leaves of lettuce ADVERTISEMENT",
            "2 slices tomato ADVERTISEMENT",
            "1/3 cup prepared potato salad ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Open bun and spread each side with mayonnaise. Place lettuce leaves and tomato slices on bottom half of bun. Scoop potato salad onto tomato, and gently spread toward edges of bun. Cover with top of bun.\n",
        "picture_link": "CUCGTScujeKOuN2BVUEqtHQTlbYyghK"
    },
    {
        "title": "Chocolate Press Cookies",
        "ingredients": [
            "5/8 cup shortening ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1 beaten egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 teaspoons milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "6 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup multicolored candy sprinkles (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together the shortening and sugar until smooth. Beat in the egg, and stir in vanilla and milk. Combine the flour, cocoa, and salt; stir into the creamed mixture until just blended. Fill cookie press, and press onto ungreased baking sheets. Decorate with sprinkles if desired.\nBake for 10 minutes in the preheated oven. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "sqB0.l3UqRFU.7xRq/RXJ47rRkM8JWW"
    },
    {
        "title": "Baked Chicken and Onions",
        "ingredients": [
            "2 medium onions, sliced into rings ADVERTISEMENT",
            "1 head garlic, cloves separated, peeled, and sliced ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "paprika to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\nLayer the bottom of the baking dish with 1/2 the onions and 1/2 the garlic slices. Pour lemon juice and white wine into the baking dish. Season chicken with paprika, salt, and pepper, and place in the baking dish. Top with remaining onions and garlic.\nBake 25 minutes in the preheated oven, or until chicken juices run clear.\n",
        "picture_link": "xiGz4Djq1mSGNNhqIc.d/IL6Jgj.U9y"
    },
    {
        "title": "Hot Cranberry Tea",
        "ingredients": [
            "3 1/2 quarts water ADVERTISEMENT",
            "1 (12 ounce) package cranberries ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 oranges, juiced ADVERTISEMENT",
            "2 lemons, juiced ADVERTISEMENT",
            "12 whole cloves ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, combine water and cranberries. Bring to a boil, reduce heat, and simmer for 30 minutes. Add sugar, orange juice, lemon juice, cloves and cinnamon sticks. Cover, and steep for 1 hour.\n",
        "picture_link": "vnCa20HfuXRGHwfx/gL1tR.4/HI.IXy"
    },
    {
        "title": "Island Shrimp and Rice",
        "ingredients": [
            "8 ounces bacon ADVERTISEMENT",
            "3 tablespoons bacon drippings ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "1 1/2 cups uncooked long grain white rice ADVERTISEMENT",
            "3 1/4 cups chicken broth, divided ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "2 teaspoons fresh lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 pounds medium shrimp - peeled and deveined ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, heavy pot over medium-high heat, and cook until evenly brown. Remove, and set aside. Drain drippings, reserving 3 tablespoons in the pot.\nPlace onion in the pot with the bacon drippings, and cook 5 minutes over medium heat, stirring constantly, until tender. Mix in the rice, 2 1/4 cups broth, tomatoes with juice, lemon juice, and Worcestershire sauce. Season with salt, nutmeg, cayenne pepper, and black pepper. Bring to a boil, reduce heat to low, cover, and simmer 20 minutes.\nStir the cooked bacon, remaining 1 cup broth, and shrimp into the pot. Continue cooking 10 minutes, uncovered, over low heat. Sprinkle with parsley to serve.\n",
        "picture_link": "31gp.o6JjwVvdYGHRBELE0AHLm0opQG"
    },
    {
        "title": "Vietnamese-Style Chicken Curry Soup",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (3 pound) whole chicken, skin removed and cut into pieces ADVERTISEMENT",
            "1 onion, cut into chunks ADVERTISEMENT",
            "2 shallots, thinly sliced ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/8 cup thinly sliced fresh ginger root ADVERTISEMENT",
            "1 stalk lemon grass, cut into 2 inch pieces ADVERTISEMENT",
            "4 tablespoons curry powder ADVERTISEMENT",
            "1 green bell pepper, cut into 1 inch pieces ADVERTISEMENT",
            "2 carrots, sliced diagonally ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "2 kaffir lime leaves ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 teaspoons red pepper flakes ADVERTISEMENT",
            "8 small potatoes, quartered ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 bunch fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large stock pot over medium heat. Cook chicken and onions in oil until onions are soft and translucent; remove onions and chicken from pot and set aside.\nSaute shallots in pot for about 1 minute, then stir in garlic, ginger, lemon grass and curry powder. Continue to cook for about 5 minutes, then stir in bell pepper and carrots. Return chicken and onion to pot and stir in chicken broth, water and fish sauce. Season with lime leaves, bay leaf and red pepper flakes.\nBring to a boil and introduce potatoes. Return to a boil and pour in coconut milk. Reduce heat and simmer 40 to 60 minutes, until potatoes and chicken are tender. Garnish each dish with a sprig of fresh cilantro.\n",
        "picture_link": ".2kC32ZnTRe9MebjElRiCo3JjjJN/M6"
    },
    {
        "title": "Mozzarella Meat Whirl",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/2 cup soft bread crumbs ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 tablespoon dry mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "1 (6 ounce) package mozzarella cheese, sliced ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large bowl, combine beef, bread crumbs, egg, mustard, salt and pepper; mix well. On a sheet of waxed paper, pat out beef mixture into a large rectangle. Cover the surface with slices of cheese. Starting with the short side of the rectangle, roll up and remove waxed paper simultaneously. Place in a shallow baking dish. In a small bowl, mix together ketchup, water, and Worcestershire sauce; pour over beef.\nBake in preheated oven for 1 hour and 10 minutes.\n",
        "picture_link": "PRRbC.5A2Ul3Ri2R2uqTjQC4RD4agKi"
    },
    {
        "title": "Amazing Banana Sorbet",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup mashed banana ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, stir together sugar and water. Bring to a boil, then remove from heat and allow to cool.\nWhen the sugar syrup is cool, stir in bananas. Pour into a freezer - safe baking dish. Freeze for 3 to 4 hours, until set at the edges.\nRemove from the freezer and transfer to a mixing bowl. Use an electric mixer to beat until smooth. Return to the freezer until gently set, at least 2 hours.\n",
        "picture_link": "OSNsx4qLtVeJJapAZxZqHX.0BU7s4Vm"
    },
    {
        "title": "Butterscotch Cookie Bars",
        "ingredients": [
            "1 cup butterscotch chips ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place butterscotch chips and butter into a glass bowl. Heat in the microwave for about 3 minutes, stirring at 30 second intervals until smooth. Set aside to cool until firm.\nPreheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a large bowl, beat the butterscotch chip mixture with eggs and vanilla until well blended. Combine the flour, baking powder, and salt; stir into the batter until evenly mixed. Mix in the brown sugar, chocolate chips, walnuts, and raisins. Spread the batter evenly in the prepared pan.\nBake for 25 minutes in the preheated oven, just until the bars begin to pull away from the sides of the pan. Cut into squares while warm.\n",
        "picture_link": "g99zRieGGFIpUYWTjsXDII0Yh5XqrTa"
    },
    {
        "title": "Simple Sponge Cake",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/2 cup castor sugar or superfine sugar ADVERTISEMENT",
            "2/3 cup self-rising flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease an 8 or 9 inch round cake pan.\nIn a medium bowl, whip together the eggs and castor sugar until fluffy. Fold in flour. Pour into the prepared pan.\nBake for 20 minutes in the preheated oven, or until the top of the cake springs back when lightly pressed. Cool in the pan over a wire rack.\n",
        "picture_link": "wQo64hXvAMPHTli5b5EOeV3N3xZn6Yy"
    },
    {
        "title": "Rhubarb Slush",
        "ingredients": [
            "6 cups fresh rhubarb, chopped ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 (6 ounce) can frozen orange juice concentrate, thawed ADVERTISEMENT",
            "1 (6 ounce) can frozen lemonade concentrate, thawed ADVERTISEMENT",
            "1 cup gin (optional) ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 (2 liter) bottle lemon-lime flavored carbonated beverage, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rhubarb in a large saucepan with water to cover. Bring to a boil over medium-high heat, and cook until tender. Drain and mash or puree in a blender.\nStir together the rhubarb puree, sugar, orange juice concentrate, lemonade concentrate, gin and water. Freeze. Place scoops of the frozen mixture into serving glasses, and fill the rest of the glass with lemon-lime soda.\n",
        "picture_link": "kC8H.C.4rmWYHMyjbzR0WBnW.6He.72"
    },
    {
        "title": "Brie and Mushroom Phyllo Puffs",
        "ingredients": [
            "1 cup butter, divided ADVERTISEMENT",
            "8 crimini mushrooms, sliced ADVERTISEMENT",
            "6 shiitake mushrooms, sliced ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 (8 ounce) wedge Brie cheese ADVERTISEMENT",
            "1 (16 ounce) package frozen phyllo pastry, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 2 1/2 tablespoons of butter in a skillet over medium heat. Saute crimini and shiitake mushrooms with garlic until tender. Remove from heat, and set aside. Melt remaining butter in a dish in the microwave.\nPreheat the oven to 375 degrees F (190 degrees C).\nUnroll the phyllo dough, and cut into three equal strips, about 3x12 inches. I like to use kitchen shears for this. Place two sheets of the phyllo onto a cutting board or other work surface, and cover the stack of remaining sheets with a damp paper towel to keep them from drying out.\nBrush the top sheet of phyllo with melted butter, and place a raspberry sized dab of brie on one end. Top with a small amount of the mushroom mixture. Fold phyllo dough over the filling to make a triangle. Continue folding back and forth in a triangle shape, brushing the exposed side of the dough as you go. Seal the end closed with a little water or butter. Place on an ungreased baking sheet, and repeat with remaining dough and filling.\nBake the triangles for 20 to 25 minutes in the preheated oven, turning over once during baking, until golden brown.\n",
        "picture_link": "hGKGUDlMhPUS7dwYYTU9686s.30bOZK"
    },
    {
        "title": "Egg Foo Yung with Mushroom Sauce",
        "ingredients": [
            "1 large green onion ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "3/4 cup bean sprouts ADVERTISEMENT",
            "3 tablespoons soy sauce, divided ADVERTISEMENT",
            "2 tablespoons peanut oil, divided ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "4 teaspoons cornstarch ADVERTISEMENT",
            "1 cup chicken or beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thinly slice green onion, and reserve 1 tablespoon of the top for garnish. Stir the remaining onion into the egg along with the bean sprouts and 1 tablespoon of soy sauce.\nHeat 1 tablespoon of peanut oil in a large nonstick skillet over medium-high heat until hot. For each pancake, drop 1/4 cup of egg mixture into the hot oil. Cook until the bottoms are set, 1 to 2 minutes, then turn over and continue cooking for another 1 to 2 minutes until cooked through. Transfer to a warm serving plate while you make the remaining pancakes.\nHeat the remaining 1 tablespoon of peanut oil in the skillet and cook the mushrooms with the remaining 2 tablespoons of soy sauce until the mushrooms are soft, about 3 minutes. Dissolve the cornstarch in the broth, stir into the mushrooms, and cook until thickened. To serve, pour the sauce over the egg foo yung pancakes, and sprinkle with the reserved onion.\n",
        "picture_link": "wzFaRZEP350tKGJ/s/0kSA3ybMGb/s2"
    },
    {
        "title": "Apple Shortbread Pie",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup chilled butter, diced ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "1 1/4 pounds Golden Delicious apple - peeled, cored and cut into 1/4 inch slices ADVERTISEMENT",
            "1/4 cup light brown sugar, packed ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C.)\nSift four, 1/2 cup sugar and salt into a large bowl. Cut in butter until mixture resembles coarse crumbs. Fold in egg yolks (mixture will be crumbly). Remove 1/4 of mixture, and set aside. Press remainder onto bottom and sides an 8 inch tart shell or pie pan.\nIn a large bowl, combine apples, brown sugar, 1 tablespoon flour, cinnamon and nutmeg. Place apples into crust, and sprinkle reserved crumb mixture evenly over top.\nPlace pie on a baking sheet, and bake in preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C) and continue baking 20 minutes, or until top is golden brown and filling is bubbling.\n",
        "picture_link": "F3mbsjG5oNlLEuKrWFPlB65lICMUB7S"
    },
    {
        "title": "Parmesan Sesame Chicken",
        "ingredients": [
            "1 cup bread crumbs ADVERTISEMENT",
            "1/4 cup Parmesan cheese ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "4 boneless, skinless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, mix the bread crumbs, Parmesan cheese, and sesame seeds. Place the egg in a separate bowl. Dip the chicken in the egg, then dip into the bread crumb mixture to coat. Place the chicken breasts in a shallow baking dish.\nBake chicken 20 to 30 minutes in the preheated oven, until juices run clear.\n",
        "picture_link": "zH0UvaMPLCm19efnFIQQwn/rc13I1Im"
    },
    {
        "title": "Pot Roast Caribe",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (3 pound) boneless beef chuck roast ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "2 large potatoes, cut into large chunks ADVERTISEMENT",
            "3 carrots, sliced ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium-high heat. Place the roast into the hot oil and cook, turning frequently, until browned on all sides. Remove from the skillet and place in a slow cooker.\nCook garlic and onions in the skillet in the meat drippings until tender. Stir in the salt and tomato sauce. Combine the sugar, flour, cocoa powder, chili powder, oregano, cumin, coriander, cinnamon, and orange zest; stir into the tomato sauce. Pour the tomato sauce over the roast in the slow cooker. Add potatoes, carrots and celery. Cover, and cook on Low for 6 to 8 hours, or until meat is tender. Garnish with sliced almonds before serving.\n",
        "picture_link": "cMw0dbnR3a9Bw7Iwpx/QHbbp5bk/LK."
    },
    {
        "title": "Mexican Orzo Salad",
        "ingredients": [
            "1 (16 ounce) package orzo pasta ADVERTISEMENT",
            "1 small red bell pepper, chopped ADVERTISEMENT",
            "1 small yellow bell pepper, chopped ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 small red onion, finely chopped ADVERTISEMENT",
            "1 (15 ounce) can chickpeas, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (8.75 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 cup chopped cilantro leaves ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "pepper to taste ADVERTISEMENT",
            "5 limes, juiced ADVERTISEMENT",
            "6 tablespoons canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a boil over high heat. Stir in the orzo, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Drain.\nPlace the drained orzo in a large salad bowl, and fold in the red pepper, yellow pepper, green onions, red onion, chickpeas, kidney beans, black beans, corn, cilantro, and salt and pepper to taste. Pour the lime juice and oil over the salad, toss to coat, and refrigerate at least 2 hours to chill before serving.\n",
        "picture_link": "ASzpVBjL/hXZTgW0ZfTnfO1mbSn8vTC"
    },
    {
        "title": "Triple Bypasses",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon red pepper flakes, or to taste ADVERTISEMENT",
            "6 hot dogs ADVERTISEMENT",
            "1 pound sliced bacon ADVERTISEMENT",
            "toothpicks ADVERTISEMENT",
            "2 cups barbecue sauce, your choice ADVERTISEMENT",
            "6 hoagie rolls, split lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat. Pour barbeque sauce into a square baking dish, and set aside.\nIn a medium bowl, stir together the ground beef, egg, onion, salt, pepper, and red pepper flakes using your hands. Pack enough meat around each hot dog to completely cover it, but not too thick. Wrap 2 slices of bacon around each beef covered hot dog, and secure with toothpicks.\nLightly oil the grilling surface, and place the bacon-wrapped hamburger covered hot dogs on the grill. Cook for about 10 minutes, turning occasionally - but carefully, until the beef is cooked through and bacon is nicely browned. Remove from the grill, and roll in the dish of barbeque sauce to coat. Remove toothpicks, and serve on hoagie rolls.\n",
        "picture_link": "naCRLtF.0DWOWiYiBeLvF6u9icC0FH."
    },
    {
        "title": "Warm Goat Cheese Sandwiches",
        "ingredients": [
            "1 (5 ounce) goat cheese, softened ADVERTISEMENT",
            "1/2 cup basil pesto ADVERTISEMENT",
            "3/4 cup sun-dried tomatoes, softened and chopped ADVERTISEMENT",
            "2 pita breads, cut in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nOpen the pita bread halves up into pockets. Spread goat cheese onto one side of the inside of each pita pocket. Spread a layer of pesto over the goat cheese. Sprinkle with sun-dried tomatoes. Place pita halves onto a baking sheet.\nBake for 3 to 5 minutes in the preheated oven, just until the filling is warm, and the bread is lightly toasted.\n",
        "picture_link": "J0Jzrw5BSljJkEcbTQmJsMXZAAPpJ5u"
    },
    {
        "title": "Ricotta Breakfast Pancakes",
        "ingredients": [
            "2 1/2 cups pancake mix ADVERTISEMENT",
            "2 2/3 cups skim milk, or as needed ADVERTISEMENT",
            "2 cups part-skim ricotta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the pancake mix, skim milk, and ricotta in a bowl until smooth. Batter should be thick; add more milk if necessary to get desired consistency.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter.\n",
        "picture_link": "ly0gj4zGJEbhrfS1ztz/Wl9kYuuxz/y"
    },
    {
        "title": "Baked Bean Sandwiches",
        "ingredients": [
            "4 English muffins, split ADVERTISEMENT",
            "1 (16 ounce) can maple cured baked beans ADVERTISEMENT",
            "1 medium onion, thinly sliced ADVERTISEMENT",
            "2 medium tomatoes, cut into 1/4 inch slices ADVERTISEMENT",
            "4 slices Cheddar cheese ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nArrange the English muffin halves on a baking sheet. Place an equal amount of baked beans on each muffin half. Layer beans with onion, tomato, cheese, and bacon.\nBake 20 minutes in the preheated oven. Set oven to broil, and continue cooking 1 to 2 minutes, until bacon is crisp. Watch constantly during broiling to make sure bacon does not burn. Serve immediately.\n",
        "picture_link": "F2WtcgB4.wzCFDh5XqseBm41hH626M."
    },
    {
        "title": "English Flapjack",
        "ingredients": [
            "1/2 cup butter or margarine ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "4 tablespoons golden syrup or corn syrup ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a saucepan over low heat, combine the butter, brown sugar and golden syrup. Cook, stirring occasionally, until butter and sugar have melted. Stir in the oats and raisins until coated. Pour into an 7 or 8 inch square baking pan. The mixture should be about 1 inch thick.\nBake for 30 minutes in the preheated oven, or until the top is golden. Cut into squares, then leave to cool completely before removing from the pan.\n",
        "picture_link": "2qRrtfy2D845Fvf5mX3Fl8wAOrtReH6"
    },
    {
        "title": "Nutty Brown Rice Salad",
        "ingredients": [
            "1 cup uncooked brown rice ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "1/4 cup sliced fresh mushrooms ADVERTISEMENT",
            "1/4 cup bite-size broccoli florets ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped red bell pepper ADVERTISEMENT",
            "1/4 cup chopped yellow bell pepper ADVERTISEMENT",
            "2 tablespoons chopped raw almonds ADVERTISEMENT",
            "1/4 teaspoon coarse black pepper ADVERTISEMENT",
            "2 tablespoons fat free Italian-style dressing ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the rice and water in a small saucepan; bring to a boil over high heat. Cover, and reduce the heat to medium-low. Simmer until the rice is tender, and the liquid has been absorbed, 45 to 50 minutes. Remove from heat and allow to cool.\nPlace cooled rice in a large bowl. Stir in the kidney beans, red onions, mushrooms, broccoli, bell peppers, and almonds; season with pepper. Toss salad with the Italian dressing and olive oil.\nChill for at least one hour before serving.\n",
        "picture_link": "XSsdxyL0VD9xFzGH.9//SwA2TqOCydC"
    },
    {
        "title": "Campfire Skillet Breakfast",
        "ingredients": [
            "1/2 pound sliced bacon ADVERTISEMENT",
            "4 cups potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 onion, chopped (optional) ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon to desired doneness in a cast iron skillet over the slow burning coals of a campfire. Remove bacon from the skillet and set aside. Stir the potatoes and onion into the hot bacon fat. Cover, and cook until the potatoes are soft, about 10 to 12 minutes.\nCrumble the bacon into the potatoes. Stir in the eggs, cover, and cook until set through, about 2 minutes. Sprinkle with the cheese, and allow to melt before serving.\n",
        "picture_link": "PbYeOf0o9MEnh9OrDW3L55XwG04i9g2"
    },
    {
        "title": "Fig and Goat Cheese Pizza",
        "ingredients": [
            "1 cup lukewarm water ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "8 dried figs ADVERTISEMENT",
            "1 medium red onion, thinly sliced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon fennel seeds ADVERTISEMENT",
            "4 ounces goat cheese ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the water into a large bowl, and sprinkle yeast over the top. Let stand for a few minutes to dissolve. Mix in the oil, salt, and flour to make a dough. When the dough is too stiff to stir, turn out onto a floured surface, and knead for about 5 minutes. Place into an oiled bowl, and cover with a clean towel. Set aside to rise for about 45 minutes.\nPlace the figs into a small bowl, and pour boiling water over them. Let stand for about 10 minutes, then drain and chop. Set aside.\nMeanwhile, heat 1 tablespoon of oil in a skillet over medium heat. Add the onions; cook and stir until they are wilted and soft. Reduce heat to low, and season with salt. Continue to cook and stir until the onions are a dark brown, 5 to 10 minutes. Stir in the thyme, fennel seed and figs, and remove from the heat.\nPreheat the oven to 450 degrees F (220 degrees C). Punch down the pizza dough, and stretch into a circle about 1/4 inch thick. Place on a lightly greased pizza pan or baking sheet. Brush the surface lightly with remaining olive oil. Spread the onion and fig mixture over the crust. It will be sparse, but there is plenty of flavor. Dot with pieces of goat cheese.\nBake for 15 to 18 minutes in the preheated oven, or until the crust has turned golden brown at the edges.\n",
        "picture_link": "2Bs7PJsAweGqTip8lW8CLLtrqz34scC"
    },
    {
        "title": "Turkey Polish Sausage and Peppers",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 medium yellow bell peppers, seeded and diced ADVERTISEMENT",
            "2 medium red bell peppers, seeded and diced ADVERTISEMENT",
            "1 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 medium zucchini, cubed ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "1 tablespoon steak seasoning ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 (16 ounce) package turkey kielbasa, sliced ADVERTISEMENT",
            "1 tablespoon balsamic vinegar, or to taste ADVERTISEMENT",
            "grated Parmesan cheese for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Add the red and yellow bell peppers, mushrooms, zucchini, onion and garlic, and stir to cook evenly. Season with steak seasoning and onion powder. Cover, and cook for about 10 minutes.\nAdd the sausage to the skillet, and cook, stirring occasionally, for another 10 minutes. Just before serving, add a splash of balsamic vinegar, and sprinkle liberally with Parmesan cheese.\n",
        "picture_link": "3EjgAC.DA71r/1ovGiPMVkxPL78p8LO"
    },
    {
        "title": "Pizza with Pepper, Onion and Feta",
        "ingredients": [
            "1 (12 inch) thin pizza crust (homemade or prepared, such as Boboli) ADVERTISEMENT",
            "3 cups chopped bell peppers (red, green, yellow) ADVERTISEMENT",
            "1 cup sliced red or yellow onion, pulled into rings ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 1/2 teaspoons dried Italian herbs ADVERTISEMENT",
            "Salt, to taste (optional) ADVERTISEMENT",
            "Crushed red pepper flakes, to taste (optional) ADVERTISEMENT",
            "3/4 cup crumbled herbed feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees. Lay crust on pizza pan or cookie sheet. In a bowl, combine remaining ingredients except cheese; spoon over crust. Top with cheese. Bake 10-12 minutes, or until vegetables are crispy-tender.\n",
        "picture_link": "cTdjbVF.QGJUZVgxsH31Ucz0h9GpaTS"
    },
    {
        "title": "Gramma's Cream of Broccoli",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 cup chopped broccoli ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "14 1/2 ounces evaporated milk ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 1/2 teaspoons grated onion ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, bring 3 cups water and salt to a boil. Cook broccoli in boiling water, uncovered, for 10 to 12 minutes. Drain, place broccoli in a small bowl, and mash.\nMelt butter in a large saucepan over medium heat. Mix in flour, and then gradually whisk in milk and water; stir continuously until liquid begins to boil. Stir in grated onion and mashed broccoli. Season with remaining salt.\n",
        "picture_link": "FY8AlG6dmVhh3Z0XlwcpPvD58G05USu"
    },
    {
        "title": "Tuna Piccata Pasta Salad",
        "ingredients": [
            "6 ounces angel hair pasta ADVERTISEMENT",
            "1 1/2 tablespoons fresh lemon juice ADVERTISEMENT",
            "3/4 teaspoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "1 (9 ounce) can solid white tuna packed in water, drained ADVERTISEMENT",
            "2 teaspoons capers, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of lightly salted water to boil. Add pasta, and cook until al dente, about 8 to 10 minutes. Drain, and set aside.\nIn a large bowl, whisk together lemon juice, mustard, and mayonnaise. Season with salt and pepper to taste. Slowly whisk in olive oil. Add tuna, separating into thick chunks. Add capers, and stir to combine. Pour pasta into tuna mixture, and stir gently to combine. Cover, and refrigerate.\n",
        "picture_link": "HHJPvjjWJjIvh73B/xvy/mem7W11lrK"
    },
    {
        "title": "Chicken and Potato Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 1/2 pounds skinless, boneless chicken breast halves - diced ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "6 medium potatoes, diced ADVERTISEMENT",
            "1 (15 ounce) can carrots, drained ADVERTISEMENT",
            "1 (10 ounce) can peas, drained ADVERTISEMENT",
            "1 (11 ounce) can corn, drained ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups water, or as needed ADVERTISEMENT",
            "hot pepper sauce to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat, and cook the chicken 10 minutes, or until evenly browned and juices run clear.\nMix the onion into pot with the chicken. Mix in potatoes, carrots, peas, and corn. Pour in milk an enough water to cover all ingredients. Season with hot sauce, salt, and pepper. Bring to a boil. Reduce heat to low, and continue cooking 30 minutes, stirring occasionally, until potatoes are tender.\n",
        "picture_link": "RVLijCTsiC1qEeKnM7RoAUMnB410ySC"
    },
    {
        "title": "Strawberry-Sauced Crunchy Fruit Salad",
        "ingredients": [
            "2 1/2 cups crispy rice cereal ADVERTISEMENT",
            "1 1/2 cups chopped hazelnuts ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup margarine, melted ADVERTISEMENT",
            "1 pound fresh or frozen sliced strawberries ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1 tablespoon vanilla sugar ADVERTISEMENT",
            "2 Red Delicious apples, cored and diced ADVERTISEMENT",
            "2 Golden Delicious apples, cored and diced ADVERTISEMENT",
            "2 Granny Smith apples, cored and diced ADVERTISEMENT",
            "4 seedless oranges, peeled and diced ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Place the rice cereal and nuts into a baking pan. Stir in the brown sugar and margarine. Bake for 10 to 15 minutes, until toasty. Stir occasionally. Set aside to cool.\nIn the container of a blender or large food processor, combine the strawberries, orange juice, confectioners' sugar and vanilla sugar. Puree into a smooth sauce. Set aside.\nTo make the salad, toss the red, green and yellow apples with oranges and pineapple in a large serving bowl. Sprinkle with the nut crunch and spoon strawberry sauce over the top. Or you can serve the toppings on the side.\n",
        "picture_link": "/vZ2mb61CxOgPzrMAYbJ2O7fZwGSlSW"
    },
    {
        "title": "Sunshine Hummus Melts",
        "ingredients": [
            "8 slices multigrain bread ADVERTISEMENT",
            "1 cup hummus ADVERTISEMENT",
            "2 Granny Smith apples, thinly sliced ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler. Lay out the bread on a baking sheet.\nBroil the bread until lightly toasted, 2 to 4 minutes. Carefully turn the bread over on the baking sheet and place back under the broiler to lightly toast the other side, 2 to 4 minutes.\nTake the bread from the oven and spread 2 tablespoons of hummus on each piece. Lay the apple slices on top of the hummus and sprinkle the cheese over the apples.\nBroil the sandwiches open-faced until the cheese is melted and bubbly, 3 to 4 minutes. Sandwich two slices of bread together, to make four sandwiches.\n",
        "picture_link": "TpaiRvTqGLvfgZv4uRZ8jD1ZQRKWjcW"
    },
    {
        "title": "Ginger Orange Glazed Chicken Wings",
        "ingredients": [
            "1/2 cup frozen orange juice concentrate, thawed and undiluted ADVERTISEMENT",
            "3 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/4 cup hoisin sauce ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "3 tablespoons minced peeled fresh ginger ADVERTISEMENT",
            "3 cloves fresh garlic, minced ADVERTISEMENT",
            "2 pounds chicken wings ADVERTISEMENT",
            "3 medium green onions, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, resealable bag, mix the orange juice concentrate, lemon juice, hoisin sauce, vegetable oil, sugar, ginger, and fresh garlic. Add chicken wings, seal, and shake to coat evenly. Refrigerate overnight.\nPreheat oven to 400 degrees F (200 degrees C). Line a large baking sheet with aluminum foil.\nSpread wings on foil with marinade, and bake for 45 minutes, until brown and shiny. Transfer to serving platter, and garnish with green onions.\n",
        "picture_link": "Mc0XBeYRoDKyTW.7MI09WWXWcxOLbLy"
    },
    {
        "title": "Pork in Peanut Sauce",
        "ingredients": [
            "2 teaspoons chopped fresh ginger root ADVERTISEMENT",
            "3 cloves garlic, thinly sliced ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "4 tablespoons peanut butter ADVERTISEMENT",
            "1 1/2 pounds boneless pork loin, cut into strips ADVERTISEMENT",
            "2 tablespoons peanut oil for frying ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3/4 cup cashew nuts ADVERTISEMENT",
            "2 cups frozen mixed stir-fry vegetables ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the ginger, garlic, red pepper flakes, soy sauce, broth, and peanut butter. Stir in pork to coat. Set aside.\nHeat oil in a wok or large skillet over medium-high heat. Stir in onions, and cook about 1 minute. Stir in cashews. Cook until unions are soft and translucent. Pour in pork and marinade. Cook until pork pieces are done, about 10 minutes. Stir in mixed vegetables, and cook 5 minutes more.\n",
        "picture_link": "JkEPnYuY.8wORv.ggQ.DvjWjoBWt1Qe"
    },
    {
        "title": "Beet, Orange and Apple Salad",
        "ingredients": [
            "1 1/2 pounds beets ADVERTISEMENT",
            "2 cups shredded beet greens ADVERTISEMENT",
            "1 large orange ADVERTISEMENT",
            "2 Granny Smith apples - peeled, cored and sliced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon raspberry vinegar ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons unsalted sunflower seeds, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and dry beet roots and greens. Shred greens to measure 2 cups and set aside.\nPlace beets in a sauce pan with enough water to cover. Bring to boil, cover, reduce heat and simmer for 20 minutes or until tender. Drain and allow to cool.\nTrim and peel off skins; cut into 8 wedges.\nPeel and section orange. In a bowl, combine orange sections, beets and apples.\nWhisk together olive oil, vinegar, sugar, salt and garlic. Pour over beet mixture and toss well.\nArrange 1/2 cup beet greens on 4 salad plates. Top with beet mixture, sprinkle with sunflower seeds and serve.\n",
        "picture_link": "FVDcsYCI8evp.wN69QR9dnQANRBYQ5S"
    },
    {
        "title": "Pumpkin Bars II",
        "ingredients": [
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 1/2 ounces cream cheese, softened ADVERTISEMENT",
            "9 tablespoons butter, softened ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1 1/2 teaspoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl combine the pumpkin, cinnamon, pumpkin pie spice and sugar.\nSift together the flour, baking powder, baking soda and salt.\nUsing an electric mixer, slowly add the oil, eggs and pumpkin mixture to the flour mixture.\nMix and pour into greased 17 x 11 inch pan. Bake at 350 degrees F (175 degrees C) for 20 - 25 minutes. Cool completely before frosting.\nTo make Frosting: Cream the cream cheese, 9 tablespoons butter, vanilla together. Slowly add the confectioners' sugar and milk.\n",
        "picture_link": "rT36tNRV955Z3RzpZmyvPxjyOupOZyS"
    },
    {
        "title": "Pumpkin Cookies II",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups canned pumpkin ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCream shortening and sugar, then add the eggs. Mix well. Add vanilla and pumpkin. Set aside.\nSift dry ingredients, then blend into the \"wet\" ingredients. Fold in the nuts and raisins. Mix well.\nDrop by heaping teaspoons onto a greased cookie sheet, bake for 10 - 15 minutes. Cool. Best eaten if you let them \"ripen\" for a day. Store in a sealed container.\n",
        "picture_link": "hfj2B50Bl2aqcDUvXpvszdm5SVszG2a"
    },
    {
        "title": "Black Bean Spread",
        "ingredients": [
            "1 1/2 cups cooked black beans ADVERTISEMENT",
            "3 tablespoons hot salsa ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup low-fat cottage cheese ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander seed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine black beans, salsa, green onions, garlic, cottage cheese, hot pepper sauce, cumin, coriander, salt and pepper in an electric blender and blend until smooth. Add a little water, if necessary, to blend mixture thoroughly.\n",
        "picture_link": "aFBe5JPGy4oaFE/szVzZQOKHU/U7DPC"
    },
    {
        "title": "BBQ Chicken",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 1/2 cups cider vinegar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons poultry seasoning ADVERTISEMENT",
            "2 pounds cut up chicken pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat grill to medium heat.\nIn a small skillet combine the oil, vinegar, salt and pepper and put over low heat. Add the poultry seasoning while stirring constantly; when sauce mixes well and starts to bubble, it is done.\nPlace chicken on hot grill and brush with sauce. Grill for 45 to 60 minutes, turning every 5 to 10 minutes, and brush chicken with sauce after each turning. Grill until chicken is done and juices run clear. (Note: Be sure to keep an eye on the chicken as it cooks, as it tends to have flair ups due to the oil and chicken drippings!)\n",
        "picture_link": "7aCyKvpkZZsPEcqH70kMJMO9xKOcYSm"
    },
    {
        "title": "Waffle Iron Brownies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2/3 cup chopped pecans ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat waffle iron.\nMelt butter in a sauce pan. Remove from heat and stir in cocoa. Mix in the sugar, eggs and water. Add the flour and salt, beating well. Stir in the nuts.\nIn each well of the waffle iron, add 1 well rounded spoonful. Cook brownie in waffle iron as you would cook waffles. Sprinkle confectioners' sugar over warm waffle brownies.\n",
        "picture_link": "fvIqjo0LtM11qQvCCI.YnmknCmIPaIO"
    },
    {
        "title": "Garlic Wine Chicken",
        "ingredients": [
            "1 skinless, boneless chicken breast half - pounded thin ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 tablespoon chopped garlic ADVERTISEMENT",
            "4 mushrooms, chopped ADVERTISEMENT",
            "1/2 lemon ADVERTISEMENT",
            "1 1/2 cups Chablis or other dry white wine ADVERTISEMENT",
            "2 tablespoons butter, room temperature ADVERTISEMENT",
            "2 ounces cooked angel hair pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium skillet, heat oil for frying. Dredge chicken breast in flour and place it in the hot skillet. Add pepper to taste. Cook until golden brown on one side, 3 to 4 minutes.\nTurn chicken over (presentation side up) and add the garlic, mushrooms, juice from 1/2 lemon and wine. Stir all together. Turn heat up as high as possible and let liquids reduce until about 1/4 cup liquid remains in skillet.\nRemove chicken from skillet and add the room temperature butter. Swirl it around in the skillet sauce until it is incorporated and the sauce is slightly thickened. Pour sauce over chicken and serve with pasta.\n",
        "picture_link": "FoU3.CRoM/qyoijICH1vBpG/e3pjXJ6"
    },
    {
        "title": "Coco-Cola Cake III",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup cola-flavored carbonated beverage ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups miniature marshmallows ADVERTISEMENT",
            "6 tablespoons cola-flavored carbonated beverage ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 13 x 9 inch baking pan.\nSift the flour, white sugar and baking soda together.\nIn a saucepan over medium heat bring 1 cup of the butter, 3 tablespoons of the cocoa, and 1 cup of the cola drink to a boil. Pour into the flour mixture and stir in the marshmallows, buttermilk and the beaten eggs. Pour the batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes. Remove cake from oven and top with Coco-Cola Topping while cake is still warm.\nTo Make Coco-Cola Topping: In a saucepan bring 1/2 cup of the butter or margarine, 6 tablespoons of the cola drink and 3 tablespoons of the cocoa to a boil. Remove from the heat and stir in the confectioners' sugar, chopped nuts and vanilla. Spread topping over cake while still warm.\n",
        "picture_link": "nyoVe4/QvZEoNwz5aFbnrsmZQYSUMAK"
    },
    {
        "title": "Sugar Cookies VI",
        "ingredients": [
            "2/3 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter or margarine with white and brown sugars. Add both of the eggs and the vanilla (you don't HAVE to have vanilla, you can do without it).\nAdd dry ingredients (flour, baking powder, salt) and beat until well mixed.\nCover and put in refrigerator for an hour.\nAfter an hour, roll on a flat, floured surface and cut with cookie cutters (try many different shapes and sizes!) Bake at a medium heat (180 degrees C, 375 degrees F) for about 10 minutes (until you like their color). Good luck!\n",
        "picture_link": "H3G0G96uniJbLkX8aSb8Q62CvDSXZHm"
    },
    {
        "title": "Kathy's Italian Cookies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons fresh orange juice ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream margarine or butter and sugar thoroughly; add eggs, vanilla, and 2 tablespoons of orange juice. Combine flour and baking powder and gradually add to creamed mixture.\nKnead dough on lightly floured board for about 5 minutes. Using tablespoonfuls of dough, roll in 6-inch lengths; press ends together to form rings. Let stand on ungreased cookie sheets at room temperature for 15 minutes.\nBake 350 degrees F (180 degrees C) for 15-17 minutes or until lightly golden.\nTo Make Icing: Combine 2 1/2 cups confectioner's sugar with enough orange juice to make a thin glaze. Dip each hot cookie into glaze; cool on racks. Decorate with confetti sprinkles, if desired.\n",
        "picture_link": "lrRi6F2HwxOjJBJpf5s.NDvX0XwPyDa"
    },
    {
        "title": "Orange Cream Cake IV",
        "ingredients": [
            "1 (18.25 ounce) package orange cake mix ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "2 teaspoons orange extract ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "1/4 teaspoon orange extract ADVERTISEMENT",
            "16 ounces sour cream ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to temperature indicated on cake mix package. Prepare two 9 inch round cake pans according to package directions.\nPrepare cake according to package directions, but substitute milk for water, and add 2 teaspoons orange extract. Pour batter into two 9 inch pans and bake as directed. When cakes are cool, slice each layer in half horizontally, making four layers total.\nTo Make Frosting: In a large bowl, combine whipped topping, 1/4 teaspoon orange extract, sour cream and confectioners sugar. Mix well to combine.\nSpread frosting between layers, on sides and over top of cake.\n",
        "picture_link": "6IaG4GMoyBFgin7fukEWJPX2di2m5B2"
    },
    {
        "title": "Pumpkin Custard Pie",
        "ingredients": [
            "1 3/4 cups pumpkin puree ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a saucepan, stir the pumpkin over medium-high heat for 10 minutes or until slightly dry and caramelized.\nRemove from heat; add the sugar, salt, cinnamon and ginger. Mix well.\nAdd the eggs, cream and milk. Mix until smooth; pour into pastry lined pie pan.\nBake for 25 to 30 minutes or until crust is golden brown. Allow to completely cool on rack before cutting.\n",
        "picture_link": "Ar.PNKiB/JVe5YhIHRAM1Yy4MasUIk6"
    },
    {
        "title": "Chicken a la Charlie",
        "ingredients": [
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 teaspoon poultry seasoning ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "3/4 cup white wine ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup fresh sliced mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken pieces in a 9x13 inch baking dish. Season chicken with garlic powder, salt, pepper and poultry seasoning.\nIn a large bowl combine the sour cream, cream of chicken soup and cream of mushroom soup. Mix well with a wire whisk. Add the wine and mix together. Pour this cream mixture over the chicken and bake in the preheated oven for 40 minutes.\nAdd the onion and mushrooms and stir into the chicken/sauce mixture. Bake for another 30 minutes. Let cool 10 minutes and serve.\n",
        "picture_link": "49/bq08Vkc/3jk0Kw4CVIIC85rzIGti"
    },
    {
        "title": "Applesauce Cake III",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/2 cups applesauce ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour tube pan.\nIn a medium bowl, sift together the flour, baking soda, cinnamon, cloves and salt. Set aside.\nIn a large bowl, cream the sugar and shortening until fluffy. Add applesauce and molasses and mix in.\nGradually add the flour mixture and beat well to moisten. Fold in the raisins.\nPour into a prepared fluted or straight sided tube pan. Bake at 350 degrees F (175 degrees C) for 45 minutes, or until toothpick inserted into the middle of cake comes out clean. Cake will not rise to top of pan. Cool for 10 minutes and remove from pan and cool on wire rack.\n",
        "picture_link": "NPluf/ks8CbpG3/oP.Ju03uPk7wAi66"
    },
    {
        "title": "O' Henry Bars",
        "ingredients": [
            "4 cups rolled oats ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup white corn syrup ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nMix the oats, brown sugar, butter or margarine, and white corn syrup. Pat into a 10 x 15 inch pan. Bake for 10 to 15 minutes. Do not over bake.\nMelt chocolate chips and peanut butter. Spread over baked crust while hot. Cut into bars right away.\n",
        "picture_link": "7g/2wED.K4H4ErMrA019h3LPcMPH5W6"
    },
    {
        "title": "Spicy Burgers",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 fresh jalapeno peppers, seeded and minced ADVERTISEMENT",
            "1 small fresh poblano chile pepper, seeded and minced ADVERTISEMENT",
            "1 fresh habanero pepper, seeded and minced (optional) ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nIn a large bowl, mix together the beef, garlic, jalapeno peppers, poblano pepper, habanero pepper, red pepper flakes, cilantro, and cumin. Form into burger patties.\nLightly oil the grill grate. Place burgers on grill, and cook for 5 minutes per side, or until well done.\n",
        "picture_link": "f/8/TkNCi67sx44PTPtG3Iml/0lgyX6"
    },
    {
        "title": "Ranch Dressing I",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "1 tablespoon dried chives ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the mayonnaise, sour cream, buttermilk, garlic powder, oregano, dill weed, chives, parsley, parmesan cheese, hot sauce, Worcestershire sauce, pepper and refrigerate for at least 1/2 an hour. If the dressing is too thick, add a little extra buttermilk to thin.\n",
        "picture_link": "UXQIgXcK6YliWi8e5NG8LEz4EbWPf1."
    },
    {
        "title": "Yummy Couscous Salad",
        "ingredients": [
            "1/2 cup creamy salad dressing ADVERTISEMENT",
            "1/4 cup plain yogurt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup couscous ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/3 cup chopped parsley ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "1/3 cup toasted and sliced almonds ADVERTISEMENT",
            "1/2 cup canned chickpeas, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, blend creamy salad dressing, yogurt, cumin, salt and pepper. Cover, and place in the refrigerator 1 hour, or until chilled.\nMelt butter in a medium saucepan over medium heat. Stir in couscous, and coat with butter. Stir in water, reduce heat, and a simmer, covered, until all water is absorbed, about 5-10 minutes.\nMix couscous, red onion, red bell pepper, parsley, raisins, almonds and chickpeas into the creamy salad dressing mixture. Cover, and chill in the refrigerator until serving.\n",
        "picture_link": "3f.zINKK0egiH96tckc7wCpQGg/O3.u"
    },
    {
        "title": "Sauteed Zucchini",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1/2 cup water, divided ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 large zucchini, thinly sliced ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium heat; cook and stir the onion in the melted butter until translucent, about 5 minutes. Add the garlic; cook and stir 1 minute more. Stir the tomatoes and 1/4 cup water into the mixture; cover. Cook until the tomatoes have reduced slightly, stirring occasionally, about 5 minutes.\nPour another 1/4 cup water into the skillet, and add the bouillon cube; stir until the bouillon is dissolved. Add the zucchini; continue cooking until the zucchini is tender, 5 to 7 minutes. Season with black pepper to serve.\n",
        "picture_link": "B3/fzsTFSdcif7mlR5yyAQLayfRBhFu"
    },
    {
        "title": "Yellow Clooney Cake",
        "ingredients": [
            "4 cups cake flour, plus ADVERTISEMENT",
            "2 tablespoons cake flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 large eggs, at room temperature ADVERTISEMENT",
            "2 teaspoons pure vanilla extract ADVERTISEMENT",
            "2 cups buttermilk, well-shaken ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease two 9-inch round cake pans with butter. Line the bottoms with parchment paper, then grease the parchment paper. Sift together the cake flour, baking powder, baking soda, and salt in a bowl.\nBeat the butter and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg. Pour in the flour mixture alternately with the buttermilk, mixing until just incorporated. Pour the batter into the prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Cool in the pans for 10 minutes, then run a paring knife between the cake and the edge of the pan. Hold the cake pan on its side and gently tap the sides of the pan against the counter to loosen it. Cover the cake pan with a plate or cooling rack, and invert it to tip the cake out of the pan and onto the plate.\n",
        "picture_link": "GwLyJPwlrAXbbPXQLU0RfMxpoUGcYfm"
    },
    {
        "title": "Avocado-Lime Shrimp Salad (Ensalada de Camarones con Aguacate y Limon)",
        "ingredients": [
            "1 1/4 pounds cooked deveined shelled shrimp, tail shells removed ADVERTISEMENT",
            "3 avocados - peeled, pitted and diced ADVERTISEMENT",
            "1 bunch green onion tops, chopped ADVERTISEMENT",
            "3 large red tomatoes, diced ADVERTISEMENT",
            "1 large yellow tomato, diced ADVERTISEMENT",
            "1 bell pepper (any color), chopped ADVERTISEMENT",
            "1/2 bunch cilantro, chopped ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the shrimp into 2 or 3 pieces and place in a large bowl; add the avocado, green onion, red and yellow tomatoes, bell pepper, cilantro, and lime juice; mix. Season with salt and pepper. Refrigerate at least 15 minutes before serving.\n",
        "picture_link": "z69pwTAVHIckuZucQ1lkhSJRyDtK5.m"
    },
    {
        "title": "Horseradish Corn on the Cob",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon fresh parsley, chopped ADVERTISEMENT",
            "2 tablespoons prepared Dijon-style mustard ADVERTISEMENT",
            "2 teaspoons prepared horseradish ADVERTISEMENT",
            "8 ears corn, husked and cleaned ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a small bowl combine butter, salt, pepper, parsley, mustard and horseradish; mix well. Spread about 1 tablespoon of mixture evenly over each ear of corn. Wrap tightly in heavy duty aluminum foil; seal well. Place on a baking sheet.\nBake for 40 to 45 minutes in the preheated oven, or until corn is tender.\n",
        "picture_link": "1/0mclQo1XTkRZiZI0H2dZWxc9u/lai"
    },
    {
        "title": "Smokin' Jack BBQ Sauce",
        "ingredients": [
            "8 cups ketchup ADVERTISEMENT",
            "6 ounces chipotle peppers in adobo sauce ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons ground mustard ADVERTISEMENT",
            "1 1/2 teaspoons smoked paprika ADVERTISEMENT",
            "1 1/2 teaspoons ground coriander ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 1/2 teaspoons freshly cracked black pepper ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "1 cup whiskey (such as Jack Daniel's®) ADVERTISEMENT",
            "2 tablespoons liquid hickory smoke flavoring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the ketchup, chipotle peppers in their sauce, apple cider vinegar, molasses, onion powder, garlic powder, ground mustard, smoked paprika, coriander, salt, black pepper, brown sugar, whiskey, and liquid smoke flavoring in a large pot, and bring to a gentle boil over medium heat, stirring frequently. Cook the sauce for 15 minutes, then reduce heat to low and simmer 15 more minutes, stirring often. Use immediately or refrigerate.\n",
        "picture_link": "Hvdb72/TjvlWhcZvxT/p9/IXw7vGHDq"
    },
    {
        "title": "Shanibars",
        "ingredients": [
            "1 cup chopped dates ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 pinch salt (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the dates, peanut butter, coconut, cocoa powder and salt into a food processor. Cover, and blend until smooth, about 4 minutes. The mixture will be very sticky.\nPress the mixture into a loaf pan lined with waxed paper. Refrigerate for 30 minutes. Remove the chilled mixture from the pan and slice into 6 bars. Wrap each bar in foil and refrigerate until serving.\n",
        "picture_link": "cEduU8Dld1RJ9eCmeCx3Uyy5AIfqn1W"
    },
    {
        "title": "Homemade Beef Breakfast Sausage Patties",
        "ingredients": [
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 teaspoons dried sage ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the brown sugar, sage, salt, basil, black pepper, onion powder, marjoram, and red pepper flakes together in a small bowl. Place the ground beef in a large bowl; mix the spice blend into the ground beef with your hands until evenly integrated. Refrigerate for 24 hours to let the flavors blend.\nDivide the ground beef mixture into 8 patties.\nPlace a large skillet over medium heat; cook the patties in the skillet until firm, hot, and cooked in the center, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\n",
        "picture_link": "ocEjvXD1FGG0KEiHJRKQFDNCWYEfQw6"
    },
    {
        "title": "Pineapple-Lime Rice",
        "ingredients": [
            "1 cup uncooked long grain rice ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup crushed pineapple ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "1/2 teaspoon grated lime zest ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup minced fresh cilantro ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice, pineapple juice, water, pineapple, butter, lime zest, and salt to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Stir in the cilantro, green onions, and lime juice to serve.\n",
        "picture_link": "Eyqw9cODfhIIzym8isj2QEWK0ldMHfW"
    },
    {
        "title": "Scarlett's Chicken Cacciatore",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1/2 green bell pepper, diced ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 (28 ounce) can Italian-style crushed tomatoes ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons Italian seasoning ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat, and cook and stir the chicken, onion, green pepper, mushrooms, and garlic until the chicken is no longer pink inside, 10 to 15 minutes. Stir in the crushed tomatoes, parsley, salt, pepper, Italian seasoning, and basil, bring the mixture to a boil, and reduce heat. Cover the skillet and simmer for 30 minutes.\nWhile the chicken mixture is simmering, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the noodles uncovered, stirring occasionally, until cooked through but still firm to the bite, about 5 minutes. Drain well in a colander set in the sink.\nServe the chicken cacciatore over the hot cooked noodles. Sprinkle with Parmesan cheese before serving.\n",
        "picture_link": "nqgcL452Iifa4WTUg/6TvUB7eWSj8yK"
    },
    {
        "title": "Aloha Chicken Burgers",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "3 slices thick cut bacon ADVERTISEMENT",
            "2 large hamburger buns, split ADVERTISEMENT",
            "1 tablespoon softened butter ADVERTISEMENT",
            "1/4 cup teriyaki sauce ADVERTISEMENT",
            "2 slices Swiss cheese ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 slices pineapple ADVERTISEMENT",
            "2 slices tomato ADVERTISEMENT",
            "2 slices of iceberg lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts into a plastic zipper bag with soy sauce, seal the bag, and marinate in refrigerator for 30 minutes. While chicken is marinating, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, and set aside. Spread cut sides of hamburger buns with butter.\nPreheat an outdoor grill for medium heat, and lightly oil the grate.\nRemove the chicken from the soy sauce, and discard the excess soy sauce. Place the chicken breasts onto the preheated grill, and grill until chicken shows good grill marks, is no longer pink inside, and the juices run clear, 4 to 5 minutes per side. When chicken is almost done, brush each piece generously on both sides with teriyaki sauce to finish grilling. Place a slice of Swiss cheese on each chicken breast, and cover with a lid to help the cheese melt onto the chicken.\nWhile chicken is grilling, spread the buns open on the grill and cook until toasted and showing grill lines, about 2 minutes. Set the buns aside.\nTo assemble, spread the grilled sides of each bun with mayonnaise, and top each bottom bun with a cooked chicken breast, 1 1/2 slices of bacon, a slice of pineapple, a slice from a head of lettuce, a slice of tomato, and the top bun.\n",
        "picture_link": "yaJeHqwYkJPXiJHdJQ2JDfITiU0vgZO"
    },
    {
        "title": "Mama's Blackberry Cobbler ",
        "ingredients": [
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "2 cups fresh blackberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPour the melted butter into the bottom of an 8x8-inch square baking pan. Mix the sugar, self-rising flour, and milk together until moistened, and pour the mixture over the butter. Do not stir. Spread blackberries evenly over the batter.\nBake in the preheated oven until the top is browned and the cobbler is bubbling, about 45 minutes.\n",
        "picture_link": "DXhsKjf9BP11NWwtMqCXyq.NzPKpI1e"
    },
    {
        "title": "Mom's Spaghetti Bolognese",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 slices bacon, diced ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "1 stalk celery, finely chopped ADVERTISEMENT",
            "1 carrot, finely chopped ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 (28 ounce) cans crushed tomatoes ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a rolling boil. Cook the spaghetti in the boiling water until cooked through yet firm to the bite, about 12 minutes; drain.\nHeat the olive oil in a large pot over medium heat. Cook the bacon in the oil until crisp, 8 to 10 minutes. Stir the onion, celery, carrot, and oregano into the bacon; continue cooking until the vegetables begin to soften, another 8 to 10 minutes. Add the garlic and cook until fragrant, about 2 minutes. Crumble the ground beef into the vegetable mixture; cook and stir until the beef is completely cooked and no longer pink, 8 to 10 minutes.\nPour the balsamic vinegar over the ground beef mixture; allow to simmer until the liquid evaporates, about 5 minutes. Stir the crushed tomatoes, tomato paste, and sugar into the ground beef mixture; bring the mixture to a boil, season with salt and black pepper, and remove from heat. Stir the fresh basil into the mixture.\nLadle the sauce over the cooked spaghetti. Top with Parmesan cheese to serve.\n",
        "picture_link": "k57lASFucuso.Yzle2qBwcltx61s6JK"
    },
    {
        "title": "Monte Cristo Sandwiches",
        "ingredients": [
            "3 eggs, beaten ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "8 slices French bread ADVERTISEMENT",
            "8 ounces honey ham, chopped ADVERTISEMENT",
            "8 ounces smoked turkey breast, chopped ADVERTISEMENT",
            "12 slices Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat together eggs and milk. Stir in cinnamon and nutmeg.\nHeat a non-stick skillet to medium heat. Dip the bread slices in the egg mixture, place in the skillet and cook until lightly brown on both sides.\nRemove bread from skillet. Layer four slices of bread with a slice of Swiss cheese, ham, Swiss cheese, turkey and Swiss cheese again. Cover with remaining four bread slices. Return sandwiches to skillet; grill until cheese has melted and bread has browned. Serve hot.\n",
        "picture_link": "WqEg5UJGnTZoJD.mnO3XiaCK2al9bEC"
    },
    {
        "title": "Cereal Treats II",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 (10.5 ounce) package miniature marshmallows ADVERTISEMENT",
            "5 cups crispy rice cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13 inch pan with butter or cooking spray.\nIn a large microwave safe bowl, combine butter and marshmallows. Microwave on high for 1 to 2 minutes, stirring every 30 seconds, until smooth. Remove from the oven and stir in the cereal.\nPress in to the prepared pan with the back of a buttered spoon. Let the treats cool for about 2 hours until set. Cut into squares and serve.\n",
        "picture_link": "blxC83W7zd0uW/3lRC3hiZL6cevYwYi"
    },
    {
        "title": "French Quarter Bread Pudding",
        "ingredients": [
            "1 (1 pound) loaf French bread ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Cut bread into 1 inch thick slices. Arrange bread slices and pecans on a baking sheet and drizzle with melted butter; toast lightly.\nIn a large bowl, beat together eggs, cream, milk, cinnamon, nutmeg, sugar and vanilla. Put bread and pecans in a lightly greased 7x11 in casserole dish. Pour egg mixture over bread. Make sure that bread slices are saturated with liquid.\nBake in preheated oven for 60 minutes, until golden. Serve warm.\n",
        "picture_link": "uPILtakdBQMC61D74sSN9b9yvZso7gq"
    },
    {
        "title": "Chicken and Fresh Tomato Slow Cooker Stew",
        "ingredients": [
            "5 potatoes, peeled and cubed ADVERTISEMENT",
            "1 1/2 cups chopped fresh tomato ADVERTISEMENT",
            "1 cup sliced carrot ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "3 large skinless boneless chicken breast halves ADVERTISEMENT",
            "2 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 1/2 teaspoons Italian seasoning ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "water, as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the potatoes, tomato, carrot, onion, and bay leaves in a slow cooker. Place the chicken breasts atop the vegetables. Stir the tomato sauce, chicken broth, and Italian seasoning in a bowl; pour over the chicken breasts. Add water as needed to assure the chicken is completely covered. Cook on Low for 6 hours. Remove the chicken breasts and cut into bite sized chunks and return to slow cooker. Continue cooking until the vegetables are tender, another 1 to 2 hours.\n",
        "picture_link": "vcICkoMnzzZdkJRWP.xUay/CxZfoV0m"
    },
    {
        "title": "Kale, Swiss Chard, Chicken, and Feta Salad",
        "ingredients": [
            "1/2 cup cider vinegar ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried oregano (optional) ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 bunch kale, torn into bite-sized pieces ADVERTISEMENT",
            "1 bunch Swiss chard, torn into bite-sized pieces ADVERTISEMENT",
            "1 pound grilled skinless, boneless chicken breast, sliced ADVERTISEMENT",
            "1 (6 ounce) container crumbled feta cheese, or more to taste ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "1/3 cup chopped, toasted walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the vinegar, honey, salt, pepper, and oregano in a bowl until the honey has dissolved. Whisk in the olive oil until evenly blended. Place the kale, Swiss chard, chicken, feta cheese, raisins, and walnuts into a bowl. Toss with the dressing to serve.\n",
        "picture_link": "kmldld.k/YeJ8ilBlsvcaivu0Qw1eTy"
    },
    {
        "title": "Ginger-Peach Jam",
        "ingredients": [
            "4 1/2 cups fresh peaches - peeled, pitted and chopped ADVERTISEMENT",
            "1/4 cup finely chopped crystallized ginger ADVERTISEMENT",
            "1 (1.75 ounce) package powdered fruit pectin ADVERTISEMENT",
            "6 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring peaches, ginger, and pectin to a boil in a large saucepan over medium heat. Stir in the sugar and butter; cook and stir until the sugar is dissolved. Return to a boil, stirring constantly for 1 minute more. Remove from heat, and skim off any foam with a spoon.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the peach jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "H4QOynksPtkFGdKfCWHH/0bp5Fw/N9y"
    },
    {
        "title": "Greek Rice Salad",
        "ingredients": [
            "1 cup uncooked long grain brown rice ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 vine-ripened tomatoes, diced ADVERTISEMENT",
            "1 1/2 cups diced English cucumbers ADVERTISEMENT",
            "1/3 cup diced red onion ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup sliced Kalamata olives ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the brown rice and water to a boil in a saucepan over high heat. Reduce the heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 45 to 50 minutes; remove from heat and allow to cool, fluffing occasionally with a fork.\nToss the avocado and lemon juice together in a large bowl. Add the tomatoes, cucumber, onion, feta, olives, mint, olive oil, lemon zest, garlic, salt, and pepper to the bowl; lightly toss the mixture until evenly combined. Fold the cooled rice gently into the mixture. Serve immediately or chill up to 1 hour; the salad does not last well for more than a day as the tomato and cucumber begin to release their juices and the salad becomes watery.\n",
        "picture_link": "PBpA0IyiJVQ0JuoslqhpJLFUghDJaKu"
    },
    {
        "title": "Maple Muffins",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/4 cup rolled oats ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup real maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Grease the cups of a 12-cup muffin pan.\nSift together flour, sugar, baking powder and salt. Cut in shortening until mixture resembles coarse crumbs. Stir in oats. Add egg, milk, and syrup. Stir only until dry ingredients are moistened. Fill greased muffin tins 3/4 full.\nBake for 18 to 20 minutes. Remove from oven, and let stand a few minutes before removing muffins from the pan.\n",
        "picture_link": "X8Biodj3FMc5nqfdroRRdv4ZPyXb6oW"
    },
    {
        "title": "Chicken Eileen",
        "ingredients": [
            "1 (6 ounce) package herb-seasoned dry bread stuffing mix ADVERTISEMENT",
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "16 medium slices mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPrepare stuffing according to package directions. Wash the chicken, pat dry and pound out to about a 1/2 inch thickness. Place a slice of cheese on each breast, followed by a scoop of prepared stuffing. Close each breast over the cheese and stuffing and hold with a toothpick. Place stuffed breasts in a lightly greased 9x13 inch baking dish.\nBake at 350 degrees F (175 degrees C) for 25 minutes, or until chicken juices run clear, then place a second slice of cheese over each stuffed chicken, and bake for 2 more minutes, or until cheese is bubbly.\n",
        "picture_link": "lNZxzWf..xevj9CudhugY.wHjGK6vWu"
    },
    {
        "title": "Uncle Wynn's Bread Machine Rye",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 teaspoons caraway seed ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1 1/2 cups dark rye flour ADVERTISEMENT",
            "2 cups bread flour ADVERTISEMENT",
            "2 tablespoons vital wheat gluten ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order suggested by the manufacturer. Set for French Bread cycle, or Normal setting.\n",
        "picture_link": "zOadn7nuFUqDVrWKnOMFEdN6T3gNhCW"
    },
    {
        "title": "Creamed Beef",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "1 (15 ounce) can peas, drained ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ground beef and onion in a large skillet over medium high heat. Saute for 5 to 10 minutes, or until beef is browned and onion is translucent; set aside.\nMelt the butter or margarine in a medium saucepan over medium heat. Remove from heat and add the flour, mixing thoroughly.\nAdd the milk slowly, stirring constantly, and return to the heat. Keep stirring until thickened to desired consistency.\nAdd the reserved beef mixture, the peas, and season with salt and pepper to taste.\n",
        "picture_link": "a/WeKXi8BLnA6SHMuqPeI/ObbMnHzjW"
    },
    {
        "title": "Fresh Apple Cake",
        "ingredients": [
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2 1/2 cups apples - peeled, cored and diced ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 cup raisins (optional) ADVERTISEMENT",
            "1 (16 ounce) container cream cheese frosting ADVERTISEMENT",
            "1/4 cup finely chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease one 10 inch tube pan.\nBeat together the oil, eggs, vanilla and sugar.\nSift together the flour, baking soda, salt, cinnamon and nutmeg. Add to egg mixture; stir in apples, nuts and raisins.\nPour into prepared pan and bake at 325 degrees F (165 degrees C) for 1 1/2 hrs or until a cake tester inserted in the center comes out clean. Cool and frost with cream cheese icing. Sprinkle top with 1/4 cup fine chopped nuts.\n",
        "picture_link": "WJIU2LJf2S7P2Jgzx6orsJ2rM2Uh2Wa"
    },
    {
        "title": "Ham Balls",
        "ingredients": [
            "1 1/4 pounds ground smoked ham ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1 (10.75 ounce) can tomato soup ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the ham, pork OR sausage, and the ground beef. Stir in the milk, eggs and graham cracker crumbs and mix well. Form into large balls about 2 inches in diameter and place them in a 9x13 inch baking dish.\nIn a separate medium bowl, combine the soup, vinegar, brown sugar and mustard powder. Mix well and pour over the meatballs.\nBake at 350 degrees for 1 hour or until internal meat temperature reaches 160 degrees F (73 degrees C).\n",
        "picture_link": "jLWmaQi5IK4UsN1qmakk5Ugn/w.jGua"
    },
    {
        "title": "Wheat Bread with Flax Seed",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 1/4 cups whole wheat flour ADVERTISEMENT",
            "3/4 cup ground flax seed ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "1 tablespoon vital wheat gluten ADVERTISEMENT",
            "2 tablespoons dry milk powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 tablespoons vegetable oil ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select cycle; press Start.\n",
        "picture_link": "YDx9MzP3XvH4bJkSxlj9RKDJoeZ1Aly"
    },
    {
        "title": "White Wedding Cake",
        "ingredients": [
            "5 1/4 cups sifted cake flour ADVERTISEMENT",
            "6 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "8 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 1/2 teaspoons orange extract ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites until foamy with sturdy egg beater, or at high speed of electric mixer. Then add 1 cup sugar gradually, beating only until meringue will hold up in soft peaks.\nIn a large bowl, stir shortening just to soften. In another bowl, sift together flour, baking powder, salt, and 2 cups sugar; sift into shortening. Add 1 1/2 cups milk and the extracts, and mix until all flour is dampened. Beat 2 minutes at a low speed of electric mixer. Add remaining milk and the meringue mixture; beat for 1 minute more.\nLine the bottoms of one 10 inch square pan and two 8 inch square pans with parchment paper. Pour batter to equal depth in each pan.\nBake at 325 degrees F (165 degrees C) for about 45 minutes, or until done. Cool layers.\nTrim one of the 8 inch square cakes to make a 5 inch square cake. Place the 10 inch cake on a large flat tray or plate. Frost top and sides with thin layer of Ornamental Icing. Cover top of cake smoothly with more frosting. Center 8 inch cake on top of 10 inch cake, and frost as above. Center 5 inch cake on 8 inch cake, and frost. Spread frosting over entire cake to give a flat, even base for decorating. Decorate as desired.\n",
        "picture_link": "XaLRTmdRFqLNXVXO477xaZ0Pum8E.WG"
    },
    {
        "title": "Mock Chopped Liver",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup lentils ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1 teaspoon extra virgin olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 cup walnuts ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, lentils, and bouillon cubes in a pot. Cover pot and cook about 30 minutes or until tender. Drain well.\nHeat oil in skillet, saute onion until it becomes translucent.\nIn an electric food processor, grind lentils, onions and walnuts until your desired consistency for the pate is reached. Season to taste with salt and pepper. Chill before serving.\n",
        "picture_link": "5mQgNH6wkAVygFIrvxWD3kYB9Ujs4Ha"
    },
    {
        "title": "Hot Water Pie Crust II",
        "ingredients": [
            "1 1/2 cups shortening ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 cup hot water ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine shortening, vinegar, and milk. Pour in hot water and whip until mixture is smooth.\nIn a separate bowl, mix together flour, salt, and cornstarch. Add flour mixture to shortening mixture and stir just until dough comes together. Roll out dough between sheets of wax paper. If dough is difficult to work with, refrigerate before rolling.\n",
        "picture_link": "WjfgztmTx1utRpm7/u/W9a79n5zizJC"
    },
    {
        "title": "Cashew Chicken Casserole",
        "ingredients": [
            "1 cup chicken broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 (2 to 3 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "4 cups hot cooked rice ADVERTISEMENT",
            "1 cup cashew nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCombine the broth, cream of chicken soup, mushroom soup and soy sauce in a large saucepan and bring to a boil; add chicken, rice and 3/4 cup cashews. Mix well and pour mixture into a 9x13 inch baking dish. Sprinkle remaining 1/4 cup cashews on top.\nBake at 400 degrees F (200 degrees C) for 20 to 25 minutes, or until chicken is cooked through and no longer pink inside.\n",
        "picture_link": "4daS2yDx2n09vWckVVbQpSTbWV7i/Fi"
    },
    {
        "title": "Mississippi Mud Cake II",
        "ingredients": [
            "1 1/4 cups butter, softened ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x13 inch cake pan.\nIn a large sauce pan over low heat, melt 1 cup of the butter with the cocoa. Stir often. Remove from heat and add white sugar, beat well. Beat in eggs one at a time.\nCombine flour, baking powder, and salt and stir into the egg mixture. Stir in the chopped nuts and 1 teaspoon vanilla. Pour batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 35 to 45 minutes. Remove cake from oven and spread the marshmallow cream over the cake. Spoon chocolate icing over marshmallow topping while the cake is still hot and spread. The cake will get \"muddied\" by the spreading action.\nTo Make Icing: Beat together the remaining 1/4 cup butter, 1/3 cup cocoa, 1 teaspoon vanilla, the milk, and the confectioner's sugar. Once well combined spoon over the still hot cake.\n",
        "picture_link": "zHm65CC76pr508J8n5KgTth6YPio632"
    },
    {
        "title": "Gourmet Guacamole",
        "ingredients": [
            "2 avocados, chopped ADVERTISEMENT",
            "2 tablespoons salsa ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together avocados, salsa, mayonnaise, chili powder and black pepper. Mix well and salt to taste before serving.\n",
        "picture_link": "/VUjbbVjSRvTkwyK5Evfe1XiWYH0ihe"
    },
    {
        "title": "Orange Sponge Cake",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "6 tablespoons orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour one 9 inch round pan.\nSeparate the eggs while cold, then bring to room temperature.\nBeat egg yolks, sugar and grated orange rind until light and fluffy. Mix flour and baking powder together. Alternately add flour mixture and orange juice to the egg yolk mixture.\nIn a separate large CLEAN bowl, with a CLEAN whisk or beaters, beat egg whites to stiff peaks, and fold into batter.\nPour batter into prepared pan and bake at 325 degrees F (165 degrees C) for 50 to 60 minutes.\n",
        "picture_link": "hCfOeimlSEFkg8SG/rJpysJy2.3OK9W"
    },
    {
        "title": "Maple Glazed Sweet Potatoes",
        "ingredients": [
            "2 1/2 sweet potatoes ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons flaked coconut (optional) ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sweet potatoes in a large saucepan with water to cover them. Bring the water to a boil, reduce heat, cover and let simmer 25 to 30 minutes until tender.\nPreheat oven to 350 degrees F (175 degrees C). Use non-aerosol non stick spray to grease a 8x8 inch baking pan.\nWhen the sweet potatoes are cool, peel and cut them into large chunks. Arrange them in the prepared dish.\nIn a small saucepan, melt butter, syrup, sugar and coconut together over a low heat. Cook for 3 to 5 minutes, stirring constantly. Sprinkle mixture over sweet potatoes. Top mixture with pecans.\nBake 5 to 7 minutes, until top is lightly browned.\n",
        "picture_link": "GBCUuWwk5u4kladvhMY0YiF.AIgQeTm"
    },
    {
        "title": "Carrot and Raisin Salad I",
        "ingredients": [
            "2 cups shredded carrots ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine the carrots, celery, raisins, mayonnaise and vinegar. Mix together and refrigerate until chilled.\n",
        "picture_link": "W5/vOC/Lz6r28MUP78njvJoagjgioEW"
    },
    {
        "title": "Baked Brussels Sprouts",
        "ingredients": [
            "2 pounds Brussels sprouts, ends trimmed and yellow leaves removed ADVERTISEMENT",
            "1/2 cup butter, cut into pieces ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1/4 cup pine nuts ADVERTISEMENT",
            "1/2 cup crumbled blue cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace the Brussels sprouts into a casserole or Dutch oven with a lid. Arrange pieces of butter on top of the sprouts. Season with salt, pepper and lemon juice. Cover with the lid.\nBake for 25 minutes in the preheated oven, or until sprouts are just barely tender. Stir now and then to keep them from sticking. During the last 10 minutes, sprinkle the pine nuts over the sprouts and remove the lid. When the sprouts are done, sprinkle blue cheese over them before serving.\n",
        "picture_link": "xmQqITb9LZn2k1hhaJkTZ3n3RfAtdHu"
    },
    {
        "title": "Chef John's Salmon in Parchment",
        "ingredients": [
            "parchment paper ADVERTISEMENT",
            "1 teaspoon olive oil, or more if needed ADVERTISEMENT",
            "6 small potatoes ADVERTISEMENT",
            "10 spears asparagus ADVERTISEMENT",
            "2 (8 ounce) skinless, boneless, center-cut salmon fillets ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nTake two pieces of parchment paper, fold in half, and cut a half-circle starting at each crease. They should look similar to a heart-shape when unfolded. Coat each piece of parchment with olive oil on both sides.\nPlace potatoes in a saucepan and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nBring a pot of lightly salted water to a boil. Add asparagus, and cook uncovered until slightly tender, about 5 minutes. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the asparagus is cold, drain well, and set aside.\nPlace 1 salmon fillet, half the asparagus, and half the potatoes in the middle of one side of a prepared parchment paper. Sprinkle with salt and pepper and drizzle with extra-virgin olive oil. Fold other half of circle over and seal parchment edge by making overlapping folds around the edge. At the end, fold the last crease in the opposite direction of the rest to ensure it seals. Repeat with the second piece of prepared parchment and remaining ingredients. Place pouches on a baking sheet.\nBake in the preheated oven for 15 minutes. Remove from oven and allow to sit for 5 minutes before cutting open parchment. The salmon is done when it flakes easily with a fork.\n",
        "picture_link": "mV9UVCkfVhFWKcdbKn7MyhxNQxJw/hW"
    },
    {
        "title": "Pretzel Smoochies ",
        "ingredients": [
            "20 mini pretzels ADVERTISEMENT",
            "20 foil-wrapped milk chocolate pieces (such as Hershey's Kisses®) ADVERTISEMENT",
            "20 candy-coated milk chocolate pieces (such as M&M;'s®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace pretzels on a baking sheet lined with aluminum foil.\nPlace an unwrapped chocolate piece onto each pretzel.\nHeat the pretzels and chocolate candies in the preheated oven until the milk chocolate pieces become soft but hold their shape, 30 seconds to 1 minute. Watch carefully and don't let the chocolate melt to the point of dripping.\nRemove the pretzels from the oven and allow to stand for 1 minute to allow candy to finish softening.\nPush a colored candy-coated piece into the center of each chocolate kiss, pushing it down and flattening it. Set treats aside to cool to room temperature and fully set, about 30 minutes.\n",
        "picture_link": "kTAghf5HL.h.DVlCtGrhVGN8.AP/Xji"
    },
    {
        "title": "Grilled Tuna Steaks with Grape and Caper Salsa",
        "ingredients": [
            "2 cups red seedless grapes, halved ADVERTISEMENT",
            "1/3 cup capers, drained and rinsed ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "4 (8 ounce) tuna steaks ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil grate.\nStir together grapes, capers, shallot, parsley, and olive oil in a bowl; season to taste with salt and pepper, and set aside. Place tuna steaks onto a plate, and brush with lemon juice. Season with salt and pepper to taste.\nCook tuna steaks on preheated grill until cooked to desired degree of doneness, 2 to 3 minutes per side for medium-rare. Serve with the grape and caper salsa.\n",
        "picture_link": "LdRxCoyW4HOSgJ7zIY5SC7VNNayLenO"
    },
    {
        "title": "2-Step Creamy Chicken and Pasta",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast, cut up ADVERTISEMENT",
            "1 (16 ounce) bag frozen pasta and vegetable blend ADVERTISEMENT",
            "1 (10.75 ounce) can your favorite Campbell's® Cream Soup* ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in skillet. Add chicken and cook until browned, stirring often.\nAdd vegetable pasta blend, soup and water. Heat to a boil. Cover and cook over low heat 10 minutes or until done.\n",
        "picture_link": "8JQPmat0pANy7K0VXYSftUhLgnl/4KK"
    },
    {
        "title": "Mama's Summer Squash Casserole",
        "ingredients": [
            "8 yellow summer squash, thinly sliced ADVERTISEMENT",
            "1 small yellow onion, thinly sliced ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 cup low-fat sour cream ADVERTISEMENT",
            "1 sleeve buttery round crackers (such as Ritz®), crushed, divided ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 1-quart casserole dish.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add squash and onion, cover, and steam until squash is tender and easily mashed with a fork, 10 to 15 minutes.\nWhisk egg and sour cream together in the prepared casserole dish; add squash, onions, 2/3 the crackers, and 2/3 the Cheddar cheese. Stir with a fork. Cover the squash mixture with remaining Cheddar cheese and crackers.\nBake in the preheated oven until cheese is melted and crackers are lightly browned, about 30 minutes.\n",
        "picture_link": "Jul88UASqURjVy/08UbWteDh3oaZPCu"
    },
    {
        "title": "Fried Bologna Casserole",
        "ingredients": [
            "8 slices bologna ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 cups warm mashed potatoes ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 1 1/2 quart baking dish.\nHeat a skillet over medium-high heat. Fry the bologna slices in the hot skillet until browned on both sides, about 1 minute per side. Drain on a paper towel-lined plate. Wipe excess grease from the skillet, reduce heat to medium, and stir in the butter and onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir the onions into the warm mashed potatoes.\nSpread half of the mashed potatoes into the prepared baking dish. Layer with half of the fried bologna, and sprinkle with half of the cheese. Repeat with the remaining ingredients.\nBake uncovered in the preheated oven until the cheese is bubbly, and the center is hot, about 30 minutes.\n",
        "picture_link": "Dv7zUbMiyjBWrEIy/CesrX5N4mMnI/O"
    },
    {
        "title": "Spicy Coconut Shrimp Bisque",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 pound large shrimp, shelled and deveined, shells reserved ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/3 cup green onions, chopped ADVERTISEMENT",
            "1/3 cup chopped celery ADVERTISEMENT",
            "1/4 cup diced fresh jalapeno pepper ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups ready-to-serve creamy tomato soup ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "1/4 teaspoon red curry paste, or to taste ADVERTISEMENT",
            "1 dash fish sauce, or to taste ADVERTISEMENT",
            "2 ounces rice crackers ADVERTISEMENT",
            "1 tablespoon thinly sliced fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 2 tablespoons butter in a saucepan over medium heat. Stir in shrimp shells; cook, stirring, until shells turn pink, 2 minutes. Pour in water and bring to a simmer; cook 20 minutes. Remove from heat and set aside.\nMelt 2 tablespoons butter in a large saucepan over medium heat. Stir in green onions, celery, and jalapeno; cook, stirring, until mixture is slightly softened, about 5 minutes. Reduce heat to medium low, stir in flour and cook 3 minutes.\nPour tomato soup into onion mixture; stir to combine. Pour shrimp shell mixture through a mesh strainer into tomato soup mixture. Increase heat to medium-high and bring to a simmer.\nStir coconut milk, red curry paste, and fish sauce into tomato soup mixture, bring to a simmer and cook for 15 minutes. Stir in shrimp, decrease to heat to low and simmer until shrimp are cooked through, 3 to 4 minutes. Ladle bisque into bowls, place a rice cracker in the middle, and top the cracker with sliced basil.\n",
        "picture_link": "Ib6cwpQpWfMv4NdUipvvR4GyF9nYoxy"
    }
]