[
    {
        "title": "Shrimp in Avocado Cream Sauce",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/2 cup mashed ripe avocado ADVERTISEMENT",
            "1/2 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a saucepan over low heat, stir in the garlic, and cook 1 to 2 minutes until soft but not browned. Pour in the cream and bring to a simmer. Whisk in the avocado until smooth, return to a simmer, and add the shrimp.\nCook over medium-low heat just until the shrimp have turned opaque, 5 to 7 minutes. Sprinkle with black pepper, and serve hot.\n",
        "picture_link": "3L3DoqVEVHD9x6acpmb1Rc0Ze0vqkNG"
    },
    {
        "title": "Vegetarian Lentil Spaghetti",
        "ingredients": [
            "1/4 cup dried brown lentils, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can stewed tomatoes, undrained ADVERTISEMENT",
            "1 (15 ounce) can artichoke hearts in water ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper, divided ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "1/4 pound thin spaghetti ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1/2 teaspoon sesame seeds ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the lentils, tomatoes and artichokes (with the liquid from the cans), 1/8 teaspoon cayenne pepper and the water into a large saucepan. Bring to a boil. Reduce heat to low and simmer until lentils are tender, about 20 minutes.\nMeanwhile, bring a large pot of lightly salted water and 1 tablespoon of the olive oil to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain. Return pasta to pot and cover to keep warm.\nHeat remaining 2 tablespoons olive oil in a small skillet over medium heat and cook green onions for about 3 minutes. Add 1/8 teaspoon cayenne pepper and sesame seeds and cook until the seeds are lightly browned, about 2 minutes. Set aside.\nAdd the lentil mixture to the pot of pasta and toss to distribute evenly. Add the green onion mixture and toss lightly again. Season with salt and pepper to taste.\n",
        "picture_link": "5/q4bzJbLATAT/Ml.5v1YdvzGsj.vK2"
    },
    {
        "title": "Asian Pear and Strawberry Smoothie",
        "ingredients": [
            "1/2 cup ice ADVERTISEMENT",
            "1 Asian pear, cored and cubed ADVERTISEMENT",
            "2 large strawberries, hulled ADVERTISEMENT",
            "2/3 cup vanilla fat-free yogurt ADVERTISEMENT",
            "1/4 cup fat-free milk ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ice, Asian pear, strawberries, yogurt, milk, and sugar into a blender; blend until smooth.\n",
        "picture_link": "MMG.VXGdKmce19fhoMk38F3MXfX3ns."
    },
    {
        "title": "Hot Dog Roll Up",
        "ingredients": [
            "4 (6 inch) Mission® Fajita Flour Tortillas ADVERTISEMENT",
            "4 all beef hot dogs ADVERTISEMENT",
            "4 slices processed American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place hot dogs between two paper towels and microwave on high for 20 seconds. Remove from towels and reserve the hot dogs hot.\nLay one slice of American cheese on the center of each tortilla.\nPlace hot hot dogs on top of each slice of cheese. Roll up each tortilla/cheese/hot dog by simply rolling from one end to the other.\nPlace all four hot dog roll ups in the microwave and cook for an additional 10 to 12 seconds to fully melt the cheese and warm the tortillas.\nRemove from microwave and serve each hot dog roll up whole.\n",
        "picture_link": "53Fs4vABO9u40cou6kEELM.imRux0kW"
    },
    {
        "title": "Beef Fajita Marinade",
        "ingredients": [
            "1/3 cup fresh lime juice ADVERTISEMENT",
            "1/4 cup tequila ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped cilantro ADVERTISEMENT",
            "1 teaspoon dried, crushed Mexican oregano ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together lime juice, tequila, garlic, cilantro, oregano, cumin, and pepper in a bowl.\nTo use the marinade, pour into a resealable bag, and add 1 to 1 1/2 pounds of flank steak. Press the air out of the bag and seal tightly. Marinate in the refrigerator 8 to 24 hours.\n",
        "picture_link": "Uw6SNkxQCk78QfKO7sBU9v3rm4BjpsW"
    },
    {
        "title": "Feijoada (Brazilian Black Bean Stew)",
        "ingredients": [
            "1 (12 ounce) package dry black beans, soaked overnight ADVERTISEMENT",
            "1 1/2 cups chopped onion, divided ADVERTISEMENT",
            "1/2 cup green onions, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "2 smoked ham hocks ADVERTISEMENT",
            "8 ounces diced ham ADVERTISEMENT",
            "1/2 pound thickly sliced bacon, diced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 bay leaves, crushed ADVERTISEMENT",
            "1/8 teaspoon ground coriander ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro (optional) ADVERTISEMENT",
            "1/4 cup chopped fresh parsley (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large pot or Dutch oven. Add 3/4 cup of chopped onion, green onions, and garlic; cook and stir until softened, about 4 minutes. Pour in the soaked beans and fill with enough water to cover beans by 3 inches. Bring to a boil, then reduce heat to medium-low, and simmer uncovered for 2 hours, or until tender.\nWhile beans are cooking, place ham hocks in smaller pot with 1/4 cup of the chopped onion. Cover with water and simmer, until meat pulls off of the bone easily, about 1 hour. Drain and add to the beans.\nPreheat oven to 375 degrees F (190 degrees C). Place ham, bacon, and remaining onion in a baking dish. Bake 15 minutes or until mixture is crispy.\nDrain the bacon and ham mixture, and add to the beans. Season with bay leaves, coriander, salt and pepper. Simmer uncovered 30 minutes more. Stir in chopped cilantro and parsley just before serving.\n",
        "picture_link": "jY07xh0Hol20Vu10/2DJNYoFGm9Ls3m"
    },
    {
        "title": "Aussie Beef and Peppers with Gnocchi",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound flank steak, cut into strips ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (6 ounce) package fresh button mushrooms, sliced ADVERTISEMENT",
            "1 red bell pepper, cut into strips ADVERTISEMENT",
            "1 yellow bell pepper, cut into strips ADVERTISEMENT",
            "1 (14.4 ounce) can diced tomatoes ADVERTISEMENT",
            "1 teaspoon smoked sweet paprika ADVERTISEMENT",
            "1 (1 pound) package potato gnocchi ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over high heat. Add beef and cook until browned, about 2 minutes. Transfer the beef to a bowl and cover with plastic wrap to keep warm. Reserve the oil in the skillet.\nReduce heat to medium, then stir in the onion and garlic, and cook until transparent, about 5 minutes. Toss in the mushrooms, red peppers, and yellow peppers and cook until tender, another 5 minutes. Stir in the tomatoes and paprika; bring to a boil over medium-high heat. Reduce heat to low and simmer until sauce thickens, about 5 minutes. Combine the beef with the tomato mixture and stir.\nMeanwhile, bring a large pot of lightly salted water to a boil over high heat. Add gnocchi and cook until they float, 2 to 3 minutes. Drain, then toss the gnocchi in the sauce and serve.\n",
        "picture_link": "/zEZWZvszOOldmdHJ4vlR3xjzP9uD0e"
    },
    {
        "title": "Mom's Smoked Salmon Fried Rice",
        "ingredients": [
            "6 cups water ADVERTISEMENT",
            "3 cups long grain white rice, uncooked ADVERTISEMENT",
            "3 tablespoons cooking oil, divided ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "4 ounces smoked salmon, chopped ADVERTISEMENT",
            "1/2 cup frozen peas ADVERTISEMENT",
            "salt and freshly ground pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the water into a saucepan, add the rice, and bring to a boil. Cover, reduce heat to low, and simmer until rice is tender and water is absorbed, about 20 minutes. Set aside.\nMeanwhile, place 2 tablespoons of cooking oil into a large skillet and heat over medium heat. Stir in the eggs and cook until scrambled to desired consistency. Remove eggs from the pan, and set aside.\nUsing the same skillet, add the remaining 1 tablespoon oil, and heat over medium heat. Stir in the onion and green onion; cook until the onion is transparent, about 5 minutes. Stir in the salmon, rice, peas, and scrambled eggs, and toss until evenly blended. Cook and stir rice mixture until heated through. Season to taste with salt and pepper.\n",
        "picture_link": "e3YVzD4JKM.5eYdOT/HWZhDFGSP0gsO"
    },
    {
        "title": "Creamy Corn Couscous",
        "ingredients": [
            "1 cup couscous ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 (14.5 ounce) can cream-style corn ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the couscous in a bowl, and stir in the boiling water. Cover, and let stand for 10 minutes. Meanwhile, bring the cream-style corn, butter, and mozzarella cheese to a simmer in a saucepan over medium heat. Once the corn is hot, fold it into the couscous, and season to taste with salt and pepper.\n",
        "picture_link": "MR3T2YP8I5HnoKMv9tFW.7RCAeIgYo."
    },
    {
        "title": "The Breakfast Omwich",
        "ingredients": [
            "3 slices bacon ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1/2 cup grated Cheddar cheese ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "2 slices cooked, chopped ham ADVERTISEMENT",
            "1/4 cup finely chopped onion (optional) ADVERTISEMENT",
            "1 tablespoon fresh chives, chopped (optional) ADVERTISEMENT",
            "1/4 cup chopped fresh mushrooms (optional) ADVERTISEMENT",
            "1/4 cup green bell pepper, finely chopped (optional) ADVERTISEMENT",
            "1 teaspoon finely chopped jalapeno pepper (optional) ADVERTISEMENT",
            "2 drops hot pepper sauce (e.g. Tabasco™), or to taste (optional) ADVERTISEMENT",
            "4 slices bread, toasted ADVERTISEMENT",
            "2 tablespoons mayonnaise, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a skillet and cook over medium heat until evenly browned and crisp. Remove, and drain on paper towels. When cooled, crumble into small pieces.\nStir the eggs and 1/4 cup Cheddar cheese together in a bowl until blended. Season to taste with salt and pepper. Pour the egg mixture into a skillet over medium heat. When the bottom of the eggs is set, layer with the bacon, ham, and if using, onion, chives, mushrooms, green pepper, jalapeno or hot pepper sauce. . Season with hot pepper sauce, if desired. Sprinkle with the remaining 1/4 cup Cheddar cheese. Carefully fold one half of the egg mixture over the filling ingredients. Cook until the cheese melts and the bottom is golden; turn and cook the other side until golden. Remove from the heat.\nSet two slices of toast on two serving plates, and spread each slice with mayonnaise, if desired. Cut the egg mixture in half, and place one half on each piece of toast. Top each with the remaining toast, cut each omwich in half, and serve immediately.\n",
        "picture_link": "DbU6V0x.FX8iFDL8bEwmVRdXBcLpXsu"
    },
    {
        "title": "Gold Fever Chicken Wing Sauce",
        "ingredients": [
            "1/2 cup honey mustard ADVERTISEMENT",
            "1/4 cup cayenne pepper hot sauce ADVERTISEMENT",
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together honey mustard, hot sauce, butter, salt, and pepper in a saucepan over medium heat. Stir until butter is melted; simmer until sauce begins to thicken, about 5 minutes. Use in your favorite chicken wings recipe and serve while hot.\n",
        "picture_link": "eIHEAeV5qevTHrj8S95taDOFocMBKfq"
    },
    {
        "title": "Dessert Nachos",
        "ingredients": [
            "1/3 cup peanut butter ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "2 1/2 cups mini round corn tortilla chips ADVERTISEMENT",
            "1/4 cup miniature marshmallows ADVERTISEMENT",
            "1/4 cup sweetened flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler.\nCombine the peanut butter and confectioners' sugar in a microwave-safe bowl. Heat the mixture until the peanut butter melts, about 1 minute. Place the chocolate chips in a separate microwave-safe bowl; melt the chips in the microwave, about 1 minute.\nArrange the tortilla chips into an even layer on a baking sheet. Drizzle the peanut butter mixture and the melted chocolate over the chips. Scatter the marshmallows and coconut over the chips.\nPlace under preheated broiler until the marshmallows begin to brown, 2 to 3 minutes. Serve hot.\n",
        "picture_link": "i9gU..0UJXWD8hxHJRbv3q.mGb7HfAC"
    },
    {
        "title": "Kentucky Tomato Soup",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped carrots ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "2 1/2 cups chopped fresh tomatoes ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "3/4 cup strong brewed coffee ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a stock pot over medium heat. Stir in the onion, carrots, celery, garlic, and parsley; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the tomatoes, tomato sauce, coffee, water, sugar, salt, and pepper. Bring the soup to a boil and simmer for 20 to 25 minutes.\nPour the hot soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Stir in the cream and heat until warm. Do not boil.\n",
        "picture_link": "F0fLLsp3UkeFEpWfbPz3oEEqi241SNq"
    },
    {
        "title": "Roasted Pork Chops with Tomatoes, Mushrooms, and Garlic Sauce",
        "ingredients": [
            "1 pound roma tomatoes, quartered ADVERTISEMENT",
            "1 pound sliced button mushrooms ADVERTISEMENT",
            "5 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Spice Rub ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "1/4 teaspoon dried oregano leaves ADVERTISEMENT",
            "1/4 teaspoon dried marjoram leaves ADVERTISEMENT",
            "1/4 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/4 teaspoon dried rosemary, crushed ADVERTISEMENT",
            "1/4 teaspoon dried sage leaves, crushed ADVERTISEMENT",
            "1/4 teaspoon dried basil leaves ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon ground paprika ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper ADVERTISEMENT",
            "2 1/4 pounds pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nIn a 9x13 inch baking dish, toss tomatoes, mushrooms, garlic, and olive oil with salt and pepper to taste. Mix lightly with hands to coat all ingredients with oil, and spread the tomato-mushroom mixture to the edges of the dish, leaving the center free for the pork chops.\nCombine 1 teaspoon salt, 1/2 teaspoon black pepper, cumin, ground coriander, oregano, marjoram, thyme, rosemary, sage, basil, garlic powder, onion powder, ground paprika, sugar, and crushed red pepper in a bowl to make a spice rub.\nSprinkle the pork chops with the spice rub, working the rub well into both sides of the meat. Place pork chops in the center of the baking dish, surrounded by the tomato and mushroom mixture.\nRoast in preheated oven until the pork is no longer pink in the center and mushrooms are tender, about 45 to 50 minutes. An instant-read thermometer inserted into the center of a chop should read 145 degrees F (63 degrees C). Transfer pork chops to a serving dish and top with roasted tomato-mushroom mixture and all pan juices to serve.\n",
        "picture_link": "p2qO5s7PjFcS3N6RgSWHI8RbjZkfcXa"
    },
    {
        "title": "Zesty Barbeque Marinade",
        "ingredients": [
            "1 cup barbeque sauce ADVERTISEMENT",
            "1/2 cup steak sauce ADVERTISEMENT",
            "1/2 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "1/2 cup bourbon whiskey ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons crushed garlic ADVERTISEMENT",
            "2 tablespoons seasoned salt ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "2 tablespoons dried minced onion ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "2 tablespoons habanero hot sauce ADVERTISEMENT",
            "3 teaspoons curry powder ADVERTISEMENT",
            "2 tablespoons red pepper flakes ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the barbeque sauce, steak sauce, beer, bourbon whiskey, Worcestershire sauce, garlic, seasoned salt, black pepper, dried onion, basil, oregano, habanero hot sauce, curry powder, red pepper flakes, and brown sugar.\nCover the bottom of a 9x13 inch baking dish with approximately 1/2 the marinade. Place desired meat in the dish, and cover with remaining mixture. Cover, and marinate in the refrigerator at least 6 hours before grilling as desired.\n",
        "picture_link": "ghVhTgdZzs9NyMrHijjGYGsswXD58k6"
    },
    {
        "title": "Bavarian Sauerkraut",
        "ingredients": [
            "1 tablespoon bacon drippings ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "2 (16 ounce) packages sauerkraut, undrained ADVERTISEMENT",
            "1 tablespoon packed brown sugar ADVERTISEMENT",
            "1 teaspoon caraway seeds ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "1/2 cup cooking sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat bacon drippings in a large skillet over medium heat; cook and stir onion until soft and translucent, about 5 minutes.\nPlace sauerkraut with juice into a large bowl and cover with water. Stir and use your hands to squeeze out as much of the water and juice as possible. Add squeezed sauerkraut to onion.\nStir brown sugar, caraway seeds, chicken stock, and cooking sherry into the sauerkraut mixture. Reduce heat to low and simmer until almost all the liquid has evaporated, 30 to 40 minutes, stirring occasionally.\n",
        "picture_link": "4N/rCsZuqEKHeUQBTq62qPrm/rta7Ja"
    },
    {
        "title": "Asian-American Slaw With Peanuts and Jalapenos",
        "ingredients": [
            "1 1/2 pounds cabbage, coarsely chopped ADVERTISEMENT",
            "1 small red bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 stalks celery, sliced ADVERTISEMENT",
            "2 tablespoons seeded and minced jalapeno pepper ADVERTISEMENT",
            "1 1/2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1/4 cup crunchy peanut butter ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon dark sesame oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped dry-roasted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss cabbage, red bell pepper, onion, celery, jalapeno pepper, and fresh ginger in a large salad bowl. Whisk peanut butter, soy sauce, lime juice, sugar, sesame oil, and salt in a separate bowl until dressing is smooth. Pour dressing over slaw and toss to combine. Let stand at least 1 hour; serve sprinkled with chopped peanuts.\n",
        "picture_link": "/eEGhZ99CfUiR8KUKLfu7/ZEP6uzVvi"
    },
    {
        "title": "Lucky's Gazpacho",
        "ingredients": [
            "2 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 cucumber, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 small red onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 cups tomato juice ADVERTISEMENT",
            "2 teaspoons beef bouillon granules ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon celery salt ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 teaspoons red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree roma tomatoes, cucumber, green and red bell peppers, red onion, and garlic in a blender, about 30 seconds. Add tomato juice, beef bouillon granules, oregano, basil, celery salt, salt, black pepper, Worcestershire sauce, and red wine vinegar. Pulse a few times to mix. Pour into a bowl and chill at least 1 hour.\n",
        "picture_link": "ACnlfm/2LnnRFRyytjyNrksLNSeDAVa"
    },
    {
        "title": "Braised Black Lentils",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1/2 cup diced carrot ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "6 sprigs fresh thyme ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 cup beluga lentils ADVERTISEMENT",
            "1 3/4 cups chicken stock ADVERTISEMENT",
            "1 tablespoon champagne vinegar ADVERTISEMENT",
            "2 tablespoons chopped Italian parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in olive oil over medium heat in a saucepan. Cook and stir onion, carrot, celery, and salt until vegetables are softened and onion is translucent, about 10 minutes.\nReduce heat to low and add thyme sprigs and pepper. Stir in lentils until well coated. Add chicken stock and bring to a gentle simmer.\nReduce heat to low, cover and cook, checking occasionally, until the lentils are tender and have absorbed all the liquid, about 35 minutes. Remove from heat and discard thyme stems. Stir in champagne vinegar and parsley. Season with salt and pepper to taste.\n",
        "picture_link": "Z1bdOr1YUWymKe4sFyWLsmJrfyx6zFy"
    },
    {
        "title": "Jen's Creamy Garlic Mashed Potatoes",
        "ingredients": [
            "2 whole heads garlic, top third sliced off and discarded ADVERTISEMENT",
            "olive oil ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "5 pounds Yukon Gold potatoes, peeled and cubed ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 (4 ounce) package cream cheese ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace garlic heads in a baking dish and drizzle each with 1 tablespoon of olive oil. Bake in the preheated oven until garlic is soft and brown, about 45 minutes.\nBring a large pot of water to a boil and stir in sea salt. Cook potatoes in the salted water until tender, about 30 minutes. Drain.\nTransfer potatoes to a large bowl and add sour cream, cream cheese, butter, salt, and black pepper to the bowl. Cover bowl with a lid or a piece of aluminum foil and let mixture stand for 5 minutes to soften butter and cream cheese, about 5 minutes.\nSqueeze roasted garlic from the cloves into the potato mixture; mash potatoes until smooth, creamy, and thoroughly combined.\n",
        "picture_link": "k/SDgZZwusZQ96HSGj5vfIHC.Npa.ea"
    },
    {
        "title": "Tomato Watermelon Salad",
        "ingredients": [
            "1 large seedless watermelon, cut into 1-inch cubes ADVERTISEMENT",
            "4 tomatoes, cut into 1-inch dice ADVERTISEMENT",
            "12 mint leaves, sliced thinly ADVERTISEMENT",
            "1 large sweet onion, thinly sliced ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons white balsamic vinegar ADVERTISEMENT",
            "1 pinch coarse salt, or to taste ADVERTISEMENT",
            "1 pinch ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently mix watermelon, tomatoes, mint, onion, and feta cheese in a large bowl.\nWhisk olive oil, vinegar, salt, and pepper together in small bowl; drizzle over salad and gently toss to coat.\n",
        "picture_link": "Z50eV/MPkUdy6bHWlhQ1KJJYsQ2sh7q"
    },
    {
        "title": "Sonny's Waldorf Turkey Salad",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups cubed cooked turkey ADVERTISEMENT",
            "1 cup halved red seedless grapes ADVERTISEMENT",
            "1 apple, cored and chopped ADVERTISEMENT",
            "1/2 cup chopped celery with leaves ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, Parmesan cheese, cider vinegar, sugar, curry powder, and black pepper together in a bowl until smooth. Lightly toss turkey meat, red grapes, apple, celery, red onion, and walnuts in a salad bowl; pour dressing over salad and toss again to coat. Chill at least 1 hour (or overnight for best flavor).\n",
        "picture_link": "QQK4SUhR7c8wR3sR9mat9ip.46DJ6Fa"
    },
    {
        "title": "Savory Pan-Seared Tuna Steaks",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 teaspoons Asian (toasted) sesame oil ADVERTISEMENT",
            "2 teaspoons molasses ADVERTISEMENT",
            "1 teaspoon cayenne pepper, or more to taste ADVERTISEMENT",
            "6 thin slices fresh ginger, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 1-inch-thick tuna steaks, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix soy sauce, olive oil, lemon juice, sesame oil, molasses, cayenne pepper, ginger, and garlic together in a bowl.\nPlace tuna steaks in a large resealable bag or airtight container; pour marinade over steaks. Marinate steaks at room temperature for 20 minutes.\nHeat a non-stick pan over medium heat. Remove steaks from marinade and arrange in the hot pan; gently shake pan to avoid sticking. Cook approximately 1 1/2 minutes and flip. Cook other side until tuna is desired doneness, 1 to 2 more minutes. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).\n",
        "picture_link": "aC9yBt9i7eapDOnyr9GF4R44dOj6zre"
    },
    {
        "title": "Perfect Butternut Squash Muffins",
        "ingredients": [
            "1 small butternut squash ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/4 cup raisins (optional) ADVERTISEMENT",
            "1/4 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease 20 muffin cups.\nCut a 1/2-inch hole into the larger part of the squash and cover with a damp paper towel.\nCook squash in a microwave oven in 3-minute increments, turning slightly after each increment, until squash can be easily pierced with a fork, 9 to 12 minutes. Set aside until cool to the touch, about 20 minutes.\nHalve squash lengthwise and scoop out seeds. Measure 1 1/2 cups squash into a large bowl. Mash eggs, water, vegetable oil, white sugar, and brown sugar into the squash. Whisk whole wheat flour, all-purpose flour, baking powder, baking soda, cinnamon, salt, nutmeg, cloves, and pumpkin pie spice into the squash mixture until you have a smooth batter. Fold raisins and walnuts into the batter.\nSpoon batter into prepared muffin cups to about 1/2 to 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 15 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "teNjyUmmUt6I6KFHmBACI4cD6PEBLvW"
    },
    {
        "title": "Orange Vegan Cake",
        "ingredients": [
            "1 large orange, peeled ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease an 8x8-inch baking pan.\nBlend orange in the blender until liquified; measure 1 cup orange juice.\nWhisk orange juice, flour, sugar, vegetable oil, baking soda, and salt together in a bowl. Pour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 30 minutes.\n",
        "picture_link": "kYM.5kyL4xCXjx8IvHP62bwkpT4zC0i"
    },
    {
        "title": "Mini Cheesecakes from PHILADELPHIA®",
        "ingredients": [
            "1 cup HONEY MAID Graham Cracker Crumbs ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "3 tablespoons butter or margarine, melted ADVERTISEMENT",
            "3 (8 ounce) packages PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup whipping cream ADVERTISEMENT",
            "2 cups blueberries ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 325 degrees F.\nMix graham crumbs, 2 Tbsp. sugar and butter; press onto bottoms of 18 paper-lined muffin pan cups.\nBeat cream cheese, remaining 3/4 cup sugar and vanilla with mixer until blended. Add eggs, 1 at a time, mixing on low speed after each just until blended. Pour over crusts.\nBake 25 to 30 min. or until centers are almost set. Cool completely. Refrigerate 2 hours.\nBeat whipping cream with mixer on high speed until stiff peaks form; spread gently onto cheesecakes. Top with blueberries and lemon zest.\n",
        "picture_link": "oqlr7EF72luCf5UWK26qNx3p/7tsWOy"
    },
    {
        "title": "Rutabaga Oven Fries",
        "ingredients": [
            "1 rutabaga, peeled and cut into spears ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "4 sprigs fresh rosemary, minced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 pinch salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCombine rutabaga spears with oil, minced rosemary, garlic, and salt. Toss until evenly coated.\nLay rutabaga spears onto a baking sheet, leaving space between for even crisping. Bake until rutabaga fries are cooked through and crisped on the outside, about 30 minutes.\n",
        "picture_link": "Kkz.0YIdYeC68GBksCTfczGFQZfVFtO"
    },
    {
        "title": "Homemade Baking Mix",
        "ingredients": [
            "9 cups all-purpose flour ADVERTISEMENT",
            "1 cup nonfat dry milk powder ADVERTISEMENT",
            "5 tablespoons baking powder ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 cup vegetable shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, dry milk powder, baking powder, sugar, and salt in a large bowl until thoroughly combined. Cut shortening into dry ingredients with a pastry cutter, about 1/2 cup at a time, until mixture resembles cornmeal. Store in an air-tight container for up to 3 months.\n",
        "picture_link": "ar3vasvs4Z6BDQSzsz6LsLiWroCFMpu"
    },
    {
        "title": "Israeli Couscous and Cheese",
        "ingredients": [
            "2 teaspoons butter ADVERTISEMENT",
            "1 cup pearl (Israeli) couscous ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/4 cup diced pimientos ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "3 ounces shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Cook and stir couscous in the melted butter until slightly toasted, 2 to 3 minutes.\nPour in chicken broth and bring to a boil. Reduce heat to low and simmer until most of the stock is absorbed and the couscous have plumped, 6 to 7 minutes.\nStir heavy cream and pimientos into couscous; add cayenne pepper and cook until couscous is tender, 2 to 3 minutes. Add more broth if needed.\nRemove from heat and stir in Cheddar cheese until melted; add chives and stir to combine. Season with salt, black pepper, and cayenne pepper to taste.\n",
        "picture_link": "QSZ1AiY5NB.OuHJeEGaZdXA0p6.n.9S"
    },
    {
        "title": "Cod with Lemon, Garlic, and Chives",
        "ingredients": [
            "4 (6 ounce) cod fillets ADVERTISEMENT",
            "4 teaspoons olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 bunch fresh chives, coarsely chopped ADVERTISEMENT",
            "2 lemons, sliced ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCut 4 large squares of heavy-duty aluminum foil. Brush each fillet with olive oil and sprinkle with salt and black pepper. Place each fillet in the center of an aluminum foil square. Lay lemon slices down the length of each fillet and sprinkle garlic slices and chives over the top. Fold foil over the fish and turn the edges over 2 or 3 times; flatten to seal the packets.\nBake in the preheated oven until the fish is opaque and flakes easily with a fork, 15 to 20 minutes.\n",
        "picture_link": ".btmA7sFX3YcdmpVvbQBq3AC/G9YRHG"
    },
    {
        "title": "Chicken Biscuits",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "6 chicken breast tenderloins ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 (1 pound, 3 ounce) package refrigerated large flaky layer biscuits ADVERTISEMENT",
            "1 (10.75 ounce) can cream of chicken soup ADVERTISEMENT",
            "1 1/2 cups frozen mixed vegetables, thawed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir chicken tenderloins in hot oil until the juices run clear and meat is no longer pink inside, about 10 minutes, turning once. Chop chicken.\nPreheat oven to 350 degrees F (175 degrees C). Spray 16 muffin cups with cooking spray.\nSplit each biscuit in half and press dough halves into prepared muffin cups, shaping the dough into the bottom and up the sides of each muffin cup.\nMix chicken and with cream of chicken soup, mixed vegetables, and half the Cheddar cheese in a bowl. Spoon a heaping tablespoon of chicken, vegetables, and sauce into each dough cup and top each with 1 1/2 teaspoon of remaining Cheddar cheese.\nBake in the preheated oven until biscuit cups are slightly browned and puffed, the cheese is melted, and the filling is hot, about 14 minutes.\n",
        "picture_link": "mFJe6h549kgGapkoXd0gDEJsejYEute"
    },
    {
        "title": "Zucchini Raisin Muffins",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup grated zucchini ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line muffin cups with paper liners.\nMix flour, salt, nutmeg, baking soda, and baking powder in a mixing bowl.\nBeat egg, sugar, and vegetable oil together in a large bowl. Fold zucchini and raisins into egg mixture until evenly mixed. Stir flour mixture into the wet mixture to make a batter. Divide batter into 12 muffin cups to about 2/3 full.\nBake in the preheated oven until golden and the tops spring back when lightly pressed, about 25 minutes.\n",
        "picture_link": "VA70W5Os2dS9BAo3enQZblmWr.m1esm"
    },
    {
        "title": "Cornish Hens with Garlic Cream Cheese",
        "ingredients": [
            "2 Cornish game hens, giblets removed ADVERTISEMENT",
            "3 tablespoons garlic and herb seasoning (such as McCormick®), divided ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, divided ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line the inside of a roasting pan with aluminum foil.\nPlace hens, breast-side up, in the prepared roasting pan.\nMix 1 tablespoon garlic and herb seasoning with 1 package cream cheese in a bowl. Stuff cream cheese mixture in 1 hen. Repeat with 1 tablespoon garlic and herb seasoning and remaining 1 package cream cheese; stuff the second hen.\nBrush hens with melted butter; sprinkle with remaining 1 tablespoon garlic and herb seasoning. Season with salt. Cover hens with aluminum foil.\nBake in the preheated oven for 1 hour. Remove aluminum foil and bake until no longer pink at the bone and the juices run clear, about 15 more minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C).\n",
        "picture_link": "Y17RRiiYIC/fAjPuRj4alFg1DIzKNz2"
    },
    {
        "title": "Mini Chocolate Chip Pancakes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons butter, melted and cooled ADVERTISEMENT",
            "1/2 cup miniature chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour, sugar, baking powder, and salt together in a bowl. Beat egg into milk in a separate bowl until thoroughly combined. Pour melted butter into flour mixture; whisk in milk mixture to make a smooth batter. Fold chocolate chips into batter.\nHeat a small nonstick skillet over low heat; pour about 1/3 cup of batter into hot skillet and cover with a lid. Cook pancake until browned on the bottom, about 3 minutes; flip pancake and cook covered until other side is browned. Repeat with remaining batter.\n",
        "picture_link": "eYry6ifgVUQGIjNu8patLI1VcWJIhBK"
    },
    {
        "title": "Lemon Chicken and Veggie Pasta",
        "ingredients": [
            "1 teaspoon lemon pepper ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon dried rosemary ADVERTISEMENT",
            "1/4 teaspoon Cajun seasoning ADVERTISEMENT",
            "1/4 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "5 large chicken tender strips ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as Hatch®) ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "1 cup (1 1/2-inch) sliced asparagus ADVERTISEMENT",
            "6 baby carrots, thinly sliced ADVERTISEMENT",
            "1 zucchini, halved and sliced ADVERTISEMENT",
            "6 baby bella mushrooms, sliced ADVERTISEMENT",
            "3 small bell peppers, sliced ADVERTISEMENT",
            "2 large cloves garlic, minced ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1/4 teaspoon lemon zest ADVERTISEMENT",
            "1 (12 ounce) package no-yolk egg noodles ADVERTISEMENT",
            "1 ounce grated Parmesan cheese ADVERTISEMENT",
            "1 ounce shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix lemon pepper, thyme, parsley, rosemary, Cajun seasoning, and black pepper in a small bowl.\nRub olive oil over chicken tenders.\nArrange chicken tenders in a large skillet over medium heat; season with half the seasoning mixture. Cook chicken until halfway cooked, about 5 minutes. Flip and season the other sides with the remaining seasoning mixture; cook until chicken is no longer pink in the center and juices run clear, about 5 more minutes. Remove cooked chicken from skillet.\nMix tomatoes with green chile peppers, onion, asparagus, carrots, zucchini, mushrooms, bell peppers, and garlic in the same skillet; cook until vegetables are softened, 3 to 4 minutes. Add chicken broth, lemon juice, lemon zest, and chicken tenders to the vegetable mixture. Reduce heat to medium-low, cover, and simmer for 10 minutes.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 10 minutes. Drain and return noodles to pot. Add Parmesan cheese and mozzarella cheese; toss until cheeses melt. Transfer noodles to 5 serving bowls; top each with 1 chicken tender and 1/5 the vegetable mixture.\n",
        "picture_link": "ONakJQFnalH9.FpByx/eJbbp44K4VUq"
    },
    {
        "title": "Hot Chocolate Mix",
        "ingredients": [
            "3 cups nonfat dry milk powder ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix milk powder, sugar, cocoa, and salt together in a bowl. Transfer mix to an airtight container.\n",
        "picture_link": "Nkt1RA/h9Pwb0SDpH1k798vI9qiwf0W"
    },
    {
        "title": "Awesome Blueberry Muffins",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "2 cups frozen blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk and vinegar in a small bowl; allow to rest for 5 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Lightly grease muffin cups or line with paper liners.\nMix all-purpose flour, whole wheat flour, sugar, baking powder, and salt in a large bowl; make a well in the center. Pour eggs, milk mixture, and canola oil into well; stir until batter is just combined. Fold in blueberries and pour batter into prepared muffin cups.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes. Cool in the pans for 10 minutes before removing to cool slightly on a wire rack.\n",
        "picture_link": "4rhSmbd83dmJV2V2MbWoVoU3Tif2rGS"
    },
    {
        "title": "Prune and Raisin Filled Cookies",
        "ingredients": [
            "2 1/4 cups pitted prunes ADVERTISEMENT",
            "3 cups raisins ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking soda ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 lemon ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Filling: Boil prunes until plump. Put raisins in pan, cover with water and heat until water steams. Strain and add 1/2 cup of sugar to raisins, mix well and heat again until almost dry. Remove from heat and set aside. Pit the cooked prunes, if not already pitted, chop and add to raisins. Add chopped nuts, if desired. Set fruit mix aside overnight.\nThe next day make the dough. In large bowl, mix together the flour, baking soda, sugar and salt. Make a well in the center. Add the eggs, milk, grated lemon rind and oil and mix to form dough. Knead the dough to the consistency for rolling.\nDivide the dough into 6 parts. Roll each part into a rectangle of 1/8 inch thickness. Put 1/6 of the fruit mix onto the dough rectangle and spread evenly.\nFold the dough lengthwise into the center. Fold the other side in slightly past center, and press seam lightly. Pinch ends to close. Lift the loaf with a spatula and place on lightly greased cookie sheet with seam under.\nBake in 400 degree F (205 degrees C) oven for 18 - 20 minutes (top should be lightly brown). Allow to cool then cut crosswise slices about 1 inch thick.\nTo Make Glaze: Use juice of 1 lemon and enough confectioners' sugar to obtain consistency for brushing top of cookie. Drop sprinkles onto glaze and allow glaze to set. Enjoy!\n",
        "picture_link": "I/IbBT8xoszeaij3Za.aJuERJLFZJ7e"
    },
    {
        "title": "Pumpernickel Bread II",
        "ingredients": [
            "2 cups warm milk ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 tablespoons molasses ADVERTISEMENT",
            "3 1/4 cups bread flour ADVERTISEMENT",
            "1 1/3 cups rye flour ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1 1/3 teaspoons salt ADVERTISEMENT",
            "2 2/3 teaspoons active dry yeast ADVERTISEMENT",
            "4 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 2/3 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix well bread flour, rye flour, cornmeal, salt, yeast, cocoa, and brown sugar. Add milk, oil, and molasses. Mix thoroughly. When mixed well enough that the dough holds together, knead by hand 15-20 minutes.\nCover, let rise in bowl 30 minutes. Punch down, form, and place into 9 1/2x5 inch pan. Cover with damp cloth and let rise about 1 hour.\nBake in preheated 375 degree F (190 degrees C) oven 25 to 30 minutes, covering top with aluminum foil last 10 minutes.\n",
        "picture_link": "0Ke8xK2lTpodlLroAkMqu2R34Im7hre"
    },
    {
        "title": "Cranberry Walnut Bread",
        "ingredients": [
            "3/4 cup butter, room temperature ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "3 eggs, room temperature ADVERTISEMENT",
            "3 tablespoons orange zest ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "4 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "2 1/4 cups orange juice ADVERTISEMENT",
            "3 cups whole cranberries ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease three 8x4-inch loaf pans. Line bottoms with parchment paper, if desired.\nBeat the butter and sugar with an electric mixer in a large bowl until light and fluffy. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Stir in the orange zest.\nSift together the flour, salt, baking powder and baking soda. Add to the egg mixture, alternating with orange juice.\nCoarsely chop the cranberries.\nPour the flour mixture into the mixing bowl alternately with the orange juice, mixing until just incorporated. Fold in the chopped cranberries and walnuts, mixing just enough to evenly combine. Divide the batter evenly among prepared pans.\nBake in the preheated oven for 30 minutes. Check for browning: cover the tops with aluminum foil to prevent them from becoming too dark. Bake until a toothpick inserted in the center of the loaves comes out clean, about 30 minutes more. Cool on wire racks.\n",
        "picture_link": "AUUxonqdwdR6mODmZ8JzvWW3c4PxcvS"
    },
    {
        "title": "Original Cheese Tempters",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 pound shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground cayenne pepper ADVERTISEMENT",
            "1 1/8 cups all-purpose flour ADVERTISEMENT",
            "2 cups pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the butter, cheese, salt and cayenne pepper together until well combined. Stir in the flour and mix well. Shape dough into 3 rolls about 1 1/2 inches in diameter. Wrap the rolls in plastic wrap and refrigerate until firm.\nPreheat oven to 375 degrees F (190 degrees C).\nCut rolls into 1/8 to 1/4 inch thick slices. Place on a parchment paper lined baking sheet and press a pecan half or piece onto the top of each cookie.\nBake at 375 degrees F (190 degrees C) for about 12 minutes or until set. Let cool on wire wracks before storing in an airtight container.\n",
        "picture_link": "bAz0QjZkzgjc.1sy2e9eXJQjtYU.ArW"
    },
    {
        "title": "Oriental Chicken Salad",
        "ingredients": [
            "1/2 cup diced cooked chicken breast meat ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons rice vinegar ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup peanut oil ADVERTISEMENT",
            "3 green onions, minced ADVERTISEMENT",
            "1 (3 ounce) package ramen noodles - cooked, drained and chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl combine the soy sauce, vinegar, sugar and peanut oil.\nIn a medium sized bowl toss the dressing with the chicken, scallions and noodles. Chill and serve.\n",
        "picture_link": "tu8.ai76sIdsSBXMj0lkrzH/GE7.hG."
    },
    {
        "title": "Dobos Torte",
        "ingredients": [
            "9 egg whites ADVERTISEMENT",
            "8 egg yolks ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/2 tablespoon shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 recipe Chocolate Buttercream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Have ready two 10-inch cardboard circles. Generously grease a 9-inch springform pan with soft butter, and dust with flour.\nBeat the egg whites until frothy, and gradually add 1 cup sugar. Beat just to soft peaks. In another bowl, beat the yolks with the milk, lemon peel, vanilla, and salt. Fold this into the egg whites. Sift the flour over the egg mixture, and fold in.\nSpread 1 1/3 cups batter into the prepared pan. Bake for about 5 to 9 minutes, or until small, brown spots begin to appear on cake. Remove the cake from the oven, and remove layer from pan with a spatula. Dust the cake lightly with flour, and place on a rack to cool. Grease pan again, and repeat this process until all of the batter is used, about 6 times more. Place the layers between wax paper, and cover with a towel. Chill layers for a few hours. Make the Chocolate Buttercream.\nLayer the chilled layers on one of the cardboard rounds with the buttercream. Start with one layer; cover with the buttercream, and then press down with another layer to make a good seal. Repeat this with the remaining layers, but reserve one layer. Wrap the cake in plastic, and chill for at least 6 hours along with the remaining buttercream. Grease the other cardboard round with the shortening, and place the last layer on it.\nPlace 1 cup sugar into a non-stick skillet over medium heat. Allow sugar to cook until the edges look melted and brown. Begin stirring with a wooden spoon. Cook until the sugar become an amber color, and is smooth. Carefully pour the caramel over the top of the last layer, and spread to the edges with an oiled knife. Quickly, using an oiled knife, indent the top of the caramel into 16 wedges. Allow to cool slightly, and then retouch the indents with the knife again. Place layer onto a counter top dusted with sugar, and allow the caramel to cool completely.\nPlace some more buttercream on top of the chilled torte, and top with the caramel round. Frost the sides with the remaining buttercream. Chill the torte before serving.\n",
        "picture_link": "i/Nm7yDivmHgRaWBLDKgXLrW6kziFSG"
    },
    {
        "title": "Rhubarb Strawberry Cake",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup quick cooking oats ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 cups rhubarb, chopped ADVERTISEMENT",
            "1 pint fresh strawberries, halved ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl combine flour, packed brown sugar, quick-cooking oats, cinnamon, and nutmeg. Cut in the butter until the mixture is crumbly. Press half of the mixture into an ungreased 9 inch round baking pan.\nCombine chopped rhubarb and strawberries; spoon into baking pan.\nIn a saucepan combine sugar, cornstarch, water, and vanilla. Bring to a boil over medium heat. Cook and stir for 2 minutes. Pour mixture over fruit. Sprinkle fruit with the remaining crumb mixture.\nBake at 350 degrees F (175 degrees C) for 1 hour. Wonderful when served with vanilla ice cream.\n",
        "picture_link": "0NRkjzjW7O6AmGx2xjWSClV2zVgxnqe"
    },
    {
        "title": "Amaretto Cream Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/4 cup amaretto liqueur ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (15 ounce) can apricot halves, drained ADVERTISEMENT",
            "2/3 cup amaretto liqueur ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "3 tablespoons amaretto liqueur ADVERTISEMENT",
            "4 cups sifted confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 round 9 inch pans.\nIn a large bowl, combine cake mix, eggs, buttermilk, 1/4 cup amaretto and oil. Beat for 4 minutes on medium speed. Pour into 2 round 9 inch pans.\nBake at 350 degrees F (175 degrees C) for 35 minutes, or until a toothpick inserted into the cake comes out clean. Cool completely. When cool, slice each layer in half horizontally, making 4 layers.\nMake apricot filling by combining drained apricots and 1/2 cup plus 2 tablespoons amaretto in a blender. Process until smooth. Place bottom layer of cake on serving dish. Spread 1/3 of apricot filling on cake layer, then repeat with other layers. Frost with Amaretto Cheese Frosting.\nTo make Amaretto Cheese Frosting: In a medium bowl, beat cream cheese and 3 tablespoons amaretto until soft. Add confectioners sugar and beat until smooth. Frost top and sides of cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Barbeque Sauce I",
        "ingredients": [
            "6 tablespoons lemon juice ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan over low heat, combine the lemon juice, vinegar, brown sugar, Worcestershire sauce, ketchup and mustard powder and stir well. Simmer for 10 minutes, remove from heat and allow to cool.\n",
        "picture_link": "kwEXjF1deN.S9SDtAzslUwZhc/ZLJnu"
    },
    {
        "title": "Sourdough Rye",
        "ingredients": [
            "1 cup rye flour ADVERTISEMENT",
            "1/2 cup bread flour ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 tablespoon salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon caraway seed ADVERTISEMENT",
            "1 cup rye flour ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "1 cup sourdough starter ADVERTISEMENT",
            "1/2 cup water (optional) ADVERTISEMENT",
            "1 teaspoon salt (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "The night before you want to bake the bread, feed the starter with 1 cup rye flour, 1/2 cup bread flour, and 2/3 cup water. Cover, and let stand at room temperature overnight.\nIn a large bowl, mix together expanded starter, 1/4 cup water, salt, sugar, oil, seeds, and 1 cup each rye and bread flour. Add more or less flour as necessary to get a soft dough.\nTurn dough out onto a lightly floured surface, and knead until satiny. Place in a well oiled bowl, and turn once to oil the surface. Cover with a damp cloth. Allow to rise in a warm spot until doubled.\nPunch down dough, and shape into loaves. Place on a greased baking sheet. Allow to rise until doubled in bulk.\nBake at 350 degrees F (175 degrees C) for 40 minutes, or until it sounds hollow when thumped on the bottom.\nAlternate baking method for chewier, salty crust: Bake 20 minutes at 350 degrees F (175 degrees C). In a small bowl, mix together 1/2 cup water and 1 teaspoon salt. Remove loaves from oven and brush crust with salt water. Continue baking for 25 minutes more, brushing at 10 minute intervals.\n",
        "picture_link": "08HB0q.PfiFr7S72EIcirfU54Dmcam."
    },
    {
        "title": "Double Chocolate Cake I",
        "ingredients": [
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 (1 ounce) squares semisweet chocolate, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 teaspoon red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift the flour, sugar, baking powder, soda, and salt together into a large bowl.\nAdd the butter or margarine, milk, and vanilla to the dry ingredients in the bowl. Beat for 300 strokes, or for approximately 2 minutes at low speed with an electric mixer.\nAdd the eggs, melted chocolate, and red food coloring to the batter. Beat an additional 300 strokes or 2 minutes at low speed.\nPour into two greased and floured 8 inch layer pans. Bake at 375 degrees F (190 degrees C) for 30 to 35 minutes, or until done.\n",
        "picture_link": "DK7Dy7NOUUihNg54iM/Q0FaWxE4x9om"
    },
    {
        "title": "Apple-Cinnamon Farfel Kugel",
        "ingredients": [
            "1 cup hot water ADVERTISEMENT",
            "1 cup matzo farfel ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 large apples - peeled, cored and shredded ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "3 egg whites, stiffly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray an 8x8 inch baking dish with non-stick cooking spray.\nIn a large bowl, combine the water and farfel. Add the sugar, apple, and cinnamon. Fold in the egg whites. Pour mixture into the prepared baking dish and dust the top with more cinnamon.\nBake at 375 degrees F (190 degrees C) for 45 minutes.\n",
        "picture_link": "5ZuuEOAuP1gU3MQRklvtY6AVfxPIoem"
    },
    {
        "title": "Watergate Cake III",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1/2 cup flaked coconut (optional) ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together cake mix, 1 box pudding mix, eggs, oil, and soda drink. Stir in coconut and nuts if desired. Pour into a greased 9 x 13 inch baking pan.\nBake at 350 degrees F (175 degrees C) for 35 to 40 minutes. Cool.\nBeat 1 box pudding and milk together. Fold in whipped topping. Frost cooled cake. Keep refrigerated.\n",
        "picture_link": "Mg4YgTcGS.738JhKHL4ucm.EKHVbE/C"
    },
    {
        "title": "Old Fashioned Apple Cream Pie",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "4 cups thinly sliced apples ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1/4 cup apricot preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sliced apples in a large bowl and toss with sugar and lemon juice. Melt butter or margarine in a large skillet over medium heat. Add apples to skillet and saute until tender. Allow to cool.\nIn a medium mixing bowl, beat cream cheese until fluffy. Gradually beat in 1 cup milk, pudding mix, and lemon rind. Add remaining 1/2 cup milk, and beat until smooth. Spread mixture into pastry shell. Arrange apples over cream cheese layer.\nIn a small saucepan, heat preserves until runny. Using a pastry brush, lightly coat apples. Refrigerate pie for at least 1 hour before serving.\n",
        "picture_link": "2QlAsK90cvhEWhhABdnCFg4NDUk62ru"
    },
    {
        "title": "Miss Beth's Yoghurt Cake",
        "ingredients": [
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Empty yogurt into mixing bowl. Add flour, sugar, oil, eggs, and yeast (or substitute one teaspoon baking powder) and mix until just combined. Pour into a greased and floured 13 inch round cake pan.\nBake for 25 to 35 minutes in a preheated 350 degrees F (175 degrees C) oven, or until cake is golden brown and middle bounces bake when pushed with your finger. Cool and dust with confectioners' sugar. Variations: use flavored yogurt, or add some fruit preserves to the mix to make a fruity cake, berry flavors work especially well. Variation 2: Use half brown sugar and half granulated sugar, and add 2 teaspoons of cinnamon. Enjoy!\n",
        "picture_link": "8l8wVBUvLUmel40t5B7la.dJoQt/jTy"
    },
    {
        "title": "Yellow Angel Food Cake",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "6 eggs, separated ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whip the egg whites until foamy. Add cream of tartar, and continue beating until stiff. In a separate bowl, beat the egg yolks until lemon coloured.\nBoil the sugar and water until it reaches the thread stage, 230 - 234 degrees F (110 - 112 degrees C). Beat syrup into egg whites. Fold in egg yolks. Fold in flour. Pour batter into an ungreased tube pan.\nBake at 350 degrees F (175 degrees C) for 1 hour. Cool.\n",
        "picture_link": "gz0bRJMUNWb04RjjMYctWet9gG4ttRC"
    },
    {
        "title": "Sherry Bundt Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "3/4 cup cream sherry ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Oil the sides and bottom of a 10 inch Bundt cake pan. In a small bowl, mix cinnamon, sugar and cocoa. \"Flour\" the sides and bottom of the pan with the mixture, tap out the excess back into the cinnamon mixture.\nIn a large bowl, combine the cake mix, eggs, oil, sherry, nutmeg and pudding mix. Beat until well blended. Pour half of the batter into the Bundt pan, sprinkle with half of the cinnamon sugar, cover with the remaining batter and finally, top with remaining cinnamon mixture.\nBake at 350 degrees F (175 degrees C) for 45 minutes, or until toothpick inserted into cake comes out clean. Cool in pan for 10 minutes, then turn out onto a wire rack.\n",
        "picture_link": "XTECgiuUpvrJk4p.hClLgGBwUBShP96"
    },
    {
        "title": "Coconut Frosting and Filling",
        "ingredients": [
            "2 cups sour cream ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sour cream and sugar; mix well. Stir in coconut. Fold in whipped topping. Spread top and sides of two 9-inch cake layers.\n",
        "picture_link": "d/lxKwFFyYwqCRNMdZegLLnh8g1TUDO"
    },
    {
        "title": "Mocha Cake I",
        "ingredients": [
            "1 (18.25 ounce) package dark chocolate cake mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup coffee flavored liqueur ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 (16 ounce) package prepared chocolate frosting ADVERTISEMENT",
            "1 1/2 tablespoons coffee-flavored liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine cake mix, eggs, sour cream, 1 cup coffee liqueur, and vegetable oil. Using an electric mixer, beat at low speed to blend. Increase speed, and beat 3 to 5 minutes. Stir in the chocolate chips. Pour batter into greased and floured 10 inch Bundt pan.\nBake at 350 degrees F (175 degrees C) for 55 to 60 minutes, or until tester inserted in center comes out clean. Cool cake in pan on rack for 30 minutes. Remove from pan, and cool completely.\nMicrowave frosting 15 to 25 seconds, just until soft. Stir with spoon, and add 1 1/2 tablespoons coffee liqueur. Stir well. Drizzle frosting over cooled cake.\n",
        "picture_link": "5YUU/KCA6VEzIq6zKtAXgZLbJkgDDEq"
    },
    {
        "title": "Italian Bread I",
        "ingredients": [
            "1/4 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 clove crushed garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 x 5 loaf pan.\nWhisk together the oil, egg, and buttermilk in a small bowl.\nIn a large bowl, whisk together flour, sugar, baking powder, soda, salt, and dried herbs. Stir in cheese and onions. Pour buttermilk mixture into the flour mixture, and stir to combine. Add garlic and tomatoes until evenly distributed. Spread batter into prepared pan. Smooth top, and tap pan on counter to remove bubbles.\nBake for 60 to 65 minutes, until golden. Cool loaf on wire rack.\n",
        "picture_link": "jLeiMc73UAy8w1v1qMxC56tmS/bzTqm"
    },
    {
        "title": "Welsh Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/2 cup dried currants ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, baking powder, salt and the 1/2 cup sugar in medium bowl until well blended Cut in butter or margarine and shortening with a pastry blender until mixture is crumbly. Toss in currants.\nBeat egg and milk with a fork in a 1-cup measure; add to flour mixture; mix gently with fork, just until blended. Dough should be consistency of pastry dough.\nRoll out dough to 1/4 inch thickness with floured rolling pin on lightly floured pastry cloth or board. Cut with 3 inch floured cookie cutter\nHeat greased griddle or large heavy skillet over moderate heat until few drops of water jump when dropped on surface. Cook cakes, a few at a time, 3 minutes, or until golden brown. Turn with pancake turner and cook another 3 minutes, or until golden brown on second side. Remove to wire rack. Sprinkle with sugar. Let cool completely, then wrap in plastic bags to store. Can also be frozen.\n",
        "picture_link": "SAZurMOReLC90r1aoV5ddcMFcYSTkWK"
    },
    {
        "title": "Pepper Jelly",
        "ingredients": [
            "1 1/2 cups finely chopped green bell pepper ADVERTISEMENT",
            "1 1/2 cups distilled white vinegar ADVERTISEMENT",
            "6 1/2 cups white sugar ADVERTISEMENT",
            "3 ounces liquid pectin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, stainless steel saucepan, combine green pepper, white vinegar, and white sugar. Bring to a boil, and cook for 6 minutes, stirring constantly.\nStir in liquid pectin, and continue to boil for 3 more minutes, stirring constantly. Skim off foam with a metal spoon, and remove pan from heat\nLadle jelly into sterilized jars, leaving a 1/2 inch space at the top. Seal, and process in a boiling-water canner for 5 minutes.\n",
        "picture_link": "slpxoSGbqqUuN4Z4d8ZJIdC2fVfSUOG"
    },
    {
        "title": "Spicy Tex-Mex Salad",
        "ingredients": [
            "1 (15 ounce) can pinto beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar and Monterey cheese blend ADVERTISEMENT",
            "1 (10 ounce) package chopped romaine lettuce ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "1 (16 ounce) bottle Catalina salad dressing ADVERTISEMENT",
            "1 (16 ounce) package corn chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the pinto beans, black beans, cheese, lettuce and tomatoes. Add 3/4 bottle dressing and mix well. Add corn chips before serving.\n",
        "picture_link": ".eCzat5pWUgghco/eh7ozcl3FrsdFci"
    },
    {
        "title": "Pesto Torta (Layered Spread)",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup pesto ADVERTISEMENT",
            "1 (12 ounce) jar roasted red bell peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice each block of cream cheese lengthwise. Line a loaf pan with plastic wrap. Place one strip of cream cheese between two layers of plastic wrap. Flatten the cheese with a rolling pin until it is the same size as the loaf pan's bottom. Place the cream cheese into the loaf pan. Spread pesto (about 1/4 inch thick) over the cream cheese. Repeat this process until all of the pesto and cream cheese has been used. The final layer should be cream cheese. Fold the plastic wrap over the final layer, and refrigerate for at least 3 hours.\nWhen you are ready to serve, gently remove the torta from the loaf pan. Unwrap the plastic wrap. Place drained, roasted red peppers over the top of the torta.\n",
        "picture_link": "o01MNIHXQpIotox2KqDmU6BmeGNfCSy"
    },
    {
        "title": "Three Hundred Chocolate Chip Cookies",
        "ingredients": [
            "12 1/2 cups white sugar ADVERTISEMENT",
            "12 1/2 cups packed brown sugar ADVERTISEMENT",
            "8 1/3 cups butter ADVERTISEMENT",
            "25 eggs ADVERTISEMENT",
            "1/3 cup vanilla extract ADVERTISEMENT",
            "1/4 cup baking soda ADVERTISEMENT",
            "36 1/3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons salt ADVERTISEMENT",
            "9 1/3 pounds semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a very large bowl, cream sugars and butter. Add eggs and vanilla. Combine dry ingredients and add gradually to creamed mixture. Stir in chocolate chips.\nScoop with ice cream scoop onto baking sheets. Flatten balls with wet hands. Bake for 10-12 minutes or until start to brown.\n",
        "picture_link": "X/khabSA9wUK3YOh5yQi96Pf9NaK70G"
    },
    {
        "title": "Candy-Coated Milk Chocolate Pieces Cookies II",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups candy-coated milk chocolate pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCream together butter or margarine, brown sugar, vanilla, and sugar until fluffy. Add 2 beaten eggs.\nCombine flour, baking soda, and salt. Add to cream mixture. Stir in candies.\nDrop by teaspoon on baking sheets about 2 inches apart. Bake for 8 - 10 minutes.\n",
        "picture_link": "FyRO52wU8rFqpJAVABYJzDtUUpz0x2i"
    },
    {
        "title": "Dutch Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 F (175 degrees C).\nCream together the butter, shortening, sugar and vanilla.\nSift together the flour, baking soda and salt. Add to sugar mixture and mix well, being careful not to over mix.\nDrop heaping teaspoonfuls of dough on ungreased cookie sheet and flatten each with the tines of a fork (dip fork into small bowl of water so that dough doesn't stick to fork). Do this once or twice, depending on the size of cookie and fork.\nBake for 13 to 15 minutes. After each pan is removed from oven, carefully place 5 or 6 chocolate chips on top of each cookie while they are still hot. When chocolate is glossy and soft, spread with knife.\n",
        "picture_link": "9C7UVTSBJUmuRS28rKlohyrF7292ujC"
    },
    {
        "title": "Maurice Salad",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "2 teaspoons white wine vinegar ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons onion juice ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons Dijon-style prepared mustard ADVERTISEMENT",
            "1/4 teaspoon mustard powder ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 hard-cooked egg, diced ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "1 pound cooked ham, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 pound turkey breast, cut into strips ADVERTISEMENT",
            "14 ounces Swiss cheese, cut into strips ADVERTISEMENT",
            "1/2 cup sliced sweet gherkin pickles ADVERTISEMENT",
            "1 head iceberg lettuce - rinsed, dried, and shredded ADVERTISEMENT",
            "16 pimento-stuffed green olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the dressing by whisking together the vinegar, lemon juice, onion juice, sugar, Dijon, dry mustard and mayonnaise. Add the parsley and egg; mix well.\nIn a large bowl, combine the ham, turkey, cheese, and pickles. Add the dressing and mix well. Divide the lettuce among plates, top with salad, and garnish each plate with 2 olives.\n",
        "picture_link": "ALCWEV1ia2U2I/Qdhmtf..5/ksmAvSi"
    },
    {
        "title": "Sweet Potatoes",
        "ingredients": [
            "6 large sweet potatoes ADVERTISEMENT",
            "1 (15 ounce) can apricot halves ADVERTISEMENT",
            "4 apple - peeled, cored and sliced ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C)\nIn a large soup pot, boil potatoes until soft. Add sliced apples just 5 minutes before potatoes are done. Remove from heat. Drain.\nIn a large casserole dish, mix potatoes and apples. Dot with butter. Sprinkle brown sugar, walnuts, and raisins on top of potato mixture. Pour apricots over top.\nBake uncovered for 30 minutes.\n",
        "picture_link": "GmBb4QG887yRrbQ6lBrqh0vd62JaE5q"
    },
    {
        "title": "Warm Brussels Sprout, Bacon and Spinach Salad",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "2 cups Brussels sprouts, trimmed and thinly sliced ADVERTISEMENT",
            "1 1/2 teaspoons caraway seed ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "3 tablespoons white wine vinegar ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "1/2 pound spinach - chopped, washed and dried ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Crumble and set aside. In a medium sauce pan, steam Brussels sprouts until tender.\nHeat the remaining fat in the skillet over medium high heat and add the Brussels sprouts and caraway seeds. Stir for 1 to 2 minutes, or until the sprouts are tender.\nRemove the skillet from heat, stir in the oil, vinegar, and sugar. Stir, and add the spinach. Saute the mixture over moderately high heat for 1 minute or until the spinach is wilted. Season salad with pepper and sprinkle with bacon. Serve warm.\n",
        "picture_link": "AAm4bMrAwb1CTy5hX8Kxv4f2wRV3FEe"
    },
    {
        "title": "Chocolate Pie",
        "ingredients": [
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "1 (5 ounce) package non-instant chocolate pudding mix ADVERTISEMENT",
            "2 cups low-fat milk ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1/4 cup chocolate shavings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare pudding according to package directions. Cover pudding with wax paper and allow to cool for 5 minutes.\nPour pudding into pie shell and refrigerate until cool.\nTop with whipped topping before serving. Garnish with chocolate shavings.\n",
        "picture_link": ".LGNNqYHn58FS19Z0jXsl6VXSJNB7ZW"
    },
    {
        "title": "Healthy Honey Carrot Cookies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon lemon extract ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups grated carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter and honey. Add eggs, and beat well. Blend in vanilla, and lemon extracts.\nIn a separate bowl, sift together the flour, baking powder and salt. Gradually add the dry ingredients to creamed mixture, and mix well. Stir in carrots.\nDrop by teaspoon on greased baking sheets. Bake at 375 degrees F (190 degrees C) for 15 minutes and cool on racks.\n",
        "picture_link": "1TMbggILh4uU9IfPLPGzxoqWIrLC3fm"
    },
    {
        "title": "Screaming Potatoes",
        "ingredients": [
            "2 pounds clean, scrubbed new red potatoes ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes in the bottom of a large cast iron skillet. Place about 2 tablespoons of water in the bottom of the pot and sprinkle with the salt. Cover tightly and place over low heat. Cook for 40-50 minutes. Do not lift the lid during this time. Occasionally give the pan a shake.\n",
        "picture_link": "LxTdtoELTLE1aCbvjV3uZXYwEIhyhHu"
    },
    {
        "title": "Forgotten Cookies I",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (170 degrees C).\nBeat egg whites with the salt until foamy. Slowly add sugar, one tablespoonful at a time, beating after each addition until the meringue stands in stiff peaks.\nStir in vanilla and fold in chocolate chips. Drop by teaspoonfuls on a lined baking sheet and place in preheated oven.\nAfter 2 minutes, turn off oven. Leave meringues in oven overnight. Remove from pan and store in cookie tin lined with paper towel.\n",
        "picture_link": "izL9gqq1.V7Vt7XRO2l4uHh9ejqpwhW"
    },
    {
        "title": "Al's Rum Chicken",
        "ingredients": [
            "4 bone-in chicken breast halves, with skin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (20 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "1 cup rum ADVERTISEMENT",
            "1 (10 ounce) jar sweet and sour sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace chicken pieces in a lightly greased 9x13 inch baking dish. Make sure rib area of breasts is facing up. Cover dish and bake in the preheated oven for 15 to 20 minutes.\nRemove cover and flip chicken pieces. Place pineapple (reserve some for garnish) around chicken. Pour rum over all. Cover and bake for another 15 minutes. Garnish with additional pineapple and serve.\n",
        "picture_link": "BboO90LSF2dzfy9lY0akCut8Wso/gaa"
    },
    {
        "title": "Stuffed Turkey Legs",
        "ingredients": [
            "4 turkey legs ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "2 green bell peppers ADVERTISEMENT",
            "1 large white onion ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "5 slices bacon ADVERTISEMENT",
            "2 tablespoons teriyaki sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make numerous vertical slits in the turkey legs.\nIn a small bowl combine the olive oil with the salt, pepper, teriyaki, vinegar and oregano. Marinate turkey legs in the oil mixture.\nCut onion, green pepper and bacon into small squares (approximately the same size as the slits you cut on the legs). Fill each slit with one piece of pepper, onion and bacon.\nAfter the legs are stuffed, brown them in the oil mixture on medium-high. Reduce temperature to low and cover. Cook for 45 minutes or until meat starts to separate from the bone. If the legs dry out when cooking, add a little water to the skillet and lower the temperature.\n",
        "picture_link": "p642iSv63Iqw3RUQHDuuZ59PBD3VYPq"
    },
    {
        "title": "Cherry Shortbread Cookies",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "1/2 cup chopped cherries ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nCream butter and confectioners' sugar together. Add the cornstarch and flour and mix well. Stir in the chopped cherries. Drop teaspoonfuls of the dough onto a cookie sheet then press with tines of a floured fork.\nBake at 300 degrees F (150 degrees C) until lightly golden, about 10 to 15 minutes.\n",
        "picture_link": "FN.WduB8QF8F9sgxwsYgC/W52GUpyqG"
    },
    {
        "title": "Kringla II",
        "ingredients": [
            "1 cup heavy cream ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the heavy cream and sour cream. Cover and refrigerate overnight.\nLet the sour cream mixture come to room temperature. It should take about 30 minutes. Preheat the oven to 475 degrees F (245 degrees C).\nIn a large bowl, mix the sugar, shortening, and egg yolk together using an electric mixer. Stir the vanilla and baking soda into the sour cream mixture. Stir the sour cream mixture into the bowl with the sugar and shortening until well blended. Combine the flour and baking powder; stir into the batter until fully incorporated.\nPlace the dough on a well-floured surface, as the dough will be sticky. Use ping pong ball sized pieces of dough, and roll out into an 8 or 9 inch rope. Form into a 'lazy eight' or 'infinity sign', and pinch the ends together. Place on ungreased cookie sheets.\nBake for 5 minutes in the preheated oven, or until slightly brown. Cool completely before storing in an airtight container. Store at room temperature for up to 5 days, or 1 month in the freezer.\n",
        "picture_link": "yzzGpW9Nq.82XU/Dp1ADOX4oaIox5lu"
    },
    {
        "title": "Chocolate Covered Blueberry Smoothie",
        "ingredients": [
            "1 cup skim milk ADVERTISEMENT",
            "1 cup frozen blueberries ADVERTISEMENT",
            "1 (1 ounce) envelope instant hot chocolate mix ADVERTISEMENT",
            "1 tablespoon chocolate syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the milk, blueberries, hot cocoa mix, and chocolate syrup into the container of a blender. Blend to desired consistency, and pour into a tall glass.\n",
        "picture_link": "nx6J6eTWs2qXJYkL4nCHA45kVHHtaXG"
    },
    {
        "title": "Pumpkin Waffles",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "2 teaspoons canola oil ADVERTISEMENT",
            "1 teaspoon molasses ADVERTISEMENT",
            "1/4 cup canned pumpkin ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "2 tablespoons SPLENDA® No Calorie Sweetener, Granulated ADVERTISEMENT",
            "1 1/2 cups maple syrup sweetened with SPLENDA® Brand Sweetener ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat waffle iron according to manufacturer's directions; spray lightly with vegetable cooking spray.\nCombine flour, baking powder, soda, salt, cinnamon, ginger, and nutmeg in a large bowl. Set aside.\nCombine oil, molasses, pumpkin and buttermilk in a small bowl; set aside.\nWhisk together egg and SPLENDA(R) Granulated Sweetener until blended. Add buttermilk mixture, whisking until blended. Add to dry ingredients, stirring just until moistened.\nPour batter into a hot waffle iron and bake approximately 5 minutes*. Serve with maple syrup.\n",
        "picture_link": "Nkv/8./mExFrMQNe5oRgU6kgEDMuDBa"
    },
    {
        "title": "Macaroni Caesar Salad",
        "ingredients": [
            "1 (8 ounce) package uncooked macaroni ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 (8 ounce) bottle Caesar salad dressing ADVERTISEMENT",
            "3 slices bacon, chopped ADVERTISEMENT",
            "2 cups croutons ADVERTISEMENT",
            "1 head romaine lettuce, torn into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add the macaroni and cook until tender, about 8 minutes. Drain and rinse under cold water to cool.\nAt the same time, Place eggs in a saucepan and fill with enough cold water to cover. Cover with a lid and bring to a boil. Remove from the heat once boiling, and let stand covered for 10 minutes. Drain, cool, peel and chop.\nFry bacon in a skillet over medium heat or cook in the microwave on a paper towel lined plate until crisp. Drain, crumble and set aside.\nIn a large bowl, combine the lettuce and macaroni. Stir in the eggs, bacon, Caesar dressing and croutons. Refrigerate for about 30 minutes before serving.\n",
        "picture_link": "qY/V04qVGPw/OoqFE84WrlXjtA7zfQK"
    },
    {
        "title": "Sassy Spaghetti",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1 (11 ounce) can sweet corn, drained ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 dashes hot sauce ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta, cook for 8 to 10 minutes, until al dente, and drain.\nHeat the oil in a skillet over medium heat. Stir in the onion, beans, and corn. Season with cumin, salt, and pepper, and sprinkle with hot sauce. Cook and stir until onion is tender. Toss with cooked spaghetti and sprinkle with Parmesan cheese to serve.\n",
        "picture_link": "DZbCO7LfArJA2rgNum9LCsrbcB27LOm"
    },
    {
        "title": "Salsa Borracha (Drunk Salsa)",
        "ingredients": [
            "4 fresh tomatoes ADVERTISEMENT",
            "10 fresh jalapeno peppers, halved lengthwise and seeded ADVERTISEMENT",
            "1 (12 fluid ounce) bottle Mexican beer ADVERTISEMENT",
            "1/2 cup water, or as needed ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 slice onion ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomatoes and jalapenos into a saucepan, and pour the beer over them. Add enough water so that the tomatoes and jalapenos are covered. Simmer over medium heat until soft. Remove from heat, and let cool slightly.\nTransfer the tomatoes and jalapenos to a blender, and add the garlic and onion. Pulse until well blended. Add some of the cooking liquid to help with blending if necessary. Taste, and season with salt.\n",
        "picture_link": "4Q/Ort3oyPpPQiYky/zvw6mYTmUkyoC"
    },
    {
        "title": "Peanut Butter Ice Cream",
        "ingredients": [
            "4 cups half-and-half cream ADVERTISEMENT",
            "3 cups non-fat dry milk ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 1/2 cups sugar ADVERTISEMENT",
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "4 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the half-and-half, dry milk, and milk into a large saucepan over low heat. Cook until heated, stirring to dissolve the dry milk. Stir in the peanut butter and sugar until smooth and sugar has dissolved. Remove from heat, and stir in the vanilla. Cool mixture, and refrigerate.\nStir the mixture, or blend in a blender before pouring into an ice cream maker. Freeze according to the manufacturer's instructions.\n",
        "picture_link": "bDJbXFW4NIWTFyFUEw6fY3h5/.PTbFK"
    },
    {
        "title": "Dirty Bedtime Story",
        "ingredients": [
            "1 fluid ounce amaretto liqueur ADVERTISEMENT",
            "1 fluid ounce Irish cream liqueur ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons chocolate syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a tall thin glass, stir together the amaretto, Irish cream and milk. Mix in chocolate syrup, and serve.\n",
        "picture_link": "ukK8Xcp.h6eR5ZLfPSxZhgFJEckkuOK"
    },
    {
        "title": "Bean and Bacon Salad",
        "ingredients": [
            "10 slices bacon ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 (15.25 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "1 1/2 cups shredded cabbage ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/3 cup finely chopped onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 dash ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium heat, cook the bacon until crisp. Drain, cool, and crumble.\nIn a small bowl, whisk together the vinegar, mayonnaise, and sugar.\nIn a large bowl, mix the bacon, kidney beans, cabbage, celery, parsley, and onion. Season with salt and pepper. Pour the vinegar dressing mixture over the salad, and toss to coat. Refrigerate at least 1 hour before serving.\n",
        "picture_link": "kv6IUKB00hut7E.OsknsbnwS0zHzbfe"
    },
    {
        "title": "Warm Apple Pocket",
        "ingredients": [
            "3 sweet apples -- peeled, cored and thinly sliced ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "pinch of salt ADVERTISEMENT",
            "1 teaspoon apple pie spice ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 (15 ounce) package prepared, unbaked pie crust, thawed ADVERTISEMENT",
            "milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a bowl, toss apple slices together with sugar, flour, salt, apple pie spice, and vanilla extract until evenly coated.\nLay pie dough flat on a lightly greased baking sheet. Pile apples on one side of dough, leaving a 1 inch border. Brush border and opposite half side of dough with milk. Fold dough over apples, being careful not to over-stuff or the dough will tear. Fold over edges and pinch together to seal. Cut several small slits in the top of the pocket with a sharp knife, then brush top with beaten egg.\nBake in the preheated oven for 40 minutes, or until flakey and golden brown. Serve warm, or at room temperature.\n",
        "picture_link": "Bp3YmlDXD6TZuiHm7LY5d0OehiPkPAi"
    },
    {
        "title": "Dad's Kickin' Jamaican Wings, Mon",
        "ingredients": [
            "3 tablespoons Jamaican jerk seasoning blend ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "3 cloves garlic, diced ADVERTISEMENT",
            "1 (1 inch) piece peeled fresh ginger, diced ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "12 slices pickled jalapeno peppers ADVERTISEMENT",
            "4 pounds chicken wings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the jerk seasoning, oil, garlic, ginger, green onions, and jalapeno slices in a blender, and blend until thick and smooth. Dunk wings in the mixture, and arrange in single layer on baking sheets. Spread remaining mixture evenly over wings. Cover with aluminum foil, and refrigerate 8 hours, or overnight.\nPreheat oven to 300 degrees F (150 degrees C).\nBake wings 2 hours in the preheated oven.\n",
        "picture_link": "xoVvfgdfIh4gZmubnSNUW6tfRL..7Da"
    },
    {
        "title": "Coronation Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/3 cup sultana raisins ADVERTISEMENT",
            "1 (1 pound) large mango, peeled, thinly sliced ADVERTISEMENT",
            "2/3 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon mild curry powder ADVERTISEMENT",
            "1 tablespoon mango chutney ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "3/4 cup toasted cashews ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, cook chicken in lightly salted boiling water for 20 minutes. Drain, cool, and cut into 1/2-inch strips.\nIn a large bowl, stir together chicken strips, raisins, and half of the mango.\nIn a medium bowl, mix together mayonnaise, curry powder, chutney, and lemon juice. Season with salt and pepper, then toss gently with chicken mixture. Stir in half the nuts. Transfer to a platter, and garnish with remaining mango strips and cashews.\n",
        "picture_link": "Dd47Pp2gJKLWV75.vuGu5F02Gbdifp2"
    },
    {
        "title": "Honey Glazed Stuffed Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 tablespoons Boursin cheese with herbs ADVERTISEMENT",
            "8 slices bacon ADVERTISEMENT",
            "toothpicks ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut a slit in each chicken breast, and stuff with equal amounts Boursin cheese. Wrap each breast with 2 slices bacon. Secure with toothpicks. Arrange on a baking sheet.\nBake 25 minutes in the preheated oven, or until chicken juices run clear. Drizzle breasts with equal amounts of honey during the final 5 minutes of cook time.\n",
        "picture_link": "Kb/1XrCsnJ5bEh32vgFvvrz0mezNqFG"
    },
    {
        "title": "Beef Tenderloin in Creamy Porcini Sauce",
        "ingredients": [
            "1 ounce dried porcini mushrooms ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "6 tablespoons olive oil, divided ADVERTISEMENT",
            "1 small red onion, finely chopped ADVERTISEMENT",
            "1 teaspoon finely minced garlic ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "2 pounds new potatoes ADVERTISEMENT",
            "2 pounds beef tenderloin medallions ADVERTISEMENT",
            "1/2 teaspoon crushed dried thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, soak dried mushrooms in hot water.\nHeat butter and 2 tablespoons olive oil in a skillet over medium heat. Stir in the onion and garlic; cook until the onion is tender and transparent. Stir in beef bouillon cube, and pour in mushrooms with water. Season with salt and pepper. Mix in cream; simmer gently for 5 minutes. Set aside.\nPlace whole potatoes in a pan with water to cover; bring to a boil over high heat, and cook about 5 minutes. Drain water. When potatoes are cool enough to touch, cut them in half. Heat 2 tablespoons olive oil in a skillet over medium heat, and fry potatoes until golden. Season with salt and thyme. Set aside.\nPreheat oven to 400 degrees F (200 degrees C).\nSeason beef medallions with salt and pepper. Heat 2 tablespoons olive oil in a wok or large skillet over high heat. Place medallions in hot oil, and brown on both sides. Remove from heat, and place medallions in the center of a roasting dish.\nCover medallions with porcini sauce. Arrange potatoes around medallions. Cover dish with aluminum foil. Roast for 15 minutes.\n",
        "picture_link": "OGijpUA080XD.ldN1JZIiQ7d2LAxL2q"
    },
    {
        "title": "Fish Sinigang (Tilapia) - Filipino Sour Broth Dish",
        "ingredients": [
            "1/2 pound tilapia fillets, cut into chunks ADVERTISEMENT",
            "1 small head bok choy, chopped ADVERTISEMENT",
            "2 medium tomatoes, cut into chunks ADVERTISEMENT",
            "1 cup thinly sliced daikon radish ADVERTISEMENT",
            "1/4 cup tamarind paste ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 dried red chile peppers (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium pot, combine the tilapia, bok choy, tomatoes and radish. Stir together the tamarind paste and water; pour into the pot. Toss in the chili peppers if using. Bring to a boil, and cook for 5 minutes, or just until the fish is cooked through. Even frozen fish will cook in less than 10 minutes. Do not over cook or else the fish will fall apart. Ladle into bowls to serve.\n",
        "picture_link": "Zbqh52i5u/BbHmQkUu.fZ.yQtmd5mGy"
    },
    {
        "title": "Sweet-and-Sour Coleslaw",
        "ingredients": [
            "4 cups chopped or shredded cabbage ADVERTISEMENT",
            "1 medium red bell pepper, chopped ADVERTISEMENT",
            "1 cup thinly sliced green onions ADVERTISEMENT",
            "1 cup cooked corn kernels ADVERTISEMENT",
            "1/2 cup rice vinegar or other white vinegar ADVERTISEMENT",
            "1/3 cup Splenda no-calorie sweetener (or substitute sugar) ADVERTISEMENT",
            "Salt and pepper, to taste (optional) ADVERTISEMENT",
            "1 tablespoon finely minced jalapeno pepper, seeds and veins removed (optional) ADVERTISEMENT",
            "1/2 cup chopped cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss all ingredients together.\n",
        "picture_link": "95sPaYlbU7KRy07rPLDs02QvbDWFFAa"
    },
    {
        "title": "Ziti and Eggplant",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 eggplant, peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "2 tablespoons minced fresh basil ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 1/4 teaspoons white sugar (optional) ADVERTISEMENT",
            "1 (7 ounce) jar roasted red pepper, drained and cut into strips ADVERTISEMENT",
            "1 (16 ounce) package dry ziti pasta ADVERTISEMENT",
            "3 pita bread rounds ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese or to taste ADVERTISEMENT",
            "sweet paprika to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat, and cook the eggplant about 10 minutes. Stir in the tomatoes, basil, pepper, and sugar. Simmer, stirring occasionally, 45 minutes. Mix the roasted red peppers into the skillet with the eggplant mixture. Continue cooking until eggplant is the consistency of the rest of the sauce.\nBring a large pot of lightly salted water to a boil. Place ziti pasta in the pot, cook 9 to 11 minutes, until al dente, and drain. Serve the eggplant and tomato sauce over the cooked ziti.\nPreheat oven to 375 degrees F (190 degrees C). Open pitas and evenly spread insides with butter. Sprinkle with Parmesan cheese and season with paprika, salt and pepper. I like to make a light sprinkling of paprika across each piece. Heat pitas in the preheated oven until golden brown, about 6 minutes. Use to scoop up eggplant sauce, or eat separately.\n",
        "picture_link": "M5GOewna6LWrelzpH.3qLJjjhONJ4fS"
    },
    {
        "title": "Cheese and Chive Crisps",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "3 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper sauce (such as Frank's Red Hot®) ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the softened butter and cheese until well blended. Stir in flour, chives, salt, hot pepper sauce and garlic powder until thoroughly mixed. Stir in cereal. Divide the mixture into four parts, and roll into 6 inch long logs. Wrap in plastic wrap, and refrigerate until firm, about 1 hour.\nPreheat the oven to 325 degrees F (165 degrees C). Unwrap the cheese logs, and slice into 1/4 inch thick rounds. Place on an ungreased cookie sheet.\nBake for 20 to 25 minutes in the preheated oven, until edges are crisp and slightly browned.\n",
        "picture_link": "DJWco/KbR7VVSLRc67IHYMOnib8FLWy"
    },
    {
        "title": "Tuscan Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, rinsed and drained ADVERTISEMENT",
            "1 (26.5 ounce) can roasted garlic flavored spaghetti sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Coat a 9x13 inch baking dish with nonstick cooking spray.\nPlace the chicken breasts in the baking dish, and sprinkle olives over the top. Pour the beans over the chicken, then pour the spaghetti sauce over everything.\nCover, and bake for 30 minutes in the preheated oven. Remove the cover, and continue baking for 10 minutes, or until chicken is no longer pink inside.\n",
        "picture_link": "NYSXvUwMq97iMR/cDR6Tgd7OiErOsjS"
    },
    {
        "title": "Arkansas Sin",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "4 cups shredded Cheddar cheese ADVERTISEMENT",
            "8 ounces diced cooked ham ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "1 (1 pound) loaf round sourdough bread ADVERTISEMENT",
            "1 cup buttery crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together the cream cheese, Cheddar cheese, ham, onions and jalapeno peppers. Cut a circle out of the top of the bread, and remove the center leaving a 1 inch shell of bread. Fill bread with the cheese mixture.\nBake for 35 to 40 minutes in the preheated oven, until the dip is heated through. Serve with crackers for a wonderful taste experience!\n",
        "picture_link": "CegNttEtrhLP15SmUGsfqu/qti6RkXm"
    },
    {
        "title": "Family Favorite Chicken Lo Mein",
        "ingredients": [
            "1 (16 ounce) package angel hair pasta ADVERTISEMENT",
            "3 tablespoons peanut oil, divided ADVERTISEMENT",
            "4 boneless, skinless chicken breast, cut into 1/2 inch pieces ADVERTISEMENT",
            "2 cups shredded carrots ADVERTISEMENT",
            "2 cups sliced celery ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "3 tablespoons Chinese black bean and garlic sauce ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the angel hair pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink.\nHeat 1 tablespoon of peanut oil in a skillet over medium-high heat, then add chicken breast. Cook and stir chicken until no longer pink inside, about 10 minutes; set aside.\nIn the same skillet, heat the remaining 2 tablespoons of peanut oil over medium-high heat and mix in carrots, celery, and green onion. Cook and stir until tender yet still crisp, 5 to 6 minutes. Mix in Chinese black bean and garlic sauce; cook and stir for another minute. In a separate bowl, mix chicken broth, soy sauce, and cornstarch; add sesame oil. Pour mixture over vegetables and simmer until thickened. Toss in drained pasta, stirring until well-coated and heated through.\n",
        "picture_link": "e9E7kCdOmsbiEZ57NQYbvGZ2BWZxhqK"
    },
    {
        "title": "Turkey Burgers with Brie, Cranberries, and Fresh Rosemary",
        "ingredients": [
            "1 slice white bread, torn into small pieces ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 tablespoons boiling water ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "1/2 medium red onion, chopped ADVERTISEMENT",
            "1/4 cup dried cranberries, chopped ADVERTISEMENT",
            "2 ounces Brie cheese, cubed ADVERTISEMENT",
            "2 tablespoons tomato ketchup ADVERTISEMENT",
            "2 sprigs fresh rosemary, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nCombine the white bread, garlic, and boiling water in a mixing bowl; mash with a fork to combine. Add the turkey, red onion, cranberries, Brie, rosemary, ketchup, salt, and pepper; mix thoroughly with your hands. Shape the mixture into 6 patties.\nCook under the preheated broiler until no longer pink in the center and the juices run clear, about 6 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "t.ZffmssNBxYvjs.09CfYMDCBmA50um"
    },
    {
        "title": "Tuna Italiano",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, sliced ADVERTISEMENT",
            "1 white onion, diced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 (5 ounce) cans tuna in olive oil ADVERTISEMENT",
            "1 (6 ounce) can pitted black olives, drained and chopped ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained and rinsed ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound penne pasta ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, heat olive oil over medium heat. Saute garlic in oil until golden. Stir in onion and water and cook until onion is soft. Stir in the tuna with its oil, olives, beans, garlic salt and pepper. Cover, reduce heat to medium-low, and simmer while pasta is cooking.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Toss pasta with tuna mixture, top with Romano and serve.\n",
        "picture_link": "dIvXj/UjZOSLORBu3l8AYCUZOeYMcLq"
    },
    {
        "title": "French Leek and Ham Shepherd's Pie",
        "ingredients": [
            "2 1/4 pounds potatoes, peeled and cut into chunks ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "salt and pepper, to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 1/2 pounds leeks, sliced ADVERTISEMENT",
            "2 medium tomatoes - peeled, seeded, and coarsely chopped ADVERTISEMENT",
            "1 1/2 pounds cooked ham, thinly sliced ADVERTISEMENT",
            "1 egg yolk, lightly beaten ADVERTISEMENT",
            "1/4 cup shredded mozzarella cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly oil a 2 quart casserole dish.\nBring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop. Stir in the cream, butter, nutmeg, salt, and pepper and mash until smooth.\nHeat the olive oil in a large skillet over medium heat. Cook the onion until translucent. Stir in the leek and cook another minute until the leek is soft, but not brown. Mix in the peeled tomatoes, lower the heat, and simmer five minutes, stirring occasionally until the tomatoes have lost some of their shape. Stir in the ham and season with salt and pepper.\nSpread half of the mashed potatoes on the bottom of the casserole dish. Pour in the ham and leek sauce and cover with the remaining mashed potatoes. Brush the surface of the mashed potatoes with the beaten egg yolk. Sprinkle on the shredded mozzarella. Bake in the preheated oven for 20 minutes, or until golden brown.\n",
        "picture_link": "o1aNiY48ltYdT2g2j/ljaZ/Gp/V8a9y"
    },
    {
        "title": "Spicy Cheese Quick Bread",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup half-and-half cream ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Lightly grease a 9x5 inch loaf pan and set aside.\nMix flour, baking powder, salt, cayenne pepper, garlic powder, onion powder, Italian seasoning, and Cheddar cheese together in a large bowl. Whisk in half-and-half cream, milk, and vegetable just until blended. Pour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "1MN0VZDEsAF7o8LXE0yBwaQpqsB.xMK"
    },
    {
        "title": "Deep Fried Pork Steak",
        "ingredients": [
            "1 quart vegetable oil for deep frying ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "4 tablespoons seasoned salt ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "1 teaspoon coriander ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "4 pounds pork steaks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep fat fryer to 375 degrees F (190 degrees C).\nIn a large resealable plastic bag, combine the flour, garlic powder, seasoned salt, chili powder, cinnamon, coriander, basil, cumin, ground turmeric, paprika, and salt. Place pork steaks in the bag one at a time; seal, and shake to coat.\nOne at a time, place pork steak into hot oil, and cook until it turns deep brown and floats. Remove to paper towels. Repeat process with remaining pork steaks.\n",
        "picture_link": "39yzp/lY8.VDMe0TmduWsfVVIGOfPi."
    }
]