[
    {
        "title": "Brown Rice and Chicken Casserole",
        "ingredients": [
            "2 (10.75 ounce) cans condensed cream of asparagus soup ADVERTISEMENT",
            "10 3/4 fluid ounces milk ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 pound chopped cooked chicken ADVERTISEMENT",
            "1 cup uncooked brown rice ADVERTISEMENT",
            "2 (14.5 ounce) cans French cut green beans ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a medium casserole dish.\nIn a large bowl, mix the soup, milk, water, chicken, rice, green beans, Cheddar cheese, onion, and garlic. Season with parsley, basil, dill, salt, and pepper. Transfer to the prepared casserole dish.\nBake 1 1/2 hours in the preheated oven, until rice is tender. If water is absorbed too quickly, add more as needed.\n",
        "picture_link": "KD/0LZc3gwGhCz8KKo1UCiXxa5nb0LO"
    },
    {
        "title": "Hidden Secret Burgers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon hot pepper sauce (e.g. Tabasco™) ADVERTISEMENT",
            "1 tablespoon dry bread crumbs ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/3 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1/2 fresh red chile pepper, finely chopped ADVERTISEMENT",
            "4 slices pickled jalapeno pepper, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, mix the ground beef, onion, egg, hot pepper sauce, and bread crumbs. Season with paprika, parsley, salt, and pepper. In a separate bowl, mix the cheese, red chile pepper, and jalapeno pepper. Form the beef mixture into 4 balls, and press a well in the center of each. Stuff with equal amounts of the cheese mixture. Press meat around filling to seal. Arrange on a baking sheet, and press gently into thick patties.\nBake 20 minutes in the preheated oven, turning once, until well done.\n",
        "picture_link": "0JmcxQTxit0oFdRWJ/SMPv.cF6X5cdW"
    },
    {
        "title": "Quick Mediterranean Chicken",
        "ingredients": [
            "olive oil as needed ADVERTISEMENT",
            "4 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Greek seasoning to taste ADVERTISEMENT",
            "1 (15 ounce) can green beans, drained ADVERTISEMENT",
            "1 (10 ounce) can black olives, drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1/2 cup Greek-style vinaigrette with feta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat some oil in a saute pan over medium-high heat. Place the frozen chicken breasts in the pan, and season with salt, pepper, and Greek seasoning. Cook until the chicken is lightly browned and has fully cooked. Add the green beans, olives, tomatoes, and vinaigrette. Cover, and simmer for 10 minutes to heat the vegetables.\n",
        "picture_link": "tXihCIik.PET5dQB6D32JzsMEw5jSlS"
    },
    {
        "title": "Forfar Bridies",
        "ingredients": [
            "12 ounces ground lamb ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 tablespoons beef broth ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 recipe pastry for double-crust pie ADVERTISEMENT",
            "1 egg white, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large heavy skillet over medium heat, cook lamb until evenly brown; drain excess fat. Remove from heat, and stir in onion, beef broth and Worcestershire sauce. Season with salt and pepper.\nOn a lightly floured surface, roll pastry out to 1/8 inch thickness. Cut into 6 inch rounds. Place approximately 1/2 cup filling on one half of each. Fold the pastry over the filling, and crimp edges to seal. Brush lightly with beaten egg white, and cut three slits in the top to allow steam to escape. Place on baking sheet.\nBake in preheated oven for 30 to 35 minutes, or until golden brown.\n",
        "picture_link": "2TxzB9NNbJ4KSElkhKQ2BDpzFiR/Jp."
    },
    {
        "title": "Norwegian Potato Klub",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "10 medium potatoes, peeled and shredded ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet over medium-high heat. Remove bacon from the pan, and reserve the grease.\nIn a medium bowl, stir together the flour and baking powder. Stir in potatoes to make a sticky dough.\nBring a large pot of water to a boil, and add 2 teaspoons of salt. Squeeze the potato mixture into 6 or 7 dumplings, or your desired size. Drop carefully into the boiling water. Simmer for 45 to 60 minutes. Remove to a platter with a slotted spoon.\nServe with bacon grease brushed over the top, and crumbled bacon. These may also be sliced and fried the next day for another great meal.\n",
        "picture_link": "eUm16AmDf7zVdFSQj3aJMtinqhvuob2"
    },
    {
        "title": "Pumpkin Apple Cobbler",
        "ingredients": [
            "8 small Granny Smith apples - peeled, cored and sliced ADVERTISEMENT",
            "3/4 cup pumpkin butter ADVERTISEMENT",
            "1/2 (14 ounce) package pumpkin quick bread mix ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "sweetened whipped cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the apples and pumpkin butter. Spread evenly in a 8 or 9 inch square baking dish. Pour the pumpkin bread mix into a bowl, and cut in the butter until the mixture resembles coarse crumbs. Sprinkle over the top of the apples.\nBake for 45 minutes in the preheated oven, or until the apples are tender enough to insert a fork. Serve warm with whipped cream.\n",
        "picture_link": "mVXMEfUTTeL.AGmiML79vRovAllvv9i"
    },
    {
        "title": "Crab & Avocado Salad with Fruit Salsa",
        "ingredients": [
            "1 pound pasteurized crabmeat (preferably lump or back fin), picked over for stray shells ADVERTISEMENT",
            "1 1/2 cups mangoes, peaches or nectarines, diced ADVERTISEMENT",
            "1/4 medium red onion, cut into small dice ADVERTISEMENT",
            "1/4 medium red bell pepper, cored and cut into medium dice ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro or parsley ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "1/2 teaspoon Salt and pepper, to taste ADVERTISEMENT",
            "3 ripe avocados ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently mix all ingredients except avocado in a medium bowl. (Can be covered and refrigerated several hours.)\nWhen ready to serve, halve, pit, peel and slice avocado. Fan half an avocado on each plate and serve crab salad alongside.\n",
        "picture_link": "E5Dtb/9KJcu0yv5mCMos.abxNIoZwai"
    },
    {
        "title": "Sweet Tamarind Chutney",
        "ingredients": [
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon fennel seeds ADVERTISEMENT",
            "1/2 teaspoon asafoetida powder ADVERTISEMENT",
            "1/2 teaspoon garam masala ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 1/8 cups white sugar ADVERTISEMENT",
            "3 tablespoons tamarind paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a saucepan over medium heat. Add the cumin seeds, ginger, cayenne pepper, fennel seeds, asafoetida powder, and garam masala; cook and stir for about 2 minutes to release the flavors.\nStir the water into the pan with the spices along with the sugar and tamarind paste. Bring to a boil, then simmer over low heat until the mixture turns a deep chocolaty brown and is thick enough to coat the back of a metal spoon. This should take 20 to 30 minutes. The sauce will be thin, but it will thicken upon cooling.\n",
        "picture_link": "iXnaq5vs0.j43/rwk4yfeUKfIoeDCJ6"
    },
    {
        "title": "Bierox Casserole",
        "ingredients": [
            "1/2 medium head cabbage, cored and shredded ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove chopped fresh garlic ADVERTISEMENT",
            "1 (10 ounce) can refrigerated crescent roll dough ADVERTISEMENT",
            "1 (1 pound) loaf processed cheese food, cubed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace the cabbage and ground beef into a large skillet over medium heat. Cook, stirring to crumble beef, until evenly browned and cabbage is tender. Drain off excess grease, and stir in the onion, garlic, and processes cheese. Scoop into a 9x13 inch baking dish. Unroll crescent roll dough, and place over the top of the dish. Pinch seams together to cover completely.\nBake for 15 minutes in the preheated oven, or until the top is puffed and browned.\n",
        "picture_link": "aLRFlvDCC.EmD2jqxyr4USQbZbGzCvu"
    },
    {
        "title": "Sweet Garlic Tomato Beef Pasta",
        "ingredients": [
            "1 (16 ounce) package medium seashell pasta ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 (14.5 ounce) cans Italian stewed tomatoes ADVERTISEMENT",
            "3 beef bouillon cubes ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Place pasta in the pot, cook for 8 to 10 minutes, until al dente, and drain.\nIn a large skillet over medium heat, mix the beef, onion, and, garlic, and cook until beef is evenly brown.\nIn a blender or food processor, liquefy the tomatoes. Pour into the skillet with the beef. Mix in beef bouillon, sugar, garlic salt, and pepper. Cover, and simmer 10 minutes, stirring occasionally, until bouillon has dissolved. Stir in the pasta until evenly coated with the sauce to serve.\n",
        "picture_link": "pedjrfuC9qv1WI4R2QgtY31gcexNztC"
    },
    {
        "title": "Upside Down Caramel Apple Pie",
        "ingredients": [
            "1 pastry for a 9 inch double crust pie ADVERTISEMENT",
            "4 Granny Smith apples - peeled, cored and sliced ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1 tablespoon corn syrup ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). On a lightly floured surface, roll out pie crusts, and set aside. In a large bowl, toss apples with lemon juice; set aside.\nCombine 1/4 cup brown sugar, butter and corn syrup; spread in bottom of a 9 inch pie dish (glass or ceramic works best). Sprinkle with chopped pecans. Cover with one pie crust. In a small bowl, mix together 1/2 cup brown sugar, flour, and cinnamon.\nArrange half of the apples in pastry lined plate. Sprinkle with half the brown sugar mixture. Repeat layers. Cover with remaining pie crust, fold top edge under, and crimp. Cut a few slits in the top to vent steam.\nBake in preheated oven for 50 to 60 minutes, or until golden brown. Let stand 5 minutes. Loosen edge of pie, and carefully invert pie onto a serving dish. Serve warm.\n",
        "picture_link": "5INg9FS.e5OucIVuFw0TNzyUvGVaX2a"
    },
    {
        "title": "Two Layer Greek Dip",
        "ingredients": [
            "2 (8 ounce) containers plain yogurt ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (8 ounce) package feta cheese, drained and crumbled ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 English cucumber, peeled and diced ADVERTISEMENT",
            "5 roma (plum) tomatoes, seeded and chopped ADVERTISEMENT",
            "5 green onions, chopped ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "pita bread rounds, cut into triangles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, stir together the yogurt, softened cream cheese, feta cheese, garlic, and salt and pepper to taste; mix until smooth.\nSpread mixture into a shallow serving or baking dish. Cover, and refrigerate for 3 hours, or overnight.\nTo serve, scatter cucumber, tomatoes, green onion, and sliced olives on top, and season with pepper as desired. Spoon onto pita wedges.\n",
        "picture_link": "xJUH2J6xRndGgXYCko.vPDDB02jwTLK"
    },
    {
        "title": "Grilled Portobellos Sauteed in Wine",
        "ingredients": [
            "4 portobello mushroom caps ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 shallot, thinly sliced ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nPlace mushrooms onto the grill, smooth side up. Grill until they start to soften, about 10 minutes. Turn over, and grill on the other side for about 5 minutes.\nMeanwhile, heat olive oil and butter in a large skillet over medium heat. Add the shallot, and fry for a few minutes, stirring frequently.\nRemove mushrooms to a cutting board, and slice. Place into the skillet, and increase the heat to high. Cook for about a minute, then pour in the wine. Continue to cook and stir until the wine is nearly evaporated. Remove from heat, and serve.\n",
        "picture_link": "C/r2Qs6G4paLS.4OfyEEB6gVpRyJquO"
    },
    {
        "title": "Moist, Tender Spice Cake: Gingerbread Variation",
        "ingredients": [
            "2 1/2 cups bleached all-purpose flour ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup unsalted butter, softened until easily spreadable ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "1 cup molasses ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Adjust oven rack to middle position and heat oven to 350 degrees. Grease and lightly flour a metal or disposable foil 9-by-13-inch pan. Whisk dry ingredients and spices in a large bowl. Mix milk, eggs, molasses and vanilla extract in a 2-cup measuring cup.\nBeat softened butter into dry ingredients, first on low, then medium, until mixture forms pebble-sized pieces. Add about 1/3 of the milk mixture and beat on low until smooth. Add remaining milk mixture in two stages; beat on medium speed until batter is just smooth. Add the sugar; beat until just incorporated, about 30 seconds. Pour batter into cake pan.\nBake until a cake tester or toothpick inserted into the cake's center comes out clean, about 40 minutes. Set pan on a wire rack; let cool for 5 minutes. Run a knife around the pan perimeter and turn cake onto rack. Let cool.\n",
        "picture_link": "kvZvsGKZFU35k3bVQ4Rrq5m2Y.haQlm"
    },
    {
        "title": "Texas Christmas Pickles",
        "ingredients": [
            "1 gallon dill pickles ADVERTISEMENT",
            "1 (5 ounce) bottle hot pepper sauce (e.g. Tabasco™) ADVERTISEMENT",
            "5 cloves garlic, chopped ADVERTISEMENT",
            "1 (5 pound) bag of white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain the brine from the pickles and discard. Slice pickles lengthwise, and return them to the jar. Pour in the hot pepper sauce, and add the garlic. Pour in about 1/3 of the sugar. Close the lid tightly. Gently tip the jar back and forth several times to allow everything to mix well. Leave out on the counter at room temperature for about 1 week.\nDuring the week, add more sugar as the sugar in the jar dissolves. Gently tip the jar back and forth to mix. Continue the process throughout the week, until you have used up all of the sugar. When all of the sugar has been absorbed, pickles will be dark green and crispy. Transfer pickles to smaller sterile jars, and divide syrup between jars. Seal with lids and rings. Store in the refrigerator, and consume within one month.\n",
        "picture_link": "SNq7P24Aam6.GSQC0b3A9DF.UCpRKVi"
    },
    {
        "title": "Black Olive Spread",
        "ingredients": [
            "1 (10 ounce) can black olives ADVERTISEMENT",
            "3 tablespoons freshly grated Parmesan cheese ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place olives, Parmesan cheese, and garlic (if using) in a food processor. Add olive oil slowly while running. Process until smooth.\n",
        "picture_link": "C1osyqT9mRKLZjaVAVhvY8WO//35jgu"
    },
    {
        "title": "Portuguese Chourico and Peppers",
        "ingredients": [
            "2 pounds chorizo sausage, casings removed and crumbled ADVERTISEMENT",
            "2 green bell peppers, seeded and chopped ADVERTISEMENT",
            "2 sweet onion, peeled and chopped ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons crushed garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker, combine the sausage, green pepper, onion, tomato paste, wine, water, and crushed garlic. Stir so that everything is evenly distributed. Cover, and set on Low. Cook for 8 hours. Uncover the pot, and cook an additional 2 hours to allow some of the liquid to evaporate. Serve over rice, or with Portuguese rolls.\n",
        "picture_link": "FJ8jQgueH7.c8nyY/E1L.YSHV4DGV86"
    },
    {
        "title": "Pork Scaloppini with Mustard Creme",
        "ingredients": [
            "1/2 pound pork tenderloin, cut into 1/4-inch-thick slices ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/3 cup dry vermouth ADVERTISEMENT",
            "1/3 cup chicken broth ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon honey mustard ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dredge the pork tenderloin slices in the flour, and shake off the excess. Melt butter in a large skillet over medium-high heat. Cook the tenderloin in the hot butter until golden brown on both sides and no longer pink in the center, about 5 minutes. Remove to a platter and keep warm.\nPour the vermouth into the skillet, and bring to a simmer; cook for 1 minute. Add the chicken broth and lime juice. Cook and stir until reduced by about half. Stir in the cream, yellow mustard, honey mustard, and allspice. Pour the sauce over the pork to serve.\n",
        "picture_link": "5plaScFiS8mipDKXO.HPHwCQ.CpfF7G"
    },
    {
        "title": "Best Ever Pinto Beans",
        "ingredients": [
            "1 pound dried pinto beans ADVERTISEMENT",
            "6 cups water, or more as needed to cover ADVERTISEMENT",
            "1 smoked ham hock ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 (6.5 ounce) can tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover pinto beans with water in a large bowl. Soak beans for 4 hours, changing water every 30 to 45 minutes. Drain.\nBring 6 cups water to a boil in a large pot. Add pinto beans, ham hock, and kosher salt to the pot. Pour in more water if needed to cover ingredients by at least 1 inch.\nReduce heat to medium-low and simmer until beans are just tender, 2 to 3 hours.\nRemove ham hock from beans; cut meat from the bone, chop the ham, and return to pot.\nStir tomato sauce and brown sugar into the beans. Continue to simmer until beans are tender and flavors are blended, about 1 more hour.\n",
        "picture_link": "oRstDHE9JajkAfo9Mmuahu1c.7Y2SX."
    },
    {
        "title": "Snow Grapes",
        "ingredients": [
            "4 pounds seedless grapes ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove grapes from stems, rinse, and set aside to dry. Mix together the sour cream, cream cheese, white sugar, and vanilla in a large bowl. Fold in grapes until evenly coated. Chill overnight before serving.\n",
        "picture_link": "sR48CRfyJ1GLfcuYmeQG4iU0HYHJtpO"
    },
    {
        "title": "D's Taco Pizza",
        "ingredients": [
            "1/2 pound ground beef ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1/2 (1 ounce) packet taco seasoning mix ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with garlic and onion ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 cup refried beans ADVERTISEMENT",
            "1 12-inch prepared pizza crust ADVERTISEMENT",
            "1 1/2 cups Mexican-style shredded four-cheese blend ADVERTISEMENT",
            "2 cups shredded lettuce ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "1/2 cup Mexican-style shredded four-cheese blend ADVERTISEMENT",
            "1 cup sour cream, or as desired (optional) ADVERTISEMENT",
            "1 cup salsa, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir the ground beef, onion, and garlic together in a large skillet over medium-high heat until the beef is completely browned; drain fat from the skillet.\nStir the taco seasoning mix and water into the beef mixture; bring to a boil, reduce heat to medium-low, and cook at a simmer, stirring occasionally, for 5 minutes.\nPreheat an oven to 350 degrees F (175 degrees C).\nPlace the prepared pizza curst on a baking sheet.\nBlend the diced tomatoes with garlic and onion, salsa, and cilantro in a blender until smooth.\nSpread the refried beans in an even layer on the prepared pizza crust, leaving a border of about 1/2-inch uncovered around the outside.\nSpread about 1 cup of the diced tomato mixture over the refried beans in an even layer; reserve the remaining sauce.\nScatter the ground beef mixture over the layer of sauce.\nCover the beef with 1 1/2 cups Mexican-style shredded cheese blend.\nBake in the preheated oven until the cheese is bubbly and the edges of the crust are golden brown, 15 to 20 minutes; set aside to cool 5 minutes.\nTop the pizza with shredded lettuce, chopped tomatoes, black olives, green onions, and 1/2 cup Mexican-style shredded cheese blend. Serve with the reserved sauce, sour cream, and 1 cup salsa.\n",
        "picture_link": "YpgK8Afc.gmDNL4YsqNwt/kMxuOe2V."
    },
    {
        "title": "Peanut Butter Chocolate Cookies",
        "ingredients": [
            "1 cup Ghirardelli Semi-Sweet Chocolate Chips ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup creamy peanut butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "1 cup unsifted flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt (optional) ADVERTISEMENT",
            "3/4 cup dry-roasted, unsalted peanuts, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F. In a large mixing bowl, cream the butter, peanut butter, brown sugar, and sugar until well blended. Beat in the egg, milk, and vanilla. In a separate bowl, combine the flour, baking powder, and salt. Gradually add the dry ingredients to the creamed mixture. Stir in the chocolate chips and peanuts. Chill the dough in the refrigerator for 15 minutes. Drop heaping tablespoons of dough onto an ungreased cookie sheet.\nBake 12 to 14 minutes, or until the edges are golden brown. Cool 1 minute on cookie sheet, then transfer to wire cooling racks. Store tightly covered.\n",
        "picture_link": "l76wgUc0KiViuRrcX35kKdtDl/bPFni"
    },
    {
        "title": "Chef John's Homemade Chicken Stock",
        "ingredients": [
            "3 pounds chicken necks and backs ADVERTISEMENT",
            "1 large onion, skin on, sliced into 6 segments ADVERTISEMENT",
            "2 carrots, cut into chunks ADVERTISEMENT",
            "1 stalk celery, cut into chunks ADVERTISEMENT",
            "2 cloves garlic, peeled ADVERTISEMENT",
            "4 sprigs chopped fresh thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "3 quarts cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken, onion, carrots, celery, garlic, thyme, and bay leaf in a large stockpot; pour water into pot. Bring to a gentle simmer over medium-low heat, being careful not to let the mixture come to a boil. Once simmering, skim off any foam or impurities that accumulate on the surface of the water and reduce the heat to low.\nGently simmer the mixture on low for 12 hours, skimming off any foam as needed.\nRemove stockpot from heat and let cool for 1 hour.\nPour stock through a fine strainer and transfer to food-safe containers.\n",
        "picture_link": "5Aw5qHbpPxRkAfCRLGZj1AzdsnPHqie"
    },
    {
        "title": "Mini Pumpkin Pies",
        "ingredients": [
            "2 prepared pie crusts ADVERTISEMENT",
            "3 eggs, divided ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup canned pumpkin ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRoll each pie crust out onto a floured surface to a rough rectangle about 11 inches square. Cut each pie crust into 12 3-inch rounds. Fit the little pie crust circles into 24 mini pie dishes.\nSeparate one egg, and place the egg white into a small bowl. Beat the egg white until slightly frothy, and brush the edges of each mini pie crust with egg white. Place the remaining yolk into a bowl, and beat with remaining 2 eggs. Mix the softened cream cheese, sugar, pumpkin, vanilla extract, and pumpkin pie spice into the eggs to make a smooth filling. Spoon about 2 tablespoons of the filling into each crust.\nBake the pies in the preheated oven until the crust edges are golden brown and the filling is set, about 15 minutes. Allow to cool before eating.\n",
        "picture_link": "C0JWcYuNYDtAV2KgcAY0AefGs4.yhSy"
    },
    {
        "title": "Pepperoni Pizza Casserole  ",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (8 ounce) package uncooked egg noodles ADVERTISEMENT",
            "1 (16 ounce) jar spaghetti sauce, or as needed ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 (2.5 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1 (8 ounce) package sliced pepperoni, coarsely chopped ADVERTISEMENT",
            "20 ounces shredded mozzarella cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCook the ground beef in a skillet over medium heat until no longer pink, breaking the meat apart into crumbles as it cooks, about 10 minutes.\nBring a large pot of lightly salted water to a rolling boil. Cook the egg noodles in the boiling water until cooked through yet slightly firm, about 5 minutes; drain.\nMix the noodles with the spaghetti sauce, black olives, mushrooms, pepperoni, and half the mozzarella cheese in a large mixing bowl; spoon the mixture into a 9x13-inch baking dish and top with remaining half of the mozzarella cheese. Cover the dish with foil.\nBake in the preheated oven until the casserole is bubbling, 30 to 45 minutes.\n",
        "picture_link": "h8WH3ITJ49yObm0AUOmG/YW6lkqufMi"
    },
    {
        "title": "Swabian Meatballs (Fleischkuechle)",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "2 hard rolls, day-old ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1/2 pound ground pork ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "4 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the milk into a bowl; soak the rolls in the milk for about 15 minutes.\nPlace the milk-soaked rolls, beef, pork, eggs, onion, parsley, marjoram, garlic, salt, and pepper in a large bowl; mix with your hands until evenly combined. Divide the mixture into eight portions and roll them into balls. Flatten the balls to make 1-inch thick patties.\nMelt the butter in a large skillet. Fry each patty in the melted butter until meat has reached an internal temperature of 160 degrees F (72 degrees C), about 6 minutes each side. These can be served either hot or cold.\n",
        "picture_link": "Cv3EtCEn9QWkHYIBk0eTm.ThLZATmsW"
    },
    {
        "title": "Instant Potato Pancakes",
        "ingredients": [
            "1 cup cold water ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup dry potato flakes ADVERTISEMENT",
            "1 tablespoon chopped chives ADVERTISEMENT",
            "1 pinch freshly ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 cup sour cream for garnish ADVERTISEMENT",
            "1 tablespoon chopped chives, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together water, egg and salt in a large bowl until salt has dissolved. Stir in dry potato flakes until incorporated. Stir in 1 tablespoon of chopped chives; season with black pepper and cayenne pepper.\nHeat oil and butter in a large skillet over medium-high heat. Swirl the pan to combine.\nDivide potato mixture into four equal portions and shape into pancakes. Place the pancakes in the pan and reduce heat to medium. Cook until a well-browned crust has formed onto the bottom of the pancakes, about 10 minutes. Flip each pancake and flatten slightly. Cook until other sides are browned, 7 to 8 more minutes.\nTransfer to plate; top each pancake with a dollop of sour cream and sprinkle each with 3/4 teaspoon chives.\n",
        "picture_link": "sidQP6Hkaa62wKmMYvXhLfjIxaWWp/K"
    },
    {
        "title": "Zimbabwean Chicken and Vegetable Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "4 cups vegetable stock, divided ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "2 cups canned diced tomatoes, with juices ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes, or more to taste ADVERTISEMENT",
            "1 cup finely chopped cabbage ADVERTISEMENT",
            "1 cup chopped sweet potato ADVERTISEMENT",
            "1 cup peeled and chopped carrot ADVERTISEMENT",
            "1 cup peeled and chopped turnip ADVERTISEMENT",
            "1 cup chopped okra ADVERTISEMENT",
            "1 cup chopped cooked chicken, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil over medium heat in a large soup pot; cook and stir the onion in the hot oil until translucent, about 5 minutes. Whisk 1/2 cup of vegetable stock and the peanut butter into the onions until the mixture is smooth. Beat in remaining vegetable stock, diced tomatoes with their liquid, and crushed red pepper flakes; bring to a boil, reduce heat to medium low, and cook at a simmer for 30 minutes, stirring occasionally.\nStir in the cabbage, sweet potato, carrot, and turnip; simmer, stirring occasionally, until the vegetables are tender, about 30 more minutes. Stir in the okra and chicken and simmer until the okra is tender, about 30 additional minutes.\n",
        "picture_link": "n.WGhlVfcFhJkXu/KgcbxPNXwfpwafC"
    },
    {
        "title": "Miso Maple-Glazed Salmon",
        "ingredients": [
            "1 1/2 tablespoons yellow miso paste ADVERTISEMENT",
            "1 1/2 tablespoons seasoned rice vinegar ADVERTISEMENT",
            "1 1/2 tablespoons maple syrup ADVERTISEMENT",
            "1 teaspoon hot chili sauce (such as Sriracha®) (optional) ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "2 (6 ounce) center-cut salmon fillets, with skin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place oven rack about 6 inches from the heat source and preheat the oven's broiler.\nWhisk together miso paste, seasoned rice vinegar, maple syrup, and hot chili sauce in a bowl.\nBrush an oven-ready skillet with vegetable oil.\nPlace salmon fillets skin sides down in the cold skillet. Place over medium heat and cook until the skin starts to sizzle, 2 to 3 minutes. Remove pan from heat.\nBrush each salmon fillet with miso glaze. Place skillet under the preheated broiler and cook until the salmon is just cooked through and the top is browned, about 8 minutes.\nRemove each fillet from the pan, separating flesh from the skin; leave the skin in the pan.\n",
        "picture_link": "C7WXARLiuJYVw51RFZJePiDNoVnABCO"
    },
    {
        "title": "Chicken Mango Salsa Salad with Chipotle Lime Vinaigrette",
        "ingredients": [
            "1 mango - peeled, seeded and diced ADVERTISEMENT",
            "2 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped - or to taste ADVERTISEMENT",
            "1/4 cup cilantro leaves, chopped ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground chipotle chile powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 (10 ounce) bag baby spinach leaves ADVERTISEMENT",
            "1 cup broccoli coleslaw mix ADVERTISEMENT",
            "1 cup diced cooked chicken ADVERTISEMENT",
            "3 tablespoons diced red bell pepper ADVERTISEMENT",
            "3 tablespoons diced green bell pepper ADVERTISEMENT",
            "2 tablespoons diced yellow bell pepper ADVERTISEMENT",
            "2 tablespoons dried cranberries ADVERTISEMENT",
            "2 tablespoons chopped pecans ADVERTISEMENT",
            "2 tablespoons crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mango, tomatoes, onion, jalapeno pepper, cilantro, and juice of 1 lime in a large bowl; set aside.\nWhisk olive oil, 1/4 cup lime juice, sugar, chipotle chile powder, cumin, and garlic powder together in a bowl; set aside.\nToss spinach leaves, broccoli coleslaw mix, chicken, red, green, and yellow bell peppers, cranberries, and pecans together in a large bowl.\nSpread mango salsa and blue cheese on top.\nDrizzle lime dressing over salad and toss before serving.\n",
        "picture_link": "m8b0ZvigEMrf56eazCBv0ZcB99AirlC"
    },
    {
        "title": "Caribbean Banana Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "3 medium bananas ADVERTISEMENT",
            "1 tablespoon rum extract ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1/2 cup chopped dried pineapple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Prepare 12 muffin cups with paper liners.\nSift the flour, baking soda, baking powder, and salt into a bowl; set aside. In a large bowl, cream together butter and sugar until light and fluffy. Beat in the eggs one at a time, mixing well after each addition, then beat in the bananas and rum extract. Stir in the flour mixture. Fold in the shredded coconut and pineapple; mixing just enough to evenly distribute. Evenly divide the batter among the prepared muffin cups.\nBake in preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes.\n",
        "picture_link": "xYWoCheOF7JB66XDDD7RYtwUsODmSHm"
    },
    {
        "title": "Falafels with Yogurt-Dill Sauce",
        "ingredients": [
            "1 (15 ounce) can chickpeas (garbanzo beans), drained and mashed with fork ADVERTISEMENT",
            "3/4 cup panko bread crumbs ADVERTISEMENT",
            "1 small unpeeled red potato, shredded ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup panko bread crumbs ADVERTISEMENT",
            "1 cup canola oil for frying ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1/3 cup finely chopped fresh dill ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chickpeas, 3/4 cup panko bread crumbs, red potato, red onion, garlic, egg, 1 tablespoon olive oil, cilantro, 1 teaspoon lemon juice, cumin, salt, and black pepper in a large bowl.\nForm mixture into 2-inch patties. Place 1/4 cup panko crumbs in a shallow bowl. Gently press patties into the crumbs to coat.\nHeat canola oil in a large skillet over medium-high heat.\nFry patties in the hot oil until golden brown, about 4 minutes per side. Set patties aside.\nStir yogurt, dill, lemon juice, garlic salt, and white pepper together in a bowl. Serve sauce drizzled over falafels.\n",
        "picture_link": "vypME4L3Xp6qiNy0Q9nbBd/FRxZ2.6m"
    },
    {
        "title": "Foiled BBQ Chicken with Corn on the Cob and Pinto Beans",
        "ingredients": [
            "chicken drumsticks ADVERTISEMENT",
            "4 small ears corn ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "1 (15 ounce) can pinto beans, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nLightly grease 4 large sheets of aluminum foil, about 12x18 inches.\nArrange 2 chicken drumsticks and an ear of corn in the center of each sheet of foil. Season with salt and black pepper.\nDrizzle corn with melted butter.\nSpoon barbeque sauce over chicken.\nDivide pinto beans evenly over each portion.\nFold the foil around the chicken and corn and loosely seal the edges. Transfer foil packets to a baking dish.\nBake chicken until no longer pink at the bone and the juices run clear, about 40 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "iNsrV6dw/UK/Gq/18CgMLuupt/LJ59K"
    },
    {
        "title": "Bread Machine Honey-Oat-Wheat Bread ",
        "ingredients": [
            "2 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "3 tablespoons powdered milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the yeast, sugar, and water in the pan of a bread machine. Allow yeast to dissolve and foam, about 10 minutes. Meanwhile, mix the all-purpose flour, whole wheat flour, rolled oats, powdered milk, and salt in a bowl; set aside. Add the honey, vegetable oil, and butter to the yeast mixture, and pour the flour mixture on top.\nSelect the Dough cycle; press start. Allow the bread machine to complete the cycle, about 1 1/2 hours, then transfer the dough to a 9x5-inch loaf pan sprayed with cooking spray. Allow the bread to rise for 1 hour in a warm place.\nPreheat oven to 375 degrees F (190 degrees C).\nBake in the preheated oven until the top is golden brown, about 35 minutes.\n",
        "picture_link": "5KQo4wGyNTH8CP3Uqft/mCK10jdTScK"
    },
    {
        "title": "Chef John's Quick Cassoulet",
        "ingredients": [
            "4 ounces bacon, cut into 1 inch pieces ADVERTISEMENT",
            "8 ounces smoked sausage, sliced ADVERTISEMENT",
            "12 ounces boneless, skinless chicken thighs, cubed ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups chicken broth, plus more if needed ADVERTISEMENT",
            "2 (15 ounce) cans cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 1/2 teaspoons minced fresh rosemary ADVERTISEMENT",
            "1 1/2 teaspoons minced fresh thyme ADVERTISEMENT",
            "cayenne pepper to taste ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1/2 cup finely grated Parmigiano-Reggiano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add bacon to a large, cold oven-ready skillet. Place over medium heat and cook for 10-12 minutes, until almost crisp. Transfer to a bowl, reserving the grease in the pan.\nStir in sausage slices; cook 3-4 minutes. Add chicken thigh pieces; cook and stir for 5 minutes, until browned. Remove meat to the plate with bacon. Discard all the oil, but don't wipe out the pan.\nAdd chopped onion and turn the heat to medium-low; cook and stir for 5 minutes, until the onions are translucent. Add 1 cup of chicken stock.\nMash about 1/4 of the beans in a small bowl, stir all the beans into the pan.\nStir in cayenne, rosemary and thyme. Add reserved meat back to the pan. Stir in remaining cup of stock or more if needed to cover. Return to simmer.\nMix bread crumbs, Parmigiano-Reggiano and melted butter together in a small bowl.\nPreheat the oven's broiler and set the oven rack about 7 inches from the heat source.\nSprinkle the cassoulet with half the bread crumb mixture. Place under the broiler and cook about 5 minutes, until browned.\nRemove the pan and push bread crumbs down into the cassoulet. Top with remaining bread crumb mixture. Return to oven and continue broiling 5 more minutes, until browned.\nTurn off the broiler and leave in the oven for 15 minutes. Remove and let sit for 5 minutes. Enjoy.\n",
        "picture_link": "UqPRDdazUjZFiLRdtlt69QAmUuDwVfe"
    },
    {
        "title": "Manda's Seven Layer Taco Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese at room temperature ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (1 ounce) packet dry taco seasoning mix ADVERTISEMENT",
            "1 pint cherry tomatoes, halved ADVERTISEMENT",
            "2 avocados - peeled, pitted, and diced ADVERTISEMENT",
            "1/4 cup red onion, minced ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 (15 ounce) can refried black beans ADVERTISEMENT",
            "1 1/4 cups salsa ADVERTISEMENT",
            "1 (8 ounce) package shredded Mexican blend cheese ADVERTISEMENT",
            "1 1/2 cups shredded iceberg lettuce ADVERTISEMENT",
            "1/3 cup pickled jalapeno pepper slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "With a handheld or standing mixer, beat together cream cheese, sour cream, and taco seasoning in bowl until light and fluffy; set aside.\nIn a separate bowl, stir together the cherry tomatoes, avocados, red onion, lime juice, salt, and black pepper; set aside.\nSpread the refried black beans out into the bottom of a 9x13-inch glass baking dish in an even layer. Spread the cream cheese mixture over the black beans; top with layers of salsa, Mexican cheese blend, lettuce, cherry tomato mixture, and jalapeno slices.\nCover the dish tightly with plastic wrap and refrigerate until serving time. Serve cold or at room temperature.\n",
        "picture_link": "/iRk.OmmZ1SqeYUwjD6U6T.RfDFLdDm"
    },
    {
        "title": "Tomato Sausage Tart",
        "ingredients": [
            "1 (9 inch) refrigerated pie crust ADVERTISEMENT",
            "1/2 pound bulk Italian sausage ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup light cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "2 pounds tomatoes, sliced ADVERTISEMENT",
            "1 teaspoon dried oregano, or to taste ADVERTISEMENT",
            "1 teaspoon dried basil, or to taste ADVERTISEMENT",
            "2 cups chopped fresh basil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Press the pie crust into the bottom and up the sides of a pie plate.\nCook the sausage in a skillet over medium heat. Add onion and garlic, and cook stirring occasionally until sausage is browned, and onions are translucent. Drain and set aside. In a small bowl, mix together the mustard, 1 egg and light cream until well blended. Stir into the sausage mixture.\nSprinkle 1 cup of the mozzarella cheese over the bottom of the pie crust. Place the sausage mixture over the cheese. Arrange tomato slices over the sausage layer, then top with the remaining cheese. Sprinkle dried basil and oregano over the cheese.\nBake for 35 to 40 minutes in the preheated oven, until heated through and bubbly. Let stand for 20 minutes before slicing. Serve with Basil Mayonnaise.\nTo make Basil Mayonnaise, combine the fresh basil, 1 egg, and lemon juice in a blender or food processor. Blend to mix, then gradually drizzle in oil while blending. Season with salt and pepper to taste.\n",
        "picture_link": "pkFDtTIeN67XeGD.nxDzB1414BdbILa"
    },
    {
        "title": "Lemongrass and Citrus Poached Salmon",
        "ingredients": [
            "2 1/2 pounds salmon fillet ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "1 quart orange juice ADVERTISEMENT",
            "2 cups white wine ADVERTISEMENT",
            "1 small yellow onion, chopped ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 cups chopped lemon grass ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove skin from salmon, then cut into desired portions.\nIn a large pot, combine chicken stock, orange juice, white wine, onion, garlic and lemon grass. Season with salt and white pepper. Bring to a boil for 5 minutes. Reduce heat to a low boil. Place the salmon in the poaching liquid until flaky and tender, about 5 minutes.\n",
        "picture_link": "cwPgNFmYrgWDLPOjPoex1M8bn/9e5Hm"
    },
    {
        "title": "Baklava II",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "1/4 lemon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 pounds chopped almonds ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 1/2 cups unsalted butter, melted ADVERTISEMENT",
            "1 (16 ounce) package frozen phyllo pastry, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a saucepan over medium heat, combine 2 cups sugar, water, honey, cinnamon stick, lemon and vanilla. Bring to a boil, then simmer for 15 minutes, skimming any foam that is formed. Set side.\nIn a small bowl, combine chopped almonds, 2 tablespoons sugar, ground cinnamon and cloves; set aside. Brush butter on bottom of a 9x13 inch pan. Each sheet of phyllo dough is twice as big as the pan, so cut each in half, making 2 sheets. Place a sheet of phyllo on bottom of pan, and brush with melted butter. Repeat process for a total of 8 sheets, buttering each. Sprinkle about 1/4 to 1/3 cup of nut mixture evenly over the phyllo, and cover with 4 more sheets, buttering each. Continue sprinkling nuts after every 4 sheets of phyllo, until all but 8 sheets (4 full sheets) are used.\nUse remaining 8 sheets for the top layer, buttering each sheet of phyllo. Before buttering the last sheet, tuck in any loose edges. Press down layers with palms of your hands. Pour remaining butter over the top. With a large knife, cut 5 strips lengthwise about 1/2 inch deep, then cut diagonally to form diamond shapes.\nBake in preheated oven for 50 to 60 minutes, or until golden brown. Remove from oven, and immediately pour syrup over baklava. Allow to cool thoroughly. Cut diamonds to go all the way through, and serve.\n",
        "picture_link": "//gcAK.XnXaDluC4vreKQnipSp/ulfa"
    },
    {
        "title": "Mediterranean Chickpea Salad I",
        "ingredients": [
            "1 (15 ounce) can garbanzo beans (chickpeas), drained and rinsed ADVERTISEMENT",
            "1/2 cup oil-packed sun-dried tomatoes, drained and cut into strips ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the garbanzo beans, sun-dried tomatoes, feta cheese, onion, garlic, and cilantro. In a separate bowl, whisk together the olive oil, lemon juice, and salt, and pour over the salad. Refrigerate at least 3 hours before serving.\n",
        "picture_link": "sJu5QfWR/SSuAlH9/FKQiYKwaBTBD7C"
    },
    {
        "title": "Cheese and Pasta in a Pot",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (14 ounce) can stewed tomatoes, undrained ADVERTISEMENT",
            "1 (16 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1 (12 ounce) can mushroom stems and pieces, undrained ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 pound Colby-Monterey Jack cheese, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nPlace ground beef in a large, deep skillet. Cook over medium high heat until evenly brown and crumbled. Drain, excess fat, and set aside.\nHeat oil in a large heavy skillet over medium heat. Saute onion until soft and translucent. Stir in garlic, and cook for 30 seconds. Add cooked beef, tomatoes, spaghetti sauce and mushrooms; bring to a boil. Reduce heat, and simmer 20 minutes.\nIn a 9x13 inch casserole dish, layer 1/2 of the pasta, 1/2 of the meat sauce, 1/2 of the sour cream and 1/2 of the shredded cheese. Repeat layers.\nCover, and bake in preheated oven for 45 minutes.\n",
        "picture_link": "QkBqcvK0Gvy2hest9UY8wyA8Jyc/N5."
    },
    {
        "title": "Homemade Root Beer",
        "ingredients": [
            "6 cups white sugar ADVERTISEMENT",
            "3 1/3 gallons cold water ADVERTISEMENT",
            "1 (2 ounce) bottle root beer extract ADVERTISEMENT",
            "4 pounds dry ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large cooler, mix together the sugar and water, stirring to dissolve sugar completely. Stir in the root beer extract. Carefully place the dry ice into the cooler, and cover loosely with the lid. Do not secure the lid, as pressure may build up.\nLet the mixture brew for about an hour before serving. Leftover root beer can be stored in one gallon milk jugs.\n",
        "picture_link": "9s/hHhzC44AuCbGNssBVAw3HD9GlZJC"
    },
    {
        "title": "Chalau",
        "ingredients": [
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 pounds cubed lamb stew meat ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "3 cups chopped fresh spinach ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/4 cup cooking oil ADVERTISEMENT",
            "3 cups uncooked basmati rice ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/2 cup of oil in a large heavy skillet over medium-low heat. Add onion, and fry gently until transparent. Increase heat to medium, and add garlic and stew meat. Cook, stirring frequently, until meat is browned on the outside. Pour in the water, and season with salt, pepper, cayenne pepper and cumin. Bring to a simmer, and reduce heat to low. Cover the pan, and continue cooking for 1 1/2 to 2 hours.\nHeat 1/4 cup of oil in a large saucepan over medium-high heat. Add rice, and cook, stirring frequently for 5 minutes. Add 6 cups water, and bring to a boil. Reduce heat to low, and cook loosely covered for about 30 minutes, or until rice is tender.\nAdd spinach and cilantro to the meat mixture, and cook for another 10 to 15 minutes. Mound the rice on a platter, and spoon some of the lamb stew over. Put remaining stew in a separate serving bowl.\n",
        "picture_link": "KX8AYDWR9GV0zsVLxlfN9HHSdFF8Fgq"
    },
    {
        "title": "Beans-n-Franks",
        "ingredients": [
            "2 teaspoons margarine ADVERTISEMENT",
            "3 tablespoons chopped onion ADVERTISEMENT",
            "1 (16 ounce) can baked beans with pork ADVERTISEMENT",
            "1 (16 ounce) package frankfurters, sliced ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nMelt butter in a skillet over medium heat. Saute onions in butter until tender. Stir in the baked beans and sliced frankfurters. Season with brown sugar, mustard and celery salt. Transfer to a 2 quart casserole dish.\nBake for 40 minutes, stirring occasionally.\n",
        "picture_link": "mIyaD.hRb9N67cgewEr8s0JeeQl3yca"
    },
    {
        "title": "Mint Jelly",
        "ingredients": [
            "1 1/2 cups packed fresh mint leaves and stems ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 1/4 cups boiling water ADVERTISEMENT",
            "1 drop green food color ADVERTISEMENT",
            "3 1/2 cups white sugar ADVERTISEMENT",
            "1/2 (6 fluid ounce) container liquid pectin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse off the mint leaves, and place them into a large saucepan. Crush with a potato masher or the bottom of a jar or glass. Add water, and bring the mint to a boil. Remove from heat, cover, and let stand for 10 minutes. Strain, and measure out 1 2/3 cups of the mint.\nPlace 1 2/3 cups mint into a saucepan. Stir in the lemon juice and food coloring. Mix in the sugar, and place the pan over high heat. Bring to a boil, stirring constantly. Once the mixture is boiling, stir in the pectin. Boil the mixture for a full minute while stirring constantly. Remove from heat, and skim foam off the top using a large metal spoon. Transfer the mixture to hot sterile jars, and seal.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.\n",
        "picture_link": "UytC./17HgxRMeus6QLBXA73bfux3ZS"
    },
    {
        "title": "Lahmahjoon (Armenian Pizza)",
        "ingredients": [
            "1 pound lean ground lamb ADVERTISEMENT",
            "1 1/2 cups finely chopped onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/2 cup chopped fresh Italian parsley ADVERTISEMENT",
            "1 teaspoon chopped fresh basil ADVERTISEMENT",
            "1 tablespoon chopped fresh mint leaves ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "4 pita breads, or fluffy tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground lamb in a large skillet over medium-high heat. Cook and break into small pieces until mostly browned. Drain any excess grease. Add the onion, green pepper, and garlic. Cook until onion is translucent. Stir in diced tomatoes and tomato paste, then season with parsley, basil, mint, cumin, and if using, cayenne. Simmer for about 5 minutes. Remove from heat, cover, and refrigerate overnight to blend the flavors.\nPreheat the oven to 450 degrees F (230 degrees C). Distribute the lamb mixture evenly over the tortillas, and spread out to the edges. Place the tortillas onto a baking sheet.\nBake for about 20 minutes in the preheated oven. Remove from the oven and place the lahmahjoons onto a large piece of aluminum foil so that two of them are meat side to meat side, then stack the pairs together, and bring the foil up over the top to keep warm. These can be served hot or cold. Cut into small wedges.\n",
        "picture_link": "aEjxdROF5RXv0HRrCWg.vk/wMJRyW/."
    },
    {
        "title": "Ricotta Stuffed Squash",
        "ingredients": [
            "8 zucchini, halved lengthwise ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "2 cups ricotta cheese ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon chopped parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (10 ounce) can tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTrim ends of zucchini halves, and scoop out seeds and pulp, leaving about 1/2 inch pulp on skins. In a large saucepan, steam zucchini halves in a vegetable steamer over boiling water for about 5 minutes, until tender but firm. Drain, and immediately plunge into a large bowl filled with enough ice water to cover. Allow to cool completely; drain.\nMelt 1 tablespoon butter in a medium saucepan over medium heat. Slowly cook and stir onion and garlic until onion is soft. Stir in spinach, and cook about 1 minute, until wilted.\nTransfer spinach mixture to a medium bowl, and mix in ricotta cheese, eggs, Parmesan cheese, parsley, salt, basil, oregano and pepper. Stuff zucchini halves with even amounts of the mixture, and arrange in a large baking dish. Drizzle with remaining butter.\nBake uncovered in the preheated oven for 20 minutes, until the stuffing is hot and bubbly. Heat tomato sauce in a small saucepan, and spoon over the zucchini half way through baking.\n",
        "picture_link": "HOCcZVOe5q0sYPiaA8xTFlVnds1hYAK"
    },
    {
        "title": "Apple Ladybug Treats",
        "ingredients": [
            "2 red apples ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1 tablespoon peanut butter ADVERTISEMENT",
            "8 thin pretzel sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice apples in half from top to bottom and scoop out the cores using a knife or melon baller. If you have an apple corer, core them first, then slice. Place each apple half flat side down on a small plate.\nDab peanut butter on to the back of the 'lady bug', then stick raisins onto the dabs for spots. Use this method to make eyes too. Stick one end of each pretzel stick into a raisin, then press the other end into the apples to make antennae.\n",
        "picture_link": "UNOJuSoLgWzwtUcl.LfeAEqvaAvV9RO"
    },
    {
        "title": "Hershey's® White Chocolate Cinnamon Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon grated lemon zest ADVERTISEMENT",
            "6 tablespoons chilled butter, diced ADVERTISEMENT",
            "1/2 cup HERSHEY®'S Cinnamon Chips ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "20 HERSHEY®'S HUGS® Chocolates, melted ADVERTISEMENT",
            "2 tablespoons cream ADVERTISEMENT",
            "1/4 cup HERSHEY®'S Cinnamon Chips, melted ADVERTISEMENT",
            "10 HERSHEY®'S HUGS® Chocolates, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a cookie sheet with non-stick cooking spray.\nSift 2 cups flour, 1/4 cup sugar, baking powder, baking soda and salt into a large bowl. Stir in lemon peel. Cut butter in with a pastry blender or fork until the mixture is resembles cornmeal. Mix in 1/2 cup HERSHEY'S Cinnamon Chips.\nIn a small bowl, whisk together sour cream, egg yolk, and vanilla. Stir in 1/2 cup melted HERSHEY'S HUGS . Mix into flour and butter mixture, and mix until dough comes together in moist clumps. Gather dough into ball.\nPress dough out on lightly floured surface to form a 8 inch round; cut into 6 wedges. Transfer wedges to prepared baking sheet, spacing 1 inch apart. Brush tops lightly with cream.\nBake until scones are crusty on top, and a tester inserted into center comes out clean, about 15 to 20 minutes. Cool slightly. Drizzle the scones alternately with 1/4 cup melted HERSHEY'S HUGS and 1/4 melted HERSHEY'S Cinnamon Chips.\n",
        "picture_link": "X93GwUNhxV0BLhtKznIaIth9nbc1xju"
    },
    {
        "title": "Baked Fettucheesy",
        "ingredients": [
            "1 (16 ounce) package dry fettuccine pasta ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup grated Romano cheese ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium casserole dish.\nBring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes or until al dente; drain.\nIn a skillet over medium heat, melt the butter, and cook the onion until tender. Stir in the fettuccine, heavy cream, 1/4 cup Parmesan cheese, 1/4 cup Romano cheese, salt and pepper. Transfer to the prepared dish. In a bowl, mix the remaining Parmesan, remaining Romano, and mozzarella. Sprinkle the cheese mixture over the fettuccine mixture.\nBake 15 minutes in the preheated oven, until bubbly and golden brow.\n",
        "picture_link": "/zyATo5pzzpFfaYHQ4HXvy8/VBmo7vO"
    },
    {
        "title": "Indian Pork Chops",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 (4 ounce) pork chops ADVERTISEMENT",
            "3/4 cup apricot nectar ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat. Brown the chops in the hot skillet, turning once.\nIn a measuring cup, mix together apricot nectar, curry powder, garlic powder, and salt. Pour over chops, and reduce heat to medium-low. Simmer uncovered for 20 minutes, or until meat is done.\n",
        "picture_link": "9/fpBPJJSrWpa6nd4r7TzsCRszWoipK"
    },
    {
        "title": "Yellow Dhal - Sweet Potato Soup",
        "ingredients": [
            "1 1/2 cups dry yellow lentils ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1 sweet potato, peeled and cut into 1-inch cubes ADVERTISEMENT",
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 tomato, finely chopped ADVERTISEMENT",
            "3 fresh jalapeno peppers, seeded and finely diced ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "chopped fresh cilantro, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse lentils under running water; drain. Place lentils, 2 1/2 cups water, and turmeric in a medium pot, and bring to a boil. Cover, reduce heat, and cook until lentils are tender, about 30 minutes.\nMeanwhile, place cubed sweet potato in a steamer over 1 inch of boiling water. Cover and cook until tender but still firm, about 15 minutes (time may vary depending on size of potato pieces). Once tender, mash sweet potato and lentils together; set aside.\nHeat the oil in a skillet over medium heat, and cook the onion until lightly browned. Stir in tomato, jalapenos, salt, and pepper, and continue cooking another 3 to 5 minutes. Place lentils, vegetables, and potatoes in a stockpot over medium heat. Stir in water as needed to attain desired consistency. Serve warm with cilantro or green onions.\n",
        "picture_link": "3TuqxTf/N/D0QksunzfHlHRxT20evbq"
    },
    {
        "title": "Florns' Chinese Steamed Fish",
        "ingredients": [
            "1 pound red snapper fillets ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "2 shiitake mushrooms, thinly sliced ADVERTISEMENT",
            "1 tomato, quartered ADVERTISEMENT",
            "1/2 fresh red chile pepper, seeded and chopped ADVERTISEMENT",
            "2 sprigs cilantro, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring about 1 1/2 inches of water to boil in a steamer fitted with a basket large enough for the snapper to lie flat. Season snapper with salt and pepper, and place in the steamer basket. Top fish with ginger, and drizzle with soy sauce and sesame oil. Place shiitake mushrooms, tomato, and red chile pepper in the steamer basket.\nSteam fish 15 minutes, or until easily flaked with a fork. Sprinkle with cilantro.\n",
        "picture_link": "8N.BWk0Qlcy89WoZufonX2wGTRy9bTu"
    },
    {
        "title": "Cajun Ponchartrain Sauce",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "8 fresh mushrooms, sliced ADVERTISEMENT",
            "8 medium shrimp - peeled and deveined ADVERTISEMENT",
            "1/4 cup whipping cream ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "2 teaspoons Madeira wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, saute mushrooms in 1 teaspoon butter until tender. Stir in shrimp, and cook until pink. Transfer to a bowl.\nIn the same saucepan, melt the remaining 2 teaspoons butter. Slowly mix in cream. Stir in the shrimp and mushroom mixture, and season to taste with garlic powder and black pepper. Simmer over very low heat until thick. Just before serving, stir in wine.\n",
        "picture_link": "ytpqpNWv2H1AKWgvHoZgCc35TI2bzh6"
    },
    {
        "title": "Boiled Tongue",
        "ingredients": [
            "1 beef tongue ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tongue in a soup pot with the salt, and add enough water to cover. Bring to a boil, and cook until the outer skin begins to peel off, about 2 1/2 to 3 hours. Peel off the thick outer skin, and serve.\n",
        "picture_link": "3.T9OgilXIAadaogHSid4R1fNay/B2y"
    },
    {
        "title": "Hawaiian Waffles with Pineapple and Coconut",
        "ingredients": [
            "1 1/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1/2 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/4 cup coconut milk ADVERTISEMENT",
            "3/4 cup chopped fresh pineapple ADVERTISEMENT",
            "5 tablespoons unsalted butter, melted ADVERTISEMENT",
            "2 large egg whites, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a lightly greased waffle iron.\nIn a medium bowl, sift together flour, sugar, baking powder, baking soda and salt.\nIn a separate medium bowl, mix egg yolk, sour cream, coconut milk, pineapple and butter. Thoroughly mix in the flour mixture. Gently fold in egg whites.\nPour the mixture into the prepared waffle iron, and cook until golden brown.\n",
        "picture_link": "F3BW6manNflwQbFPzx1yEnF3hXC3rdO"
    },
    {
        "title": "Baked Fish Creole",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 1/2 cups uncooked white rice ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce ADVERTISEMENT",
            "1/2 cup chili sauce ADVERTISEMENT",
            "1 pound cod fillets ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Lightly butter a 9x13 inch baking dish. In a saucepan bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nIn a Dutch oven, melt the butter over medium heat. Add the onions and garlic. Cook until tender about 4 minutes. Add the celery and pepper. Cook for 3 minutes. Do not brown add the flour and stir well. Cook for 3 minutes.\nStir in the milk and bring just to a boil. Season with salt, pepper and hot sauce. Stir in the chili sauce. Taste and adjust seasoning.\nPlace rice into the bottom of the prepared pan. Arrange the fish fillets over the rice in a single layer. Place the sliced tomatoes over the fish and pour the sauce over the top.\nBake at 400 degrees F (205 degrees C) for 20 minutes or until fish is just cooked and flakes easily with a fork.\n",
        "picture_link": "eTFVKdZ8cEV9ZGQSjX75uWbYTCZojUq"
    },
    {
        "title": "Pineapple Pie II",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sweetened condensed milk and lemon juice. Stir well. Fold in pineapple and whipped topping. Spoon mix into crust. Chill before serving.\n",
        "picture_link": "gfa70qGQ0CsMfEAofUs9oEiTVnNT/G2"
    },
    {
        "title": "Brazilian Coffee Cookies",
        "ingredients": [
            "1/3 cup shortening ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "2 tablespoons instant coffee powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Line baking sheets with parchment paper.\nBeat the shortening, brown sugar, white sugar, egg, vanilla and milk until fluffy.\nStir the flour, salt, baking soda, baking powder and instant coffee. Add to sugar mixture and mix thoroughly.\nShape dough in 1 inch balls. If it's too soft, chill it for a while. Place balls 2 inches apart on prepared baking sheets. Flatten to 1/8 inch thickness with fork or glass dipped in sugar.\nBake at 400 degrees F (205 degrees CV) for 8 to 10 minutes until lightly browned.\n",
        "picture_link": "cTDMbia9G2Tf1gg/w.JbPt12ijVlnce"
    },
    {
        "title": "Portuguese Steamed Clams",
        "ingredients": [
            "5 pounds clams in shell, scrubbed ADVERTISEMENT",
            "1 1/2 pounds chorizo, sliced into chunks ADVERTISEMENT",
            "1 large onion, cut into thin wedges ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 cups white wine ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash clams well in a sink of cold water. Discard any clams that are already opened.\nIn a large stock pot with a tight fitting lid, place the cleaned clams. Add the sausage, onion, tomatoes and wine. Cover and set over high heat. Steam until all the clams open up. Be sure to shake the pan often to insure even heat.\nDrizzle olive oil over the cooked clams. Evenly divide all the ingredients into warm soup plates. Divide the broth into side cups for dipping.\n",
        "picture_link": "crl4KQCzO/EfOeHgSpqbxIeDD60m4KK"
    },
    {
        "title": "Canja",
        "ingredients": [
            "3 pounds boneless, skinless chicken meat ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "1/4 cup long-grain white rice ADVERTISEMENT",
            "3/4 cup tomato - peeled, seeded and chopped ADVERTISEMENT",
            "1/2 cup chopped carrots ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "3/4 cup diced ham ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To a large saucepan, add the chicken, onion, and chicken stock. Bring to a simmer, and cover. Cook over low heat until the chicken is tender, about 45 minutes. Lift the chicken out onto a platter, and set aside. Strain the stock through a sieve set over a bowl. Discard the solids, and skim off as much fat as possible from stock.\nRinse out the saucepan, and return the stock to it. Add the rice, tomatoes and carrots to the stock. Season with salt and black pepper to taste. Bring to a simmer. Cook until the rice is tender, about 25 minutes.\nWhen the chicken is cool enough to handle, cut it into strips about 1/2 X 1 1/2 inches. Return the chicken to the soup with the ham, and cook just long enough to heat through. Add the parsley, and serve.\n",
        "picture_link": "DFGFr9f6IK5kGoXWXn4StVV26dFbF3q"
    },
    {
        "title": "Pasta with Blue Cheese and Walnuts",
        "ingredients": [
            "1/4 cup coarsely chopped walnuts ADVERTISEMENT",
            "4 ounces blue cheese, crumbled ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 pound uncooked spaghetti ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in a large pot of boiling water until al dente.\nMeanwhile, heat oil in heavy skillet. Add garlic, and saute for a few minutes. Stir in walnuts, and saute for several more minutes.\nDrain pasta, and divide into 2 plates. Top with saute and blue cheese.\n",
        "picture_link": "x77qgGJe7oZYL5aWG5XPM3eY8yVNkRy"
    },
    {
        "title": "Heath Bar Pie",
        "ingredients": [
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1/3 cup caramel ice cream topping ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "6 (1.4 ounce) bars chocolate covered English toffee, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread caramel topping into pie crust.\nBeat milk and pudding mix for 2 minutes; let stand for 5 minutes. Stir in whipped topping and chopped candy bars. Spoon into crust.\nFreeze for 4 hours or until set. Before serving, let stand for 15 minutes so that pie can easily be cut. Store any leftovers in refrigerator.\n",
        "picture_link": "YBsuUUWBeYs4iWqvO7rubShqdf..rui"
    },
    {
        "title": "Beef and Pepper Pie",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "2 cups sweet red peppers, with sauce ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place peppers, including liquid, into food processor; pulse until peppers are cut into small pieces.\nBrown meat and onions. Add peppers, mushrooms, and cheese to meat mixture. Spoon into bottom crust. Cover with top crust, and seal the edges.\nBake at 350 degrees F (175 degrees C) until crust is brown, and pie is heated through.\n",
        "picture_link": "c/oGg1TUWxu9wP3coxha33naXpFkorm"
    },
    {
        "title": "Hazelnut Melting Moments",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups ground hazelnuts ADVERTISEMENT",
            "6 ounces semisweet chocolate chips ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C ).\nIn a large bowl, cream butter and sugar. Gradually beat in the egg yolk, vanilla, and lemon zest. Stir in the flour and ground hazelnuts with a large spoon.\nShape dough into walnut sized balls and place them 2 inches apart on an unprepared cookie sheet. Make an indentation in the center of each ball with your finger. Bake for 10 to 15 minutes in the preheated oven.\nWhile the cookies are baking, melt the chocolate chips in a small saucepan over low heat, or in the microwave. Stir chips until smooth. When cookies come out of the oven, spoon 1/2 teaspoon of the melted chocolate into the indentation. When cookies are completely cool, dust lightly with confectioners' sugar.\n",
        "picture_link": "kMoZTJjiMnAcR84FW.Zztx5Ahw1PBHG"
    },
    {
        "title": "BBQ Bacon-Wrapped Meatloaf",
        "ingredients": [
            "5 slices bacon ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, finely chopped, or more to taste ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "1/2 cup soft bread crumbs ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon chili powder (optional) ADVERTISEMENT",
            "3 tablespoons barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x11-inch baking dish.\nPlace bacon in a large skillet and cook over medium-high heat until edges just start to curl, 1 to 2 minutes per side. Drain the bacon slices on paper towels. Reserve about 1 tablespoon bacon drippings in the skillet.\nCook and stir onion and garlic in the bacon drippings until onion is softened, 6 to 7 minutes. Remove from heat and cool.\nMix cooled onion and garlic, ground beef, 1/2 cup barbeque sauce, bread crumbs, eggs, Worcestershire sauce, Dijon mustard, oregano, and chili powder together with your hands in a large bowl. Form beef mixture into a log-shaped meatloaf; place in the prepared baking dish.\nWrap partially-cooked bacon slices around the meatloaf, tucking the ends of bacon underneath the loaf.\nBake in the preheated oven for 35 minutes. Brush bacon-wrapped meatloaf with 3 tablespoons barbeque sauce. Continue baking until no longer pink in the center, about 10 more minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Let stand for 10 minutes before serving.\n",
        "picture_link": "yrDwAEg1hQ24G4H.0sJ44ZkxNdpObxy"
    },
    {
        "title": "Reindeer Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup smooth peanut butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "48 small pretzel twists, or as needed ADVERTISEMENT",
            "72 chocolate chips, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBeat butter, sugar, peanut butter, eggs, vanilla extract, and salt together in a bowl until smooth and creamy. Stir flour and baking soda into creamed butter mixture until well incorporated.\nRoll dough into 24 balls. Flatten each ball and shape into an upside-down triangle. Press two pretzels into the two top corners of each triangle for the antlers. Press two chocolate chips into the center of each triangle for the eyes, and one chocolate chip on the bottom of the triangle for the nose. Arrange cookies on baking sheets.\nBake in the preheated oven until cookies are golden brown, 10 to 15 minutes.\n",
        "picture_link": "9FHqB0CccU4hqFKCH6Ske6Hs1j2cxwK"
    },
    {
        "title": "Wake-Up Casserole - Canadian Bacon",
        "ingredients": [
            "8 frozen hash brown patties ADVERTISEMENT",
            "2 (6 ounce) packages Canadian bacon, quartered ADVERTISEMENT",
            "4 cups shredded Cheddar-Monterey Jack cheese blend ADVERTISEMENT",
            "1 3/4 cups egg substitute (such as Egg Beaters® Southwestern Style) ADVERTISEMENT",
            "1 cup 2% milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nArrange hash brown patties in a single layer in the prepared baking dish; top with Canadian bacon. Sprinkle Cheddar-Monterey Jack cheese over Canadian bacon.\nWhisk egg substitute, milk, salt, and mustard together in a bowl; pour over cheese layer. Cover dish with aluminum foil.\nBake in the preheated oven for 1 hour. Remove aluminum foil and bake until a knife inserted in the center comes out clean and edges are golden brown, about 15 minutes.\n",
        "picture_link": "v7Y2WJqkPQ0BjSWxDi5vgf8cB8okhQG"
    },
    {
        "title": "Lemon Butter Herb Pasta",
        "ingredients": [
            "4 cups bow-tie pasta (farfalle) ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1/4 teaspoon oregano ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon minced garlic ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain.\nMelt butter in a saucepan over medium heat. Stir chicken broth, lemon juice, oregano, basil, and garlic into the butter. Bring to a simmer and reduce heat to medium-low; cook until thickened to your desired texture, 5 to 7 minutes\nSeason sauce with salt and pepper. Stir cooked pasta into the butter sauce to coat.\n",
        "picture_link": "9P4muxQWUar.tuqkunQJQtNTBwZQy/y"
    },
    {
        "title": "Chef John's Spaghetti al Tonno ",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 anchovy fillet ADVERTISEMENT",
            "2 tablespoons capers ADVERTISEMENT",
            "3 cloves minced garlic ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "3 cups crushed Italian (plum) tomatoes (such as San Marzano) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 (7 ounce) can oil-packed tuna, drained ADVERTISEMENT",
            "1/4 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "1 (12 ounce) package spaghetti ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil, or to taste ADVERTISEMENT",
            "1/4 cup freshly grated Parmigiano-Reggiano cheese, or to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh flat-leaf parsley, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat. Cook and stir anchovy and capers in hot oil until anchovy crumbles, about 2 minutes. Add garlic; cook and stir until fragrant, about 1 minute.\nPour white wine, oregano, and red pepper flakes into the skillet and increase heat to high; cook until mixture reduces and about 3 tablespoons of liquid remain, 2 to 4 minutes.\nStir tomatoes into the skillet and bring to a simmer. Season tomato mixture with salt, black pepper, and cayenne pepper. Reduce heat to medium and simmer until slightly reduced, about 10 minutes.\nStir tuna and 1/4 cup parsley into tomato sauce, breaking up tuna with a wooden spoon while stirring. Reduce heat to medium-low and simmer for about 10 minutes.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until almost cooked through and still slightly firm to the bite, 9 to 11 minutes. Drain and transfer spaghetti back to the pot.\nPour tomato sauce over spaghetti into the pot; stir to combine, cover the pot with a lid, and let sit until spaghetti is cooked through, about 3 minutes. Ladle spaghetti into bowls, drizzle with extra-virgin olive oil, and sprinkle Parmigiano-Reggiano cheese and parsley over the top.\n",
        "picture_link": "B47ufT..MmZfwQgPI4so/ZHfeFtgB4W"
    },
    {
        "title": "Fried Cabbage and Kielbasa",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "1 head cabbage, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (16 oz) ring kielbasa sausage, sliced thin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels and crumble. Reserve drippings in skillet.\nCook and stir cabbage and onion in bacon drippings over medium-high heat until cabbage begins to wilt, 1 to 2 minutes. Stir bacon, salt, and pepper into cabbage mixture; cook until cabbage is wilted, 3 to 5 minutes more. Stir kielbasa into cabbage mixture, reduce heat to low, cover the skillet, and simmer until cabbage is lightly golden and tender, about 1 hour.\n",
        "picture_link": "82NhXit5P7Gfx4r45Wq3XTQDfv1bsPm"
    },
    {
        "title": "Red Cabbage Slaw",
        "ingredients": [
            "1 small head red cabbage, thinly sliced and chopped ADVERTISEMENT",
            "1/2 cup grated carrot ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1 tablespoon milk, or more as needed ADVERTISEMENT",
            "1 tablespoon apple cider vinegar ADVERTISEMENT",
            "1 teaspoon white sugar, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cabbage, carrot, mayonnaise, cranberries, walnuts, milk, cider vinegar, and sugar in a bowl; stir well. Cover and refrigerate until chilled, about 4 hours.\n",
        "picture_link": "AsTq/.Yy4w1eRPfibg4fSBu42EFBLB."
    },
    {
        "title": "Chicken Lo Mein with Broccoli",
        "ingredients": [
            "3 skinless, boneless chicken breast halves, cut into strips ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1/2 pound spaghetti ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2 carrots, thinly sliced ADVERTISEMENT",
            "1 cup broccoli florets ADVERTISEMENT",
            "1 tablespoon vegetable oil (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken strips, cornstarch, soy sauce, ginger, and garlic powder in a large resealable plastic bag. Coat chicken with marinade, squeeze out excess air, and seal bag. Refrigerate for 1 to 1 1/2 hours.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\nHeat 3 tablespoons vegetable oil in a large skillet over medium heat. Remove chicken from marinade and shake off excess; cook and stir in hot oil until chicken is no longer pink in the center, about 5 minutes. Stir in onion, celery, carrots, and broccoli. Add 1 tablespoon vegetable oil, if needed. Cover and cook until vegetables are tender, stirring occasionally, about 5 minutes.\nStir spaghetti into chicken and vegetable mixture; cover and simmer for 5 minutes more.\n",
        "picture_link": "0HPT3ILpCrZ5Vd2xYAyTVjImVJ3Ii3S"
    },
    {
        "title": "Baked Chicken Spaghetti",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "3 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "2 (10.75 ounce) cans cream of mushroom soup ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 (4 ounce) can chopped green chiles (such as Old El Paso®), drained ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 1/2 cups chopped cooked chicken ADVERTISEMENT",
            "2 cups shredded sharp white Cheddar cheese ADVERTISEMENT",
            "3/4 cup panko bread crumbs ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 13x9-inch baking dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\nMelt 6 tablespoons butter in a skillet over medium-high heat. Cook and stir mushrooms, onion, and celery in melted butter until just tender, 5 to 6 minutes; transfer to a large bowl.\nStir diced tomatoes, cream of mushroom soup, chicken broth, chopped green chiles, sour cream, seasoned salt, cayenne pepper, salt, and black pepper into the mushroom mixture. Add chicken and Cheddar cheese; stir. Gently toss the pasta with the mixture to coat the pasta completely; transfer to the prepared baking dish.\nMix bread crumbs and melted butter in a small bowl; sprinkle evenly over the pasta mixture.\nBake in preheated oven until hot and bubbly, 30 to 40 minutes.\n",
        "picture_link": "PeE/IjEoHHhxTgi6hv9EQ9Uzv/25R26"
    },
    {
        "title": "Smoked Sausage with Potatoes, Sauerkraut & Ale",
        "ingredients": [
            "1 (14 ounce) package Hillshire Farm® Smoked Sausage, diagonally cut into 1/4-inch slices ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 cups potatoes, diced into 1-inch pieces ADVERTISEMENT",
            "12 fluid ounces your favorite ale ADVERTISEMENT",
            "1 cup sauerkraut, rinsed and drained ADVERTISEMENT",
            "2 tablespoons whole-grain mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook sausage in a large skillet over medium high heat for 3 minutes, turning occasionally. Remove sausage and set aside.\nAdd oil and potatoes to skillet and cook until golden brown.\nAdd ale, sauerkraut and mustard to skillet, mixing with potatoes until blended. Cook over medium-high heat for 2 minutes.\nReturn the sausage to the skillet, continue cooking for 10 minutes or until potatoes are tender.\n",
        "picture_link": "nOk8Ld7V.XlBD37.y8aCnAmtYx3SSjK"
    },
    {
        "title": "Kid-Pleasing Sloppy Joes",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until beef is completely browned, 5 to 7 minutes. Drain and discard grease. Return skillet to heat.\nStir ketchup, vinegar, brown sugar, Worcestershire sauce, and mustard into the beef mixture; simmer, stirring occasionally, until the liquid is thick, 15 to 20 minutes.\n",
        "picture_link": "R8UPVpKnyEoLiFU9x7bmxydw7Io7exm"
    },
    {
        "title": "Easy Small-Batch Blueberry Jam",
        "ingredients": [
            "4 cups fresh blueberries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 pinch ground cinnamon (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix blueberries, sugar, lemon juice, and cinnamon in a saucepan; cook, stirring constantly, over medium heat until thickened, about 30 minutes.\n",
        "picture_link": "u8En26wm7Bkm7kJfhQw5JgNJOKtPtgq"
    },
    {
        "title": "Basic Salisbury Steaks",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/3 cup dry bread crumbs ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 (10.75 ounce) can condensed golden mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground beef, bread crumbs, egg, and onion soup mix together in a bowl; shape into 6 oblong patties.\nHeat oil in a large skillet over medium-high heat. Cook patties until browned, about 5 minutes per side.\nStir golden mushroom soup and water together in a bowl; pour over the patties in the skillet. Turn patties to coat in the liquid. Bring liquid to a simmer, reduce heat to medium-low, place a cover on the skillet, and cook until steaks are very firm, hot, and grey in the center, 10 to 15 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\n",
        "picture_link": ".GYw8xrwcfxCqgRIVPGbK0yg.CBIc.i"
    },
    {
        "title": "Curried Turkey Meatballs",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1 yellow onion, finely chopped ADVERTISEMENT",
            "1/3 cup dry bread crumbs ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 1/2 teaspoons Madras curry powder ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine turkey, onion, bread crumbs, egg, curry powder, salt, cumin, ginger, and cinnamon together in a bowl using your hands; form into about 20 balls.\nHeat olive oil in a skillet over medium-high heat. Cook meatballs, working in batches, in hot oil until browned on all sides, about 5 minutes. Transfer browned meatballs to a baking dish.\nBake in the preheated oven until cooked through, about 15 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "tVhw4NfvCLSy5A5b.JSSxZoZPgUgFKC"
    },
    {
        "title": "Mom's Jiffy Cinnamon Rolls",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 (15.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 (.25 ounce) packages quick-rise yeast ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups warm water (105 to115 degrees F/40 to 45 degrees C) ADVERTISEMENT",
            "1 cup all-purpose flour, or as needed ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 3 cups flour, cake mix, yeast, and salt in a large bowl; beat warm water into flour mixture until thoroughly combined. Mix remaining 1 cup flour into batter to make a soft dough.\nTurn dough out onto a floured work surface and knead until smooth, 6 to 8 minutes. Roll dough into a 9x18-inch rectangle. Spread softened butter over dough and sprinkle evenly with sugar and cinnamon. Roll dough into a log, starting with a long edge, and pinch edges together to seal.\nPreheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nCut dough into 1-inch thick slices and arrange on prepared baking sheet. Cover rolls and let rise in a warm place until doubled, about 15 minutes.\nBake in the preheated oven until cinnamon rolls are lightly browned and cooked through inside, 15 to 18 minutes.\n",
        "picture_link": "GlNgoyRBkMLo9JBt/8PTS8EP9Do5KYa"
    },
    {
        "title": "Slow Cooked Chipotle Chicken",
        "ingredients": [
            "2 pounds boneless, skinless chicken breasts, trimmed ADVERTISEMENT",
            "3 tablespoons Mazola® Corn Oil ADVERTISEMENT",
            "1 medium onion, sliced ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "2 canned chipotle peppers in adobo sauce ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "1 tablespoon chicken-flavored bouillon powder ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "Chopped fresh cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pat chicken dry using paper towels. Cut chicken breasts into 2 to 3 ounce portions; add to 6-quart slow cooker.\nHeat oil in a large skillet over medium-high heat, add onions and cook for 5 to 8 minutes until tender and beginning to brown.\nReduce heat and add garlic; cook for 1 minute.\nTransfer onion mixture to electric blender or food processor. Add chipotle chilies, water and bouillon powder. Puree until smooth. Pour over chicken in slow cooker; cover.\nCook for 2 to 3 hours on HIGH, stirring once, cooking until chicken is tender and at least 170 degrees F.\nWhisk together sour cream and cream cheese until smooth. Stir into chicken mixture. Season with salt and pepper if desired. Continue cooking for 15 to 20 minutes on LOW or until heated through.\nDelicious served with rice, black beans, vegetables and warm corn tortillas. Garnish with cilantro, if desired.\n",
        "picture_link": "/r4fMhAhPdgZ4nDUpNyr0AOMv0YMuaC"
    },
    {
        "title": "Honey-Lime Vinaigrette",
        "ingredients": [
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend lime juice, honey, sugar, mustard, garlic powder, salt, black pepper, and cumin in a blender; stream olive oil and canola oil into the juice mixture while blending to emulsify the oil into the juice.\n",
        "picture_link": "QKytGZTFobbcYwNEeqcZpwxuxdiB2vy"
    },
    {
        "title": "Roasted Cauliflower Steaks",
        "ingredients": [
            "1 large head cauliflower, sliced lengthwise through the core into 4 'steaks' ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nPlace cauliflower steaks on the prepared baking sheet.\nWhisk olive oil, lemon juice, garlic, red pepper flakes, salt, and black pepper together in a bowl. Brush 1/2 of the olive oil mixture over the tops of the cauliflower steaks.\nRoast cauliflower steaks in the preheated oven for 15 minutes. Gently turn over each steak and brush with remaining olive oil mixture. Continue roasting until tender and golden, 15 to 20 minutes more.\n",
        "picture_link": "TwggOqx/0Ckl05InreWMKvRTI0xwTL6"
    },
    {
        "title": "Jimmy Dean Hearty Sausage Mini Quiches",
        "ingredients": [
            "1 (16 ounce) package Regular Flavor Jimmy Dean Pork Sausage, cooked, crumbled and drained ADVERTISEMENT",
            "8 eggs, lightly beaten ADVERTISEMENT",
            "1/4 cup milk or water ADVERTISEMENT",
            "3/4 cup shredded Cheddar, mozzarella or provolone cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 tablespoon olive oil or butter ADVERTISEMENT",
            "1/2 cup thinly sliced green onion ADVERTISEMENT",
            "1/2 cup diced sweet red pepper (optional) ADVERTISEMENT",
            "1 cup thinly sliced mushrooms or yellow squash (optional) ADVERTISEMENT",
            "1 cup frozen Southern-style hash brown potatoes or diced, pre-baked red potatoes (optional) ADVERTISEMENT",
            "1/4 cup Parmesan cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 F. In a large mixing bowl, combine eggs, milk or water, cheese, salt and pepper; set aside. Heat olive oil or butter in a large skillet; saute onions and any optional vegetables desired until vegetables are tender. Add vegetables and sausage to egg mixture; stir well.\nPlace 12 foil baking cups into cupcake pan. Distribute sausage and egg mixture evenly into baking cups. Bake for 22 minutes or until eggs are set. Remove from oven. Sprinkle with Parmesan if desired.\n",
        "picture_link": "2SFpaORKpUv4nE5FfkGO6DNF4JqT1Rq"
    },
    {
        "title": "Spiced-Up Grilled Tater Wedges",
        "ingredients": [
            "4 small baking potatoes, scrubbed ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1/8 teaspoon mustard powder ADVERTISEMENT",
            "1/8 teaspoon granulated garlic ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon celery salt ADVERTISEMENT",
            "1/8 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "vegetable oil cooking spray ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a pot and fill with enough water to cover. Bring to a boil and cook until potatoes are almost done but still firm, about 15 minutes. Drain and cool.\nIn a cup or small bowl, mix together the paprika, cayenne pepper, mustard powder, garlic, black pepper, celery salt, cumin and parsley. Set aside.\nWhen the potatoes are cooled, slice them lengthwise into wedges. Place them skin side down on a plate. Coat with cooking spray and sprinkle the seasoning evenly over them. Cover and let stand for 1 hour.\nPreheat an outdoor grill for medium heat.\nGrill potato wedges until browned and hot, turning occasionally to avoid burning. Serve with sour cream.\n",
        "picture_link": "Z0OYddLGImkIDgPtdzFd5/Gt9aVTNX2"
    },
    {
        "title": "Lovely Linguine",
        "ingredients": [
            "1 (16 ounce) package uncooked linguine pasta ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons fresh thyme leaves ADVERTISEMENT",
            "5 roasted red peppers, drained and coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add linguine and olive oil, cook for 8 to 10 minutes, until al dente, and drain.\nMelt 2 tablespoons butter in a saucepan over medium heat. Stir in garlic, and cook until golden brown. Mix in remaining butter, thyme, and roasted red peppers. Continue to cook and stir until heated through. Serve over the cooked pasta.\n",
        "picture_link": "9sy4GnpufA5PmfTBiBl7nnZcMjsdCqK"
    },
    {
        "title": "Cottoneyed Peas",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "3 (15.5 ounce) cans jalapeno black-eyed peas ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1/2 small onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 fresh jalapeno peppers, seeded and chopped (optional) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown the bacon in a skillet over medium heat until crispy; drain, crumble, and set aside.\nIn a large saucepan, combine the canned black-eyed peas, canned tomatoes, onion, celery, garlic, and jalapeno peppers. Cook over medium heat until the celery and onion are tender. Season with salt and pepper to taste. Add crumbled bacon before serving.\n",
        "picture_link": "RXz4yKymxmzjtgbhMoo1UwVbD1pIGXa"
    },
    {
        "title": "Brown Bean Chowder",
        "ingredients": [
            "2 1/2 cups dried pinto beans ADVERTISEMENT",
            "3 quarts water ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/2 medium onion, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 2/3 cups tomato puree ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beans and water in a large pot. Bring to a boil, and cook until the beans are almost tender, about 1 1/2 hours. Season with 1 1/2 teaspoons of chili powder, and 1 1/2 teaspoons of salt.\nWhile the beans are cooking, crumble the ground beef into a large skillet over medium-high heat. Add onion and garlic; cook and stir until onion is tender and meat is browned. Drain off excess grease, and stir in the tomato puree, 1 tablespoon chili powder, 1 tablespoon salt and bread crumbs. Stir into the pot with the beans, adding more water if needed to achieve your desired thickness. Taste and adjust seasonings if you like before serving.\n",
        "picture_link": "C21NO6LEt3KStlCD/HyxW/A.Eu33IbS"
    },
    {
        "title": "Green Pea Casserole",
        "ingredients": [
            "1 (15 ounce) can baby peas, drained ADVERTISEMENT",
            "1 (2 ounce) bottle diced pimento peppers, drained ADVERTISEMENT",
            "1 (5 ounce) can sliced water chestnuts, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 cups crushed buttery round crackers ADVERTISEMENT",
            "1/2 cup margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a medium bowl, mix together the peas, pimentos, water chestnuts, cream of celery soup and onion. Pour into a 1 1/2 quart casserole dish. Top with shredded cheese. In a separate bowl, mix together the cracker crumbs and margarine; sprinkle evenly over the cheese.\nBake for 30 to 40 minutes in the preheated oven, until browned and bubbly.\n",
        "picture_link": "MJL4gb4uGcJjUvbRwACOkWAKZSqwf7m"
    },
    {
        "title": "Creole Chitterlings (Chitlins)",
        "ingredients": [
            "20 pounds frozen cleaned chitterlings, thawed ADVERTISEMENT",
            "1 large baking potato ADVERTISEMENT",
            "2 large onions, peeled and halved ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "3 stalks celery, with leaves ADVERTISEMENT",
            "1 cup apple cider vinegar ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 teaspoon Creole seasoning to taste ADVERTISEMENT",
            "1 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Clean the chitterlings by removing all the specks and fat with specks on them. Rinse in several changes of salted water. Place them in a large pot and fill with enough water to cover. Bring to a boil, drain, rinse and fill with enough water to cover again.\nReturn to the heat and add the potato, onions, green pepper, garlic, celery and vinegar. Season with salt, bay leaf, Creole seasoning and red pepper flakes. Cover and simmer over medium heat for 3 to 4 hours. Chitterlings should appear clear to white in color.\nCut the chitterlings into 1 inch pieces and return to the pot. Pour out most of the cooking liquid. Discard the potato, onions, celery and bay leaf. Heat the chitterlings through and serve with your favorite side dishes. Store the leftovers in the refrigerator. Like so many other great soul food dishes, chitlins taste even better after the flavor has soaked in for a few hours.\n",
        "picture_link": "DrxM2ttq8OiiAjd3icldJmopwtHKQzO"
    },
    {
        "title": "Yeast Dumplings",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 (32 ounce) carton chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place milk and butter in a small saucepan, and simmer over medium heat until butter melts. Remove from the heat and allow to cool.\nDissolve the yeast in the warm water placed in a small bowl. Set aside.\nCombine the eggs, sugar, and salt in a large mixing bowl, and mix until thoroughly blended. Gradually stir in the flour, alternating with milk and yeast mixtures. Gather the dough into a ball. Cover the bowl with a cloth, and let the dough rest 20 minutes.\nPour the chicken broth into a large pot. Bring broth to a boil over medium-high heat.\nMeanwhile, sprinkle flour over a clean board or countertop. Turn the dough out onto the board and knead lightly until smooth and satiny, about 3 minutes. Add a little more flour if the dough is sticky. Roll out the dough to be about 1/2 inch thick. Use a butter knife to cut dough into 2 inch wide strips, and place strips into the boiling broth. Dumplings will initially sink, then rise to the surface when cooked, about 10 minutes. Remove dumplings from the broth with a slotted spoon, and drain on a plate.\n",
        "picture_link": "7ZshIBtdrjId13CbFNX0xAKhyMbleBS"
    },
    {
        "title": "Banh-Mi Style Vietnamese Baguette",
        "ingredients": [
            "2 portobello mushroom caps, sliced ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 carrot, sliced into sticks ADVERTISEMENT",
            "1 daikon (white) radish, sliced into sticks ADVERTISEMENT",
            "1 cup rice vinegar ADVERTISEMENT",
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "1/2 cup chilled lime juice ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "1 teaspoon nuoc mam (Vietnamese fish sauce) ADVERTISEMENT",
            "1/2 teaspoon toasted sesame oil ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/3 cup cold water ADVERTISEMENT",
            "1 jalapeno pepper, thinly sliced ADVERTISEMENT",
            "8 sprigs fresh cilantro with stems ADVERTISEMENT",
            "1 medium cucumber, sliced into thin strips ADVERTISEMENT",
            "2 sprigs fresh Thai basil ADVERTISEMENT",
            "2 (7 inch) French bread baguettes, split lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (230 degrees C). Place the mushrooms on a baking sheet. Drizzle with a little olive oil and season with salt and pepper. Roast in the preheated oven for about 25 minutes. Cool slightly, then slice into strips.\nWhile the mushrooms are roasting, bring a saucepan of water to a boil. Plunge the carrot and radish sticks into the boiling water and after a few seconds, remove them and plunge them into a bowl of ice water to stop the cooking. In a separate bowl, stir together the rice vinegar, 1/2 cup of lime juice and 1/2 cup cold water. Transfer the carrot and radish to the vinegar and lime marinade and let them soak for at least 15 minutes, longer if it's convenient.\nIn a small bowl, stir together the remaining lime juice, soy sauce, fish sauce, sesame oil, canola oil, 1/3 cup sugar and 1/3 cup water. This is the sandwich sauce.\nTo assemble sandwiches, sprinkle a little of the sandwich sauce onto each half of the French loaves. Place the roasted mushrooms onto the bottom half of each roll and sprinkle with a little more sauce. Top with a few slices of jalapeno, a few sticks of carrot and radish (minus the marinade), cucumber, basil and cilantro. Close with the tops of the bread and serve.\n",
        "picture_link": "tevEvQy3tsNejatzgfr47nGDMgN9Xg6"
    },
    {
        "title": "Turkey Nacho Bake",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "2 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "2 tablespoons hot sauce (optional) ADVERTISEMENT",
            "1 (1 ounce) package dry taco seasoning mix ADVERTISEMENT",
            "1 (14 ounce) can refried beans ADVERTISEMENT",
            "1 (14.5 ounce) package tortilla chips ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives ADVERTISEMENT",
            "1 ripe tomato, diced ADVERTISEMENT",
            "1 bunch green onions, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium heat, begin to brown the ground turkey. Stir in garlic, pepper, 1 teaspoon red pepper flakes, and 1 tablespoon chives. Stir in 1 tablespoon hot sauce. When the turkey is browned, stir in taco seasoning mix according to package instructions.\nPour the beans into a microwave safe bowl, and heat in the microwave until softened. Stir in 1 tablespoon chives and 1 tablespoon hot sauce.\nSpread the tortilla chips across the bottom of a baking sheet. Spoon the beans mixture over the chips. Then spread the turkey mixture across the top. Sprinkle cheese, then olives, tomatoes, green onions, and remaining 1 teaspoon of crushed red pepper flakes over the top.\nBake in preheated oven until cheese is melted, about 15 minutes\n",
        "picture_link": "5LFKE9DVNbzUu58eA5QHGN/d4m04vvW"
    },
    {
        "title": "Yellow Chicken",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 skinless, bone-in chicken breast halves ADVERTISEMENT",
            "4 slices bacon, cut in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, mix the olive oil, Worcestershire sauce, turmeric, mustard, and garlic.\nArrange the chicken breast halves in a medium baking dish, and top each with 2 halves bacon. Brush with the glaze.\nCover, and bake 45 minutes in the preheated oven. Remove cover, and continue baking 15 minutes, or until chicken juices run clear.\n",
        "picture_link": "3UVCZ.LHkn7TpxgYF77LERo1jOsg5xm"
    },
    {
        "title": "Green Beans with Caramelized Onions",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 (16 ounce) package frozen pearl onions ADVERTISEMENT",
            "1 (16 ounce) package frozen cut green beans, thawed ADVERTISEMENT",
            "1 tablespoon fresh dill weed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil and sugar in a large skillet over medium-high heat. Add the onions; cook and stir until tender and golden brown, about 10 minutes.\nMix the green beans with the onions, and cook for about 3 minutes. Remove from heat and season with dill, salt and pepper.\n",
        "picture_link": "TVtV3TdZ0whtRNWZnDVBeR8uj4t/Etu"
    },
    {
        "title": "Cumin-Coriander Pork Rub",
        "ingredients": [
            "2 tablespoons kosher salt ADVERTISEMENT",
            "2 tablespoons ground coriander ADVERTISEMENT",
            "6 tablespoons ground cumin ADVERTISEMENT",
            "4 tablespoons hot chili powder ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 1/2 teaspoons ground allspice ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the kosher salt, coriander, cumin, chili powder, paprika, allspice, and black pepper in a bowl and mix thoroughly. Store in an airtight container at room temperature until ready to use.\nTo use, rub 1 tablespoon per serving onto the meat of your choice before grilling or cooking as desired.\n",
        "picture_link": "Si3UzOquMkDZ166Bcz2W5aP.qU/Tgwm"
    },
    {
        "title": "Holiday Eggnog Pie",
        "ingredients": [
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups eggnog ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup unsalted butter, melted and cooled slightly ADVERTISEMENT",
            "1 (9 inch) prepared, unbaked pie crust, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix the sugar and flour together in a mixing bowl. Beat in the eggnog, eggs, and vanilla to make a smooth mixture. Stir in the butter. Pour into the prepared pie crust.\nBake in preheated oven until the custard is set, 35 to 40 minutes. Cool before serving.\n",
        "picture_link": "S.RJ7Nmga6a0BFV46Q7pyDmYIyjuKkK"
    },
    {
        "title": "Steak Subs",
        "ingredients": [
            "2 1/2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "1 pound boneless top round steak, sliced very thin ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "4 hoagie rolls, split lengthwise and toasted ADVERTISEMENT",
            "4 slices mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the soy sauce, water, pepper and cornstarch. Add the meat, and marinate for at least 1/2 hour or overnight.\nPreheat your oven's broiler. Heat the oil in a large skillet over medium heat. Add onion; cook and stir until browned. Remove from the skillet and set aside. Add beef strips to the skillet and quickly fry just until browned.\nPlace meat, cheese and onions onto buns, and quickly melt under the broiler.\n",
        "picture_link": "g8doB93rGFH/5RZ9fYrO61l9MlapIVK"
    },
    {
        "title": "Smoked Salmon Pasta with Scotch",
        "ingredients": [
            "1 (16 ounce) package dry penne pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 medium onion, finely chopped ADVERTISEMENT",
            "2 cups fish stock ADVERTISEMENT",
            "2 cups white wine ADVERTISEMENT",
            "3 tablespoons Scotch whiskey ADVERTISEMENT",
            "1/2 pound chopped smoked salmon ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese for topping ADVERTISEMENT",
            "1 bunch Italian flat leaf parsley, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Place penne pasta in the pot, cook 8 to 10 minutes, until al dente, and drain.\nHeat the olive oil in a skillet over medium heat, and cook the onion until tender. Pour in the fish stock and white wine, and cook until reduced by 1/2.\nRemove the skillet from heat, and pour in the Scotch whiskey. Using a long match, carefully ignite the Scotch. Once the flame had subsided, return the skillet to medium heat, and mix in the salmon. Stir in the cream, and bring the mixture to a boil. Continue to cook and stir until thickened.\nIn a large bowl, toss the cooked penne pasta with the salmon mixture. Season with pepper, and top with Parmesan cheese and parsley to serve.\n",
        "picture_link": "6S7Yv1qVch6sZ9j01CdoA2ys1KPGg0C"
    },
    {
        "title": "Spiced Balsamic Vinaigrette",
        "ingredients": [
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon Dijon mustard ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the balsamic vinegar and Dijon mustard together in a small bowl. Whisk in the shallot, garlic, cumin, and crushed red pepper. Slowly drizzle in the olive oil, whisking constantly until fully incorporated, and continue to whisk for an additional 1 to 2 minutes. Season to taste with salt and black pepper. Let the dressing sit for 10 minutes to allow the flavor to develop.\n",
        "picture_link": "8CU62yOSxEpJE8dkKS.e8QkYYlpkqN."
    }
]