[
    {
        "title": "Raw Food Snacks - Marzipan!",
        "ingredients": [
            "7 tablespoons agave nectar ADVERTISEMENT",
            "2 tablespoons firmly packed baby spinach leaves ADVERTISEMENT",
            "2 1/2 cups almond flour, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine agave nectar and spinach leaves in a bowl; puree with an immersion blender until mixture is smooth. Add almond flour and knead with your hands, adding more almond flour as necessary, until you have a firm dough.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Buttery Cod and Vegetable Packets",
        "ingredients": [
            "1/4 cup Gay Lea Spreadables Butter Original ADVERTISEMENT",
            "1 tablespoon chopped chives ADVERTISEMENT",
            "1 tablespoon chopped parsley ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon finely grated lemon zest ADVERTISEMENT",
            "1 large clove garlic, minced ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 small zucchini, cut into matchstick pieces ADVERTISEMENT",
            "1 small red pepper, cut into matchstick pieces ADVERTISEMENT",
            "1 small carrot, cut into matchstick pieces ADVERTISEMENT",
            "4 (5 ounce) Pacific cod fillets ADVERTISEMENT",
            "1/4 teaspoon salt, divided ADVERTISEMENT",
            "1/4 teaspoon pepper, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nBlend Spreadables butter with chives, parsley, lemon juice, lemon zest, garlic, and mustard until well combined; set aside.\nLay 4 large sheets of parchment on a work surface. Mound an equal portion of the zucchini, red pepper, and carrot in center of each sheet. Sprinkle evenly with half each salt and pepper.\nTop vegetables with a piece of cod. Sprinkle evenly with remaining salt and pepper. Dollop butter mixture evenly over fish and vegetables. Seal packets by bringing up the sides and folding down tightly. Fold under ends tightly. Transfer to a large, rimmed baking sheet.\nBake for 20 minutes. Let rest for 5 minutes; carefully open packets to serve.\n",
        "picture_link": "LHL6XCnDTx32lj0aKkt0JgvkuN/zxp6"
    },
    {
        "title": "Bombay Butter Chicken",
        "ingredients": [
            "1/2 cup Gay Lea Spreadables Regular ADVERTISEMENT",
            "2 onions, peeled and sliced ADVERTISEMENT",
            "3 garlic cloves, minced ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "4 teaspoons mild Indian curry paste ADVERTISEMENT",
            "2 teaspoons ginger, minced ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1/4 cup Gay Lea Regular Sour Cream ADVERTISEMENT",
            "1/4 cup chopped fresh coriander ADVERTISEMENT",
            "Steamed rice or naan bread (optional) ADVERTISEMENT",
            "Lime wedges (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt half the butter in a Dutch oven or heavy pot on medium heat. Add onion and garlic and cook, stirring occasionally, for 5 minutes.\nCut chicken into bite-sized chunks. Sprinkle with salt and pepper. Increase heat to medium high. Brown chicken. Add curry paste, ginger and cinnamon and cook, stirring for 30 seconds. Add tomatoes, including juices, and remaining butter to pan and bring to boil.\nReduce heat and simmer, covered, for 20 minutes or until chicken is cooked through. Stir in sour cream and coriander.\nHeat until very hot without boiling. Serve with rice or naan bread. Garnish with lime wedges.\n",
        "picture_link": "wqbmfmB9qVcOawPqACzrJcZl4xPGR5K"
    },
    {
        "title": "The Big Game Barbeque Meat Chili",
        "ingredients": [
            "1 (55 ounce) can baked beans (such as Bush's Homestyle®) ADVERTISEMENT",
            "1 (19 ounce) can red kidney beans ADVERTISEMENT",
            "1 (19 ounce) can cannellini beans ADVERTISEMENT",
            "1/4 cup barbeque sauce (such as Jack Daniel's®) ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound bulk sweet Italian sausage ADVERTISEMENT",
            "1 pound bulk hot Italian sausage ADVERTISEMENT",
            "2 (13 ounce) packages kielbasa sausage, thinly sliced ADVERTISEMENT",
            "13 slices crisply cooked bacon, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir baked beans, kidney beans, cannellini beans, barbeque sauce, and brown sugar together in a large bowl.\nHeat a large skillet over medium-high heat. Cook and stir beef, sweet Italian sausage, and hot Italian sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; pour meat mixture into a slow cooker. Cook and stir kielbasa in the same skillet over medium-high heat until browned, 5 to 7 minutes; add to slow cooker. Top meats with chopped bacon.\nPour bean mixture over meats in the slow cooker and stir to combine.\nCook on Low for 10 to 12 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate, Peanut Butter, and Bacon Cookies",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (13 ounce) package miniature peanut butter cups, chopped ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels.\nMix flour, cocoa powder, and baking soda together in a bowl.\nBeat butter, brown sugar, and white sugar together with an electric mixer in a large bowl until smooth. Beat 1 egg into butter mixture. Beat second egg into mixture along with the vanilla extract; add flour mixture and mix well into a cookie dough. Crumble bacon and add to the dough with the chopped peanut butter cups; fold bacon and peanut butter cup chunks through the dough. Drop peanut butter in small amounts into the dough and swirl into the dough, but not mixing completely to integrate.\nDrop spoonfuls of dough onto baking sheets.\nBake in the preheated oven until the edges are golden, about 12 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Samoas Cookies",
        "ingredients": [
            "1 (14 ounce) package sweetened flaked coconut ADVERTISEMENT",
            "1 (18 ounce) package refrigerated sugar cookie dough, halved lengthwise and cut into slices ADVERTISEMENT",
            "1 (12 ounce) jar caramel sundae syrup ADVERTISEMENT",
            "1 (12 ounce) jar hot fudge topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPour coconut into a shallow bowl. Press each cookie dough slice into coconut to coat both sides. Arrange coated slices on a baking sheet.\nBake in the preheated oven until lightly golden, 10 to 12 minutes. Cool completely.\nDrizzle caramel syrup over cooled cookies and top with hot fudge topping. Chill in the refrigerator until set, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Robo's Savory Jalapeno Mozzarella Cheese Cookies",
        "ingredients": [
            "1 (10 ounce) can refrigerated pizza dough, separated into 8 portions ADVERTISEMENT",
            "1 large jalapeno pepper, seeded and minced, or to taste ADVERTISEMENT",
            "3 ounces shredded mozzarella cheese, or as needed ADVERTISEMENT",
            "coarse kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nFlatten dough portions into rounds. Separate minced jalapeno pepper into 8 portions; press each dough round into 1 portion jalapeno pepper so that peppers are imbedded in one side of the dough. Place dough, pepper-side up, on a baking sheet.\nSprinkle mozzarella cheese over the top of each dough round and top with salt.\nBake in the preheated oven until cooked through and cheese is melted, 12 to 15 minutes.\n",
        "picture_link": "/1bpploDk5BxGozyTLPnO5MMCi884U6"
    },
    {
        "title": "Quick and Easy Moose Milk",
        "ingredients": [
            "12 fluid ounces heavy whipping cream ADVERTISEMENT",
            "12 fluid ounces milk ADVERTISEMENT",
            "4 fluid ounces vodka ADVERTISEMENT",
            "4 fluid ounces dark rum ADVERTISEMENT",
            "2 fluid ounces Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
            "2 fluid ounces coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "2 cups vanilla ice cream ADVERTISEMENT",
            "1 pinch ground nutmeg, or more to taste ADVERTISEMENT",
            "1 pinch ground cinnamon, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend cream, milk, vodka, rum, Irish cream liqueur, coffee-flavored liqueur, ice cream, nutmeg, and cinnamon together in a blender until smooth.\n",
        "picture_link": "DOh.NJRGUVAz8hjkeHwe/jofXkhJoSK"
    },
    {
        "title": "Oven-Baked Dirty Rice",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2 cups rice ADVERTISEMENT",
            "1 (10.5 ounce) can French onion soup ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nMix ground beef, rice, French onion soup, cream of mushroom soup, and Cajun seasoning together in a casserole dish.\nBake dish in preheated oven until the rice is tender, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spinach Croquettes",
        "ingredients": [
            "2 cups cooked spinach ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup chilled sparkling water ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "1/4 teaspoon white vinegar, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine spinach, flour, sparkling water, eggs, Parmesan cheese, baking powder, garlic, vinegar, salt, and black pepper together in a bowl until batter is evenly combined.\nHeat enough oil to cover the bottom of a large skillet over medium heat. Spoon batter into the hot oil, keeping about 1 inch between each croquette. Cook until golden brown, about 90 seconds per side. Repeat with remaining batter.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Beef and Lamb Dry Rub",
        "ingredients": [
            "4 teaspoons ancho chile powder ADVERTISEMENT",
            "4 teaspoons chipotle chile powder ADVERTISEMENT",
            "2 teaspoons ground coriander ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon fennel seed ADVERTISEMENT",
            "1 teaspoon finely minced garlic ADVERTISEMENT",
            "1 teaspoon dried dill ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon grated lime zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk ancho powder, chipotle powder, coriander, salt, black pepper, cumin, cinnamon, fennel, garlic, dill, mustard, and lime zest together in a small bowl.\n",
        "picture_link": "1WhknOmaCG1LjSzRhodl7PvG3r9lz2S"
    },
    {
        "title": "Flourless Coconut and Almond Cake",
        "ingredients": [
            "1 1/2 cups almond meal ADVERTISEMENT",
            "3/4 cup coconut flakes ADVERTISEMENT",
            "1 1/4 cups caster (superfine) sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "7/8 cup unsalted butter, melted and cooled ADVERTISEMENT",
            "2 tablespoons almond slices ADVERTISEMENT",
            "2 tablespoons confectioners' sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch springform pan.\nMix almond meal, caster sugar, and coconut in a large bowl.\nBeat eggs, cooled melted butter, and vanilla together with a whisk until smooth; pour into bowl with almond meal mixture and fold until smooth and batter-like. Pour the batter into the prepared pan. Sprinkle almond slices over the top of the batter.\nBake in preheated oven until the top of the cake is firm, about 40 minutes. Cool cake in pan for 10 minutes before removing to a baking rack to cool completely. Dust top of cooled cake with confectioners' sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ginger Coconut Granola",
        "ingredients": [
            "3/4 cup coconut oil ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "2/3 cup sliced almonds ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "1/3 cup flax seeds ADVERTISEMENT",
            "2 tablespoons diced crystallized ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nCombine coconut oil and honey together in a saucepan over medium heat; cook and stir until smooth and melted, about 5 minutes. Remove saucepan from heat.\nMix oats, coconut, almonds, cranberries, pecans, flax seeds, crystallized ginger, cinnamon, and nutmeg together in a separate bowl. Add coconut oil-honey mixture and stir to coat. Spread oat mixture in 1 even layer on a baking sheet.\nBake in the preheated oven, stirring every 10 minutes, until granola is dark brown, 20 to 30 minutes. Cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "BananaMac Blueberry Pie",
        "ingredients": [
            "2 large bananas, cut into small chunks ADVERTISEMENT",
            "1 (9 inch) prepared shortbread pie crust ADVERTISEMENT",
            "1/4 cup fresh blueberries ADVERTISEMENT",
            "3 (6 ounce) containers vanilla-flavored cultured coconut milk ADVERTISEMENT",
            "1/2 cup ground macadamia nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread bananas into the bottom and up the sides of the prepared pie shell covering as completely as you can. Pour blueberries over the banana pieces and spread to evenly cover. Pour cultured coconut milk over the blueberries and spread into an even layer. Sprinkle macadamia nuts over the coconut milk layer.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Comforting Chicken, Cranberry, and Mushroom Risotto",
        "ingredients": [
            "1/2 cup butter, divided ADVERTISEMENT",
            "1 pound mushrooms, thinly sliced ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "6 tablespoons white wine, divided ADVERTISEMENT",
            "1 1/2 bunches lacinato kale ADVERTISEMENT",
            "2 cups chopped roasted chicken ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "2 large leeks (white and pale green parts only), thinly sliced ADVERTISEMENT",
            "2 cups short-grain brown rice ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "4 cups low-sodium chicken broth, divided ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "1/4 cup drippings from a roast chicken ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt half the butter in a large heavy pot over medium-high heat; add mushrooms and season with salt. Cook and stir mushrooms until softened and beginning to brown, 5 to 10 minutes. Pour 2 tablespoons white wine over the mushrooms; cook and stir until the wine reduces in volume, about 2 minutes more.\nStir kale with the mushrooms, season with salt, and place a lid on the pot; cook until the kale has wilted, about 5 minutes.\nStir chicken and cranberries with the kale mixture; season with salt and pepper. Transfer the mixture to a large bowl and return the pot to medium-high heat.\nMelt remaining butter in the pot; add leeks and season with salt. Saute leeks until softened, 2 to 3 minutes. Stir rice and thyme with the leeks to coat the rice in butter; cook and stir until fragrant, 2 to 3 minutes.\nPour 2 cups chicken broth into the pot; cook, stirring occasionally, until the broth has mostly absorbed into the rice and a spoon dragged through the rice leaves a trail, about 8 minutes; repeat process twice more with remaining broth.\nStir water and chicken drippings together in a bowl. Stir 2 cups of the mixture into the pot; cook, stirring occasionally, until the broth has mostly absorbed into the rice and a spoon dragged through the rice leaves a trail, about 8 minutes; repeat process twice more with remaining mixture, cooking until the mixture is creamy and the rice is plump and remains firm to the bite. Remove and discard thyme sprig. Season rice mixture with salt and pepper.\nPreheat oven to 350 degrees F (175 degrees C).\nStir about 2/3 of the kale mixture into the rice mixture; spread into a large baking dish and top with remaining kale mixture.\nBake in preheated oven until heated through, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken Divine Bake",
        "ingredients": [
            "3 large boneless chicken breasts ADVERTISEMENT",
            "2 (14 ounce) cans cream of mushroom soup ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 (16 ounce) bag steam-in-bag partially cooked frozen broccoli ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "8 fresh mushrooms, or more to taste, sliced (optional) ADVERTISEMENT",
            "3 cups shredded Cheddar cheese, or more to taste ADVERTISEMENT",
            "2 cups cooked rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large saucepan of lightly salted water to a boil. Cook chicken in boiling water until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken to a cutting board to cool. Shred cooled chicken into strands.\nPreheat oven to 400 degrees F (200 degrees C).\nSteam broccoli in microwave oven until tender-crisp, 4 to 6 minutes or according to package directions.\nStir mushroom soup and mayonnaise together in a bowl; add broccoli, onion, and mushrooms and stir to coat.\nSpread cooked rice into the bottom of a casserole dish. Top rice with shredded chicken. Spread the mushroom soup mixture over the chicken. Sprinkle Cheddar cheese over everything.\nBake in preheated oven until slightly browned on top, 35 to 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Savory Oatmeal Breakfast Casserole",
        "ingredients": [
            "1 cup water, more if needed ADVERTISEMENT",
            "1/2 cup steel-cut oats ADVERTISEMENT",
            "1/4 cup diced tomatoes ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons heavy whipping cream ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBring water to a boil in a saucepan. Add oats, reduce heat to medium-low, and cook until tender, 10 to 15 minutes, adding more water if oats get too dry.\nCombine oatmeal, tomatoes, basil, salt, and pepper together in a bowl. Beat eggs and cream together in a separate bowl. Fold egg mixture into oatmeal mixture; divide between 2 large ramekins or baking dishes. Top oatmeal mixture with feta cheese.\nBake in the preheated oven until cooked through, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Paleo Chocolate Espresso Cake",
        "ingredients": [
            "1 teaspoon melted coconut oil, or as needed ADVERTISEMENT",
            "1 cup almond butter ADVERTISEMENT",
            "4 large eggs, beaten ADVERTISEMENT",
            "1/3 cup coconut sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup coconut flour ADVERTISEMENT",
            "2 teaspoons instant espresso powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon sea salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup miniature chocolate chips (such as Enjoy Life®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Brush the inside of cake pan with melted coconut oil.\nBeat almond butter, eggs, coconut sugar, and vanilla extract together in a bowl using an electric mixer until smooth and creamy. Add cocoa powder, coconut flour, espresso powder, baking soda, cinnamon, sea salt, and baking powder to almond butter mixture and beat on low speed until incorporated. Fold chocolate chips into batter using a rubber spatula or wooden spoon. Pour batter into the prepared cake pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pork or Poultry Brine",
        "ingredients": [
            "water, as needed ADVERTISEMENT",
            "3 carrots, sliced ADVERTISEMENT",
            "3 stalks celery, sliced ADVERTISEMENT",
            "2 small onions, sliced ADVERTISEMENT",
            "1 1/2 cups kosher salt ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 lemons, sliced ADVERTISEMENT",
            "1 large green bell pepper, sliced ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with water to about 3/4-full; add carrots, celery, onions, kosher salt, brown sugar, lemon slices, bell pepper, and garlic. Bring the mixture to a boil, reduce heat to medium-low, and simmer mixture for 10 minutes.\nLet the brine cool at room temperature for 10 minutes before refrigerating to chill completely, at least 1 hour more.\nStrain brine into a separate food-safe container.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten-Free Vegan Carrot Cake",
        "ingredients": [
            "1 cup white rice flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup potato starch ADVERTISEMENT",
            "1/4 cup tapioca starch ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon xanthan gum ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon nutmeg ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained and juice reserved ADVERTISEMENT",
            "1 cup soy yogurt ADVERTISEMENT",
            "2/3 cup shredded carrots ADVERTISEMENT",
            "1/2 cup coarsely ground walnuts ADVERTISEMENT",
            "1/2 cup unsweetened coconut flakes ADVERTISEMENT",
            "1/4 cup unsweetened applesauce ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9-inch square pan.\nMix rice flour, sugar, potato starch, tapioca starch, cinnamon, baking powder, baking soda, xanthan gum, salt, and nutmeg together in a bowl. Add pineapple, 1/4 cup reserved pineapple juice, yogurt, carrots, walnuts, coconut, applesauce, vegetable oil, and vanilla extract to flour mixture; mix with a wooden spoon until well blended. Pour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 30 to 35 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dirty Girl Scout Shooter",
        "ingredients": [
            "1 fluid ounce vodka ADVERTISEMENT",
            "1 fluid ounce Irish cream liqueur (such as Bailey's®) ADVERTISEMENT",
            "1 fluid ounce creme de menthe liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice; add vodka, Irish cream liqueur, and creme de menthe. Put lid on shaker, shake to chill liquid, and strain into a shot glass.\n",
        "picture_link": "fs5O2xKgSvDk8bE//a9EcLcWSMM2hWq"
    },
    {
        "title": "Chocolate Delite",
        "ingredients": [
            "1 1/2 cups finely chopped pecans, divided ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "1/2 cup margarine, at room temperature ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 cups frozen whipped topping, thawed, divided ADVERTISEMENT",
            "8 ounces cream cheese, softened ADVERTISEMENT",
            "2 (3.5 ounce) packages instant chocolate pudding mix ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "2 tablespoons dark chocolate chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPour 2 tablespoons pecans into a small bowl; set aside. Stir remaining pecans, flour, and margarine together in a bowl; press pecan mixture into the bottom of a 9x13-inch baking dish.\nBake in the preheated oven until crust is golden, 15 to 20 minutes. Cool completely.\nBeat confectioners' sugar, 1 cup whipped topping, and cream cheese together in a bowl until smooth; spread mixture over cooled crust.\nBeat milk and pudding mix together in a bowl until thick and stiff; spread pudding over cream cheese mixture. Stir remaining whipped topping and reserved pecans together in a bowl; spread over pudding layer. Sprinkle chocolate chips over the top. Refrigerate until chilled, at least 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lamb Shoulder Vindaloo",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/8 teaspoon brown mustard seeds ADVERTISEMENT",
            "1/4 teaspoon whole black peppercorns ADVERTISEMENT",
            "1 pinch whole fenugreek seeds ADVERTISEMENT",
            "1 1/4 pounds lamb shoulder chops ADVERTISEMENT",
            "1 (3 ounce) package curry sauce (such as Sukhi's®) ADVERTISEMENT",
            "2 leaves basil, torn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Pour olive oil into hot pan and heat until shimmering. Cook mustard seeds in hot oil until they begin to pop, about 1 minute; immediately add peppercorns and fenugreek seeds.\nGently lay the lamb chops in a single layer into the skillet; add curry sauce and basil and stir. Bring the sauce to a boil, place a tight-fitting lid on the skillet, reduce heat to low, and cook until the lamb is tender, 60 to 70 minutes.\nRemove lid from skillet. Continue to cook and stir until most of the liquid has been reduced and the meat has a brownish look on all sides, 10 to 15 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mint Devil's Food Cupcakes",
        "ingredients": [
            "Cupcakes: ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1/4 cup unsalted butter ADVERTISEMENT",
            "2 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 teaspoon distilled white vinegar ADVERTISEMENT",
            "1/2 drop pure peppermint extract ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "Whipped Cream Frosting: ADVERTISEMENT",
            "2 tablespoons cold water, or more as needed ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "3 tablespoons heavy whipping cream ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon imitation vanilla extract ADVERTISEMENT",
            "1 drop green food coloring ADVERTISEMENT",
            "6 chocolate sandwich cookies (such as Oreo®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly spray 12 muffin cups.\nHeat butter and chocolate together in a small saucepan over low heat until melted, about 5 minutes. Remove from heat; set aside to cool slightly, about 5 minutes.\nCombine 1 cup plus 2 tablespoons flour, baking soda, and salt together in a small bowl.\nMix milk, vinegar, and peppermint extract together in another small bowl.\nBeat sugar and eggs together in large bowl with an electric mixer on medium speed until pale, about 3 minutes. Add melted chocolate and beat well to combine. Pour in 1/2 cup boiling water and beat until batter is well-blended. Add flour mixture; beat on low speed until incorporated. Add milk mixture and blend well. Fill muffin cups 3/4-full with batter.\nBake in the preheated oven until a toothpick inserted into a cupcake comes out clean, 25 to 30 minutes. Transfer cupcakes to wire rack and cool to room temperature, about 45 minutes.\nCombine 2 tablespoons cold water and gelatin in a small saucepan over low heat. Stir constantly until gelatin dissolves, about 5 minutes. Remove from heat and let cool slightly, but not until set, about 5 minutes.\nCombine 1 cup plus 3 tablespoons heavy cream, 1/4 cup plus 2 teaspoons confectioners' sugar, vanilla extract, and green food coloring in a large bowl. Whip with an electric mixer on low speed until slightly thickened, about 5 minutes. Beat in dissolved gelatin slowly. Increase speed to high and beat until frosting is stiff, about 3 minutes.\nSpread frosting over cooled cupcakes. Remove and discard cream filling from chocolate sandwich cookies; crush cookies. Scatter cookie crumbs over cupcakes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nutty Spinachio Soup (Ultra-Healthy)",
        "ingredients": [
            "2 slices bacon ADVERTISEMENT",
            "4 cups hot water ADVERTISEMENT",
            "1 pound fresh spinach ADVERTISEMENT",
            "1 cup natural peanut butter (such as Adams®) ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/4 teaspoon hot sauce (such as Tabasco®) (optional) ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon slices in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on a paper towel and crumble into pieces.\nPlace water, spinach, peanut butter, seasoned salt, and hot sauce in a blender. Cover and hold lid down; blend on highest setting until soup is smooth and warmed through. Let sit until bubbles float to the top, about 5 minutes.\nStrain soup into bowls through a nut milk bag or cheesecloth to avoid getting bubbles in the bowls. Stir in bacon pieces and grated Parmesan cheese; garnish bowls with additional Parmesan cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Marietta's Butterscotch Bourbon Biscotti",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1/4 cup bourbon whiskey ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour, plus more for dusting ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 cup coarsely chopped butterscotch chips ADVERTISEMENT",
            "3/4 cup coarsely chopped pecans ADVERTISEMENT",
            "1 egg, beaten (for egg wash) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk sugar and 3 eggs together in a large bowl until light and fluffy. Mix in butter, bourbon, and vanilla extract.\nSift flour and baking powder together in a small bowl; add to egg mixture and stir until smooth dough forms. Fold in butterscotch chips and pecans.\nTurn dough out onto a lightly floured work surface; divide into 4 equal pieces. Roll each piece into 2-inch wide by 9-inch long log; place on baking sheet. Brush logs with beaten egg.\nBake in preheated oven until pale golden, about 25 minutes. Cool until firm, about 15 minutes.\nCut each log diagonally into 1-inch thick slices on a work surface; place slices, cut-side down, on baking sheet.\nBake in oven until tops are golden, about 10 minutes. Invert slices and bake until tops are golden, about 10 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Moroccan Sardine Meatballs",
        "ingredients": [
            "1 (4 ounce) can sardines, drained ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons dry bread crumbs ADVERTISEMENT",
            "1/2 teaspoon ground paprika ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can canned diced tomatoes ADVERTISEMENT",
            "2 tablespoons ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sardines in a food processor; puree until smooth. Add eggs, bread crumbs, paprika, turmeric, ginger, garlic powder, onion powder, salt, and black pepper. Pulse briefly until well-combined. Shape mixture into small balls.\nHeat oil in a large skillet over medium heat. Add onion and garlic; cook and stir until fragrant, about 5 minutes. Stir in tomatoes, coriander, and cumin. Reduce heat, cover, and simmer sauce until flavors combine, about 15 minutes. Stir in meatballs and simmer until heated through, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peanut Butter Cookies (Grain Free)",
        "ingredients": [
            "2 cups creamy natural peanut butter ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup coconut flour ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix peanut butter, 1 cup plus 2 tablespoons honey, eggs, coconut flour, vanilla extract, and baking soda together in a large bowl until cookie dough is well-combined.\nDrop teaspoonfuls of cookie dough onto ungreased baking sheets, spacing them about 2 inches apart.\nBake in the preheated oven until golden, about 15 minutes. Use a fork to press a crisscross pattern into cookies immediately after removing from the oven.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vietnamese Crispy Fish",
        "ingredients": [
            "2 (1 pound) whole red snapper ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "1/4 cup vegetable oil, divided ADVERTISEMENT",
            "6 tomatoes, seeded and coarsely chopped ADVERTISEMENT",
            "2 bird's eye chiles, seeded and finely sliced ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "6 tablespoons water ADVERTISEMENT",
            "2 tablespoons Asian fish sauce (nam pla) ADVERTISEMENT",
            "1 tablespoon palm sugar ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "2 tablespoons coarsely chopped cilantro ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut heads off each snapper and score skin on each side; sprinkle with sea salt.\nHeat 2 tablespoons vegetable oil in a large skillet over medium heat. Add snapper and pan-fry until skin is brown and crispy and flesh flakes easily with a fork, 6 to 8 minutes per side. Place snapper on a serving platter and return skillet to stove top.\nCook remaining oil, tomatoes, chiles, and garlic over high heat in a skillet until tomatoes soften, 2 to 3 minutes. Add water, fish sauce, and palm sugar; simmer until mixture is reduced slightly, 1 to 2 minutes. Stir in green onions, cilantro, and cornstarch; simmer until mixture is reduced to a sticky-sauce consistency, about 1 minute more. Pour sauce over fish to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Red Devil's Food Cake",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking dish.\nBeat sugar, cocoa powder, and shortening together in a large bowl with an electric mixer until light and fluffy. Beat in 1 egg at a time until smooth. Sift 2 cups flour, baking soda, and salt together in a separate bowl. Add portions of flour mixture and milk alternately, beating well after each addition. Stir in boiling water and vanilla extract to form a thin batter. Pour batter into prepared baking dish.\nBake in preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes. Cool in the baking dish for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rabo Encendido (Cuban Oxtail Stew)",
        "ingredients": [
            "1 1/2 cups vino seco (white cooking wine) ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 pounds beef oxtails ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "2 potatoes, peeled and quartered ADVERTISEMENT",
            "2 cups diced onion ADVERTISEMENT",
            "1 cup diced carrots ADVERTISEMENT",
            "6 cloves garlic, coarsely chopped ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup green olives, pitted and halved ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "2 teaspoons Miami-style sazon seasoning (sazon completa) ADVERTISEMENT",
            "1/2 (.18 ounce) packet sazon seasoning (such as Sa-Son Accent®) ADVERTISEMENT",
            "1/2 teaspoon allspice ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk vino seco, 1/4 cup olive oil, and salt together in a large bowl. Add oxtails and mix well to coat. Cover with plastic wrap and marinate in the refrigerator for 12 hours.\nDrain oxtails, discarding all but 1/2 cup of the marinade.\nHeat 1 tablespoon olive oil in a large pot over medium-high heat and sear oxtails until browned on all sides, about 2 minutes per side. Transfer to a large plate. Heat remaining 1 tablespoon olive oil in the same pot. Saute potatoes, onion, and carrots until onions are translucent, about 5 minutes.\nMash garlic and 1/2 teaspoon salt into a coarse paste in a mortar and pestle. Add garlic paste to the pot; stir until fragrant, about 30 seconds. Stir in green olives, bay leaves, sazon completa, sazon seasoning, and allspice. Pour in reserved marinade, tomato sauce, and chicken broth.\nReturn oxtails to the pot. Bring to a boil, reduce heat, and simmer, covered, until oxtails are fork tender and falling off the bone, about 4 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Cashew Sour Cream ",
        "ingredients": [
            "1 cup unsalted raw cashews ADVERTISEMENT",
            "1/4 cup water, or as needed ADVERTISEMENT",
            "2 teaspoons apple cider vinegar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cashews in a bowl and cover with water. Soak until soft, at least 4 hours but preferably overnight.\nDrain and rinse cashews; place in the bowl of a food processor. Add apple cider vinegar, salt, garlic powder, and onion powder. Blend until smooth and creamy, occasionally scraping down bowl sides with a spatula, 3 to 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick and Easy Buffalo Tofu Appetizer",
        "ingredients": [
            "1 (12 ounce) package extra-firm tofu ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup bread crumbs, or more as needed ADVERTISEMENT",
            "olive oil, or more as needed ADVERTISEMENT",
            "1 (12 ounce) bottle Buffalo-style hot pepper sauce (such as Frank's®) ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/2 cup blue cheese salad dressing (optional) ADVERTISEMENT",
            "2 stalks celery, cut into 2-inch lengths (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tofu onto a plate and place another plate on top. Set a 3 to 5 pound weight on top; press tofu until water is extracted and tofu is firmer, about 15 minutes. Drain and discard the accumulated liquid. Slice tofu into 1-inch wide by 4-inch long pieces.\nWhisk egg in a small bowl. Pour breadcrumbs into separate shallow bowl. Dip tofu pieces into beaten egg and press into bread crumbs. Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Place the breaded tofu pieces onto a plate while breading the rest; do not stack.\nHeat olive oil in a large skillet over medium heat. Fry tofu in a single layer, browning completely on each side before turning, about 3 minutes per side. Place fried tofu on serving platter.\nCombine hot pepper sauce and butter in a bowl; pour over fried tofu. Serve with blue cheese dressing and celery pieces.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Turmeric Stir-Fried Pork",
        "ingredients": [
            "1 pound boneless pork loin, thinly sliced ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "1/4 onion, sliced ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 (16 ounce) bag frozen stir-fry vegetables ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat pork slices with turmeric and salt. Mix in 1 tablespoon olive oil; set aside to marinate, 15 minutes.\nHeat a wok or large skillet over high heat. Pour in remaining 3 tablespoons olive oil and heat until shimmering. Add pork slices to the wok in an even layer and let cook, without stirring, until juices run, 2 to 3 minutes. Toss and stir pork until opaque, about 2 minutes more.\nPush pork to the sides of the wok and let juices and oil flow back to the center of the wok and heat up, 10 to 15 seconds. Stir the pork back into the hot oil until sizzling, 2 to 3 minutes. Repeat this process twice more, until pork is golden brown.\nPush pork to the sides of the wok; add onion. Cook and stir until onion is translucent, about 5 minutes. Add Worcestershire sauce and toss to coat onions. Mix pork back into the onion mixture. Add the frozen vegetables and cook until tender, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Potato Tempura",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup ice water ADVERTISEMENT",
            "3 tablespoons ice water ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 cups oil for frying ADVERTISEMENT",
            "1 sweet potato, scrubbed and sliced into 1/8-inch slices ADVERTISEMENT",
            "Dipping Sauce: ADVERTISEMENT",
            "1/4 cup rice wine ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs in a large bowl until frothy. Stir in salt, 3/4 cup plus 3 tablespoons ice water, and 1 cup plus 1 tablespoon flour until just incorporated but batter is still very lumpy.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nDry sweet potato slices well. Dip 3 slices at a time in the batter, letting excess batter drip back into the bowl. Fry until golden brown, turning once, about 2 minutes per side. Lift out with a slotted spoon onto a cooling rack set over paper towels. Repeat with remaining slices.\nWhisk rice wine and soy sauce together in a small bowl to make dipping sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Persimmon, Pomegranate, and Massaged Kale Salad",
        "ingredients": [
            "Maple-Roasted Macademia Nuts: ADVERTISEMENT",
            "1/2 cup raw macadamia nuts ADVERTISEMENT",
            "2 tablespoons maple syrup, divided ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon maple syrup ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "Salad ADVERTISEMENT",
            "2 bunches kale, stemmed and torn into pieces ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 ripe Fuyu persimmon, peeled and thinly sliced ADVERTISEMENT",
            "1/4 cup pomegranate seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nToss macademia nuts with 1 tablespoon maple syrup and pinch of salt; spread on baking sheet.\nToast macademia nuts in the preheated oven until lightly golden, about 5 minutes. Remove from oven and coat with 1 tablespoon maple syrup.\nWhisk orange juice, lemon juice, 1 tablespoon maple syrup, and ground black pepper together in a small bowl to make dressing.\nPlace kale pieces, 1 tablespoon olive oil, and 1/2 teaspoon salt in a large bowl; massage with your hands until kale is tender, 3 to 5 minutes. Add persimmon slices and dressing and toss to mix. Top with pomegranate seeds and maple-roasted macademia nuts.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Thai Shrimp and Clam Curry",
        "ingredients": [
            "2 tablespoons peanut oil ADVERTISEMENT",
            "1 large onion, halved and sliced lengthwise ADVERTISEMENT",
            "1 large red bell pepper, seeded and sliced lengthwise ADVERTISEMENT",
            "1 tablespoon chopped fresh ginger ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon red chile paste, or more to taste ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "4 large fresh cherrystone clams, scrubbed ADVERTISEMENT",
            "1/4 cup chicken broth, or more as needed (optional) ADVERTISEMENT",
            "1 fresh lime ADVERTISEMENT",
            "1 teaspoon fish sauce ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "3 tablespoons chopped fresh basil, divided, or more to taste ADVERTISEMENT",
            "12 large shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat peanut oil in a large saucepan over medium-high heat. Add onion and red bell pepper; saute until softened, about 4 minutes. Reduce heat to medium. Add ginger and garlic; cook and stir until fragrant, 1 to 2 minutes. Stir in red chile paste and coconut milk. Add the clams and simmer until flavors combine, 3 to 5 minutes. If curry appears too thick, stir in chicken broth.\nFinely grate zest from the lime. Stir half of the zest into the curry along with fish sauce and brown sugar. Squeeze some lime juice into the curry. Stir in half of the basil and shrimp; simmer curry until shrimp are opaque and cooked through, 5 to 10 minutes. Thin the curry with more chicken broth if needed.\nScoop clams out of the curry, draining their juice back into the saucepan, and discard. Mix in remaining lime zest and basil before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Acai Pomtini",
        "ingredients": [
            "1 fluid ounce citron vodka ADVERTISEMENT",
            "1 fluid ounce orange-flavored liqueur (such as Cointreau®) ADVERTISEMENT",
            "1 fluid ounce raspberry-flavored liqueur (such as Chambord®) ADVERTISEMENT",
            "1 fluid ounce acai-pomegranate juice ADVERTISEMENT",
            "1 tablespoon freshly squeezed lime juice ADVERTISEMENT",
            "4 ice cubes ADVERTISEMENT",
            "3 seedless red grapes, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour vodka, orange-flavored liqueur, raspberry-flavored liqueur, acai-pomegranate juice, and lime juice over ice cubes in a cocktail shaker; cover and shake until well-chilled. Strain into a martini glass and garnish with 3 grapes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Holiday Hot Buttered Rum Batter",
        "ingredients": [
            "1/2 cup salted butter, at room temperature ADVERTISEMENT",
            "3 tablespoons pure maple syrup ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon rum extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine butter, maple syrup, pumpkin pie spice, rum extract, and cinnamon in a small bowl. Blend with a wooden spoon or electric mixer until thoroughly mixed and smooth. Cover with plastic wrap and refrigerate, 8 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten-Free Black-Eyed Pea and Cauliflower Soup",
        "ingredients": [
            "1/2 pound bacon, sliced into small pieces ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large white onion, chopped ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "8 cups chicken broth ADVERTISEMENT",
            "2 (19 ounce) cans black-eyed peas, rinsed and drained ADVERTISEMENT",
            "1 head cauliflower, broken into small florets ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large pot and cook over medium heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon pieces on paper towels.\nHeat olive oil over medium heat in the same pot. Add onion, garlic, and thyme; cook and stir until onion is softened, about 10 minutes. Stir in wine; cook until slightly reduced, about 4 minutes. Add chicken broth, black-eyed peas, and cauliflower florets. Season with black pepper. Bring to a boil. Reduce heat, cover, and simmer soup until flavors combine, about 20 minutes.\nRemove soup from heat and let cool briefly, about 10 minutes. Puree soup with an immersion blender until smooth. Top with bacon pieces.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Buffalo Turkey Meatloaf",
        "ingredients": [
            "Meatloaf: ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 (20 ounce) package ground turkey ADVERTISEMENT",
            "1 small onion, grated ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "Buffalo Sauce: ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1 teaspoon onion powder, or to taste ADVERTISEMENT",
            "Blue Cheese Dressing: ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup blue cheese crumbles ADVERTISEMENT",
            "1/2 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1/2 teaspoon onion powder, or to taste ADVERTISEMENT",
            "1 pinch black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking pan with aluminum foil; spray lightly with cooking spray.\nCombine ground turkey, grated onion, salt, and black pepper in a large bowl; mix to combine. Transfer turkey mixture to baking pan and shape into a loaf.\nBake meatloaf in the preheated oven until light golden, about 40 minutes.\nMelt butter in a small saucepan over low heat. Stir in hot pepper sauce, 1 teaspoon garlic powder, and 1 teaspoon onion powder. Pour evenly over meatloaf.\nReturn meatloaf to the oven and cook until flavors are absorbed, about 5 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nCombine sour cream, mayonnaise, and blue cheese crumbs in a bowl to make blue cheese dressing. Season with 1/2 teaspoon garlic powder, 1/2 teaspoon onion powder, and black pepper. Serve alongside meatloaf.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten Free Autumn Squash Soup",
        "ingredients": [
            "1 (12 ounce) box Barilla® Gluten Free Elbows ADVERTISEMENT",
            "4 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "2 Granny Smith apples, diced ADVERTISEMENT",
            "1 tablespoon dried sage ADVERTISEMENT",
            "1/4 teaspoon nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "3 quarts low-sodium chicken broth ADVERTISEMENT",
            "1 small butternut squash, diced ADVERTISEMENT",
            "1/4 cup unsalted pumpkin seeds ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large soup pot, saute apples with olive oil, onion, sage, nutmeg, cinnamon and cloves for 4-5 minutes or until slightly softened. Season with salt and pepper. Add milk, chicken broth and squash and bring the mixture to a simmer.\nCook for approximately 15 minutes or until the squash is nice and soft.\nIn a blender, puree the soup in small batches to achieve a nice, smooth consistency. When finished, transfer the soup back to the pot and bring it back to simmer. Season with salt and pepper.\nAdd the uncooked pasta to the soup and continue to cook for half the amount of time suggested on the pasta package - while stirring frequently.\nSet the soup aside and let it rest for 25-30 minutes.\nIn a small skillet, toast the pumpkin seeds over medium heat for approximately 5 minutes, or until they are slightly golden.\nSprinkle the pumpkin seeds over each bowl before serving.\n",
        "picture_link": "j1i/MaPCvpuGIJcTMInekAg/dBuUMwi"
    },
    {
        "title": "Chocolate Nutty Energy Bites",
        "ingredients": [
            "1 cup oats ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "1/3 cup pumpkin seeds ADVERTISEMENT",
            "1/3 cup chopped dried Black Mission figs ADVERTISEMENT",
            "1/3 cup chopped dried apricots ADVERTISEMENT",
            "1/4 cup cocoa nibs ADVERTISEMENT",
            "2 tablespoons chia seeds ADVERTISEMENT",
            "2 tablespoons flax seeds ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 pinch ground cardamom ADVERTISEMENT",
            "1 cup cashew butter ADVERTISEMENT",
            "1/4 cup yacon syrup ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 pinch unsweetened cocoa powder, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oats, chocolate chips, pecans, pumpkin seeds, dried figs, dried apricots, cocoa nibs, chia seeds, flax seeds, pumpkin pie spice, and cardamom together in a large bowl. Add cashew butter, yacon syrup, and vanilla extract; stir well to combine.\nPlace bowl in refrigerator to allow mixture to set, about 30 minutes. Remove mixture from refrigerator and scoop bite-size spoonfuls onto a plate; dust with cocoa powder.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Srnci Hrbet: Czech Dessert",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "3 tablespoons rum, or as needed ADVERTISEMENT",
            "4 1/2 tablespoons ground walnuts ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 1/2 tablespoons white sugar ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour rum over ground walnuts in a small bowl; soak for 1 hour.\nGrease and flour a 9-inch log mold.\nMix 1/3 cup butter and 1/2 cup plus 2 1/2 tablespoons sugar together with an electric mixer in a large bowl; beat in egg yolks until light and fluffy. Add milk, flour, cocoa powder, and baking powder; mix until smooth a batter forms.\nWhisk egg whites in a separate bowl until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds.\nSpoon 1/3 of the egg whites into batter using a rubber spatula. Gently run spatula around the edges of the mixture lifting the bottom up and over the center, repeating until well incorporated. Add remaining egg whites, folding just until blended.\nPour batter into prepared log mold and place in cold oven (not preheated).\nSet oven to 300 degrees F (150 degrees C); bake for 15 minutes. Increase oven to 375 degrees F (190 degrees C); bake until top springs back when lightly pressed, 25 to 30 minutes more.\nCool cake in the pan for 15 minutes before transferring to a wire rack to cool completely, about 30 minutes more.\nBlend 3/4 cup plus 2 tablespoons butter and 1/2 cup sugar together with walnut and rum mixture. Transfer cooled cake to serving platter; cut in half lengthwise. Spread walnut mixture evenly over bottom half of cake; replace cake top; slice vertically to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Basil Pesto Risotto with Pan-Roasted Scallops",
        "ingredients": [
            "Pesto: ADVERTISEMENT",
            "1 cup fresh basil leaves ADVERTISEMENT",
            "1 cup fresh spinach ADVERTISEMENT",
            "1/4 cup pine nuts ADVERTISEMENT",
            "2 tablespoons olive oil, or to taste ADVERTISEMENT",
            "1 tablespoon grated fresh Parmesan cheese, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "Risotto: ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons chopped shallots ADVERTISEMENT",
            "1 cup Arborio rice ADVERTISEMENT",
            "1 pinch saffron (optional) ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "1/3 cup grated fresh Parmesan cheese ADVERTISEMENT",
            "Scallops: ADVERTISEMENT",
            "4 sea scallops ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place basil, spinach, and pine nuts in the bowl of a food processor and pulse to chop. Add 2 tablespoons olive oil in a steady stream until pesto is creamy, stopping to scrape down sides. Stir in 1 tablespoon Parmesan cheese and black pepper with a spoon.\nHeat chicken stock and water in separate saucepans over medium heat until simmering, about 5 minutes; reduce heat, cover, and keep warm.\nMelt 2 tablespoons butter in a large saucepan over medium heat until foamy. Add shallots; cook and stir until soft, about 5 minutes. Add rice and saffron; stir until coated with butter. Pour in wine and simmer until absorbed, about 5 minutes.\nPour enough warm stock into the saucepan to barely cover the rice; cook and stir until absorbed. Continue adding stock, and then water, stirring constantly, until each addition is absorbed and rice is tender yet firm to the bite and risotto is thick and creamy, about 20 minutes.\nSpoon pesto into risotto. Remove saucepan from heat; stir in 1/3 cup Parmesan cheese.\nPat scallops dry with paper towels and season with salt and pepper.\nMelt 2 tablespoons butter with 1 tablespoon olive oil in a skillet over medium heat. Arrange scallops in the hot skillet and cook, without touching, until deep golden brown underneath, about 2 minutes. Flip each scallop and sear on the second side until golden brown, about 2 minutes more.\nServe scallops over risotto.\n",
        "picture_link": "iH7vB/dRFYfVgv//hdKoMBmZk9g9CAW"
    },
    {
        "title": "Babicka's Walnut Cake",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "5 tablespoons ground walnuts ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "Cream Filling: ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup white sugar, or to taste ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 tablespoons cocoa powder, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 320 degrees F (160 degrees C). Grease a 9-inch square baking dish.\nBeat eggs and 3/4 cup plus 2 tablespoons sugar in a large bowl using an electric mixer fitted with the whisk attachment until smooth. Carefully add 1/2 cup plus 3 tablespoons flour, ground walnuts, and baking powder; mix batter thoroughly until there are no lumps. Pour batter into the baking dish.\nBake cake in the preheated oven until barely set, about 5 minutes. Increase oven temperature to 375 degrees F (190 degrees C) and bake until golden, 25 to 30 minutes. Let it cool for a few minutes in the baking dish before transferring it to a wire rack to cool completely, about 45 minutes.\nBeat butter, 1/2 cup white sugar, and egg yolk together in a bowl with the electric mixer until creamy and smooth. Add cocoa powder to cream filling and mix to combine.\nCut the cooled cake carefully in half horizontally. Place one layer on a serving plate and spread half of the cream filling on it. Top with the second layer. Scoop the rest of the filling onto the cake and smooth evenly over the top, letting excess filling drip down the sides.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cranberry Sweet Potato Spice Cake",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 cups cooked mashed sweet potatoes ADVERTISEMENT",
            "1 1/2 cups sweetened dried cranberries (such as Craisins®) ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round baking pans.\nSift flour, baking soda, baking powder, cinnamon, nutmeg, and salt together in a bowl.\nBeat butter and sugar together in a separate large bowl with an electric mixer until light and fluffy. Beat one egg at a time into the butter mixture; add molasses and vanilla extract with last egg. Add sweet potatoes, cranberries, and walnuts; mix until batter is thoroughly combined. Gradually beat flour mixture into batter until thoroughly combined. Pour batter into prepared baking pans.\nBake in preheated oven until a toothpick inserted into the center comes out clean, about 1 hour 10 minutes. Cool in the pans for 10 minutes before turning out onto wire rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Skillet Turkey with Bacon and White Wine",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons herbes de Provence ADVERTISEMENT",
            "6 slices bacon, diced ADVERTISEMENT",
            "3 pounds turkey thighs or legs with skin ADVERTISEMENT",
            "2 shallots, thinly sliced ADVERTISEMENT",
            "1 tablespoon olive oil, or more as needed ADVERTISEMENT",
            "1 tablespoon butter, or more as needed ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 1/2 cups chicken stock ADVERTISEMENT",
            "Chopped fresh parsley for garnish ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F. Mix the flour with salt, pepper and herbes de Provence and set aside.\nHeat a large ovenproof Dutch oven or cast-iron skillet over medium-high heat. Fry bacon for 5-8 minutes, stirring occasionally. When fat has rendered, remove bacon to a bowl with a slotted spoon. Leave bacon grease in the pan.\nCoat each piece of turkey in the flour mixture and transfer to the hot pan. Pan fry the turkey for a few minutes on each side, until crisped and golden brown on the outside (but not cooked through). Remove the turkey from the pan and set aside on a plate. Cover with foil.\nAdd the shallots to the pan with a tablespoon of olive oil and butter. Saute for 5-10 minutes, until soft, fragrant and golden brown. Add the wine slowly, stirring to get all the browned bits from the bottom of the pan. Add the chicken stock and let it simmer until it reduces, about 5-10 minutes.\nAdd the turkey and bacon back to the pan. Cut a tablespoon of butter into small pieces and place over the top of the turkey thighs.\nTransfer the pan to the oven. Bake for 30-40 minutes, basting every 15 minutes with the pan sauce. If the turkey is browning too quickly, cover with foil while baking. Remove from oven when a meat thermometer reads 165 degrees F to indicate it is fully cooked. Remove from oven and let rest for 10-15 minutes.\n",
        "picture_link": "ZyXNoOISbuiugm3s04q0LIY5AYS6Hny"
    },
    {
        "title": "Roasted Beet and Chickpea Salad",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "3 beets, washed and trimmed ADVERTISEMENT",
            "1 ear fresh corn in the husk ADVERTISEMENT",
            "2 (15 ounce) cans chickpeas, rinsed and drained ADVERTISEMENT",
            "1 cup grape tomatoes ADVERTISEMENT",
            "1 cup sliced romaine lettuce, or more to taste ADVERTISEMENT",
            "1/3 cup shelled edamame ADVERTISEMENT",
            "2 stalks celery, finely chopped ADVERTISEMENT",
            "1 carrot, finely chopped ADVERTISEMENT",
            "Vinaigrette: ADVERTISEMENT",
            "1 lime, zested and juiced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 green onion, sliced ADVERTISEMENT",
            "1 small garlic clove, minced, or more to taste ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon salt, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Wrap beets tightly in aluminum foil.\nRoast beets in the preheated oven until tender and easily pierced with a knife, about 1 hour.\nCut off the top and bottom 1/2-inch of the corn ear. Moisten with water and place on a microwave-safe dish. Cook in the microwave on high, 3 to 4 minutes. Let cool until easily handled, about 5 minutes. Slide husk off the cob and cut off the kernels with a sharp knife.\nCombine corn, chickpeas, tomatoes, lettuce, edamame, celery, and carrot in a large bowl.\nWhisk lime zest, lime juice, olive oil, green onion, garlic, cumin, chili powder, and salt in a small bowl until well-combined. Pour vinaigrette over chickpea mixture. Refrigerate salad until beets are ready.\nUnwrap beets and cool until easily handled, about 10 minutes. Peel, dice, and stir into salad. Chill 1 hour to overnight to develop flavors.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pecan, Lemon, Ginger, Hemp, and Chia Scones",
        "ingredients": [
            "2 lemons ADVERTISEMENT",
            "1 tablespoon water, or as needed (optional) ADVERTISEMENT",
            "1/4 cup coconut milk ADVERTISEMENT",
            "2 tablespoons chia seeds ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup coconut oil, chilled ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons cream of tartar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup finely chopped pecans ADVERTISEMENT",
            "1/4 cup hemp seed hearts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nZest lemons. Juice lemons into a measuring cup, adding water as needed, until 7 tablespoons liquid is reached. Combine lemon zest, lemon juice, coconut milk, chia seeds, and vanilla extract together in a bowl; set aside to thicken, about 10 minutes.\nDice chilled coconut oil on a work surface. Combine flour, sugar, cream of tartar, baking soda, ground ginger, and salt together in the bowl of a food processor; pulse to combine. Add coconut oil and pulse just until mixture resembles coarse crumbs. Add coconut milk mixture and pulse just until dough begins to clump and form a ball.\nTurn dough out onto a lightly floured work surface; gently knead in pecans and hemp seeds to distribute. Separate dough into 2 equal portions; pat or roll each into a 1-inch thick round. Cut into 8 wedge-shaped pieces and place onto the prepared baking sheet.\nBake in preheated oven until tops spring back when lightly pressed, 25 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Eggplant Mirza",
        "ingredients": [
            "4 Japanese eggplants ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, diced, or to taste ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "5 Roma tomatoes, diced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil. Prick the skin of the eggplants in several places and place on the baking sheet.\nBroil eggplants in the preheated oven, turning occasionally, until charred on all sides and completely tender when pierced with a fork, about 20 minutes. Remove from oven and allow to cool until easy to handle, about 15 minutes. Remove eggplants' stems and peel; dice flesh.\nMelt butter in a large skillet over medium-low heat. Add onion and garlic; cook and stir until onion is translucent, about 5 minutes. Stir in tomatoes and cook until soft, about 5 minutes. Stir in diced eggplant, salt, and pepper. Pour eggs over vegetables and mix until scrambled and no longer runny, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rhubarb Chili",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "3 cups chopped fresh rhubarb (1/2-inch pieces) ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 large red bell pepper, chopped ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 1/2 pounds ground turkey ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/8 teaspoon ground cayenne pepper ADVERTISEMENT",
            "2 (15 ounce) cans black beans, rinsed and drained ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "1 cup frozen white corn ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Add rhubarb, onion, red bell pepper, and salt; cook and stir until tender, about 5 minutes. Add ground turkey and garlic and cook until turkey starts to brown, about 5 minutes.\nStir chili powder, cocoa powder, white sugar, cumin, cinnamon, allspice, and cayenne pepper into the pot; cook and stir for 3 minutes. Add blacks beans, diced tomatoes, and corn; mix well to combine. Bring chili to a boil, reduce heat and simmer, covered, until thickened and flavors are combined, about 30 minutes. Season with salt and black pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mighty Granola",
        "ingredients": [
            "8 cups rolled oats ADVERTISEMENT",
            "1 cup amaranth ADVERTISEMENT",
            "1 cup sunflower seeds ADVERTISEMENT",
            "1 cup finely chopped pecans ADVERTISEMENT",
            "1 cup finely chopped walnuts ADVERTISEMENT",
            "1 cup sliced almonds ADVERTISEMENT",
            "1 cup flaxseed meal ADVERTISEMENT",
            "1 cup ground chia seeds ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 cup maple syrup ADVERTISEMENT",
            "1 cup coconut oil ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "1 cup dried cherries ADVERTISEMENT",
            "1/2 cup dried blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line two baking sheets with parchment paper.\nCombine oats, amaranth, sunflower seeds, pecans, walnuts, almonds, flaxseed meal, and ground chia seeds in a very large bowl; stir until thoroughly mixed.\nMix honey, maple syrup, coconut oil, brown sugar, butter, vanilla extract, cinnamon, and salt together in a large saucepan over medium heat. Bring to a boil, stirring constantly. Cook and stir, about 1 minute. Remove maple syrup mixture from heat.\nPour maple syrup mixture over oat mixture in the bowl; stir until oat mixture is moist. Spread evenly on the baking sheets.\nBake in the preheated oven until toasted, stirring mixture halfway through, about 20 minutes. Remove from oven and let cool, about 5 minutes. Transfer to a very large bowl. Add raisins, cherries, and blueberries; stir until thoroughly mixed.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fish Baked en Croute de Sel (Fish Baked in a Salt Crust)",
        "ingredients": [
            "2 pounds salt ADVERTISEMENT",
            "7 bay leaves ADVERTISEMENT",
            "2 pounds whole rainbow trout, gutted and cleaned, heads and tails still on ADVERTISEMENT",
            "2 sprigs fresh cilantro, or more to taste ADVERTISEMENT",
            "2 sprigs fresh parsley, or more to taste ADVERTISEMENT",
            "2 sprigs fresh dill, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nSpread 1/4 to 1/2 pound of salt on the aluminum foil in the approximate shape of the fish. Lay bay leaves on top of the salt. Place fish on top. Stuff fish cavity with cilantro, parsley, and dill. Pack down remaining salt firmly over fish, leaving head and tail exposed.\nBake in the preheated oven until salt crust is golden, about 30 minutes.\nTake fish out of oven. Carefully crack open the salt crust; remove top. Peel skin off the fish to expose flesh. Lift the top fillet off the bones using a fish knife or spatula. Remove bones in one piece by lifting from the tail and pulling upwards toward the head. Lift the bottom fillet out with the knife or spatula.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sourdough Amaranth Wheat English Muffins",
        "ingredients": [
            "1 1/2 cups whole wheat flour, divided ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup sourdough starter ADVERTISEMENT",
            "1/2 cup amaranth flour ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "3 tablespoons cornmeal, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1 cup whole wheat flour, water, and sourdough starter in a large bowl. Stir thoroughly and cover with a clean towel. Let sit until spongy, 7 hours to 1 day.\nStir remaining 1/2 cup whole wheat flour, amaranth flour, honey, baking soda, and salt into the starter mixture. Mix in all-purpose flour, 1/2 cup at a time, until the dough is no longer sticky. Knead gently until dough is smooth and elastic.\nRoll out dough on a floured work surface to 1/2-inch thickness. Cut into rounds with a 2 1/2-inch biscuit cutter. Sprinkle some cornmeal over a baking sheet. Transfer rounds to the baking sheet; sprinkle tops with remaining cornmeal. Cover with a clean towel and let rise until puffy, about 45 minutes.\nHeat a large skillet over medium heat. Place rounds into hot skillet and lower heat to medium-low. Cook until golden brown and edges look dry, about 6 minutes per side. Transfer to a wire rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Breakfast Muesli",
        "ingredients": [
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup peanuts ADVERTISEMENT",
            "1/2 cup almonds ADVERTISEMENT",
            "1/2 cup coconut flakes ADVERTISEMENT",
            "1/2 cup bran ADVERTISEMENT",
            "1/2 cup pumpkin seeds ADVERTISEMENT",
            "1/2 cup chia seeds (optional) ADVERTISEMENT",
            "1/2 cup sesame seeds ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 cup golden raisins (sultanas) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Line a baking sheet with parchment paper.\nMix oats, peanuts, almonds, coconut flakes, bran, pumpkin, chia, sesame, and sunflower seeds in a large bowl.\nPlace oil, honey, and sugar in a small saucepan over medium heat; heat until boiling. Pour over oat mixture and stir well to combine. Spread muesli out onto baking sheet.\nBake muesli in the preheated oven, stirring every 10 minutes, until golden, about 40 minutes total. Remove from oven and cool, about 30 minutes. Stir in golden raisins and store in a sealed container.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pumpkin Crunch Pie",
        "ingredients": [
            "Pie: ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 (9 inch) graham cracker crust ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 cup coconut flakes ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix pumpkin puree, eggs, cream, 1/2 cup honey, ginger, cinnamon, nutmeg, cloves, and salt together in a bowl until smooth. Pour filling into pie crust.\nBake pie in the preheated oven until filling is almost set and edges are beginning to brown, 50 to 60 minutes. Remove pie from oven.\nMelt butter in a saucepan over low heat; stir in 1/4 cup honey. Add coconut and almonds; toss to combine. Spread over pie.\nPlace pie back in the oven and bake until topping is toasted and golden, about 10 to 15 minutes more.\nRemove pie from oven and allow to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raw Vegan Beet Slaw with Mint",
        "ingredients": [
            "3 1/2 cups coconut vinegar ADVERTISEMENT",
            "5 teaspoons unpasteurized miso ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 beets, peeled and grated ADVERTISEMENT",
            "3/4 cup goji berries ADVERTISEMENT",
            "1 fennel bulb, thinly sliced ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "2/3 cup chopped fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk vinegar, miso, and ground black pepper together in a large bowl. Add beets, goji berries, fennel, green onions, and mint; toss to combine.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Almond Truffles ",
        "ingredients": [
            "1 cup raw almonds ADVERTISEMENT",
            "5 Medjool dates, pitted and chopped ADVERTISEMENT",
            "2 teaspoons coconut oil ADVERTISEMENT",
            "1 cup raw cocoa powder ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3 tablespoons agave nectar, or more to taste ADVERTISEMENT",
            "2 teaspoons chia seeds ADVERTISEMENT",
            "2 teaspoons flax seeds ADVERTISEMENT",
            "2 tablespoons raw cocoa powder, or as needed ADVERTISEMENT",
            "Himalayan pink salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place almonds in the bowl of a food processor and grind into a fine flour. Add dates and blend until incorporated.\nPlace coconut oil in a large microwave-safe bowl and melt in the microwave, about 10 seconds. Add almond and date mixture, 1 cup cocoa powder, water, agave nectar, chia seeds, and flax seeds and mix with a wooden spoon or spatula to form a stiff dough.\nPlace 2 tablespoons cocoa powder and salt in shallow bowls. Line a baking sheet with parchment paper.\nRoll tablespoon-sized balls of dough with your hands. Coat with cocoa powder and then dip lightly in salt before placing on baking sheet. Chill or freeze until firm before storing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Butternut Crostini with Radicchio and Blue Cheese",
        "ingredients": [
            "1 (1 1/2) pound butternut squash ADVERTISEMENT",
            "Extra virgin olive oil ADVERTISEMENT",
            "Sea salt to taste ADVERTISEMENT",
            "Ground black pepper to taste ADVERTISEMENT",
            "1/4 cup creme fraiche ADVERTISEMENT",
            "1/4 teaspoon smoked paprika ADVERTISEMENT",
            "1 French baguette ADVERTISEMENT",
            "1 medium head radicchio ADVERTISEMENT",
            "2 tablespoons balsamic glaze (reduced balsamic vinegar) ADVERTISEMENT",
            "1/2 cup crumbled blue cheese, plus more for garnish ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F. Line 2 baking sheets with Reynolds Wrap(R) Aluminum Foil. Set aside.\nCut the squash in half lengthwise and remove the seeds. Brush the flesh with a thin coat of olive oil. Set the squash cut side up on the prepared tray. Sprinkle with salt and pepper and roast for 40 minutes until the squash is fork tender. Remove to cool completely.\nOnce cool, scoop the flesh into a bowl. Add the creme fraiche, paprika, and a pinch each of salt and pepper. Mash with a fork until completely smooth. This much can be done up to three days in advance.\nCut the baguette into 1/2-inch slices on a diagonal. Spread them on the second foil-lined baking sheet. Brush the tops with a thin coat of olive oil. Bake on the middle rack for 6 minutes until the edges are just browned.\nCut the radicchio into thin ribbons. Toss with olive oil, balsamic glaze and a pinch of salt and pepper. Adjust seasoning and dressing to taste. Spread a couple tablespoons of the squash mash on top of each crostini. Top with the radicchio slaw and a sprinkle of blue cheese for garnish.\n",
        "picture_link": "Ux0akgz6jX0exQ6C1j5dvn3YwRogwFO"
    },
    {
        "title": "Soft Royal Icing",
        "ingredients": [
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/4 cup water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat sugar and egg whites in a large bowl using an electric mixer on low speed until evenly combined and shiny, about 3 minutes. Add the water gradually, beating on medium-high until icing is smooth and the desired consistency, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ham and Pea Soup",
        "ingredients": [
            "2 slices bacon ADVERTISEMENT",
            "2 tablespoons bacon grease ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "1 large onion, chopped, or more to taste ADVERTISEMENT",
            "1 gallon water ADVERTISEMENT",
            "1/4 teaspoon ground thyme ADVERTISEMENT",
            "1/4 teaspoon dried sage ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon dried parsley ADVERTISEMENT",
            "ground white pepper to taste ADVERTISEMENT",
            "1 pound ham, cubed ADVERTISEMENT",
            "1 (16 ounce) package frozen peas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large pot and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble into pieces when cool.\nReduce heat to medium-low and add bacon grease to the pot. Add celery and onion; cook and stir until starting to brown. Slowly pour in water; bring to a boil. Reduce heat, cover, and cook until vegetables are soft, about 1 hour.\nReturn bacon pieces to the pot. Sprinkle in thyme, sage, onion powder, parsley, and white pepper; stir to combine. Add cubed ham; simmer soup for flavors to combine, about 30 minutes.\nStir peas into the soup; cook until very tender and they start to disintegrate into the soup, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Creamy Peanut Butter Frosting ",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat sugar and butter together in a large bowl using an electric mixer on medium speed until smooth and no longer gritty, about 5 minutes. Add peanut butter, cream, and vanilla extract to the butter mixture. Beat on medium speed until frosting is well-mixed and smooth, 5 to 7 minutes.\nTransfer frosting to an airtight container and refrigerate until firm, 1 to 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick Smoked Turkey",
        "ingredients": [
            "1 (12 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "1 1/2 cups cider vinegar ADVERTISEMENT",
            "6 tablespoons hot pepper sauce (optional) ADVERTISEMENT",
            "6 tablespoons garlic powder ADVERTISEMENT",
            "1/4 cup salt (optional) ADVERTISEMENT",
            "1/4 cup ground black pepper ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat smoker using pans of briquets and hickory chips, adding the chips according to manufacturer's directions. Cut turkey in half.\nBring vegetable oil, cider vinegar, hot pepper sauce, garlic powder, salt, pepper, and honey to a rapid boil in a saucepan. Reduce heat, cover, and simmer basting sauce for 15 minutes, stirring occasionally.\nLay turkey flat on wire racks of the smoker. Place racks into the smoker, and smoke according to manufacturer's directions, basting every 15 minutes, about 2 hours. An instant-read thermometer inserted into the thickest part of the thigh should 165 degrees F (74 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apricot Brandy Slush",
        "ingredients": [
            "9 cups water, divided ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "2 tea bags ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen orange juice ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen lemonade ADVERTISEMENT",
            "16 fluid ounces apricot brandy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 7 cups water to a boil in a large saucepan; add sugar and stir until dissolved, about 5 minutes. Remove from heat and cool syrup to room temperature, about 30 minutes.\nBring 2 cups water to a boil in a small saucepan; remove from heat and add tea bags. Steep until water is room temperature, about 30 minutes. Remove and discard tea bags.\nPour brewed tea over syrup. Add orange juice, lemonade, and apricot brandy; stir well to combine. Pour into a wide-mouth container. Freeze slush mixture for 3 days, stirring twice a day with a wooden spoon to achieve a slushy consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rainbow Potato Pancakes",
        "ingredients": [
            "Russet Pancakes: ADVERTISEMENT",
            "3 cups grated russet potatoes ADVERTISEMENT",
            "3 tablespoons grated yellow onion ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt ADVERTISEMENT",
            "5 tablespoons potato starch ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/8 teaspoon ground white pepper ADVERTISEMENT",
            "1 cup vegetable oil for frying, or more as needed ADVERTISEMENT",
            "Fine salt, to taste ADVERTISEMENT",
            "Purple Pancakes: ADVERTISEMENT",
            "4 cups grated purple potatoes ADVERTISEMENT",
            "3 tablespoons grated red onion ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt ADVERTISEMENT",
            "5 tablespoons potato starch ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon balsamic vinegar ADVERTISEMENT",
            "1 cup vegetable oil for frying, or more as needed ADVERTISEMENT",
            "Fine salt, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For the russet pancakes, preheat vegetable oil in a skillet until it reaches 350 degrees F.\nGrate potatoes and onion, set aside. Place measured amounts into a clean bar towel or cloth. Squeeze out as much moisture as possible.\nWhisk eggs and whisk in potato starch, salt, and white pepper until smooth. Quickly fold onion and potatoes into the egg mixture.\nUse a 1/4 cup measuring cup to portion out a potato pancake. Place into hot oil and flatten with a spatula.\nFry until golden brown and flip with a slotted spatula (about 4 minutes per side). Fry for an additional time until the second side is golden brown.\nUse a slotted spatula to remove the pancake to a drain pan or rack. Sprinkle with fine salt.\nUse the same directions to make the purple potato pancakes using the ingredients listed above.\n",
        "picture_link": "w/LekoIawEeI0rKGmOpyy5qgTpo5iuC"
    },
    {
        "title": "Hash Brown Tostadas",
        "ingredients": [
            "4 cups frozen shredded hash brown potatoes ADVERTISEMENT",
            "6 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 (15 ounce) can reduced-sodium black beans, rinsed and drained ADVERTISEMENT",
            "1 bunch cilantro ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1/2 teaspoon garlic paste ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups romaine salad blend ADVERTISEMENT",
            "1 cup fresh tomato salsa ADVERTISEMENT",
            "1 cup shredded Mexican cheese blend ADVERTISEMENT",
            "Avocado (optional) ADVERTISEMENT",
            "Green onions (optional) ADVERTISEMENT",
            "Low-fat sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place shredded potatoes in a microwave-safe bowl and microwave for 3 minutes. While potatoes are heating, pour 3 tablespoons vegetable oil into a 12-inch cast-iron or nonstick skillet. Heat the oil over medium to medium-high heat.\nRemove the potatoes from the microwave and spoon 1 cup of the potatoes into the skillet. Repeat with another cup of potatoes and flatten each mound of potatoes to make a patty. Cook hash browns for 5 minutes.\nWhile hash browns are cooking, drain and rinse the beans. Combine beans with a large handful of cilantro, lime juice, cumin, garlic paste, cayenne, and salt in the bowl of a mini food processor. Process until smooth. Set aside.\nTurn the potato patties over and cook for another 5 minutes, until they are lightly browned. Dice the avocado and slice the green onions.\nRemove the patties from the pan. Add the remaining 3 tablespoons oil to the pan and repeat with the remaining potatoes.\nSpread 2 tablespoons of the black bean mixture on each patty and top with romaine, salsa, cheese, avocado, green onions and sour cream (if using).\n",
        "picture_link": "ERmKULBc4b.sJ9wCsyLrhteUK6vG0N6"
    },
    {
        "title": "Chocolate Cake Cocktail",
        "ingredients": [
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 fresh lemon wedges ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "1 1/4 fluid ounces hazelnut liqueur (such as Frangelico®) ADVERTISEMENT",
            "1 1/4 fluid ounces lemon-flavored vodka (such as Absolut Citron®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour sugar onto a small plate. Cut a slit in the middle of each lemon wedge, slide around the rim of 2 shot glasses and dip rims into the sugar.\nFill a cocktail shaker with ice. Add the hazelnut liqueur and lemon-flavored vodka to the shaker. Cover and shake until chilled; pour into shot glasses. Hang the lemon wedges on the rims.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Potato Bonda (Spicy Potato Balls)",
        "ingredients": [
            "1 pound potatoes, peeled and quartered ADVERTISEMENT",
            "2 tablespoons light sesame oil ADVERTISEMENT",
            "1 1/2 teaspoons cumin seeds ADVERTISEMENT",
            "6 fresh curry leaves, chopped, or more to taste ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "2 green chile peppers, minced ADVERTISEMENT",
            "1 1/2 teaspoons ginger paste ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1 cup chickpea flour (besan) ADVERTISEMENT",
            "1 tablespoon rice flour ADVERTISEMENT",
            "1 teaspoon ground red chile pepper ADVERTISEMENT",
            "1 pinch asafoetida powder (hing) ADVERTISEMENT",
            "1/4 cup water, or as needed ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook potatoes in a large microwave-safe bowl in the microwave until soft and cooked through, about 5 minutes. Use a fork or pastry blender to lightly smash potatoes.\nHeat the sesame oil in a skillet over medium-high heat; add cumin seeds and cook until fragrant, stirring occasionally, about 1 minute. Add curry leaves and stir until fragrant; mix in onion, green chile peppers, and ginger paste. Cook until the onions are soft, about 5 minutes. Reduce heat; stir in turmeric and curry powder.\nPour onion mixture over smashed potatoes; mix thoroughly to combine.\nMix chickpea flour, rice flour, red chile pepper, and asafoetida in a shallow bowl. Pour in just enough water to form a thick, pancake-like batter. Let it rest until batter has slightly thickened, about 15 minutes.\nHeat vegetable oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nRoll the potato mixture into balls the size of golf balls. Dip each potato ball in the batter to coat. Fry 3 to 4 at a time in the hot oil until golden on both sides, about 3 minutes. Drain on paper towels.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Panthay Khawswey (Burmese Chicken Stew)",
        "ingredients": [
            "salt to taste ADVERTISEMENT",
            "1 (8 ounce) package rice vermicelli ADVERTISEMENT",
            "3 tablespoons vegetable oil, or more if needed ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "6 cloves garlic, crushed, or more to taste ADVERTISEMENT",
            "1 (1 inch) piece ginger, crushed ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "2 cups diced chicken ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 tablespoon chili powder, or to taste ADVERTISEMENT",
            "1/2 cup water, or more if needed ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1/3 cup chickpea flour ADVERTISEMENT",
            "1/4 cup chopped green onions (optional) ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a saucepan with lightly salted water and bring to a rolling boil; stir in vermicelli noodles and cook, uncovered, stirring occasionally, until the noodles are tender yet firm to the bite, 4 to 5 minutes. Drain.\nHeat oil in a large pot over medium heat; add onions, garlic, ginger, and turmeric. Cook and stir until onions start to brown, about 5 minutes. Stir in chicken, fish sauce, chile powder, and salt. Add a tablespoon or two of water if mixture looks dry or starts to stick. Cook until chicken is tender and no longer pink, about 5 minutes.\nPour milk and coconut milk into the pot. Bring the soup to a boil; reduce heat, and simmer, uncovered, stirring frequently, about 5 minutes.\nCombine 1/2 cup water and chickpea flour in a small bowl. Add chickpea flour mixture to the soup a few tablespoons at a time; stir thoroughly between each addition to avoid lumps. Simmer until slightly thickened, 5 to 10 minutes.\nPlace cooled vermicelli noodles into servings bowls. Ladle soup over the noodles, and garnish with green onions and cilantro.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Afghan Sweet Bread (Roht)",
        "ingredients": [
            "3 cups all-purpose flour, plus more for dusting ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons ground cardamom ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon nigella seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease one 11x13-inch rectangular baking dish.\nWhisk flour, baking powder, cardamom, and salt together in a bowl.\nWhisk eggs together in a small bowl. Discard 1/4 of the egg mixture. Combine remaining egg mixture, butter, and sugar in a large bowl; beat with an electric mixer on medium speed until smooth, about 3 minutes. Fold the flour mixture into the egg mixture slowly. Beat briefly on low speed just until dough comes together.\nTransfer dough to the baking dish. Dust your hands with flour and pat dough into an even layer about 3/4-inch thick. Prick dough in several places with a fork and sprinkle the nigella seeds evenly on top.\nBake in the preheated oven until lightly golden, 20 to 25 minutes. Remove from the oven and run a knife around the edges to loosen it from the pan; cut roht into squares while still warm. Let cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Clementine Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "4 clementines ADVERTISEMENT",
            "1/2 cup water, or as needed ADVERTISEMENT",
            "1 (15.25 ounce) package yellow cake mix (such as Betty Crocker®) ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/4 teaspoon orange extract, or more to taste ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 drop red food coloring ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "2 (16 ounce) containers chocolate fudge frosting ADVERTISEMENT",
            "1 clementine, peeled and finely chopped ADVERTISEMENT",
            "1 clementine, peeled and segmented, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9-inch round cake pans.\nFinely grate zest from 2 clementines and set aside. Juice all 4 clementines into a measuring cup; add enough water to reach 1 cup.\nPour clementine juice into a large bowl. Add zest, cake mix, eggs, oil, orange extract, vanilla extract, salt, and red food coloring. Blend with an electric mixer until batter is smooth, about 2 minutes. Divide batter into greased cake pans and smooth the top.\nBake cakes in the preheated oven until a toothpick inserted into the centers comes out clean, 24 to 29 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack, about 30 minutes more.\nTransfer cakes to a flat surface. Carefully trim the tops of the cakes with a sharp knife to level them; cut each layer in half horizontally. Transfer one cake layer to a serving plate and spread with 1/2 cup of the frosting; top with another cake layer and 1/2 cup of frosting. Scatter chopped clementine over the frosting. Stack and frost third and fourth cake layers. Arrange clementine wedges around the perimeter of the top layer.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Butter Pecan Fudge",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter an 8-inch square baking pan.\nCombine butter, brown sugar, white sugar, and salt in a saucepan; pour in cream. Bring to a boil, stirring until butter melts and sugar is dissolved. Let mixture boil, stirring often, for 5 minutes.\nRemove saucepan from heat; add vanilla extract and mix well. Stir in confectioners' sugar until smooth. Fold pecans into fudge.\nPour fudge into prepared pan and cool until firm, 1 to 2 hours. Cut into 1-inch squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Peanut Butter Frosting",
        "ingredients": [
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine confectioners' sugar, peanut butter, melted butter, milk, and vanilla extract in a large bowl. Mix with a wooden spoon until well-combined and smooth, 2 to 3 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten-Free Pretzels",
        "ingredients": [
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "3 tablespoons light corn syrup ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 cups white rice flour, plus more for dusting ADVERTISEMENT",
            "1 cup brown rice flour ADVERTISEMENT",
            "1/2 cup potato starch ADVERTISEMENT",
            "1/4 cup tapioca flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon xanthan gum ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "2 tablespoons water (optional) ADVERTISEMENT",
            "4 quarts water ADVERTISEMENT",
            "1/4 cup baking soda ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "pretzel salt, for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast in 1 cup warm water in a small bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes. Whisk in light corn syrup, egg, and vegetable oil.\nWhisk white rice flour, brown rice flour, potato starch, tapioca flour, salt, xanthan gum, and baking powder together in the bowl of an electric mixer fitted with a paddle or dough hook attachment. Pour yeast mixture into the bowl; mix on medium speed until well-combined, 3 to 4 minutes. Add up to 2 tablespoons water if the dough is dry or crumbly.\nTurn dough out onto a work surface lightly dusted with rice flour and knead gently until smooth, about 5 minutes. Transfer to a large, greased bowl and cover with plastic wrap. Let rise until almost doubled in volume, about 1 hour.\nPush down gently on the dough to deflate, and separate into 12 equal pieces. Roll each piece into a rope about 15 inches long and shape into a \"U.\" Twist the two ends of the dough and press them firmly into the top of the loop to form a pretzel shape.\nPreheat oven to 425 degrees F (220 degrees C). Generously grease 2 baking sheets.\nBring 4 quarts of water to boil in a large pot. Add the baking soda and white sugar carefully; water will foam vigorously. Gently place one pretzel into the water bath; remove with a large slotted spoon when it floats to the top of the water and transfer to a dry baking sheet. Repeat with remaining pretzels. Transfer boiled pretzels to greased baking sheets, brush with melted butter, and sprinkle with pretzel salt.\nBake in the preheated oven until pretzels are golden brown, rotating the baking sheets halfway through baking, about 25 minutes. Remove from the oven and allow to cool on a cooking rack.\n",
        "picture_link": "Fo3uiI1uGqeqhEu4XAkJ23E0geNBQBu"
    },
    {
        "title": "Homemade Flax Seed Milk",
        "ingredients": [
            "1/2 cup flax seeds ADVERTISEMENT",
            "4 1/2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend flax seeds and water in a blender on high for 1 minute; allow to rest for 2 minutes. Blend again on high for 1 minute; allow to rest for 5 minutes. Blend again for 30 seconds.\nPour milk through a nut bag or a strainer lined with cheesecloth into a pitcher or glass container; press solids with back of a spoon to extract liquid. Gather cheesecloth around solids; twist and squeeze to extract all the liquid.\n",
        "picture_link": "jRDqyLZ1yLKNQ.4MS1iduQQJ6c0DTg6"
    },
    {
        "title": "Japanese Sweet & Savory Potato Bites",
        "ingredients": [
            "Teriyaki Sauce: ADVERTISEMENT",
            "1 2/3 cups water ADVERTISEMENT",
            "1 3/4 cups Japanese soy sauce ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup tapioca flour (starch) ADVERTISEMENT",
            "1 tablespoon mirin (sweetened rice wine) ADVERTISEMENT",
            "Potato Bites: ADVERTISEMENT",
            "6 frozen tater drums ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup thinly sliced cabbage ADVERTISEMENT",
            "1/2 cup small diced squid ADVERTISEMENT",
            "1 tablespoon dried fish flakes ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon Japanese soy sauce ADVERTISEMENT",
            "Roasted shredded seaweed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Teriyaki Sauce: In a pot, boil water and add Japanese soy sauce until re-boiled. Add the sugar and mirin. Add the tapioca flour in small batches until thickened, whisk smooth.\nPotato Bites: Preheat oil in a fryer or a deep pan to 350 degrees F. Fry tater drums according to packaging or approximately 3 minutes.\nIn a skillet, heat oil, add the squid and cabbage. Saute with Japanese Soy Sauce until light-brown color, place on the plate.\nPlace the prepared tater drums, followed by the 1/3 cup teriyaki sauce, and mayonnaise on top of squid/cabbage plating. Then sprinkle fish flakes and seaweed. Serve.\n",
        "picture_link": "9c5NRdONGyVF6BaO02Nvmgq1q1lbJua"
    },
    {
        "title": "No Bake Dark Chocolate Cherry Tart",
        "ingredients": [
            "Base: ADVERTISEMENT",
            "3 tablespoons Ghirardelli® Unsweetened Cocoa Powder ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 (4 ounce) bar Ghirardelli® 100% Cocoa Unsweetened Chocolate Baking Bar ADVERTISEMENT",
            "1 cup Ghirardelli® 60% Cacao Bittersweet Chocolate Baking Chips ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1 cup morello (sour) cherries in syrup, drained thoroughly ADVERTISEMENT",
            "Topping and Decoration Options: ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1/2 cup cream cheese ADVERTISEMENT",
            "16 fresh cherries with stems intact ADVERTISEMENT",
            "1/2 cup Ghirardelli® 60% Cacao Bittersweet Chocolate Baking Chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For the crust: Add the graham cracker crumbs, melted butter and cocoa powder to a mixing bowl and mix together well.\nPress mixture firmly into the bottom and around the edges of a tart tin (rectangle 13 3/4 x 4 1/2 inches or circle 9 1/2 inches). Place in the fridge to chill.\nChop the unsweetened chocolate bar into small chunks and combine with chocolate chips in a bowl. Set aside.\nHeat 1 cup heavy cream and 2 tablespoons confectioners' sugar gently in a saucepan until just hot, but not boiling. Pour over the chocolate bowl and leave for a couple of minutes to melt, then stir gently until the chocolate has dissolved.\nRemove crust from fridge and spoon the drained morello cherries all over the base.\nPour the chocolate on top and smooth down. Place back in the fridge to set for 2 hours.\nOnce chilled you can slice and serve with a spoonful of the whipped cream, and decorate each slice with a few fresh cherries.\n",
        "picture_link": "2QXTVW0PgjfQy9yPu8Zsu8GgjNDP9CK"
    },
    {
        "title": "Easy Cranberry-Coconut Oatmeal Cookies",
        "ingredients": [
            "1 1/2 cups unsweetened applesauce ADVERTISEMENT",
            "1 cup unsweetened flaked coconut ADVERTISEMENT",
            "1 cup cranberries ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup white whole wheat flour ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 tablespoon honey (optional) ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon (optional) ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nMix applesauce, coconut, cranberries, oats, flour, egg whites, honey, cinnamon, baking soda, baking powder, salt, and vanilla extract together in a large bowl until well combined. Drop tablespoonfuls of batter 2 inches apart onto prepared baking sheet.\nBake in the preheated oven until edges are golden, 12 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten-Free, Dairy-Free Pumpkin Pie Custard",
        "ingredients": [
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1/2 (14 ounce) can coconut cream ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/3 cup almond milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish.\nWhisk pumpkin puree, coconut cream, brown sugar, almond milk, eggs, vanilla extract, and pumpkin pie spice together in a bowl to form a smooth batter. Pour batter into baking dish.\nBake in preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simple Bubble Tea",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1 cup quick cooking pearl tapioca ADVERTISEMENT",
            "6 cups brewed black tea ADVERTISEMENT",
            "1/4 cup sweetened condensed milk ADVERTISEMENT",
            "4 teaspoons white sugar, or to taste ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a pot, add tapioca pearls, and cover pot. Reduce heat to medium-low and simmer for 5 minutes. Drain pearls and set aside.\nPour brewed tea, condensed milk, and sugar into a pitcher; stir to dissolve sugar. Refrigerate tea mixture until chilled, about 1 hour.\nScoop tapioca pearls into 4 large glasses, about 2 tablespoons each. Fill each glass with tea mixture; top with ice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten-Free Pumpkin Muffins ",
        "ingredients": [
            "Batter: ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1/2 cup coconut oil ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "6 tablespoons mayonnaise ADVERTISEMENT",
            "1/3 cup maple syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup almond flour ADVERTISEMENT",
            "1/3 cup coconut flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/2 cup almond flour, lightly packed ADVERTISEMENT",
            "3 tablespoons maple syrup ADVERTISEMENT",
            "2 tablespoons coconut oil, melted ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease 12 muffin cups or line with paper muffin liners.\nMix pumpkin puree, 1/2 cup coconut oil, eggs, mayonnaise, 1/3 cup maple syrup, and vanilla extract together in a large bowl.\nMix 1 cup almond flour, coconut flour, 2 teaspoons cinnamon, ginger, 1/2 teaspoon salt, baking powder, and cream of tartar together in a separate bowl.\nStir almond flour mixture into pumpkin mixture until batter is well combined. Pour equal portions of batter into prepared muffin cups.\nMix pecans, 1/2 cup almond flour, 3 tablespoons maple syrup, 2 tablespoons melted coconut oil, 1/4 teaspoon cinnamon, and 1/4 teaspoon salt together in separate bowl. Spoon equal portions of topping over batter.\nBake in preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Potatoes, Pina-Colada Style",
        "ingredients": [
            "5 pounds sweet potatoes, scrubbed ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple in juice, undrained ADVERTISEMENT",
            "1 tablespoon finely chopped candied ginger ADVERTISEMENT",
            "1 (15 ounce) can unsweetened coconut milk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Generously butter a 9x13-inch baking dish.\nPlace sweet potatoes in a large pot and cover with 2 to 3 inches of water; cover and bring to a boil. Reduce heat to medium-low and simmer until tender but still slightly firm in the center, about 12 minutes. Drain and cool.\nPeel the sweet potatoes and cut into 3-inch chunks or thick slices; arrange in the buttered baking dish. Top with crushed pineapple (in its juice) and candied ginger.\nCombine coconut milk, sugar, honey, butter, ground ginger, salt, and black pepper in a saucepan. Bring to a boil; reduce heat and simmer until slightly thickened, 5 to 10 minutes. Pour coconut milk mixture over sweet potatoes. Cover baking dish with aluminum foil.\nBake in the preheated oven until very tender, about 45 minutes. Remove foil, baste sweet potatoes with cooking liquid and continue baking until liquid is slightly thickened, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Poached Pomegranate Pears",
        "ingredients": [
            "2 cups unsweetened pomegranate juice ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/2 cup vanilla rum ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "1 teaspoon whole cloves ADVERTISEMENT",
            "4 large firm pears ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pomegranate juice, orange juice, rum, 1/2 cup white sugar, brown sugar, cinnamon sticks, and cloves in a large pot; simmer until sugar is completely dissolved, about 10 minutes.\nPeel pears, leaving stem intact. Slice 1/4 inch off the bottom for pears to stand securely.\nPlace pears gently in the pot and cover. Simmer for 30 minutes, basting pears every 5 to 10 minutes. Remove pot from heat and let stand for 30 minutes, continuing to baste occasionally. Remove pears from pot and set aside.\nStrain spices from poaching liquid and add 1/3 cup sugar. Return to a low boil and reduce until sauce is thickened, 10 to 15 minutes.\nLadle sauce over pears to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pumpkin Pie Pudding Shots",
        "ingredients": [
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "4 ounces cream cheese ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg, or to taste ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3/4 cup spiced rum ADVERTISEMENT",
            "1 (3 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat pumpkin, cream cheese, cinnamon, and nutmeg together in a bowl with an electric mixer until smooth and creamy. Mix milk, rum, and vanilla pudding mix into pumpkin mixture until combined; fold in whipped topping until blended.\nFreeze pudding until set, 10 to 15 minutes. Spoon 2 tablespoons pudding into each glass.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ghirardelli® Peppermint Bark Holiday Fudge",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 1/3 cups Ghirardelli® 60% Cacao Bittersweet Chocolate Baking Chips ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "10 squares Ghirardelli® Peppermint Bark Squares, broken up ADVERTISEMENT",
            "1 teaspoon peppermint extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9 x 9 inch pan with plastic wrap. Set aside.\nCombine chocolate with sweetened condensed milk in a microwaveable bowl. Cook on high (100% power) for about 1 1/2 minutes or until chips are JUST melted. Take care not to overheat the mix. Stir after 1 1/2 minutes. Don't stir too much or the mix will get oily.\nGently stir in the peppermint bark and peppermint extract.\nPour the thick fudge into prepared pan. Press evenly into the corners.\nAllow fudge to set for 4 hours at room temperature or cover and leave it overnight.\nCut into squares or cut out shapes with cutters. Store fudge at room temperature (not in the fridge) and wrap well so it doesn't dry out.\n",
        "picture_link": "t90g61kbNk5sTzS3NbqL43Y0OPK5vNa"
    },
    {
        "title": "Pina Colada Ice Cream",
        "ingredients": [
            "1 (20 ounce) can crushed pineapple, undrained ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (14 ounce) can coconut cream ADVERTISEMENT",
            "1 cup sweetened flaked coconut ADVERTISEMENT",
            "1 teaspoon rum flavoring, or more to taste (optional) ADVERTISEMENT",
            "2 cups whole milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pineapple, condensed milk, cream of coconut, flaked coconut, and rum flavoring in a large bowl. Pour into an ice cream maker. Pour in enough milk to reach the freezer line of the ice cream maker.\nFreeze ice cream according to manufacturer's instructions. Transfer canister to the freezer and freeze until ice cream is firm, 2 to 4 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Persimmon and Apple Salad",
        "ingredients": [
            "1 tablespoon walnut pieces ADVERTISEMENT",
            "2 tablespoons fresh orange juice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "1 apple, cored and thinly sliced ADVERTISEMENT",
            "1 persimmon, stemmed and thinly sliced ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "2 cups shredded romaine lettuce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a small skillet over medium-low heat; add walnut pieces and cook until fragrant, about 2 minutes.\nWhisk orange juice, olive oil, and white wine vinegar together in a large bowl. Add apple, persimmon, and toasted walnut pieces; mix to coat. Season with salt and cinnamon. Add lettuce and toss to combine.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quinoa Pilaf with Veggies and Chickpeas",
        "ingredients": [
            "4 cups chicken stock ADVERTISEMENT",
            "2 cups quinoa ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound asparagus, chopped ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can chickpeas, drained and rinsed ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon balsamic vinegar, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken stock and quinoa in a saucepan and bring to a boil. Reduce heat to medium-low, cover, and simmer until quinoa is tender, about 15 minutes. Remove from heat.\nHeat olive oil in a large skillet over medium heat until shimmering. Add asparagus, bell peppers, and onion; cook and stir until softened, about 6 minutes. Stir in chickpeas. Pour in 2 tablespoons balsamic vinegar and cook until reduced, about 4 minutes. Add lemon juice, salt, and black pepper. Stir in cooked quinoa. Drizzle 1 tablespoon balsamic vinegar over pilaf before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Tree Ghirardelli Peppermint Bark Cookies",
        "ingredients": [
            "1 cup soft butter ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (10 ounce) package Ghirardelli® 60% Cacao Bittersweet Chocolate Baking Chips ADVERTISEMENT",
            "1 1/2 cups crushed Ghirardelli® Peppermint Bark ADVERTISEMENT",
            "Sprinkles to decorate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees .\nUsing a food processor, pulse all butter, confectioners' sugar, egg, vanilla, flour, and salt together until big lumps start to form. Bring dough together with your hands and form into a large ball. (If you don't have a food processor you can do this by rubbing the flour and butter together with your fingertips, add the rest of ingredients, and bring it all together with your hands).\nWrap ball in plastic wrap and refrigerate for 1 hour.\nLightly flour a work surface and rolling pin, cut chilled dough in half and place the other half back in the fridge while you roll out the first batch. Roll out dough until about 1/2 cm (1/8 inch) thick. Cut out with Christmas shapes.\nIf you want to hang the cookies on the tree, make sure to poke a hole in the top with a chopstick.\nPlace cookies carefully on a non-stick baking tray and bake in the oven for 7 to 8 minutes.\nAllow to cool on the trays for 2 minutes then transfer onto a wire rack to cool completely.\nFor the frosting, melt the chocolate baking chips and coat the cooled cookies on one side.\nWhile the chocolate is still wet, sprinkle with the crushed Peppermint Bark and sparkles.\nAllow to set somewhere cool completely. Tie a ribbon or piece of string through each cookie and hang on your Christmas Tree.\n",
        "picture_link": ".v3HS3ZLHw0qh4NxiWmXoOWhGFLC5ka"
    },
    {
        "title": "Hot Chocolate and Toasted Marshmallow Cookies",
        "ingredients": [
            "3/4 cup Ghirardelli® 60% Cacao Bittersweet Chocolate Chips ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon Ghirardelli® Unsweetened Cocoa Powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "1 cup soft brown sugar ADVERTISEMENT",
            "2 small eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract (optional) ADVERTISEMENT",
            "2 1/4 cups Ghirardelli® 60% Cacao Bittersweet Chocolate Chips ADVERTISEMENT",
            "16 large marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 3/4 cup chocolate chips gently in the microwave or over a pot of simmering water (bain marie). Set aside to cool.\nSift flour, cocoa powder, baking soda, and salt together in a bowl, and stir together.\nBeat the butter and sugar together until thick and creamy. Beat in eggs one by one. Add cooled melted chocolate and vanilla extract. Continue beating until ingredients are well mixed.\nFold dry ingredients and 2 1/4 cups chocolate chips into the mix and stir until combined.\nScoop cookie with a 1 tablespoon scoop (if the mix is soft you can pop it in the fridge to stiffen up and this will make it easier to scoop).\nBake at 350 degrees F for 8 to 9 minutes. Take care not to overbake as these cookies should be almost brownie-like.\nOnce baked, pop a marshmallow on top and put it back in the oven on broil for 1-2 minutes for a lovely toasted effect.\n",
        "picture_link": "75wJl/4ujuqAlPAEoC9GPYS3bLP3Lzi"
    },
    {
        "title": "Paleo Peach Crumble",
        "ingredients": [
            "2 teaspoons coconut oil, melted, or as needed ADVERTISEMENT",
            "8 fresh peaches ADVERTISEMENT",
            "1/4 cup coconut sugar ADVERTISEMENT",
            "2 teaspoons arrowroot powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "Crumble Topping: ADVERTISEMENT",
            "1 cup almond flour ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup unsweetened shredded coconut ADVERTISEMENT",
            "1/4 cup coconut sugar ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup unsalted butter, chilled and cut into small cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with coconut oil.\nFill a large pot a third of the way with water; bring to a boil. Remove from heat. Slice each peach in half, keeping pit intact. Place peach halves in the boiling water to soften, about 10 minutes. Take out of the water and let cool until easily handled, about 10 minutes.\nCombine 1/4 cup coconut sugar, arrowroot powder, cinnamon, and nutmeg in a small bowl and mix with a fork.\nMix almond flour, pecans, coconut, 1/4 cup coconut sugar, sea salt, and cinnamon together in a large bowl. Rub in cold butter using your fingers until topping mixture is crumbly, about 2 minutes.\nRemove pit from peach halves; peel and slice flesh. Arrange slices in the baking dish. Sprinkle coconut sugar mixture on top. Scatter topping mixture evenly over the peaches.\nBake in the preheated oven until topping is golden and juices are bubbly, 35 to 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bean and Sunflower Hummus",
        "ingredients": [
            "1 cup cooked pinto beans ADVERTISEMENT",
            "1 cup raw sunflower seeds ADVERTISEMENT",
            "1/2 cup chives ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1/2 teaspoon Himalayan pink salt ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend pinto beans, sunflower seeds, chives, lemon juice, pink salt, and cayenne pepper together in a blender until smooth; add water as needed for creamier consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Low-Carb Deep-Dish Breakfast Pizza",
        "ingredients": [
            "1 1/2 tablespoons butter, divided ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "1/4 cup shredded mild Cheddar cheese ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "3 slices bacon ADVERTISEMENT",
            "2 sausage links, sliced into 1/2-inch pieces ADVERTISEMENT",
            "1/3 cup tomato puree ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1/8 teaspoon dried basil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place 1 tablespoon butter in a glass or ceramic pie pan and heat briefly in the oven until butter is melted.\nWhisk eggs, cream, and Cheddar cheese in a large bowl. Pour into warmed pie pan.\nBake in the preheated oven until eggs are set and golden, 15 to 20 minutes. Remove egg \"crust\" from the oven.\nMelt remaining 1/2 tablespoon butter in a skillet over medium heat. Add onion and green bell pepper; cook and stir until softened, about 5 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Cook sausage in the same skillet until browned, about 5 minutes. Drain on paper towels.\nCombine tomato puree, garlic powder, onion power, oregano, basil, salt, and black pepper in small bowl to make pizza sauce.\nTop egg crust with pizza sauce, mozzarella cheese, onion and green pepper mixture, bacon, and sausage.\nBake the pizza in the preheated oven until cheese is melted, about 10 minutes.\n",
        "picture_link": "TLo45D/Rv/DYU2sx0nvSTxwFzCU4m6u"
    },
    {
        "title": "Healthy Chocolate Energy Balls",
        "ingredients": [
            "1 cup raw hemp seeds ADVERTISEMENT",
            "6 Medjool dates, pitted ADVERTISEMENT",
            "1/3 cup cocoa powder (such as Hershey's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grind hemp seeds into a powder in a food processor; add dates and cocoa powder and process until smooth. Roll dough into balls, pressing tightly.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dill Sweet Potato Fries with Vegan Dip",
        "ingredients": [
            "1 large sweet potato - peeled, dried, and sliced into fry-size shapes ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon dried dill ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground mixed peppercorns ADVERTISEMENT",
            "Dipping Sauce: ADVERTISEMENT",
            "3 tablespoons vegan mayonnaise ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPlace sweet potato pieces in a bowl. Add olive oil, 1 tablespoon dill, salt, and pepper; toss to coat. Spread coated sweet potato in 1 layer on a baking sheet, making sure there is space between each.\nBake in the preheated oven for 15 minutes. Flip fries and bake until just starting to brown, 15 to 20 minutes.\nMix vegan mayonnaise, 1 teaspoon dill, and soy sauce together in a bowl; serve alongside fries.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Back-to-School Cookies",
        "ingredients": [
            "Cookies: ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "1/2 cup confectioners' sugar, or as needed ADVERTISEMENT",
            "1 teaspoon lemon juice, or as needed ADVERTISEMENT",
            "assorted food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat white sugar and butter together in a bowl using an electric mixer until smooth and creamy. Add eggs and vanilla extract and beat until well mixed. Stir flour, baking powder, and salt into creamed butter mixture until dough is evenly mixed. Chill dough in refrigerator, 3 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nRoll cookie dough on a floured work surface. Cut dough into strips about 2 1/2 inches long and about as thick as a pencil, forming one end into a point. Arrange \"pencils\" on the prepared baking sheet.\nBake in the preheated oven until lightly browned, 8 to 10 minutes. Transfer parchment paper with cookies to a wire rack to cool completely.\nMix enough confectioners' sugar and lemon juice together in a bowl to form a thick icing. Divide icing among several small bowls and mix different colors of food coloring into each bowl.\nDecorate \"pencil\" cookies with colored icing so they look like colored pencils. Allow icing to dry completely.\n",
        "picture_link": "LRHxjY36VRR3Sc4.noR9jgwqlz0win."
    },
    {
        "title": "Mini Pecan Pie",
        "ingredients": [
            "1/2 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "3 (1 ounce) squares semi-sweet baking chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese and margarine together in a bowl using an electric mixer until smooth and creamy. Slowly add flour and continually mix until dough is smooth. Refrigerate mixture for 15 minutes.\nBeat brown sugar, egg, cinnamon, and vanilla extract together in a bowl until smooth; add pecans and stir.\nPreheat oven to 350 degrees F (175 degrees C). Grease 24 mini muffin cups.\nSpoon dough, about 1 tablespoon per pie, into each muffin cup. Press dough into the bottom and up the sides of each cup, creating a pie shell. Fill each shell with pecan mixture.\nBake in the preheated oven until pies are set, about 30 minutes. Cool pies on waxed paper.\nMelt chocolate in a small saucepan over low heat, stirring constantly. Dip a fork into melted chocolate and drizzle over pies.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Whipped Raspberry Instant Pudding",
        "ingredients": [
            "2 cups fresh raspberries ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash raspberries in a bowl using the back of a spoon until a jelly-like layer forms on top. Freeze for 5 minutes.\nMix sugar into mashed raspberries, spooning the bottom layer of raspberries over the top and you stir. Repeat 5 or 6 times until fully incorporated; freeze for 15 minutes. Serve chilled.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Smashed Sweet Potatoes with Caramelized Apples",
        "ingredients": [
            "4 pounds sweet potatoes ADVERTISEMENT",
            "1/4 cup light brown sugar ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup freshly squeezed orange juice ADVERTISEMENT",
            "1/4 cup unsalted butter, melted ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "3 apples (such as McIntosh or Macoun) - peeled, cored, and cut into 8 pieces ADVERTISEMENT",
            "3 tablespoons light brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add sweet potato, cover, and steam until soft, about 1 hour. Scoop the meat from the skin, transfer to a bowl, and smash using an electric mixer or wooden peg.\nStir 1/4 cup brown sugar, nutmeg, and cinnamon into smashed sweet potatoes; allow to cool.\nStir cream, orange juice, 1/4 cup unsalted butter, salt, and pepper into smashed sweet potatoes; transfer to a baking dish.\nPreheat oven to 375 degrees F (190 degrees C).\nMelt 3 tablespoons unsalted butter in a skillet over medium-high heat; cook and stir apples and 3 tablespoons brown sugar in the melted butter until lightly browned on both sides, 5 to 10 minutes. Spoon caramelized apples over smashed sweet potatoes.\nBake in the preheated oven until heated through, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]