[
    {
        "title": "Easy Chipotle Hummus",
        "ingredients": [
            "1/3 cup tahini, or more to taste ADVERTISEMENT",
            "2 lemons, juiced ADVERTISEMENT",
            "2 tablespoons chipotle sauce, or more to taste ADVERTISEMENT",
            "2 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1 teaspoon finely grated lemon zest ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "2 (15 ounce) cans garbanzo beans, drained, liquid reserved ADVERTISEMENT",
            "1/4 cup olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tahini, lemon juice, chipotle sauce, garlic, cumin, turmeric, lemon zest, pepper, and salt in a blender; blend until thoroughly combined.\nPour half of the garbanzo beans and half of the olive oil into the blender; blend, adding some of the reserved garbanzo bean liquid, until mixture is the consistency of pudding. Add remaining garbanzo beans and olive oil; blend, adding more of the liquid, until mixture is the consistency of a very thick paste. Continue blending until smooth, about 3 minutes.\n",
        "picture_link": "NiX52lB9uaKko9aLphN1kPxAC35oeha"
    },
    {
        "title": "Easy Chicken Shawarma",
        "ingredients": [
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 teaspoons garlic paste, divided ADVERTISEMENT",
            "1 teaspoon ginger paste ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts ADVERTISEMENT",
            "3 potatoes, cut into fries ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "8 pita breads, split ADVERTISEMENT",
            "1 cup pickled cucumbers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix vinegar, soy sauce, 1 teaspoon garlic paste, ginger paste, salt, and pepper together in a shallow dish. Add chicken breasts; turn to coat. Marinate in the refrigerator for at least 30 minutes.\nHeat 2 inches oil in a heavy pot to 325 degrees F (165 degrees C). Fry potatoes in batches until golden brown, about 5 minutes. Transfer to paper towels to drain.\nHeat 1 tablespoon vegetable oil in a large skillet over medium heat. Remove chicken breasts from the marinade and cook until browned and no longer pink in the center, 6 to 8 minutes per side. Transfer to a cutting board; slice into thin strips.\nMix remaining 1 teaspoon garlic paste with mayonnaise in a bowl.\nSpread garlic mayonnaise inside pita breads. Fill each pita with French fries, chicken slices, and pickles.\n",
        "picture_link": "PbnurlKfRejgbbAKFosBjq645okpgRi"
    },
    {
        "title": "Black Bean, Corn, and Quinoa Salad",
        "ingredients": [
            "2 cups chicken broth ADVERTISEMENT",
            "1 cup uncooked quinoa ADVERTISEMENT",
            "1 cup frozen corn ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 teaspoon red wine vinegar ADVERTISEMENT",
            "lime, zested ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "2 tablespoons avocado oil ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1 small red bell pepper, seeded and chopped ADVERTISEMENT",
            "1 small red onion, chopped ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken broth to a boil in a 2-quart saucepan. Stir in quinoa. Reduce heat to low; simmer, covered, until broth is absorbed, 15 to 20 minutes. Remove from heat; stir in corn. Cover and let stand until corn is warmed through, about 5 minutes.\nWhisk lime juice, red wine vinegar, lime zest, and cumin together in a large bowl. Whisk in avocado oil. Add black beans, red bell pepper, red onion, and cilantro. Season with salt and pepper. Stir in quinoa and corn.\n",
        "picture_link": "FxpKjzkn3GUnX1COqger2MXc./NZrIi"
    },
    {
        "title": "Spicy Chicken Burgers",
        "ingredients": [
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons minced garlic ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound ground chicken ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 large avocado - halved, pitted, and peeled ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 (8 ounce) container light sour cream ADVERTISEMENT",
            "1 1/2 cups shredded cabbage ADVERTISEMENT",
            "4 whole wheat Kaiser rolls ADVERTISEMENT",
            "1 large tomato, sliced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chili powder, 1 1/2 teaspoon salt, cumin, minced garlic, and black pepper together in a small bowl.\nSprinkle 3/4 of the chili powder mixture over ground chicken in a large bowl. Add egg; mix well and shape into 4 patties.\nPreheat grill for medium heat and lightly oil the grate. Grill patties until browned and juices run clear, about 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nMash avocado in a small bowl; season with garlic powder and 1/4 teaspoon salt.\nMix remaining chili powder mixture, sour cream, and shredded cabbage together in a bowl to make coleslaw.\nToast Kaiser rolls lightly on the grill. Place chicken patties on the buns. Top each patty with mashed avocado, a large scoop of coleslaw, and sliced tomato.\n",
        "picture_link": "s7/XwMB7pr29Vb2Uvm8VHLLlbewtlAm"
    },
    {
        "title": "Spaghetti with Parmesan and Bacon",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "2 tablespoons avocado oil (such as Acado™) ADVERTISEMENT",
            "1 cup frozen petite peas, thawed ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble into small pieces.\nWhisk eggs, milk, salt, and pepper together in a bowl.\nHeat avocado oil in a large skillet over medium heat. Add spaghetti, milk mixture, peas, and garlic; cook and stir until milk mixture is heated through and coats the spaghetti, 5 to 10 minutes. Stir in bacon and Parmesan cheese. Garnish with parsley.\n",
        "picture_link": "7G036I44U0VGMhH9aXiLkZRRXmra4Wu"
    },
    {
        "title": "Cream of Wheat (Semolina) Porridge",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 1/2 teaspoons butter ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup semolina flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk, water, butter, and salt in a saucepan over medium-high heat. Bring to a boil, stirring gently. Remove from heat. Pour in semolina flour in a steady stream, whisking constantly to prevent lumps.\nPlace saucepan back over medium heat; whisk until porridge comes to a boil, about 2 minutes. Reduce heat to low and cover; cook until porridge thickens, about 20 minutes. Remove saucepan from heat; stir in sugar.\nLet porridge stand for 3 to 5 minutes before serving.\n",
        "picture_link": "tokBf2.lrDAoMjCZrgRkhiuks.45WTC"
    },
    {
        "title": "Lebanese Chicken Shawarma",
        "ingredients": [
            "1 cup plain yogurt ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breasts, cut into 1/2-inch strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk yogurt, lemon juice, olive oil, tomato paste, garlic, cumin, coriander, salt, pepper, and red pepper flakes together in a bowl. Mix in chicken strips. Cover bowl with plastic wrap and place in the refrigerator to marinate, 8 hours to overnight.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nRemove chicken from the bowl and arrange in a single layer on a broiling pan. Discard excess marinade.\nBroil chicken, turning once, until juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "IZB5SOZkxDxOqRUQzKr44iyXuzZ7.VW"
    },
    {
        "title": "Bacon-Wrapped Chicken Pesto",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 skin-on, bone-in chicken thighs ADVERTISEMENT",
            "1/4 cup pesto ADVERTISEMENT",
            "2 tablespoons shredded mozzarella cheese ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; mist with cooking spray.\nMix onion powder, garlic powder, seasoned salt, and pepper together in a bowl.\nSprinkle onion powder mixture over both sides of the chicken thighs. Lift up the skin to create a pocket; stuff pocket with 2 tablespoons of pesto and 1 tablespoon of mozzarella cheese. Wrap chicken with 2 slices of bacon, using bacon to seal the pocket. Place chicken thighs seam-side down on the baking sheet.\nBake in the preheated oven until an instant-read thermometer inserted into the chicken, near the bone, reads at least 165 degrees F (74 degrees C), about 1 hour.\n",
        "picture_link": "9Ke9EhUWMcbADSrBnmljmbccM5WW5oC"
    },
    {
        "title": "Kartoffelsuppe nach Bayrischer Art (Bavarian Potato Soup)",
        "ingredients": [
            "2 links pork sausage ADVERTISEMENT",
            "3 tablespoons vegetable oil, or to taste ADVERTISEMENT",
            "4 pounds potatoes, peeled and cubed ADVERTISEMENT",
            "4 carrots, cubed ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "1 leek, trimmed and cubed ADVERTISEMENT",
            "3 scallions, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 cube vegetable bouillon ADVERTISEMENT",
            "6 cups hot water ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper, or to taste ADVERTISEMENT",
            "1 pinch dried marjoram, or to taste ADVERTISEMENT",
            "1 pinch sweet paprika, or to taste ADVERTISEMENT",
            "1 pinch ground nutmeg, or to taste ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "1 bunch fresh chives, chopped ADVERTISEMENT",
            "1/4 cup sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sausages in a small pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until no longer pink in the center, 10 to 15 minutes. Drain. Cut into slices.\nHeat oil in a large pot over medium heat. Cook potatoes in the hot oil, stirring often, until they start to crisp on the edges, about 8 minutes. Stir in carrots, onions, leek, scallions, and garlic.\nDissolve vegetable bouillon in hot water; pour into the pot. Season soup with salt, black pepper, marjoram, paprika, and nutmeg. Bring to a boil; reduce the heat and cook, covered, until carrots are tender, about 30 minutes.\nStir sausage slices, parsley, and chives into the soup. Simmer until flavors combine, about 5 minutes. Stir in sour cream just before serving.\n",
        "picture_link": "p9JcX4yeopWh9QUzBq5ROeGwfYy81.C"
    },
    {
        "title": "French Toast Variation of Eggs in a Basket",
        "ingredients": [
            "8 eggs, divided ADVERTISEMENT",
            "4 slices bread ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 4 eggs together in a bowl.\nCut 2-inch holes out of the center of each bread slice, reserving the cut-outs.\nHeat olive oil in a skillet over medium heat.\nDip bread into the whisked eggs, covering completely on both sides. Place each piece of dipped bread, 1 at a time, into the hot skillet; immediately crack an egg into the hole of the bread. Cook until egg is over-easy, about 1 minute per side.\nDip the bread cut-outs into the remaining whisked eggs and cook in the hot skillet until browned, about 2 minutes per side. Place the centers back into the center of each piece of bread to complete the top of the \"basket\".\n",
        "picture_link": "7lRaMc7PakWbYuvmZlrD38.m92QB7ry"
    },
    {
        "title": "Chicken Burgers with Blue Cheese",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 pound ground chicken ADVERTISEMENT",
            "2 cups panko bread crumbs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "3 tablespoons finely chopped onion ADVERTISEMENT",
            "3 tablespoons finely chopped celery ADVERTISEMENT",
            "2 tablespoons crumbled blue cheese ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "4 hamburger buns, split and toasted ADVERTISEMENT",
            "4 slices tomato (optional) ADVERTISEMENT",
            "4 leaves lettuce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise and Dijon mustard together in a small bowl. Transfer to the refrigerator.\nMix chicken, panko bread crumbs, milk, onion, celery, blue cheese, garlic powder, salt, and pepper together in a large bowl. Shape into 4 patties.\nHeat olive oil in a large skillet over medium heat. Cook patties until browned and the juices run clear, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nSpread mayonnaise mixture over both sides of each bun. Place a cooked patty, 1 tomato slice, and 1 lettuce leaf in each bun.\n",
        "picture_link": "UwQ26fzJcYKt3xsg0UeeHZhCp4F0DyK"
    },
    {
        "title": "Instant Pot® Pepper Chicken",
        "ingredients": [
            "6 chicken thighs ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "1 large yellow onion, chopped ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "3 cloves garlic, peeled ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in the Instant Pot(R) and cook for 10 minutes on the 'Manual' setting. Release pressure naturally according to manufacturer's instructions.\nSet the pot to 'Saute' and add green bell peppers, yellow onion, soy sauce, brown sugar, honey, garlic, and black pepper. Cook until most liquid is evaporated, vegetables are soft, and chicken is no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "C1G83uFfxn67KZvg8v1Bm3bfkGxsp3."
    },
    {
        "title": "Finest Arabic Chicken Shawarma Sandwich",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "3 tablespoons Greek yogurt ADVERTISEMENT",
            "3 tablespoons chile sauce ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons barbeque sauce (such as HP®) ADVERTISEMENT",
            "1 tablespoon dark soy sauce ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pound boneless chicken breast, cut into cubes ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/2 cup Greek yogurt ADVERTISEMENT",
            "3 tablespoons tahini ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Sandwich: ADVERTISEMENT",
            "1/4 cup cooking oil ADVERTISEMENT",
            "6 pita bread rounds ADVERTISEMENT",
            "1/2 head cabbage, finely shredded ADVERTISEMENT",
            "1 onion, cut into matchstick-size pieces ADVERTISEMENT",
            "2 pickled cucumbers, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 3 tablespoons Greek yogurt, chile sauce, vinegar, barbeque sauce, soy sauce, minced garlic, 1/2 teaspoon white pepper, black pepper, and cinnamon in a bowl; add chicken. Marinate chicken in the refrigerator for at least 30 minutes.\nMix 1/2 cup Greek yogurt, tahini, lemon juice, chopped garlic, 1/2 teaspoon white pepper, and salt in a bowl until sauce is smooth.\nHeat cooking oil in a skillet or wok over high heat; add chicken. Cook and stir until chicken is no longer pink in the center and juices run clear, 12 to 15 minutes.\nToast pita bread on a flat pan or skillet over medium heat until golden, 1 to 2 minutes per side.\nSpread sauce on pita bread (or make pocket in the pita and spread sauce inside). Layer chicken, cabbage, onion, and pickles over sauce. Fold or wrap sandwiches with aluminum foil or parchment paper.\n",
        "picture_link": ".KS9X2t5G6LPx3Y/2nnBltYz7zGdmwC"
    },
    {
        "title": "Mexican Hot Chocolate",
        "ingredients": [
            "1 vanilla bean ADVERTISEMENT",
            "1 teaspoon Urfa biber (Turkish chile pepper) ADVERTISEMENT",
            "6 cups milk ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "8 ounces bittersweet chocolate ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup whipped cream, or to taste ADVERTISEMENT",
            "1 tablespoon grated bittersweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Split vanilla bean lengthwise with the tip of a sharp knife. Place Urfa biber in a tea infuser.\nCombine vanilla bean, Urfa biber, milk, and cinnamon stick in a pot.\nCook over medium heat, stirring occasionally, until milk is steaming and small bubbles appear, 4 to 5 minutes. Remove Urfa biber. Reduce heat to low. Add chocolate and sugar; stir until chocolate is melted, about 2 minutes. Remove cinnamon stick and vanilla bean.\nPour into cups and top with a dollop of whipped cream. Garnish with bittersweet chocolate.\n",
        "picture_link": "6dia4sJjZ2Es/Fxi3F0Bkz044fg7Xc2"
    },
    {
        "title": "Kentucky Blue Ribbon All-Butter Pound Cake",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 1/2 cups butter, softened ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a tube pan with some butter and dust lightly with flour.\nMix flour, baking powder, and salt together in a bowl.\nCombine sugar and butter in a large bowl; beat with an electric mixer until creamy. Add eggs one at a time, beating well between each addition. Beat in flour mixture alternately with milk. Mix in vanilla extract. Pour batter into the prepared tube pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 1 hour to 1 hour 30 minutes. Cool in the pan for 5 minutes. Invert onto a wire rack and let cool completely, about 30 minutes.\n",
        "picture_link": "tql.qFxYaPRzUuk.55Wk6mQtqmMP8am"
    },
    {
        "title": "Cajun Sweet Potato Fries",
        "ingredients": [
            "3 tablespoons olive oil, or more to taste ADVERTISEMENT",
            "1 tablespoon hot sauce, or to taste ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon seasoned salt (such as LAWRY'S®) ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 large sweet potatoes, cut into thick French fries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nWhisk olive oil, hot sauce, cumin, thyme, paprika, seasoned salt, garlic powder, onion powder, and black pepper together in a large bowl. Add sweet potatoes and toss until evenly coated. Transfer coated fries to a stoneware sheet or baking sheet.\nBake in the preheated oven for 10 minutes; flip fries and continue cooking until lightly browned, 8 to 15 minutes more.\n",
        "picture_link": "J6Ao/B75mPxdmWIwZzOGQxEGPwv8aFa"
    },
    {
        "title": "Spaghetti Alla Carbonara Tradizionali",
        "ingredients": [
            "1 (14 ounce) package spaghetti ADVERTISEMENT",
            "5 ounces guanciale (cured pork cheek), cut into small cubes ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3/4 cup grated Pecorino-Romano cheese ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until tender yet firm to the bite, about 12 minutes. Drain.\nHeat a skillet over medium heat; cook and stir guanciale until crisp, 5 to 10 minutes.\nWhisk egg yolks and egg together in a bowl; add Pecorino-Romano cheese, salt, and pepper and whisk well. Stir in guanciale. Add spaghetti and toss until evenly coated.\n",
        "picture_link": "fEMzG2trZNmv1uCpYRJZ0/jimBq6H76"
    },
    {
        "title": "Rachel's Pizza Pasta Salad ",
        "ingredients": [
            "1 (16 ounce) package tri-color rigatoni pasta ADVERTISEMENT",
            "2 onions, diced ADVERTISEMENT",
            "3 tomatoes, diced ADVERTISEMENT",
            "12 ounces provolone cheese, cut into strips ADVERTISEMENT",
            "2 green bell peppers, diced ADVERTISEMENT",
            "1 (8 ounce) package sliced pepperoni ADVERTISEMENT",
            "1/4 cup sliced olives, or to taste ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally, until tender yet firm to the bite, about 13 minutes. Drain and let cool, about 10 minutes.\nCombine pasta, onions, tomatoes, provolone cheese, green bell peppers, pepperoni, and olives in a large bowl.\nWhisk olive oil, vinegar, Parmesan cheese, sugar, and oregano together in a bowl to make dressing. Pour over pasta mixture; toss until well mixed.\n",
        "picture_link": "Dzhrxy6uIaPX6M.c00JJzduJrDIDo8i"
    },
    {
        "title": "Stuffed Eggs",
        "ingredients": [
            "10 eggs ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a large pot and cover with cool water. Bring to a boil and cook, stirring occasionally, for 10 minutes. Transfer eggs to a bowl of cold water using tongs. Peel.\nCut eggs in half. Slice a small piece off bottoms so halves don't tip over. Place yolks in a mixing bowl. Add mayonnaise, mustard, Parmesan cheese, salt, and pepper. Mix until creamy, 1 or 2 minutes.\nSpoon yolk mixture into egg white halves. Garnish with a dot of ketchup on top. Refrigerate about 20 minutes before serving.\n",
        "picture_link": "68dcpJB.hAOZY4ddfea2MHw3JH8/S7y"
    },
    {
        "title": "Zach's Buffalo Wing Goodness",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon ground paprika ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "12 chicken wings, thawed if frozen ADVERTISEMENT",
            "1/3 cup hot pepper wing sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil and grease with cooking spray.\nMix flour, paprika, salt, and cayenne pepper together in a bowl.\nPat chicken wings dry with paper towels. Dip in the flour mixture until thoroughly coated. Transfer floured wings to the baking sheet; spray lightly with cooking spray.\nBake in the preheated oven, without turning, until browned, about 48 minutes. Preheat the oven's broiler. Broil wings until crisp and browned, about 5 minutes.\nCombine hot wings and hot sauce in a large bowl; toss until evenly coated.\n",
        "picture_link": "D7YHJqkTy0djjV.rgIy/s4cHLj0acNa"
    },
    {
        "title": "Flourless Banana Chocolate Chip Muffins",
        "ingredients": [
            "2 1/4 cups quick-cooking oats ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup unsweetened vanilla-flavored almond milk ADVERTISEMENT",
            "3 tablespoons coconut oil, melted ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup dark chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease or line 12 muffin cups with paper liners.\nPlace oats, mashed bananas, 1/2 cup plus 2 tablespoons maple syrup, eggs, almond milk, coconut oil, vanilla extract, baking powder, cinnamon, baking soda, and salt in a blender or food processor; blend or process until batter is smooth. Gently stir chocolate chips into batter using a spoon.\nPour batter into the prepared muffin cups, filling them 3/4 full.\nBake in the preheated oven until light golden brown, about 22 minutes. Cool for 10 to 15 minutes before eating.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Flourless Peanut Butter Chocolate Chip Blender Muffins",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 very ripe banana ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon almond extract ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1/2 cup mini chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a muffin tin with cooking spray.\nCombine peanut butter, banana, honey, egg white, almond extract, baking soda, and sea salt in a blender; blend until smooth. Stir chocolate chips into the batter with a wooden spoon.\nPour batter into the prepared muffin tin, filling each cup 3/4 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 9 minutes. Cool in the tin for 5 minutes; transfer to a baking rack to cool completely.\n",
        "picture_link": "AImd9eVVr7ZZx8mRkzjTKISo6DpRnye"
    },
    {
        "title": "Rice Flour Mexican Chocolate Cupcakes (Gluten Free)",
        "ingredients": [
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups rice flour ADVERTISEMENT",
            "1/4 cup dark cocoa powder ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 12 muffin cups with paper liners.\nBeat butter and sugar together in the bowl of a stand mixer or using an electric hand mixer on high speed until creamy and fluffy. Add eggs, 1 at a time, beating well after each addition. Add vanilla extract and mix well.\nMix rice flour, cocoa powder, baking powder, cinnamon, cayenne pepper, and baking soda into creamed butter mixture and mix on low speed until flour is moistened; increase speed to medium and mix until there are no longer lumps. Reduce mixer speed to low and add milk; mix until batter is well blended. Fill each prepared muffin cup with about 3 tablespoons batter.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 18 to 20 minutes.\n",
        "picture_link": "hNXdOaYWn.17IRSgLf86CSd0NYhZV3q"
    },
    {
        "title": "Spicy Slow Cooker Potatoes",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, thinly sliced ADVERTISEMENT",
            "2 green chile peppers, thinly sliced (optional) ADVERTISEMENT",
            "1 tablespoon mustard seeds ADVERTISEMENT",
            "1 tablespoon cumin seeds ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "8 potatoes, peeled and cubed ADVERTISEMENT",
            "2 tablespoons red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour olive oil into the bottom of a slow cooker. Layer onion slices over the oil. Add green chile peppers, mustard seeds, cumin seeds, sugar, garlic, salt, and pepper. Layer potatoes on top, seasoning each layer with a sprinkle of salt and red pepper flakes.\nCook on High until potatoes are tender, 3 1/2 to 4 hours. Stir gently before serving.\n",
        "picture_link": "7rpYVIxxd7n/Dc0qOAnI576AoZHHaTG"
    },
    {
        "title": "Citrus Walnut Salad",
        "ingredients": [
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "2 large oranges, zested ADVERTISEMENT",
            "1 pink grapefruit ADVERTISEMENT",
            "1 (5 ounce) bag mixed salad greens ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "2 tablespoons pomegranate juice, or more as needed ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spread walnuts on a baking sheet.\nToast walnuts in the preheated oven until golden brown and fragrant, about 5 minutes.\nSlice top and bottom off 1 orange and set on a flat work surface. Cut downwards from the top, following the curve of the fruit, to remove all of the skin and pith. Repeat with remaining orange and grapefruit.\nHolding 1 orange over a bowl to catch juice, cut both sides of each segment away from the connective membrane and transfer to a separate bowl. Squeeze extra juice from the membranes into the bowl. Repeat with remaining orange and grapefruit.\nMix toasted walnuts, salad greens, and feta cheese into the bowl of orange and grapefruit segments.\nPour orange and grapefruit juice into a glass measuring cup. Add enough pomegranate juice to reach 1/3 cup. Whisk in 1 teaspoon orange zest, sugar, parsley, and salt. Whisk in oil until dressing is thick.\nDrizzle dressing over salad.\n",
        "picture_link": "4f1jB/8dZxFAxzHFjIzYhtBQOHU0H5K"
    },
    {
        "title": "Hot Mexican Bean Crepes",
        "ingredients": [
            "Crepes: ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 (14 ounce) can pinto beans, drained ADVERTISEMENT",
            "1 cup medium salsa (such as Que Pasa®) ADVERTISEMENT",
            "1 cup canned whole tomatoes ADVERTISEMENT",
            "1 cup drained whole kernel corn ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, milk, water, eggs, and melted butter in a large bowl; beat with a wire whisk until crepe batter is free of lumps.\nHeat a nonstick skillet over medium heat. Pour 1/4 cup of batter into the skillet; cook until bubbles form on the surface, 2 to 3 minutes. Flip and cook crepe for 1 minute on the second side. Transfer to a plate. Repeat with remaining crepe batter.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nPour pinto beans into a small saucepan over medium heat; cook until heated through, about 5 minutes. Remove from heat and let cool slightly. Mash into a fine puree using a potato masher.\nCombine salsa, tomatoes, corn, ginger, and chili powder in a large bowl. Mix in pureed beans. Spoon some of the bean mixture into the center of each crepe. Roll up crepes, tucking ends in neatly.\nPlace filled crepes seam-side down on the lined baking sheet. Sprinkle grated Monterey Jack cheese on top.\nBake in the preheated oven until cheese is melted, about 10 minutes.\n",
        "picture_link": "prt0UsB9onb67WaW8XZs5xvaqyfiZbG"
    },
    {
        "title": "Avocado and Bacon-Stuffed Eggs",
        "ingredients": [
            "4 slices bacon, trimmed of fat and cut into small pieces ADVERTISEMENT",
            "1 avocado, halved and pitted ADVERTISEMENT",
            "6 hard-boiled eggs, halved ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "2 teaspoons prepared yellow mustard ADVERTISEMENT",
            "1 splash lime juice ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 5 minutes. Drain on paper towels.\nMash avocado in a large bowl with a fork. Mix in bacon, yolks from the hard-boiled eggs, mayonnaise, mustard, and lime juice.\nSpoon avocado mixture into the egg whites. Garnish eggs with red pepper flakes. Chill until ready to serve.\n",
        "picture_link": "/1kcImJFFFZquwNjDlxPmyu9Jovwzli"
    },
    {
        "title": "Gyoza (Japanese Potstickers)",
        "ingredients": [
            "1/2 pound ground pork ADVERTISEMENT",
            "1/2 head napa cabbage, shredded ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 green onions, thinly sliced ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger, grated ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon sriracha sauce, or more to taste ADVERTISEMENT",
            "1 small clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon sesame oil ADVERTISEMENT",
            "30 gyoza wrappers, or as needed ADVERTISEMENT",
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "Dipping Sauce: ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons seasoned rice vinegar ADVERTISEMENT",
            "1 1/2 teaspoons sesame oil ADVERTISEMENT",
            "1 dash sriracha sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ground pork, napa cabbage, egg, green onions, ginger, 1 tablespoon soy sauce, 1 teaspoon sriracha sauce, garlic, and 1/4 teaspoon sesame oil in a bowl.\nArrange gyoza wrappers on a flat work surface. Place 1 teaspoon of pork mixture in the middle of each wrapper. Wet edges with your finger or a brush. Fold up sides to form a semicircle; pinch edges to seal.\nHeat oil in a heavy skillet over medium-high heat. Add 12 to 15 gyoza to the skillet. Cook until golden brown on the bottom, about 2 minutes. Pour in 1/2 cup water; cover and cook until water is absorbed, 5 to 7 minutes. Transfer gyoza to a plate. Repeat with remaining gyoza.\nMix 2 tablespoons soy sauce, rice vinegar, 1 1/2 teaspoon sesame oil, and 1 dash sriracha sauce together to make dipping sauce. Serve dipping side alongside gyoza.\n",
        "picture_link": "L.x/IutEGYN0qucNnrDycqgPGefl8Be"
    },
    {
        "title": "Moroccan Chicken Tagine",
        "ingredients": [
            "Moroccan Spice Mix: ADVERTISEMENT",
            "1/4 cup ground cinnamon ADVERTISEMENT",
            "1/4 cup ground cumin ADVERTISEMENT",
            "2 tablespoons ground turmeric ADVERTISEMENT",
            "2 tablespoons ground coriander ADVERTISEMENT",
            "2 tablespoons ground ginger ADVERTISEMENT",
            "2 tablespoons crushed dried mint ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 cup chopped dried apricots ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/4 cup olive oil, or as needed ADVERTISEMENT",
            "4 bone-in chicken thighs ADVERTISEMENT",
            "1/2 small onion, minced ADVERTISEMENT",
            "2 teaspoons chopped garlic ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/2 bunch fresh cilantro, chopped ADVERTISEMENT",
            "1/4 cup toasted sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cinnamon, cumin, turmeric, coriander, ginger, mint, salt, and pepper together in a bowl. Measure out 1/2 cup spice mix and set the remaining aside for another use.\nBring a small pot of water to a boil; add apricots and raisins. Cook until fruit is soft, about 5 minutes. Drain, reserving 1/2 cup of cooking water.\nPour enough olive oil into a large skillet or Dutch oven to coat the bottom; turn heat to medium. Coat chicken with the 1/2 cup spice mix and place in the hot oil; cook until golden brown and releases easily from the skillet, 3 to 4 minutes per side.\nMix onion and garlic into skillet with chicken; cook and stir until fragrant, 2 to 3 minutes. Add apricots, raisins, reserved 1/2 cup water from fruit, chicken broth, and honey; reduce heat to low and cover. Cook until chicken is very tender, 1 1/2 to 2 hours.\nServe chicken garnished with cilantro and almonds.\n",
        "picture_link": "tJS5oOSzK4YkaJbi1w2aE/1YRZAjIlS"
    },
    {
        "title": "Chef John's Refried Beans",
        "ingredients": [
            "Beans: ADVERTISEMENT",
            "1 pound dry pinto beans, soaked overnight ADVERTISEMENT",
            "4 whole garlic cloves, peeled ADVERTISEMENT",
            "1/2 teaspoon dried epazote ADVERTISEMENT",
            "9 cups cold water ADVERTISEMENT",
            "Refried Beans: ADVERTISEMENT",
            "1/2 cup lard ADVERTISEMENT",
            "1 1/2 cups diced onions ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "2 tablespoons minced serrano chili pepper ADVERTISEMENT",
            "1 teaspoon ground dried chipotle pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain soaked beans and transfer them to a stock pot. Add garlic, epazote, and cold water. Place pot over high heat and bring to a boil. Stir. Reduce heat to low. Simmer uncovered until beans are soft, 1 1/2 to 2 hours. Drain the beans and reserve all the liquid.\nMelt lard in a large skillet over medium-high heat. Add onions and salt; cook until onions start to brown, 10 to 12 minutes. Stir in serrano pepper and chipotle powder; cook 1 minute. Transfer drained beans into skillet. Mash about half the beans with a potato masher or back of a spoon. Ladle some bean cooking liquid to skillet. Continue to mash and stir beans as you gradually add more liquid. Mash until the beans have reached your preferred consistency and texture. Taste and add more salt, if desired.\n",
        "picture_link": "hCIOpoS/j37vJhTqL2jLkajeO.hWI5W"
    },
    {
        "title": "Taiwanese Dumplings",
        "ingredients": [
            "2 heads napa cabbage, finely chopped ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "2 pounds ground pork ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "3 jalapeno peppers, minced ADVERTISEMENT",
            "1 (2 inch) piece ginger root, peeled and minced ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 (16 ounce) packages potsticker wrappers, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread cabbage and cilantro over a clean dish towel. Gather up towel and squeeze out as much moisture from the cabbage as possible.\nTransfer cabbage and cilantro to a bowl. Add pork, egg whites, jalapeno peppers, ginger, and sesame oil. Mix thoroughly with your hands. Season with salt and pepper.\nCover 2 baking sheets with waxed paper. Fill a small bowl with water.\nHold a potsticker wrapper in the palm of your hand. Place a tablespoonful of the pork mixture in the center. Dip a finger in water and use it to wet the edges of the wrapper. Fold up edges and pinch together to seal. Transfer dumpling to a prepared baking sheet. Repeat with remaining wrappers and pork mixture.\nFreeze dumplings until firm, about 2 hours. Transfer to large resealable plastic bags.\n",
        "picture_link": ".aqN705oYUtzD6sV5LknHNEFWJvOcDW"
    },
    {
        "title": "Princess Peach",
        "ingredients": [
            "ice cubes ADVERTISEMENT",
            "2 fluid ounces Malibu rum ADVERTISEMENT",
            "2 fluid ounces peach-flavored vodka ADVERTISEMENT",
            "2 fluid ounces ginger ale ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice; add Malibu rum, peach-flavored vodka, and ginger ale. Cover and shake until the outside of the shaker has frosted. Strain into a chilled martini glass.\n",
        "picture_link": "NS2ZllbrdEPw8bmLlNqgSX8PXlAqGYG"
    },
    {
        "title": "Blue Cheese French Fries",
        "ingredients": [
            "1 (28 ounce) package frozen French fries (such as Ore Ida®) ADVERTISEMENT",
            "3 slices bacon, sliced into 1/4-inch pieces ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 cup minced scallions ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/2 cup blue cheese crumbles ADVERTISEMENT",
            "2 tablespoons half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Spread French fries in a single layer on a baking sheet.\nBake in the preheated oven until lightly golden and crisp, 24 to 34 minutes.\nPlace bacon in a large skillet and cook over medium-high heat; cook and stir until evenly browned, about 10 minutes. Drain bacon slices on paper towels, reserving some of the bacon grease in the skillet. Slice into 1/4-inch strips.\nStir butter into the bacon grease and set skillet over medium heat; add scallions and garlic. Cook and stir until scallions are soft and browning, about 5 minutes. Add blue cheese; cook and stir with a spatula until cheese is melted, 2 to 3 minutes. Stir in half-and-half until sauce is smooth, 2 to 3 minutes. Remove from heat and let sit for 2 minutes.\nArrange fries on a plate and drizzle sauce over fries. Sprinkle bacon strips on top.\n",
        "picture_link": "ejUmPgbkQUwGFN3d.VouFWNGyXXwMay"
    },
    {
        "title": "Chicken Alfredo Stuffed Manicotti",
        "ingredients": [
            "4 cups chicken stock, or as needed ADVERTISEMENT",
            "3 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 (8 ounce) package manicotti shells ADVERTISEMENT",
            "3 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (8 ounce) package fresh mushrooms, finely chopped ADVERTISEMENT",
            "1/4 cup chopped green onions (optional) ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 (16 ounce) jars Alfredo sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken stock to a boil in a saucepan. Add chicken breasts. Cook until chicken can be easily pulled apart with a fork, about 30 minutes. Drain and cool until easily handled. Shred using 2 forks.\nPreheat oven to 375 degrees F (190 degrees C).\nBring a large pot of lightly salted water to a boil. Cook manicotti in the boiling water, stirring occasionally, until still firm to the bite, about 7 minutes. Drain.\nMix shredded chicken, 2 cups mozzarella cheese, cream cheese, mushrooms, green onions, and garlic together in a bowl. Pour in enough Alfredo sauce until filling has a thick and creamy consistency.\nSpoon chicken filling into a piping bag, reserving about 1/2 cup of the filling in the bowl. Pipe filling into manicotti.\nMix remaining Alfredo sauce with reserved chicken filling in the bowl.\nArrange stuffed manicotti in a baking dish. Cover evenly with Alfredo sauce mixture until there are no dry spots. Sprinkle remaining 1 cup mozzarella cheese on top. Cover baking dish with aluminum foil.\nBake in the preheated oven until cheese is melted and sauce is bubbling, about 50 minutes. Remove aluminum foil and continue baking until cheese starts to brown, about 10 minutes.\n",
        "picture_link": "Bm2mBST90WcRNd9G4WSAb.qMzahwuGG"
    },
    {
        "title": "Alfredo Chicken Lasagna Rolls",
        "ingredients": [
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "2 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "9 lasagna noodles ADVERTISEMENT",
            "1 cup Alfredo sauce, or as desired ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese, or to taste ADVERTISEMENT",
            "1/4 cup crumbled cooked bacon, or to taste (optional) ADVERTISEMENT",
            "1 pinch dried oregano, or more to taste ADVERTISEMENT",
            "1 pinch garlic salt, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine evaporated milk, chicken, and ranch dressing mix in a skillet over medium heat; cook until chicken is no longer pink in the center, 10 to 15 minutes. Shred chicken.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Drain and dry on paper towels.\nSpread Alfredo sauce over each noodle; top with shredded chicken.\nCombine mozzarella cheese, bacon, oregano, and garlic salt in a bowl; sprinkle over chicken layer. Roll each noodle around the filling and place rolls in an 8-inch baking dish.\nBake in the preheated oven until cheese is melted and bubbly, 30 to 35 minutes.\n",
        "picture_link": "9t4yRQpIj8LZI2cFcv00YQRbsweZfl."
    },
    {
        "title": "Perfect Chicken Vegetable Soup ",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 skinless, boneless chicken breasts, cut into bite-sized pieces ADVERTISEMENT",
            "1/2 large white onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "2 small red potatoes, chopped ADVERTISEMENT",
            "1/4 head cabbage, chopped ADVERTISEMENT",
            "1 large carrot, chopped ADVERTISEMENT",
            "2 eggs, beaten (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large pot over medium heat. Add chicken breasts, onion, and garlic; cook and stir until chicken is no longer pink in the center, about 5 minutes.\nPour chicken broth into the pot; bring to a boil. Stir in potatoes, cabbage, and carrot. Simmer soup until potatoes are tender, 30 to 40 minutes.\nBring soup back to a boil. Drizzle in eggs, stirring until cooked, about 1 minute. Season with salt and pepper.\n",
        "picture_link": "BQmaFK0KjHbjOcOtvTwrElUWfgBAAnq"
    },
    {
        "title": "Homemade Baked Manicotti",
        "ingredients": [
            "9 eggs, at room temperature ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter, softened, or as needed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 (16 ounce) containers ricotta cheese ADVERTISEMENT",
            "1 bunch fresh mint, finely chopped ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ground black pepper ADVERTISEMENT",
            "2 (32 ounce) jars pasta sauce, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 9 eggs, water, and all-purpose flour in a large bowl. Blend with an electric mixer until batter is completely smooth. Let batter rest for 30 minutes.\nHeat an 8-inch skillet over medium-high heat; brush with some butter. Pour 2 1/2 tablespoons of the batter into the pan, swirling to coat the bottom. Cook until the top is dry to the touch and bottom is still pale, about 30 seconds. Transfer crepe to a plate. Repeat with remaining batter.\nWhisk 3 eggs in a large bowl. Stir in ricotta cheese. Fold in mint, salt, and pepper until well combined.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace 1/3 cup of the ricotta mixture on one end of a crepe. Roll over once and pull the other end up over the top. Repeat with remaining ricotta mixture and crepes.\nCover the bottom of a large baking dish with some pasta sauce. Arrange filled crepes on top. Cover filled crepes with a little more sauce. Cover baking dish with aluminum foil.\nBake in the preheated oven until sauce is bubbly, about 55 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Thai-Style Turkey Burgers",
        "ingredients": [
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1/3 cup minced fresh cilantro ADVERTISEMENT",
            "2 green onions, thinly sliced ADVERTISEMENT",
            "1 1/2 tablespoons minced fresh ginger, or more to taste ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound lean ground turkey ADVERTISEMENT",
            "1/3 cup bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk egg and soy sauce together in a bowl; add cilantro, green onions, ginger, garlic, salt, and pepper. Mix turkey and bread crumbs into mixture and mix well; form into 4 patties.\nHeat a large non-stick skillet over medium heat. Place patties in the hot skillet; cover skillet and cook, turning once, until burgers are no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "5k9uH4uj6mvvloslcp2U9slbw0jOnda"
    },
    {
        "title": "Italian \"Stuffed\" Toast (Toast Farcito)",
        "ingredients": [
            "2 slices prosciutto ADVERTISEMENT",
            "2 slices fontina cheese ADVERTISEMENT",
            "4 slices thinly sliced sandwich bread ADVERTISEMENT",
            "1/4 cup chopped giardiniera (pickled Italian vegetables) ADVERTISEMENT",
            "2 hot pickled peppers (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a panino press according to the manufacturer's instructions.\nPlace 1 slice prosciutto and 1 slice fontina cheese onto a slice of bread; repeat with remaining prosciutto, fontina cheese, and slice of bread. Add 1/2 of the giardiniera on top of each cheese layer and top sandwiches with remaining bread slices, creating 2 sandwiches.\nCook each panino in the press until the cheese has melted and the bread has toasted, about 3 minutes. Serve with hot pickled peppers on the side.\n",
        "picture_link": "PnHyKYxwu6YybqC89BISiH1oSGIJ4ZC"
    },
    {
        "title": "Chef John's Chocolate Souffle",
        "ingredients": [
            "1 teaspoon melted butter, or as needed ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 ounces 70% dark chocolate, broken into pieces ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "4 1/3 tablespoons cold milk ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 large egg yolk ADVERTISEMENT",
            "2 large egg whites ADVERTISEMENT",
            "1 pinch cream of tartar ADVERTISEMENT",
            "1 tablespoon white sugar, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a rimmed baking sheet with parchment paper.\nBrush bottom and sides of 2 (5-ounce) ramekins lightly with 1 teaspoon melted butter; cover bottom and sides right up to the rim. Add 1 tablespoon white sugar to ramekins. Rotate ramekins until sugar coats all surfaces. Pour off extra sugar.\nPlace chocolate pieces in a metal mixing bowl. Place bowl over a pan of about 3 cups hot water over low heat. Do not let water boil or come to a simmer.\nMelt 1 tablespoon butter in a skillet over medium heat. Sprinkle in flour. Whisk until flour is incorporated into butter and mixture thickens, about 1 minute. Reduce heat to low. Whisk in cold milk until mixture becomes smooth and thickens, 2 or 3 minutes. Remove skillet from heat. Transfer mixture to bowl with melted chocolate. Add salt and very small pinch of cayenne pepper. Mix together thoroughly. Add egg yolk and mix to combine. Leave bowl above the hot (not simmering) water to keep chocolate warm while you whip the egg whites.\nPlace 2 egg whites in a mixing bowl; add cream of tartar. Whisk until mixture begins to thicken and a drizzle from the whisk stays on the surface about 1 second before disappearing into the mix, 2 or 3 minutes. Add 1/3 of sugar and whisk in. Whisk in a bit more sugar about 15 seconds; whisk in the rest of the sugar. Continue whisking until mixture is about as thick as shaving cream and holds soft peaks, 3 to 5 minutes.\nTransfer a little less than half of egg whites to chocolate. Mix until egg whites are thoroughly incorporated into the chocolate, 1 or 2 minutes. Add the rest of the egg whites; gently fold into the chocolate with a spatula, lifting from the bottom and folding over. Stop mixing after the egg white disappears. Divide mixture between 2 prepared ramekins. Place ramekins on prepared baking sheet.\nBake in preheated oven until scuffles are puffed and have risen above the top of the rims, 12 to 15 minutes.\n",
        "picture_link": "MIyCpfdnbskMSMse9XY5ksb8tM35zEy"
    },
    {
        "title": "Slow Cooker Mediterranean Beef with Artichokes",
        "ingredients": [
            "1 tablespoon grapeseed oil ADVERTISEMENT",
            "2 pounds stewing beef ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and halved ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "4 cloves garlic, chopped or more to taste ADVERTISEMENT",
            "1 (32 fluid ounce) container beef broth ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1/2 cup pitted and roughly chopped Kalamata olives (optional) ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium-high heat. Cook beef in the hot oil until browned, about 2 minutes per side.\nTransfer beef to a slow cooker. Cover with artichoke hearts, onion, and garlic. Pour in beef broth, tomato sauce, and diced tomatoes. Stir in olives, oregano, parsley, basil, cumin, bay leaf.\nCook on Low until beef is tender, about 7 hours.\n",
        "picture_link": "keBQovOfB5QWDqMjyziVcTY4R9xGOAO"
    },
    {
        "title": "Air-Fried Buffalo Chicken",
        "ingredients": [
            "1/2 cup plain fat-free Greek yogurt ADVERTISEMENT",
            "1/4 cup egg substitute ADVERTISEMENT",
            "1 tablespoon hot sauce (such as Frank's®) ADVERTISEMENT",
            "1 teaspoon hot sauce (such as Frank's®) ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "1 tablespoon sweet paprika ADVERTISEMENT",
            "1 tablespoon garlic pepper seasoning ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts, cut into 1-inch strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk Greek yogurt, egg substitute, and 1 tablespoon plus 1 teaspoon hot sauce in a bowl.\nMix panko bread crumbs, paprika, garlic pepper, and cayenne pepper in a separate bowl.\nDip chicken strips into yogurt mixture; coat with panko bread crumb mixture.\nArrange coated chicken strips in a single layer in an air fryer. Cook until evenly browned, about 8 minutes per side.\n",
        "picture_link": "spOZ.E73DiUGB.UTEnKhhFE/HQgGofm"
    },
    {
        "title": "Refreshing Citrus Salad ",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon ground paprika ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "1 (12 ounce) bag mixed salad greens ADVERTISEMENT",
            "1 (8 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1/2 cup grape tomatoes ADVERTISEMENT",
            "1/2 cup toasted sliced almonds ADVERTISEMENT",
            "1/4 cup crumbled Gorgonzola cheese ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine canola oil, sugar, apple cider vinegar, sesame oil, onion, poppy seeds, sesame seeds, garlic, and paprika in a jar. Close and shake jar until dressing is well mixed.\nPlace salad greens in a large bowl. Pour in half of the dressing; toss to mix. Arrange mandarin oranges, grape tomatoes, almonds, Gorgonzola cheese, and green onions on top.\n",
        "picture_link": "s/SFm6beAPX4TbH/DhXm7s5I84rDZBq"
    },
    {
        "title": "Skillet Chili 'N Eggs",
        "ingredients": [
            "2 (15 ounce) cans chili with beans ADVERTISEMENT",
            "1 (7 ounce) can whole-kernel corn, drained ADVERTISEMENT",
            "4 eggs, room temperature ADVERTISEMENT",
            "3 slices American Cheese, cut diagonally into halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chili with beans and corn together in a large skillet over medium heat; cook until heated through, about 5 minutes.\nBreak eggs onto chili mixture and top eggs with American cheese.\nCover skillet and cook until eggs are set and cheese is melted, about 10 minutes.\n",
        "picture_link": "9zV6GWBY3vKj6.bGTAGTAXWIm7omtEi"
    },
    {
        "title": "Potato Hay",
        "ingredients": [
            "2 russet potatoes ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut potatoes into spirals using the medium grating attachment on a spiralizer, cutting the spirals with kitchen shears after 4 or 5 rotations.\nSoak potato spirals in a bowl of water for 20 minutes. Drain and rinse well. Pat potatoes dry with paper towels, removing as much moisture as possible.\nPlace potato spirals in a large resealable plastic bag. Add oil, salt, and pepper; toss to coat.\nPreheat an air fryer to 360 degrees F (180 degrees C).\nPlace half of the potato spirals in the fry basket and insert into the air fryer. Cook until golden, about 5 minutes.\nIncrease temperature to 390 degrees F (200 degrees C). Pull out the fry basket and toss potato spirals using tongs. Return basket to the air fryer and continue cooking, tossing occasionally, until golden brown, 10 to 12 minutes.\nReduce temperature to 360 degrees F (180 degrees C) and repeat with remaining potato spirals.\n",
        "picture_link": "wPEji3C1XAlNxQv8nGteYPZSCdWrVbS"
    },
    {
        "title": "Enchilada Lasagna ",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 1/4 pounds ground turkey ADVERTISEMENT",
            "1 (28 ounce) can enchilada sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with lime juice and cilantro ADVERTISEMENT",
            "1 (16 ounce) package small-curd cottage cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "5 (6 inch) corn tortillas, halved ADVERTISEMENT",
            "2 cups shredded Mexican cheese blend ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 green onion, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Add onion and garlic; cook and stir until onion is translucent, about 5 minutes. Stir in ground turkey; cook until no longer pink, about 5 minutes. Drain excess grease.\nStir enchilada sauce and diced tomatoes into the pot. Simmer until flavors combine, about 20 minutes. Remove from heat.\nPreheat oven to 375 degrees F (190 degrees C).\nMix cottage cheese, egg, and cumin together in a small bowl.\nSpread 1/3 of the turkey sauce in the bottom of an 8-inch baking dish. Cover with 1/2 of the corn tortillas. Spread 1/2 of the cottage cheese mixture on top. Sprinkle 1/3 of the Mexican cheese on top. Repeat layers once more, ending with remaining turkey sauce and Mexican cheese.\nSpray a large piece of aluminum foil with cooking spray; cover baking dish with aluminum foil.\nBake in the preheated oven until bubbly, about 30 minutes. Remove aluminum foil and continue baking until top is browned, about 15 minutes. Cool for 15 minutes before serving. Garnish with green onion.\n",
        "picture_link": "GyP.A1P8lKfzTSua99ZusAj1p//UvDS"
    },
    {
        "title": "Chef John's No-Knead Ciabatta",
        "ingredients": [
            "3 1/2 cups white bread flour ADVERTISEMENT",
            "1/2 cup whole wheat bread flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon active dry yeast ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons cornmeal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place white and wheat flour in a large bowl. Add salt, yeast, and water. Mix until a wet sticky dough comes together, about 5 minutes. Scrape down sides of bowl. Cover with foil. Allow dough to rise for 18 hours at room temperature. It should not be too warm.\nPunch dough down with a spatula and fold it over a few times.\nLightly oil a heavy rimmed baking sheet with vegetable oil. Sprinkle generously with cornmeal.\nLightly spray a work surface with water. Place a long sheet of plastic wrap on the damp surface to hold it in place. Sprinkle plastic wrap with flour. Scrape the dough onto the floured surface. Sprinkle flour on top of the dough. Gently stretch and pull dough into a long, flat rectangular shape, 12 to 15 inches long. Bring plastic sheet to edge of prepared pan and flip the dough into the prepared pan. Reshape the dough, if necessary. Dust with flour. Cover with a light dry towel. Let rise about 2 hours.\nPreheat oven to 425 degrees F (220 degrees C).\nBake dough in preheated oven until loaf is nicely browned, 35 to 45 minutes.\n",
        "picture_link": "er6c7.WlGAa7mUyYzcp8Wv5khf3S/im"
    },
    {
        "title": "Grilled Hawaiian Salmon with Strawberry Pineapple Salsa",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "1/3 cup strawberry preserves ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "2 tablespoons toasted sesame oil ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound skin-on salmon fillets ADVERTISEMENT",
            "Strawberry-Pineapple Salsa: ADVERTISEMENT",
            "1 cup chopped fresh strawberries ADVERTISEMENT",
            "1 cup chopped fresh pineapple ADVERTISEMENT",
            "1/3 cup chopped sweet onion (such as Vidalia) ADVERTISEMENT",
            "1/4 cup chopped fresh parsley, or to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix strawberry preserves, soy sauce, apple cider vinegar, sesame oil, garlic powder, onion powder, ginger, and pepper together in a bowl to make marinade. Pour 1/3 cup into a glass measuring cup; reserve. Place salmon fillets in the bowl.\nMarinate salmon in the refrigerator for 1 hour.\nMix strawberries, pineapple, onion, and parsley in a bowl to make salsa. Cover with plastic wrap and refrigerate.\nPreheat grill for medium heat and lightly oil the grate. Oil a stainless steel grill basket. Place salmon fillets skin-side up in the basket; cook for 6 minutes. Flip and continue cooking skin-side down, about 6 minutes more.\nDivide salmon fillets among serving plates; drizzle reserved 1/3 cup marinade on top. Spoon salsa on top.\n",
        "picture_link": "KZPnFTF6xgzkxGUbaBuiaZ6lunhxw4a"
    },
    {
        "title": "Oatmeal Cinnamon Pancakes",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups old-fashioned rolled oats ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup unsweetened applesauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, oats, brown sugar, baking powder, cinnamon, and salt in a large bowl.\nWhisk milk, eggs, and applesauce together in a separate bowl; stir into flour mixture until batter is smooth.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 1 to 2 minutes. Repeat with remaining batter.\n",
        "picture_link": "c07aw7Z3Qxd6NvoDDa0REnaEvWbh.cO"
    },
    {
        "title": "Blueberry Almond Pancakes",
        "ingredients": [
            "5 tablespoons butter, divided ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons almond extract ADVERTISEMENT",
            "1/4 cup water, or as needed ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 3 tablespoons butter in a microwave-safe bowl; heat in microwave until melted, 20 to 30 seconds.\nWhisk flour, sugar, baking powder, and salt together in a bowl.\nBeat yogurt and eggs together in a bowl; add melted butter and almond extract and beat well. Fold flour mixture into yogurt mixture until batter is well combined. Add water, 1 tablespoon at a time, until batter reaches a pourable consistency.\nMelt remaining butter in a large skillet or griddle over medium-low heat. Pour 1/4 cup batter into skillet and place 6 to 10 blueberries onto the batter; cook until batter starts to bubble, 1 to 2 minutes. Flip and cook until bottom is lightly browned, about 30 seconds. Repeat with remaining batter and blueberries.\n",
        "picture_link": "wGBd/Pw41FIm6EHiLouCHmYyALIvXN."
    },
    {
        "title": "Piadina (Italian Flatbread)",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "7 tablespoons lard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour and salt together in a large bowl. Mix in water a little at a time. Rub in lard until dough comes together in a ball.\nTransfer dough to a lightly floured work surface; knead until smooth and elastic, about 10 minutes. Divide the dough into 6 pieces; roll out each piece to 1/16-inch thickness.\nHeat a dry, heavy skillet or flat griddle over medium-high heat. Cook each piece until golden brown, about 2 minutes per side.\n",
        "picture_link": "pDbgIrxPN32tNHL2x5/vsvvVVdrkXum"
    },
    {
        "title": "Sicilian Pizza Sauce",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "1 (28 ounce) can tomato puree ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium heat. Add onions; cook and stir until just starting to turn golden, 5 to 8 minutes. Stir in tomato puree, water, oregano, basil, salt, and pepper.\nBring tomato sauce to a simmer. Reduce heat to medium-low; cover and simmer until flavors blend, about 30 minutes.\n",
        "picture_link": "vS1/MWjyAWPhCuquTowHaCHKzRJIya6"
    },
    {
        "title": "Beautiful Brown Soda Bread",
        "ingredients": [
            "1 teaspoon margarine ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons cream of tartar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease a baking sheet with 1 teaspoon margarine.\nSift all-purpose flour, whole wheat flour, baking soda, cream of tartar, and salt together into a bowl; mix well. Add 2 tablespoons margarine and rub into flour mixture until crumbly. Pour milk over mixture and stir to form a soft, but not sticky dough.\nDust your hands with flour and bring dough together, shaping into a ball. Place ball onto the baking sheet and flatten slightly. Cut an \"x\" on the top to divide it into quarters.\nBake in the preheated oven until golden and risen, 20 to 25 minutes. The base should sound hollow when the loaf is lifted using a towel and you knock on it with your knuckles. Cool a wire rack.\n",
        "picture_link": "uq2WLn27qKvrLGcwUNijnCRd.1wmlEu"
    },
    {
        "title": "Texas Chicken Vegetable Soup ",
        "ingredients": [
            "2 (46 fluid ounce) bottles vegetable juice ADVERTISEMENT",
            "4 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "2 cups cooked and cubed chicken ADVERTISEMENT",
            "2 cups chopped green onions ADVERTISEMENT",
            "1/2 bunch cilantro, chopped ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 (14.5 ounce) package tortilla chips, crushed ADVERTISEMENT",
            "2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vegetable juice, chicken broth, chicken, green onions, cilantro, Worcestershire sauce, garlic powder, chili powder, and cumin in a large pot. Bring to a boil; reduce heat and simmer until flavors combine, about 25 minutes.\nLadle into bowls and garnish with crushed tortilla chips and Monterey Jack cheese.\n",
        "picture_link": "YejfL8b4ABS756j4/r2eYloTYSDjxFK"
    },
    {
        "title": "Cara Cara Cupcakes",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "2 tablespoons grated orange zest ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup fresh Cara Cara orange juice ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 24 standard muffin cups with papers.\nWhisk flour, baking powder, salt, and baking soda together in a large bowl.\nBeat white sugar, butter, and orange zest together in a bowl with an electric mixer at medium speed until light and fluffy, about 3 minutes; beat in eggs, one at a time, beating well after each addition.\nStir cream, orange juice, and vanilla extract together in a cup.\nBeat flour mixture into butter mixture on low speed in 3 batches, alternating with cream mixture and ending with flour mixture, just until fully combined. Fill prepared muffin cups 3/4 full with batter.\nBake in the preheated oven until a toothpick inserted near the center comes out clean, about 25 minutes. Allow to cool completely on a wire rack, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baked Rice with Leeks and Bok Choy",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 cup chopped leeks ADVERTISEMENT",
            "6 ounces baby bella (crimini) or white mushrooms, sliced ADVERTISEMENT",
            "1 1/4 cups uncooked long grain white rice ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "3 cups Swanson® Chicken Broth ADVERTISEMENT",
            "3 cups chopped bok choy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nHeat oil in a large oven-proof skillet over medium-high. Add leeks and cook until slightly softened, about 3 minutes. Add mushrooms and cook another 3 to 5 minutes. Stir in rice and continue stirring until rice is coated with oil.\nPour in wine, and bring to a gentle boil over medium heat. Cook until rice absorbs almost all of the liquid, about 1 minute. Add Swanson(R) Chicken Broth, and bring to a boil. Cover skillet; transfer to oven.\nBake 10 minutes. Gently stir in bok choy. Continue baking until rice absorbs all of the liquid, about 10 minutes. Remove skillet from oven; stir, and let stand, covered, for 10 minutes before serving.\n",
        "picture_link": "FrNl5311Tuw4/k5urWNbv63VoxA3b16"
    },
    {
        "title": "Quick Peach Cobbler In a Mug",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon non-fat dry milk ADVERTISEMENT",
            "1/8 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 (4 ounce) container sliced peaches, well drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a mug in microwave, about 20 seconds.\nStir water, flour, dry milk, baking powder, ground cinnamon, and salt into butter until well blended. Place peach slices on top of batter.\nMicrowave on 70% power until cooked through, about 2 minutes. Let stand in microwave for 1 minute to set.\n",
        "picture_link": "zFyNVOFhnUewtttxzxv3FZbxmTy7NES"
    },
    {
        "title": "Ginger Snap Brownies",
        "ingredients": [
            "1 (18.25 ounce) package brownie mix ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/3 cup melted unsalted butter ADVERTISEMENT",
            "2 tablespoons strong brewed coffee ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 (10 ounce) bag chocolate chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch baking dish.\nMix brownie mix, cocoa powder, brown sugar, confectioners' sugar, cinnamon, cloves, nutmeg, allspice, and ginger together in a bowl.\nStir butter and coffee together in a bowl; allow to cool for 5 minutes. Stir sour cream and vanilla extract into butter mixture; stir into brownie mix mixture and add egg. Stir 25 times with a wooden spoon until batter is smooth; fold in chocolate chips and stir 25 more times. Pour into the prepared baking dish.\nBake in the preheated oven until edges start to pull away from the sides, 20 to 30 minutes. Cool brownies before cutting.\n",
        "picture_link": "shxXBxiBzqCmAo7/azlM5tvFH208Fre"
    },
    {
        "title": "Power Balls",
        "ingredients": [
            "1 cup oats ADVERTISEMENT",
            "1 cup coconut flakes ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup ground flax seeds ADVERTISEMENT",
            "1/2 cup hemp seed hearts ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "1/2 cup almond butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir oats, coconut, honey, ground flax seeds, hemp seed hearts, chocolate chips, almond butter, and vanilla extract together in a bowl until combined. Roll dough into 3/4-inch balls and refrigerate until firm, about 2 hours.\n",
        "picture_link": "Csv2uFNoCyuT2r9XVLSUAusJXG.sfC."
    },
    {
        "title": "Simple Cake Pops",
        "ingredients": [
            "1 (15.25 ounce) package yellow cake mix (such as Betty Crocker®) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 (16 ounce) package prepared chocolate frosting ADVERTISEMENT",
            "18 lollipop sticks ADVERTISEMENT",
            "1 (14 ounce) bag chocolate candy melts ADVERTISEMENT",
            "1 (.75 ounce) tube decorating icing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBeat cake mix, water, eggs, and oil in a bowl using an electric mixer on low speed for 30 seconds. Increase speed to medium and beat for 2 minutes more. Pour batter into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 28 to 33 minutes. Cool completely, at least 1 hour.\nCrumble cake into a large bowl. Stir frosting into cake crumbles until mixture is sticky but not too smooth. Chill in refrigerator, at least 30 minutes.\nRoll cake mixture into 1 1/2-inch balls and arrange on a baking sheet. Place 1 lollipop stick into each ball.\nMelt about 1/4 cup chocolate candy melts in a microwave-safe bowl in the microwave, about 20 seconds. Dip each cake pop in the melted chocolate. Repeat melting chocolate and dipping remaining cake pops. Decorate pops with decorating icing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pumpkin Spice Bagel",
        "ingredients": [
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "2/3 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3/4 cup canned pumpkin ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "3 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "6 cups water, or more as needed ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast in warm water in a large bowl; add pumpkin, brown sugar, cinnamon, salt, nutmeg, allspice, and cloves and mix well. Stir in enough flour to make a soft dough. Turn dough onto a work surface and knead by hand 6 to 8 minutes or mix in a stand mixer. Transfer dough to a greased bowl, cover with a damp towel, and let rise in a warm place until doubled in size, about 1 hour.\nPunch dough down and divide into 8 balls. Poke a hole in the middle of each ball using your finger to create a bagel shape. Arrange bagels on a baking sheet and let rise, 10 to 15 minutes.\nFill a large pot with 6 cups water and white sugar and bring to a boil. Slightly flatten the bagels and drop a couple at a time into the boiling water; cook for 1 1/2 minutes. Flip bagels and boil for another 1 1/2 minutes; remove with a slotted spoon and dry on a clean towel. Repeat with remaining bagels.\nPreheat oven to 400 degrees F (200 degrees C). Spray a baking sheet with cooking spray and sprinkle cornmeal on the sheet. Arrange bagels on the baking sheet about 2 inches apart.\nBake in the preheated oven until cooked through, 25 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bo Luc Lac \"French-Vietnamese Shaking Beef\"",
        "ingredients": [
            "Beef Marinade: ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons oyster sauce ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon hoisin sauce ADVERTISEMENT",
            "1 1/2 pounds beef top sirloin, cut into 1-inch cubes ADVERTISEMENT",
            "Vinaigrette: ADVERTISEMENT",
            "1/2 cup rice vinegar ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "Dipping Sauce: ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons cooking oil ADVERTISEMENT",
            "2 bunches watercress, torn ADVERTISEMENT",
            "2 tomatoes, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk garlic, oyster sauce, 1 1/2 tablespoons sugar, fish sauce, sesame oil, soy sauce, and hoisin sauce together in a bowl; add beef. Marinate beef in refrigerator for at least 1 hour.\nWhisk vinegar, 1 1/2 tablespoons sugar, and 1 1/2 teaspoons salt together in a bowl until vinaigrette is smooth; add onion. Refrigerate for 10 minutes to pickle the onion.\nWhisk lime juice, 1/2 teaspoon salt, and black pepper together in a bowl until dipping sauce is smooth. Transfer dipping sauce to ramekins.\nHeat cooking oil in a wok or large skillet over high heat until oil starts to smoke; add beef. Cook in a single layer until beef is seared, about 2 minutes. Cook and stir (or \"shake\") until beef reaches desired doneness, 2 to 4 minutes.\nSpread watercress onto a serving plate and top with tomatoes. Drizzle vinaigrette over tomatoes and layer beef onto watercress; top with onion. Serve dipping sauce on the side.\n",
        "picture_link": "Qddiv4LO/uonxa8bujp4hc.DSs203Dq"
    },
    {
        "title": "Southern Style Chicken Perlo with Andouille Sausage",
        "ingredients": [
            "1 (3 pound) whole chicken ADVERTISEMENT",
            "6 cups water, or as needed to cover ADVERTISEMENT",
            "1 small onion, halved ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound andouille sausage, cut into bite-size pieces ADVERTISEMENT",
            "1 1/2 cups uncooked long-grain white rice ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "3 cups Swanson® Chicken Broth ADVERTISEMENT",
            "2 hard-cooked eggs, peeled and chopped (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in a large pot. Add water to cover, onion, bay leaf, thyme sprig, salt, and pepper. Bring to a boil over medium-high heat. Reduce heat to medium-low; cover and cook until chicken is tender, about 50 minutes.\nTransfer chicken to a cutting board or platter and let cool completely. Remove bones, fat, and skin from chicken. Chop chicken into bite-size pieces and set aside.\nHeat olive oil in a heavy pot over medium heat. Add sausage pieces; brown on all sides. Add rice and paprika to the pot; stir over medium heat until rice is coated with oil and browned bits are stirred from the bottom. Add Swanson(R) Chicken Broth and browned sausage pieces.\nBring to a boil; reduce heat, cover and cook until rice has absorbed the broth, about 30 minutes. Fluff the rice with a fork.\nStir the chicken pieces into the rice. Top with chopped hard-cooked egg just before serving.\n",
        "picture_link": "REWL3UcxMLifCap.XZbd8pZHo9lkkpS"
    },
    {
        "title": "Stuffin' Muffins",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "1 cup diced celery ADVERTISEMENT",
            "2 teaspoons poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 cup Swanson® Chicken Broth ADVERTISEMENT",
            "1 (1 pound) loaf sliced white bread (air dried at least 2 hours), cut into cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter 18 muffin cups.\nMelt butter over medium heat in large stock pot or Dutch oven. Add onion and celery; saute over medium heat until vegetables are soft, about 8 minutes. Season with poultry seasoning, salt, and pepper. Remove pot from heat.\nMix bread cubes into vegetables; stir until bread cubes are evenly coated. Stir in Swanson(R) Chicken Broth; mix well. Press 1/4 cup mixture into buttered muffin tin cups.\nBake in preheated oven until tops of muffins are golden brown, about 35 minutes.\n",
        "picture_link": "G0PYLBlw6P9TodfyRtjXRDAIKWyjBVm"
    },
    {
        "title": "Butternut Squash Soup with Crispy Prosciutto",
        "ingredients": [
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "4 ounces thinly sliced prosciutto, cut into thin strips ADVERTISEMENT",
            "4 stalks celery, sliced ADVERTISEMENT",
            "2 large carrots, peeled and sliced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (4 pound) butternut squash - peeled, seeded, and cubed ADVERTISEMENT",
            "2 (32 ounce) cartons Swanson® Chicken Stock, divided ADVERTISEMENT",
            "1 teaspoon ground thyme ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper, or to taste (optional) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon olive oil in a large soup pot over medium-high heat. Cook prosciutto strips until crispy, 8 to 10 minutes. Drain on paper towels.\nHeat remaining 1 tablespoon olive oil in the same pot over medium-high heat. Add celery, carrots, and onion; saute until vegetables begin to soften, about 10 minutes. Add butternut squash. Pour in chicken stock to cover vegetables (you will not use both boxes of stock here). Season with thyme, sage, cayenne pepper, salt, and pepper. Bring to a boil, reduce heat to low and simmer until vegetables are tender, about 30 minutes. Remove from heat.\nLet soup cool slightly. Blend with an immersion blender. Add more chicken stock to thin to desired consistency.\nLadle soup into bowls and top with crispy prosciutto.\n",
        "picture_link": "r41FkPTHr.bkdOn6o.qJIGyxJHBou2i"
    },
    {
        "title": "Asian Garlic Beef Cubes (Vietnamese Bo Luc Lac or Shaking Beef)",
        "ingredients": [
            "1 1/2 pounds beef tenderloin, cut into cubes ADVERTISEMENT",
            "Marinade: ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons oyster sauce (such as Maekrua®) ADVERTISEMENT",
            "4 large cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1 tablespoon Cabernet Sauvignon wine ADVERTISEMENT",
            "1 teaspoon fish sauce ADVERTISEMENT",
            "1 teaspoon ground black pepper, or more to taste ADVERTISEMENT",
            "1 teaspoon soy sauce (optional) ADVERTISEMENT",
            "1 teaspoon dark soy sauce (optional) ADVERTISEMENT",
            "2 drops sesame oil, or more to taste ADVERTISEMENT",
            "Dipping Sauce: ADVERTISEMENT",
            "1 tablespoon fish sauce (optional) ADVERTISEMENT",
            "1 tablespoon lemon juice (optional) ADVERTISEMENT",
            "1 tablespoon ground black pepper (optional) ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons oyster sauce (such as Maekrua®) ADVERTISEMENT",
            "4 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put beef cubes in a container with a lid. Whisk 2 tablespoons olive oil, 2 tablespoons oyster sauce, 4 minced garlic cloves, wine, 1 teaspoon fish sauce, 1 teaspoon black pepper, soy sauce, dark soy sauce, and sesame oil together in a bowl until marinade is well mixed; pour over beef. Allow beef to marinate, 10 to 30 minutes.\nWhisk 1 tablespoon fish sauce, lemon juice, and 1 tablespoon black pepper together in a bowl until dipping sauce is well mixed.\nHeat 2 tablespoons olive oil in a wok or large skillet over high heat; add beef and marinade. Cook and stir beef mixture, 2 tablespoons oyster sauce, and 4 cloves minced garlic together in hot oil until beef is cooked through and sauce begins to thicken, 5 to 10 minutes. Adding garlic over several times during cooking will produce a better mix of flavors.\nServe beef alongside dipping sauce.\n",
        "picture_link": "PZ8nTOAN9B6icDULuEG16dbxKhISNZi"
    },
    {
        "title": "Bottle and Go Mushroom Soup",
        "ingredients": [
            "1 1/2 cups sliced mushrooms ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 red potatoes, peeled and diced ADVERTISEMENT",
            "1 cube chicken bouillon (such as Knorr®) ADVERTISEMENT",
            "1 pinch dried oregano, or to taste ADVERTISEMENT",
            "1 pinch dried dill weed, or to taste ADVERTISEMENT",
            "1 pinch dried basil, or to taste ADVERTISEMENT",
            "1 pinch dried thyme, or to taste ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute mushrooms, chives, and butter together in a large skillet over medium-high heat until mushrooms are browned, about 10 minutes.\nStir water, red potatoes, chicken bouillon, dried oregano, dried dill weed, dried basil, dried thyme, and garlic salt into mushroom mixture. Bring soup to a boil, then reduce heat to low and simmer until potatoes are fork-tender, about 20 minutes.\nPour soup into a blender or food processor and puree. Transfer soup into canning jars and refrigerate.\n",
        "picture_link": "K6.vqqWXEj1UOuBl0O51d7IolQ5FyJa"
    },
    {
        "title": "Slow-Cooked Chicken Drumsticks ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "5 pounds chicken drumsticks ADVERTISEMENT",
            "2 teaspoons Cajun seasoning ADVERTISEMENT",
            "2 teaspoons poultry seasoning ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon all-purpose flour ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Grease a baking pan with cooking spray.\nArrange chicken drumsticks on the baking pan. Sprinkle Cajun seasoning, poultry seasoning, garlic powder, salt, and pepper over chicken. Sprinkle flour on top. Spray cooking spray over chicken. Cover baking pan with aluminum foil.\nBake in the preheated oven until juices run clear, about 2 1/2 hours. Uncover and spread barbeque sauce evenly over chicken.\nContinue baking, uncovered, until chicken is tender and falling off the bone, about 30 minutes more.\n",
        "picture_link": "2ghe73hCQJmwT0ikT8q6LopafIY6cwe"
    },
    {
        "title": "Slow Cooker Chicken Enchilada Soup ",
        "ingredients": [
            "4 cups chicken broth ADVERTISEMENT",
            "2 (15 ounce) cans black beans, drained ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (12 fluid ounce) can pale ale ADVERTISEMENT",
            "1 (10 ounce) package frozen corn ADVERTISEMENT",
            "1 (8 ounce) package red enchilada sauce (such as Frontera®) ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning ADVERTISEMENT",
            "1 jalapeno pepper, seeded and diced ADVERTISEMENT",
            "1 pound frozen chicken breasts ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chicken broth, black beans, diced tomatoes, pale ale, corn, red enchilada sauce, onion, taco seasoning, and jalapeno pepper together in a slow cooker. Add whole chicken breasts.\nCook on Low until an instant-read thermometer inserted into the center of the chicken reads at least 165 degrees F (74 degrees C), 5 to 6 hours. Remove chicken and shred using 2 forks; stir back into the slow cooker. Continue cooking, 1 to 2 hours more.\nStir cilantro into the slow cooker. Cook on Low until flavors combine, about 15 minutes.\n",
        "picture_link": "51aKIvh4CV0HeU2s2RAKrCs6LtQgmdS"
    },
    {
        "title": "Lita's Albondigas (Meatball Soup)",
        "ingredients": [
            "Meatballs: ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/4 pound tomatillos, husked and chopped ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup uncooked white rice ADVERTISEMENT",
            "3 cloves garlic, peeled and crushed ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "Soup: ADVERTISEMENT",
            "2 pounds tomatoes, peeled ADVERTISEMENT",
            "3 white onions, quartered ADVERTISEMENT",
            "3/4 pound tomatillos, husked and chopped ADVERTISEMENT",
            "2 (7 ounce) cans chipotle peppers in adobo sauce ADVERTISEMENT",
            "3 cloves garlic, peeled and crushed ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 quarts chicken broth ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 large carrots, peeled and chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 lemons, cut into wedges ADVERTISEMENT",
            "1 (12 ounce) package corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground beef, 1/4 pound tomatillos, eggs, white rice, 3 cloves garlic, 1 teaspoon cumin, and 1 teaspoon salt in a large bowl.\nScoop 1 1/2 tablespoon of the beef mixture and roll into a meatball. Repeat with remaining beef mixture.\nCombine tomatoes, 1 onion, 3/4 pound tomatillos, chipotle peppers, and 3 cloves garlic in a blender; puree until smooth.\nHeat oil in a large pot over medium heat. Add tomato puree; cook and stir for 3 minutes. Pour in chicken broth. Season broth with salt and pepper. Bring to a slow boil; reduce heat until broth is barely bubbling.\nLower meatballs carefully into the hot broth; simmer gently for 20 minutes. Add remaining 2 onions, carrots, celery, cilantro, and 1 teaspoon cumin. Simmer until rice in the meatballs is cooked through, about 1 hour and 15 minutes.\nSqueeze some lemon juice into each bowl. Serve with corn tortillas.\n",
        "picture_link": "5L0RTlYPtyYPetEiCH1Rw9yigfRlaCK"
    },
    {
        "title": "Slow Cooker Peach Upside Down Cake",
        "ingredients": [
            "3 (15 ounce) cans sliced peaches in heavy syrup, drained well ADVERTISEMENT",
            "5 tablespoons butter, melted ADVERTISEMENT",
            "2/3 cup packed light brown sugar ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "1/2 teaspoon nutmeg ADVERTISEMENT",
            "1 1/2 sticks butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1/2 teaspoon pure almond extract ADVERTISEMENT",
            "2 cups flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread peach slices between several layers of paper towels and let dry, gently pressing occasionally and replacing any soaked towels, 20 minutes.\nMeanwhile, pour melted butter over bottom of a 6-quart oval slow cooker. Stir together brown sugar, cinnamon, and nutmeg in a bowl and sprinkle over butter.\nArrange peaches in a tight layer over brown sugar. (You may need to make a partial second layer to fit them all in.)\nBeat softened butter with white sugar in a large bowl with an electric mixer until light and fluffy, about 3 minutes. Beat in eggs, 1 at a time, beating well after each addition. Beat in almond extract.\nWhisk together flour, baking powder, and salt in a separate bowl. Working in batches, stir flour mixture into egg mixture alternately with milk, beginning and ending with flour mixture. Mix batter until well combined. Spoon over peaches and spread evenly.\nDrape paper towels over top of slow cooker (to absorb any condensation during baking), then cover with lid. Cook on High until a wooden skewer inserted into center of cake comes out clean, 2 to 2 1/2 hours.\nRemove lid and paper towels. Using oven mitts, remove ceramic liner from slow cooker and let cool 10 minutes. Run a knife around edge of cake and carefully turn out onto a serving platter.\n",
        "picture_link": "Ea62tAITYEw5ltpCRagY6.PeNyJeVZG"
    },
    {
        "title": "Mama's Old-Fashioned Albondigas (Meatball Soup)",
        "ingredients": [
            "Stock: ADVERTISEMENT",
            "1 gallon water ADVERTISEMENT",
            "3 cups tomato sauce ADVERTISEMENT",
            "1 yellow onion, quartered ADVERTISEMENT",
            "4 tablespoons chicken bouillon (such as Knorr®) ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "Meatballs: ADVERTISEMENT",
            "3 pounds lean ground beef ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup tomato sauce ADVERTISEMENT",
            "1/4 cup uncooked white rice ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon seasoned salt (such as Season-All®) ADVERTISEMENT",
            "1 tablespoon dried oregano leaves ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "10 small baby potatoes ADVERTISEMENT",
            "5 large carrots, sliced diagonally ADVERTISEMENT",
            "5 stalks celery, sliced diagonally ADVERTISEMENT",
            "2 zucchini, chopped ADVERTISEMENT",
            "2 cups thickly shredded green cabbage ADVERTISEMENT",
            "1 lemon, sliced into wedges (optional) ADVERTISEMENT",
            "2 avocados, chopped (optional) ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water into a large stockpot over high heat. Stir in 3 cups tomato sauce, yellow onion, chicken bouillon, garlic, and 1 tablespoon dried oregano. Bring broth to a slow boil.\nCombine ground beef, eggs, 1/2 cup tomato sauce, white rice, 1/4 cup cilantro, seasoned salt, 1 tablespoon dried oregano, onion powder, garlic powder, black pepper, and cumin in a large bowl. Squeeze mixture with your hands until thoroughly mixed.\nScoop 1/4 cup of beef mixture and form in a ball. Lower gently into boiling broth. Repeat with remaining beef mixture.\nStir potatoes, carrots, and celery into the broth. Cover and simmer until meatballs and potatoes are tender, about 30 minutes. Stir in zucchini and cabbage. Cover and simmer until cabbage is tender, about 10 minutes.\nServe with a squeeze of lemon juice and garnish with avocado and 1/4 cup cilantro.\n",
        "picture_link": "04d18C0X0a0TAT.lSvjcG00e3uwKA9G"
    },
    {
        "title": "Raghavan's Curry Blend",
        "ingredients": [
            "8 dried chile de arbol peppers, stemmed, crumbled ADVERTISEMENT",
            "2 tablespoons coriander seeds ADVERTISEMENT",
            "1 tablespoon cumin seeds ADVERTISEMENT",
            "2 teaspoons yellow or black mustard seeds ADVERTISEMENT",
            "1 teaspoon black peppercorns ADVERTISEMENT",
            "1/2 teaspoon whole cloves ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grind dried chiles de arbol, coriander seeds, cumin seeds, mustard seeds, peppercorns, and cloves in a spice grinder (or a coffee grinder or high-powered blender) to the consistency of finely ground black pepper. Stir in turmeric. Store in a sealed container in a cool, dark place up to 3 months.\n",
        "picture_link": "LMDoE/UjJHkdOiQO.BCM8dlIKnRgcTi"
    },
    {
        "title": "Big Ray's Spicy Drunken Shrimp",
        "ingredients": [
            "1 (12 fluid ounce) can or bottle IPA beer ADVERTISEMENT",
            "3 green onions, sliced ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "1 bay leaf, or more to taste ADVERTISEMENT",
            "1 pound raw shrimp, peeled and deveined ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine beer, green onions, garlic, red pepper flakes, and bay leaf in a large saucepan; bring to a boil. Cook, stirring occasionally, until sauce is reduced by half, 5 to 10 minutes.\nStir shrimp into the sauce; cook until pink, 3 to 4 minutes. Season with salt and pepper. Garnish shrimp with parsley.\n",
        "picture_link": "HVya7/.5jfK52eolFoW57sLaeRQOmba"
    },
    {
        "title": "Texas Trash Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 (16 ounce) cans refried beans ADVERTISEMENT",
            "1 (4.5 ounce) can chopped green chiles, drained ADVERTISEMENT",
            "1 (1.25 ounce) package McCormick® Taco Seasoning Mix ADVERTISEMENT",
            "4 cups shredded Mexican blend cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Microwave cream cheese and sour cream in large microwaveable bowl on HIGH 1 minute or until cheese is softened. Remove from microwave. Mix with wire whisk until smooth. Add refried beans, green chiles, Seasoning Mix and 2 cups of the cheese; mix well.\nSpread bean mixture into 13x9-inch baking dish sprayed with no stick cooking spray. Sprinkle with remaining 2 cups cheese.\nBake 25 minutes or until cheese is melted. Serve with tortilla chips.\n",
        "picture_link": "jfwH0E1P5YKQS.vydZMiP5Fh3j8H7ay"
    },
    {
        "title": "Mile High Chile Verde Dip",
        "ingredients": [
            "1 (15.5 ounce) can cannellini (white kidney) beans, drained and mashed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup salsa verde ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 jalapeno peppers, seeded and finely chopped ADVERTISEMENT",
            "1 package McCormick® White Chicken Chili Seasoning Mix ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Mix all ingredients, except Monterey Jack cheese, in large bowl until well blended.\nSpread bean mixture in glass pie plate sprayed with no stick cooking spray. Sprinkle with cheese.\nBake 25 minutes or until cheese is melted. Garnish with additional sliced jalapeno peppers, if desired. Serve with tortilla chips.\n",
        "picture_link": "Bcax/UHShTU8UOyH3AgStmdZV0QoBVu"
    },
    {
        "title": "Miami Cuban Dip",
        "ingredients": [
            "1 (16 ounce) loaf Italian bread ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 package McCormick® Pork Gravy Mix ADVERTISEMENT",
            "1 1/2 cups shredded Swiss cheese, divided ADVERTISEMENT",
            "5 tablespoons dill pickles, coarsely chopped, divided ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1/2 cup cubed ham ADVERTISEMENT",
            "1 cup deli-sliced roast pork cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nPlace bread on baking sheet. Cut an oval on top of bread and remove bread center to make room for the dip. Tear removed bread top and bread center into bite-size pieces. Set aside for serving.\nWhisk milk gradually into gravy mix in medium saucepan. Stirring frequently, cook over medium heat until gravy comes to a boil. Reduce heat to simmer. Stir in 1 1/4 cups of the cheese, 4 tablespoons of the pickles, mayonnaise, and mustard. Cook 2 to 3 minutes or until cheese is melted. Stir in pork and ham.\nSpoon dip into bread. Sprinkle with remaining 1/4 cup cheese.\nBake 10 minutes or until cheese is melted and bread is warm. Sprinkle dip with remaining 1 tablespoon chopped pickles. Serve with bread pieces.\n",
        "picture_link": "K0BvT489nIAFAoPNo2/3IvBAmS9Mz.O"
    },
    {
        "title": "Raghavan's Garam Masala",
        "ingredients": [
            "1 tablespoon coriander seeds ADVERTISEMENT",
            "2 teaspoons cumin seeds ADVERTISEMENT",
            "1 teaspoon black peppercorns ADVERTISEMENT",
            "1/2 teaspoon whole cloves ADVERTISEMENT",
            "1/2 teaspoon cardamom seeds (from green or white cardamom pods) ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 dried chile de arbol peppers, stemmed ADVERTISEMENT",
            "1 (3 inch) cinnamon stick broken into smaller pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a small skillet over medium-high heat. Meanwhile, in a small, heatproof bowl, stir together coriander seeds, cumin seeds, peppercorns, cloves, cardamom seeds, bay leaves, dried chiles de arbol, and cinnamon pieces. Sprinkle spices into hot skillet and toast, shaking every few seconds, until coriander and cumin are reddish brown, cinnamon and bay leaves appear brittle and crinkly, chiles are blackened in spots, other spices are slightly ashy black, and the whole thing is highly fragrant, 1 to 2 minutes. Transfer immediately to bowl.\nWhen cooled completely, crumble chiles and grind everything in a spice grinder (or a coffee grinder or high-powered blender) to the consistency of finely ground black pepper. Store in a sealed container in a cool, dark place up to 3 months.\n",
        "picture_link": "hM4UD1UMwKBVK3uqoMM5NvTeUjg/29K"
    },
    {
        "title": "Cold Brewed Iced Coffee",
        "ingredients": [
            "1/2 cup coarsely ground coffee beans ADVERTISEMENT",
            "4 cups water, divided ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place coffee beans in a French press or large measuring cup; pour in 2 cups water. Let coffee steep, 8 hours to overnight.\nCombine remaining 2 cups water and sugar in a saucepan; bring to a boil. Simmer until sugar dissolves, 3 to 5 minutes. Pour syrup into a container and transfer to the refrigerator.\nStrain coffee using the French press plunger or through a coffee filter in a fine-mesh strainer. Pour 1/2 cup coffee into a glass of ice; sweeten with simple syrup.\n",
        "picture_link": "mYUFyPwAdFBXe.iMOprlYqFXYzW381m"
    },
    {
        "title": "Easy Starbucks® Replicated Cold Brew Coffee",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1/2 cup dark roast ground coffee (such as Folgers®) ADVERTISEMENT",
            "2 cups 2% milk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "4 cups ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and ground coffee in a French press; stir to ensure coffee is evenly mixed with water. Push the plunger halfway down slowly. Let coffee steep at room temperature for 20 to 24 hours.\nMix milk and sugar in a pitcher until sugar is dissolved. Push French press plunger all way the down; pour coffee over the cream. Divide coffee mixture among 4 glasses; top with ice.\n",
        "picture_link": "VWeirbFfvXMehmn0T3rwqHmoXbxOoFO"
    },
    {
        "title": "Lemony Pickled Mushrooms ",
        "ingredients": [
            "3 cups sliced fresh mushrooms, or more to taste ADVERTISEMENT",
            "4 sprigs fresh thyme ADVERTISEMENT",
            "1/2 serrano pepper, thinly sliced, or more to taste ADVERTISEMENT",
            "Brine: ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 1/2 tablespoons kosher salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "4 cloves garlic, thinly sliced ADVERTISEMENT",
            "20 whole black peppercorns ADVERTISEMENT",
            "12 coriander seeds ADVERTISEMENT",
            "3 (1-inch) strips lemon zest, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill four sterilized 8-ounce jars 3/4 of the way with mushrooms. Place 1 thyme sprig and some serrano pepper slices on top.\nCombine white wine, water, kosher salt, sugar, garlic, peppercorns, coriander seeds, and lemon zest in a small saucepan over medium-low heat. Simmer, stirring occasionally, until sugar dissolves, about 5 minutes. Remove from heat and pour over mushroom mixture in each jar.\nTightly seal each jar and transfer to the refrigerator. Chill until flavors meld, 1 to 2 days.\n",
        "picture_link": "e/uT1DKOs9.gAh7cARC9a.EmOZm1UrK"
    },
    {
        "title": "BBQ Beef Brisket Sandwiches",
        "ingredients": [
            "2 teaspoons celery salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon onion salt ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "3 pounds beef brisket ADVERTISEMENT",
            "1 cup Russian dressing ADVERTISEMENT",
            "1 cup hickory-flavored barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix celery salt, black pepper, salt, garlic salt, and onion salt in a small bowl; add Worcestershire sauce. Spread mixture over beef brisket; transfer to a slow cooker.\nCook on Low until beef is tender, about 8 hours.\nTransfer beef to a cutting board; shred into small pieces using 2 forks.\nMeasure 1/2 cup cooking liquid from the slow cooker into a saucepan. Mix in Russian dressing and barbeque sauce; bring to a boil.\nCombine shredded beef and sauce mixture in the slow cooker. Cook on Low until flavors combine, about 1 hour.\n",
        "picture_link": "LB2Rd4c8/dcIPKzFaLvS7Owk4mM9qyS"
    },
    {
        "title": "Armenian Jajukh",
        "ingredients": [
            "2 cucumbers, peeled and diced ADVERTISEMENT",
            "2 tablespoons nonfat plain yogurt (such as Mountain High®) ADVERTISEMENT",
            "1/2 clove garlic, crushed, or to taste ADVERTISEMENT",
            "1 teaspoon crushed dried mint, or to taste ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cucumbers and yogurt together in a bowl. Mix in garlic until fully incorporated. Add mint and salt; mix well.\n",
        "picture_link": "aK.0IngdU/0pDwFOYLlu6FQiF/XKSsy"
    },
    {
        "title": "Easy Flourless Chocolate Cake",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "15 ounces semisweet chocolate morsels ADVERTISEMENT",
            "15 ounces unsalted butter ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "10 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 10-inch cake pan with oil.\nCombine chocolate, butter, and sugar in a double boiler over simmering water; cook, stirring frequently and scraping down the sides with a rubber spatula, until melted and smooth, about 5 minutes.\nPour chocolate mixture into the bowl of a stand mixer fitted with the paddle attachment; beat on low speed until cooled, about 5 minutes. Increase speed to medium; beat in eggs one at a time. Add water and vanilla extract; beat on low speed until blended. Pour into the prepared pan.\nPlace cake pan inside a large baking dish. Pour enough water into the baking dish to come halfway up the sides of the cake pan.\nBake cake in the preheated oven until a knife inserted into the center comes out clean, about 1 hour. Allow cake to cool in the water bath, about 1 hour. Transfer to the refrigerator; chill until firm, 8 hours to overnight.\n",
        "picture_link": "POof1z/97wtxjrCieuGREjmE6eezTDS"
    },
    {
        "title": "Banana Chocolate Walnut Frozen Yogurt",
        "ingredients": [
            "4 cups Greek yogurt ADVERTISEMENT",
            "3 large ripe bananas, peeled and frozen ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup mini chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine Greek yogurt, frozen bananas, and sugar in a blender; blend until smooth.\nPour yogurt mixture into an ice cream maker. Freeze according to manufacturer's instructions until yogurt is the texture of soft-serve ice cream, about 15 minutes. Stir in walnuts and chocolate chips.\n",
        "picture_link": "EtfXXXkxjZazAhwQvRrbXzMCcJVQFqa"
    },
    {
        "title": "Alex's Sofrito ",
        "ingredients": [
            "2 large onions, chopped ADVERTISEMENT",
            "3 heads garlic, cloves peeled and trimmed ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped ADVERTISEMENT",
            "1 red bell pepper, seeded and chopped ADVERTISEMENT",
            "1 yellow bell pepper, seeded and chopped ADVERTISEMENT",
            "1 bunch fresh cilantro, stems trimmed ADVERTISEMENT",
            "2 tablespoons dried oregano leaves ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine onions, garlic cloves, green bell pepper, red bell pepper, yellow bell pepper, cilantro, oregano, vinegar, cumin, black pepper, and salt in a food processor; process into a smooth paste.\n",
        "picture_link": "mwUGctuHpUilfasnw325f5Kpc.Vhx1O"
    },
    {
        "title": "Serrano Hot Sauce",
        "ingredients": [
            "14 serrano chile peppers, stemmed ADVERTISEMENT",
            "6 cloves garlic, smashed ADVERTISEMENT",
            "1 1/2 tablespoons kosher salt ADVERTISEMENT",
            "1 1/2 cups distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place serrano peppers, garlic, and salt in a food processor; pulse until finely chopped. With the motor running, slowly pour the vinegar through the feed tube; process until sauce is smooth, about 5 minutes.\nPour sauce into a saucepan; bring to a boil and cook for 1 minute. Pour sauce into a clean jar and store in the refrigerator for at least 1 day.\nStrain sauce through a fine-mesh strainer; store in the refrigerator.\n",
        "picture_link": "6WTRIk8zg2aPNwExuFzSWAnIYPtJ6V6"
    },
    {
        "title": "Smoky Vegetarian Collard Greens",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 white onion, diced ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 bunch collard greens, stems removed and leaves torn into bite-size pieces ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "1/4 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "1/4 teaspoon smoked paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat; cook and stir onion and garlic until browned and fragrant, 3 to 4 minutes. Add collard greens and red pepper flakes; cook and stir until greens are slightly wilted, 2 to 3 minutes.\nCombine vegetable broth, cider vinegar, brown sugar, liquid smoke flavoring, and paprika in a large pot; add collard greens mixture. Cover pot and simmer until greens are very tender, 40 to 50 minutes. Strain collard greens before serving.\n",
        "picture_link": "dFfsYB1ZOB8wtFp3zKg6XQ7jhMABzCG"
    },
    {
        "title": "Grandma's Hungarian Stuffed Cabbage, Slow Cooker Variation",
        "ingredients": [
            "1 head cabbage ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "3/4 cup uncooked white rice, rinsed ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground pork sausage ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (32 ounce) can tomato juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Cook cabbage in boiling water until outer leaves pull away easily from the head, 3 to 5 minutes. Separate leaves and let cool. Reserve 1 1/2 cup cooking water.\nHeat oil in a large skillet. Add onion and garlic; cook and stir until translucent, about 5 minutes. Stir in wet rice; cook and stir until moisture evaporates, about 1 minute. Remove from heat and let cool, about 5 minutes.\nMix beef, sausage, and egg together in a large bowl. Stir in cooled rice mixture.\nPlace a golfball-sized amount of the beef mixture on the ribbed end of a cabbage leaf; roll up, tucking in the sides. Repeat with remaining beef mixture and cabbage leaves.\nPlace rolls seam-side down in a slow cooker. Cover with tomato juice. Pour reserved cooking water on top.\nCook on High for 30 minutes. Switch to Low and cook for 6 1/2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Italian Garbanzo Bean Soup",
        "ingredients": [
            "1/2 cup dried garbanzo beans ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "3 stalks celery, sliced ADVERTISEMENT",
            "2 carrots, sliced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon fennel seeds ADVERTISEMENT",
            "3 cups vegetable broth ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes ADVERTISEMENT",
            "18 grape tomatoes, halved lengthwise ADVERTISEMENT",
            "2 cups baby spinach leaves ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon chopped fresh oregano ADVERTISEMENT",
            "1/2 teaspoon chopped fresh thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place garbanzo beans in a large container and cover with several inches of cool water; let soak 8 hours to overnight. Drain.\nBring 2 cups of water to a boil in a large pot. Add garbanzo beans; reduce heat and simmer until almost tender, about 45 minutes. Drain and rinse with cold water until cool.\nSpread garbanzo beans on a baking sheet and remove skins.\nHeat olive oil in a large pot over medium heat; cook and stir onion until softened, about 3 minutes. Add celery, carrots, garlic, and fennel seeds; cook and stir for 4 minutes. Stir in garbanzo beans, vegetable broth, and tomatoes. Simmer soup until garbanzo beans are tender, about 15 minutes. Add grape tomatoes and spinach leaves; cook for 2 minutes.\nSeason soup with parsley, oregano, thyme, salt, and pepper. Stir well and remove from heat. Cover and let stand for 10 minutes before serving.\n",
        "picture_link": "SuUQbEG7vK0N03nQF1dedcpcnJUq0z6"
    },
    {
        "title": "Shahi Tukray (Indian Bread Pudding)",
        "ingredients": [
            "1 quart half-and-half ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 loaf sliced bread, crusts removed, divided ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine half-and-half, sugar, and condensed milk in a large pot over medium-low heat. Bring to a gentle boil; simmer until reduced by half, about 55 minutes.\nDissolve 2 slices of bread in the half-and-half mixture; blend mixture with an immersion blender until thickened.\nPreheat oven to 400 degrees F (200 degrees C).\nHeat oil in a deep-fryer or large saucepan. Fry remaining bread slices in batches until golden brown, about 1 minute per side. Drain on paper towels.\nSlice bread diagonally; layer slices in a 9x12-inch baking dish. Pour in enough of the half-and-half mixture to evenly soak the slices.\nBake in the preheated oven until bubbly, about 20 minutes. Flip bread slices and continue baking, about 5 minutes.\n",
        "picture_link": "imzQ1RGoDeAyx..fbX9NF7yNcMd.DNC"
    },
    {
        "title": "Tomato Cucumber Kachumbar",
        "ingredients": [
            "1 cup halved grape tomatoes ADVERTISEMENT",
            "1 cup diced cucumber ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 tablespoon chopped fresh mint ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix grape tomatoes, cucumber, green onions, cilantro, lemon juice, mint, salt, and pepper together in a large bowl.\n",
        "picture_link": "s3mJwYbfzS6XzEL4x/IWmynLGDuq8He"
    },
    {
        "title": "Khitchari",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1/2 cup basmati rice ADVERTISEMENT",
            "1/2 cup split mung beans ADVERTISEMENT",
            "1 teaspoon grated fresh ginger, or more to taste ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon dried oregano leaves ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon fennel seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, basmati rice, split mung beans, ginger, coriander, oregano, garlic, cumin, and fennel seeds in a saucepan. Bring to a boil; reduce heat to medium-low. Simmer, covered, until most of the water is absorbed and the mixture has a smooth consistency, 20 to 25 minutes.\n",
        "picture_link": ".sxfYnSgoTEyHfnnyY/hyiVDV21tNoC"
    },
    {
        "title": "Magic Bullet® Banana Chocolate Milkshake",
        "ingredients": [
            "5 scoops chocolate ice cream (such as Nestle® Real Dairy) ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 banana ADVERTISEMENT",
            "4 ice cubes ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/8 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chocolate ice cream, milk, banana, ice cubes, sugar, and vanilla extract in a Magic Bullet(R) party mug. Blend until smooth, 1 to 2 minutes.\n",
        "picture_link": "NKxDaeC6OCXS4UA7oYdz0SsP7n2STzy"
    },
    {
        "title": "Salat Yirakot",
        "ingredients": [
            "2 tomatoes, diced ADVERTISEMENT",
            "2 green bell peppers, diced ADVERTISEMENT",
            "1 red bell pepper, diced, or more to taste ADVERTISEMENT",
            "1/2 cucumber, diced ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "2 scallions, chopped ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh mint, or to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh dill, or to taste ADVERTISEMENT",
            "2 teaspoons vinegar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground sumac ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomatoes, green bell peppers, red bell pepper, cucumber, olive oil, red onion, scallions, lemon juice, parsley, mint, dill, vinegar, garlic, sumac, salt, and pepper in a large bowl; mix thoroughly.\nChill tomato mixture until flavors combine, about 25 minutes.\n",
        "picture_link": "fWgw6PQlioJKlH1t2YctIrWargUILn."
    },
    {
        "title": "Crystallized or Candied Ginger",
        "ingredients": [
            "10 ounces fresh young ginger root, peeled ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut ginger into 2-inch pieces and slice lengthwise into 1/8-inch slices. Score ginger slices by pricking with a fork.\nToss ginger with sugar in a bowl.\nCombine ginger-sugar mixture and water in a large skillet or wok; bring to a simmer. Reduce heat and cook, stirring occasionally, until sugar melts into a syrup and starts to crystallize, about 1 hour. Continue stirring until syrup is mostly crystallized and ginger comes together in a pile in the center of the skillet and very little syrup drains out; remove from heat.\nToss ginger slices gently to cool and separate from excess sugar. Spread slices out on a tray to cool and dry.\n",
        "picture_link": "Wha8pXWmoN9smZFmgbShTsLWvdF5DO6"
    },
    {
        "title": "Vegetable Biryani (Tehri)",
        "ingredients": [
            "2 cups long-grain white rice ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 large onion, thinly sliced ADVERTISEMENT",
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "2 bay leaves, broken in half ADVERTISEMENT",
            "2 potatoes, quartered ADVERTISEMENT",
            "2 carrots, quartered ADVERTISEMENT",
            "1 1/2 teaspoons ground turmeric ADVERTISEMENT",
            "1 teaspoon chile powder, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 cup shelled peas ADVERTISEMENT",
            "1 1/2 teaspoons salt, or to taste ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1/2 teaspoon garam masala ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rice in large container and cover with several inches of cool water; let soak for 20 minutes. Drain.\nHeat oil in a pressure cooker over medium heat. Add onion, cumin seeds, and bay leaves; cook and stir until onion is translucent, about 5 minutes. Stir in potatoes and carrots; cook until lightly browned, about 5 minutes. Stir in turmeric, chile powder, and coriander; cook until fragrant, about 1 minute.\nStir rice gently into the pressure cooker until evenly coated with oil. Pour in water and peas. Stir in salt, butter, and garam masala. Seal cooker and bring to high pressure according to manufacturer's instructions. Cook for 5 minutes. Remove from heat.\nRelease pressure naturally according to manufacturer's instructions. Fluff rice with a fork.\n",
        "picture_link": "HJHXEySxPWo4Ab3HBuRSSfa3RowGyRu"
    },
    {
        "title": "Spiced Peanut Butter Yogurt Dip",
        "ingredients": [
            "2 cups vanilla Greek yogurt ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "1 tablespoon milk, or more to taste ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1/8 teaspoon ground red chile pepper ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine Greek yogurt, peanut butter, milk, cinnamon, nutmeg, red chile pepper, and salt in a bowl; beat with an electric mixer until light and fluffy.\n",
        "picture_link": "D0DbI2x7lC5mci0adOqonqRWNkmW24i"
    },
    {
        "title": "Soothing Hot Ginger Tea",
        "ingredients": [
            "1 (12 fl oz) can ginger ale (such as Canada Dry®) ADVERTISEMENT",
            "1 black tea bag (such as Lipton®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour ginger ale into a microwave-safe mug. Heat in the microwave for 1 to 2 minutes.\nSteep tea bag in the hot ginger ale for 3 to 5 minutes.\n",
        "picture_link": "vbfNnxA3eCMz12uhNTKvxuJrZUBACce"
    },
    {
        "title": "Easy Creamy Hummus",
        "ingredients": [
            "1/4 cup tahini ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground fennel seed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 dash hot sauce (such as Cholula®) ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "3/4 cup chickpea flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tahini, lemon juice, cumin, fennel, salt, pepper, and hot sauce together in a small bowl.\nHeat olive oil in a large saucepan over medium heat. Cook garlic powder in the hot oil until fragrant, about 30 seconds. Pour in 1 1/2 cup water. Whisk in chickpea flour until smooth. Slowly whisk in remaining 1 cup water. Bring to a boil, whisking constantly. Reduce heat to low; cook and stir until mixture thickens, about 15 minutes.\nScrape chickpea mixture into a large bowl using a rubber spatula. Add tahini mixture; whisk until well incorporated.\n",
        "picture_link": "OfDxoig6.529KqPapXH7fsER2cSzmy6"
    }
]