[
    {
        "title": "Kim's Eggnog Cheesecake",
        "ingredients": [
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "4 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup eggnog ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease a 9-inch springform pan. Combine the graham cracker crumbs, 3 tablespoons white sugar, and butter in a bowl and mix until evenly moistened; press into the bottom of the prepared pan.\nCream together the cream cheese and 1 cup sugar using an electric mixer. Add the flour and beat until smooth. Mix in the eggs with the mixer switched to low. Pour in the eggnog and vanilla; continue beating until just blended. Stop the mixer and scrape the bottom of the bowl occasionally. Pour the mixture over the crust.\nFill a shallow dish with some hot water and place on bottom rack of the oven. Put cheesecake on the middle rack of the oven. Turn oven heat to 200 degrees F (95 degrees C). Do not preheat oven.\nBake the cheesecake until the center is set, about 3 hours 15 minutes. Turn oven off. Allow cheesecake to cool in the oven, about 3 hours. Chill in refrigerator overnight.\n",
        "picture_link": "jMHGOXQ2uuMRTwa2TNCss4kTsLRL6DO"
    },
    {
        "title": "Spicy Flat Iron Steak Rub",
        "ingredients": [
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 1/2 teaspoons ancho chile powder ADVERTISEMENT",
            "1 teaspoon chipotle chile powder ADVERTISEMENT",
            "1 tablespoon salt-free seasoning blend ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 (2 pound) flat iron steak ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the brown sugar, garlic powder, onion powder, chili powder, ancho chile powder, chipotle chile powder, salt-free seasoning blend, salt, and pepper together in a bowl until thoroughly blended. Sprinkle over both sides of the steak, and rub into the meat. Cover, and refrigerate at least 30 minutes, or up to 2 days.\nBefore cooking, drizzle steak with vegetable oil, and rub the oil into the meat. Cook as desired.\n",
        "picture_link": "iKNMf7OGrF/CvYOD1DgPh2cggXVi5Ci"
    },
    {
        "title": "Sausage and Sun-Dried Tomato Quiche",
        "ingredients": [
            "1 (9 inch) frozen pie crust, thawed ADVERTISEMENT",
            "1/2 pound bulk pork sausage ADVERTISEMENT",
            "2 shallots, chopped ADVERTISEMENT",
            "1 clove clove garlic, minced ADVERTISEMENT",
            "1/2 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup whipping cream ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C). Line pie pan with pie crust, and prick several places with a fork. Place a double layer of aluminum foil over the crust. Bake in the preheated oven for 8 minutes, and then remove foil. Continue baking until crust begins to set, about 5 minutes; remove from oven. Reduce oven temperature to 350 degrees F (175 degrees C).\nIn a large skillet, cook sausage until well browned, stirring frequently. Mix in shallots and garlic, and continue cooking for 1 minute. Stir in sun-dried tomatoes and 1 tablespoon parsley. Spread mixture into the bottom of the warm pie crust.\nIn a mixing bowl, beat eggs with cream. Stir in cheese. Pour mixture over sausage in pie crust. Sprinkle remaining parsley over the top.\nBake in preheated oven until crust browns and a knife inserted in the center comes out clean, about 45 to 60 minutes.\n",
        "picture_link": "ZGliCrBAMH9t7yPCrKDgY5mh2XfBMwS"
    },
    {
        "title": "Impossibly Easy Chicken Pot Pie",
        "ingredients": [
            "1 2/3 cups Green Giant™ Steamers™ frozen mixed vegetables ADVERTISEMENT",
            "1 cup cut-up cooked chicken ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup Original Bisquick® mix ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F. Mix vegetables, chicken and soup in ungreased glass pie plate, 9x1-1/4 inches.\nStir together remaining ingredients with fork until blended. Pour into pie plate.\nBake 30 minutes or until golden brown.\n",
        "picture_link": "ye3vSdG4ZbZLCGG/G1HJV7GUb8rC1g6"
    },
    {
        "title": "Balsamic Roasted Vegetable Salad",
        "ingredients": [
            "12 new potatoes, halved ADVERTISEMENT",
            "2 large red onions, each cut into 8 wedges ADVERTISEMENT",
            "2 large yellow bell peppers, seeded and cubed ADVERTISEMENT",
            "4 cloves garlic, peeled ADVERTISEMENT",
            "1 eggplant, thickly sliced (optional) ADVERTISEMENT",
            "1 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "2 teaspoons chopped fresh thyme ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pint cherry tomatoes, halved ADVERTISEMENT",
            "1/3 cup toasted pine nuts ADVERTISEMENT",
            "1 (10 ounce) bag baby spinach leaves ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nPlace potatoes into a microwave safe dish, and place into the microwave. Cook on High until the potatoes are just tender, 3 to 4 minutes. Place the potatoes into a large bowl along with the onion, bell pepper, garlic, and eggplant. Sprinkle with rosemary, thyme, and olive oil. Toss to coat the vegetables with olive oil, then season with salt to taste. Spread vegetables onto prepared baking sheet.\nRoast the vegetables in the preheated oven until they begin to brown at the edges, about 35 minutes. Stir in the cherry tomato halves, and continue cooking 15 minutes more.\nToss the roasted vegetables in a large bowl with the pine nuts, spinach, and balsamic vinegar.\n",
        "picture_link": "aAlIVDMkwjc0CvSw.KXZd37WI5DU3bG"
    },
    {
        "title": "Baked Aloha Chicken",
        "ingredients": [
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 cup corn oil ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple (not drained) ADVERTISEMENT",
            "10 chicken leg quarters ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir together lemon juice, corn syrup, soy sauce, salt, ginger, and corn oil in a bowl until smooth. Stir in the crushed pineapple with its liquid. Place the chicken legs in an ovenproof glass baking dish, and pour sauce over top.\nBake in preheated oven for 30 minutes, then turn the chicken over, and continue cooking until the chicken is tender, and no longer pink, about 20 minutes. Baste with sauce frequently while baking.\n",
        "picture_link": "cbfxWf8.2kT36wsXTMkBx2rzrx402we"
    },
    {
        "title": "Pizza Buns",
        "ingredients": [
            "8 hamburger buns, split ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/3 cup onion, chopped ADVERTISEMENT",
            "1 (15 ounce) can pizza sauce (such as Contadina®) ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "2 1/4 teaspoons Italian seasoning ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nPlace bun halves, crust sides down, onto a baking sheet. Broil the buns until just toasted, about 1 minute. Watch them carefully, they burn easily. Set the toasted buns aside.\nTurn oven heat to 350 degrees F (175 degrees C).\nIn a large skillet over medium heat, cook and stir the ground beef until the meat is browned and crumbly, about 10 minutes. Drain excess grease, and stir in the onion. Cook and stir the beef mixture until the onion is translucent, about 5 more minutes, then stir in the pizza sauce, Parmesan cheese, Italian seasoning, garlic powder, onion powder, crushed red pepper flakes, and paprika. Bring the sauce to a boil, and simmer for 10 to 15 minutes to blend the flavors, stirring often.\nSpoon the beef sauce over the buns on the baking sheet, and top each bun with about 1/4 cup of the shredded mozzarella cheese. Return the buns to the oven, and bake until the cheese is bubbly and lightly browned, about 10 minutes.\n",
        "picture_link": "RxMgRAh6WSQopWIdtou4CKZEUpIy48S"
    },
    {
        "title": "Pixley On a Stick",
        "ingredients": [
            "1 pound sliced bacon ADVERTISEMENT",
            "5 pounds boneless skinless chicken breast halves, cut into 2-inch chunks ADVERTISEMENT",
            "60 wooden toothpicks ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (1 ounce) envelope ranch dressing mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper.\nMix together the sugar and ranch dressing mix in a shallow bowl.\nCut the bacon slices in half the short way. Wrap half a bacon slice around each chunk of chicken, and secure it with a toothpick. Roll the bacon-wrapped chicken pieces in the sugar-ranch dressing mixture.\nPlace the bacon wraps on the prepared baking sheets, and bake in the preheated oven for 30 minutes, until the chicken is cooked through, the bacon is sizzling, and the crust is browned.\n",
        "picture_link": "8OlsiPJ43VzTejf0JW1CiV5UddLbYEC"
    },
    {
        "title": "Asparagus with Pecans and Parm",
        "ingredients": [
            "1 bunch asparagus spears, ends trimmed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (8 ounce) package sliced mushrooms ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1/2 cup coarsely chopped pecans ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Steam the asparagus spears in a basket-style steamer over boiling water until tender, 5 to 10 minutes. Drain and remove to a serving dish; keep warm.\nMeanwhile, melt half of the butter in a large skillet over medium-high heat. Once melted (it's ok if it begins to brown), stir in the sliced mushrooms, and cook until they brown, soften, and begin to release their liquid; pour into a serving dish, and set aside. Melt the remaining butter in the skillet, and stir in the onions. Cook until the onions soften and turn translucent, about 3 minutes. Season with garlic powder, basil, salt and pepper. Stir in the chopped pecans, and cook for a minute more.\nSprinkle the onion mixture with half of the Parmesan cheese, and stir in the reserved mushrooms. Pour over the asparagus in the serving dish and sprinkle with remaining cheese.\n",
        "picture_link": "EjvX1b854zSEnFLNk8XIU76CDTGaoB6"
    },
    {
        "title": "Virgin Strawberry Daiquiri",
        "ingredients": [
            "2 large strawberries, hulled ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "3/4 cup chilled lemon-lime soda ADVERTISEMENT",
            "4 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the container of a blender, combine the strawberries, sugar, lemon juice and lemon-lime soda. Add the ice and blend until smooth. Pour into a fancy glass to serve.\n",
        "picture_link": "rVnmvSekgWpvdlox7lFIH6adp2froEe"
    },
    {
        "title": "Spicy Cucumber Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 cucumbers, peeled, seeded and chopped ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a saucepan over medium heat. Stir in the onions and garlic, and cook until the onion is very soft, about 10 minutes. Stir in the cucumber, vegetable broth, and milk. Season with soy sauce, parsley, red pepper flakes, cayenne pepper, curry powder, and sesame oil. Bring to a simmer over medium-high heat, then reduce the heat to medium-low, cover, and simmer 10 minutes more. Transfer the hot soup to a blender, and carefully puree until the soup is creamy yet slightly grainy.\n",
        "picture_link": "a56cPjctQSlpFopEegLY/bS7wj.q9Q."
    },
    {
        "title": "Easy Sausage, Peppers and Onions with Elbows",
        "ingredients": [
            "1 pound sweet Italian sausages ADVERTISEMENT",
            "1 pound hot Italian sausages ADVERTISEMENT",
            "2 green bell peppers, sliced ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 large sweet onion (such as Vidalia®), sliced ADVERTISEMENT",
            "1 (24 ounce) jar pasta sauce ADVERTISEMENT",
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the sweet and hot sausages, green and red peppers, onion, and pasta sauce in a slow cooker. Add about 1/2 a jar of water. Cook on Low for 6 to 8 hours, or on High for 3 to 4 hours.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until cooked through but still firm, about 8 minutes. Drain well.\nSlice the cooked sausages, then return to the slow cooker. Allow to rest for 10 minutes before serving the sausage, peppers, and onion over the macaroni.\n",
        "picture_link": "tN1dViQBrsorY41rpL8iAwz8IP0R06K"
    },
    {
        "title": "Honey-Orange Glazed Ham",
        "ingredients": [
            "2 tablespoons orange juice ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1/4 teaspoon almond extract (optional) ADVERTISEMENT",
            "1 (8 pound) fully cooked whole ham ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C). Stir the orange juice, cinnamon, clove, and honey together in a small bowl; set aside. Stir in almond extract if desired.\nPlace the ham in a shallow roasting pan. Bake in the preheated oven 1 hour and 15 minutes. Remove the ham from the oven, and baste with the honey glaze. Return to the oven; continue cooking until the ham reaches an internal temperature of 140 degrees F (60 degrees C), about 45 minutes longer. Baste occasionally as the ham finishes baking.\n",
        "picture_link": "xWdwiOyo7ZC7.Xho2iigzEoFCCtjWiC"
    },
    {
        "title": "True Wisconsin Bloody Mary",
        "ingredients": [
            "4 ice cubes ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger vodka ADVERTISEMENT",
            "3 pimento-stuffed green olives ADVERTISEMENT",
            "1 tablespoon brine from olive jar ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 dashes Dash Worcestershire sauce ADVERTISEMENT",
            "3 dashes hot pepper sauce (e.g. Texas Pete's™) ADVERTISEMENT",
            "1 cup tomato and clam juice cocktail ADVERTISEMENT",
            "1 stalk celery, with leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large tumbler with ice cubes. Pour in the vodka, then drop in the olives and the olive brine. Season with celery salt, pepper, Worcestershire sauce and hot pepper sauce. Fill the remainder of the glass with tomato and clam juice cocktail. Stir with the celery stalk and leave it in as a garnish. Sprinkle with a little bit of celery salt before serving.\n",
        "picture_link": "h5W/evrFGJOorMoi4DQxu3rHLMibpAi"
    },
    {
        "title": "Healthier Beef Stroganoff III",
        "ingredients": [
            "2 pounds beef chuck roast ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 pound white mushrooms, sliced ADVERTISEMENT",
            "4 green onions, sliced (white and green parts) ADVERTISEMENT",
            "2 tablespoons butter, divided ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 1/4 cups reduced-sodium beef stock, divided ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "1/3 cup light sour cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove any fat and gristle from the roast and cut into strips 1/2-inch thick by 2-inches long. Season with 1/2 teaspoon salt and 1/2 teaspoon pepper.\nMelt 1 tablespoon butter in a large skillet over medium heat. Add mushrooms and green onions and cook, stirring occasionally, until mushrooms are browned, about 6 minutes. Remove to a bowl and add 1 tablespoon butter to the skillet. Cook and stir one half the beef strips until browned, about 5 minutes, then remove to a bowl. Repeat with the remaining butter and beef strips. Pour wine into the hot skillet and deglaze the pan, scraping up any browned bits.\nCombine flour and 1/4 cup beef broth in a jar with a tightly fitting lid and shake until combined. Stir into the skillet, whisking until smooth. Stir in the remaining broth and mustard, then return the beef to the pan. Bring to a simmer. Cover and simmer until the meat is tender, about 1 hour.\nStir in the prepared mushrooms and the sour cream five minutes before serving. Heat briefly and season with salt and pepper.\n",
        "picture_link": "grIS.au8kcIfvshckyFWhKZXyNK77.O"
    },
    {
        "title": "Irish Cream Sugar Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup Irish cream liqueur ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter and sugar until fluffy. Beat in vanilla and egg yolk until combined, then beat in egg; beat until smooth. Pour in Irish cream, and beat until incorporated.\nSift together flour, salt, and baking powder. Stir into butter mixture until evenly mixed. Form into a flattened ball, wrap well with plastic wrap, and refrigerate 2 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Line two baking sheets with parchment paper.\nRoll dough out to 1/4 inch thickness on a floured work surface. Cut into shapes using cookie cutters and place onto prepared baking sheets.\nBake in preheated oven until golden brown around the edges, 6 to 8 minutes. Cool on a wire rack until they reach room temperature.\n",
        "picture_link": "L.LhxW9AQEUYvf4eYpR97WbEQJF0n.m"
    },
    {
        "title": "Moussaka Cottage Pie",
        "ingredients": [
            "4 tablespoons olive oil, divided ADVERTISEMENT",
            "2 medium onions, cut into medium dice ADVERTISEMENT",
            "3 large cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 pounds lean ground beef or turkey ADVERTISEMENT",
            "2 cups canned crushed tomatoes ADVERTISEMENT",
            "1/3 cup dark or golden raisins ADVERTISEMENT",
            "1 pound eggplant, cut into 1/4-inch thick slices ADVERTISEMENT",
            "Salt and pepper ADVERTISEMENT",
            "1 (24 ounce) package refrigerated mashed potatoes, warmed in the microwave according to instructions ADVERTISEMENT",
            "1 large egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 Tbs. oil in a 12-inch ovenproof skillet over medium-high heat. Saute onions until tender, about 5 minutes. Add garlic, cinnamon and cloves; cook about 1 minute. Add meat, stirring to break it up, and cook about 5 minutes. Stir in tomatoes and raisins; simmer 10 minutes.\nArrange eggplant slices on a lipped cookie sheet. Brush both sides with remaining oil, and season with salt and pepper. Broil on upper oven rack, turning once with kitchen tongs, until golden brown, about 5 minutes per side.\nReduce heat to 400 degrees. Lay eggplant in a single layer over meat mixture. Whisk egg into mashed potatoes; spread over eggplant. Bake on lower rack until sauce is bubbly, about 20 minutes.\n",
        "picture_link": "QI6259KinjeSrj3e8bIIP1GHzSQ4tgu"
    },
    {
        "title": "Swiss Cheese Meatloaf",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "16 buttery crackers, crushed ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon rubbed sage ADVERTISEMENT",
            "1 cup shredded Swiss cheese, divided ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease a 3x7 inch loaf pan.\nBeat the eggs in a bowl to mix. Whisk in the cracker crumbs, onion, garlic, salt, pepper, and sage. Set aside 3 tablespoons of the Swiss cheese to use as a topping, and stir the rest into the egg mixture along with the ground beef. Pack the mixture into the prepared loaf pan.\nBake in the preheated oven until no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). About 2 minutes before the meatloaf is ready, sprinkle with the reserved Swiss cheese, and return to the oven until melted.\n",
        "picture_link": "/oQiEIZ5jS23BHAHPHII2FDvMgNs1/C"
    },
    {
        "title": "Venison Pot Roast and Gravy",
        "ingredients": [
            "1 pound boneless venison roast, thinly sliced across the grain ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon grill seasoning ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSeason the venison with garlic, grill seasoning, and chili powder. Place into a casserole dish, and pour in the beef broth. Cover the dish with a lid, and bake in preheated oven until the venison is tender, about 1 hour.\nMeanwhile, melt the butter in a saucepan over medium heat. Once the butter begins to bubble, whisk in the flour. Cook while whisking constantly until the flour turns a golden yellow, and the bubbling slows, about 10 minutes.\nWhen the venison has finished cooking, whisk 1 1/2 cups of the broth from the venison roast into the flour roux, and simmer for 15 minutes, whisking frequently. Add the venison to the gravy and serve.\n",
        "picture_link": "rA7nYEw3N.uhbHdZEkWjBqGpWHttHj2"
    },
    {
        "title": "Seven Layer Dinner",
        "ingredients": [
            "3 potatoes, thinly sliced ADVERTISEMENT",
            "3 carrots, thinly sliced ADVERTISEMENT",
            "1 large onion, thinly sliced ADVERTISEMENT",
            "1/2 cup uncooked long-grain rice ADVERTISEMENT",
            "2 (8 ounce) cans peas, with liquid ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 (10.75 ounce) can water ADVERTISEMENT",
            "1 pound pork sausage ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLayer potatoes, carrots and onions in a large buttered casserole dish. Sprinkle the uncooked rice over the vegetables. Then add the peas (with liquid) and arrange the pork sausage on top of that. Dilute tomato soup with a can of water and pour over the sausage. Season with salt and pepper.\nBake covered in a preheated oven for 1 hour, then uncovered for an additional hour.\n",
        "picture_link": "vnYH3IilQuPMT6yObdBi9YgcYXS0Bym"
    },
    {
        "title": "Vegetable Beef Minestrone",
        "ingredients": [
            "2 slices bacon, chopped ADVERTISEMENT",
            "1/2 pound lean ground beef ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried rosemary, crushed ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "1 (15 ounce) can chickpeas (garbanzo beans), drained ADVERTISEMENT",
            "2 ounces spaghetti, broken into pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, cook bacon and ground beef until well done, breaking up the beef as it cooks. Drain off the grease and add carrots, garlic, onion and celery. Season with the bay leaf, basil, rosemary and red pepper flakes. Cook for about 5 minutes or until the onions are translucent. Stir in tomatoes and beef stock.\nSimmer for about 20 minutes then put in the chickpeas and broken spaghetti. Cook covered, for about 10 minutes or until spaghetti is al dente. Remove the bay leaf before serving.\n",
        "picture_link": "Vj/PKQsDl2lO5Sv7I1p2ErQi0AdakDS"
    },
    {
        "title": "Surprise Muffins",
        "ingredients": [
            "1 1/3 cups whole wheat flour ADVERTISEMENT",
            "1/3 cup wheat germ ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/4 cup any flavor fruit jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease muffin cups or line with paper muffin liners.\nStir together flour, wheat germ, baking powder, salt and brown sugar. In a separate bowl, mix together butter, egg and buttermilk. Stir milk mixture into dry ingredients; mix just until combined. Fill prepared muffin cups half full with batter. Make a depression in the center of each muffin and drop in 1 teaspoon of jam. Cover jam with additional batter.\nBake in preheated oven for 20 to 25 minutes.\n",
        "picture_link": "Xo/DKfC7ynlzNfyFyGf2HH3GdFIuZI."
    },
    {
        "title": "Richard's Breakfast Scramble",
        "ingredients": [
            "5 eggs, beaten ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 slices cooked ham, chopped ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 to taste salt and pepper to taste ADVERTISEMENT",
            "1/8 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "2 1/2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat together eggs and milk. Stir in onion, ham, cheese, salt, pepper and garlic powder.\nMelt butter in a large frying pan or skillet over medium high heat. Add eggs and cook, without stirring, until eggs begin to set. At that point, stir the eggs until roughly scrambled. Keep doing this until eggs are fully cooked, about 10 to 15 minutes. Serve warm.\n",
        "picture_link": "2xsk/Zx8dNSQZFMwFuKg6Dy6YLZpLIO"
    },
    {
        "title": "Savory Feta Pies",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, sliced ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 small tomato, diced ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup feta cheese ADVERTISEMENT",
            "2 (9 inch) frozen pie crusts, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium high heat. Saute onion until soft, about 2 minutes. Add beef and brown slightly; drain excess fat. Stir in tomato, garlic powder, coriander, oregano, cayenne pepper, salt and pepper and cook until meat is evenly browned, 10 to 15 minutes. Remove from heat and set aside.\nPreheat oven to 400 degrees F (200 degrees C).\nRemove one pie crust from pan and roll out on a lightly floured surface. Cut pastry into four 6 inch circles; place circles on lined cookie sheet and lightly brush with egg beat. Place 1/4 cup of feta cheese onto each circle and top with some beef mixture, leaving enough room to seal dough 'pockets'.\nRemove second pie crust from pan and roll out on lightly floured surface. Cut pastry into four 6 inch circles, as with first pie crust. Brush one side of each circle with egg beat and place, egg-side-down, on top of prepared pie circles. Pinch crusts together to seal around the edges. Use dough scraps to fill any holes or tears in the pie 'pockets'. Brush tops with egg beat and make a small slit in the top of each pie (to allow steam to escape).\nBake in the preheated oven for 15 to 25 minutes, or until cooked through and golden brown.\n",
        "picture_link": "IMdbBZ1T8VTpfJ085cmqMu7rvfq0rvS"
    },
    {
        "title": "Meatless Stuffed Peppers",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped, divided ADVERTISEMENT",
            "4 tablespoons uncooked white rice ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "1 pound firm tofu, crumbled ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 cup chopped fresh mushrooms ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "1 cup finely chopped walnuts ADVERTISEMENT",
            "1 tablespoon vegetarian Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "6 green bell peppers ADVERTISEMENT",
            "1 (8 ounce) can crushed tomatoes ADVERTISEMENT",
            "1/4 cup wine ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat oil in a medium skillet over medium heat. Saute onions and 2 cloves of garlic until onions are translucent. Add rice and saute 2 minutes. Stir in vegetable broth, cover and cook until rice is done, about 15 minutes.\nMeanwhile, in a large bowl combine tofu, parsley, mushrooms, eggs, bread crumbs, walnuts, Worcestershire, soy sauce, paprika, and cooked rice.\nSlice the tops off of the peppers; save tops. Core peppers and stuff with tofu mixture. Replace tops on peppers.\nIn a shallow baking dish combine tomatoes, wine, tomato paste and remaining garlic. Place peppers in dish and cover.\nBake in preheated oven for 1 hour.\n",
        "picture_link": "qFZtpCHkQ2vF3kZn6ooYke6WF8wtCWW"
    },
    {
        "title": "Chuck's Come On Ice Cream (or Night of the Red Death) Chili",
        "ingredients": [
            "MEAT SEASONING ADVERTISEMENT",
            "2 teaspoons ground sage ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried basil leaves ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons cayenne pepper ADVERTISEMENT",
            "CHILI ADVERTISEMENT",
            "3 pounds beef sirloin ADVERTISEMENT",
            "3 pounds pork sirloin ADVERTISEMENT",
            "2 (14.5 ounce) cans whole peeled tomatoes, chopped ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 tablespoon bacon grease ADVERTISEMENT",
            "fresh jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "3 onions, chopped ADVERTISEMENT",
            "7 cloves garlic, crushed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 scoops ice cream, any flavor ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Marinate: The day before preparing the chili, in a large bowl mix together the sage, thyme, basil, marjoram, cumin, chili powder, garlic powder, salt, black pepper and cayenne pepper. Cut beef and pork into 1/2 inch cubes and add to bowl. Mix meat and seasoning together, cover bowl and refrigerate overnight.\nTo Make Chili: Begin to heat tomatoes, tomato sauce, salsa and 2 teaspoons chili powder in a large pot over medium low heat. Meanwhile, heat bacon grease in a large skillet over medium heat. Add jalapeno peppers and saute until soft, 1 to 2 minutes, then add them to large pot.\nIn same skillet fry beef and pork with onion and garlic, in small batches, about 15 to 20 minutes each. As each batch is done add to large pot.\nWhen all ingredients are in the large pot, season with salt to taste. Bring to a boil. Cover, reduce heat to medium low and simmer for about 3 hours.\nAfter eating chili, eat ice cream and say \"Come on, ice cream!\"\n",
        "picture_link": "OgYuRkeykSSfXMErfRtwPZtQp3PtNBS"
    },
    {
        "title": "Hummus IV",
        "ingredients": [
            "2 (15.5 ounce) cans garbanzo beans, drained ADVERTISEMENT",
            "4 tablespoons lemon juice ADVERTISEMENT",
            "6 cloves garlic, peeled and crushed ADVERTISEMENT",
            "3 tablespoons tahini ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place garbanzo beans in a food processor and blend into a spreadable paste. Mix in lemon juice, garlic, tahini and crushed red pepper. Blend until smooth, using more lemon juice if consistency is too thick.\n",
        "picture_link": "4T7Y1SauclDhLHAcYkzb9kR49J2zLyO"
    },
    {
        "title": "Mom's Prize Winning Raw Apple Cake",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup sour milk ADVERTISEMENT",
            "2 cups apples - peeled, cored and chopped ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Make the topping by mixing together 1/4 cup brown sugar, 1/4 cup white sugar, chopped walnuts and 1/2 teaspoon cinnamon. Set aside.\nIn large bowl, mix together 1 cup white sugar, 1/2 cup brown sugar, flour, salt, baking soda and cinnamon. Make a well in the center, and pour in the oil, eggs and sour milk. Beat until smooth, then fold in chopped apples.\nPour batter into prepared pan. Sprinkle with topping mixture. Bake in the preheated oven for 45 minutes, or until a toothpick inserted into the center of the cake comes out clean.\n",
        "picture_link": "Dcv3PX1R8gLsLC/ZCuoSb5.RSMzpWlu"
    },
    {
        "title": "Spicy Potatoes and Scrambled Eggs",
        "ingredients": [
            "2 potatoes, scrubbed ADVERTISEMENT",
            "4 tablespoons vegetable oil, divided ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon turmeric powder ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Poke potatoes with a fork so that their skins are pierced. Microwave potatoes on high until cooked inside. When potatoes are fully cooked, peel potatoes and cut potatoes to 1/8 size or to your liking. Set potatoes aside.\nAdd 2 tablespoons oil to skillet and scramble 3 eggs. Add salt and pepper to taste. Keep warm until potatoes are ready.\nIn another skillet, heat 2 tablespoons oil until hot. Then add salt, cumin, coriander and turmeric powder. Put in chili powder if you want it really spicy. Add potatoes and cook until potatoes are crispy and brown. Spicy potatoes and scrambled eggs are now ready to serve!\n",
        "picture_link": "zvkD0yQmQ5u5YTWSap8yC.HagCAUUSO"
    },
    {
        "title": "Thai Charred Eggplant with Tofu",
        "ingredients": [
            "5 small eggplants ADVERTISEMENT",
            "3 fresh green chile peppers ADVERTISEMENT",
            "4 cloves garlic, peeled ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 small onion, quartered ADVERTISEMENT",
            "3 teaspoons light brown sugar ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "8 ounces tofu, diced ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the grill for high heat.\nOil the grill grate, and cook the eggplants on all sides until charred and black, about 15 minutes. Remove from heat, and place on a rack to cool. Peel, slice diagonally, and set aside.\nIn a food processor or blender, combine the chile peppers, garlic, cilantro, onion, sugar, and lime juice. Process until smooth.\nHeat oil in a large skillet over high heat, and add the chile mixture. Reduce heat to medium, and cook for 1 minute. Gently stir in the tofu, 1/4 cup of basil, and the eggplant. Cook until heated through. Remove to a serving dish, and garnish with the remaining basil.\n",
        "picture_link": "vGetQuEA0pYN7fI6fVBYvqW8EituOAa"
    },
    {
        "title": "Southern Fried Green Tomatoes",
        "ingredients": [
            "1 extra large egg ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "1 cup cornmeal ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil ADVERTISEMENT",
            "3 green tomatoes, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl whisk together egg and milk. In another small bowl mix cornmeal and flour.\nHeat oil in a large skillet over medium heat; use more or less oil to reach about 1/4 inch in depth.\nDredge tomato slices first in egg mixture, then in cornmeal mixture. Carefully place slices in hot oil and cook until browned on both sides.\n",
        "picture_link": "GL/g1ecPwcF1o0J0vR9WOG8APIfKpwy"
    },
    {
        "title": "Cheesy Zucchini Casserole II",
        "ingredients": [
            "9 zucchini, peeled and sliced ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "48 buttery round crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart casserole dish.\nBoil zucchini and onion in a large pot for about 10 minutes; drain. To the zucchini and onion add the butter, cheese, eggs, salt and pepper. Transfer to prepared baking dish and sprinkle cracker crumbs on top.\nBake in preheated oven for 1 hour.\n",
        "picture_link": "l6ZuywkgQIZC91axAzw7VpwdhWq/YSW"
    },
    {
        "title": "Artichoke Dip II",
        "ingredients": [
            "2 (6.5 ounce) jars marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (4 ounce) can diced green chile peppers, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together the artichoke hearts, mayonnaise, Parmesan cheese and chile peppers. Transfer the mixture to a 9x9 inch baking dish.\nBake in the preheated oven 20 to 25 minutes, or until lightly browned.\n",
        "picture_link": "8xGkftAmSaLQR9c3s94Mw2oMG96sPle"
    },
    {
        "title": "Fruit Salsa",
        "ingredients": [
            "1 tomato ADVERTISEMENT",
            "1 orange, peeled and segmented ADVERTISEMENT",
            "2 kiwis, peeled and sliced ADVERTISEMENT",
            "1 red onion, coarsely chopped ADVERTISEMENT",
            "1 avocado, peeled and pitted ADVERTISEMENT",
            "1 bunch cilantro ADVERTISEMENT",
            "2 jalapeno chile peppers ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, place tomato, orange, kiwis, red onion, avocado, cilantro and jalapeno chile peppers. Process using pulse setting until finely chopped but not quite smooth. Transfer to a medium bowl, and garnish with desired amount of garlic salt.\n",
        "picture_link": "/3VmKZOtGPqw6BPTBvlHMHLP5kcWjr."
    },
    {
        "title": "Samosas",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 quart oil for deep frying ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 green chile peppers, chopped ADVERTISEMENT",
            "1 tablespoon fresh ginger root, chopped ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "3/4 pound ground lamb ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons garam masala ADVERTISEMENT",
            "1 1/2 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix flour, salt and butter until the mixture resembles fine bread crumbs. Pour in water, using more (up to approximately 1/4 cup) if necessary to make a smooth dough. Pat into a ball. Place on a lightly floured surface and knead 10 minutes, or until dough is smooth and elastic. Return to the bowl, cover and set aside.\nHeat oil in a large, deep skillet to 375 degrees F (190 degrees C).\nMelt butter in a medium saucepan over medium high heat. Stir in onion, garlic, green chile peppers and ginger. Cook 5 minutes, or until onions are golden brown. Stir in turmeric, chili powder, ground lamb and salt. Cook until the lamb meat is evenly brown, about 10 minutes. Stir in garam masala and lemon juice. Continue cooking 5 minutes, then remove from heat.\nDivide dough into 15 equal portions. Roll portions into balls, then flatten into 4 inch circles. Cut each circle in half. Dampen edges and form semicircles into cones. Fill cones with equal portions of the lamb meat mixture. Dampen top and bottom edges of cones, and pinch to seal.\nCarefully lower cones into preheated oil a few at a time. Fry until golden brown, 2 to 3 minutes. Drain on paper towels. Serve warm.\n",
        "picture_link": "tCMvYvBSuUo7KMA8mMFOczRCq8alHOG"
    },
    {
        "title": "Best One Pot Cheese and Macaroni",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "8 ounces seashell pasta ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "4 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup shredded Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon Dijon mustard (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water and salt into a medium pot and bring to a rolling boil over high heat. Once the water is boiling, stir in the shell pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the water has cooked down a bit, about 5 minutes.\nStir in the milk, and continue boiling for another 5 minutes. Add the Cheddar, Parmesan, pepper, and mustard; stir until the cheese melts and the sauce is thick and creamy. The starch from the pasta thickens the sauce as the pasta cooks.\n",
        "picture_link": "wfDIfWxAIOJEkXSozwVZNCABDlQucRC"
    },
    {
        "title": "PHILADELPHIA Chocolate-Vanilla Swirl Cheesecake",
        "ingredients": [
            "20 OREO Cookies, crushed ADVERTISEMENT",
            "3 tablespoons non-hydrogenated margarine, melted ADVERTISEMENT",
            "4 (250 g) packages PHILADELPHIA Brick Cream Cheese, softened ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "6 squares BAKER'S Semi-Sweet Baking Chocolate, melted, cooled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 325 degrees F. Mix cookie crumbs and margarine; press onto bottom of foil-lined 13x9-inch pan. Bake 10 min.\nBeat cream cheese, sugar and vanilla in large bowl with mixer until blended. Add sour cream; mix well. Add eggs, 1 at a time, mixing after each just until blended.\nReserve 1 cup batter. Stir chocolate into remaining batter; pour over crust. Top with spoonfuls of reserved batter.\nSwirl batters with knife. Bake 40 min. or until centre is almost set. Cool. Refrigerate 4 hours.\n",
        "picture_link": "ugYBfrNKt8xCpiHu8v1.5AfFdPVXMBu"
    },
    {
        "title": "Crunchy No-Fry Chicken",
        "ingredients": [
            "3/4 cup finely crushed corn flakes ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground red pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 cup Swanson® Chicken Stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the corn flakes, garlic powder, black pepper and red pepper in a shallow medium bowl.\nDip the chicken into the stock. Coat with the corn flake mixture. Place the chicken onto a baking sheet.\nBake at 400 degrees F for 20 minutes or until the chicken is cooked through.\n",
        "picture_link": ".VfyzoOj/ABUPcRqwMdvLjb3jINHifq"
    },
    {
        "title": "Broccoli Mango Salad",
        "ingredients": [
            "1/2 cup reduced-fat ranch dressing ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "4 cups chopped broccoli ADVERTISEMENT",
            "1 large mango, peeled and cubed ADVERTISEMENT",
            "1/2 cup cashews ADVERTISEMENT",
            "1 small red onion, cut into thin wedges ADVERTISEMENT",
            "1 (11 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ranch dressing, orange juice, and horseradish in a bowl; mix well and set aside.\nToss together the chopped broccoli, cubed mango, cashews, and wedged onion in a salad bowl. Pour the dressing over the broccoli mixture; toss to coat. Refrigerate at least 4 hours. Add the drained oranges to the salad just before serving.\n",
        "picture_link": "CIGtISqyHfH/RCZqucj5JL.AXy37PDK"
    },
    {
        "title": "Meatloaf in a Mug",
        "ingredients": [
            "1 slice white bread, torn into pieces ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/4 pound ground beef ADVERTISEMENT",
            "1 green onion, thinly sliced ADVERTISEMENT",
            "1/4 teaspoon seasoned salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the torn bread into a small bowl, and pour in the milk and Worcestershire sauce; set aside for a few minutes for the bread to absorb the liquid. Add the ground beef, green onion, seasoned salt, and pepper to the bread; mix well and place into a 10 ounce, microwave-safe mug.\nCook in the microwave at 70 percent power until the meatloaf is firm and no longer pink in the center, 4 to 5 1/2 minutes depending on the microwave. Remove the meatloaf from the microwave, and allow to stand 2 minutes before serving.\n",
        "picture_link": "g/zVZgAFNhwoW/boAeVghfVXAJXpZkW"
    },
    {
        "title": "Nonie's Best BBQ",
        "ingredients": [
            "1 (14 ounce) bottle ketchup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "2 teaspoons minced onion ADVERTISEMENT",
            "12 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the ketchup, water, white sugar, brown sugar, vinegar, mustard, salt, pepper, and paprika in a large saucepan. Bring to a simmer over medium-high heat; reduce heat to medium-low and simmer 15 minutes.\nMeanwhile, heat a large skillet over medium-high heat; cook and stir the ground beef and onion in the hot skillet until the beef is crumbly, evenly browned, and no longer pink; drain and discard any excess grease. Stir the beef into the simmering barbeque sauce. Simmer together for 10 minutes. Spoon into the buns to serve.\n",
        "picture_link": "v4iUJ3oziUc1CAqVZ98xOPHZKP.o4mG"
    },
    {
        "title": "Budin (Puerto Rican Bread Pudding)",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "2 (3 inch) cinnamon sticks ADVERTISEMENT",
            "15 whole cloves ADVERTISEMENT",
            "1 teaspoon anise seed ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 (1 pound) loaf day-old bread ADVERTISEMENT",
            "4 cups evaporated milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 1 cup of water to a boil in a small saucepan over high heat. Add the cinnamon sticks, cloves, and anise seeds. Cover, and set aside to steep for 15 minutes.\nMeanwhile, combine 2 tablespoons water with 1/2 cup sugar in a saucepan over medium-high heat. Stir occasionally to dissolve the sugar completely, but stop stirring once the mixture comes to a boil. Stay near the stove to monitor the color, swirling the pan gently to redistribute the caramel as the sugar begins to darken. Cook to about 310 degrees F (160 degrees C), or until the sugar turns light golden brown, then pour into a 9x5 inch loaf pan. Set aside to allow the caramel to harden.\nPreheat an oven to 350 degrees F (175 degrees C).\nRemove the crusts from the day-old bread, tear the bread into cubes, and place into a large mixing bowl. Strain the spice tea through a fine mesh sieve to remove the spices. Add to the bread along with the evaporated milk. Stir to evenly moisten, and set aside for 10 minutes. Whisk the eggs in a large mixing bowl along with 1 1/2 cups of sugar, the vanilla extract, salt, and melted butter. Stir in the moistened bread mixture until evenly mixed. Pour into the loaf pan over the caramel.\nLine a roasting pan with a damp kitchen towel. Place the loaf pan on the towel, inside roasting pan, and place roasting pan on oven rack. Fill roasting pan with boiling water to reach halfway up the sides of the loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour and 15 minutes. Cool in the pan for about an hour, then refrigerate until cold, 2 hours more. When ready, invert the budin onto a serving plate. The caramel will have turned to a syrup and will cover the budin like a sauce.\n",
        "picture_link": "K7rjhfKSnrWUqE9friKiLD5vlkq.ErC"
    },
    {
        "title": "Lite Italian Salad Dressing",
        "ingredients": [
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/2 cup extra virgin olive oil ADVERTISEMENT",
            "3 fluid ounces corn oil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the vinegar, olive oil, corn oil, salt, sugar, pepper, and oregano in a bowl.\n",
        "picture_link": "IW.508yW9nyszwwWrMczpvSl/u2twDG"
    },
    {
        "title": "Acorn Squash Gnocchi with Parmesan Sage Beurre Blanc",
        "ingredients": [
            "1 acorn squash, halved and seeded ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup white flour ADVERTISEMENT",
            "7 cups water ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 cup beer ADVERTISEMENT",
            "1/3 teaspoon rubbed sage ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup cold unsalted butter, cut into small cubes ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Use a knife to perforate the acorn squash with several slits. Cook in microwave for 10 minutes. Scrape the flesh into a bowl. Stir in the garlic, 1/2 teaspoon salt, egg, and whole wheat flour. Add the white flour in small amounts and mix until you get a sticky dough with a manageable texture. Turn the dough out onto a floured surface and roll into thin ropes. Slice the dough into quarter-sized gnocchi.\nBring the water with 1 tablespoon salt to a boil in a large pot; add the gnocchi to the boiling water one at a time, until they are all floating at the top; remove with a slotted spoon to a large bowl; set aside.\nDiscard all but 1 1/2 cups of the water from the pot and return to heat; add the bouillon cube, beer, sage, and pepper and bring to a boil; continue to boil until the mixture reduces to about half its original volume, about 15 minutes; reduce heat to medium. Whisk the butter cubes into the mixture, one at a time, until they are all melted into the liquid; immediately return the gnocchi to the mixture, turn off the heat, and stir in the Parmesan cheese. Cover the pot and allow to sit for 10 minutes before serving.\n",
        "picture_link": "KrCZ3glz.wcKfOxTL4eMnfuYENCSMUm"
    },
    {
        "title": "Healthier Creamy Au Gratin Potatoes",
        "ingredients": [
            "4 russet potatoes, sliced into 1/4 inch slices ADVERTISEMENT",
            "1 onion, sliced into rings ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups low-fat (1%) milk ADVERTISEMENT",
            "1 1/2 cups shredded reduced-fat Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly butter a 1-quart baking dish.\nLayer half the potatoes into the bottom of prepared baking dish. Top with onion slices and add remaining potatoes. Season with salt and pepper.\nMelt butter over medium heat in a saucepan. Mix in flour and salt, stirring constantly with a whisk, for one minute. Stir in milk. Cook until mixture has thickened. Add Cheddar cheese and continue stirring until melted, 30 to 60 seconds. Pour cheese sauce over potatoes and cover dish with aluminum foil.\nBake in the preheated oven until cheese sauce is bubbling and potatoes are tender, about 1 1/2 hours.\n",
        "picture_link": "qTU4S4XGEh3ZCnAv6HwGcHKPh0X3.im"
    },
    {
        "title": "Mushroom and Mascarpone Ravioli",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 large shallots, minced ADVERTISEMENT",
            "8 ounces fresh mushrooms, chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1 (8 ounce) container mascarpone cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "32 (3.5 inch square) wonton wrappers ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Add the shallots; cook and stir until starting to brown. Reduce the heat to medium and add the mushrooms, thyme, garlic and chives; continue to cook until the liquid from the mushrooms has evaporated, 5 to 10 minutes. Remove from the heat and set aside to cool.\nIn a medium bowl, stir together the mascarpone cheese and mushroom mixture. Season to taste with salt and pepper; set aside.\nLay out 16 wonton wrappers on a clean surface. Whisk together the egg and milk in a small cup. Brush the egg wash onto the wrappers. Place one tablespoon of the cheese mixture onto the center of each square. Top the cheese with a small spoonful of the mushroom mixture. Place a second wonton wrapper over the top of all the filling and press to seal the edges. You may refrigerate the ravioli on a baking tray covered with plastic wrap.\nBring a large pot of lightly salted water to a boil. Add the ravioli one at a time and cook until they float to the top, 3 to 4 minutes.\n",
        "picture_link": "noHAixoicidO0JQuUGtUZM1xxurvqeO"
    },
    {
        "title": "Easy Creamy Chicken Casserole ",
        "ingredients": [
            "1 sleeve buttery round crackers (such as Ritz®), crushed ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 (32 fluid ounce) container chicken stock ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "1 (24 ounce) container sour cream, or to taste ADVERTISEMENT",
            "1 (26 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Mix the crackers and melted butter together in a bowl; set aside.\nBring water and chicken stock to a boil in a pot over high heat. Season with salt and black pepper. Add the chicken. Reduce heat to a simmer, and cook, stirring occasionally, until chicken is no longer pink in the center, 5 to 7 minutes. Drain the chicken; set aside. Whisk together the sour cream and cream of chicken soup in a large bowl. Stir in the chicken, then transfer the mixture to a 9x13-inch baking dish. Sprinkle the cracker mixture on top.\nBake in the preheated oven until bubbly, 25 to 30 minutes.\n",
        "picture_link": "VJVbFeOjhRQuIkvXs7WggfYRvd32vte"
    },
    {
        "title": "Maple-Vanilla Syrup",
        "ingredients": [
            "4 cups white sugar ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "3 tablespoons corn syrup ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon imitation maple flavor ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the white sugar, brown sugar, corn syrup, and water in a saucepan over medium-high heat. Bring mixture to a boil, reduce heat to medium, cover pan, and simmer 8 minutes. Stir in maple extract and vanilla. Cool completely, then pour into glass jars, cover, and refrigerate.\n",
        "picture_link": "HcoTUKpRap/wj6o/uuEPbeVihzHoI3W"
    },
    {
        "title": "Holland Cream (White Cream Filling)",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups vegetable shortening ADVERTISEMENT",
            "1 teaspoon clear vanilla extract ADVERTISEMENT",
            "8 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, stir the white sugar and water until the sugar has dissolved and the mixture is boiling. Remove from heat, and let cool completely. Pour the syrup into a large mixing bowl, and beat in vegetable oil, shortening, and clear vanilla extract with an electric mixer on high speed to blend.\nBeat in the confectioners' sugar, 1 cup at a time, until the filling is thick and fluffy. If it's too thick, beat in a tablespoon of water at a time until it's the correct consistency.\n",
        "picture_link": "zjF9mvXTvlEMg.PpJ19lefR6BrV2kMa"
    },
    {
        "title": "West African Chicken Stew",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 pounds boneless chicken, cut into 1/2 inch cubes ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "5 medium potatoes, peeled and cubed ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon coarse ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "2 cups chopped fresh spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large, heavy skillet over medium-heat heat; cook the chicken in the skillet until completely brown, 5 to 7 minutes; remove and set aside. Add the onion, potatoes, garlic, pepper, salt, coriander, cumin, and red pepper to the skillet and cook until the onions soften, about 5 minutes. Stir in the water, chicken broth, and peanut butter. Return the chicken to the skillet and top with the spinach. Cover and simmer until the potatoes are cooked through, about 20 minutes.\n",
        "picture_link": "UCJD2hPMM5JBuxAxwxHiIbKyfztVdau"
    },
    {
        "title": "Zesty Lemon Loaf",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 tablespoons brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "3 tablespoons grated lemon zest ADVERTISEMENT",
            "1 1/4 cups buttermilk ADVERTISEMENT",
            "1/2 cup fresh lemon juice ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 2 loaf pans.\nSift together the flour, baking powder, ground ginger, and salt in a bowl; set aside. Cream together the butter and 2 cups sugar in a separate large bowl; beat in the eggs. Stir in the lemon zest and orange liqueur. Add the buttermilk. Add the flour mixture while whisking gently. Pour the mixture into the prepared loaf pans.\nBake in the preheated ovens until a toothpick or small knife inserted in the crown comes out clean, about 50 minutes. Remove from pans and move to a cooling rack.\nWhisk together the lemon juice and 3/4 cup sugar until the sugar dissolves. Gently drizzle the mixture over the hot loaves. Allow the loaves to cool completely before serving.\n",
        "picture_link": "fzbOuDJcuxwx1.5S8UWZGlivzzNlwQ2"
    },
    {
        "title": "Sourdough Scones",
        "ingredients": [
            "2 1/2 cups bread flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon apple pie spice ADVERTISEMENT",
            "1/3 cup cold butter ADVERTISEMENT",
            "1 1/4 cups sourdough starter ADVERTISEMENT",
            "2 tablespoons milk (optional) ADVERTISEMENT",
            "coarse sugar, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nWhisk together the flour, salt, cream of tartar, baking soda, sugar, and apple pie spice in a mixing bowl. Cut in the butter with a knife or pastry blender until the mixture resembles coarse crumbs. Add the sourdough starter and mix by hand to form a soft dough.\nTurn the dough out onto a lightly floured surface and divide it into 4 pieces. Pat or roll one piece of dough into a 1/2-inch thick round. Cut it into 4 wedge-shaped pieces and place the scones on the prepared baking sheet about 1 inch apart. Repeat with remaining pieces of dough. Brush the tops of the scones with milk and sprinkle with coarse sugar, if desired.\nBake until the scones just start to turn golden, 12 to 15 minutes.\n",
        "picture_link": "cHt8GGujn/RfOWb0Znsxk1tJEdmDk0u"
    },
    {
        "title": "Simple Summer Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1 cup frozen strawberries ADVERTISEMENT",
            "1 cup frozen blueberries ADVERTISEMENT",
            "1 cup frozen cherries ADVERTISEMENT",
            "4 ice cubes ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "3/4 cup vanilla yogurt ADVERTISEMENT",
            "1/2 teaspoon honey (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the banana, strawberries, blueberries, cherries, and ice cubes into a blender. Pour in the orange juice, vanilla yogurt, and honey. Puree until smooth.\n",
        "picture_link": "6PwHz5tFObbG1F4XTef4vTfQBTHZCCW"
    },
    {
        "title": "Campbell's Kitchen Broccoli and Cheese Casserole",
        "ingredients": [
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Mushroom Soup (Regular, 98% Fat Free or 25% Less Sodium) ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons yellow mustard ADVERTISEMENT",
            "1 (16 ounce) package frozen broccoli flowerets, thawed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/3 cup dry bread crumbs ADVERTISEMENT",
            "2 teaspoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the soup, milk, mustard, broccoli and cheese in a 1 1/2-quart casserole.\nMix the bread crumbs with the butter in a small bowl and sprinkle over the broccoli mixture.\nBake at 350 degrees F for 30 minutes or until hot.\n",
        "picture_link": "vA6WltwmA.49Pasxd7jxmbFtOmuInLW"
    },
    {
        "title": "Grilled Mussels with Curry Butter",
        "ingredients": [
            "3 tablespoons butter, softened ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 pounds mussels, scrubbed and debearded ADVERTISEMENT",
            "1 cup chopped red bell pepper ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 lime, thinly sliced ADVERTISEMENT",
            "1 lime, cut into 4 wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high medium-heat and lightly oil grate.\nWhisk together the butter, garlic, curry powder, cumin, and salt in a small bowl.\nArrange four large sheets of aluminum foil on a flat surface. Divide the mussels into four even portions and place one portion on each piece of foil. Dot the mussels with the curry mixture. Sprinkle the red bell pepper and parsley over the top of each portion. Top each with lime slices. Wrap foil tightly around the portions.\nCook the packets on the preheated grill until the mussels have opened, 5 to 10 minutes. Discard any mussels which do not open.\nTransfer the mussels to small bowls and garnish each with a lime wedge to serve.\n",
        "picture_link": "gnhUrINA1/BN7J1ZVYrOwYW4MTSCbrK"
    },
    {
        "title": "Misti's Chicken Marinade",
        "ingredients": [
            "2 cups vegetable oil ADVERTISEMENT",
            "3/4 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons lemon-pepper seasoning ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the oil, vinegar, molasses, soy sauce, lemon-pepper seasoning, garlic powder, and onion powder in a bowl.\nTo use, marinate chicken for at least 8 hours before cooking as desired.\n",
        "picture_link": "74jgJgSpRC1sjKcsbIo.tELJSWxuRGS"
    },
    {
        "title": "Jamaican Fried Dumplings",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the flour, baking powder and salt. Rub in the butter until it is in pieces no larger than peas. Mix in water 1 tablespoon at a time just until the mixture is wet enough to form into a ball. The dough should be a firm consistency. Knead briefly.\nHeat the oil in a large heavy skillet over medium heat until hot. Break off pieces of the dough and shape into a patty - kind of like a flat biscuit. Place just enough of the dumplings in the pan so they are not crowded. Fry on each side until golden brown, about 3 minutes per side. Remove from the pan and drain on paper towels before serving.\n",
        "picture_link": "PENSskrlH74EWuYgBUWgL0ey2XsORLi"
    },
    {
        "title": "Strawberry Pina Colada Pie",
        "ingredients": [
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 pkg. (4 serving size) JELL-O Vanilla Flavor Instant Pudding & Pie Filling ADVERTISEMENT",
            "1 (8 ounce) can DOLE Crushed Pineapple in Juice, undrained ADVERTISEMENT",
            "1 (8 ounce) tub COOL WHIP Whipped Topping, thawed, divided ADVERTISEMENT",
            "1 (6 ounce) HONEY MAID Graham Pie Crust ADVERTISEMENT",
            "1/4 cup BAKER'S ANGEL FLAKE Coconut, toasted ADVERTISEMENT",
            "1 1/4 cups sliced fresh strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese and milk in large bowl with electric mixer until well blended. Add dry pudding mix and pineapple; mix well. Gently stir in 2 cups of the whipped topping; spoon into crust.\nRefrigerate 3 hours or until firm.\nTop with coconut, strawberries and remaining whipped topping just before serving. Store leftovers in refrigerator.\n",
        "picture_link": "yGyruD5eCGGQIqqKQUDDftpwwotDk9C"
    },
    {
        "title": "Smothered Collard Greens and Cabbage",
        "ingredients": [
            "1/2 pound bacon, chopped ADVERTISEMENT",
            "1/2 large onion, chopped ADVERTISEMENT",
            "5 leaves collard greens - rinsed, trimmed and chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon greens seasoning, divided ADVERTISEMENT",
            "1 head cabbage, chopped ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fry the bacon with the onion in a large skillet over medium heat until the bacon is crisp, about 10 minutes. Stir in the chopped collard greens, sprinkle with salt, black pepper, and 1/2 teaspoon of the greens seasoning; cook and stir for 5 minutes.\nAdd in the darker chopped cabbage leaves, and cook and stir until almost tender, about 5 minutes. Stir in the remaining cabbage; season with salt, black pepper, sugar, and the remaining greens seasoning. Stir well; cover and cook until tender, stirring occasionally so that the greens do not scorch, about 10 minutes.\n",
        "picture_link": "qz3pcQ.uSemt0jzS4GJSvuZxdfautSO"
    },
    {
        "title": "Gomen Wat",
        "ingredients": [
            "1 pound collard greens - rinsed, trimmed and chopped ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3/4 cup chopped onions ADVERTISEMENT",
            "8 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 cups sliced green bell pepper ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "2 tablespoons minced fresh ginger root ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chopped collard greens in a pot with 2 cups of water. Bring to a boil, then reduce heat to low. Cover, and simmer until collards are tender, about 20 minutes. Drain, but reserve the cooking water. Set aside.\nHeat 1 tablespoon olive oil in a pot over medium heat. Stir in onions and cook until just beginning to brown, about 10 minutes. Stir in garlic and cook for 1 minute. Add the cooked collards, 1 tablespoon olive oil, and the reserved cooking water. Simmer, uncovered, over medium-high heat until liquid is nearly evaporated, 10 to 15 minutes.\nAdd the green pepper slices, lemon juice, salt, turmeric, paprika, allspice, and ginger root. Cook until peppers are soft, about 5 minutes.\n",
        "picture_link": "bcAFZ7VKJ9pSLk3RGWElwNOrPHBR5H6"
    },
    {
        "title": "Blushing Cranberry Pears",
        "ingredients": [
            "3 cups cranberry juice cocktail ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "8 Bosc pears, peeled with stems intact ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cranberry juice, sugar, and cinnamon stick into a large saucepan. Bring to a simmer over medium heat, and simmer until the sugar dissolves. Meanwhile, peel the pears, leaving the stem intact.\nPlace the pears into the simmering juice and cover. Cook until the pears are tender, turning occasionally, 15 to 20 minutes. Once tender, remove the saucepan from the heat, and set aside to cool to room temperature. Turn the pears a few times as they cool so the color remains even.\n",
        "picture_link": "H4OJYUi1vgu6Q4.k.s8hu3fATCvuJti"
    },
    {
        "title": "Honey, Mustard, and Yogurt Salad Dressing",
        "ingredients": [
            "1 cup plain yogurt ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1/4 teaspoon celery seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the yogurt, honey, mustard, and celery seed in a small bowl. Refrigerate at least 1 hour before serving.\n",
        "picture_link": "bW3emjnvYHKPKzXbbWfICtrLx7ugvOa"
    },
    {
        "title": "Slow Cooker Venison Chili for the Big Game",
        "ingredients": [
            "1 pound boneless venison steak, cubed ADVERTISEMENT",
            "1 pound pork sausage ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "hot pepper sauce to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (15.5 ounce) can cannellini beans, drained ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chiles ADVERTISEMENT",
            "3 tablespoons chili powder, or to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the venison and sausage in a large skillet and cook, breaking up with a wooden spoon as necessary, over medium heat until no longer pink and evenly browned. Drain grease. Stir in the onions and garlic, and cook until aromatic, about 3 minutes. Drain, and mix in the tomato paste. Season to taste with hot pepper sauce, salt, and pepper.\nPour the cannellini beans and tomatoes into a slow cooker. Stir in the venison mixture. Cover, and cook 8 to 10 hours on Low, or 5 hours on High. Sprinkle each serving with shredded Cheddar cheese.\n",
        "picture_link": "jETOny6cJDNaATQO4yRiNUvUdegcHfS"
    },
    {
        "title": "Awesome Asparagus Sandwich",
        "ingredients": [
            "1 bunch fresh asparagus, trimmed ADVERTISEMENT",
            "1 red bell pepper, seeded and quartered ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 hoagie rolls ADVERTISEMENT",
            "6 ounces shredded Swiss cheese ADVERTISEMENT",
            "1 ripe tomato, sliced ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nToss asparagus and red pepper with olive oil. Place on a lined baking sheet and bake until tender, about 10 minutes. Once cool enough to handle, remove skin from the pepper and slice into strips.\nCut hoagie rolls in half, place on a baking sheet, and toast lightly in the oven. Remove rolls from the oven and sprinkle each half with cheese. Place 4 to 5 asparagus spears and a few strips of pepper on one side. Place slices of tomato on the other side of the roll. Place the hoagies back in the oven until the cheese is melted, about 5 minutes.\nMeanwhile, in a separate bowl, mix the mayonnaise, lemon juice, and garlic together. Spread the dressing on one side of the roll and close sandwich.\n",
        "picture_link": "qwdngAnc.8mSa6o1a6SyYA8lDC2VGMe"
    },
    {
        "title": "Gingery Quinoa-Stuffed Acorn Squash",
        "ingredients": [
            "1 acorn squash, halved and seeded ADVERTISEMENT",
            "2/3 cup quinoa ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "1 1/2 teaspoons butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/2 large onion, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 apple, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger, minced ADVERTISEMENT",
            "1 tablespoon apple cider vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1 dash crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place the squash halves, cut-side up into a small baking dish, and bake until tender, about 45 minutes.\nBring the quinoa and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the quinoa is tender, 20 to 25 minutes. When done, stir in the butter until melted, then season to taste with salt and pepper.\nMeanwhile, heat the olive oil in a skillet over medium heat. Stir in the onion, green pepper, and celery; cook and stir until the onion has softened and turned translucent, about 10 minutes. Stir in the apple, and continue cooking until the vegetables are tender, about 10 minutes more. Add the garlic and ginger, cook 2 minutes more, then stir in the vinegar, sugar, cinnamon, nutmeg, and red pepper flakes; season to taste with salt and pepper.\nWhen the squash is tender, scoop out some of the flesh, leaving the halves 1/2 inch thick. Roughly chop the acorn squash, and combine with the quinoa and apple mixture. Spoon the mixture back into the squash shells, and sprinkle with the mozzarella cheese. Return to the oven, and bake until the cheese has melted and is bubbly, about 5 minutes.\n",
        "picture_link": "XwtkJ1RUMSNCJ/TYN073b2Pc1wKD1ZO"
    },
    {
        "title": "Vietnamese Golden Chicken Wings",
        "ingredients": [
            "12 chicken wings, tips removed and wings cut in half at joint ADVERTISEMENT",
            "2 cloves cloves garlic, peeled and coarsely chopped ADVERTISEMENT",
            "1/2 onion, cut into chunks ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup Asian fish sauce ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken wings, garlic, and onion into a large bowl. Pour in soy sauce, fish sauce, lemon juice, and sesame oil. Season with salt, pepper, garlic powder, and sugar; toss together until well coated. Cover and refrigerate 2 hours to overnight.\nPreheat oven to 400 degrees F (200 degrees C). Line a 9x13 inch baking dish with aluminum foil.\nRemove wings from marinade, reserving extra. Arrange wings in a single layer over bottom of prepared dish. Bake in preheated oven, turning once and brushing with reserved marinade, until deep, golden brown and meat juices run clear, approximately 30 minutes.\n",
        "picture_link": "YATLnJ8iWjdQcgrshvbyNYno9mTkRCy"
    },
    {
        "title": "Whole Wheat Carrot-Raisin Muffins",
        "ingredients": [
            "2 cups whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup vanilla yogurt ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1 cup carrot, peeled and shredded ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease 14 muffin cups, or line with paper muffin liners.\nCombine flour, baking soda, pumpkin pie spice, and salt in a bowl. Whisk together yogurt, vegetable oil, honey, vanilla extract, and orange juice in a separate bowl. Gently fold carrots into the yogurt mixture. Stir yogurt mixture into the flour mixture until just combined. Gently fold raisins into the batter. Scoop batter into prepared muffin cups until nearly full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 12 to 13 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "X9LTZhgXFZGFm9CpAr7NSrrY5/pKMDm"
    },
    {
        "title": "Grilled Yams",
        "ingredients": [
            "1 large yam, peeled and cut into 1/2 inch thick slices ADVERTISEMENT",
            "olive oil-flavored cooking spray ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for high heat. When the grill is hot, lightly oil the grate. Coat the strips of yam with olive oil cooking spray and season with salt.\nArrange the yam strips on the grate crosswise so they don't fall through. Cook for 10 to 12 minutes per side, until tender and glazed. Serve with butter.\n",
        "picture_link": "sXsUZGca47kBVK9AWDEQFuZEzSgOghe"
    },
    {
        "title": "Classic Carbonara with Pancetta",
        "ingredients": [
            "4 eggs, lightly beaten ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1 (16 ounce) package penne pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 pound sliced pancetta, chopped ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup pine nuts, toasted ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "3/4 cup chopped Italian flat leaf parsley ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the eggs, cream, and 1 cup of Parmesan cheese in a bowl. Blend thoroughly, and set aside.\nBring a large pot of lightly salted water to a boil. Add the pasta, and cook until al dente, or for 8 to 10 minutes. Drain pasta, then return it to the pot (off of the heat), and cover to keep warm.\nMeanwhile, heat the olive oil over medium heat in a large skillet; add the onion and cook until transparent, about 8 minutes. Remove onion from the skillet; place in a bowl, and cover to keep warm.\nUsing the same skillet, cook the pancetta over medium heat until browned, tossing with nutmeg. Drain on paper towels.\nCombine the pasta, onion, pancetta, pine nuts, salt, and pepper in the same large skillet over low heat. Slowly stir in the egg-cream mixture, tossing gently so the eggs don't scramble. Cook until just heated through. Remove from heat and toss with parsley and remaining 1/2 cup Parmesan cheese. Serve immediately.\n",
        "picture_link": "PxbnJAbBIqGqBiBRhZSEgn9.4NAqeZi"
    },
    {
        "title": "Slow Cooked Venison",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 pound boneless venison roast ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup chile-garlic sauce ADVERTISEMENT",
            "1/4 teaspoon liquid smoke ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat. Stir in onion and cook until softened, about 3 minutes. Stir in garlic and cook 2 more minutes until softened.\nPlace venison roast into a slow cooker, and sprinkle with onion mixture. Stir together ketchup, Worcestershire sauce, soy sauce, chile-garlic sauce, water, salt, and pepper. Pour over the venison.\nCover and cook on Low until tender and no longer pink, 4 to 5 hours.\n",
        "picture_link": "QAunkAqTHTRBXEk4aTT3GHROT4W38AW"
    },
    {
        "title": "Fried Chicken Gizzards",
        "ingredients": [
            "1 1/2 pounds chicken gizzards ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons seasoned salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder (optional) ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim excess fat and gristle from chicken gizzards. Rinse under cold running water.\nPlace gizzards in a pot of cold water. Bring water and gizzards to a rolling boil; continue to boil for about 15 minutes. Strain gizzards using a colander. Allow to cool.\nMeanwhile, combine the flour, seasoned salt, pepper, and garlic powder in a plastic bag. Shake well to combine.\nPreheat vegetable oil in a skillet with a lid over medium-high heat to 375 degrees F (190 degrees C).\nThoroughly coat gizzards with flour mixture and shake off excess. Gently lay the coated gizzards in the hot oil. Cook until brown. Reduce heat to medium; cover skillet with lid and cook another 10 minutes. Remove to paper towels to drain.\n",
        "picture_link": "DlnQiDO4lKPVIjkeZUDb4eDXA7soDmy"
    },
    {
        "title": "Duck with Honey, Soy, and Ginger",
        "ingredients": [
            "2 duck breast halves ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons rice wine ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1 tablespoon tomato sauce ADVERTISEMENT",
            "1 pinch chili powder ADVERTISEMENT",
            "1 teaspoon lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nUse a sharp knife to score across the duck breasts 4 times through the skin and fat but just barely to the meat. Rub the skin with salt, cayenne, and black pepper.\nPreheat an ovenproof skillet over medium-high heat. Lay the breasts in the skillet skin-side down and fry until the skin is brown and crisp, about 5 minutes. Use a spoon to carefully discard any excess fat from the bottom of the skillet. Turn the breasts over and cook for 1 minute.\nPlace the skillet into the preheated oven and roast until the internal temperature of the thickest part of the breasts reach 160 degrees F (71 degrees C) for well done, or the breasts reach desired doneness.\nRemove the duck breasts from the skillet and cover with foil. Set aside to rest. Pour off excess fat from the skillet. Place the stock, honey, soy sauce, rice wine, ginger, tomato sauce, chili powder, and lime juice in the skillet. Whisk the sauce over high heat, bring to a boil and cook until the sauce thickens, about 2 minutes. Slice the duck breasts thinly, arrange on serving plates, and pour the sauce over the top.\n",
        "picture_link": "r1OMdxvuCMtE4Y6N89kcFRThwoNyhF."
    },
    {
        "title": "Peanut Butter and Jelly Thumbprint Shortbread Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup grape jelly ADVERTISEMENT",
            "1/2 cup creamy peanut butter ADVERTISEMENT",
            "1 1/2 teaspoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C); line a baking sheet with parchment paper.\nBeat the butter and sugar with an electric mixer in a large bowl until smooth; add the vanilla and continue to beat. Mix in the flour mixture until just incorporated. Roll dough into 1 1/2-inch balls and arrange on prepared baking sheets. Make a small hole in the center of each ball, using your thumb and finger; fill the holes with grape jam.\nBake in the preheated oven until lightly browned, about 14 minutes; allow to cool on baking sheet for 1 minute.\nPut the peanut butter in a microwave-safe bowl, and cook in a microwave oven until soft for 10 - 30 seconds, checking every 10 seconds. Be careful not to overheat the peanut butter; do not let it bubble. Stir the vegetable oil through the heated peanut butter; drizzle over the warm cookies.\n",
        "picture_link": "Qr6itcLKu2mC2B3wktLLsNnnR4NUlIi"
    },
    {
        "title": "Heather's Famous Barbeque Bunyan Burger",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 tablespoons barbeque seasoning ADVERTISEMENT",
            "1 tablespoon pureed chipotle peppers in adobo sauce ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 teaspoon barbeque seasoning ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 bell pepper (any color), chopped ADVERTISEMENT",
            "1 (4 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat. When hot, lightly oil grate.\nMix together the ground beef, 2 tablespoons barbeque seasoning, and chipotle peppers in adobo sauce in a bowl; divide mixture into two halves; form each half into large rectangles, making one larger and thinner than the other; lay the rectangles on large sheets of aluminum foil.\nMix together the cream cheese and 1 teaspoon barbeque seasoning; spread on top of the smaller, thicker rectangle of meat.\nMelt the butter in a skillet over medium-high heat. Cook the onion, bell pepper, mushrooms, and garlic in the hot butter until the onion has softened; spread atop the cream cheese mixture; top with the Cheddar cheese.\nPlace the thinner rectangle of meat atop the smaller piece by lifting the aluminum foil beneath it and flipping it onto the cream cheese and vegetable layer. Use your hands to form a seal around the edges of the loaf, making sure the cheese and vegetable mixture will not leak out during cooking. Fold the edges of the aluminum foil beneath the loaf upwards, so as to form a bowl, to keep the grease from leaking onto the grill while cooking. Brush the top of the loaf with barbeque sauce.\nCook on the preheated grill until the top of the loaf is cooked completely through, about 30 minutes. Slice into six even pieces to serve.\n",
        "picture_link": "q8WgH34Qmq27MCUEr7N39Sc3XUfgPQq"
    },
    {
        "title": "Spinach-Green Bean Casserole",
        "ingredients": [
            "3/4 cup milk ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "2 (15 ounce) cans green beans, drained ADVERTISEMENT",
            "1 (14 ounce) can chopped spinach, drained ADVERTISEMENT",
            "2 (2.8 ounce) cans French fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Lightly grease a casserole dish.\nStir the milk, sour cream and cream of mushroom soup together in a large bowl. Fold in the green beans and spinach, and mix in about half of the onions. Pour into the casserole dish and top with the remaining onions.\nBake uncovered in the preheated oven until bubbly and browned on top, about 40 minutes.\n",
        "picture_link": "RXZADaDOnYeH8J8tS3/uXkM.D/y672a"
    },
    {
        "title": "Asparagus, Orange and Endive Salad",
        "ingredients": [
            "2 1/2 cups diagonally sliced asparagus ADVERTISEMENT",
            "2 cups rinsed, dried and torn endive leaves ADVERTISEMENT",
            "2 large oranges, sliced into rounds ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "1/3 cup raspberry vinegar ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To a large pot of boiling water, add the asparagus. Blanch for 1 minute; drain, and plunge asparagus into a bowl of cold water. Drain again and dry.\nIn a large bowl, combine the asparagus, endive, oranges, and red onion.\nWhisk together the raspberry vinegar, canola oil, orange juice, sugar and salt and pepper. Add dressing to the asparagus endive mixture; toss well and serve.\n",
        "picture_link": "K8AjYdw6gXFnkznMCXEgSpe9G.3ujxy"
    },
    {
        "title": "Cranberry-Jalapeno Relish",
        "ingredients": [
            "1 cup dried cranberries ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine the cranberries, orange juice, onion, cilantro, garlic, jalapeno, lime juice, cumin and salt.\nStir together and chill 2 hours before serving.\n",
        "picture_link": "h/rHdY3sXglbb6QJC6N7JUcGNmshZSW"
    },
    {
        "title": "Faux-reo Filling",
        "ingredients": [
            "3 ounces cream cheese ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together all of the ingredients and spread on cookies.\n",
        "picture_link": "sviFD8XLnCkxZ0ocoRGCHm/kSgzeLqy"
    },
    {
        "title": "Extra Gingery Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 1/2 teaspoons ground cloves ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup dark molasses ADVERTISEMENT",
            "1/2 cup apple juice ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1/2 cup chopped crystallized ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter and flour a 10 inch springform pan.\nStir together flour, cinnamon, cloves, ground ginger, baking soda, and salt.\nIn a large bowl, mix sugar with oil, juice, molasses, eggs, and fresh ginger in a large bowl. Mix in crystallized ginger. Stir in flour mixture. Pour into prepared pan.\nBake for 1 hour, or until cake tester comes out clean. Run a knife around the edge to loosen cake, and release pan sides. Serve warm.\n",
        "picture_link": "C/h71pqVarfHIy8z8L5VD85cnSEisfi"
    },
    {
        "title": "Lemon Bars II",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 1/2 cups butter ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, stir together the 3 cups of flour with the confectioners' sugar. Cut in the butter with a fork or pastry cutter until the mixture resembles coarse crumbs. Press 1/2 of the mixture into the bottom of the prepared pan. Bake for 15 minutes.\nIn a smaller bowl, stir together the egg whites and white sugar. Add the flour and baking powder, mix until lumps are gone. Stir in the lemon juice. Pour the lemon mixture over the baked crust, then sprinkle the remaining crust mixture evenly over the top. Bake for 20 to 25 minutes in the preheated oven. Refrigerate to set before serving.\n",
        "picture_link": "EOd7x9VMQuE3qIB42Wc6fmGIlc6Z0Hy"
    },
    {
        "title": "Vini's Pork Roast",
        "ingredients": [
            "3 pounds pork loin roast ADVERTISEMENT",
            "1 1/2 teaspoons caraway seed ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ground sage ADVERTISEMENT",
            "1/2 teaspoon browning sauce ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a small bowl combine the caraway seeds, black pepper, salt and sage. Rub mixture all over the pork. Place pork into a shallow roasting pan and bake, uncovered until and internal temperature of 145 degrees F (63 degrees C) is reached, about 30 minutes per pound.\nRemove roast from pan, set aside and cover. Pour pan drippings into a measuring cup and add enough water to equal 2 cups. Pour into a small saucepan and stir in the browning sauce and cornstarch. Cook over low heat, stirring constantly, until mixture is smooth. Raise heat and bring to a boil. Cook until thickened. Serve alongside the pork roast.\n",
        "picture_link": "9gLvRKNRheen.UbVb7CtiuIEa5Gmp2K"
    },
    {
        "title": "Sesame Oil Chicken Wings",
        "ingredients": [
            "2 pounds chicken wings ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "10 tablespoons dark soy sauce ADVERTISEMENT",
            "5 tablespoons light soy sauce ADVERTISEMENT",
            "1 clove crushed garlic ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1/4 cup sesame oil ADVERTISEMENT",
            "1 dash sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the chicken wings into 3 separate portions. In a large skillet, combine the chicken, water, dark soy sauce, light soy sauce, garlic and green onion. Stir together and cook for 15 minutes over medium heat.\nAdd the 1/4 cup sesame oil and simmer for another 15 minutes over low heat. Bring mixture to a boil and add dash of sesame oil. Remove from heat, let cool and serve.\n",
        "picture_link": "Gcome2InrGGyLwuyUZY/UB2RL8CrDUS"
    },
    {
        "title": "Zucchini Soup III",
        "ingredients": [
            "1 pound sausage ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "2 pounds sliced zucchini ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "4 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium high heat, saute the sausage for about 8 minutes, or until browned. Drain excess fat. Add the celery and continue to cook for about 10 minutes, stirring occasionally.\nAdd the zucchini, onions, tomatoes, oregano, Italian-style seasoning, sugar, and the garlic powder. Reduce heat to medium low. Cover and simmer for 30 minutes.\nRemove cover and add the bell peppers. Continue to simmer for about 10 minutes. Serve and enjoy.\n",
        "picture_link": "HPkyHBAv//q8dtM6EmhMK7L89wzTTK."
    },
    {
        "title": "Shirley Temple ",
        "ingredients": [
            "6 fluid ounces lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "1 dash grenadine syrup ADVERTISEMENT",
            "1 maraschino cherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Into a tall glass, pour soda and grenadine over ice. Add cherry and straw.\n",
        "picture_link": "BPmhPcPuK.sona./jXgm6rtu5MW4Pgi"
    },
    {
        "title": "Bacon Wrapped Water Chestnuts I",
        "ingredients": [
            "2 (8 ounce) cans water chestnuts ADVERTISEMENT",
            "2 cups teriyaki sauce ADVERTISEMENT",
            "1 pound bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain chestnuts and place them in a bowl. Cover chestnuts with teriyaki sauce and marinate in the refrigerator for 2 hours or more.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove water chestnuts from refrigerator and drain well. Cut bacon strips in half so that strips are about 3 inches long. Wrap each chestnut with bacon and secure bacon closed with a toothpick. Arrange all wrapped chestnuts on a baking sheet.\nPlace in oven until bacon is crispy. Remove from oven and enjoy.\n",
        "picture_link": ".Tmnlw0gMKkSjnEnLWng7.0qhsMBjfW"
    },
    {
        "title": "Best Ever Fudge",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "25 marshmallows, quartered ADVERTISEMENT",
            "2 cups milk chocolate chips ADVERTISEMENT",
            "2 cups semi-sweet chocolate chips ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease 1 - 11x16 inch jelly roll pan. Set aside.\nCombine sugar, milk, vanilla and butter in large, heavy saucepan. Bring to a boil, stirring occasionally. Boil for 2 minutes.\nRemove from heat and add marshmallows, semi-sweet chocolate chips, milk chocolate chips and unsweetened chocolate. Stir until melted and smooth. Stir in nuts. Mix well.\nPour into prepared pans. Let fudge sit at least 24 hours before cutting into squares. Refrigerate for easier cutting.\n",
        "picture_link": "6hQ4M/9H/O33S/BpdOfvxWR9o49xRPW"
    },
    {
        "title": "Baked Stuffed Pumpkin",
        "ingredients": [
            "1 medium sugar pumpkin ADVERTISEMENT",
            "6 Granny Smith apples - peeled, cored and chopped ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 (16 ounce) can whole berry cranberry sauce ADVERTISEMENT",
            "1 (20 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1/2 cup dark rum (optional) ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon freshly grated nutmeg ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Position rack in the center of the oven.\nCut out top of pumpkin, and set aside. Scoop out seeds with a metal spoon.\nIn a large bowl, stir together the apples, walnuts, cranberry sauce, pineapple, brown sugar, raisins, and rum. Season with ginger, nutmeg, and cinnamon, and mix well. Spoon the mixture into the cleaned pumpkin, and replace top.\nSet pumpkin directly on a baking stone or a thick baking sheet. Bake for 1 hour in the preheated oven, or until pumpkin begins to soften. Remove from heat, and stir, scraping the sides gently, so that some pieces of pumpkin fall into the apple mixture.\n",
        "picture_link": "sos9DkAMuSkywq.6o5QCdwHW/G2BdZK"
    },
    {
        "title": "Peanut Butter Fudge I",
        "ingredients": [
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter one 9x9 inch pan and set aside.\nIn a 3 quart saucepan, combine white sugar, brown sugar, milk, and butter. Cook to soft ball stage, 234 degrees F (112 degrees C). Remove from heat.\nStir in peanut butter, vanilla and marshmallows; continue stirring until marshmallows are melted. Pour into prepared pan and cool. Cut into squares and serve.\n",
        "picture_link": "ml1Bgcmnwxwg5sAjMcZiceOCLajMO.S"
    },
    {
        "title": "Cranberry Raspberry Sauce",
        "ingredients": [
            "12 ounces cranberries ADVERTISEMENT",
            "2 cups raspberries ADVERTISEMENT",
            "1 cup Merlot wine ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put cranberries, raspberries, Merlot, and sugar in a large saucepan. Bring to a boil, stirring occasionally. Use a whisk to mash the cranberries. Turn down heat and let simmer for 15 minutes. Pour sauce into a container and refrigerate. It can be served hot or cold.\n",
        "picture_link": "sC815w8e0uo3tEwHqi85nLpmnwmJHp6"
    },
    {
        "title": "Sweet Potato Pecan Pie",
        "ingredients": [
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "2 tablespoons unsalted butter, melted ADVERTISEMENT",
            "1 cup cooked and mashed sweet potatoes ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3/4 cup light brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup dark corn syrup ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "3 tablespoons confectioners' sugar ADVERTISEMENT",
            "1/4 cup hazelnut liqueur ADVERTISEMENT",
            "1/4 cup pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPrepare dough for one 9 inch pie. Refrigerate until ready to bake.\nBlend together the butter, sweet potatoes, eggs, brown sugar, ginger, cinnamon, nutmeg, vanilla, salt, corn syrup and evaporated milk. Pour filling into crust and sprinkle with chopped pecans.\nBake for 40 to 45 minutes, or until inserted knife comes out clean. Set aside to cool.\nBeat together whipping cream, sugar and liqueur until soft peaks form. Top pie with whipped cream and pecan halves.\n",
        "picture_link": "ZegTR0Q5Mo//T/wgXjXmdbr6pz07xaC"
    },
    {
        "title": "Sugar Cookies I",
        "ingredients": [
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "3 tablespoons white sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat the confectioners' sugar with butter until smooth. Stir in the egg and vanilla. Combine the flour, baking soda and cream of tartar; mix into the batter until well blended. Cover and refrigerate dough for 2 to 3 hours.\nPreheat oven to 375 degrees F. Divide dough in half and roll 3/16 inch thick on floured surface. Cut dough with cookie cutters and sprinkle with white sugar. Place cookies onto greased baking sheets.\nBake for 7 to 8 minutes in the preheated oven, or until delicately golden.\n",
        "picture_link": "GErmDeWMJ3oFbOpYFJg9FNK65OyK4pq"
    },
    {
        "title": "Grilled Zucchini I",
        "ingredients": [
            "1 large zucchini ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill to medium high heat.\nClean outer skin of zucchini, and slice lengthwise into quarters. Place a pat of butter or margarine on each zucchini quarter, and season with salt and pepper to taste. Wrap all four quarters in one piece of aluminum foil.\nPlace foil wrapped zucchini on heated grill, and cook for 10 to 15 minutes on each side.\n",
        "picture_link": ".nQ4n5175V752fbdxUkqLYL3UrXjWNC"
    },
    {
        "title": "My Favorite Chocolate Chip Cookie",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons cream of tartar ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, bowl, beat together the white sugar, brown sugar, oil and shortening until smooth. Stir in eggs and vanilla, beating well after each addition. Combine the flour, cream of tartar, baking soda and salt, stir into the sugar mixture. Finally , fold in the chocolate chips. Drop by heaping spoonfuls onto an unprepared cookie sheet.\nBake for 8 to 10 minutes in the preheated oven. Remove from baking sheet to cool on wire racks.\n",
        "picture_link": "uxTbtQVrp91XmN4c8pzZGq5vN1/TehS"
    },
    {
        "title": "Apple, Beet and Avocado Salad",
        "ingredients": [
            "3 medium beets ADVERTISEMENT",
            "4 cups mixed salad greens ADVERTISEMENT",
            "1 onion, sliced into thin rings ADVERTISEMENT",
            "1 apple - peeled, cored and thinly sliced ADVERTISEMENT",
            "1/2 avocado - peeled, pitted and sliced ADVERTISEMENT",
            "1/2 cup toasted chopped walnuts ADVERTISEMENT",
            "3/4 cup apple cider ADVERTISEMENT",
            "2/3 cup cider vinegar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "1/4 teaspoon celery seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Wash beets, and place in a baking dish with 1/4 cup water. Cover and bake for 1 hour or until tender. Remove from oven and set aside to cool.\nWhisk together the apple cider, vinegar, oil, salt, pepper, mustard and celery seed.\nPeel and slice the beets, combine with the vinaigrette and refrigerate at least half an hour.\nDivide the greens among four salad plates. Drain beets, and reserve dressing. Decoratively arrange overlapping layers of beet, onion, apple, and avocado on the greens. Drizzle with reserved dressing. Sprinkle on the nuts, and serve at once.\n",
        "picture_link": "8j4zyOcqPtixLuVYQ9eawb8LM8NSyYS"
    },
    {
        "title": "Five Spice Turkey Cheeseburgers",
        "ingredients": [
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon diced white onion ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1/2 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "4 slices Gouda cheese ADVERTISEMENT",
            "4 onion rolls, halved ADVERTISEMENT",
            "1/2 cup fresh spinach leaves (optional) ADVERTISEMENT",
            "4 pineapple rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the bread crumbs, egg white, onion, soy sauce, minced ginger, five-spice powder, ground ginger, and pepper in a large bowl. Mix in turkey until just combined. Shape turkey mixture into four patties.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nCook on the preheated grill until the patties are no longer pink in the center, about 5 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Place a slice of gouda cheese on each patty; continue grilling until cheese has melted, about 1 minute. While the turkey patties are cooking, place the pineapple rings on the grill until softened, 2 to 3 minutes per side.\nAssemble the burgers by placing a turkey patty on half of an onion roll, then top with the grilled pineapple. Divide the spinach leaves evenly among the burgers, then top with the other half of the onion roll.\n",
        "picture_link": "CxCrzL.tQYpSHEkEo9BDRnM9PvOJFAa"
    },
    {
        "title": "Terri's Veal Marsala",
        "ingredients": [
            "1 1/2 pounds veal scallops, pounded to 1/4 inch thickness ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3/4 cup all-purpose flour for coating ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup dry Marsala wine ADVERTISEMENT",
            "1/2 cup chicken stock, divided ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season veal with salt and pepper to taste; dredge in flour to coat. Shake off excess flour. Melt 2 tablespoons butter and olive oil over medium heat in a large skillet. When foam subsides, add veal 3 to 4 pieces at a time and saute for 2 to 3 minutes each side, until browned. Transfer meat to a plate.\nPour most of the fat off from the skillet; add wine and 1/4 cup of the stock and bring to a boil over high heat for 1 or 2 minutes, scraping the bottom and sides of the skillet.\nReturn meat to skillet; cover, reduce heat to low, and simmer for 10 to 15 minutes, basting meat with pan juices occasionally. Transfer meat to a platter.\nAdd remaining 1/4 cup stock to skillet and bring to a boil, scraping bottom and sides of skillet. When sauce has reduces to a thick, syrupy consistency, remove from heat and season with salt and pepper to taste. Stir in 2 tablespoons softened butter and pour sauce over meat.\n",
        "picture_link": "8w.HFCXE6nliW21znwmbwqoSjQnhuaa"
    },
    {
        "title": "Pork Chops and Cheesy Scalloped Potatoes",
        "ingredients": [
            "4 pork chops ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 pounds red potatoes, scrubbed and sliced, divided ADVERTISEMENT",
            "1 onion, sliced, divided ADVERTISEMENT",
            "1/4 cup all-purpose flour, divided ADVERTISEMENT",
            "1 (16 ounce) jar cheese sauce (such as Ragu® Double Cheddar) ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork chops into a slow cooker; sprinkle with salt and pepper. Layer 1/4 of the sliced potatoes over the pork chops, followed by 1/4 of the onion slices. Sprinkle the onion with 1 tablespoon flour and season with salt and pepper. Repeat the layers of potatoes, onions, 1 tablespoon of flour, and a sprinkle of salt and pepper three more times.\nMix the cheese sauce with milk until smooth and pour over the potatoes. Set the slow cooker to High and cook for 6 hours.\n",
        "picture_link": "I5T0ErrqAk0KTN3xy.J5t2LJio8q9na"
    },
    {
        "title": "Awesome Apple Martinis",
        "ingredients": [
            "1 fluid ounce apple schnapps ADVERTISEMENT",
            "1 fluid ounce vodka ADVERTISEMENT",
            "1 fluid ounce apple juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a cocktail shaker full of ice, combine apple schnapps, vodka and apple juice. Mix well. Pour into glasses and garnish with a slice of Granny Smith apple.\n",
        "picture_link": "NGr6uoSqmk4eETnlXWQNOekco4UlPLm"
    },
    {
        "title": "Quick and Easy Dip",
        "ingredients": [
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (8 ounce) jar medium salsa ADVERTISEMENT",
            "2 cups shredded Cheddar-Monterey Jack cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread the refried beans on the bottom of a casserole dish. Layer the sour cream, salsa and shredded cheese into the casserole dish. Serve with corn chips.\n",
        "picture_link": "on91wQtgTYTneGwKHJq/0H0hzvM1BeG"
    },
    {
        "title": "Pumpkin Bars III",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 2/3 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "6 ounces cream cheese ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch pan and set aside.\nIn a mixing bowl, beat together the eggs, sugar, oil and pumpkin. Sift together the flour, baking powder, salt, baking soda, salt and cinnamon; add to wet ingredients and mix thoroughly. Spread into prepared pan.\nBake at 350 degrees F (175 degrees C) for 25 to 30 minutes. Remove from oven and allow to cool.\nPrepare the frosting by beating together the cream cheese, butter and confectioner's sugar. Evenly spread over cooled bars.\n",
        "picture_link": "sDh2ymAHG.n7od7pgkcBvvuDtJEcV6K"
    }
]