[
    {
        "title": "Delicious Low-Carb Almond Flour Pancakes",
        "ingredients": [
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons almond flour ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon heavy whipping cream ADVERTISEMENT",
            "1 pinch baking powder ADVERTISEMENT",
            "2 drops vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk water, almond flour, vegetable oil, cream, baking powder, and vanilla extract together in a microwave-safe bowl.\nCook in the microwave on high until gooey batter forms, 1 1/2 to 2 minutes.\nLet batter rest until cooled slightly, 1 to 2 minutes. Whisk in egg until well-blended.\nHeat a lightly oiled griddle over medium-high heat. Drop batter onto the griddle and cook until bubbles form and the edges are dry, 4 to 5 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "YYXKioThCCMa8ecHCCOgEUujTSELdly"
    },
    {
        "title": "Protein-Packed Vegetarian Fried Rice",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 (12 ounce) package firm tofu, cubed ADVERTISEMENT",
            "2 carrots, peeled and diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1/4 onion, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 cups cooked white rice ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 (8 ounce) package frozen chopped spinach, thawed ADVERTISEMENT",
            "1 teaspoon sriracha hot sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium-high heat. Add tofu, carrots, celery, onion, and garlic; cook and stir until vegetables are just soft; 5 to 10 minutes. Season with salt and pepper.\nStir rice, egg, and spinach into the tofu mixture until egg is no longer runny, about 5 minutes. Stir in sriracha; season with salt and pepper.\n",
        "picture_link": "fzNQDO0tjHqcuCv0ojIDFnN0tZ1IIBe"
    },
    {
        "title": "Homemade Instant Hot Chocolate Mix",
        "ingredients": [
            "1 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon fine salt ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cocoa, sugar, salt, and cayenne in a bowl. Whisk until thoroughly combined. Store in glass jars.\n",
        "picture_link": "6d1JsUkPjpJmXP6IDSvTCmZleH9QTOG"
    },
    {
        "title": "Tuna Antipasto Salad Bowl",
        "ingredients": [
            "8 cups salad greens, washed and torn into bite-size pieces ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can whole pitted black olives, drained ADVERTISEMENT",
            "1 (14 ounce) jar marinated artichoke hearts, drained and quartered ADVERTISEMENT",
            "2 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "8 ounces cooked and chilled shell pasta ADVERTISEMENT",
            "1 cucumber, thinly sliced ADVERTISEMENT",
            "1 cup chopped tomato ADVERTISEMENT",
            "1 1/2 cups Italian-style salad dressing, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss salad greens, garbanzo beans, black olives, artichoke hearts, tuna, shell pasta, cucumber, and tomato together in a large bowl. Cover and refrigerate salad until lettuce is crisp and mixture is chilled, at least 2 hours.\nToss salad with salad dressing immediately before serving.\n",
        "picture_link": "tRLnJTS8CEiKY..788IIgXYXQdRrYXm"
    },
    {
        "title": "Tamarind Agua Fresca",
        "ingredients": [
            "ice ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "1/3 cup tamarind concentrate ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 orange, thinly sliced ADVERTISEMENT",
            "1 lime, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill glasses with ice. Combine water, tamarind concentrate, and sugar in a pitcher; stir until sugar is dissolved. Pour over ice and garnish with orange and lime slices.\n",
        "picture_link": "mtrxuBkx0FwN3pbqeowswfaHb9yrxy6"
    },
    {
        "title": "Power Oatmeal",
        "ingredients": [
            "1 cup quick cooking oats ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup Greek yogurt ADVERTISEMENT",
            "1 banana, mashed ADVERTISEMENT",
            "3 tablespoons flax seed meal ADVERTISEMENT",
            "2 tablespoons peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk oats, milk, yogurt, banana, flax seed meal, and peanut butter together in a bowl. Refrigerate until set, at least 15 minutes.\n",
        "picture_link": "wQpfKkdHP5mCfEVSopfmItVhFf7K1EK"
    },
    {
        "title": "Chuck and Heather's Panang Curry",
        "ingredients": [
            "1 pound beef flank steak ADVERTISEMENT",
            "2 cups coconut milk, divided ADVERTISEMENT",
            "3 tablespoons green curry paste ADVERTISEMENT",
            "4 teaspoons Vietnamese hot chile paste (such as sambal oelek) ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "2 cups cooked rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice beef against grain into 1/4-inch slices.\nHeat a wok or large skillet over medium-high heat; whisk 1/2 cup coconut milk and curry paste together until simmering, 1 to 2 minutes. Stir in 1/4 cup coconut milk; return curry mixture to a simmer. Repeat with remaining coconut milk returning mixture to a simmer with each addition, 7 to 8 minutes altogether.\nStir chile paste and beef into curry mixture; simmer just until beef is slightly pink in the center, 4 to 5 minutes. Stir in basil and sugar; cook until beef is soft and cooked through, 3 to 5 minutes more. Serve with cooked rice.\n",
        "picture_link": "T.XiITT6E9kzxxP2p9HpxPXzgNhz/LC"
    },
    {
        "title": "Creamy Cauliflower (Fauxtato) au Gratin",
        "ingredients": [
            "2 heads cauliflower, cored and cut into florets ADVERTISEMENT",
            "2 tablespoons butter, or as needed ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "1/4 cup half-and-half ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese, divided ADVERTISEMENT",
            "1/4 cup shredded mozzarella cheese, divided ADVERTISEMENT",
            "1/4 cup snipped fresh chives ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 pinch ground nutmeg (optional) ADVERTISEMENT",
            "1 pinch red pepper flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower florets, cover, and steam until very tender, about 15 minutes. Transfer cauliflower to a plate.\nPreheat oven to 425 degrees F (220 degrees C). Butter a baking dish.\nMelt 2 tablespoons butter in a saucepan over low heat. Whisk in flour until paste forms, about 1 minute. Whisk in chicken stock and cook until thickened, about 1 minute more. Add steamed cauliflower; whip with hand mixer or immersion blender until smooth, 1 to 2 minutes. Remove from heat; stir in half-and-half, all but 1 tablespoon of the Parmesan cheese, all but 1 tablespoon of the mozzarella cheese, chives, salt, and pepper.\nPour cauliflower mixture into prepared baking dish. Top with remaining Parmesan cheese, remaining mozzarella cheese, nutmeg, and red pepper flakes.\nBake in preheated oven until golden brown, about 12 minutes.\n",
        "picture_link": "qgzGIax2RB1tU2BUrRDW4hlaaokW4xe"
    },
    {
        "title": "Motion by the Ocean",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger vodka ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger peach schnapps ADVERTISEMENT",
            "1/2 fluid ounce creme de cassis liqueur ADVERTISEMENT",
            "2 fluid ounces orange juice ADVERTISEMENT",
            "2 fluid ounces cranberry juice ADVERTISEMENT",
            "1 orange slice ADVERTISEMENT",
            "2 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the vodka, peach schnapps, creme de cassis, orange juice, and cranberry juice into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a chilled martini glass, and garnish with orange and cherries to serve.\n",
        "picture_link": "8kBSlDD.pk6njq0eyqZfdtIiJdFAQA2"
    },
    {
        "title": "White Chocolate Shot",
        "ingredients": [
            "2 fluid ounces creme de cacao liqueur ADVERTISEMENT",
            "2/3 cup French vanilla ice cream ADVERTISEMENT",
            "1/4 cup sweetened whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the container of a blender, combine the creme de cacao and ice cream. Blend until smooth, then pour into shot glasses and top with whipped cream.\n",
        "picture_link": "W0l31Lliy967eM5zrFhYAhgTvGMKvD2"
    },
    {
        "title": "Tropical Depression",
        "ingredients": [
            "1 cup ice cubes ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers mango flavored vodka ADVERTISEMENT",
            "1 1/2 fluid ounces orange juice ADVERTISEMENT",
            "1 1/2 fluid ounces apple juice ADVERTISEMENT",
            "1 1/2 fluid ounces pineapple juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a glass with ice cubes. Pour in vodka, then orange juice, apple juice and pineapple juice. Stir and serve.\n",
        "picture_link": "RzelnVCWnHNClrp44dABTB2TwEaWZWC"
    },
    {
        "title": "Cassis Martini",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger blackcurrant vodka ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger creme de cassis liqueur ADVERTISEMENT",
            "1/2 cup pink grapefruit juice ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vodka, cassis, pink grapefruit juice, and ice in a shaker. Shake vigorously, and strain into a martini glass.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Jungle Lobster",
        "ingredients": [
            "4 large fresh poblano chile peppers ADVERTISEMENT",
            "4 lobster tails ADVERTISEMENT",
            "4 tablespoons butter, divided ADVERTISEMENT",
            "1/2 small sweet onion, minced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Roast the poblano peppers whole over a hot grill, under a broiler or on a gas stove flame, turning frequently until evenly blackened. Place in a bowl when done, and cover. Leave them to sweat for about 10 minutes to loosen the burnt skin. When cool enough to handle, peel the skin off by rubbing with your hands, leaving the chilies intact. Rinse off the peppers. Cut a slit down one side and open to remove the seeds and stem. Set aside.\nBring a large pot of water to a rolling boil. Add the lobster tails and cook for about 10 minutes, until bright red. Drain and cool slightly. Cut the shell lenghtwise and remove the tail meat in one piece. Set aside.\nMelt 2 tablespoons of the butter in a skillet over medium heat. Add onion and garlic; cook and stir until tender and golden.\nSlit the lobster tails lengthwise about halfway through. Fill the pocket with sauteed onion and garlic. Wrap each tail in one of the peppers so that the openings do not match up. Dip in egg to seal.\nHeat the remaining butter in the same skillet over medium-high heat. Place the stuffed peppers in the pan with the seam side down to seal. Fry on each side just until golden. Serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Tofu Salad",
        "ingredients": [
            "2 (14 ounce) packages extra-firm tofu, cut into cubes ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon rice wine vinegar ADVERTISEMENT",
            "2 teaspoons roasted sesame seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tofu cubes in a large bowl.\nCombine soy sauce, rice wine vinegar, and roasted sesame seeds in a small bowl. Pour over tofu; toss to mix.\nChill tofu until flavors are combined, about 2 hours.\nRemove from refrigerator. Scoop tofu into small servings bowls and serve.\n",
        "picture_link": "Nb47XnwmYZOJOCzYPzaCpOxhaV76Mvy"
    },
    {
        "title": "Omelet for Leftovers (Omurice)",
        "ingredients": [
            "1 1/2 teaspoons butter ADVERTISEMENT",
            "1 small tomato, sliced, or more to taste ADVERTISEMENT",
            "1/2 red bell pepper, sliced ADVERTISEMENT",
            "1/4 onion, sliced ADVERTISEMENT",
            "1/4 zucchini, sliced ADVERTISEMENT",
            "1 ounce sliced mushrooms ADVERTISEMENT",
            "1/2 cup warm cooked rice ADVERTISEMENT",
            "1 tablespoon ketchup, or to taste ADVERTISEMENT",
            "1 slice cooked bacon, chopped, or more to taste ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat. Add tomato, red bell pepper, onion, zucchini, and mushrooms; cook and stir until tender, about 5 minutes. Add rice, ketchup, bacon, paprika, salt, and black pepper; stir well to combine. Transfer to serving plate.\nHeat a nonstick skillet over medium heat. Pour in eggs in a thin layer; cook until set, about 5 minutes. Serve eggs over rice mixture.\n",
        "picture_link": "o0jSSVYIpLAsdESSu28EjhmtbMx7eM."
    },
    {
        "title": "Lemon Pisco Sour",
        "ingredients": [
            "1 tablespoon white sugar, or to taste ADVERTISEMENT",
            "1 fluid ounce fresh lemon juice ADVERTISEMENT",
            "2 fluid ounces Pisco ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small cup, dissolve the sugar in the lemon juice. Pour the lemon juice and sugar and Pisco into a cocktail shaker. Add ice, cover and shake until the outside is frosty, about 30 seconds. Strain into a cocktail glass and serve.\n",
        "picture_link": "vr/2znMiVBjs2u.fkhYNvrJWPVwEpJa"
    },
    {
        "title": "Badam (Almond) Sherbet",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "2 tablespoons heavy cream ADVERTISEMENT",
            "1 cup finely ground almonds ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons rose water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the milk, cream, ground almonds, confectioners' sugar, and rosewater in a blender, and blend until thoroughly mixed and smooth, about 1 minute. Serve over ice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Camper's Special",
        "ingredients": [
            "1 tablespoon butter or margarine ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 russet potatoes, peeled and cubed ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 pound linguica sausage, sliced ADVERTISEMENT",
            "1 (12 ounce) can roast beef with gravy ADVERTISEMENT",
            "1 (15.25 ounce) can sweet corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter and oil in a large frying pan over the hot coals of a campfire. Stir in potatoes and onion, and cook until the onions are translucent. Add the linguica and continue cooking until the linguica has browned. Stir in the roast beef, and cook until warmed. Add the corn with it's juice, and allow to simmer for 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Layered Beef Salad with Warm Dressing",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup sukiyaki sauce ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 teaspoons grated fresh ginger root ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 (1 1/2) pound beef sirloin steak, sliced thinly across the grain ADVERTISEMENT",
            "2 heads red leaf lettuce, torn into bite-sized pieces ADVERTISEMENT",
            "1 onion, sliced thin ADVERTISEMENT",
            "1 bunch radishes, sliced into thin rounds ADVERTISEMENT",
            "1 English cucumber, thinly sliced ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "1 jicama, peeled and julienned ADVERTISEMENT",
            "6 hard-cooked eggs, sliced ADVERTISEMENT",
            "1 cup peanut oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the soy sauce, sukiyaki sauce, water, ginger, and garlic in a small bowl.\nArrange the sliced steak in the bottom of a shallow baking dish. Pour about 1/2 of the soy sauce mixture over the steak. Allow to marinate 30 minutes.\nBuild the salad by layering onto a platter the lettuce, onion, radish, cucumber, tomato, jicama, and eggs in that order.\nHeat the oil in a skillet over medium-high heat. Cook the marinated steak strips in the hot oil to desired doneness, 3 minutes each side for medium-well.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Guava Preserves",
        "ingredients": [
            "24 guavas, peeled ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "1 cup fresh orange juice ADVERTISEMENT",
            "1 cup white sugar, or as needed ADVERTISEMENT",
            "plantain leaves for wrapping (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the guavas in a large pot and fill with enough water to cover, about 2 quarts. Bring to a boil, then simmer over medium heat for about 30 minutes. Drain fruit and pass through a strainer or food mill to turn into pulp.\nPlace the pulp in a stainless steel or copper pot and stir in 4 cups of sugar and orange juice. Cook over medium heat, stirring constantly with a wooden spoon, until the mixture is thick enough to peel off of the bottom of the pan.\nCover the surface of a 10x15 inch jellyroll pan with about half of the remaining sugar. Pour the hot guava mixture onto it and sprinkle the remaining sugar over the top. Let it cool to room temperature. When cooled, cut into squares and wrap in dried plantain leaves if you like. You could wrap in waxed paper or cellophane if the leaves are not available.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Butter",
        "ingredients": [
            "1 pint heavy cream ADVERTISEMENT",
            "1/4 teaspoon kosher or sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whip 1 pint heavy cream with a stand mixer fitted with whisk attachment. Be sure to cover mixer and bowl with a clean kitchen towel, or risk a splattering mess. The cream will go through several stages -- foamy, then frothy, then soft peaks, stiff peaks, and, eventually, butter. It will take anywhere from 6 to 15 minutes until the butter separates from the buttermilk and starts to spatter.\nPour buttermilk into an airtight container and refrigerate; it will keep for 3 days.\nForm butter into a ball. Working over a colander in the sink, rinse butter under cold running water to remove any remaining buttermilk. If butter is too soft, float it in a bowl of ice water for 20 minutes, then continue. When water runs clear from butter in your hands, knead butter firmly to remove all moisture.\nButter will stay fresh longer if it's salted, so work 1/4 teaspoon kosher or sea salt into butter. Wrap in wax or cheese paper, or pack into ramekins.\n",
        "picture_link": "xC1tRJtaDFIq9yTszBeq25/v7/fquCy"
    },
    {
        "title": "Cranberry Parfaits",
        "ingredients": [
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "3 tablespoons sugar ADVERTISEMENT",
            "1/2 cup graham cracker crumbs ADVERTISEMENT",
            "1 (14 ounce) can low-fat sweetened condensed milk ADVERTISEMENT",
            "1/2 cup cranberry sauce ADVERTISEMENT",
            "1 cup cold whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a skillet over medium heat. Stir in the sugar and cook until bubbling, about 1 minute. Add the graham cracker crumbs; stir until the color deepens, about 3 minutes. Turn out onto a plate to cool.\nCombine the condensed milk and cranberry sauce in a mixing bowl, blend together with a hand mixer until the mixture thickens. Place the whipping cream in a separate bowl and beat with an electric mixer until firm peaks form; fold into the cranberry mixture.\nLayer 1/4 cup of the cranberry mixture into each of six (8 ounce) wine goblets or glasses; top each with 1 tablespoon of the crumbs. Repeat layering. Refrigerate at least 1 hour, up to 4 hours.\n",
        "picture_link": "Ez3r9clUlxE2y/UOnNWaiCrJqhIFGmu"
    },
    {
        "title": "Remoulade Sauce with Horseradish",
        "ingredients": [
            "1/2 cup minced celery ADVERTISEMENT",
            "1/2 cup minced green onions ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup prepared horseradish ADVERTISEMENT",
            "1/4 cup chopped fresh Italian parsley ADVERTISEMENT",
            "2 tablespoons Creole mustard ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1 tablespoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1/8 lemon (with rind), seeds removed ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 bay leaf, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend celery, green onion, mayonnaise, horseradish, parsley, Creole mustard, ketchup, Worcestershire sauce, Dijon mustard, vinegar, hot pepper sauce, lemon, garlic, paprika, salt, and bay leaf in a food processor, adding ingredients gradually with motor running, until lemon rind is finely chopped and sauce is well-blended. Chill sauce in refrigerator for at least 2 hours.\n",
        "picture_link": "xU0OzRNR5intv4MjOnvcJcUVVTIjmwi"
    },
    {
        "title": "Rosemary and Lamb Crispy Roast Potatoes",
        "ingredients": [
            "4 large baking potatoes, peeled and quartered ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 cup lamb roast drippings, cooled to room temperature ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F (220 degrees C). Place the potatoes in a large pan and fill with enough water to cover. Bring to a boil and cook for about 10 minutes, just cooking partially.\nPlace the potatoes into a large lidded tub and pour in the lamb drippings. Season with rosemary and salt. Close the lid and shake to coat the potatoes. Pour them out onto a baking sheet.\nBake for 45 minutes in the preheated oven, or until dark brown and crispy.\n",
        "picture_link": "puW00R.Gw4UCT2qHIGAvZQmubnJPPSS"
    },
    {
        "title": "Winter Gazpacho",
        "ingredients": [
            "1 (1 pound) package bacon, cut into 1-inch pieces ADVERTISEMENT",
            "8 large ripe tomatoes, diced ADVERTISEMENT",
            "1/2 salad cucumber, diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon dried parsley, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Chop the bacon into bite size pieces.\nPut the tomatoes, cucumber, and onion in a food processor or blender; process until the mixture has the texture of a viscous soup.\nHeat the olive oil in a large saucepan; cook and stir the garlic in the hot oil until fragrant, about 1 minute. Pour the tomato mixture into the pan. Season with parsley, salt, and pepper; cover and reduce heat to low. Simmer until the flavors blend to your liking, 40 to 60 minutes. Sprinkle the chopped bacon over the soup to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pepparkakor",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 tablespoons light corn syrup ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon allspice ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together the butter and sugar in a bowl. Stir in the syrup and eggs. Sift together the flour, salt, cinnamon, ginger, allspice, and cloves in a separate bowl; add to the butter mixture; knead into a stiff dough. Pat into a flat circle, and wrap in waxed paper. Refrigerate at least 2 hours.\nPreheat oven to 350 degrees F (175 degrees C). Roll the dough out onto a lightly-floured surface to about 1/2-inch thickness. Cut the dough using a star-shaped cookie cutter. Place cookies one inch apart on ungreased cookie sheets.\nBake in preheated oven until the edges are golden brown, about 10 minutes. Allow to cool to room temperature before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Yummy Matzo Rolls",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "2 cups matzo cake meal ADVERTISEMENT",
            "6 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water to boil in a saucepan. Add the salt, oil and margarine. When it returns to a boil, gradually stir in the matzo meal, continuing to stir until the mixture becomes a solid lump. Remove from the heat and let cool slightly.\nWhen the mixture is cool, stir in the eggs until a smooth texture is achieved. Let stand for 30 minutes. Form into four balls and place on a greased baking pan.\nPreheat the oven to 350 degrees F (175 degrees C). Bake the rolls for 30 minutes. Turn off the oven and leave the rolls inside for 10 minutes.\n",
        "picture_link": "5rilMYoBnhHWz7GV2lVdnYXCsYTnMUy"
    },
    {
        "title": "Summer Cucumber Jicama Salad",
        "ingredients": [
            "1 large cucumber ADVERTISEMENT",
            "1/4 jicama, peeled and cut into matchsticks ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "12 ounces white cherry tomatoes, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel cucumber, alternating rows so that thin green strips of peel are left. Slice cucumber into thin rounds.\nStir cucumber, jicama, lemon zest, and lemon juice together in a bowl until salad is evenly mixed. Gently fold tomatoes into salad.\n",
        "picture_link": "KiF789QnXqQKlEkk9i1Q7BuFj0FAqei"
    },
    {
        "title": "Frozen Melon Margaritas",
        "ingredients": [
            "4 cups ice cubes ADVERTISEMENT",
            "1 (12 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "2/3 cup tequila ADVERTISEMENT",
            "1/2 cup melon-flavored schnapps ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice, limeade, tequila, and melon-flavored schnapps together in a blender until smooth.\n",
        "picture_link": "DjcuAsg8Vc5v1u6eJ2LNNNS0zhwjfF."
    },
    {
        "title": "Tri-Tip Marinade",
        "ingredients": [
            "3 (2 liter) bottles lemon-lime soda (such as 7 Up®) ADVERTISEMENT",
            "20 fluid ounces soy sauce ADVERTISEMENT",
            "2 white onions, sliced ADVERTISEMENT",
            "2 lemons, sliced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (3 pound) beef tri-tip roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lemon-lime soda, soy sauce, onions, lemons, and garlic in a large pot; add roast.\nMarinate roast in the refrigerator at least 24 hours.\nPreheat grill to 250 degrees F (120 degrees C) to 300 degrees F (150 degrees C).\nRemove the roast from the marinade and shake to remove excess moisture. Discard the remaining marinade.\nCook roast on the grill until desired doneness and an internal temperature of at least 145 degrees F (65 degrees C) are reached, at least 30 minutes.\n",
        "picture_link": "/100bCSt/1hl8dr8HIr04EdDDwR86pm"
    },
    {
        "title": "Chocolate Hemp Protein Shake",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 banana, cut into chunks ADVERTISEMENT",
            "1/2 cup raw hemp seeds ADVERTISEMENT",
            "3 chopped pitted dates, or more to taste ADVERTISEMENT",
            "1 tablespoon cocoa powder, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend water, banana, hemp seeds, dates, and cocoa powder together in a blender until smooth. Refrigerate until flavors combine, 3 hours to overnight.\n",
        "picture_link": "3cum3TLfmtR7gVTzCe5jn0cFRXUQvwO"
    },
    {
        "title": "Sriracha Bloody Mary",
        "ingredients": [
            "3 1/2 cups tomato juice ADVERTISEMENT",
            "1 1/4 cups vodka ADVERTISEMENT",
            "2 serrano chile peppers, seeded and minced ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup olive juice ADVERTISEMENT",
            "1 pickled red pepper (such as Peppadew®), minced ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon freshly ground black pepper ADVERTISEMENT",
            "1 tablespoon sriracha sauce ADVERTISEMENT",
            "1 large clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon finely grated lemon zest ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "8 ribs celery ADVERTISEMENT",
            "8 spears pickled asparagus ADVERTISEMENT",
            "8 pitted green olives ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir tomato juice, vodka, serrano chile peppers, red wine vinegar, olive brine, red pepper, lemon juice, Worcestershire sauce, 1 tablespoon black pepper, sriracha sauce, garlic, lemon zest, celery salt, and kosher salt together in a pitcher. Cover the pitcher and refrigerate until chilled, 2 to 4 hours.\nDivide ice between 8 Collins glasses. Pour vodka mixture over ice and garnish each with celery rib, asparagus spear, green olive, and black pepper.\n",
        "picture_link": "Ra2qWPbkOj7KszCnRF3/jN4ZiF34es6"
    },
    {
        "title": "Dr. Horrible",
        "ingredients": [
            "1/2 cup ice cubes, or as needed ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger tequila ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger Puerto Rican rum ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice; add tequila, rum, and coffee-flavored liqueur. Cover shaker, shake, and strain cocktail into a glass.\n",
        "picture_link": "NEl49HG/zaK2UmlqzBP1EpdquyjoGTy"
    },
    {
        "title": "Curried Celery",
        "ingredients": [
            "1/2 cup cream cheese, softened ADVERTISEMENT",
            "1/2 cup raisins, finely chopped ADVERTISEMENT",
            "2 tablespoons minced peeled apple ADVERTISEMENT",
            "1 teaspoon medium curry powder, or to taste ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "8 stalks celery, or as needed, cut into thirds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese, raisins, apple, curry powder, and lemon juice until smooth. Spread onto celery.\n",
        "picture_link": "nHVs82XHD0l2jhSjOvbwwos//GIAy8e"
    },
    {
        "title": "Bacon and Cheddar Cheese Quiche",
        "ingredients": [
            "4 corn tortillas, or as needed ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "5 slices peppered bacon ADVERTISEMENT",
            "6 eggs, lightly beaten ADVERTISEMENT",
            "2/3 cup sour cream ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups fresh or frozen corn (thawed if frozen) ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven 325 degrees F. Wrap tortillas in Reynolds(R) Aluminum Foil and bake for 10 minutes or until soft. Arrange the tortillas to make a crust in a Reynolds(R) Bakeware Pie Pan, overlapping and trimming as needed, and making sure the edges stay below the top edges of the pan.\nCook onion and bacon in a large skillet until onion is tender and bacon is crisp. Drain on paper towels.\nWhisk together eggs, sour cream, and salt in a large bowl. Add onion mixture, corn, and cheese; mix well. Pour egg mixture into tortilla-lined pie pan.\nBake 35 to 45 minutes or until a knife inserted near the center comes out clean. If necessary, cover edge of crust with aluminum foil to prevent overbrowning.\nLet stand 10 minutes before serving.\n",
        "picture_link": "CKboLWurbbvoQwYLRY/XUmESlCJm8qG"
    },
    {
        "title": "Roasted Chicken with Chipotle Cocoa Rub",
        "ingredients": [
            "Rub: ADVERTISEMENT",
            "1 cup Diamond Crystal® Kosher Salt ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons chipotle chile powder ADVERTISEMENT",
            "Chicken: ADVERTISEMENT",
            "1 (3 1/2) pound whole chicken, skin on ADVERTISEMENT",
            "2 tablespoons canola or vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine Diamond Crystal(R) Kosher Salt, brown sugar, white sugar, cocoa powder, and chipotle chili powder in a medium sized bowl; stir well. Transfer to a sealable airtight container; set aside until needed. Spice blend will hold for 6 to 9 months at room temperature.\nPreheat oven to 350 degrees F (175 degrees C).\nRinse chicken and lightly dry off with paper towel. Place chicken in a heat-proof baking dish.\nLiberally rub approximately 1/2 cup seasoning onto chicken; apply at least 30 to 60 minutes prior to cooking. If not cooking within the hour, cover and refrigerate. (If removed directly from fridge, allow to sit at room temperature for 15 minutes.)\nDrizzle and gently rub chicken with oil.\nRoast in the pan to an internal temp 160 degrees F, approximately 1 hour 15 minutes.\nAllow to rest for 20 to 25 minutes before carving or serving.\n",
        "picture_link": "nelaEshxvGUsc38XLGspmp2K0usVlge"
    },
    {
        "title": "Parmesan Chicken Pasta with Marinara",
        "ingredients": [
            "2 cups vegetable oil for frying, or as needed ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 cup cornmeal fryer mix ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (8 ounce) package bucatini pasta ADVERTISEMENT",
            "1/2 (16 ounce) jar 3-cheese alfredo sauce ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese, or to taste ADVERTISEMENT",
            "1/3 (28 ounce) jar marinara sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 275 degrees F (135 degrees C).\nMix flour, bread crumbs, cornmeal mix, Italian seasoning, salt, and black pepper together in a resealable plastic bag. Beat eggs together in a bowl.\nBring a large pot of lightly salted water to a boil. Cook pasta in the boiling water, stirring occasionally until cooked through but firm to the bite, 10 to 12 minutes. Drain.\nStir alfredo sauce, cream, and wine together in a saucepan over low heat until white sauce is slightly reduced, 5 to 7 minutes.\nPlace chicken in the resealable bag with flour mixture; seal and shake until chicken is evenly coated. Remove chicken from bag, shaking off any excess coating and dip in the egg. Return chicken to flour mixture, seal bag, and shake to coat. Remove chicken from bag and discard extra flour mixture.\nFry chicken in the hot oil until golden brown and no longer pink in the center, 5 to 10 minutes. Remove chicken with a slotted spoon and place on a paper towel-lined plate to drain.\nPlace pasta on a serving platter and top with white sauce. Sprinkle Parmesan cheese over white sauce and place chicken on top. Spoon marinara over chicken.\n",
        "picture_link": "bYDVWEDSkvmYD9l10uab0.NscbxIDcq"
    },
    {
        "title": "Cherry-Date Skillet Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup firmly packed brown sugar ADVERTISEMENT",
            "1 (8 ounce) package chopped pitted dates ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "3 cups crispy rice cereal ADVERTISEMENT",
            "1 cup chopped coconut ADVERTISEMENT",
            "1/2 cup chopped drained maraschino cherries ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a 10-inch skillet over medium heat. Add sugar and dates to the melted butter; stir until the sugar dissolves, 1 to 2 minutes.\nRemove skillet from heat, add egg, and stir quickly to prevent the egg from cooking.\nReturn skillet to medium heat and cook, stirring constantly, until the mixture comes to a full boil, 4 to 6 minutes; cook at a boil, stirring constantly, for 1 minute more.\nRemove skillet from heat. Stir rice cereal, chopped coconut, chopped cherries, and vanilla extract with the dates. Let mixture cool until beginning to firm, about 10 minutes.\nShape mixture by rounded teaspoonful into 1-inch balls. Spread flaked coconut into a wide, shallow dish and roll balls in the coconut to coat.\n",
        "picture_link": "kDslKbLK8t0Ldw5t1gkplaUW9.mvQ9O"
    },
    {
        "title": "Apple Tomato Salsa",
        "ingredients": [
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 cup diced fresh tomatoes ADVERTISEMENT",
            "1/2 cup thinly chopped apples (such as Honeycrisp) ADVERTISEMENT",
            "2 tablespoons chopped jicama ADVERTISEMENT",
            "2 teaspoons coarsely chopped cilantro ADVERTISEMENT",
            "1 teaspoon chopped fresh chives ADVERTISEMENT",
            "1/2 teaspoon finely chopped fresh basil ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 1/2 teaspoons white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir garlic in a skillet over medium-low heat until fragrant, about 1 minute. Stir tomatoes, apples, and jicama into garlic; cook and stir until tomatoes are hot, 3 to 5 minutes.\nStir cilantro, chives, basil, and salt into tomato mixture; drizzle lime juice and vinegar over the top. Cook and stir until apples are juicy but still crisp and tomatoes are warm but still firm, 3 to 5 minutes. Drain some of the accumulated juices and transfer salsa to a bowl; refrigerate until chilled.\n",
        "picture_link": "eGe.zCb2ZdL1yGN/Jx9.wtT3Yn7Nbs."
    },
    {
        "title": "Buckwheat Granola",
        "ingredients": [
            "2 cups rolled oats ADVERTISEMENT",
            "3/4 cup buckwheat groats, chopped ADVERTISEMENT",
            "3/4 cup sunflower seeds ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 tablespoons coconut oil ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 vanilla bean, split and scraped ADVERTISEMENT",
            "1/2 cup almonds, chopped ADVERTISEMENT",
            "1/2 cup sweetened flaked coconut ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Line a baking sheet with parchment paper.\nMix oats, buckwheat, sunflower seeds, and salt in a large bowl.\nMelt coconut oil in a small saucepan over medium heat; stir in honey and seeds from vanilla bean until mixed. Pour over oat mixture and toss to coat. Spread oat mixture evenly over prepared baking sheet.\nBake in the preheated oven, stirring every 10 minutes, until granola is lightly brown, 35 to 40 minutes. Stir almonds into granola and continue baking until golden grown, about 5 to 10 minutes more. Allow granola to cool completely, then stir in coconut and raisins. Store in an airtight container.\n",
        "picture_link": "hHUIksXG2hQaElaYxz.QM0UV/En03XO"
    },
    {
        "title": "Root Beer Float Cocktail",
        "ingredients": [
            "3 ice cubes, or as desired ADVERTISEMENT",
            "2 fluid ounces coconut-flavored rum ADVERTISEMENT",
            "2 fluid ounces sweetened coffee creamer (such as International Delight®) ADVERTISEMENT",
            "6 fluid ounces root beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour ice into a glass. Top ice with rum and creamer; stir to combine. Pour root beer over the top.\n",
        "picture_link": "o2XSa9qB.zw0eTTd9zVKsAY9H3UcWQW"
    },
    {
        "title": "Quick Vegetable Saute",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 small shallot, minced ADVERTISEMENT",
            "4 cups mixed frozen vegetables, such as corn, carrots and green beans ADVERTISEMENT",
            "1/2 teaspoon dried dill or tarragon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Add shallot and cook, stirring, until softened, about 1 minute. Stir in frozen vegetables. Cover and cook, stirring occasionally, until the vegetables are tender, 4 to 6 minutes. Stir in dill (or tarragon), salt and pepper.\n",
        "picture_link": "JtuLbpfeETRplTvUkmwitRPLRpDzNq."
    },
    {
        "title": "Barbecue Portobello Quesadillas",
        "ingredients": [
            "1/2 cup prepared barbecue sauce ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1 chipotle chile in adobo sauce (see Note), minced* ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 pound portobello mushroom caps, gills removed, diced ADVERTISEMENT",
            "1 medium onion, finely diced ADVERTISEMENT",
            "4 8- to 10-inch whole-wheat tortillas ADVERTISEMENT",
            "3/4 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "2 teaspoons canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine barbecue sauce, tomato paste, vinegar and chipotle in a medium bowl.\nHeat 1 tablespoon oil in a large nonstick skillet over medium heat. Add mushrooms and cook, stirring occasionally, for 5 minutes. Add onion and cook, stirring, until the onion and mushrooms are beginning to brown, 5 to 7 minutes. Transfer the vegetables to the bowl with the barbecue sauce; stir to combine. Wipe out the pan.\nPlace tortillas on a work surface. Spread 3 tablespoons cheese on half of each tortilla and top with one-fourth (about 1/2 cup) of the filling. Fold tortillas in half, pressing gently to flatten.\nHeat 1 teaspoon oil in the pan over medium heat. Add 2 quesadillas and cook, turning once, until golden on both sides, 3 to 4 minutes total. Transfer to a cutting board and tent with foil to keep warm. Repeat with the remaining 1 teaspoon oil and quesadillas. Cut each quesadilla into wedges and serve.\n",
        "picture_link": "utaVqg1B0WxGtSRjW8wCYiz/92hHiIi"
    },
    {
        "title": "Zen Garden Pad Thai",
        "ingredients": [
            "1/3 cup naturally brewed soy sauce ADVERTISEMENT",
            "3 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "Pinch dried red chile peppers ADVERTISEMENT",
            "1 (500 gram) package Europe's Best® Zen Garden® vegetables ADVERTISEMENT",
            "1/2 pound medium-width rice stick noodles ADVERTISEMENT",
            "2 tablespoons Spectrum Naturals® Canola Oil, divided ADVERTISEMENT",
            "1 (170 gram) package Yves Veggie Cuisine® Chick'n Veggie Tenders ADVERTISEMENT",
            "1/3 cup chopped green onion ADVERTISEMENT",
            "1/3 cup chopped cilantro ADVERTISEMENT",
            "1/3 cup dry roasted peanuts ADVERTISEMENT",
            "Lime wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare sauce: In a medium bowl, mix together soy sauce, lime juice, brown sugar, garlic, ginger, sesame oil and chile peppers. Set aside.\nThaw vegetables; drain well. Set aside.\nPrepare noodles according to package directions. Toss noodles with 1 tablespoon (15 mL) of the oil. Set aside and keep hot.\nIn a large non-stick skillet over medium-high heat, heat remaining 1 tablespoon (15 mL) oil. Add veggie tenders, stir-fry for 1 minute. Add vegetables; stir-fry for 2 minutes.\nAdd noodles and sauce; toss to combine well. Top with green onion, cilantro and peanuts. Garnish with lime wedges.\n",
        "picture_link": "nl2Wkn4LAlpgHoVAxwJM4bFM5/UsYqe"
    },
    {
        "title": "'Cherry' Caprese Salad",
        "ingredients": [
            "1 (10 ounce) basket cherry tomatoes ADVERTISEMENT",
            "8 ounces small fresh mozzarella balls (ciliegine) ADVERTISEMENT",
            "1 (6 ounce) can large black olives ADVERTISEMENT",
            "3 tablespoons torn fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss tomatoes, mozzarella balls, black olives, and basil together in a large bowl.\n",
        "picture_link": "v.boBVuSa0O/Nh1VY5ePWgUcvxtLViy"
    },
    {
        "title": "Easy Lemon Halibut",
        "ingredients": [
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "8 ounces fresh baby spinach ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "4 (4 ounce) halibut steaks ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 lemon, thinly sliced ADVERTISEMENT",
            "Crushed red pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F. Add flour to a Reynolds(R) Large Oven Bag. Shake. Place bag in 2-quart rectangular baking dish at least 2 inches deep.\nPlace spinach in bag; sprinkle with onion. Top with fish. Stir together the butter, garlic, salt, and black pepper. Brush over fish. Arrange lemon slices over fish. Close bag with tie (found inside package). Cut six 1/2-inch slits in top of bag to allow steam to escape. Tuck ends of bag in dish.\nPlace dish in oven, allowing room for bag to expand during cooking without touching heating elements, wall, or racks. Bag should not hang over dish.\nBake 20 minutes.\nCut open top of oven bag carefully. Remember: Always support bag with the dish.\nServe fish with spinach and lemon, and spoon any juices over the top. Sprinkle with crushed red pepper, if desired.\n",
        "picture_link": "gp5pVC/VpJVd9D430hO5sQgMQyvsqFK"
    },
    {
        "title": "Cashew Salmon with Apricot Couscous",
        "ingredients": [
            "1/2 cup nonfat plain yogurt ADVERTISEMENT",
            "3 scallions, sliced, whites and greens separated ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "3/4 teaspoon salt, divided ADVERTISEMENT",
            "1/2 teaspoon freshly ground pepper, divided ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup chopped dried apricots ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1 cup whole-wheat couscous ADVERTISEMENT",
            "1 pound salmon fillet, preferably wild Pacific, skinned (see Note) and cut into 4 portions ADVERTISEMENT",
            "2 tablespoons chopped toasted cashews (see Note) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill to medium-high or position rack in upper third of oven and preheat broiler.\nCombine yogurt, scallion greens, lemon juice, cilantro, cumin, 1/4 teaspoon salt and 1/4 teaspoon pepper in a medium bowl. Set aside.\nHeat oil in a large saucepan over medium heat. Add apricots, ginger, the scallion whites and 1/4 teaspoon salt. Cook, stirring, until softened, about 2 minutes. Add water and bring to a boil over high heat. Stir in couscous. Remove from heat, cover and let stand until the liquid is absorbed, about 5 minutes. Fluff with a fork.\nMeanwhile, rub salmon with the remaining 1/4 teaspoon each salt and pepper. If grilling, oil the grill rack (see Tip). If broiling, coat a broiler pan with cooking spray. Grill or broil the salmon until browned and just cooked through, about 3 minutes per side. Serve with the couscous, topped with the yogurt sauce and cashews.\n",
        "picture_link": "GrpvjnIcuqdDxuuIosdcolEuAZZAB.S"
    },
    {
        "title": "Mexican Chicken Stuffed Peppers",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 red bell peppers, stemmed and cored ADVERTISEMENT",
            "2 yellow bell peppers, stemmed and cored ADVERTISEMENT",
            "2 orange bell peppers, stemmed and cored ADVERTISEMENT",
            "1 teaspoon Texas barbeque rub, or as needed ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "1/2 onion, thinly sliced ADVERTISEMENT",
            "1 mild green chile pepper, chopped ADVERTISEMENT",
            "1/2 jalapeno pepper, chopped ADVERTISEMENT",
            "2 tablespoons ground turmeric ADVERTISEMENT",
            "2 tablespoons ground coriander ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 (12 fluid ounce) can or bottle beer (such as Sam Adams Boston Lager®) ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 (14.5 ounce) can chickpeas (garbanzo beans), drained and rinsed ADVERTISEMENT",
            "3 cups cooked instant white rice ADVERTISEMENT",
            "1/2 cup shredded Mexican cheese blend, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray an 9x12-inch baking dish with cooking spray.\nRub the red bell peppers, yellow bell peppers, and orange bell peppers with barbeque rub; arrange in the baking dish.\nHeat olive oil in a skillet over medium heat; cook and stir chicken, onion, green chile pepper, jalapeno pepper, turmeric, coriander, cumin, salt, and pepper until chicken and onion are lightly browned, about 5 minutes. Add beer to chicken mixture; reduce heat to low, cover skillet, and simmer until beer is reduced by half and chicken is cooked through, about 45 minutes.\nFill bell peppers with chicken mixture. Pour stewed tomatoes, tomato sauce, and chickpeas into the baking dish, around the bell peppers. Cover dish with aluminum foil.\nBake in the preheated oven for 45 minutes. Remove aluminum foil and add rice and Mexican cheese blend on top of the tomato mixture around the bell peppers; continue cooking until cheese is golden brown, about 15 minutes.\n",
        "picture_link": "gMZdSzFEENMAfAuMUleYbfg78JY5sNy"
    },
    {
        "title": "Buttermilk Whole Wheat Bread",
        "ingredients": [
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 1/3 cups whole wheat flour ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 1/2 tablespoons vital wheat gluten ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "1/2 teaspoon powdered lecithin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground ginger ADVERTISEMENT",
            "1 pinch vitamin C powder ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine buttermilk, honey, and butter in a microwave-safe bowl; heat in microwave in 30 second increments until temperature is just below 110 degrees F (43 degrees C).\nPour buttermilk mixture into the bowl of a stand mixer and add whole wheat flour, all-purpose flour, wheat gluten, yeast, lecithin, salt, ginger, and vitamin C powder; mix, using the dough hook attachment on low speed, until dough just holds together and sides of bowl are clean. Let dough rest in bowl for 2 minutes; mix again with the dough hook attachment for 2 minutes more.\nRemove dough from bowl and knead by hand on a work surface until dough is warm and elastic, 2 to 3 minutes.\nSpray a large bowl with cooking spray and place dough in the bowl, turning it to coat all sides with oil. Spray a piece of plastic wrap with cooking spray and cover bowl with sprayed-side down. Let dough rise until doubled in size, about 1 hour.\nGently deflate dough by pressing with your fingers and let rise 10 to 15 minutes more.\nTurn dough onto a work surface and roll into an 8 1/2x11-inch rectangle. Starting with the short end, roll dough tightly into a roll, pinching the seams shut. Fold the ends underneath the loaf, pinching the edges to form a smooth top.\nSpray a loaf pan with cooking spray and place loaf in the pan. Cover dough loosely with the sprayed-plastic wrap. Let dough rise 1 1/2 to 2 inches above the pan, 30 to 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Remove plastic wrap from loaf.\nBake in the preheated oven for 35 to 40 minutes. Flip bread out of pan using hot pads; internal temperature should read 190 degrees F (88 degrees C). Allow loaf to cool on wire rack before slicing.\n",
        "picture_link": "cREIXmqfrj4MCd9AKOvjLeGxnmTfWhi"
    },
    {
        "title": "Blueberry Cucumber Smoothie",
        "ingredients": [
            "1 frozen banana, cut into chunks ADVERTISEMENT",
            "1/2 cucumber - peeled, seeded, and cut into chunks ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "1/4 cup coconut water ADVERTISEMENT",
            "2 tablespoons blueberry preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend banana, cucumber, buttermilk, coconut water, and blueberry preserves together in a blender until smooth.\n",
        "picture_link": "mpnuhifmDvybRmHyVaZmg6qGo1b.nhi"
    },
    {
        "title": "Toasted Coconut Ice Cream",
        "ingredients": [
            "3 cups unsweetened flaked coconut ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "8 ounces cream of coconut ADVERTISEMENT",
            "1 quart half-and-half ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1/2 cup whole milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spread 3 cups flaked coconut onto a baking sheet.\nBake coconut in the preheated oven, turning once, until toasted, 6 to 10 minutes. Cool completely.\nBeat sugar and eggs together in a bowl until light and frothy; add cream of coconut and beat well. Add half-and-half and vanilla extract into egg mixture, beating well after each addition. Stir toasted coconut and flaked coconut into half-and-half mixture.\nPour coconut mixture into the bowl of an ice-cream maker. Pour milk into coconut mixture to fill machine to the fill-line, if necessary. Freeze according to the manufacturer's instructions.\n",
        "picture_link": "sDpw6FAnpiYOuOfi6egJTSTcbxsLOfq"
    },
    {
        "title": "Coconut-Cranberry Bars with Pecans",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups sweetened dried cranberries (such as Craisins®) ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 1/4 cups pecan halves ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "3/4 cup white chocolate chips ADVERTISEMENT",
            "3/4 cup bittersweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking dish with parchment paper or grease.\nMix graham cracker crumbs and butter together in a bowl; press into the prepared baking dish.\nStir cranberries, sweetened condensed milk, pecans, coconut, white chocolate chips, and bittersweet chocolate chips together in a bowl; gently spread over the graham cracker crust.\nBake in the preheated oven until edges are golden brown, 25 to 28 minutes; cool on a wire rack.\n",
        "picture_link": "YAAQP.WK1HtIdrV7b0z/FV4VzhIymj2"
    },
    {
        "title": "Lentils and Buckwheat Salad To Go (Gluten-Free)",
        "ingredients": [
            "1/4 cup dry lentils ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/4 teaspoon ground paprika ADVERTISEMENT",
            "1/4 teaspoon ground rainbow peppercorns ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon ground mace ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "1/4 teaspoon crushed rose petals (optional) ADVERTISEMENT",
            "4 1/4 cups water ADVERTISEMENT",
            "1/4 cup buckwheat groats, rinsed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 ounces baby spinach leaves ADVERTISEMENT",
            "1/2 cup shredded cooked beets ADVERTISEMENT",
            "1/2 cup shredded carrots ADVERTISEMENT",
            "2 tablespoons finely chopped green onions ADVERTISEMENT",
            "1 teaspoon apple cider vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lentils into a bowl and cover with several inches of cool water; let stand at least 2 hours. Drain and rinse.\nMix olive oil, paprika, pepper, turmeric, red pepper flakes, mace, coriander, and rose petals together in a bowl.\nCombine lentils and 4 1/4 cups water in a pot and bring to a boil; cook until lentils are tender yet firm to the bite, 15 to 18 minutes. Add buckwheat groats and return water to a boil; add salt. Cook lentils and buckwheat for 10 minutes; remove from heat, cover pot, and let sit until all water is absorbed, about 5 minutes.\nPour lentils and buckwheat into a large bowl; add spinach, beets, carrots, and green onions. Pour seasoned oil mixture over lentil mixture and stir to coat. Drizzle apple cider vinegar over salad and stir to coat. Refrigerate for flavors to blend, at least 30 minutes.\n",
        "picture_link": "tr90JSqED.XRprHlffkNLX5Cl.bgHee"
    },
    {
        "title": "Best Raisin Currant Butter Tarts",
        "ingredients": [
            "Pastry: ADVERTISEMENT",
            "5 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 cups shortening ADVERTISEMENT",
            "3/4 cup ice water, or as needed ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "5 cups brown sugar ADVERTISEMENT",
            "1 2/3 cups butter, softened ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "5 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/4 cups raisins ADVERTISEMENT",
            "1 1/4 cups dried currants ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour and salt together in a large bowl; cut in the shortening with a knife or pastry blender until the mixture resembles coarse crumbs. Add ice water, 1 tablespoon at a time, tossing with a fork, until the flour mixture is moistened. When you squeeze a handful of the moistened pastry mixture, it should form a ball. Divide dough in half and shape into balls.\nPreheat oven to 450 degrees F (230 degrees C). Spray 36 muffin cups with cooking spray.\nRoll pastry out 1/8-inch thick on a lightly floured surface. Cut into 4-inch rounds; press rounds into the bottom and up sides of muffin cups to make tart shells.\nBeat brown sugar and butter together with an electric mixer until smooth and creamy; beat in eggs, milk, and vanilla extract just until combined. Stir raisins and currants into butter mixture; fill tart shells with mixture 2/3-full.\nBake in the preheated oven for 8 minutes; leaving oven closed, reduce temperature to 350 degrees F (180 degrees C) and bake until filling is bubbly and pastry is lightly browned, about 15 minutes.\n",
        "picture_link": "H4tR4TioRUc2CnYunbBNXYH8YCteooe"
    },
    {
        "title": "Pumpkin Banana Tofu Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1/2 cup tofu ADVERTISEMENT",
            "6 almonds, or more to taste ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend banana, milk, pumpkin, tofu, almonds, cinnamon, and nutmeg together in a blender until smooth.\n",
        "picture_link": "NlIOWiSZ93/KvmQnKsHNNyQ7KfM28Vi"
    },
    {
        "title": "Zucchini and Carrot Smoothie",
        "ingredients": [
            "1 zucchini - peeled, grated, and chopped ADVERTISEMENT",
            "1 carrot - peeled, grated, and chopped ADVERTISEMENT",
            "1/2 cup plain fat-free Greek yogurt ADVERTISEMENT",
            "1/2 cup 1% milk ADVERTISEMENT",
            "2 tablespoons rolled oats ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 tablespoon flax seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend zucchini, carrot, yogurt, milk, oats, honey, and flax seeds in a blender until smooth.\n",
        "picture_link": "Rwu/eHyfqWzAWv2hDszaGp2lKhg0gh6"
    },
    {
        "title": "Roasted Garlic Romano Butter (Spaghetti Warehouse® Copycat)",
        "ingredients": [
            "1/2 cup butter, at room temperature ADVERTISEMENT",
            "3 cloves roasted garlic, mashed, or more to taste ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "7 teaspoons grated Romano cheese ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix butter and garlic together in the bowl of a stand mixer. Beat milk into butter mixture using the whisk attachment on the mixer until smooth and whipped. Add Romano cheese and parsley to butter mixture and beat until thoroughly whipped.\n",
        "picture_link": "hHUx3f9MpF9dm0iBEhRYaEaRAN9Bjka"
    },
    {
        "title": "Summertime Almond Butter and Peach Sandwich",
        "ingredients": [
            "2 tablespoons almond butter ADVERTISEMENT",
            "2 slices wheat bread ADVERTISEMENT",
            "1 peach, or to taste, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread almond butter onto one side of each slice of bread. Pile the sliced peaches atop one almond butter-covered slice and sandwich with the other.\n",
        "picture_link": "bdJB0Qn0bQWuY0fQofhS2hpTftv3Zxu"
    },
    {
        "title": "Katie's Meatloaf Sauce",
        "ingredients": [
            "1/2 cup steak sauce (such as A1®), or to taste ADVERTISEMENT",
            "1/2 cup ketchup, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir steak sauce and ketchup together in a bowl; season with salt and pepper.\n",
        "picture_link": "NWq6Loj6Q5mH/c4IC8F/HP6nGH6xDnu"
    },
    {
        "title": "Mashed Rutabagas with Bacon",
        "ingredients": [
            "3 slices bacon, chopped ADVERTISEMENT",
            "2 rutabagas, peeled and diced ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a skillet over medium heat; cook and stir until crisp, about 10 minutes. Remove bacon from skillet, reserving 1 to 2 tablespoons bacon grease, to your preference.\nBring a large pot of water to a boil. Cook rutabagas in the boiling water until very tender, 15 to 20 minutes. Drain rutabagas and return to the pot.\nMix reserved bacon grease, butter, salt, and pepper into rutabagas; blend using an electric mixer until smooth. Stir chopped bacon into the rutabaga mixture.\n",
        "picture_link": "ut5fyRw0AOinOYJRNwOE6zBOyRl25/e"
    },
    {
        "title": "Savory Curry Dip",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "2 teaspoons prepared horseradish ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mayonnaise, milk, minced onion, horseradish, curry powder, and salt together in a bowl until smooth.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Green Detox Smoothie",
        "ingredients": [
            "3/4 cup pineapple juice ADVERTISEMENT",
            "1/2 cup fresh spinach leaves ADVERTISEMENT",
            "1/4 pear, chopped ADVERTISEMENT",
            "1/4 green apple, chopped ADVERTISEMENT",
            "1/4 avocado, chopped ADVERTISEMENT",
            "3 broccoli florets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend pineapple juice, spinach, pear, apple, avocado, and broccoli florets together in a blender until smooth.\n",
        "picture_link": "1CGrIiOQfZTDE5a/rwwNosE2AXMyvny"
    },
    {
        "title": "Crocodile Guac",
        "ingredients": [
            "3 Anaheim chile peppers ADVERTISEMENT",
            "6 ripe avocados - peeled, pitted, and diced ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1/2 sweet yellow onion, diced ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 clove garlic, pressed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Arrange Anaheim chile peppers on a baking sheet.\nRoast under the preheated broiler until chiles turn from bright green to dull green with some charred sections, about 5 minutes per side.\nTransfer chiles to a resealable plastic bag; seal and steam peppers until skin loosens from pepper flesh, about 10 minutes. Carefully open the bag and pull charred skin from the chiles and scrape and remove the seeds. Slice chiles lengthwise and chop.\nMix chiles, avocados, tomatoes, onion, cilantro, lime juice, garlic, salt, and pepper together in a bowl, lightly mashing the avocados while stirring, until blended but before the avocados turn to mush.\n",
        "picture_link": "69/PDa/GQC0Nj0BnPb8XIKaXxpLKk82"
    },
    {
        "title": "Bitter Lemon Soda",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "2 sprigs fresh lavender ADVERTISEMENT",
            "3 cups lemon juice ADVERTISEMENT",
            "4 cups ice cubes, or as needed ADVERTISEMENT",
            "1 (11 fluid ounce) bottle cold tonic water, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sugar, water, lemon zest, and lavender in a pot and cover; bring to a boil. Cook mixture until sugar is dissolved, 5 to 10 minutes. Remove pot from heat and cool syrup to room temperature, about 15 minutes.\nPour lemon juice into a pitcher, strain syrup into lemon juice, and stir until concentrate is evenly mixed. Refrigerate concentrate until chilled, at least 1 hour.\nFill serving glasses with ice and pour about 2 ounces concentrate into each glass; top with tonic water and stir.\n",
        "picture_link": "boAETbnEpKwD7zSfsnd6kXsh5RDh6Ti"
    },
    {
        "title": "Foul Medammes (Spicy Fava Bean Dip)",
        "ingredients": [
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 tomato, seeded and chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 (15 ounce) can fava beans, drained ADVERTISEMENT",
            "lemon, juiced ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/3 cup tahini ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium-high heat; saute onion, tomato, and garlic until softened, about 10 minutes. Stir fava beans, lemon juice, cumin, and turmeric into onion mixture; cook until heated through, 3 to 5 minutes. Stir tahini into fava bean mixture and cook until warmed, 2 to 3 minutes; season with salt and pepper.\nPour fava bean mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\n",
        "picture_link": "zoOesTJReo1LaVUe.7PFRHos/B6QxE6"
    },
    {
        "title": "Banana Pina Colada Smoothie",
        "ingredients": [
            "1 large banana ADVERTISEMENT",
            "1 cup coconut juice blend, or more to taste ADVERTISEMENT",
            "2 pineapple spears ADVERTISEMENT",
            "3 cubes ice ADVERTISEMENT",
            "1 tablespoon agave nectar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend banana, coconut juice blend, pineapple, ice, and agave nectar together in a blender until smooth.\n",
        "picture_link": "oi/wViclt6VLfbPE1ejppZ/gRfpoNtu"
    },
    {
        "title": "Buffalo Chicken Sushi Roll",
        "ingredients": [
            "1/2 pound fully cooked breaded chicken breast tenderloins ADVERTISEMENT",
            "1/4 cup hot pepper sauce ADVERTISEMENT",
            "4 sheets nori (dry seaweed) ADVERTISEMENT",
            "4 cups cooked sushi rice ADVERTISEMENT",
            "1 carrot, peeled and cut into 4-inch matchsticks ADVERTISEMENT",
            "1 celery stalk, cut into 4-inch matchsticks ADVERTISEMENT",
            "spicy mayonnaise (optional) ADVERTISEMENT",
            "French-fried onions (such as French's®) (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chicken and hot sauce in a bowl and toss to coat.\nPlace 1 nori sheet onto a bamboo sushi rolling mat. Spread 1 cup rice onto the nori, leaving a 1/2-inch strip along one edge. Arrange 1/4 each of the chicken, carrot, and celery in a line near one edge of the rice. Use the mat to carefully lift the edge near the filling and roll tightly around the ingredients. Moisten the remaining edge of the nori with a finger dipped in water and press to seal; repeat with remaining ingredients.\nCut each roll into 8 slices using a sharp, wet knife. Top each piece with a dollop of mayonnaise and a small amount of French-fried onion.\n",
        "picture_link": "XsECDsWvysuQLS/JMjlegTznaS16fmm"
    },
    {
        "title": "Szechuan Peppercorn Salmon",
        "ingredients": [
            "1 teaspoon Szechuan peppercorns ADVERTISEMENT",
            "2 cloves garlic, coarsely chopped ADVERTISEMENT",
            "1/4 teaspoon grated lime zest ADVERTISEMENT",
            "1/4 teaspoon coarse salt ADVERTISEMENT",
            "2 (6 ounce) fillets salmon ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source. Line a baking sheet with aluminum foil.\nUsing a mortar and pestle or spice grinder, grind the peppercorns, chopped garlic, lime zest, and salt until the peppercorns are finely ground. Rub salmon fillets with olive oil, then place onto the prepared pan, skin side down. Rub spice mixture onto top of salmon fillets.\nBroil until the salmon is flaky and no longer pink in the center, 10 to 15 minutes. Drizzle with soy sauce and serve.\n",
        "picture_link": "Yc3VihxxbobewDC/HqD9k8ejMgeFBVK"
    },
    {
        "title": "Chicken Rice Salad II",
        "ingredients": [
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 head lettuce, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.\nHeat the vegetable oil in a large skillet over medium heat. Cook the chicken breasts until no longer pink in the center and the juices run clear, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut the chicken into bite size pieces.\nToss chicken, rice, and lettuce in a large bowl. Serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lemon-Mint Sorbet",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "6 sprigs mint, chopped ADVERTISEMENT",
            "6 leaves lemon balm ADVERTISEMENT",
            "1 cup muscat wine ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the sugar, water, mint, and lemon balm to a simmer in a saucepan over medium heat. Stir until the sugar has dissolved. Strain into a heatproof container. Stir in the muscat wine. Refrigerate until cold, about 4 hours.\nStir in the lemon juice; pour the chilled mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Transfer ice cream to a one- or two-quart plastic container with a lid; cover surface with plastic wrap and seal. For best results, ice cream should ripen in the freezer for at least 2 hours or overnight.\n",
        "picture_link": "/X2Qjhx3vuvqgs.24HzscYWUWegCm5m"
    },
    {
        "title": "Machhere Jhol (Bengali Fish Curry)",
        "ingredients": [
            "2 large tomatoes, coarsely chopped ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 pounds thick whitefish fillets, cut into large chunks ADVERTISEMENT",
            "1/2 teaspoon mustard seeds ADVERTISEMENT",
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "1/2 teaspoon black cumin seeds ADVERTISEMENT",
            "1/4 teaspoon fennel seeds, lightly crushed ADVERTISEMENT",
            "1/4 teaspoon fenugreek seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the tomatoes, cumin, turmeric, salt, and water to a boil in a four quart saucepan; reduce heat to medium and maintain a simmer.\nHeat the oil in a skillet over medium-high heat; cook the fish in the oiled skillet until golden brown, 2 to 3 minutes per side. Transfer the fish to the saucepan.\nHeat a separate skillet over medium heat, and toast the mustard seeds, cumin seeds, black cumin seeds, fennel seeds, and fenugreek seeds until fragrant, just a few seconds. Stir the spices into the saucepan. Simmer until the flavors integrate, about 10 minutes more. Serve hot.\n",
        "picture_link": "GPa.B8sFByznmwWEJViHPhwZgzZzzda"
    },
    {
        "title": "Grandpop Joe's Challah Bread Stuffing",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 turkey liver, chopped ADVERTISEMENT",
            "1 (1 pound) loaf challah bread, cut into 1-inch cubes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the liver; cook and stir until the liver is evenly browned, 5 to 7 minutes. Remove from heat, and cool until just warm.\nPlace challah bread in a large bowl. Toss with the onion and liver mixture, squeezing lightly to distribute any liquid. Stir in the beaten eggs, and season with salt.\n",
        "picture_link": "FFZqI6TfLpcLbWE9CwTwxYYXa6YQc32"
    },
    {
        "title": "Herb-Marinated Tenderloin",
        "ingredients": [
            "1 (8 ounce) fillet beef tenderloin (filet mignon) ADVERTISEMENT",
            "6 fresh sage leaves ADVERTISEMENT",
            "1 clove garlic, cut into sixths ADVERTISEMENT",
            "4 fresh thyme sprigs ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut a few 2-inch slits in the side of the fillet; stuff the sage leaves and garlic pieces into the slits. Wrap the thyme sprigs around the fillet. Store in refrigerator to allow the meat to absorb the flavors for 4 to 12 hours.\nPreheat an outdoor grill for medium heat; lightly oil the grate. Cut the tenderloin in half and season with salt and pepper.\nCook the fillets 4 to 6 minutes per side, until no longer pink, or to desired doneness.\n",
        "picture_link": "Ww.aECG7jlKNy1rnfAPh5QIbNxtVcIO"
    },
    {
        "title": "Red Rocket",
        "ingredients": [
            "1/2 ounce peach schnapps ADVERTISEMENT",
            "1/2 ounce watermelon schnapps ADVERTISEMENT",
            "1/2 ounce orange juice ADVERTISEMENT",
            "1 ounce vodka ADVERTISEMENT",
            "1/2 ounce pineapple juice (optional) ADVERTISEMENT",
            "1 splash grenadine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the peach schnapps, watermelon schnapps, orange juice, vodka, pineapple juice, and grenadine into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a chilled glass to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dollie's Tomato Aspic",
        "ingredients": [
            "1 (16 ounce) can stewed tomatoes, undrained ADVERTISEMENT",
            "1 (.6 ounce) envelope sugar-free raspberry gelatin mix ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1 (.25 ounce) envelope unflavored gelatin ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the tomatoes with the juice from the can into a saucepan over medium heat and heat until warm, about 5 minutes.\nDissolve the raspberry gelatin in the boiling water. Stir the unflavored gelatin into the cold water until dissolved. Add both mixtures to the warmed tomatoes and stir. Pour the tomato mixture into a gelatin mold and refrigerate until congealed, 3 to 4 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "French Pork Stuffing",
        "ingredients": [
            "2 pounds ground pork ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 teaspoons ground cloves ADVERTISEMENT",
            "2 teaspoons cinnamon ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (4 ounce) packet saltine crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the pork and onion in a large skillet with enough water to cover; simmer over medium heat for 1 hour. Stir in the cloves, cinnamon, and walnuts; season with salt and pepper. Fold the crushed crackers into the mixture. Transfer to a covered casserole dish.\nPreheat an oven to 350 degrees F (175 degrees C).\nBake stuffing in the preheated oven for 20 minutes; serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ruby's Spicy Red Salad",
        "ingredients": [
            "2 cups shredded red cabbage ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "2 red bell peppers, diced ADVERTISEMENT",
            "1 cup sliced sugar snap peas ADVERTISEMENT",
            "2 green onions, thinly sliced ADVERTISEMENT",
            "1 red jalapeno pepper, finely minced ADVERTISEMENT",
            "5 radishes, diced ADVERTISEMENT",
            "5 strawberries, diced ADVERTISEMENT",
            "1 tablespoon crushed ramen noodles ADVERTISEMENT",
            "1 tablespoon slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the red cabbage, red onions, red peppers, sugar snap peas, green onions, jalapeno peppers, and radishes in a large bowl. Toss well. Sprinkle the strawberries, ramen noodles, and almonds on top of the salad.\n",
        "picture_link": "ogMrjVbVDis6cEqB0dvLjdtMgl33Fky"
    },
    {
        "title": "Judy's Brown Sauce",
        "ingredients": [
            "10 cups peeled, cored, and roughly chopped tart apples ADVERTISEMENT",
            "10 cups pitted and halved fresh prune plums ADVERTISEMENT",
            "5 cups chopped onions ADVERTISEMENT",
            "6 cups malt vinegar ADVERTISEMENT",
            "5 cups white sugar ADVERTISEMENT",
            "1/2 cup salt ADVERTISEMENT",
            "1/2 cup Worcestershire sauce ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "2 teaspoons ground allspice ADVERTISEMENT",
            "2 teaspoons ground cayenne pepper ADVERTISEMENT",
            "15 half-pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Working in batches, place the apples, plums and onions into the work bowl of a food processor, and grind until fine. Transfer the ground fruit and onions into a large pot, and stir in the malt vinegar, sugar, salt, Worcestershire sauce, garlic, ginger, nutmeg, allspice, and cayenne pepper until the mixture is well combined. Bring to a simmer over low heat, and simmer until brown and thickened, about 3 to 4 hours.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the sauce into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot, and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "RzAinDssfqAHZ3J/3OVXW7YkyOQJExe"
    },
    {
        "title": "Strassburgare",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 1/2 tablespoons vanilla sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup potato flour ADVERTISEMENT",
            "1 drop red food coloring, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nWith an electric mixer, beat the butter and confectioners' sugar together in a bowl until smooth and creamy; beat in the vanilla sugar.\nIn a separate bowl, whisk the flour with potato flour.\nStir the flour mixture into the butter mixture, about 1/4 cup at a time, until all the flour is mixed in.\nStir in the food coloring until the dough is evenly colored.\nPlace the dough into a cookie press fitted with a decorative tip.\nPress out 1 1/2-inch cookies onto an ungreased baking sheet.\nBake cookies in the preheated oven until the bottoms are just lightly browned, about 10 minutes. Allow to cool on the baking sheet for about 5 minutes before removing to finish cooling on wire racks.\n",
        "picture_link": "rV0I2IPKxsypIzWyvwT4ZzEKIrLAg6C"
    },
    {
        "title": "Big Game Heroux Dip",
        "ingredients": [
            "2 tablespoons dried chives ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons celery salt ADVERTISEMENT",
            "1 1/2 tablespoons dried cilantro ADVERTISEMENT",
            "1 teaspoon finely ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon monosodium glutamate (MSG) (optional) ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "3 tablespoons horseradish sauce ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the chives, basil, paprika, sugar, parsley, onion powder, garlic powder, celery salt, cilantro, pepper, allspice, ginger, cayenne pepper, turmeric, monosodium glutamate, and lemon juice in a microwave-safe bowl.\nCook in the microwave on High for 30 seconds.\nStir in the horseradish sauce and mustard; allow to cool 5 minutes; fold in the mayonnaise. Chill in refrigerator at least 30 minutes.\n",
        "picture_link": "kB9ZjEmt4NDimmKqKizflt/v1i416Ma"
    },
    {
        "title": "Colonial Holiday Cup",
        "ingredients": [
            "1 gallon apple juice ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "6 cinnamon sticks ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "4 teaspoons whole cloves ADVERTISEMENT",
            "2 teaspoons whole allspice ADVERTISEMENT",
            "1 orange, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour apple juice, orange juice, and lemon juice into a large pot. Place the cinnamon sticks, brown sugar, cloves, and allspice onto the center of a 8 inch square piece of cheesecloth. Gather together the edges of the cheesecloth, and tie with kitchen twine to secure then add to the juice mixture. Float orange slices on top of the juices. Simmer over medium heat for 1 hour.\n",
        "picture_link": "fnLhwdOCH7L6T8od6shoVzO1w.WBgSe"
    },
    {
        "title": "Crawfish in Red Sauce",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped celery ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (14.5 ounce) can whole peeled tomatoes, undrained and chopped ADVERTISEMENT",
            "1/2 (14.5 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "5 pounds cooked and peeled whole crawfish tails ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a large saucepan over medium heat. Stir in the garlic, onion, bell pepper, and celery. Cook and stir until the onion is translucent and the celery is tender, about 10 minutes. Stir in the tomato sauce, chopped tomatoes with their juice, and diced tomatoes; season to taste with salt and pepper. Bring to a boil over medium-high heat; reduce heat and simmer 30 minutes.\nStir in the crawfish tails, and simmer until hot, 5 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cherry Chocolate Bark",
        "ingredients": [
            "1 (12 ounce) bag semisweet chocolate chips ADVERTISEMENT",
            "12 cherry-flavored candy canes, crushed ADVERTISEMENT",
            "1/3 cup red confectioner's coating (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9x13 inch baking pan with aluminum foil.\nMelt the chocolate chips in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, until smooth, 1 to 3 minutes (depending on your microwave). Do not overheat or chocolate will scorch. Using a spatula, quickly spread the melted chocolate evenly in the prepared pan until the bottom of the pan is covered. Sprinkle the crushed candy evenly over the chocolate, and pat lightly with a clean spatula to help the candy settle into the chocolate.\nMelt the red confectioner's coating, if using, in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, until smooth, 1 to 3 minutes (depending on your microwave). Spoon the melted coating into a resealable plastic bag; snip off a very small corner of the bag, and use to drizzle coating over the bark.\nPlace the pan in the refrigerator or freezer until hardened, about 30 minutes. Remove from pan; peel off foil. Break into small pieces to serve.\n",
        "picture_link": "ckblHFci.xc/Ov3SEd6/Zcz8V2nXM8a"
    },
    {
        "title": "Cilantro-Mint Raita",
        "ingredients": [
            "2 cups plain yogurt ADVERTISEMENT",
            "1 large cucumber, grated ADVERTISEMENT",
            "10 fresh mint leaves ADVERTISEMENT",
            "1/2 bunch chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree the yogurt, grated cucumber, mint, and cilantro in a food processor until the mint and cilantro are finely chopped. Add the cumin, salt, and pepper; pulse several times to incorporate. Transfer the raita to a bowl and cover with plastic wrap; store in refrigerator to allow the flavors to blend, at least 1 hour. Serve chilled.\n",
        "picture_link": "IvBYec5dW1lqgTbrYubafka9ElZ86jC"
    },
    {
        "title": "Holiday Fruit Stuffed Roasted Chicken",
        "ingredients": [
            "1/4 cup coarsely chopped walnuts ADVERTISEMENT",
            "1 (5 pound) whole chicken ADVERTISEMENT",
            "salt and pepper, to taste ADVERTISEMENT",
            "2 tablespoons Italian-style salad dressing ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "1 teaspoon grated lemon zest ADVERTISEMENT",
            "1/2 teaspoon dried basil, or to taste ADVERTISEMENT",
            "1/2 teaspoon dried thyme, or to taste ADVERTISEMENT",
            "Stuffing ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 apple, cored and chopped ADVERTISEMENT",
            "1 pear, cored and chopped ADVERTISEMENT",
            "1/2 cup pineapple chunks, drained ADVERTISEMENT",
            "1/2 cup cubed French bread ADVERTISEMENT",
            "5 pitted prunes, chopped ADVERTISEMENT",
            "1 cup seedless grapes, halved ADVERTISEMENT",
            "2 tablespoons Italian-style salad dressing ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1 tablespoon apple cider ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 275 degrees F (135 degrees C). Spread the walnuts out onto a baking sheet and toast them for about 45 minutes, until the nuts start to brown and become fragrant. Watch the walnuts carefully, because they burn quickly. Set the walnuts aside.\nWhile the walnuts are roasting, rinse the chicken well with cold water, then pat dry inside and out with paper towels. Place the chicken into a small roasting pan, and sprinkle inside and outside with salt and pepper.\nCombine 2 tablespoons Italian dressing, 2 tablespoons of melted butter, 1 teaspoon orange peel, the lemon peel, thyme, and basil in a small bowl. Brush the chicken inside and out with the mixture.\nTo make the stuffing, heat 2 tablespoons of butter in a skillet over medium heat. Add the apple, pear, and pineapple chunks; cook and stir about 5 minutes, until the apple and pear are tender. Mix the cooked fruit mixture with the roasted walnuts, bread, prunes, grapes, 2 tablespoons Italian dressing, orange juice, apple cider, 1 teaspoon of orange zest, honey, and cinnamon in a large bowl and stir to combine.\nIncrease oven temperature to 325 degrees F (165 degrees C). Spoon the stuffing into the chicken cavity, including the area under the neck skin. Secure the skin over the neck cavity with toothpicks, and fold the wings underneath the chicken. Tie the drumsticks together.\nRoast the chicken in the preheated oven for 1 hour, and untie the drumsticks. Return the chicken to the oven and continue roasting until no longer pink at the bone and the juices run clear, about 45 minutes to 1 hour additional roasting time. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the chicken from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing.\n",
        "picture_link": "PtxqWteObgcNHUN/zRhrM0FWP2UhpWa"
    },
    {
        "title": "Rosemary Egg Frittata",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 small red onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "2 green bell peppers, diced ADVERTISEMENT",
            "12 eggs, beaten ADVERTISEMENT",
            "1/2 cup chopped fresh basil leaves ADVERTISEMENT",
            "4 sprigs fresh rosemary, leaves removed and chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 cup olive oil for frying ADVERTISEMENT",
            "1 sweet potato, peeled and cut into thin matchsticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 3 tablespoons of olive oil over medium heat in an oven-safe skillet, and cook and stir the onion and garlic until translucent, about 5 minutes. Stir in the green peppers, and cook and stir until they have begun to soften, 5 more minutes. Pour the eggs over the vegetables, and stir in the basil, rosemary, salt, and pepper. Reduce the heat to medium-low, let the eggs sit over the heat until they have started to set, about 10 minutes.\nTransfer the skillet to the preheated oven and cook the frittata until fully set, about 15 minutes.\nWhile the frittata is baking, heat 1 cup of olive oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Deep-fry the sweet potato slices, a layer at a time, until golden brown and crisp, about 5 minutes. Remove with a slotted spoon, and drain on paper towels. Top baked frittata with the fried sweet potato slices to serve.\n",
        "picture_link": "w612LZ/54XojJ6ttB.2qz2.5S/MU8kO"
    },
    {
        "title": "Asparagus Vinaigrette",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "2 pounds fresh asparagus, trimmed ADVERTISEMENT",
            "1/2 cup white wine vinegar ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup green bell pepper, chopped ADVERTISEMENT",
            "3 tablespoons dill pickle relish ADVERTISEMENT",
            "1 tablespoon fresh parsley, chopped ADVERTISEMENT",
            "1 tablespoon fresh chives, chopped ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "8 cups mixed baby greens ADVERTISEMENT",
            "4 radishes, sliced ADVERTISEMENT",
            "2 tomatoes, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs into a saucepan and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel once cold and cut into slices; set aside.\nMeanwhile, place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the asparagus, recover, and steam until just tender, 2 to 6 minutes depending on thickness.\nWhile the asparagus is steaming, whisk together the vinegar, mustard, salt, pepper, green bell pepper, relish, parsley, and chives in a large mixing bowl. Slowly pour in the olive oil while whisking quickly to create a dressing. Toss the hot, steamed asparagus in the dressing, then place into the refrigerator for at least an hour.\nTo serve, divide the baby greens onto individual plates. Divide the asparagus spears among the salads, then garnish with radish slices, egg slices, and quartered tomatoes.\n",
        "picture_link": "S8L.Ilyh73rHh9wjGjgCMOUSY7Ms3d2"
    },
    {
        "title": "Mock Eggnog",
        "ingredients": [
            "1/2 gallon vanilla ice cream ADVERTISEMENT",
            "2 quarts eggnog, chilled ADVERTISEMENT",
            "2 liters lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "1/4 cup crushed peppermint hard candies (optional) ADVERTISEMENT",
            "1 cup heavy whipping cream, whipped ADVERTISEMENT",
            "10 chocolate mint candies, coarsely crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large punch bowl, combine the ice cream, eggnog, carbonated beverage, and finely crushed candy; mix well.\nPlace dollops of whipped cream on top of eggnog, and sprinkle with coarsely chopped peppermint candies for garnish.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bachelor Buttons I",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup raspberry preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease muffing tins.\nSift dry ingredients together, cut in butter with fork or pastry cutter. Beat egg, add milk and vanilla then stir quickly into dry mixture.\nRoll out on well floured surface to about 1/4 inch thickness and cut with round cookie cutter.\nPlace in muffin tins and drop a teaspoon of raspberry jam in center. Fold sides in slightly and bake for 20-25 minutes or until lightly golden.\n",
        "picture_link": "i0bQiXLJQXDDHfhtJWN5MkgFz/ZTg8y"
    },
    {
        "title": "Kriss Kringle Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 pound red and green candied cherries, chopped ADVERTISEMENT",
            "1 pound chopped pecans ADVERTISEMENT",
            "1/2 pound chopped blanched almonds ADVERTISEMENT",
            "1/2 pound Brazil nuts, chopped ADVERTISEMENT",
            "2 pounds pitted dates ADVERTISEMENT",
            "4 candied pineapple rings, finely chopped ADVERTISEMENT",
            "1/2 pound chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nCream the butter and the sugar together. Beat in the eggs.\nCombine the cherries, pecans, brazil nuts, almonds, dates, pineapple and walnuts. Toss to coat with 1/2 cup of the flour.\nSift the remaining flour with cinnamon, salt and baking soda. Add the flour mixture to the butter mixture and mix well. Stir in the fruit and nut mixture. Drop by spoonfuls onto the prepared baking sheet.\nBake at 350 degrees F (175 degrees C) for 10 to 15 minutes.\n",
        "picture_link": "pHwrYctsvQc/2cZmETrmA3NWm3Iy4GK"
    },
    {
        "title": "Irene's Christmas Cheese Dip",
        "ingredients": [
            "2 pounds processed cheese food (eg. Velveeta) ADVERTISEMENT",
            "2 onions, diced ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "6 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1/2 green bell pepper, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the cheese in the top of a double-boiler over medium heat.\nAdd the onions, tomatoes, jalapenos, red and green bell peppers.\nMix well and heat for additional 10 minutes.\n",
        "picture_link": "N5DZeHV8vPi1SPOcmHyhyZcESGdHOH2"
    },
    {
        "title": "Toasted Sesame Thins",
        "ingredients": [
            "2 1/2 cups sesame seeds ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "2 teaspoons sesame oil (optional) ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Toast sesame seeds on pan, stirring occasionally, until lightly golden (about 10 minutes). Set aside. Increase oven temperature to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn large mixing bowl, combine flour, baking powder, salt, brown sugar and white sugar. Melt butter over low heat and add to mixture. Separate two of the eggs and add egg yolks. Add the other two eggs and mix well. Mix in toasted sesame oil (optional) and vanilla. Stir until well blended. Add 1 1/2 cups of sesame seeds and mix with electric mixer at medium speed for 10 minutes. Let dough sit for 10 minutes.\nPlace remaining sesame seeds in shallow pan. Drop level tablespoonful sized pieces of dough into pan. Gently roll in sesame seeds while forming 2-inch long log shape. Taper the ends and place on cookie sheet about 1-inch apart.\nBake until golden, 11 to 13 minutes. Let cool on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grandmother's Boiled Raisin Cake",
        "ingredients": [
            "1 cup raisins ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "3 teaspoons boiling water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 325 degrees(165 degrees C). Grease a 9 x 5 inch pan. Set aside.\nIn 3 quart saucepan, boil raisins slowly water until there is 1 cup of water left and the raisins are plump. Allow mixture to cool.\nStir in sugar and egg. Mix spices with boiling water and add to raisin mixture. Add flour, soda, vanilla and last, the melted shortening. Blend well. Pour into loaf pan.\nBake for 40 to 50 minutes. When cool make glaze by mixing confectioners sugar, ground cinnamon, and milk. Spread on top of cooled cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fruitcake Truffles",
        "ingredients": [
            "6 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "3 tablespoons whipping cream ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons orange liqueur ADVERTISEMENT",
            "1 cup fruitcake crumbs ADVERTISEMENT",
            "1/2 cup sifted confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop chocolate into small pieces. In saucepan over very low heat, melt chocolate, cream, and butter until blended and smooth.\nStir in liqueur and fruitcake crumbs; chill for 2 hours or until firm.\nShape into 1 inch balls and chill at least 20 minutes. Before serving, roll in icing sugar or coca powder and chill for 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lucy's Carrot Pudding",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon minced carrot (optional) ADVERTISEMENT",
            "1 cup peeled and shredded potatoes ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup green apples ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream 1/2 cup butter or margarine and 1 cup sugar. Mix in carrots, potatoes, and raisins. Sift flour, baking soda, salt, and spices together; mix into the creamed mixture. Stir in apples.\nFill cans 2/3 full with pudding mixture. Cover with foil.\nPlace cans in a roasting pan with 2 to 3 inches of water. Steam at 300 degrees F (150 degrees C) for 2 1/2 to 3 hours.\nStir together 1/2 cup sugar and cornstarch. Combine mixture with water in a saucepan. Cook and stir over low heat until thick. Stir in 2 tablespoons butter or margarine and lemon juice. Serve warm over pudding.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tangy Cereal-Coated Chicken",
        "ingredients": [
            "1/2 cup orange juice ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 teaspoon Dijon-style prepared mustard ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "2 cups crushed buttery round crackers ADVERTISEMENT",
            "1/4 cup wheat and barley nugget cereal (e.g. Grape-Nuts™) ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "4 tablespoons orange marmalade, warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Marinade: Combine the orange juice, ginger, honey, mustard, salt and pepper to taste in a glass or stainless steel mixing bowl. Mix the marinade until well combined; add chicken pieces and turn to coat. Cover dish and refrigerate for at least 2 hours to marinate.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish.\nIn a resealable plastic bag, mix together the crushed crackers, Grape-Nuts®, and flour. Rinse chicken and pat semi-dry. Dredge in cracker mixture to coat and place in baking dish. Bake in the preheated oven for 40 to 45 minutes.\nRemove the chicken from the oven and preheat the oven's broiler.\nBrush each chicken piece with a light coating of marmalade. Return the baking dish to the oven and place it under the broiler for 3 minutes.\n",
        "picture_link": "MVWmYrmYeuzic2O9VTRaqfQmxjIHOna"
    },
    {
        "title": "Sour Cream Figure-Eights",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl beat butter or margarine until softened. Add 1 cup sugar and beat until fluffy. Add the egg and vanilla and beat well.\nStir together the flour, baking soda, salt, and nutmeg. Add flour mixture and sour cream alternately to butter mixture. Beat until well mixed.\nCover and chill at least 2 hours or until easy to handle.\nPreheat oven to 350 degrees F.\nCombine cinnamon and 2 tablespoons of sugar in a small bowl. Roll dough 1/8 inch thick. Cut into rings with a 2 1/2-inch doughnut cutter.\nTwist the rings once to form figure eights and place 2 inches apart on an ungreased cookie sheet. Spinkle with cinnamon-sugar mixture. Bake for 6-8 minutes or until done. Remove and cool on a wire rack.\n",
        "picture_link": "3gLiOiKhWyj6LTPozKhivA/liIt/5Oe"
    },
    {
        "title": "Caramel Corn II",
        "ingredients": [
            "1 cup unpopped popcorn ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup dark corn syrup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 tablespoon distilled white vinegar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add 1 tablespoon of the oil to a 4 quart saucepan, and heat over high heat. When oil is hot, add 1/2 cup of popping corn. Keep pan moving constantly. When corn stops popping, remove from heat. Repeat until all corn has been popped. Place popped corn into a buttered bowl.\nIn a 3 quart saucepan, combine sugar, salt, butter, dark corn syrup, and water. Stir until sugar dissolves. Stir in vinegar. Boil sugar mixture to hard ball stage, 248 degrees F (118 degrees C). Remove caramel from heat. Stir in soda. Beat to thoroughly dissolve the soda.\nPour hot caramel over popcorn, and quickly stir into popcorn; work quickly for the caramel sets up fast. Spread out on wax paper to cool. Store in a tightly covered container.\n",
        "picture_link": "BYKo1HS8cehp2CGc3Dfrzj6eatAGmA."
    },
    {
        "title": "Laura's Chocolate Peppermint Sauce",
        "ingredients": [
            "20 peppermint hard candies, unwrapped ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons chocolate syrup ADVERTISEMENT",
            "1/4 cup instant chocolate pudding mix ADVERTISEMENT",
            "1/8 teaspoon peppermint extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the top of a double boiler combine the candies, milk, syrup, pudding mix, peppermint extract and salt. Stir over simmering water until melted.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Frozen Christmas Pudding",
        "ingredients": [
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup sultana raisins ADVERTISEMENT",
            "1/2 cup dried currants ADVERTISEMENT",
            "1/4 cup candied cherries, chopped ADVERTISEMENT",
            "1/4 cup candied mixed fruit peel ADVERTISEMENT",
            "1/4 cup fruit juice ADVERTISEMENT",
            "1/4 cup almonds ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "4 1/4 cups chocolate ice cream, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine fruit with fruit juice and spices. Cover, and allow to stand overnight.\nThe next day mix together soaked fruits, almonds, cream, and ice cream. Pour mixture into a large mold, and cover with foil. Freeze for at least one week to allow flavour to develop.\nUnmold by quickly dipping into hot water, and inverting onto serving plate.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]