[
    {
        "title": "Easy Asian Dipping Sauce",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup rice wine vinegar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "3 cloves minced garlic ADVERTISEMENT",
            "2 tablespoons minced fresh ginger root ADVERTISEMENT",
            "2 teaspoons sesame seeds ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the soy sauce, vinegar, honey, garlic, ginger, sesame seeds, sesame oil in a bowl.\n",
        "picture_link": "p4vjCKBMNygxTk/qdJJnCUHMrLoz5fy"
    },
    {
        "title": "Bloody Mary Short Ribs",
        "ingredients": [
            "4 pounds beef short ribs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 large onion, sliced into rings ADVERTISEMENT",
            "2 leeks (white portion only), sliced ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 cup beef stock ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "3 cups bottled Bloody Mary mix ADVERTISEMENT",
            "6 large carrots, peeled and cut into 3-inch pieces ADVERTISEMENT",
            "20 small mushrooms, stems removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Season the short ribs with salt and pepper, and set aside.\nHeat an oven-proof Dutch oven, or wide, shallow pot with a lid over medium-high heat. Stir in the olive oil and butter until the butter has melted. Stir in the onion, and cook until the onion begins to soften, about 3 minutes. Add the leek, and continue cooking until the onion and leek are lightly browned. Remove and set aside.\nBrown the short ribs in the hot Dutch oven until browned on all sides, about 3 minutes per side. Once browned, sprinkle the reserved onions over the ribs, pour in the wine, beef stock, tomatoes, and Bloody Mary mix. Nestle the carrot chunks among the ribs. Bring to a simmer, then cover, and place into the preheated oven.\nBraise in the oven for 2 hours, then add the mushroom caps, recover, and continue cooking 1 hour more.\n",
        "picture_link": "8E6lcojbRfPwuQceXlLz8Usuij06t12"
    },
    {
        "title": "Ultimate Chicken Fingers",
        "ingredients": [
            "2/3 cup Original Bisquick® mix ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon salt or garlic salt ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "3 boneless skinless chicken breast halves, cut crosswise into 1/2-inch strips ADVERTISEMENT",
            "1 egg, slightly beaten ADVERTISEMENT",
            "3 tablespoons butter or margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 450 degrees F. Line cookie sheet with foil; spray with cooking spray.\nMix Bisquick mix, cheese, salt and paprika in 1-gallon resealable plastic food-storage bag. Dip half the chicken strips into egg; place in bag of Bisquick mixture. Seal bag; shake to coat. Place chicken on cookie sheet. Repeat with remaining chicken. Drizzle butter over chicken.\nBake 12 to 14 minutes, turning after 6 minutes with pancake turner, until no longer pink in center.\n",
        "picture_link": "5tDpZlBu9lL.hnqEkcD0TNcLrPrWOhi"
    },
    {
        "title": "Zucchini Bites",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "3 slices bacon, finely chopped ADVERTISEMENT",
            "1 large carrot, grated ADVERTISEMENT",
            "1 large zucchini, grated ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup self-rising flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 12 muffin miniature muffin pan.\nHeat the oil in a large skillet over medium heat. Stir in the onion and bacon. Cook until onion is translucent and bacon is browned, about 5 minutes. Stir in the carrot and zucchini; cook until they begin to soften, about 2 minutes. Transfer mixture to a bowl to cool.\nBeat the eggs, cream, and Parmesan cheese together in a large bowl. Season with salt and pepper. Stir egg mixture into cooled zucchini mixture; stir in flour. Spoon the batter evenly into the prepared muffin cups.\nBake in preheated oven until a toothpick inserted in the center comes out clean, 15 to 20 minutes.\n",
        "picture_link": "L.qZyGNbgmSDT1eC7HPNXjSEr1d2c92"
    },
    {
        "title": "Butternut Vegetable Soup",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup finely diced onion ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "4 large carrots, thinly sliced ADVERTISEMENT",
            "2 cups peeled and cubed butternut squash ADVERTISEMENT",
            "12 cups vegetable broth ADVERTISEMENT",
            "2 red potatoes, cubed ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups finely chopped kale leaves ADVERTISEMENT",
            "1 (16 ounce) can great Northern beans, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a large Dutch oven over medium heat. Stir in the onion and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the carrots and butternut squash; cook and stir until squash begins to brown, about 15 minutes.\nPour in the broth. Stir in the red potatoes, thyme, salt, and pepper, and bring to a boil. Reduce heat and simmer until vegetables are tender, about 45 minutes. Stir in the kale and great Northern beans, and simmer until the kale is tender, about 10 minutes.\nPour about 3 cups of the soup into a blender, filling the pitcher no more than halfway full (you may have to do this in two batches). Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Return the pureed portion of the soup to the soup pot, leaving the remaining soup chunky. Alternately, you can use a stick blender and partially puree the soup right in the cooking pot.\n",
        "picture_link": "1XM2I3Z4DeJzSI7BVj3epovPvPiNn8W"
    },
    {
        "title": "Meatloaf with a Ranch Twist",
        "ingredients": [
            "1/2 cup vegetable juice (such as V8®) ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix (such as Hidden Valley Ranch®) ADVERTISEMENT",
            "1 teaspoon rubbed sage ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup Italian-seasoned dry bread crumbs ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup fat-free milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nCombine the vegetable juice, brown sugar, and Worcestershire sauce in a saucepan over medium heat; cook until the sauce thickens, about 10 minutes.\nMix the ground beef, garlic powder, onion powder, ranch dressing mix, sage, salt, and pepper together in a large bowl. Gradually sprinkle the bread crumbs into the meat while mixing so the crumbs are distributed evenly throughout; add the egg and milk and continue mixing. Shape the mixture into a loaf and transfer to a loaf pan. Pour about half the sauce over the meatloaf.\nBake in the preheated oven until no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Cut the meatloaf into 6 even slices. Pour the remaining sauce over the slices to serve.\n",
        "picture_link": "3GUsO1owI7weXix2kmKFFS6MMKQf/we"
    },
    {
        "title": "Slow Cooker Moscow Chicken",
        "ingredients": [
            "6 chicken thighs ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "2 cloves garlic, roughly chopped ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/2 teaspoon grated ginger root ADVERTISEMENT",
            "1 (10 fluid ounce) bottle Russian-style salad dressing ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook chicken until well browned on both sides. Allow chicken to cool slightly.\nWrap each thigh in a piece of bacon, and place in slow cooker. Sprinkle garlic and ginger over the chicken; top with Russian dressing. Cook on Low heat for 5 to 6 hours. Season to taste with salt and pepper.\n",
        "picture_link": "e1yJGptHfpWwYcm/tDNIEFz2fMyK4U."
    },
    {
        "title": "No-Tomatoes-Required Italian Seasoned Stir Fry",
        "ingredients": [
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast meat - cut into cubes ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 cup sliced zucchini ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "1/4 cup Italian salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, garlic powder, salt, and pepper together in a resealable plastic bag. Add cubed chicken to the bag and shake until well coated.\nHeat the oil in a large skillet over medium heat. Add the chicken; cook and stir until the chicken is no longer pink, about 5 minutes. Stir in the bell pepper, onion, zucchini, mushrooms, chicken broth, and Italian dressing. Cover and simmer until vegetables and meat are tender, about 10 minutes.\n",
        "picture_link": "Ox4EPGEgj2S5RO02jqHJqbQzyOvwjd."
    },
    {
        "title": "St. Patrick's Chocolate & Mint Cheesecake Bars",
        "ingredients": [
            "1 (18.25 ounce) package chocolate fudge cake mix with pudding (such as Betty Crocker® Triple Chocolate Fudge cake mix) ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (16 ounce) container cream cheese flavored frosting (such as Betty Crocker® Rich and Creamy) ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "6 drops green food coloring, or as needed ADVERTISEMENT",
            "3 drops creme de menthe candy flavoring (such as Wilton®), or as needed ADVERTISEMENT",
            "1 (10 ounce) package dark chocolate and mint chips (such as Nestle® Toll House® Dark Chocolate and Mint Morsels) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nBeat cake mix and butter with an electric mixer on low speed in a bowl until crumbly, 3 to 5 minutes. Set aside 1 cup for topping.\nPress remaining crumb mixture into bottom of an ungreased 9x13 inch pan.\nPlace in preheated oven and bake until edges begin to crisp, about 10 minutes. Remove from the oven and cool slightly.\nBeat cream cheese and frosting with an electric mixer on medium speed in a bowl until smooth, 3 to 5 minutes.\nDrop eggs one at a time into the cream cheese mixture and beat until blended, 2 to 3 minutes.\nPour in 6 drops green food coloring, or more for a darker color; beat until color is blended, about 2 minutes.\nBeat in creme de menthe candy flavoring until thoroughly blended, about 2 minutes. Taste and add more flavoring if needed.\nPour batter over the chocolate crust in the 9x13 pan.\nSprinkle 1 cup reserved crumb mixture over cheesecake batter.\nTop with 1 cup chocolate and mint morsels; reserve remaining morsels for finishing touches.\nPlace the pan in the preheated oven and bake until set, 42 to 45 minutes.\nRemove pan from oven and cool completely.\nCover and refrigerate until chilled, at least 2 hours.\nPour reserved chocolate and mint morsels into a small microwave-safe bowl. Microwave morsels in 45 second intervals; stir until completely melted and smooth.\nPour melted chocolate into a resealable plastic bag.\nClip a small bottom corner of the bag. Gently squeezing the bag, drizzle melted chocolate over the cooled cake through the clipped corner.\nCut cake into bars to serve.\n",
        "picture_link": "Lh78asZey0SeEZA3V0cyjouCLXJWNcu"
    },
    {
        "title": "Molasses Brined Pork Chops",
        "ingredients": [
            "1/2 cup kosher salt ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "7 cups cold water ADVERTISEMENT",
            "4 (2 1/4 inch thick) center cut, bone-in pork chops ADVERTISEMENT",
            "1/2 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine salt, molasses, cloves, and boiling water in a large container. Stir until molasses and salt are dissolved; let cool to room temperature.\nPour cold water into molasses mixture; stir to combine.\nCompletely submerge pork chops in molasses mixture. Cover container and refrigerate for 6 hours.\nRemove pork chops from brine and pat dry with paper towels. Lightly oil each chop.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nPlace pork chops on the hottest part of the grill; cook each side until browned, 2 to 3 minutes. Transfer to a medium-high area of the grill and cook pork until it is slightly pink in the center, 6 to 8 minutes per side. An instant-read thermometer inserted into the center of the chop should read 145 degrees F (63 degrees C).\n",
        "picture_link": "bRmnUkQKQY2cSyo9wFN9euVoP0Retha"
    },
    {
        "title": "Bacon and Balsamic Glazed Sugar Snap Peas",
        "ingredients": [
            "1/4 pound bacon, minced ADVERTISEMENT",
            "1 1/2 cups fresh sugar snap peas ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon turbinado sugar, such as Sugar in the Raw ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the minced bacon in a large skillet over medium-high heat until the fat has rendered out and the bacon has begun to crisp, about 5 minutes. Remove with a slotted spoon and set aside, leave the bacon fat in the skillet. Add the sugar snap peas, and toss to coat with the fat. Cook and stir until just cooked through, about 5 minutes. Pour in the balsamic vinegar, sugar, and cooked bacon. Continue cooking until the balsamic has reduced, and the sugar has dissolved, about 2 minutes. Season to taste with salt and pepper and serve immediately.\n",
        "picture_link": "Ivv9ZN1UCpKjnkoAlCaSd0ZpGx8Bg9q"
    },
    {
        "title": "Polish Noodles (Cottage Cheese and Noodles)",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1 (16 ounce) package egg noodles ADVERTISEMENT",
            "1 (16 ounce) package cottage cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat. Cook and stir onion in melted butter until softened, 7 to 10 minutes.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain and return to the pot.\nStir butter and onion mixture, cottage cheese, sour cream, sea salt, and black pepper into the noodles. Place the pot over medium heat; cook and stir until heated through and warm, 5 to 8 minutes.\n",
        "picture_link": "7FFOexGgVnY/w5kzj/j83cjjnQ25qma"
    },
    {
        "title": "Gluten-Free Fudge Brownies",
        "ingredients": [
            "2/3 cup gluten-free baking mix (such as Bob's Red Mill All Purpose GF Baking Flour®) ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3/4 cup margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C), and grease an 8x8 inch square baking dish.\nStir together the gluten-free baking mix, cornstarch, white sugar, brown sugar, cocoa powder, and baking soda in a bowl, sifting with a fork to remove lumps. Pour in the eggs and melted margarine, and mix with a large spoon or electric mixer on low until the mixture forms a smooth batter, 3 to 5 minutes. Scrape the batter into the prepared baking dish.\nPlace a sheet of aluminum foil on the oven rack to prevent spills as the brownies rise, then fall during baking. Bake until a toothpick inserted in the center of the brownies comes out clean, 40 to 45 minutes.\n",
        "picture_link": "lB4jFCdTy8ZcVzpPY/PSoQ9f4ZFFdeu"
    },
    {
        "title": "Scottish Bubbles and Squeak Patties",
        "ingredients": [
            "1 pound potatoes, peeled and cut into chunks ADVERTISEMENT",
            "2 cups shredded cabbage ADVERTISEMENT",
            "1 carrot, grated ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a saucepan and fill with enough water to cover. Bring to a boil, then simmer over medium heat until tender enough to pierce with a fork, about 10 minutes. Drain and mash potatoes, then set aside.\nMeanwhile, combine the cabbage and carrot in another saucepan and add just enough water to barely cover the bottom of the pan. Cook over medium heat until tender, about 5 minutes. Drain off liquid and stir into the mashed potatoes along with the onion, mustard and Cheddar cheese. Season with salt and pepper.\nShape the mixture into 4 patties. Heat a greased grill pan over medium-high heat. Place the patties on the pan and grill until heated through and golden brown, about 5 minutes on each side. Serve right away.\n",
        "picture_link": "c5Tj13JI4WYrlnyRi3UvRgmRpFsPyKO"
    },
    {
        "title": "Cheezy Potatoes",
        "ingredients": [
            "1 pound frozen Southern-style hash brown potatoes ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of potato soup ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (16 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup crushed potato chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large baking dish, mix together potatoes, soup and sour cream. Mix in cheese and butter. Salt and pepper to taste, if desired. Top the mixture with potato chips.\nBake 60 minutes in the preheated oven, or until the mixture is bubbly and lightly brown.\nRemove from oven and let stand 15 minutes before serving.\n",
        "picture_link": "aZ9fXAQWmmE/000lRkEnAu2BYXpm8nW"
    },
    {
        "title": "Chocolate Chess Pie I",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2/3 cup evaporated milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend together butter or margarine, eggs, cocoa, sugar, milk, and vanilla with a hand mixer until smooth. Pour filling into unbaked pie shell.\nBake at 375 degrees F (190 degrees C) for 45 minutes, or until set. Let cool before slicing.\n",
        "picture_link": "BwcWoAJRHLTsn/iB3FXKsLHhEuAWwi."
    },
    {
        "title": "Ultimate Gulf Coast Gumbo",
        "ingredients": [
            "4 pounds medium shrimp - peeled and deveined ADVERTISEMENT",
            "1/2 cup corn oil ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 (3 pound) whole chicken ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "5 stalks celery, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "5 large tomatoes, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 tablespoons Old Bay Seasoning TM ADVERTISEMENT",
            "1 tablespoon ground cayenne pepper ADVERTISEMENT",
            "3 (6 ounce) cans crab meat, drained ADVERTISEMENT",
            "1 pound andouille sausage, diced ADVERTISEMENT",
            "2 tablespoons file powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel and devein the shrimp. Refrigerate shrimp meat. Place the shrimp heads and shells in a large pot, and cover with 2 quarts of water. Cover, and simmer over medium low heat until liquid is reduced by half. Strain out the shrimp heads and shells.\nSelect a large stock pot capable of holding all the ingredients. Add oil to the pot, and heat over medium high heat. Using a long handled spoon, stir in flour; cook and stir for several minutes until dark brown. At that point, the flour suddenly puffs and absorbs the oil. Slowly stir in chicken broth and an equal amount of water. Place chicken in the pot. Add onions, celery, bell pepper, tomatoes, garlic, bay leaves, red pepper flakes, Old Bay seasoning, and salt. Boil for about 1 1/2 hours, or until chicken meat is no longer pink and the juices run clear.\nRemove chicken from the pot, and set aside until cool enough to handle. Remove bones, and chop the chicken into about one inch pieces.\nAdd chicken meat, shrimp broth, crab meat, sausage, and shrimp to . Add the file powder, and stir from the bottom of the pot. When the gumbo comes to a boil, remove from heat. Continue to stir from the bottom for 1 minute. Serve.\n",
        "picture_link": "sXaywapOzJmP215xZh5qNmAw.Uc8FV2"
    },
    {
        "title": "Macaroni Salad I",
        "ingredients": [
            "2 cups macaroni ADVERTISEMENT",
            "2 small cucumbers, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 3/4 cups creamy salad dressing, e.g. Miracle Whip ™ ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook macaroni pasta in a large pot with boiling salted water until al dente. Rinse with cool water and drain.\nIn a large bowl add the chopped cucumber, tomatoes, green bell pepper, and onion.\nBlend the milk and creamy salad dressing together in a small bowl until smooth and to your liking of thickness.\nAdd cooled pasta and salad dressing mixture to large bowl of chopped vegetables. Add salt and pepper to taste.\nRefrigerate until chilled. Serve.\n",
        "picture_link": "d1UT0COt8dgPoOsmiRjUvDXuGFkrrzW"
    },
    {
        "title": "Pumpkin Ravioli",
        "ingredients": [
            "1 cup ricotta cheese ADVERTISEMENT",
            "1/2 cup pumpkin puree ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the cheese, pumpkin, 1/2 teaspoon salt, and the nutmeg. Set filling aside.\nMix the flour, and 1/2 teaspoon salt in a large bowl; make a well in the center of the flour. Beat the tomato paste, oil, and eggs until well blended, and pour into the well in the flour. Stir with a fork, gradually bring the flour mixture to the center of the bow until the dough makes a ball. If the dough is too dry, mix in up to 2 tablespoons water.\nKnead lightly on a floured cloth-covered surface, adding flour if dough is sticky, until smooth and elastic, about 5 minutes. Cover, and let rest for another 5 minutes. Divide the dough into 4 equal parts. Roll the dough, one part at a time, into a rectangle about 12 x 10 inches. Keep the rest of the dough covered while working.\nDrop 2 level teaspoons filling onto half of the rectangle, about 1 1/2 inches apart in 2 rows of 4 mounds each. Moisten the edges of the dough, and the dough between the rows of pumpkin mixture with water. Fold the other half of the dough up over the pumpkin mixture, pressing the dough down around the pumpkin. Cut between the rows of filling to make ravioli; press the edges together with a fork, or cut with a pastry wheel. Seal edges well. Repeat with the remaining dough and pumpkin filling. Place ravioli on towel. Let stand, turning once, until dry, about 30 minutes.\nCook ravioli in 4 quarts of boiling salted water until tender; drain carefully.\n",
        "picture_link": "1AKsduFucSydTOSJYKp/Sa9YAM.aH6a"
    },
    {
        "title": "Harvest Pumpkin Soup",
        "ingredients": [
            "2 small sugar pumpkin ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground sage ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "4 tablespoons sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Cut pumpkins in half and scoop out seeds. Spray a cookie sheet with non-stick cooking spray. Place pumpkins, flesh side down on the cookie sheet and roast until soft to the touch, about 45 minutes. Remove pumpkins from oven and let cool. Once pumpkins are cool scrape flesh from skins into a food processor. Discard skins.\nAdd chicken stock to the pumpkin and puree. Pour soup into a large saucepan and bring to a simmer over medium heat. Stir in cream, nutmeg, sage and salt. Mix well and remove from heat. Serve garnished with a dollop of sour cream\n",
        "picture_link": "PIyxPIPKfcbQiqih/New.8PszYdSV0u"
    },
    {
        "title": "Green Risotto with Fava Beans",
        "ingredients": [
            "1/2 pound fresh, unshelled fava beans ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "3 tablespoons butter, divided ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 cup Arborio rice ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1/4 cup grated Reggiano Parmesan cheese ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Meanwhile, shell the favas and discard the pods. Boil the favas for 4 minutes, strain and then immediately plunge into ice water. Let cool for 2 minutes then pierce the favas and squeeze them out of their skins. Separate 3/4 of the favas and puree in a food processor.\nIn a separate large saucepan bring the broth to a simmer, and keep it hot. Meanwhile, in another large saucepan over medium heat, melt 1.5 tablespoons of the butter and add the onions. Reduce the heat to low and cook for about 5 minutes; do not brown the onions. Add the rice and cook, while stirring, for 2 minutes. Add the wine, increase the heat to medium, and stir constantly. When the wine has been absorbed, add a little of the hot stock. Once the stock is absorbed, add a little more; repeat this process, stirring constantly, until the rice is cooked through.\nTo the cooked rice add the pureed favas, the remaining 1.5 tablespoons of butter, the rest of the favas and the cheese. Cook over medium heat, stirring, until the butter and cheese melt and the puree is incorporated evenly. Season with salt.\n",
        "picture_link": "GKB8pEg5.nojqw43q.MeaKCKYX/ICyC"
    },
    {
        "title": "Wonderful Fried Fish Tacos",
        "ingredients": [
            "1 cup dark beer ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 pounds cod fillets, cubed ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "20 (6 inch) corn tortillas ADVERTISEMENT",
            "5 cups shredded cabbage ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup salsa ADVERTISEMENT",
            "1 lime, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow bowl, whisk together beer, flour, and salt.\nRinse fish, and pat dry. Cut into 10 equal pieces.\nIn a large saucepan, heat 1 inch oil to 360 degrees F (168 degrees C). Using a fork, coat fish pieces in batter. Slide coated fish into hot oil in batches; adjust heat to maintain oil temperature. Fry until golden, about 2 minutes. Lift out with a slotted spoon, and drain briefly on paper towels; keep warm. Repeat to fry remaining fish.\nStack 2 tortillas. Place a piece of fish and 1/2 cup cabbage in the center of the tortillas. Garnish with mayonnaise, lime wedges and salsa\n",
        "picture_link": "OO3541d4DmBXAwz0f3bCAGrYMh1fNGi"
    },
    {
        "title": "Simple Stir Fry",
        "ingredients": [
            "1 pound skinless, boneless chicken breast halves, cut into bite size pieces ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "seasoning salt to taste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter/margarine in a medium skillet over low heat. Add chicken, onion and green bell pepper and saute all over low heat for 4 to 6 minutes, stirring occasionally and turning chicken pieces. Season with paprika, garlic salt and seasoned salt to taste.\nCover skillet and let cook until chicken is done and juices run clear, about 15 minutes. When chicken is cooked through add soup and water and let simmer, stirring. When liquid has reached the consistency of a sauce, the dish is done.\n",
        "picture_link": "PvE5CjvZtGyLPAz6GXD6tGgqvQGgvLS"
    },
    {
        "title": "Asparagus and Tomato Salad with Yogurt-Cheese Dressing",
        "ingredients": [
            "1 (10 ounce) package frozen cut asparagus, thawed ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "3 tablespoons nonfat plain yogurt ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "10 leaves lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thaw frozen asparagus and drain well. In a medium bowl, combine the asparagus, tomatoes, onions and set aside.\nIn a small bowl, whisk together the yogurt, cheese and mustard. Add to the vegetable mixture and toss until well coated. To serve, line salad plates with romaine lettuce leaves and spoon salad on top.\n",
        "picture_link": "6Zxw/FOcpuyRWnq.cYhWu4kGCeloH6W"
    },
    {
        "title": "Chicken Seashell Salad",
        "ingredients": [
            "1 1/2 cups seashell pasta ADVERTISEMENT",
            "1/4 cup cashews ADVERTISEMENT",
            "3 boneless, chicken breast halves - cooked, skinned ADVERTISEMENT",
            "3 ounces pineapple tidbits, juice reserved ADVERTISEMENT",
            "2 small Gravenstein apples, peeled, cored and diced ADVERTISEMENT",
            "3/4 cup chopped celery ADVERTISEMENT",
            "1 (3 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook macaroni in a large pan of boiling water until al dente. Drain, and rinse. Set aside.\nPlace nuts in a dry skillet. Toast over medium heat, turning frequently, until nuts are fragrant and lightly browned.\nIn a large bowl, combine pasta, chicken, pineapple, apples, celery, mandarin oranges, and toasted nuts.\nIn a small bowl, mix together mayonnaise, reserved pineapple juice, and almond flavoring. Stir into pasta mixture, and mix well. Chill.\n",
        "picture_link": "uO/tsu2xLFClmX7w3ZTGKfPNfZcy/U6"
    },
    {
        "title": "Carrot Muffins",
        "ingredients": [
            "2 cups whole wheat flour ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "2 cups finely grated carrots ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix wheat and white flours, baking powder, and salt in a large bowl. Blend in brown sugar, cinnamon, allspice, and grated carrots.\nIn a mixing bowl beat eggs. Blend in milk, molasses and butter. Combine this mixture with the flour mixture. Stir until all dry ingredients are moist.\nSpoon mixture into oiled muffin tins adding nuts and raisins if you would like. Bake for 25 to 30 minutes.\n",
        "picture_link": "uZalha9h6kucQU.WgE4LEf.CMgtLFDe"
    },
    {
        "title": "Buttermilk Cornbread Muffins",
        "ingredients": [
            "1 cup cornmeal ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3/4 cup lowfat buttermilk ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, combine the cornmeal, flour, baking powder, and soda. Combine eggs, buttermilk, honey, and oil; add slowly to the dry ingredients. Mix until blended. Pour into non-stick muffin cups, making them about two-thirds full.\nBake until golden, about 20 to 25 minutes. Remove the muffins from the pan and cool completely.\n",
        "picture_link": "lLuJOydl0PjKPXP/plR8xP1S0r3d0eW"
    },
    {
        "title": "Hot Water Pie Crust I",
        "ingredients": [
            "3/4 cup shortening ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon milk ADVERTISEMENT",
            "1/4 cup boiling water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine shortening, salt, milk and boiling water. Whip with fork until smooth and creamy.\nAdd 2 cups flour and stir with round-the-bowl strokes until all flour is incorporated.\nMakes crust for one double crust pie.\n",
        "picture_link": "EkF9jrTnGJq8L/AJRFjq7B7XfunZWlG"
    },
    {
        "title": "Concord Grape Pie I",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "5 cups Concord grapes ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3/4 teaspoon lemon juice ADVERTISEMENT",
            "1 1/2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place a sheet pan on the lower oven rack.\nWash and stem grapes; squeeze grapes out of their skins. Save the skins and set aside. Place grape pulp in a large saucepan; mash a few at the bottom to release their juice. Cook over medium-low heat until grapes come to a full boil. Remove pulp from heat, and press through a food mill to remove seeds. Combine pulp and skins in a large bowl. Stir in lemon juice.\nIn a separate bowl, mix sugar, flour, and salt. Stir into grape mixture. Pour filling into pastry crust, and dot with butter. Cover with second pastry shell. Flute edges, and cut little slits in the top crust for steam to escape.\nIn preheated oven on sheet pan for 45 to 50 minutes, or until crust is brown and juice begins to bubble through slits in top crust. Allow to cool before serving.\n",
        "picture_link": "/EQcJCvU20uGmA9dsOnJzLUwQaCPnNq"
    },
    {
        "title": "Lemon Icebox Pie I",
        "ingredients": [
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "5 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat broiler to 500 degrees F (260 degrees C).\nIn a medium mixing bowl beat together condensed milk, egg yolks, and lemon juice. Pour mixture into graham cracker crust.\nIn a separate glass or metal mixing bowl, beat egg whites with sugar until stiff peaks form. Spread evenly on top of lemon filling.\nBrown in preheated broiler just until meringue is set and golden. Keep pie refrigerated.\n",
        "picture_link": "jsEcY.9.dw35mge/x5AMkTYFddy/asq"
    },
    {
        "title": "Bourbon Balls II",
        "ingredients": [
            "1 cup vanilla wafer crumbs ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup bourbon ADVERTISEMENT",
            "1 1/2 teaspoons light corn syrup ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine wafer crumbs, finely chopped pecans, 1 cup confectioners' sugar and cocoa.\nBlend the bourbon and the corn syrup together. Add the crumb mixture and mix well. Shape into 1 inch balls and roll in confectioners' sugar. Refrigerate.\n",
        "picture_link": "5UY/9uj54Y8gdJY64D1gTDMu9Sadi5C"
    },
    {
        "title": "Light Zucchini Casserole",
        "ingredients": [
            "1 pound zucchini, shredded ADVERTISEMENT",
            "1 small onion, grated ADVERTISEMENT",
            "1/3 cup buttermilk ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup biscuit baking mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch pie pan.\nIn a medium bowl combine zucchini, onion, buttermilk, oil, cheese and biscuit mix. Mix well and pour into prepared pie pan.\nBake in preheated oven for 1 hour, or until lightly browned.\n",
        "picture_link": "ENuKy9nQe46B50QSrB5Q/3hSpuSH.HO"
    },
    {
        "title": "Tzatziki II",
        "ingredients": [
            "1 cucumber ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon chopped fresh mint leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel the cucumber and cut in half lengthwise. Remove seeds using a spoon then grate the cucumber into a small bowl. Stir in the yogurt, garlic, salt and chopped mint. Chill for at least 30 minutes before serving to develop the flavor.\n",
        "picture_link": "yU1iXEUACMeW7rrwG0MyMv3l70azuAO"
    },
    {
        "title": "Pearl Baked Cream Onions",
        "ingredients": [
            "4 cups pearl onions ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "2 1/2 cups crushed buttery round crackers ADVERTISEMENT",
            "1 1/3 cups heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace onions in a 2 quart casserole dish and season with salt and pepper. Pour melted butter over onions and sprinkle crushed crackers on top. Pour cream over crackers.\nBake in preheated oven for 50 minutes.\n",
        "picture_link": "72czH72DKl076W6kKY5PIH8BFgX2wdC"
    },
    {
        "title": "Upside-Down Coffee Cake",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 cups light brown sugar ADVERTISEMENT",
            "3 cups fresh peaches, pitted and sliced ADVERTISEMENT",
            "2/3 cup margarine ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "3 1/3 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Use a deep sided 10 inch pan, or wrap the outside of a 10 inch springform pan with aluminum foil to prevent leaking. Sift together the flour, baking powder, salt and cinnamon. Set aside.\nIn a saucepan over medium heat, combine brown sugar and 1/2 cup butter. Bring to a boil, then pour into bottom of springform pan. Sprinkle with sliced peaches.\nIn a large bowl, cream together 2/3 cup margarine and the white sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the milk. Pour batter over caramel and fruit in pan.\nBake in the preheated oven for 90 minutes, or until a toothpick inserted into the center of the cake comes out clean. Cool in pan for 10 minutes, then invert onto serving platter and carefully remove pan. Be extremely careful of hot caramel and fruit juices! Serve warm.\n",
        "picture_link": "qUUVm7pznZ3MZ/sOIoFaHb9n4UbC7RK"
    },
    {
        "title": "Grandma's Meat Sauce",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound sweet Italian sausage, sliced ADVERTISEMENT",
            "1 pound round steak, cubed ADVERTISEMENT",
            "1 pound veal, cubed ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "2 (28 ounce) cans whole peeled tomatoes, crushed ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat, and cook the sausage, round steak, and veal 10 minutes, until evenly browned. Remove meat from skillet and drain, reserving about 1 tablespoon drippings.\nStir the garlic into the skillet with the reserved meat drippings, and cook about 3 minutes over medium heat. Place the crushed tomatoes into the skillet. Season with Italian seasoning, bay leaf, garlic powder, oregano, pepper, and parsley. Cook 15 minutes.\nMix the tomato sauce into the skillet, and continue cooking 15 minutes.\nReturn the meat to the skillet. Reduce heat to low, and simmer 2 hours, stirring occasionally.\n",
        "picture_link": "uz/Z02cO8F3QdaMmrpRnWyj8WAX5pk6"
    },
    {
        "title": "Crab Fried Rice",
        "ingredients": [
            "2/3 cup uncooked long grain white rice ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 medium onions, cut into wedges ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/2 tablespoon white sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 pound cooked crabmeat ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1 tablespoon chopped cilantro ADVERTISEMENT",
            "1/2 cucumber, sliced ADVERTISEMENT",
            "1 lime, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the rice and water in a saucepan, and bring to a boil. Reduce heat, cover, and simmer for 20 minutes.\nHeat the oil in a wok over medium heat. Cook and stir the onions and garlic in the hot oil until tender. Mix in the rice, sugar, and salt, and cook 5 minutes, until well blended. Stir in the egg until the rice is coated. Increase heat to high, and mix in the crabmeat, green onions, and cilantro. Continue cooking 2 to 5 minutes, until the crab is heated through. Garnish with the cucumber and lime slices to serve.\n",
        "picture_link": "8JF209tGZXUAFP4tRx46l1u.NJmo5xi"
    },
    {
        "title": "Chateaubriand",
        "ingredients": [
            "2 (8 ounce) fillets beef tenderloin filet, 1 1/2 inch thick ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub the beef with the vegetable oil and season with freshly ground black pepper. Let the beef rest at room temperature for 1 hour.\nHeat a large, heavy skillet over medium-high heat. Quickly sear the meat about 5 seconds on each side, then remove from skillet. Melt and brown the butter in the skillet. Return the meat to the skillet, and fry 4 to 5 minutes on each side. The outside of the meat should be browned and crisp. Remove from the skillet and let stand for about 5 minutes for the juices to settle.\n",
        "picture_link": "SiB15DqhbINKij40xvW6rHeoXPUa6Jq"
    },
    {
        "title": "Sharon's Awesome Chicago Chili",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "4 (14.5 ounce) cans kidney beans ADVERTISEMENT",
            "4 (15 ounce) cans diced tomatoes ADVERTISEMENT",
            "1 (12 fluid ounce) bottle beer ADVERTISEMENT",
            "1 (12 ounce) bottle tomato-based chili sauce ADVERTISEMENT",
            "1 large white onion, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons chili seasoning ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon oregano ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1 teaspoon hot sauce ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ground beef in a large pot and cook over medium heat until evenly brown. Drain off the excess fat.\nMix in the kidney beans, diced tomatoes, beer, chili sauce, onion, garlic, chili seasoning, black pepper, garlic powder, onion, cayenne pepper, oregano, sugar, hot sauce, and Worcestershire sauce. Bring to a boil. Reduce heat to low, and simmer for about 4 hours, stirring occasionally.\n",
        "picture_link": "BmMzeHWDyvb8VlesFzDI0te.0tQQHYa"
    },
    {
        "title": "Chocolate Mug Milkshake",
        "ingredients": [
            "4 cups chocolate ice cream ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine ice cream, milk, brown sugar, white sugar and cinnamon. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "3g/SQnZEAgvxuJYuLwqalq.B3.eXxlq"
    },
    {
        "title": "Slow Cooker Moose Roast",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 pounds moose roast ADVERTISEMENT",
            "2 cups apple juice ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat. Brown the roast on all sides in the hot oil. Remove, and transfer to a slow cooker.\nSprinkle onion soup mix over the roast, then pour in the apple juice. Cover and cook on MEDIUM for 6 to 8 hours, or until meat is very tender. Check occasionally to make sure there is sufficient liquid, and add more juice if necessary. Serve roast with juices, or thicken them for a tasty gravy.\n",
        "picture_link": "LOfZUOioV.YlKYkynO0/wcpLEQedQyy"
    },
    {
        "title": "Asian Asparagus Salad with Pecans",
        "ingredients": [
            "2 pounds fresh asparagus, trimmed ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 teaspoons sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 tablespoon chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a medium saucepan of water to a boil, and cook the asparagus until tender but crisp. Drain, and briefly immerse in cold water.\nIn a large, resealable plastic bag, mix the rice vinegar, soy sauce, vegetable oil, sugar, salt, and pepper. Seal the asparagus in the bag. Marinate 24 hours in the refrigerator. Sprinkle the marinated asparagus with pecans and green onion to serve.\n",
        "picture_link": "PbdOxmOJxPqRwI2JnbqpP0M30IzENo2"
    },
    {
        "title": "Three Sisters Soup",
        "ingredients": [
            "2 cups canned white or yellow hominy, drained ADVERTISEMENT",
            "2 cups fresh green beans, trimmed and snapped ADVERTISEMENT",
            "2 cups peeled and cubed butternut squash ADVERTISEMENT",
            "1 1/2 cups diced peeled potatoes ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1 1/2 tablespoons chicken bouillon granules ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the hominy, green beans, squash, and potatoes into a pot, and pour in water and chicken bouillon. Bring to a boil, then reduce heat to low, and simmer until vegetables are soft, about 10 minutes. Blend flour into the butter, then stir into the soup. Increase heat to medium, and cook for 5 more minutes, or until soup thickens. Season with pepper, and serve.\n",
        "picture_link": "fIGk.7Fz035sSrsidmB44JvUELi8aJi"
    },
    {
        "title": "Puerto Rican Steamed Rice",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups uncooked calrose rice, rinsed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring vegetable oil, water, and salt to a boil in a saucepan over high heat. Add rice, and cook until the water has just about cooked out; stir. Reduce heat to medium-low. Cover, and cook for 20 to 25 minutes. Stir again, and serve. Rice may be a little sticky and may stick to bottom of pot.\n",
        "picture_link": "THs.D/Z.zsSRIFDfEPoZ8UpdM1AtL7u"
    },
    {
        "title": "Eggplant and Mushrooms with Wild Rice",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "1 large eggplant, peeled and cubed ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "8 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup half-and-half or light cream ADVERTISEMENT",
            "1 cup cooked wild rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter and 1 tablespoon of olive oil in a large skillet. Add the eggplant, and fry until tender, about 5 minutes. Remove eggplant from the skillet, and keep warm.\nAdd the remaining 2 tablespoons of olive oil to the skillet, and fry the onion and mushrooms until tender, about 5 minutes. Return the eggplant to the pan, and season with garlic, salt, pepper, and Italian seasoning. Cook and stir for one minute to blend the flavors.\nStir in the chicken broth, and simmer for about 5 minutes, until most of the liquid is reduced or absorbed. Stir in cream of mushroom soup, half-and-half cream, and cooked wild rice. Simmer over low heat for 15 minutes, stirring occasionally. Taste and adjust seasoning with salt and pepper if desired.\n",
        "picture_link": "Yi8jRRia.SxR9cqHp1RvdJGup/Oqw.K"
    },
    {
        "title": "Grandma's Raspberry Bars",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup raspberry jam ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nIn a medium bowl combine butter, white sugar, brown sugar, flour, baking powder and salt; mix well. Spread 2/3 of mixture into prepared pan.\nSpread jam over mixture.\nCombine remaining mixture with oats and walnuts; sprinkle over jam layer.\nBake in preheated oven for 30 minutes.\n",
        "picture_link": "d.nDsefle.TYvXHUvvdaEfR3ISs/Ix6"
    },
    {
        "title": "Greek Bifteki",
        "ingredients": [
            "1 1/3 pounds ground beef ADVERTISEMENT",
            "1 tablespoon plain yogurt ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 ounces feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for indirect heat.\nIn a large bowl, mix together ground beef, yogurt, thyme, and salt and pepper. Form meat into 8 patties, about 2 to 3 inches in diameter.\nCut the cheese into 4 slices. Place one cheese slice between two patties, and seal the edges. Repeat with remaining beef patties and cheese slices. Set bifteki aside.\nBrush grate with oil, and arrange bifteki on hot grate. Cover, and cook for 15 to 20 minutes, or until meat is cooked through and cheese is melted.\n",
        "picture_link": "hA4ZploDqLCg5m8VxbxsNIoTsix7zrq"
    },
    {
        "title": "Wild Rice Salad",
        "ingredients": [
            "1 (6 ounce) package wild rice ADVERTISEMENT",
            "3/4 cup light mayonnaise ADVERTISEMENT",
            "1 teaspoon white vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups cooked, cubed turkey meat ADVERTISEMENT",
            "1/4 cup diced green onion ADVERTISEMENT",
            "1 cup seedless red grapes ADVERTISEMENT",
            "6 ounces blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook rice according to package directions. Remove from heat and set aside to cool.\nIn a medium bowl, whisk together the mayonnaise, vinegar, sugar, salt and pepper. Stir in rice, turkey, onion and grapes until evenly coated with dressing. Cover and refrigerate for 1 to 2 hours.\nBefore serving, sprinkle slivered almonds over the top of the salad.\n",
        "picture_link": "29LiA2vriZzr9pPIv4xkeiR0phvATdy"
    },
    {
        "title": "Huckleberry Buckle II",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 1/2 cups huckleberries ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C.) Grease the bottom of a 9 inch square pan.\nIn a large bowl, cream 1/4 cup butter and 1/2 cup sugar. In a separate small bowl, combine flour, baking powder and salt. Stir into butter mixture. Stir in milk; mixture will be thick and lumpy. Spread batter into the prepared pan.\nIn a large bowl, combine berries, 3/4 cup sugar and 1/2 cup boiling water. Pour over the batter in the pan. Dot the top with remaining 1 tablespoon of butter.\nBake in the preheated oven for 45 to 50 minutes.\n",
        "picture_link": "u3kHOV6X8psPwKVXM4wFxByDKznOQPW"
    },
    {
        "title": "Grilled Romaine Salad",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "8 Roma (plum) tomatoes, halved lengthwise ADVERTISEMENT",
            "2 shallots, halved lengthwise and peeled ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 3/4 cups olive oil ADVERTISEMENT",
            "4 romaine hearts ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 225 degrees F (110 degrees C). Mix olive oil, white sugar, rosemary, thyme, salt, and pepper in a large resealable plastic bag. Place tomatoes in the bag, seal, and shake to coat. Arrange coated tomato halves cut side up on a baking sheet. Bake tomatoes 2 1/2 hours in the preheated oven. Remove from heat, and let cool.\nIn a blender or food processor, finely chop the shallots. Add vinegar and brown sugar, and process until smooth. Slowly add 1 3/4 cups oil, processing frequently, so as to thicken the mixture.\nPreheat grill for high heat. Brush romaine hearts with 1 tablespoon olive oil, and season with salt and pepper.\nPlace romaine hearts on the preheated grill. Cook 5 to 10 minutes, turning frequently, until slightly charred but not heated all the way through. Serve warm on salad plates surrounded by tomato pieces and drizzled with the shallot dressing.\n",
        "picture_link": "mU3kQNMPgbaBMtXv4hIes9.LG0RI2T."
    },
    {
        "title": "One - Two - Three - Four Cake II",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar, divided ADVERTISEMENT",
            "3 cups cake flour ADVERTISEMENT",
            "4 egg yolks, room temperature ADVERTISEMENT",
            "4 egg whites, room temperature ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 cup milk, room temperature ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch round pans.\nBeat butter and 1 cup of sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color.\nIn a separate bowl, beat egg yolks well, then add to butter mixture.\nSift together flour and baking powder. Add alternately with the milk to the butter-sugar mixture. Beat well. Add vanilla.\nBeat egg whites until stiff but not dry. Add 1 cup sugar to the egg whites. Fold into cake batter.\nDivide evenly into three prepared 9 inch round pans. Bake at 350 degrees F (175 degrees C) for 25 minutes.\n",
        "picture_link": "cLAq2BpkiUCBfmYzMJFjgqNDcFL/lP6"
    },
    {
        "title": "Banana Nut and Ginger Bread",
        "ingredients": [
            "2 cups packed brown sugar ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons vegetable oil (optional) ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 tablespoon ground cardamom ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 cups dark beer ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups dates, pitted and chopped ADVERTISEMENT",
            "2 tablespoons minced fresh ginger root ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9x5 inch loaf pans.\nIn a large bowl cream the brown sugar, banana, eggs, and vanilla. For moister bread, add oil, if desired.\nIn a separate bowl, sift together 3 cups flour, baking soda, salt, cinnamon, all spice, cardamom, and cloves. Alternately blend the flour mixture and beer into the creamed mixture.\nToss the walnuts with the remaining flour. Stir in the dates and ginger to the mixture and blend well. Pour into two greased 9x5 loaf pans.\nBake in a 350 degree F (175 degrees C) oven for 1 hour, or until inserted toothpick emerges dry and clean.\n",
        "picture_link": "vutDknWzlcP/PJ9/r1/I9Ck.9SmyIZy"
    },
    {
        "title": "Cheddar Mushroom Pork Steaks",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (11 ounce) can condensed cheese soup ADVERTISEMENT",
            "2 (10.75 ounce) cans milk ADVERTISEMENT",
            "8 thick cut pork steaks ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large bowl, combine the mushroom soup, Cheddar cheese soup and the milk. Mix until well blended. Season the pork steaks with the oregano, basil and salt and pepper to taste.\nPour about 2 cups of the sauce into a 9x13 inch baking dish and place the pork steaks over the sauce. Top the steaks with the remaining sauce.\nBake, uncovered, at 375 degrees F (190 degrees C) for 1 hour, then turn steaks over, making sure they're always covered with the sauce, and bake for another 30 minutes.\n",
        "picture_link": "aBnibKiguHKvHN0Mt/K8Jg4cTZvXbLq"
    },
    {
        "title": "Dee's Mexican Rice",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground coriander seed ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "3 green onions ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 cup pre-cooked corn kernels ADVERTISEMENT",
            "2 small tomatoes, diced ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "2 cups cooked rice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a wok-style pan with turmeric, garlic powder, cumin, coriander, paprika, chili flakes, and cayenne pepper. Add the green onions and the green peppers; saute 1 to 2 minutes over medium-high heat.\nAdd corn and tomatoes and saute until tomatoes release their juices. Add ketchup and stir until mixed.\nAdd rice and stir until heated thoroughly. Salt to taste.\n",
        "picture_link": "bs0T8eHZ6QCa1Wh2V.beb6F.PcN81Cu"
    },
    {
        "title": "Angel Cake Surprise",
        "ingredients": [
            "1 (10 inch tube pan) angel food cake ADVERTISEMENT",
            "1 (3 ounce) package strawberry flavored Jell-O® ADVERTISEMENT",
            "1 (15 ounce) can sliced peaches ADVERTISEMENT",
            "3 bananas ADVERTISEMENT",
            "1 (5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Break angel food or pound cake into bite size pieces. Put into a 9x13 inch pan (preferably glass).\nDissolve 1 package of flavored gelatin in 1 cup of water and pour over cake pieces, spreading to the edges of pan. Drain the peaches and pour the juice over the gelatin in the pan. Slice bananas on top of gelatin. Arrange peach slices on top of banana slices. If desired, add crushed pineapple.\nPrepare instant pudding according to instructions on box and spread evenly over fruit.\nSpread whipped topping on top of the pudding. Try to keep the layers separate.\nRefrigerate at least 2 hours before serving.\n",
        "picture_link": "R6j9dXBfbvctUE0/tx8URYfkYSwbBXS"
    },
    {
        "title": "Mediterranean Fish Stew",
        "ingredients": [
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 1/2 pounds cod fillets, cubed ADVERTISEMENT",
            "3 ounces dry pasta ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, saute the garlic and onions in the olive oil for 5 minutes, stirring constantly. Add the tomatoes with liquid, water, parsley and cilantro. Bring to a boil, reduce heat to low and simmer for 15 minutes.\nStir in the Worcestershire sauce, cinnamon, paprika and fish. Simmer over medium heat for 10 minutes. Add the pasta and simmer for an additional 8 minutes, or until pasta is tender. Season with salt to taste and ground black pepper.\n",
        "picture_link": "EVXNnyvURk1FVToJx/dwyQiC4xuhA7u"
    },
    {
        "title": "Sugar Cream Pie V",
        "ingredients": [
            "1 prepared 8 inch pastry shell ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "3/4 cup whole milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 cup butter, chilled and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (225 degrees C).\nIn a medium bowl, mix together sugar, flour, and cream. Add milk and vanilla extract, and continue to stir until mixture is smooth. Pour into pastry shell. Sprinkle top with nutmeg and dot evenly with small chunks of butter.\nBake in preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C) and bake an additional 45 minutes.\n",
        "picture_link": "VkhE8qr2OzrqfRebN/tXz32eaWFRh62"
    },
    {
        "title": "Grandma Snyder's Oatmeal Cake",
        "ingredients": [
            "1 cup rolled oats ADVERTISEMENT",
            "1 1/4 cups boiling water ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "6 tablespoons melted butter ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "3/4 cup evaporated milk ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water over oats, let stand.\nCream 1/2 cup butter or margarine and sugars. Add eggs and blend in a large mixing bowl. Sift the flour, baking soda, salt, cinnamon and nutmeg together. Add to sugars and egg mixture. Add vanilla and oats mixture, blend well.\nPour batter into a 9 x 13 inch pan.\nBake in a preheated 350 degrees F (175 degrees C) oven for 30-40 minutes.\nTo Make Icing: Mix together 6 tablespoons melted butter, 1 1/2 cups brown sugar, 3/4 cup evaporated milk, coconuts, nuts, and 1 teaspoon vanilla.\nPour this coconut concoction over the hot cake.\nPut cake under broiler, and watch close so nuts don't burn, about 5-10 minutes. Serve hot or let cool. Enjoy.\n",
        "picture_link": "99EolfXn54r08SzB7Ajbjcnkuy1PcIG"
    },
    {
        "title": "Turtle Bread",
        "ingredients": [
            "1 (.25 ounce) package instant yeast ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F) ADVERTISEMENT",
            "1/2 cup hot milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 tablespoon raisins for decorating ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mixing bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.\nHeat the milk in a small saucepan until it bubbles, then remove from heat. Add the butter and stir until melted; let cool until lukewarm.\nIn a large mixing bowl, combine the yeast mixture with the cooled milk, butter, egg, 2 cups flour and salt; beat well to combine. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes. Cover dough and let rest for 10 minutes.\nDivide dough into seven pieces. One round 2 inches in diameter, five rounds 1 inch in diameter and the remainder in one large round.\nPlace the large round on a lightly greased cookie sheet and flatten slightly. Shape four of the 1 inch rounds into 'feet' and one into a 'tail' for the turtle. Shape the two inch round into a 'head' for the turtle Attach each piece by flattening the end which attaches to the body, wetting it slightly with water and pinching it under the turtle's 'body'. Press raisins into the turtle's head for 'eyes'.\nCover the turtle with as damp cloth and let rise for 20 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\nWith a sharp knife, make crisscross cuts in the turtle's body to make the 'shell'. Finally, use a scissors to make a cut for the turtle's mouth. Bake at 400 degrees F (200 degrees C) for 20 to 25 minutes, or until golden brown.\n",
        "picture_link": "WKt0XeEcR6RXCx2moiHuNa2DmXc0xb."
    },
    {
        "title": "Fabulous Orange Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup orange liqueur ADVERTISEMENT",
            "1 cup white chocolate chips ADVERTISEMENT",
            "1/8 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F(175 degrees C). Grease a 9 inch Bundt pan.\nIn a medium bowl, stir together the cake mix and pudding mix. Add the sour cream, eggs, oil and orange liqueur. Mix until smooth and well blended, then fold in the white chocolate chips. Pour the mixture into the prepared pan.\nBake for 1 hour in the preheated oven, until cake springs back to the touch. Allow cake to cool for 10 minutes in the pan, then turn out onto a wire rack to cool completely. When cake is cool, dust with confectioners' sugar and serve.\n",
        "picture_link": "8VGmSWAmSJLm5mMIRJnbJHDJkAguvQy"
    },
    {
        "title": "Chicken and Rice",
        "ingredients": [
            "2 cups instant rice ADVERTISEMENT",
            "1 (5 ounce) can chicken chunks, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare rice according to package directions.\nWhen rice is ready, add chicken to pot and continue to stir over low heat. Mix in soup, and continue cooking until heated through.\n",
        "picture_link": "tqBQlejGFdsTRJJ5soaep7/OTJ0vtgK"
    },
    {
        "title": "Springfield Style Cashew Chicken II",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "8 cubes chicken bouillon ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "1 1/3 tablespoons oyster sauce ADVERTISEMENT",
            "4 teaspoons soy sauce ADVERTISEMENT",
            "1/2 pound skinless, boneless chicken breast meat - cubed ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup cashew halves ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Sauce: Bring water to a boil in a large saucepan; dissolve bouillon cubes in boiling water. Remove 1 cup of this broth and mix with cornstarch in a small bowl, then return mixture to saucepan and let thicken. Stir in sugar, oyster sauce and soy sauce; cover, remove from heat and set aside.\nTo Make Chicken Nuggets: In a shallow dish or bowl, flour cubed chicken well and let stand in flour for 15 minutes. In a small bowl, beat egg, milk, salt and pepper together. Remove chicken from flour, dip in egg mixture, roll in flour again and deep fry in a large skillet or deep fryer until golden brown.\nPlace prepared chicken nuggets on a platter; heat sauce over low heat to heat through, then pour over chicken. Sprinkle cashew halves and green onion on top and serve.\n",
        "picture_link": "nqWQWOfddzl9aKnihZ6tcpyn3blg95e"
    },
    {
        "title": "Company Chicken Pasta Salad with Grapes",
        "ingredients": [
            "2 cups small seashell pasta ADVERTISEMENT",
            "3 1/2 cups chopped poached chicken breast meat ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "1 cup seedless green grapes, halved ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes or until al dente; drain.\nIn a medium bowl, combine chicken, celery, grapes, cooked pasta, salt, and white pepper; mix well and reserve.\nIn a medium bowl, combine mayonnaise, curry powder, cumin, rice vinegar, and sugar; whisk ingredients together and toss with chicken mixture.\nCover salad with plastic wrap and refrigerate for at least 2 to 4 hours before serving.\n",
        "picture_link": "quRML4NsSplgWWr5THIgHwqQm.GGz0e"
    },
    {
        "title": "Orange Sauce Chicken",
        "ingredients": [
            "12 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 cup sliced almonds (optional) ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 1/4 cups orange juice ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a small bowl beat together eggs and milk. Add 2 cups flour, salt and pepper. Beat all together until smooth. In a shallow dish or plate mix together the breadcrumbs and almonds. Dip chicken in egg batter, then in breadcrumb mixture.\nIn a large skillet melt 1 tablespoon butter/margarine and saute coated chicken in skillet 8 to 10 minutes. Place chicken in a lightly greased 9x13 inch baking dish and bake uncovered in the preheated oven for 20 minutes.\nTo Make Sauce: Meanwhile, in a medium saucepan mix together the sugar, 1/4 teaspoon salt, cornstarch, and 1 tablespoon flour. Then stir in the orange juice, lemon juice, and 1/2 cup water. Mix all together and cook over low heat, stirring constantly, until the mixture boils. Let boil for 3 minutes, then remove from heat.\nAdd 1 tablespoon of butter/margarine, the orange rind and the lemon rind to the orange sauce and stir together. Remove chicken from oven and pour orange sauce over warm chicken or put in a gravy boat for people to pour themselves. Enjoy!\n",
        "picture_link": "jGYZCiA7ag9/uH39ggnBZGWqjbPxHCO"
    },
    {
        "title": "Fruit Pizza with White Chocolate",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons cream of tartar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups vanilla baking chips ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 pint fresh strawberries, sliced ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup pineapple juice ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a cookie sheet.\nFor the crust: Cream together butter, shortening and 1 1/2 cups sugar with electric mixer. Beat in eggs. In a separate bowl, stir together flour, cream of tartar, baking soda and salt. Beat flour mixture into butter mixture to form a stiff dough. Press dough into a rectangle as large as the baking sheet.\nBake for 10 minutes in the preheated oven, or until light brown.\nFor the filling: In medium microwave safe bowl, microwave vanilla chips and cream on high 60 to 90 seconds, or until chips are melted and smooth after stirring. Beat in cream cheese with electric mixer until creamy. Spread on cooled cookie crust.\nFor the topping: Arrange sliced fruit decoratively over filling. In a medium saucepan over medium heat, combine 1/2 cup sugar, cornstarch, pineapple and lemon juices. Stir and cook until sugar dissolves and mixture thickens. Pour over fruit. Refrigerate until serving.\n",
        "picture_link": "Y7NAR/jlMIFY5Ha6Ccn7lTLWRjEfy6W"
    },
    {
        "title": "Zucchini Bread V",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl combine sugar, oil, eggs, and vanilla. Add grated zucchini.\nIn a separate bowl sift together the flour, baking soda, baking powder, salt, ground ginger, and ground cloves.\nBlend dry ingredients into zucchini mixture. Pour into two 8x5 loaf pans coated with cooking spray.\nBake in a 325 degree F (165 degrees C) oven for one hour. Cool for 10 minutes and remove from pans. Cool on a wire rack.\n",
        "picture_link": "Pv16lKUeoBqNDqPuxU.tFWBfWVsW0VS"
    },
    {
        "title": "The Easiest Chocolate Pudding Cake",
        "ingredients": [
            "1 (3.5 ounce) package non-instant chocolate pudding mix ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 (18.25 ounce) package devil's food cake mix ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large saucepan combine the non-instant pudding mix with 2 cups milk. Cook over medium heat, stirring constantly, until the pudding is thickened. Remove from heat. Pour the dry cake mix into the saucepan and mix until smooth. Pour batter into prepared pan and sprinkle with chocolate chips and walnuts.\nBake in the preheated oven for 20 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean.\n",
        "picture_link": "EEkp/USOOpDF3RRaJct6BwB/7jKVH2y"
    },
    {
        "title": "Tossed Romaine and Orange Salad",
        "ingredients": [
            "1/2 cup orange juice ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 large head romaine lettuce - torn, washed and dried ADVERTISEMENT",
            "3 (11 ounce) cans mandarin oranges ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the dressing by whisking together the orange juice, olive oil, vinegar, pepper and salt; set aside.\nIn a large bowl, combine the romaine and oranges. Add enough dressing to coat and toss well. Sprinkle with almonds and serve.\n",
        "picture_link": "FiGY4Nn/TOnbSfxW2PM1zqwLStm1kfC"
    },
    {
        "title": "Whole Wheat Banana Strawberry Loaf",
        "ingredients": [
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "5/8 cup vegetable oil, divided ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 bananas, mashed ADVERTISEMENT",
            "1 cup chopped strawberries ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour loaf pan.\nIn a large bowl combine flour, baking soda and cinnamon. Set aside.\nIn a medium bowl blend together with an electric mixer the oil, sugar, eggs and banana until well combined.\nAdd banana mix to the flour mix. Add the strawberries. Mix with a spoon until combined. Do not overmix.\nPour the mix into the loaf pan and bake at 350 degrees F (175 degrees C) for 1 hour and 15 minutes or until a toothpick inserted in the center comes out clean and the loaf is well browned. Note: Blueberries or chocolate chips are great in place of the strawberries.\n",
        "picture_link": "vVrNmKsN8s/.SI0sbm/lLZxKuT5mVmG"
    },
    {
        "title": "Quick Bread Mix",
        "ingredients": [
            "12 cups all-purpose flour ADVERTISEMENT",
            "6 cups white sugar ADVERTISEMENT",
            "12 teaspoons baking powder ADVERTISEMENT",
            "6 teaspoons baking soda ADVERTISEMENT",
            "6 teaspoons salt ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix thoroughly flour, sugar, baking powder, soda, and salt. (Can be stored on the shelf for months.)\nMix 3 cups baking mix, oil, eggs, and 1 cup vegetables or fruits. Add flavorings, nuts, raisins, dates, etc., if desired. Pour into one 8-1/2x4-1/2 inch or two 7-1/4x3-1/2 inch greased loaf pans.\nBake at 350 degrees F (175 degrees C) for 30 to 45 minutes.\n",
        "picture_link": "bXzj9YIDleeEHk0/0SwHhSghh18tmdm"
    },
    {
        "title": "Green Bean Cheddar Chicken",
        "ingredients": [
            "1/2 pound bacon ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "20 ounces fresh green beans, washed and trimmed ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of Cheddar cheese soup ADVERTISEMENT",
            "1 pinch ground cayenne pepper ADVERTISEMENT",
            "1/2 cup seasoned dry bread crumbs ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside. Melt the butter in a skillet, and saute the chicken breasts 10 to 12 minutes on each side, until the exterior is golden, the meat is no longer pink, and the juices run clear.\nPlace the green beans in a saucepan with enough water to cover. Bring to a boil, and cook 5 minutes, or until tender.\nPreheat the oven broiler. Lightly grease a 9x13 inch baking dish.\nArrange the beans in the bottom of the prepared baking dish. Top with the chicken, and cover evenly with the soup. Sprinkle with bread crumbs and bacon, and top with Cheddar cheese.\nBroil 10 minutes, or until browned and bubbly.\n",
        "picture_link": "Yv8apOudXKOIarZX/z7f1Xajo/l2AUG"
    },
    {
        "title": "Bacon Wrapped Hotdogs",
        "ingredients": [
            "10 hot dogs, cut into thirds ADVERTISEMENT",
            "15 slices bacon, cut in half ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wrap 1/2 slice of bacon around each piece of hot dog. Secure the bacon with a toothpick.\nPlace hot dogs into a slow cooker on low heat. Pour brown sugar over hot dogs, let cook for 5 to 6 hours; until the bacon is cooked.\n",
        "picture_link": "QuggvdVpzG5dItH4EuASkwvIrZZTeN2"
    },
    {
        "title": "Cream Cheese Spritz",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium bowl, cream together shortening, cream cheese, and sugar until light and fluffy. Beat in egg yolk, and lemon extract. Combine flour and salt; gradually mix into the creamed mixture in three additions, mixing well after each. Load dough into a cookie press, and press cookies onto an ungreased cookie sheet.\nBake for 8 to 10 minutes in the preheated oven, or until lightly golden. Let cool on the baking sheet for a few minutes before transferring to wire racks to cool completely.\n",
        "picture_link": "5/Hgg2xviPsUVoMR.SBdIlfjdIf87ge"
    },
    {
        "title": "Deadly Delicious Lasagna",
        "ingredients": [
            "1 (16 ounce) package lasagna noodles ADVERTISEMENT",
            "1 pound pork sausage ADVERTISEMENT",
            "2 pounds ricotta cheese ADVERTISEMENT",
            "3 (26 ounce) jars spaghetti sauce ADVERTISEMENT",
            "1 pound grated Parmesan cheese ADVERTISEMENT",
            "1 pound shredded mozzarella cheese ADVERTISEMENT",
            "1/2 pound spinach, rinsed and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and lay noodles on a paper towel.\nIn a large skillet over medium heat, cook sausage, spicing to taste, until no longer pink, and reserve.\nIn a large bowl, mix the ricotta and 2 jars of spaghetti sauce. In a medium bowl, mix the Parmesan and mozzarella cheeses.\nStir all but one cup of the cheese mixture into the ricotta mixture; stir in the sausage and chopped spinach.\nPreheat oven to 425 degrees F (220 degrees C).\nCoat the bottom of a 9x13 inch baking dish with a thin layer of spaghetti sauce. Lay 3 to 4 noodles lengthwise and side by side; then lay 3 to 4 noodles overlapping and in a staggered pattern on top.\nAdd a generous layer of the sausage/cheese; repeat layers twice, until they have reach 1/2 inch from the top of the baking dish. Layer noodles on top of the lasagna and coat in the last jar of spaghetti sauce. Cover with last cup of cheese mixture and bake in preheated oven for 45 minutes or until golden brown. Slice and serve, and then see a dietician... It's deadly.\n",
        "picture_link": "gxbKCe4dGc8zhyFtN.SlvBngh/ZNnmm"
    },
    {
        "title": "Pignoli Cookies II",
        "ingredients": [
            "1/2 pound almond paste ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/4 cup pine nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Use a pastry chopper (or food processor) to break up the almond paste into a granulated form. Put in mixing bowl and gradually add the sugar.\nIn another small bowl, beat the egg whites until stiff. Fold the egg whites into the sugar/almond paste mixture gently.\nOn a greased and floured cookie sheet, drop a spoonful of the mixture. Press pine nuts into the top of the cookie (you want to cover the top with nuts).\nBake at 325 degrees F (170 degrees C) for 10-12 minutes. Cool on wire rack.\n",
        "picture_link": "1a126WdPFHCxq9rFUwPXY71Xrtc2N3i"
    },
    {
        "title": "Beverly's Get Up & Go Breakfast Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons frozen orange juice concentrate, thawed ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup wheat and barley nugget cereal (e.g. Grape-Nuts™) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn medium bowl, cream together butter and sugar until light and fluffy. Beat in the egg, orange juice concentrate, and orange zest. Combine the flour and baking powder; mix into the fluffy mixture until blended. Stir in cereal. Drop by teaspoonfuls 2 inches apart on ungreased cookie sheet.\nBake 10 to 12 minutes or until edges are golden. Remove from cookie sheet for cooling.\n",
        "picture_link": "t4cpRAXEfRyE6d7lFxHP5Ypizecv5Du"
    },
    {
        "title": "Salad Dressing Cupcakes",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "3/4 cup creamy salad dressing ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or use paper liners. Sift all-purpose flour, baking soda and cocoa together and set aside.\nWhip salad dressing, white sugar, water, and vanilla together until mixed thoroughly. Add flour mixture slowly and beat at medium speed of an electric mixer for 2 minutes. Divide batter into prepared muffin pans.\nBake in preheated oven for 15 to 25 minutes.\n",
        "picture_link": "KT6crG8jE/oF53CRf8Bekl3LcEnsUAO"
    },
    {
        "title": "Easy Peanut Blossoms",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 cups baking mix ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "24 milk chocolate candy kisses, unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn large bowl, beat condensed milk and peanut butter until smooth. Add baking mix and vanilla; mix well.\nShape into 1 inch balls. Roll in granulated sugar. Place 2 inch apart on ungreased cookie sheet.\nBake 6 to 7 minutes. Place chocolate on cookie and place back in oven for 1 to 1 1/2 minutes.\n",
        "picture_link": "C5ZOn8Td7J6vA2e6IjrxES5pxo7iLp2"
    },
    {
        "title": "Old Fashioned Prune Cake",
        "ingredients": [
            "1 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 1/4 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup prunes, pitted and chopped ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "1 1/2 teaspoons dark corn syrup ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour Bundt or tube pan.\nIn a medium bowl, mix together flour, soda, salt, allspice, cinnamon and nutmeg. Set aside.\nIn a large bowl, combine oil, eggs and 1 1/2 cup sugar. Beat 2 minutes at medium speed.\nAdd flour mixture, alternating with 1 cup buttermilk, starting and ending with dry ingredients. beat well after each addition. Stir in prunes, pecans and 1 1/4 teaspoon vanilla.\nPour into greased and floured bundt or tube pan and bake at 350 degrees F (175 degrees C) for 1 hour or until a toothpick comes out clean when inserted in the center.\nMake large, deep holes in hot cake and pour topping in holes and on top of cake a little at a time, giving it time to soak in.\nFor the topping: In saucepan, over medium heat, cook butter, 3/4 cup buttermilk, corn syrup and 1 1/2 cup sugar until sugar and butter melt. Remove from heat and add 2 teaspoons vanilla and stir.\n",
        "picture_link": "gO6nao8IrEvt6d2ZaLXqLENCcb022Ee"
    },
    {
        "title": "Lite Coconut Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (8 ounce) container fat free sour cream ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "1 1/2 cups lite frozen whipped topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare cake mix according to directions, using a 2 egg carton of egg substitute if desired. Bake in two 9 inch round layers; split layers horizontally when cool to make 4 layers.\nBlend together sugar, sour cream and coconut and chill. Spread all but 1 cup of this mixture between the layers. Blend the remaining cup of mixture with the whipped topping and spread on the top and sides of the cake. Seal cake in airtight container and refrigerate for at least one to three days before serving.\n",
        "picture_link": "VIO/DgHSUpG/u54hChzGzl71cC/mNLm"
    },
    {
        "title": "Banana Rum Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "2/3 cup dark rum ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 tablespoons dark rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch cake pans.\nIn a large bowl, combine cake mix, baking soda, rum, water, eggs, bananas and nuts. Bring together, then beat on medium speed 2 to 4 minutes.\nDivide into prepared pans. Bake at 350 degrees F (175 degrees C) for 25 to 30 minutes, or until toothpick inserted into center of cake comes out clean. Cool completely.\nFor the frosting: Combine 1/3 cup butter or margarine with the confectioners sugar. Blend thoroughly. Stir in vanilla and 2 tablespoons rum. Beat until smooth.\n",
        "picture_link": "wlSVZv7rChImvpiX8DvKsn7Rvm5RlGq"
    },
    {
        "title": "Toasted Party Mix",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "2 teaspoons seasoning salt ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons celery salt ADVERTISEMENT",
            "2 teaspoons garlic salt ADVERTISEMENT",
            "2 cups crispy rice cereal squares ADVERTISEMENT",
            "2 cups crispy corn cereal squares ADVERTISEMENT",
            "2 cups crispy wheat cereal squares ADVERTISEMENT",
            "2 cups toasted oat cereal ADVERTISEMENT",
            "1 cup mini pretzel sticks ADVERTISEMENT",
            "1 cup mixed nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C).\nIn a large roasting pan, melt margarine. Mix in seasoning salt, Worcestershire sauce, celery salt, and garlic salt.\nStir crispy rice, corn, wheat and oat cereals, pretzels and nuts into the butter mixture and coat well.\nBake uncovered in the preheated oven for 45 minutes, stirring occasionally.\n",
        "picture_link": "zl/zgBJI9PrbsQ2v4USQQhn0RRygyoy"
    },
    {
        "title": "Spinach Mushroom and Ricotta Fettuccine",
        "ingredients": [
            "1 (16 ounce) package spinach fettuccine pasta ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "3 cups mushrooms ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large saucepan over medium heat, melt butter. Stir in mushrooms and cook until tender. Stir in spinach and cook until thawed and tender. Remove from heat and stir in ricotta cheese; mix well.\nTo the spinach mixture add the lemon juice; pour over cooked pasta. Mix well and serve.\n",
        "picture_link": "eVojf8qD2meqIndGuiIBCp7LtuJ0e4e"
    },
    {
        "title": "Tortilla Casserole",
        "ingredients": [
            "12 (6 inch) corn tortillas ADVERTISEMENT",
            "2/3 cup chopped green onions ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives, drained ADVERTISEMENT",
            "2 (4 ounce) cans diced green chile peppers, drained ADVERTISEMENT",
            "1 (4 ounce) jar diced pimento peppers, drained ADVERTISEMENT",
            "8 ounces Monterey Jack cheese, shredded ADVERTISEMENT",
            "8 ounces Cheddar cheese, shredded ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 (8 ounce) jar salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease a 9x13 inch baking dish. Line the bottom of the dish with 4 tortillas. Sprinkle with 1/3 each of the green onions, olives, chile peppers, pimento peppers, Monterey Jack cheese, and Cheddar cheese. Repeat twice with the remaining ingredients.\nIn a large bowl, beat together eggs, milk, and salsa. Pour over the layered ingredients. Cover with plastic wrap, and refrigerate overnight.\nRemove the casserole from refrigerator, and remove plastic wrap. Preheat oven to 350 degrees F (175 degrees C).\nBake 45 to 60 minutes in the preheated oven.\n",
        "picture_link": "ehf2NFZgFozpvm5BcUgIPSTw8x4GTcW"
    },
    {
        "title": "Perfectly Moist Irish Wheaten Bread",
        "ingredients": [
            "1 cup bread flour ADVERTISEMENT",
            "2 3/4 cups whole wheat flour ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 1/4 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon buttermilk ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Prepare a shallow baking pan with cooking spray.\nSift together the bread flour, whole wheat flour, salt, baking soda, and 2 teaspoons sugar in a bowl. Cut the margarine into the flour mixture until pieces are nearly indistinguishable. Make a well in the center of the mixture and pour in the oil and buttermilk. Stir with a spatula until dry mixture is completely moistened. Move the dough to a lightly-floured surface. Lightly knead the dough for no more than 1 minute. Place the dough into the prepared pan; pat down and around to form a round loaf. Cut a cross into the top of the loaf with your finger. Brush the top with 1 tablespoon buttermilk; sprinkle 1 teaspoon sugar over the top of the loaf.\nBake in the preheated oven for 30 minutes. Reduce heat to 375 degrees F (190 degrees C); rotate pan and bake another 30 minutes.\nAllow loaf to cool on a wire rack before slicing.\n",
        "picture_link": "44ckiApxfAmhhAjFt777xdOYUllEPeW"
    },
    {
        "title": "Emily's Dressing for Taco Salad",
        "ingredients": [
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup ranch-style salad dressing ADVERTISEMENT",
            "1/2 cup picante sauce, or to taste ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sour cream, ranch dressing, picante sauce, and chili powder in a bowl until thoroughly combined.\n",
        "picture_link": "aa.cGilXBwRV5J0RQ2YVb8fuzmFwZVG"
    },
    {
        "title": "Raisin and Spice Brown Rice",
        "ingredients": [
            "1 cup brown rice ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 teaspoon minced fresh ginger ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/3 cup thinly sliced celery ADVERTISEMENT",
            "1/4 cup seedless raisins ADVERTISEMENT",
            "1 tablespoon low-sodium soy sauce ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring brown rice, chicken broth, butter, and bay leaf to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, 45 to 50 minutes; discard bay leaf.\nMeanwhile, heat the vegetable oil in a skillet over medium-high heat. Stir in onion and ginger; cook and stir until the onion begins to brown on the edges, about 3 minutes. Stir in the cumin and coriander, then stir in the celery and raisins. Reduce heat to medium, and cook until the celery becomes tender, about 5 minutes. Once ready, stir the onion mixture into the cooked rice along with the soy sauce; season to taste with pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Whipped Cream Mousse Frosting",
        "ingredients": [
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the whipping cream, instant pudding mix, milk, and vanilla extract together with an electric hand mixer in a large bowl until soft peaks start to form. Lift your beater or whisk straight up: the mixture will form soft mounds rather than a sharp peak.\nFold the whipped topping into the whipping cream mixture to evenly mix. Refrigerate until ready to use.\n",
        "picture_link": "1H.L/DArB.M9yz7MOihz1RJsF4VG0Nu"
    },
    {
        "title": "Chicken Ranch Enchiladas",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into 1/2 inch cubes ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (4.5 ounce) can chopped green chilies ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "10 (8 inch) flour tortillas ADVERTISEMENT",
            "2 cups shredded Mexican cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nMelt the butter in a large skillet over medium-high heat. Stir in the chicken and cook until no longer pink in the center, about 7 minutes. Whisk together the condensed cream of chicken soup, sour cream, chiles, and ranch dressing in a bowl; spread a thin layer of the mixture into a 9x13 inch baking dish.\nSpoon about 2 tablespoons of sauce into each tortilla; divide the chicken among the tortillas and sprinkle with 3/4 of the cheese. Roll the tortillas into cylinders and place seam-side-down into the baking dish. Pour the remaining sauce over the enchiladas and cover the dish with aluminum foil.\nBake in the preheated oven until hot, about 35 minutes. Remove the foil and sprinkle with the remaining cheese. Return to the oven and cook a few more minutes until the cheese melts.\n",
        "picture_link": "DORDazKFs5RxvdJL9AzSvBCmcUODXOe"
    },
    {
        "title": "Slow Cooker Borscht",
        "ingredients": [
            "1 pound beef stew meat, cut into 1/2 inch pieces ADVERTISEMENT",
            "4 beets, peeled and chopped ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "2 potatoes, peeled and chopped ADVERTISEMENT",
            "1 cup baby carrots, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 cups beef broth, or more ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "6 tablespoons red wine vinegar ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons dried dill weed ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 cups shredded green cabbage ADVERTISEMENT",
            "1 cup sour cream, as garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beef, beets, tomatoes, potatoes, carrots, onion, and garlic in a slow cooker. Whisk together the beef broth, tomato paste, vinegar, brown sugar, dill weed, parsley, bay leaf, salt, and pepper. Pour mixture over the beef and vegetables, adding more broth to cover as needed.\nCover and cook on Low for 8 1/2 hours, or High for 4 hours.\nSet heat to High, then stir in the shredded cabbage. Cover and continue cooking until the cabbage tender, about 30 minutes. Remove bay leaf. Serve in a bowl with a dollop of sour cream.\n",
        "picture_link": ".c4LEVoGvFhmTteyX.hlG3fsFgxfOY."
    },
    {
        "title": "Claudia's Yummy Frosting for Cakes and Cupcakes",
        "ingredients": [
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 tablespoons cake flour ADVERTISEMENT",
            "1/4 cup low-fat milk ADVERTISEMENT",
            "2 drops any color food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the confectioners' sugar, shortening, egg whites, salt, vanilla, flour and milk. Beat with an electric mixer, gradually increasing to high speed, until light, fluffy and smooth, about 5 minutes. Stir in desired amount of food coloring.\n",
        "picture_link": "dtx3VO4vHx2KFQJ/zDQvXPo9bVKJbye"
    },
    {
        "title": "Carrot-Sweet Potato Mash",
        "ingredients": [
            "1 (16 ounce) package baby carrots ADVERTISEMENT",
            "1 sweet potato, peeled and cubed ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup applesauce, or as needed ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place carrots and potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two.\nMeanwhile, melt the butter in a small saucepan over medium heat, then stir in the applesauce and brown sugar until dissolved. When the potatoes are ready, transfer to a serving bowl and mash until smooth. Then fold in the applesauce mixture and raisins.\n",
        "picture_link": "RmxEBy6eomojyoE5.G.76rGmeEDIR7G"
    },
    {
        "title": "Dorm Room Chili Mac",
        "ingredients": [
            "1 (7.25 ounce) package macaroni and cheese mix ADVERTISEMENT",
            "1 (14 ounce) can hot dog chili ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese, or cheese of choice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook macaroni and cheese in a saucepan on the stovetop according to package directions.\nOnce macaroni and cheese is done, stir in chili, and cook over medium heat until hot, about 2 minutes. Sprinkle with shredded cheese to serve.\n",
        "picture_link": "l4V1fb2O3IYaaUiWtrobeNTZxMzLlb6"
    },
    {
        "title": "Swimming Angels",
        "ingredients": [
            "2 cups uncooked sushi (sticky) or medium-grain rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2/3 cup peanut butter ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1 (10 ounce) bag baby spinach leaves ADVERTISEMENT",
            "1 (8 ounce) package baked tofu, cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the rice and 4 cups of water in a saucepan and bring to a boil. Cover and reduce heat to low; simmer until rice is tender and water has been absorbed, about 20 minutes.\nIn a separate saucepan, whisk together the peanut butter, 1 cup hot water, soy sauce, rice vinegar, sugar, garlic, green onions and red pepper flakes. Bring to a simmer over medium heat. Cook, stirring occasionally, and adding more hot water 1/4 cup at a time to maintain a pourable consistency.\nBring about 1 inch of water to a boil in a large pot. Place the spinach and tofu into a steamer basket and set over the boiling water. Cover and steam until spinach has wilted and tofu is heated through, about 7 minutes.\nTo serve, place spinach and tofu over white rice and smother in peanut sauce.\n",
        "picture_link": "gtEmZqCAA4eV5/N4bNm.qiCPTotVpBS"
    },
    {
        "title": "Cheesy Quiche Crust",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "6 tablespoons cold butter, cut into small pieces ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "5 teaspoons cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour in a large bowl. Sprinkle in the chopped butter; rub butter into the flour until it resembles bread crumbs. Stir in the grated cheese. Sprinkle water over the flour mixture, a teaspoon at a time, stirring lightly with a fork. Add just enough water to allow the dough form a ball and cleanly leave the sides of the bowl. Wrap the dough in plastic wrap, and refrigerate for at least 30 minutes.\nPreheat an oven to 375 degrees F (190 degrees C). Roll out dough, and place in a 9 inch pie/quiche pan. Use a fork to prick holes over the bottom of the pastry.\nBake crust in preheated oven for 10 minutes before filling with quiche custard of your choice.\n",
        "picture_link": "mrnjdh2wEJ9VcYH7MYml1lVEuHRQw6i"
    },
    {
        "title": "Guam Fried Rice",
        "ingredients": [
            "1 pound bacon or SPAM™, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "2 carrots, sliced ADVERTISEMENT",
            "1/2 pound snow peas ADVERTISEMENT",
            "4 cups cooked white rice ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon in a skillet over medium-high heat until crisp. Stir in the garlic, green onions, and carrots; cook for 2 minutes. Add snow peas; cook for 2 more minutes.\nStir in the cooked rice, a cup at a time, coating well with the grease. Cook and stir until the rice is hot, then sprinkle with soy sauce.\n",
        "picture_link": "m6afRb2M4myPb6vBhz93dLDQvrWsh.m"
    },
    {
        "title": "Healthier To Die For Blueberry Muffins",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup butter, cubed ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/3 cup applesauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 cups fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease muffin cups or line with muffin liners.\nMix together 1/2 cup sugar, 1/3 cup flour, 1/4 cup butter, cinnamon in a small bowl with a fork until mixture resembles a coarse crumb.\nCombine 1 1/2 cups flour, 3/4 cup sugar, and baking powder in a bowl. Place applesauce into a 1 cup measuring cup; add egg and enough milk to fill cup; mix into flour mixture. Fold in blueberries. Fill muffin cups to the top, and sprinkle with crumb topping mixture.\nBake in the preheated oven until golden and the tops spring back when lightly pressed, 20 to 25 minutes.\n",
        "picture_link": "uC9.uGIk2tdXySxedsXr5uzmQvNOyWS"
    },
    {
        "title": "Healthier Brown Sugar Meatloaf",
        "ingredients": [
            "3 tablespoons packed brown sugar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "3/4 cup low-fat (1%) milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "3/4 cup whole wheat bread crumbs ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan.\nPress brown sugar in the bottom of prepared loaf pan and spread ketchup over sugar.\nMix ground beef, milk, eggs, salt, ground pepper, onion, ginger, bread crumbs, and parsley thoroughly in a mixing bowl. Shape into a loaf and place on top of ketchup.\nBake in preheated oven until no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "LSnm01TF8Ld98OtC7PKW.j903DNCcH."
    },
    {
        "title": "Seafood Bake for Two",
        "ingredients": [
            "2 (4 ounce) halibut fillets ADVERTISEMENT",
            "6 scallops ADVERTISEMENT",
            "6 peeled and deveined jumbo shrimp, tail still attached ADVERTISEMENT",
            "1/3 cup dry white wine ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon seafood seasoning, such as Old Bay™ ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nArrange the halibut, scallops, and shrimp in an oven-safe, glass baking dish. Drizzle with wine, butter, and lemon juice. Sprinkle with the seasoning and garlic. Season to taste with salt and pepper.\nBake in preheated oven until the halibut has turned white, and is flaky, 10 to 12 minutes. Sprinkle with parsley just before serving.\n",
        "picture_link": "grvragLDUJjstdEXamCmL3xtJjZChcC"
    },
    {
        "title": "Nicole's Winter Carrot Zucchini Bread",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 egg whites ADVERTISEMENT",
            "1/2 cup unsweetened applesauce ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "1 cup grated unpeeled zucchini ADVERTISEMENT",
            "1 cup grated carrot ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5 inch loaf pan with non-stick spray. Sift together all-purpose flour, whole wheat flour, baking soda, baking powder, cinnamon, nutmeg, cloves, and salt in a large bowl until well blended.\nBeat egg whites with a mixer until light and frothy. Stir in applesauce, brown sugar, zucchini, carrots, and vanilla until well combined. Mix in the raisins and pecans. Add the flour mixture, stirring just until blended. Pour the batter into the prepared pan.\nBake until a toothpick inserted in the center comes out clean, about 1 hour 20 minutes. Cool bread in pans for 10 minutes, then remove, and cool completely on a wire rack.\n",
        "picture_link": "w1CQ9/pOe9yq93fik6KeI4WQY/clAn2"
    }
]