[
    {
        "title": "Ham and Cheese Dip in a Bread Bowl",
        "ingredients": [
            "1 (16 ounce) loaf round bread ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, room temperature ADVERTISEMENT",
            "1 (8 ounce) package shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups cubed fully cooked ham ADVERTISEMENT",
            "2 tablespoons finely chopped green onion ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1 loaf Italian bread, sliced into bite-size cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut a 1-inch thick slice from the top of round bread loaf; hollow out the loaf to use as a bread bowl. Slice the cut-off top of the loaf into cubes for dipping.\nCombine cream cheese, Cheddar cheese, ham, green onion, and chives in a microwave-safe bowl. Heat in microwave on high power for about 15 seconds to warm ingredients for easier stirring.\nSpoon cheese mixture into prepared bread bowl; place on a baking sheet.\nBake filled bread bowl in the preheated oven, stirring occasionally, until bread bowl is toasted and dip is bubbling, about 30 minutes. Serve with Italian bread cubes for dipping.\n",
        "picture_link": "hcHB/CD4mPS6yrK9mLpZgCRDthB4tMG"
    },
    {
        "title": "Lime-Shrimp Avocado Pasta Salad",
        "ingredients": [
            "2 pounds uncooked shrimp - peeled, deveined, and chopped ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1 (16 ounce) package uncooked cellentani (corkscrew) pasta ADVERTISEMENT",
            "4 avocados - peeled, pitted and diced ADVERTISEMENT",
            "1 pint grape tomatoes, quartered ADVERTISEMENT",
            "1 large red onion, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Marinate shrimp overnight with 1/4 cup lime juice in a large bowl covered with plastic wrap. Drain shrimp.\nHeat shrimp in a microwave-safe bowl until they are bright pink on the outside, about 6 minutes. Allow shrimp to cool.\nBring a large pot of lightly salted water to a boil. Cook cellentani in the boiling water, stirring occasionally until cooked through but firm to the bite, 12 minutes. Drain, then rinse with cold water until cool.\nMix shrimp, pasta, avocados, grape tomatoes, red onion, and cilantro in a bowl.\nWhisk olive oil, 1/4 cup lime juice, garlic, Worcestershire sauce, dry mustard, salt, and black pepper in a bowl until dressing is well mixed.\nPour dressing over shrimp mixture; toss to coat. Chill before serving.\n",
        "picture_link": "HQr.HcSVR.oBucD/9hZZfvH9Q21BA4K"
    },
    {
        "title": "Cheesy Rutabaga Bake",
        "ingredients": [
            "6 cups cubed rutabaga ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup seasoned bread crumbs ADVERTISEMENT",
            "1 pinch paprika for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring rutabaga to a boil into a large pot of salted water over high heat. Reduce heat to medium-low; simmer until tender, 10 to 15 minutes. Drain.\nPreheat oven to 425 degrees F (220 degrees C).\nGrease a 9x13-inch baking dish.\nMelt butter in a saucepan over medium heat. Cook and stir garlic in melted butter until golden, about 5 minutes.\nWhisk flour into garlic mixture until smooth.\nSlowly whisk milk into flour mixture until thickened and creamy, about 5 minutes.\nStir Cheddar cheese into milk sauce until cheese is melted and bubbly, about 3 minutes. Season with cayenne pepper, salt, and black pepper.\nTransfer rutabaga to the prepared baking dish. Pour cheese sauce over rutabaga.\nSprinkle bread crumbs and paprika over rutabaga.\nBake in preheated oven until sauce is thickened and bubbly, 20 to 25 minutes.\n",
        "picture_link": ".g5KA.FHqPmsBtL4nYjirY2Fe3CEeue"
    },
    {
        "title": "Double Tacos",
        "ingredients": [
            "1 1/4 pounds ground beef ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 (1.25 ounce) package dry taco seasoning mix ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 (14 ounce) can refried beans ADVERTISEMENT",
            "4 ounces process cheese food (such as Velveeta®), cut into small cubes ADVERTISEMENT",
            "10 (6 inch) flour tortillas, warmed ADVERTISEMENT",
            "10 crisp taco shells, warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook ground beef and onion in a skillet over medium heat until beef is completely browned, 7 to 10 minutes. Drain excess grease from the skillet.\nWhile beef cooks, stir taco seasoning mix into water in a small saucepan; bring to a boil, reduce heat to low, and simmer for 10 minutes.\nStir taco seasoning mixture into ground beef and onion mixture; simmer on medium-low heat while preparing the remaining ingredients.\nStir refried beans and cubed process cheese food together in a separate small saucepan over medium-low heat; cook and stir until cheese food has melted completely into the beans, about 10 minutes.\nDivide refried bean mixture between flour tortillas; spread into an even layer to cover one side completely.\nWrap tortillas around the crisp taco shells, using bean mixture to stick the tortillas to the shells.\nSpoon seasoned ground beef into the taco shells.\n",
        "picture_link": "Y1aPPIwpzjYPmUgkGLqWj4wBEKHIEv2"
    },
    {
        "title": "Artichoke Bread",
        "ingredients": [
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "1 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1 cup mayonnaise (such as Hellman's®) ADVERTISEMENT",
            "1 clove garlic, finely chopped ADVERTISEMENT",
            "1 loaf French bread, cut lengthwise in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine artichoke hearts, Parmesan cheese, mayonnaise, and garlic together in a bowl.\nSpread artichoke topping evenly over the French bread halves. Place coated bread on a baking sheet.\nBake in preheated oven until topping is hot and bubbling, about 20 minutes.\n",
        "picture_link": "THOgzX86Gi0gNwletfS.E9KKq2A9i3q"
    },
    {
        "title": "Rutabaga Salad",
        "ingredients": [
            "1 rutabaga, peeled and cut into 1/4-inch chunks ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 1/2 cups couscous ADVERTISEMENT",
            "1/2 cup nutritional yeast ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1 1/2 teaspoons honey ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 pinch salt to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer; bring to a boil. Add the rutabaga and steam until just tender, about 10 minutes.\nBring 2 cups water and 1 tablespoon vegetable oil to a boil in a saucepan. Remove from the heat and stir in the couscous. Cover and let stand until the water is absorbed, about 14 minutes; fluff with a fork.\nWhisk nutritional yeast, 1/4 cup vegetable oil, apple cider vinegar, honey, Italian seasoning, oregano, dill, black pepper, and cayenne pepper in a large bowl.\nStir couscous and rutabaga into the nutritional yeast dressing. Season with salt.\n",
        "picture_link": "9tF1KX.NNI8NLe96Zr0MpfWh5bLq1hG"
    },
    {
        "title": "Alane's Hanukkah Brisket",
        "ingredients": [
            "1 (4 pound) beef brisket ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "2 (14.5 ounce) cans beef broth ADVERTISEMENT",
            "2 (15 ounce) cans French onion soup ADVERTISEMENT",
            "2 (12 fluid ounce) cans or bottles beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace a large roasting pan over medium-high heat and sear beef brisket, fat side down at first, until browned on all sides, about 3 minutes per side. Remove brisket and set aside.\nPlace onion slices into the bottom of the roasting pan; pour 1 can beef broth, 1 can French onion soup, and 1 can beer over the onions.\nLay the brisket into the roasting pan; pour remaining cans of beef broth, French onion soup, and beer over the brisket. Cover the roasting pan with a lid.\nBake in the preheated oven for 3 hours. Remove from oven and let stand for 30 minutes.\nRemove cooled brisket from roasting pan and wrap tightly in aluminum foil. Pour pan juices and onion into a food storage container and cover tightly with a lid. Refrigerate beef and pan juices overnight.\nThe next day, preheat oven to 350 degrees F (175 degrees C). Pour pan juices and onion into a 9x13-inch baking dish.\nUnwrap the brisket, cut away any visible fat, and slice thinly across the grain of the meat. Place brisket slices into the pan juices.\nReturn to oven and bake until pan juices are thickened and meat is hot, about 45 more minutes.\n",
        "picture_link": "kQ.n6UqqaprYF1qn31zcED06u2ka.Ta"
    },
    {
        "title": "Incredible Ham Glaze",
        "ingredients": [
            "1 pint Irish stout beer (such as Guinness®) ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk stout beer, brown sugar, and mustard together in a bowl until the brown sugar has dissolved.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Herb and Garlic Dressing",
        "ingredients": [
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon dried parsley ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon celery seed ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk vegetable oil, vinegar, sugar, salt, parsley, garlic, basil, celery seed, marjoram, and black pepper together in a bowl.\n",
        "picture_link": "9a1VHG46PRcia8iz0hRpAjLE8/2sjR2"
    },
    {
        "title": "Veggie Quinoa Burgers",
        "ingredients": [
            "1/2 cup quinoa ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "4 carrots, peeled and minced ADVERTISEMENT",
            "2 stalks celery, minced ADVERTISEMENT",
            "1/2 red bell pepper, minced ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons minced fresh ginger root ADVERTISEMENT",
            "2 cups minced fresh mushrooms ADVERTISEMENT",
            "1 (19 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1/2 bunch fresh dill, chopped ADVERTISEMENT",
            "2 cups chopped fresh spinach ADVERTISEMENT",
            "1 egg (optional) ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "4 slices shredded mozzarella cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat and lightly oil the grate.\nCombine quinoa and water in a saucepan and bring to a boil. Reduce heat to low, place lid on saucepan, and cook until water is completely absorbed, about 15 minutes; Remove from heat and set aside to cool.\nHeat 2 teaspoons olive oil in a skillet over medium-high heat. Cook and stir carrots, celery, red bell pepper, onion, garlic, ginger, and mushrooms in the hot oil until softened, about 10 minutes; set aside to cool.\nMash kidney beans with a fork in a large bowl; add quinoa and the carrot mixture to the means and mix.\nMix dill, spinach, egg, bread crumbs, sesame oil, mozzarella cheese, salt, and pepper into kidney bean mixture; shape into 8 patties.\nBrush the 1 tablespoon olive oil evenly both sides of each patty.\nArrange the patties into a large baking dish.\nGrill on preheated grill until hot in the center, 7 to 8 minutes per side.\n",
        "picture_link": "FDV6OkLMTcWAn7zja1G5zHHLnURxOP6"
    },
    {
        "title": "Cinco De Mayo Salad",
        "ingredients": [
            "2/3 cup chopped fresh cilantro ADVERTISEMENT",
            "1/4 cup plain yogurt ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup chopped shallots ADVERTISEMENT",
            "2 anchovy fillets, chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "3/4 cup olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 (16 ounce) bags mixed salad greens ADVERTISEMENT",
            "1 pint grape tomatoes, halved ADVERTISEMENT",
            "1/2 (15.5 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "2 ears fresh corn, kernels cut from cob ADVERTISEMENT",
            "1/4 cup seasoned croutons ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cilantro, yogurt, red wine vinegar, 1/4 cup Parmesan cheese, shallots, anchovies, jalapeno, and lemon juice in a blender; blend until smooth.\nSlowly drizzle olive oil into the yogurt mixture while blending until oil is emulsified; season with salt and black pepper. Cover and refrigerate 3 hours to overnight.\nToss salad greens, grape tomatoes, black beans, red bell pepper, corn, croutons, and 1 tablespoon Parmesan cheese together in a large bowl.\nPour dressing over salad and toss to coat.\n",
        "picture_link": "UY29.tfVhvXcxywOzkMWjP6sWF9lhOS"
    },
    {
        "title": "Aunt Mary's Delicious Bunny Cake",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 3/4 teaspoons baking powder ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 1/3 cups milk at room temperature ADVERTISEMENT",
            "1 1/2 teaspoons lemon extract ADVERTISEMENT",
            "1 1/4 teaspoons vanilla extract ADVERTISEMENT",
            "3/4 teaspoon orange extract ADVERTISEMENT",
            "1 1/8 cups unsalted butter at room temperature ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs at room temperature ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1/2 cup butter at room temperature ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk at room temperature ADVERTISEMENT",
            "1 teaspoon clear vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a rack into the lower third of oven.\nPreheat oven to 325 degrees F (165 degrees C).\nGrease and flour a cake mold pan (such as a bunny cake or train cake mold) using vegetable shortening.\nSift flour, baking powder, and salt in a bowl.\nMix 1 1/3 cup milk, lemon extract, 1 1/4 teaspoons vanilla extract, and orange extract in a separate bowl.\nBeat unsalted butter in a large mixing bowl with an electric mixer on medium speed until butter is creamy and smooth, 1 to 2 minutes. Beat in white sugar and continue beating until the mixture is light and fluffy, about 5 more minutes. Scrape the sides of the bowl occasionally.\nBeat in eggs, one at a time, beating each egg in thoroughly before adding the next.\nReduce mixer speed to low and beat in flour mixture in several additions, alternating with milk mixture; begin and end with flour mixture. Do not overbeat. Scrape bowl occasionally.\nPour batter evenly into prepared cake pan.\nBake in the preheated oven until lightly browned and a toothpick inserted into the middle of the cake comes out clean, 30 to 45 minutes.\nPlace cake in pan on a wire rack and allow to cool for 15 minutes before inverting pan to remove cake. Allow cake to completely cool on wire rack, 3 to 4 hours.\nBeat vegetable shortening, 1/2 cup butter, confectioners' sugar, 2 tablespoons milk, and 1 teaspoon clear vanilla extract in a bowl until frosting is smooth and creamy.\nPack the frosting into a heavy resealable plastic bag; force the frosting into one corner of the bag. Clip a small corner off the plastic bag, seal the bag, and pipe the frosting onto the cooled cake in desired pattern.\n",
        "picture_link": "fs/SWaZuJRVkXTgMu/wgpbMI71lv7vS"
    },
    {
        "title": "Artichoke and Spinach Stuffed Shells",
        "ingredients": [
            "24 ounces spinach artichoke dip, at room temperature ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 pinch crushed red pepper flakes, or to taste ADVERTISEMENT",
            "salt and freshly ground pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package jumbo pasta shells ADVERTISEMENT",
            "2 cups white sauce (such as bechamel) ADVERTISEMENT",
            "1 cup shredded Gruyere cheese ADVERTISEMENT",
            "1/2 cup grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nCombine spinach artichoke dip and ricotta cheese in a bowl. Stir in egg, lemon juice, red pepper flakes, salt, and pepper; mix until well-combined. Set aside.\nBring white sauce to a simmer over medium-low heat. Stir in grated Gruyere cheese until cheese is melted and incorporated into sauce, 1 to 2 minutes. Set aside.\nFill a large pot with lightly salted water and bring to a boil. Stir in shells and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through, but still firm to the bite, about 11 minutes; drain. Set aside.\nPour half the white sauce mixture into the bottom of a 9x13-inch casserole dish; spread evenly.\nStuff pasta shells with the spinach artichoke mixture and place in casserole dish atop the white sauce, stuffed-side up.\nPour remaining white sauce over the tops of the shells and sprinkle with Parmigiano-Reggiano cheese.\nBake in the preheated oven until golden brown and bubbling, about 25 minutes.\n",
        "picture_link": "3mUZwJ3rNTJP4djd53PIMM8DDLMT1KK"
    },
    {
        "title": "Spinach, Bacon, and Mushroom Salad",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "12 ounces fresh spinach leaves, torn ADVERTISEMENT",
            "3/4 cup sliced fresh mushrooms ADVERTISEMENT",
            "3/4 cup croutons ADVERTISEMENT",
            "4 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 pinch ground black pepper, to taste ADVERTISEMENT",
            "3/4 cup ranch salad dressing (such as Hidden Valley® Original Ranch®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fry the bacon in a large, deep skillet over medium-high heat until crisp, about 10 minutes. Drain the bacon slices on a paper towel-lined plate; crumble once cool enough to handle.\nToss crumbled bacon, spinach, and mushrooms together in a salad bowl; top with croutons and eggs. Season the salad with black pepper and drizzle with ranch dressing.\n",
        "picture_link": "35Jw9FkkdNfa2/SdcTIsRQGLhrckXeG"
    },
    {
        "title": "Chef Bevski's Greek Salad",
        "ingredients": [
            "3/4 cup olive oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup chopped fresh dill ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cucumber, peeled and diced ADVERTISEMENT",
            "1 cup chopped broccoli ADVERTISEMENT",
            "1 cup chopped cauliflower ADVERTISEMENT",
            "2 plum tomatoes, diced ADVERTISEMENT",
            "1/4 head red cabbage, shredded ADVERTISEMENT",
            "1/4 large red onion, diced ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1 (5 ounce) jar pimento-stuffed green olives, sliced ADVERTISEMENT",
            "1 (4 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, vinegar, dill, salt, and black pepper together in a bowl.\nMix cucumber, broccoli, cauliflower, plum tomatoes, red cabbage, red onion, red bell pepper, green bell pepper, olives, and feta cheese together in a large bowl. Drizzle dressing over vegetable mixture; toss to coat. Refrigerate at least 1 hour to allow flavors to marinate.\n",
        "picture_link": "4xaLrYujai/g6I0DEiYLYqeL8hA.Dta"
    },
    {
        "title": "Carrot Cake of My Dreams!",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple in juice, drained and juice reserved ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 (8 ounce) carton egg substitute (such as Egg Beaters®) ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 cups shredded carrots ADVERTISEMENT",
            "1 cup shredded zucchini ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a fluted tube pan (such as Bundt(R)).\nCombine flour, white sugar, cinnamon, baking soda, baking powder, salt, and ginger in a large bowl.\nWhisk drained pineapple, brown sugar, egg substitute, vegetable oil, and vanilla extract together in a separate bowl until smooth.\nStir pineapple mixture, carrots, zucchini, and raisins into flour mixture just until flour is moistened.\nPour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the cake comes out clean, 55 to 65 minutes.\nCool in the pan for 10 minutes; remove cake from pan and cool completely on a wire rack, about 30 minutes.\nWhisk reserved pineapple juice, 1 tablespoon at a time, with confectioners' sugar until a spreadable glaze forms. Drizzle over cooled cake.\n",
        "picture_link": "NzCpxNxJ3Y0RcpgiWsMKK11a0YM0eHK"
    },
    {
        "title": "Poached Salmon In The Microwave",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 salmon fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine butter, wine, lemon juice, dill, sugar, salt, and black pepper together in a microwave-safe casserole dish; place cover on dish.\nMicrowave butter mixture until butter is melted, 45 to 60 seconds. Add salmon, skin-side up, to butter mixture and place cover on dish. Microwave until salmon flakes easily with a fork, about 6 minutes.\n",
        "picture_link": "1wb4pP9XfReZ9SXf7tuDqQcbK8PEQ1u"
    },
    {
        "title": "Cream Cheese Steak Stroganoff",
        "ingredients": [
            "1 (8 ounce) package farfalle (bow-tie) pasta ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 (6 ounce) package sliced white mushrooms ADVERTISEMENT",
            "1/4 cup French-fried onions ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese, cubed ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 beef bouillon cube ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/4 teaspoon smoked paprika ADVERTISEMENT",
            "3/4 pound cooked steak, thinly sliced ADVERTISEMENT",
            "1/4 cup milk, or as needed ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain and transfer to a serving bowl.\nHeat olive oil and butter together in a large frying pan; cook and stir mushrooms, onions, and garlic in the oil-butter mixture until mushrooms are tender, 5 to 10 minutes.\nStir cream cheese, white wine, tomato paste, lemon juice, cornstarch, beef bouillon, parsley, seasoned salt, and paprika together in a bowl; add steak. Pour cream cheese mixture into frying pan with mushroom mixture; cook and gently stir mixture over low heat just until sauce is warmed and smooth, 5 to 10 minutes. Add enough milk to reach desired consistency.\nPour sauce over pasta and toss to coat. Season with black pepper.\n",
        "picture_link": "Q8B3HZIDNV/m4hIqYi35GqtvHKIXXxC"
    },
    {
        "title": "Tortellini Primavera",
        "ingredients": [
            "20 ounces refrigerated cheese tortellini ADVERTISEMENT",
            "2 cups halved cherry tomatoes ADVERTISEMENT",
            "1 1/2 cups bite-sized broccoli florets ADVERTISEMENT",
            "1 cup diced yellow bell pepper ADVERTISEMENT",
            "3/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "6 ounces pepperoni sausage, cubed (optional) ADVERTISEMENT",
            "1 cup Italian-style salad dressing (such as Newman's Own®) ADVERTISEMENT",
            "1/4 cup Italian-style salad dressing (such as Newman's Own®) (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook tortellini at a boil until tender yet firm to the bite and filling is warmed through, 5 to 7 minutes; drain.\nStir cooked tortellini, tomatoes, broccoli, yellow bell pepper, Parmesan cheese, and pepperoni together in a bowl. Pour in 1 cup Italian dressing and toss to coat. Cover and refrigerate for at least 4 hours. If salad looks dry, stir in an additional 1/4 cup Italian dressing before serving.\n",
        "picture_link": "YaeRwUOsGEWt4itn3qzMj2Iosospsl."
    },
    {
        "title": "Gluten Free Pie Crust",
        "ingredients": [
            "1 1/2 cups crushed crispy rice cereal squares (such as Rice Chex®) ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon cocoa powder, or more to taste ADVERTISEMENT",
            "1 teaspoon white sugar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir crispy rice cereal, butter, cocoa powder, and sugar together in a bowl; press into bottom of a pie pan.\n",
        "picture_link": "OLzZrzc1uoCkZwGJr0KnmSzGJ06IdrK"
    },
    {
        "title": "1-2-3 Lemon Icebox Pie",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "3 lemons, juiced ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat condensed milk and egg yolks in a bowl until smooth. Add lemon juice and stir until the mixture begins to thicken; pour into prepared pie crust.\nRefrigerate pie until set in the middle, 6 hours to overnight.\n",
        "picture_link": "s4KyoEmUtbXmEsxvdyo1MuVVNPljm/G"
    },
    {
        "title": "Kiki's Spiced Habanero Peach Jam",
        "ingredients": [
            "3 1/2 pounds fresh peaches - peeled, pitted, and chopped ADVERTISEMENT",
            "6 tablespoons lemon juice ADVERTISEMENT",
            "1 vanilla bean, halved lengthwise and seeds scraped out ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "2 habanero peppers, stemmed and seeded ADVERTISEMENT",
            "2 (3 ounce) pouches liquid pectin ADVERTISEMENT",
            "5 cups white sugar ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put peaches in a Dutch oven or soup pot; stir in lemon juice, vanilla bean, cinnamon, allspice, nutmeg, and cardamom.\nPlace habanero peppers in a blender; top peppers with peach mixture. Blend until mostly smooth; transfer mixture back to the Dutch oven. Stir pectin into peach-habanero pepper mixture; bring to a full rolling boil. Quickly stir white sugar and brown sugar into mixture; return to a boil, stirring constantly, until sugar is dissolved, about 2 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area, and wait 1 to 2 weeks before opening for best results.\n",
        "picture_link": "jRYeXMMgdrnJPfXwDX0lxqubyq/Kcpm"
    },
    {
        "title": "Mexican Bison Bake with Cilantro-Lime Cream",
        "ingredients": [
            "6 ounces dried penne pasta ADVERTISEMENT",
            "1 pound ground bison ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "3/4 cup salsa ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 cup crushed tortilla chips (optional) ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon sliced green onion ADVERTISEMENT",
            "Cilantro-Lime Cream: ADVERTISEMENT",
            "2/3 cup sour cream ADVERTISEMENT",
            "3 tablespoons sliced green onions ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1/2 teaspoon finely shredded lime zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Cook pasta according to package directions; drain. Cover and keep warm.\nMeanwhile, cook ground bison and garlic over medium heat in a large skillet until meat is brown. Drain off fat.\nStir cooked pasta into the cooked, drained ground bison in the skillet. Stir in beans, undrained tomatoes, salsa, oregano, cumin, and chili powder.\nTransfer mixture to an ungreased 2-quart baking dish or casserole. Bake, uncovered, for 30 minutes or until heated through. Sprinkle with tortilla chips (if using) and cheese. Bake, uncovered, for 5 more minutes or until cheese is melted. Sprinkle with the 1 tablespoon green onion and serve with Cilantro-Lime Cream.\nCilantro-Lime Cream: Combine sour cream, the 3 tablespoons green onions, the cilantro, and lime zest in a small bowl. Cover and chill until ready to serve.\n",
        "picture_link": "ZeTlsVO2eXQ11NkwJ36EOaS1A7Banze"
    },
    {
        "title": "Cinnamon Oatmeal Bars",
        "ingredients": [
            "1 cup MUSSELMAN'S® Apple Butter ADVERTISEMENT",
            "1 cup flour ADVERTISEMENT",
            "1 cup old-fashioned rolled oats ADVERTISEMENT",
            "3/4 cup light brown sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "8 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pre-heat oven to 350 degrees F. Coat an 8x8-inch baking pan with vegetable cooking spray. Line with heavy-duty foil, leaving an overhang on two sides to facilitate removal of bars from pan. Coat foil with cooking spray.\nMix flour, oatmeal, sugar, and salt in a medium bowl. Stir in butter with a fork until well mixed and clumps form, and then spread half the oatmeal mixture over foiled pan bottom, pressing to form a thin crust.\nSpread apple butter over crust and then sprinkle remaining oatmeal mixture on top.\nBake until crisp and golden brown, 30-40 min.\nCool to room temperature. Use foil handles to remove bars from pan. Cut into squares and serve.\n",
        "picture_link": "Cv76iJqGBF4fEMcpsc/Ej2vm0CEdzxS"
    },
    {
        "title": "Brandied Cherry Clafouti",
        "ingredients": [
            "2 cups canned tart cherries, drained ADVERTISEMENT",
            "1/4 cup brandy ADVERTISEMENT",
            "2/3 cup white sugar, divided ADVERTISEMENT",
            "cooking spray (such as Pam®) ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2/3 cup sifted all-purpose flour ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon allspice ADVERTISEMENT",
            "1 teaspoon confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cherries, brandy, and 1/3 cup white sugar in a bowl; let soak for 1 hour.\nPreheat the oven to 450 degrees F (230 degrees C). Spray a 9-inch pie pan with cooking spray.\nRemove cherries from brandy mixture using a slotted spoon and transfer to the prepared pie pan. Pour brandy mixture into a blender; add remaining 1/3 cup sugar, milk, flour, eggs, vanilla extract, lemon zest, salt, and allspice to the blender. Pulse mixture until batter is smooth; pour over cherries.\nBake in the preheated oven for 5 minutes. Reduce heat to 350 degrees F (175 degrees C) and continue baking until golden and puffy, 45 to 50 minutes. Cool slightly and dust with confectioners' sugar to serve.\n",
        "picture_link": "UXSQunJ2QDCePu/QsvIztQzuILpCurC"
    },
    {
        "title": "Tex-Mex Chicken Casserole",
        "ingredients": [
            "1 (10 ounce) bag nacho cheese-flavored corn chips (such as Doritos®), crushed ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 (4.5 ounce) can chopped green chiles ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 1/2 cups chopped cooked chicken ADVERTISEMENT",
            "1 (8 ounce) package shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLightly grease a 9x13-inch baking dish. Spread corn chip crumbs over the bottom of the baking dish and press crumbs into place.\nMelt butter in a large skillet over medium-high heat; cook and stir onion in melted butter until tender, 6 to 7 minutes.\nStir diced tomatoes, cream of chicken soup. cream of mushroom soup, green chiles, milk, sour cream, chili powder, and cumin in a large bowl. Add chicken and cooked onion; stir to combine. Pour mixture over corn chips and top with Cheddar cheese.\nBake in the preheated oven until bubbly and cheese is melted, 55 to 60 minutes. Let stand for 10 minutes before serving.\n",
        "picture_link": ".9D2Z3hyu6m6uF9Sder.LgVI/F7/.M2"
    },
    {
        "title": "Chef John's Pork and Beans and Greens",
        "ingredients": [
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 teaspoon fennel seeds ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 1/2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon wine vinegar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 pounds boneless pork shoulder roast, cut into large pieces ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 (14 ounce) jar cannellini beans, drained and rinsed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "2 tablespoons chicken stock ADVERTISEMENT",
            "1 large bunch of fully grown arugula leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nGrind salt, black pepper, cumin, rosemary, fennel, red pepper flakes, and oregano to a coarse powder using a mortar and pestle. Add 2 cloves garlic and mash to a paste. Mix in brown sugar, wine vinegar, and 1 tablespoon olive oil; stir until paste is thoroughly combined.\nPlace pork chunks into a large roasting pan and spoon paste over meat; toss until meat coated.\nBake pork in the preheated oven for 1 hour; flip pork chunks and continue cooking until outside of meat has a browned crust, about 30 more minutes. Set aside and keep warm.\nPour 1 tablespoon olive oil into a skillet, place over medium heat, and add 2 sliced cloves of garlic; cook until garlic begins to sizzle, 1 minute. Stir beans into skillet and season with salt and red pepper flakes to taste; cook and stir until beans are heated through and coated with oil, 3 to 4 minutes. Pour in lemon juice and chicken stock and bring to a simmer. Mix arugula leaves into bean mixture and cook just until leaves are bright green, about 1 minute. Turn off heat and let mixture stand to allow arugula to wilt, about 1 more minute.\nPlace wilted arugula into the bottom of a serving bowl and top with beans and a chunk of caramelized pork; drizzle juices over meat to serve.\n",
        "picture_link": "PCnhgjDbdKxTxpDgT2rFHCAs/AIIzme"
    },
    {
        "title": "Easy Slow Cooker Ribs",
        "ingredients": [
            "3 racks baby back ribs, cut into 2- to 3-rib portions ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "1 (12 ounce) jar Crosse & Blackwell® Seafood Cocktail Sauce ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 teaspoon chipolte seasoning ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season ribs with salt and pepper. Place in bottom of 5-quart slow cooker.\nCombine remaining ingredients in food processor and process until smooth. Cover ribs with sauce. Cook on low 8 to 10 hours, or on high 4 to 5 hours. Serve warm.\n",
        "picture_link": "KuozCLFim8ipTmtaiH.A1tmmAb4DwUC"
    },
    {
        "title": "\"Light as a Feather\" Scones",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "5 tablespoons unsalted butter, cubed ADVERTISEMENT",
            "3/4 cup reduced-fat vanilla yogurt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a baking sheet with cooking spray.\nMix flour, 1/4 cup sugar, baking powder, and salt in a bowl. Add butter and mix with fingers until coarse crumbs form. Gently mix yogurt, egg, and vanilla extract into flour mixture until dough is just combined.\nTurn the dough out onto a lightly floured surface and knead briefly, for five or six turns. Pat or roll the dough out into a 1-inch thick round. Cut into 8 wedges and place onto the prepared baking sheet. Brush each wedge with milk and sprinkle with remaining 1 tablespoon sugar.\nBake in the preheated oven until lightly browned, about 15 minutes. Serve warm or cool completely and store in an airtight container.\n",
        "picture_link": "VGkXWev.BndP7YnVaRx7F/ASQOu8LC."
    },
    {
        "title": "Sandy's Frito Pie",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 (16 ounce) can chili beans ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (10 ounce) container fresh restaurant-style salsa ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning ADVERTISEMENT",
            "1 (10.5 ounce) bag chili cheese flavored corn chips (such as Fritos®), crushed ADVERTISEMENT",
            "2 cups shredded Mexican cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir chili beans, corn, salsa, olives, and taco seasoning into beef mixture and simmer until heated through and flavors blend, 10 to 15 minutes.\nSpread about 2/3 the crushed corn chips into a baking dish and top with the beef mixture. Sprinkle remaining chips over beef.\nBake in the preheated oven until bubbly, about 25 minutes. Sprinkle with Mexican cheese blend and continue baking until cheese is melted, about 10 minutes more.\n",
        "picture_link": "0JNpbbj2Sa/Ufn.mqBv15mBpci1oJ2m"
    },
    {
        "title": "Hearty Cranberry-Bison Stew",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 pounds bison chuck roast, cut into 3/4-inch cubes, or bison stew meat ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 (14.5 ounce) cans beef broth ADVERTISEMENT",
            "2 cups cranberry juice or cranberry juice cocktail ADVERTISEMENT",
            "1 1/2 cups fresh cranberries, rinsed ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "2 cups frozen cut green beans ADVERTISEMENT",
            "1 1/2 cups chopped carrots ADVERTISEMENT",
            "1 cup sliced celery ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Reserve 1/4 cup of the flour. Place the remaining flour in a resealable plastic bag. Add bison chuck roast cubes, a few at a time, shaking to coat. Heat oil over medium-high in a 5- to 6- quart Dutch oven or pot. Brown bison cubes in batches on all sides in hot oil. Drain off fat. Stir in 3 cups of the broth, the cranberry juice, cranberries, onion, thyme, marjoram, sugar, salt, and pepper. Bring to boiling; reduce heat. Simmer, covered, for 1 hour.\nStir in green beans, carrots, and celery. Simmer, covered, for 1 more hour or until bison and vegetables are tender. Stir the remaining 1/2 cup broth and the reserved 1/4 cup flour in a small bowl until smooth; stir into stew. Cook and stir until thickened and bubbly; cook and stir 1 more minute.\n",
        "picture_link": "/7SfzaACgEqDEVxZfSQQfzvdRMhJvqe"
    },
    {
        "title": "Easy Creamy Caesar Salad Dressing",
        "ingredients": [
            "1/3 cup canola oil ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup egg substitute (such as Egg Beaters®) ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon anchovy paste ADVERTISEMENT",
            "1/4 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 head romaine lettuce, torn into bite-size pieces ADVERTISEMENT",
            "1 cup croutons ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend vegetable oil, Parmesan cheese, egg substitute, Dijon mustard, garlic, anchovy paste, Worcestershire sauce, and pepper in a blender or food processor until smooth; season with salt.\nDrizzle dressing over lettuce in a large mixing bowl; toss to coat. Top salad with croutons.\n",
        "picture_link": "tkBK01B4SsV7iNTfI390v0n8HtUnaue"
    },
    {
        "title": "Pear Pie",
        "ingredients": [
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "3 cups sliced Bartlett pears ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Press pie crust into a 9-inch pie dish.\nArrange pear slices in the pie crust. Stir sour cream, 1/2 cup sugar, 2 tablespoons flour, egg, vanilla extract, and salt together in a bowl; pour over pears.\nMix 1/2 cup flour, butter, 1/4 cup sugar, and cinnamon together in a bowl until topping resembles coarse crumbs.\nBake pie in the preheated oven for 35 minutes. Sprinkle topping onto pie and continue baking until topping is golden brown, about 10 more minutes.\n",
        "picture_link": "2ZUTAWuK1gpndT6EB2BXNYHWxL5Wgrq"
    },
    {
        "title": "Linda Sue's Chocolate Cake (Vegan)",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nWhisk flour, sugar, cocoa powder, and baking soda together in a bowl; add water, canola oil, and vinegar. Mix until batter is smooth. Pour batter into prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 30 minutes. Cool in the pan before slicing.\n",
        "picture_link": "CnyVHY7NACpiC1N5yLSxHAuyZfcCf4y"
    },
    {
        "title": "Curried Wheat Berry Salad",
        "ingredients": [
            "2 cups wheat berries ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 (15 ounce) can chickpeas (garbanzo beans), rinsed and drained ADVERTISEMENT",
            "1 cup unsalted sunflower seeds ADVERTISEMENT",
            "1 1/4 cups raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place wheat berries in a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain.\nBring 6 cups water and wheat berries to a boil in a saucepan; add 1 teaspoon olive oil and salt. Reduce heat to medium-low, cover, and simmer until the wheat berries are tender and have split open, 45 minutes to 1 hour. Drain and rinse wheat berries with cold water.\nWhisk 1/3 cup olive oil, curry powder, parsley, red pepper flakes together in a bowl until dressing is evenly mixed.\nCombine wheat berries, chickpeas, sunflower seeds, and raisins in a bowl. Drizzle dressing over wheat berry mixture; toss to coat and season with salt.\n",
        "picture_link": "yUf98KUym2We9pRerxXXCs32mJB4s.i"
    },
    {
        "title": "Nan May's Snowballs",
        "ingredients": [
            "1 cup 2% milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "2 1/2 cups unsweetened shredded coconut, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk, sugar, butter, and cocoa powder in a large pot; bring to a boil for 3 minutes. Stir vanilla extract into the milk mixture; boil another 2 minutes. Remove pot from heat.\nStir oats and 2 cups coconut into the milk mixture until thoroughly mixed; cool for 5 minutes.\nSpread 1/2 cup coconut onto a plate. Roll the mixture into 24 balls and roll in the coconut. Set on a sheet of parchment paper until finished.\n",
        "picture_link": "yqSshmbOC.ToEQyV7DvJ4PsFWV5Xrc."
    },
    {
        "title": "Easy Breakfast Casserole from Country Crock®",
        "ingredients": [
            "1/2 cup Country Crock® Spread, divided ADVERTISEMENT",
            "3 cups assorted fresh vegetables (peppers, onions, and/or broccoli) ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "2 cups 2% milk ADVERTISEMENT",
            "2 cups shredded low-fat Cheddar cheese, divided ADVERTISEMENT",
            "1 (16 ounce) package frozen hash brown potatoes, thawed ADVERTISEMENT",
            "8 slices bacon, crisp-cooked and crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease 13 x 9-inch baking dish with 1 tablespoon Country Crock(R) Spread; set aside. Melt remaining Spread in 12-inch nonstick skillet over medium-high heat and cook vegetables, stirring occasionally, until tender, about 8 minutes.\nWhisk eggs with milk in large bowl. Stir in 1 1/2 cups cheese, cooked vegetables, potatoes and bacon. Pour into prepared baking dish.\nCover with aluminum foil and bake 45 minutes. Uncover, then sprinkle with remaining 1/2 cup cheese and bake 30 minutes or until eggs are thoroughly cooked.\n",
        "picture_link": "hnRszn3TqOQenUJPmXGjTGPN309resC"
    },
    {
        "title": "Chocolate Bundt® Cake",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (5.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/2 cup brewed coffee ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (6 ounce) package chocolate chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter and flour a 10-inch fluted tube pan (such as Bundt(R)).\nMix cake mix, sour cream, pudding mix, vegetable oil, coffee, and eggs together in a bowl; fold in chocolate chunks. Pour batter into the prepared pan.\nBake in the preheated oven until cake springs back when lightly touched, 65 to 75 minutes. Cool in pan on a wire rack. Slice cake and microwave each piece for 10 seconds to serve.\n",
        "picture_link": "Ufa6k7mY5JwKG5W.nl4Kh20qW72TY9q"
    },
    {
        "title": "Vegetable Fried Rice",
        "ingredients": [
            "2 teaspoons peanut oil ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 tablespoons reduced-sodium teriyaki sauce ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "3 cups cold cooked rice ADVERTISEMENT",
            "2/3 cup frozen peas, thawed ADVERTISEMENT",
            "2/3 cup frozen carrot slices, thawed ADVERTISEMENT",
            "2/3 cup frozen chopped broccoli, thawed ADVERTISEMENT",
            "1/4 cup sliced green onion (green part only) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large wok or skillet over medium-high heat. Cook egg in hot wok, stirring continually, until no longer moist, 3 to 5 minutes. Transfer egg to a plate and return wok to heat.\nCook ginger and garlic in skillet until fragrant, about 1 minute. Add teriyaki sauce, lime juice, brown sugar, salt, and red pepper flakes to the ginger and garlic; bring to a boil, reduce heat to medium, and continue to cook another 2 minutes.\nCrumble cold rice into the wok. Stir rice with a wooden spoon, breaking rice into individual grains as it warms; add peas, carrots, broccoli, and green onion. Cook and stir mixture until the vegetables are tender, 7 to 10 minutes. Fold scrambled egg into the rice mixture; cook and stir until egg is reheated, 1 to 2 minutes more.\n",
        "picture_link": "/3SV2m80ZeAKiARs6Zg5Xf0OZNsgExS"
    },
    {
        "title": "Cheese Garlic Croutons",
        "ingredients": [
            "10 slices bread, cut into cubes ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese, or to taste ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPut bread cubes in a large bowl; drizzle with melted butter. Toss to evenly coat. Spread onto a baking sheet.\nBake in the preheated oven until croutons are crisp, 10 to 15 minutes.\nMix Parmesan, salt, paprika, and garlic powder into a bowl; sprinkle over croutons. Toss to coat.\n",
        "picture_link": "uJqaYWyu0DokRVV6hS4nH.cv2oU6Dka"
    },
    {
        "title": "Easy Taco Bake",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 package taco seasoning mix ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "2 (8 ounce) packages refrigerated crescent rolls ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 (10 ounce) bag shredded lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir in taco seasoning.\nPreheat oven to 350 degrees F (175 degrees C). Spray an 8x10-inch baking dish with cooking spray.\nSpread crescent roll dough into the bottom of the prepared baking dish; spoon refried beans onto dough. Layer ground beef over refried beans. Wrap edges of crescent roll dough over ground beef.\nBake in the preheated oven until dough is golden brown, 10 to 15 minutes. Sprinkle with Cheddar cheese and lettuce.\n",
        "picture_link": "TbQotNl48o/ad7PFeupk/.FiUXjXTci"
    },
    {
        "title": "Mouthwateringly Tangy Pineapple Meatloaf",
        "ingredients": [
            "Meatloaf: ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1/2 cup chopped green and red bell pepper ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1/4 cup pineapple preserves ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1/4 cup pineapple preserves ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground beef, bread crumbs, bell peppers, onion, egg, 1/3 cup ketchup, 1/4 cup pineapple preserves, 1/4 cup brown sugar, garlic powder, and Worcestershire sauce in a food processor until combined; put into a bread pan.\nBake in preheated oven for 30 minutes.\nStir 1/3 cup ketchup, 1/4 cup pineapple preserves, and 1/4 cup brown sugar together in a bowl; pour over the meatloaf.\nContinue baking until no longer pink in the center, about 20 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "ERyzoL1dmEd/JWfc61RbAK3XKA8eSsG"
    },
    {
        "title": "Vegetable Quiche",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 large green bell pepper, chopped ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 zucchini, peeled and grated ADVERTISEMENT",
            "1 yellow squash, peeled and grated ADVERTISEMENT",
            "1 carrot, grated ADVERTISEMENT",
            "1 green onion, sliced ADVERTISEMENT",
            "1 cup buttermilk baking mix ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.\nHeat 1 teaspoon vegetable oil in a skillet over medium heat; cook and stir onion, bell pepper, and garlic in hot oil until just tender, about 5 minutes. Transfer mixture to a large bowl.\nMix eggs, zucchini, yellow squash, carrot, green onion, baking mix, 1/2 cup Cheddar cheese, 1/4 cup vegetable oil, salt, Italian seasoning, paprika, red pepper flakes, and black pepper into onion mixture. Spread vegetable mixture into prepared baking dish and sprinkle with remaining 1/2 cup Cheddar cheese.\nBake in preheated oven until lightly browned, about 35 minutes.\n",
        "picture_link": "ELelI7x1t01SYw21Bu6SwEDw7sOL7oK"
    },
    {
        "title": "Vanilla Banamango Smoothie",
        "ingredients": [
            "1/4 cup orange juice, or to taste ADVERTISEMENT",
            "1 mango, sliced ADVERTISEMENT",
            "1 frozen banana, sliced ADVERTISEMENT",
            "2 baby carrots ADVERTISEMENT",
            "1 (6 ounce) container vanilla yogurt ADVERTISEMENT",
            "2 ice cubes, or as desired ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour orange juice into the pitcher of a blender and add mango, frozen banana, carrots, vanilla yogurt, ice cubes, and ginger. Pulse several times to crush ice, then blend until smooth, 30 seconds to 1 minute.\n",
        "picture_link": "ZVBC5R3uY4VdzyHKPkeOOq/BohlriQ2"
    },
    {
        "title": "Broccoli with Buttery Crumbs",
        "ingredients": [
            "2 (14 ounce) bags frozen broccoli florets ADVERTISEMENT",
            "1 cup melted butter, divided ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "2 cups croutons ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a pot of salted water to a boil. Cook broccoli in boiling water until heated through, about 5 minutes; drain. Transfer broccoli to a casserole dish.\nPour about half the butter over the broccoli; season with seasoned salt. Top broccoli with croutons. Drizzle remaining butter over croutons.\nBake in preheated oven until hot and croutons are lightly browned, about 20 minutes.\n",
        "picture_link": "f80aqI4sKoz6u4N1AvjaSgcpZBtAZiW"
    },
    {
        "title": "Delicious Banana Vegan Muffins (healthy and sugar free!)",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup wheat bran ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1/4 cup flax seeds ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground ginger, or to taste ADVERTISEMENT",
            "1 pinch ground allspice, or to taste ADVERTISEMENT",
            "1 pinch ground nutmeg, or to taste ADVERTISEMENT",
            "10 ripe bananas, mashed ADVERTISEMENT",
            "1/4 cup peanut oil ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 cup dark chocolate chips ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 16 muffin cups or line with paper liners.\nWhisk flour, bran, rolled oats, flax seeds, baking powder, baking soda, cinnamon, salt, ginger, allspice, and nutmeg together in a bowl. Mix bananas and peanut oil together in a separate large bowl; stir dry ingredients into banana mixture. Fold walnuts, chocolate chips, and raisins into batter. Spoon batter into prepared muffin cups, filling them about 2/3 full.\nBake muffins in the preheated oven until lightly golden brown and a knife inserted into the center of a muffin comes out clean, about 30 minutes.\n",
        "picture_link": "fgwuWWpzs6RWuNr1biJnll3TfVTetD2"
    },
    {
        "title": "Quick and Easy Chicken Divan",
        "ingredients": [
            "1 (16 ounce) package frozen chopped broccoli ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons cooking sherry ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 cup grated Cheddar cheese ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "4 cups hot cooked white rice, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put frozen broccoli in a microwave-safe bowl; cook in microwave until hot, about 4 minutes. Transfer broccoli to a 9x13-inch baking dish.\nHeat vegetable oil in a skillet over medium heat. Cook and stir chicken in hot oil until no longer pink in the middle, 5 to 7 minutes. Top broccoli with chicken pieces evenly.\nStir chicken soup, mayonnaise, sherry, and lemon juice together in a bowl until smooth; pour over the chicken and broccoli.\nBake in preheated oven for 30 minutes.\nMix bread crumbs, Cheddar cheese, and melted butter together in a small bowl; sprinkle evenly over the dish.\nContinue baking until the topping is browned, about 10 minutes. Serve over rice.\n",
        "picture_link": "qkXiKJlWNerhiZWHIXX6xonZMtWdPJa"
    },
    {
        "title": "Cranberry Walnut Cookies",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "2 1/2 cups cranberries, halved ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nCream white sugar, brown sugar, and butter together in a large mixing bowl. Beat milk, orange juice, and egg into the creamed mixture.\nSift flour, baking powder, cinnamon, salt, and baking soda together in a separate bowl; blend into the wet ingredients in the mixing bowl to form a cookie dough. Stir cranberries and walnuts into the dough.\nDrop the dough onto the prepared baking sheet by the teaspoonful.\nBake in the preheated oven until the edges are golden, 10 to 15 minutes. Allow the cookies to cool on the baking sheet for 1 minute before removing to a wire rack to cool completely. Sprinkle confectioners' sugar over the cookies to serve.\n",
        "picture_link": "7x601.bZ.hg/s/lqMZIUA3cx2z32JEy"
    },
    {
        "title": "Family Favorite Sloppy Joes",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/2 (12 ounce) bottle chili sauce ADVERTISEMENT",
            "1/2 cup dark brown sugar ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "1 teaspoon sweet pickle relish ADVERTISEMENT",
            "1 teaspoon minced onion ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix ketchup, chili sauce, brown sugar, Parmesan cheese, relish, onion, and Worcestershire sauce into ground beef; simmer until heated through and flavors blend, 20 to 25 minutes.\n",
        "picture_link": "LxNpkiZAKW0CMXZO4EKHA.o.C/n10km"
    },
    {
        "title": "Fabulous Carrot Cake",
        "ingredients": [
            "1 1/2 cups butter, divided ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup granulated sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (20 ounce) can DOLE® Crushed Pineapple, well drained ADVERTISEMENT",
            "4 cups shredded DOLE carrots ADVERTISEMENT",
            "1 cup DOLE Seedless Raisins ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups powdered sugar ADVERTISEMENT",
            "1 teaspoon grated lemon peel ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat 1 cup butter and sugars until light and fluffy in large bowl. Beat in eggs. Beat in crushed pineapple, carrots, raisins and vanilla.\nStir together flour, baking soda, cinnamon, ginger and salt in medium bowl. Gradually add to pineapple mixture and beat until well blended. Pour into 2 9-inch greased and floured cake pans.\nBake at 350 degrees F 40 minutes or until toothpick inserted comes out clean. Cool in pans 15 minutes. Remove from pans; cool completely on wire racks.\nBeat cream cheese with remaining 1/2 cup butter until smooth. Beat in powdered sugar, lemon peel and juice until smooth. Spread frosting over cakes. Garnish with additional crushed pineapple and grated carrots, if desired.\n",
        "picture_link": "DzeHsH2E/KVIh19LDmUXG4AF8SjDzlS"
    },
    {
        "title": "Root Beer and Sesame Glazed Ribs",
        "ingredients": [
            "3 tablespoons Asian (toasted) sesame oil ADVERTISEMENT",
            "3 tablespoons chile-garlic sauce (such as Sriracha) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 (8 bone) racks lamb ribs ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle root beer ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 cloves garlic, peeled ADVERTISEMENT",
            "1/4 cup finely chopped green onions ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1 tablespoon Asian chile pepper sauce (such as sambal oelek) ADVERTISEMENT",
            "2 teaspoons toasted sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour sesame oil, chile-garlic sauce, and 1 teaspoon salt in a bowl. Stir to dissolve salt. Place ribs onto a square of aluminum foil and brush sesame oil mixture onto ribs on both sides. Place ribs into a heavy resealable plastic bag.\nPour root beer over the ribs and seal the bag. Refrigerate at least 12 hours, or overnight. Remove ribs from marinade; reserve marinade in a bowl and keep refrigerated.\nPreheat oven to 250 degrees F (120 degrees C). Place a large piece of aluminum foil onto a baking sheet.\nPlace rib racks, meat-side up, onto the foil and season both sides with salt and black pepper. Place a piece of parchment paper on top of the meat; place another piece of foil over the parchment paper. Fold edges and seal sides to make an airtight package.\nBake ribs in the preheated oven until almost fork-tender, about 2 hours. Open foil packet and test for doneness; a fork inserted into the meat will go in with some effort.\nTransfer reserved marinade to a small saucepan. Add garlic, green onions, and rice vinegar to marinade and bring to a boil. Reduce heat to medium-high and cook until sauce is reduced by half, about 5 minutes; stir often.\nPour pan juices from foil packet into saucepan with the sauce. Add Asian chile pepper sauce. Bring back to a simmer and cook sauce until slightly thickened to a glaze, about 5 more minutes.\nIncrease oven heat to 450 degrees F (230 degrees C). Line another baking sheet with foil and transfer ribs to baking sheet.\nBrush both sides of ribs with thickened glazing sauce. Cook in hot oven until glaze begins to cook onto meat, 6 to 7 minutes. Brush another coat of glaze onto the ribs; repeat 4 more times, cooking 5 to 6 more minutes per time, until meat is shiny, glazed, browned, and fully fork-tender. Brush 1 more coat of glaze onto meat.\nSprinkle ribs with sesame seeds and cook for 5 more minutes to set the last glaze coat.\n",
        "picture_link": "fclMHAjWfksqebC8oSerBXlW9gfYCWu"
    },
    {
        "title": "Quick Chicken Paella",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound boneless, skinless chicken breasts, cut in bite-sized pieces ADVERTISEMENT",
            "2 links chorizo sausage, thinly sliced ADVERTISEMENT",
            "1 (14 ounce) bag Birds Eye® Recipe Ready Mixed Vegetables ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning blend ADVERTISEMENT",
            "1 (10 ounce) bag Birds Eye® Steamfresh® Long Grain White Rice, cooked according to package directions ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large nonstick skillet over medium-high heat and cook chicken and chorizo, stirring frequently, 8 minutes or until chicken is almost done.\nStir in Recipe Ready Mixed Vegetables and taco seasoning and cook, stirring occasionally, 5 minutes or until vegetables are tender.*\nStir in prepared rice and chicken broth; heat through. Season, if desired, with salt and pepper.\n",
        "picture_link": "ITqwnFuKTrhUZyjn6nOecQaJfgbhJom"
    },
    {
        "title": "Middle Eastern Garlic Sauce",
        "ingredients": [
            "3 small russet potatoes, peeled ADVERTISEMENT",
            "1 head garlic, peeled and crushed ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 15 to 20 minutes. Drain and transfer to a bowl; mash until smooth. Set aside to cool.\nPut garlic, salt, and lemon juice in a blender or food processor; pour in enough olive oil to lightly coat garlic cloves. Blend mixture on high; slowly stream remaining olive oil through the top opening of the blender or food processor until mixture is smooth. Add mashed potatoes, about 2 to 3 tablespoons at a time, to the garlic mixture while blender is still running. Continue adding potatoes until all are incorporated. Transfer sauce to a bowl and refrigerate until chilled, 1 hour to overnight.\n",
        "picture_link": "jhN1NvrWBm2HYICTQlWxZh744PhvoIK"
    },
    {
        "title": "Mango, Corn, and Black Bean Salsa",
        "ingredients": [
            "3 large mangoes, diced ADVERTISEMENT",
            "1 (15 ounce) can sweet corn, drained ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mangoes, sweet corn, and black beans in a large bowl; add lime juice and stir. Sprinkle cilantro over the mango mixture; toss to combine.\n",
        "picture_link": "FArt.LT45VHaJV0xnaae5.nwVBlG3qS"
    },
    {
        "title": "Amazingly Succulent Roast Turkey Thighs",
        "ingredients": [
            "1 large heat-resistant nylon oven bag (such as Reynolds® Oven Bags) ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 onion, cut into 1-inch pieces ADVERTISEMENT",
            "2 stalks celery, cut into 1-inch pieces ADVERTISEMENT",
            "1 large carrot, cut into 1 inch pieces ADVERTISEMENT",
            "4 turkey thighs ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons seasoned salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Sprinkle flour into oven bag and place it in a 9x11-inch pan.\nSpread onion, celery, and carrot pieces on the bottom of the bag. Rinse turkey thighs and pat dry with paper towels. Rub olive oil under the skin and on the outside of the thighs.\nSprinkle seasoned salt liberally on turkey thighs and rub it under the skin (see Cook's Note). Arrange thighs on top of vegetables. Close the bag with the tie. Make six slits in the top of the bag with a sharp paring knife. Place pan in the oven, making sure oven bag does not touch top heating element.\nRoast until an instant-read thermometer inserted into the thigh meat reaches 165 degrees F (74 degrees C), about 1 hour.\n",
        "picture_link": "RnYI5o6NguNgmE2QtXffQ9dfNQOumR2"
    },
    {
        "title": "Healthy Red Beans and Rice",
        "ingredients": [
            "1 pound dried red beans ADVERTISEMENT",
            "2 quarts hot water ADVERTISEMENT",
            "1 pound smoked turkey sausage, cut into chunks ADVERTISEMENT",
            "1 cup finely chopped onions ADVERTISEMENT",
            "1/2 cup finely chopped green bell pepper ADVERTISEMENT",
            "1/2 cup finely chopped celery ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put red beans in a large pot with enough water to cover by several inches. Soak 8 hours to overnight.\nDrain and rinse beans. Pour hot water into the pot. Add beans, sausage, onions, bell pepper, celery, cayenne pepper, salt, and bay leaf to the pot; stir. Place pot over medium heat, put a cover on the pot, and cook, stirring frequently, for 30 minutes.\nReduce heat to medium-low and continue cooking at a simmer until the beans are tender, about 30 minutes more. Remove and discard bay leaf before serving.\n",
        "picture_link": "0oLDz8.Y3KnuDylrKgm1LsCJ4KSqRVu"
    },
    {
        "title": "Chocolate Dipped Apples",
        "ingredients": [
            "10 small Granny Smith apples ADVERTISEMENT",
            "1/2 cup chopped roasted peanuts ADVERTISEMENT",
            "1/2 cup candy-coated milk chocolate candies ADVERTISEMENT",
            "2 pounds semisweet chocolate, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Insert wooden craft sticks or lollipop sticks into the cores of the apples at the stem. Place the roasted peanuts and candies on separate plates. Set aside.\nPlace the chocolate into a metal or glass bowl and set over a pan of barely simmering water. Stir frequently until melted. Remove from the heat. Dip apples into the melted chocolate, turning to coat completely. Dip or roll in candy or nuts, then place on a sheet of waxed paper. Repeat with remaining apples. Allow apples to set at room temperature until the chocolate is firm, about 20 minutes, before serving.\n",
        "picture_link": "qE8lpQZvrefJHtPhM/JgSl/kOVBHAUO"
    },
    {
        "title": "Apple Nut Stuffing",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "6 cups toasted bread cubes ADVERTISEMENT",
            "3 cups diced peeled apples ADVERTISEMENT",
            "1/2 cup coarsely chopped walnuts ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/2 cup apple cider ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt butter in a skillet over medium heat. Saute onion and celery until tender, but not browned; transfer to a large bowl. Add bread cubes, chopped apples, walnuts, raisins, and apple cider. Season with sage, salt and pepper. Mix well, and place into a baking dish.\nCover, and bake in preheated oven for 1 1/2 hours.\n",
        "picture_link": "rOR3IsGC8XLl.yzRLa6QUhxkke3ojzK"
    },
    {
        "title": "Polish Egg Bread",
        "ingredients": [
            "5 packages active dry yeast ADVERTISEMENT",
            "2 cups lukewarm water, divided ADVERTISEMENT",
            "1 quart whole milk ADVERTISEMENT",
            "1 cup butter, cut into pieces ADVERTISEMENT",
            "1 1/2 cups superfine sugar ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "10 eggs, room temperature ADVERTISEMENT",
            "5 pounds bread flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast packages in 1 cup of warm water; set aside.\nBring milk to a boil. Remove from heat; add remaining 1 cup water, butter, and 2 tablespoons plus 1 teaspoon of salt; stir until butter melts. Pour in sugar and stir until dissolved.\nWhen milk mixture has cooled to lukewarm, stir in dissolved yeast.\nIn a separate bowl, beat eggs until combined. Whisk milk mixture into eggs. Gradually add 5 pounds of flour. Transfer dough to a floured work surface, and use a serrated knife to divide dough in half. Shape each half into a ball and place the dough in two large oiled bowls. Cover with greased plastic wrap and let rise in a warm place for about 1 1/2 hours.\nPreheat oven to 325 degrees F (165 degrees C).\nOnce risen, turn dough out onto a well-floured surface and divide into 6 equal portions. Shape the dough into balls. (Dough will be very sticky and soft at this point.) Keep the dough covered with greased plastic wrap while you divide one dough ball into 3 pieces. Shape the dough into three ropes, braid together, and place on a lightly greased baking sheet or parchment-lined baking sheet. Repeat with the remaining loaves. You should be able to fit two loaves per baking sheet.\nBake loaves in the preheated oven for 35 to 40 minutes, or until hollow-sounding when tapped on top. Let cool, and enjoy!\n",
        "picture_link": "UbGIGOKWwNjtChLGcxVUuIvwZssyGGS"
    },
    {
        "title": "Tomato Rice Stew",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "2 cups uncooked white rice ADVERTISEMENT",
            "2 unpeeled potatoes, diced ADVERTISEMENT",
            "1 (12 ounce) can tomato paste ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 (13.5 ounce) can whole leaf spinach, drained ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes, drained and sliced ADVERTISEMENT",
            "1/2 tablespoon fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, mix the water, rice, potatoes, tomato paste, and tomato sauce. Stirring constantly, bring to a boil. Reduce heat to medium, and stir in basil, sugar, salt, and bay leaves. Cook about 15 minutes, stirring often, until potatoes and rice are tender but firm.\nMix spinach, stewed tomatoes, and lemon juice into the saucepan. Reduce heat, and simmer 15 minutes, or until rice has finished cooking and the mixture has thickened.\n",
        "picture_link": "X0I6RmWs0Yn2QD5HUI0pwIJeVtXUM/G"
    },
    {
        "title": "Chicken Calvados",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "3 cups sliced fresh mushrooms ADVERTISEMENT",
            "3 Granny Smith apples, peeled and sliced ADVERTISEMENT",
            "1 cup apple brandy, such as Calvados ADVERTISEMENT",
            "1 teaspoon dried thyme leaves ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour and seasoned salt in a wide, shallow dish. Coat the chicken breasts in the seasoned flour. Heat the butter in a large skillet over medium-high heat. Brown chicken in the butter, about 3 minutes on each side. Transfer chicken to a plate and tent with foil.\nCombine the onions, mushrooms, and apples in the skillet. Cook and stir until the apples are just tender, about 5 minutes. Stir in the brandy, thyme, salt, and pepper; bring to a simmer. Return chicken to the pan; cook, uncovered, about 10 minutes. Stir in cream, and simmer until thickened, about 5 minutes.\n",
        "picture_link": "Hy4GJ0fdTi0Z92c6mUIn6GDvBDxYbvS"
    },
    {
        "title": "Pancetta Wrapped Shrimp with Chipotle Vinaigrette and Cilantro Oil",
        "ingredients": [
            "1 bunch cilantro, rinsed ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "4 teaspoons fresh lime juice ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "1 canned chipotle pepper ADVERTISEMENT",
            "1 tablespoon adobo sauce from canned chipotle peppers ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1/2 cup rice vinegar ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "3 pounds extra large shrimp (16-20), peeled and deveined, tail left on ADVERTISEMENT",
            "2 pounds thinly sliced pancetta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare cilantro oil by pureeing cilantro, canola oil, honey, lime juice, and salt to taste until smooth; pour into a bowl or bottle, and set aside.\nPrepare the chipotle vinaigrette by pureeing the chipotle pepper, adobo sauce, lemon juice, rice vinegar, and garlic in a blender until smooth. With the blender running, slowly pour in the canola oil, and puree until creamy. Season to taste with salt, and set aside.\nPreheat a grill for medium heat.\nCut the pancetta slices in half. Wrap a half slice of pancetta around each shrimp to cover. Grill until the pancetta has crisped, and the shrimp has turned opaque, 2 to 3 minutes per side. Drain on paper towels.\nTo serve, arrange cooked shrimp on a warmed serving platter or individual plates, and drizzle with chipotle vinaigrette and cilantro oil.\n",
        "picture_link": "dTTHBwY7cQriKaKekMhoav2kCrk81x."
    },
    {
        "title": "Kazakh Beef Soup",
        "ingredients": [
            "3 beef soup bones ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 (16 ounce) jar sauerkraut - rinsed and drained ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 large baking potatoes, peeled and cubed ADVERTISEMENT",
            "1 tablespoon hot chile sauce, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place soup bones in a stock pot with enough water to cover them by 2 inches. Bring to a boil, and cook uncovered for about 1 hour to make a beef stock. Remove bones, and cool.\nHeat one tablespoon of oil in a large skillet. Saute sauerkraut for a few minutes, then add just enough water to cover the sauerkraut, cover the pan, and let simmer over low heat for about 30 minutes, until the sour taste is gone. Drain, and set aside. Heat remaining olive oil in a small skillet over medium-high heat. Saute onion in the hot oil until tender.\nWhen the bones are out of the stock, add potatoes, and boil for about 15 minutes, until potatoes are tender. Stir in the sauerkraut, onions, and any meat that can be picked from the bones. Season with chili sauce and salt to taste. Simmer over low heat for about 15 minutes. Ladle into bowls, and serve with a dollop of sour cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rum Mocha Chocolate Cake",
        "ingredients": [
            "1 3/4 cups cake flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 teaspoons instant coffee granules ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "3/4 cup boiling water ADVERTISEMENT",
            "1/2 cup butter or margarine, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 teaspoons rum ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "5 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons instant coffee granules ADVERTISEMENT",
            "1/3 cup boiling water ADVERTISEMENT",
            "3 tablespoons butter or margarine, softened ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 - 8 inch pans. Sift together the flour, baking powder, and salt. Set aside. Mix together 4 teaspoons instant coffee, 1/2 cup cocoa powder, and 3/4 cup boiling water; set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in 1 1/2 teaspoons rum. Mix the milk into cooled cocoa mixture, then beat into the batter alternately with the flour mixture. Pour batter into prepared pans.\nBake in the preheated oven for 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\nTo make Mocha Chocolate Frosting: Sift together confectioners' sugar and 5 tablespoons cocoa powder; set aside. Dissolve 2 teaspoons instant coffee with 1/3 cup boiling water; set aside. In a medium bowl, cream butter until smooth. Beat in sugar/cocoa mixture. Mix in the vanilla extract and rum. Beat until smooth and creamy. Spread between layers of cooled cake.\n",
        "picture_link": "LMP9mfPYUNt1uN0kjHEXsPvivoeQZ0a"
    },
    {
        "title": "Lumpia Rolls",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 pounds ground pork ADVERTISEMENT",
            "vegetable oil ADVERTISEMENT",
            "1 1/2 cups carrots, finely chopped ADVERTISEMENT",
            "soy sauce to taste ADVERTISEMENT",
            "3 cups bean sprouts ADVERTISEMENT",
            "1 cup sugar snap peas, chopped ADVERTISEMENT",
            "1 cup fresh mushrooms, finely chopped ADVERTISEMENT",
            "1 cup green onions, finely chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "1 (14 ounce) package Lumpia Wrappers ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "canola oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown beef and pork in a large frying pan with a small amount of oil over medium heat. Drain, place in a large mixing bowl, and set aside. In the same pan, cook the carrots with a splash of soy sauce until tender. Add the bean sprouts, snap peas, mushrooms, and green onions, and a dash each of soy sauce, salt, garlic powder, and black pepper. Cook and stir for 5 minutes, or until vegetables are tender but still firm. Add to beef and pork, and toss to combine.\nWork with 5, or so, spring roll wrappers at one time, leaving the others covered with a damp cloth to prevent them from drying out. Lay the wrappers so that one corner is facing you. Place a small amount of filling mixture on the corner closest to you, and fold over. Fold the two outside corners inward, then continue rolling up as you would a burrito, leaving the top corner exposed. Brush a small amount of egg white on the top corner, finish rolling, and seal. Repeat with remaining filling and wrappers.\nHeat vegetable oil in deep-fryer or deep skillet to 375 degrees F (190 degrees C). Fry rolls for about 5 minutes, or until golden brown, then drain on paper towels.\n",
        "picture_link": "Hhsdy40PGHgvS2MC3/WM0BjLBbyCHya"
    },
    {
        "title": "Zucchini Parmesan Appetizer",
        "ingredients": [
            "3 pounds zucchini, cubed ADVERTISEMENT",
            "5 tablespoons unsalted butter, divided ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "4 garlic cloves, minced ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup fresh white bread crumbs ADVERTISEMENT",
            "1/4 cup chopped fresh basil leaves, packed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace zucchini in a pot with about 1 inch of water. Bring to a boil, and cook until tender but still firm, about 10 minutes. Drain zucchini and transfer to a large bowl. Mash with a fork, then transfer to a fine mesh strainer or sieve, pressing to release excess water. Return to mixing bowl.\nMelt 4 tablespoons butter in a large skillet over medium-high heat. Add onion and garlic, and cook until lightly browned being careful not to burn the garlic. Remove from heat, stir into the zucchini. Mix in the eggs, Parmesan cheese, bread crumbs, and basil. Season with salt and pepper.\nButter an 8 inch square baking dish with remaining butter. Pour the zucchini mixture into the dish, and spread evenly. Bake in the preheated oven until firm in the center and lightly browned on top, about 45 minutes. Allow to cool, cut into squares, and serve.\n",
        "picture_link": "qvHmwQ1AZHctP3.0nE3nvv8A5iavTre"
    },
    {
        "title": "Spam Pizza Burgers",
        "ingredients": [
            "1 (12 ounce) container fully cooked luncheon meat (e.g. Spam) ADVERTISEMENT",
            "1 (15 ounce) can chili without beans ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "4 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nGrate the luncheon meat in to a medium bowl using a cheese grater. Stir in the chili and Cheddar cheese. Spread the mixture onto each bun half using a fork, and place them on a baking sheet.\nBake for 8 to 10 minutes in the preheated oven, until heated through and buns are nicely toasted on the bottom.\n",
        "picture_link": "T3Yq3NkYTGtIYibBCelVY3A3rE5frWO"
    },
    {
        "title": "Trinidad's Ponche-de-Creme (Punch with Cream)",
        "ingredients": [
            "6 eggs, beaten ADVERTISEMENT",
            "2 teaspoons grated lime zest ADVERTISEMENT",
            "3 (14 ounce) cans sweetened condensed milk ADVERTISEMENT",
            "3/4 cup canned evaporated milk ADVERTISEMENT",
            "1 1/2 cups rum ADVERTISEMENT",
            "1 tablespoon aromatic bitters ADVERTISEMENT",
            "1 pinch freshly grated nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat eggs and lime zest using an electric mixer until light and fluffy. Gradually pour in the condensed milk while continuing to mix, and then pour in the evaporated milk.\nStir in the rum and bitters, and sprinkle with nutmeg. Transfer to a bottle and chill for at least 1 hour before serving. Serve over crushed ice.\n",
        "picture_link": "C.st37Pmv3WxBCYAIuHepefUL1PbkjO"
    },
    {
        "title": "Ham Sauce",
        "ingredients": [
            "1 cup sugar ADVERTISEMENT",
            "1/4 cup mustard powder ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, whisk together the sugar, mustard powder and flour. Mix in egg yolks until smooth. Heat half and half in the top half of a double boiler, or in a metal bowl over a pan of simmering water until just short of boiling. Stir in the egg yolk and sugar mixture, and then stir in the vinegar. Continue to stir over simmering water until thickened, about 5 minutes.\n",
        "picture_link": "QDIuCKNuuixx0KLsOLO7PFcMowPgbhO"
    },
    {
        "title": "Beef Martini",
        "ingredients": [
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 cup barbecue sauce ADVERTISEMENT",
            "1/4 cup gin ADVERTISEMENT",
            "1 tablespoon dry vermouth ADVERTISEMENT",
            "1 tablespoon green olive brine ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "4 (1/2 pound) beef sirloin steaks ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine onion, garlic, barbecue sauce, gin, vermouth, olive brine, and basil.\nSprinkle each steak with salt and pepper, and place in resealable sandwich bags. Divide marinade between each bag, and seal. Ensure that marinade is evenly distributed around steaks. Refrigerate for 2 to 24 hours.\nPreheat grill for medium-high heat, and lightly oil grate.\nRemove steaks from bags, and discard marinade. Grill steaks for 7 to 8 minutes per side, or to desired doneness.\n",
        "picture_link": "sQGtfjHrT9iEm9GwDSsp.KNQF9vkxcu"
    },
    {
        "title": "Adobo Herb Salsa",
        "ingredients": [
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1/4 cup minced red onion ADVERTISEMENT",
            "1/4 cup minced fresh cilantro ADVERTISEMENT",
            "1 tablespoon adobo sauce from canned chipotle peppers ADVERTISEMENT",
            "1 tablespoon chopped fresh tarragon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, toss together the tomatoes, bell pepper, onion, cilantro, adobo sauce, tarragon, and vinegar. Season to taste with salt, cover, and refrigerate at least 30 minutes.\n",
        "picture_link": "NN/CZC0vlfjSCZuxd/.geB8Jegljx4u"
    },
    {
        "title": "Vegetarian Turkey Stuffing",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "3 stalks celery, finely chopped ADVERTISEMENT",
            "1 green bell pepper, finely chopped ADVERTISEMENT",
            "1 (4.5 ounce) can mushrooms, drained ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups corn flake crumbs ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium casserole dish.\nHeat the oil in a skillet over medium heat, and saute the onion, celery, pepper, mushrooms, and garlic until tender. Season with salt and pepper. Mix in the corn flake crumbs and soup. Transfer to the prepared casserole dish.\nBake 30 minutes in the preheated oven, until lightly browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kim Chee Squats",
        "ingredients": [
            "2 pounds coarsely chopped Chinese cabbage ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 tablespoons chopped green onion ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1/2 cup light soy sauce ADVERTISEMENT",
            "1/2 cup white wine vinegar ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 dash sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cabbage into a large dish, and sprinkle with salt. Let stand for 3 to 4 hours. The cabbage will wilt.\nAfter the cabbage has been sitting, massage it with your hands until it is even softer. Drain off the liquid. Mix in the green onion, garlic, chili powder, ginger, soy sauce, vinegar, and sugar. Transfer to a large glass jar, and refrigerate for 24 hours before using. This will keep for about a week in the refrigerator. Sprinkle with sesame oil before serving.\n",
        "picture_link": "3nisqf2kDheOlfjPScOFpbk2AJ8JqMS"
    },
    {
        "title": "Grandma's Pork and Bean Sandwiches",
        "ingredients": [
            "4 slices white bread ADVERTISEMENT",
            "4 slices processed cheese ADVERTISEMENT",
            "6 slices bacon, cut in half ADVERTISEMENT",
            "1 (15 ounce) can baked beans with pork ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler.\nPlace bread slices on a broiling pan that has been lined with aluminum foil. Spoon about 1/2 cup of beans onto each piece of bread. Cover each pile of beans with a slice of cheese. Place three half-slices of bacon onto each sandwich so that they are not hanging over the edge.\nBroil for 5 minutes in the preheated oven, or until the bacon is cooked and cheese is melted. Watch them carefully! I suggest leaving the oven door cracked near the 5 minute mark to allow some of the oven heat to escape.\n",
        "picture_link": "kic6ISbjCmED.v0MTeLdql0DCgUH30G"
    },
    {
        "title": "Chicken with Tomatoes and Olives",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "3 plum tomatoes, seeded and chopped ADVERTISEMENT",
            "1/2 cup black olives, halved ADVERTISEMENT",
            "2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "6 cloves garlic, pressed ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "1/2 (750 milliliter) bottle dry white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts between 2 sheets of plastic wrap. Using a meat tenderizing hammer, pound each breast to about 1/2 inch thick.\nIn a large skillet, heat olive oil over medium heat. Briefly cook chicken breasts in oil, turning to lightly brown both sides. Add garlic and rosemary, and continue cooking until garlic is soft. Pour wine into pan, and cover pan with lid. Bring to a boil, and simmer for about 5 minutes.\nAdd tomatoes and olives to the pan; continue cooking, covered, for approximately 10 minutes\n",
        "picture_link": "dgPShzr84a6qEPKX37dOc2x41608BIq"
    },
    {
        "title": "Sage Cream Cheese",
        "ingredients": [
            "1/2 cup fresh sage ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3 tablespoons frozen lemonade concentrate, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the fresh sage and garlic in the container of a food processor. Pulse until finely chopped. In a small bowl, blend together the cream cheese and lemonade concentrate. Stir in the garlic and sage. Cover and refrigerate for at least one day before serving for best flavor.\n",
        "picture_link": ".6FKGLEYuXfulvASe4k6OLXxPtd3e4i"
    },
    {
        "title": "Crispy Eggplant Parmesan Stacks",
        "ingredients": [
            "2 large eggplants, sliced into 1/2-inch rounds ADVERTISEMENT",
            "Salt to draw moisture from eggplant ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 cups panko bread crumbs ADVERTISEMENT",
            "Cooking spray ADVERTISEMENT",
            "1 (24 ounce) jar Ragu® Old World Style® Traditional Sauce ADVERTISEMENT",
            "2 (8 ounce) packages mozzarella cheese, thinly sliced ADVERTISEMENT",
            "1 cup grated parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nSprinkle both sides of eggplant rounds generously with salt; place on baking sheet for 15 minutes to draw out moisture. Use paper towels to blot moisture from each side of the eggplant slices. Sprinkle lightly with salt and pepper.\nWhisk eggs in a shallow bowl. Place panko bread crumbs in a second bowl. Dip each side of the eggplant slices in the whisked eggs, then press into the panko crumbs to coat each side. Place slices on a cooling rack on a baking sheet.\nSpray the tops of eggplant generously with cooking spray. Bake 8 minutes in preheated oven. Turn each slice, and spray the other side with cooking spray. Bake an additional 8 to 10 minutes. Remove from oven and let cool slightly.\nReduce oven temperature to 350 degrees (175 degrees C).\nTo make the stacks: Cover a baking sheet with parchment paper. Place a large slice of eggplant on the parchment. Top with a spoonful of Ragu(R) Old World Style(R) Traditional Sauce and a slice of mozzarella. Place another slice of eggplant on the first; repeat the layering process until you have about 5 or 6 slices in a stack. Top with a generous layer of parmesan cheese.\nBake stacks until the cheese has melted, 10 to 15 minutes. Remove from oven and let cool for a few minutes. Serve warm.\n",
        "picture_link": "g80C2XcMhUYV4Sd0LYJosdsJGC21oFm"
    },
    {
        "title": "Spicy Mexican Tortilla Soup",
        "ingredients": [
            "1 teaspoon canola oil ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "2 large jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/2 cup frozen whole kernel corn ADVERTISEMENT",
            "1 cup canned black beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "1 (32 ounce) carton Swanson® Mexican Tortilla Flavor Infused Broth ADVERTISEMENT",
            "2 cups shredded cooked chicken ADVERTISEMENT",
            "Tortilla chips or strips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a 6-quart saucepot over medium-high heat. Add the onion and peppers and cook for 2 minutes or until tender-crisp, stirring occasionally.\nStir in the tomato paste, corn, beans, tomatoes, broth and chicken and heat to a boil. Reduce the heat to low. Cook for 5 minutes, stirring occasionally. Serve topped with crushed tortilla chips or strips, if desired.\n",
        "picture_link": "FX4Y12ic0PIGQ4y8rAj/Xt20aROhN0u"
    },
    {
        "title": "Caveman Stew",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "5 carrots, sliced ADVERTISEMENT",
            "4 potatoes, cut into quarters ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 (10.75 ounce) can water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Shape ground beef into 6 meatballs.\nMix carrots, potatoes, and onion in the bottom of a pressure cooker. Arrange meatballs atop the vegetables. Pour tomato soup and water over the vegetables and meatballs.\nSeal the pressure cooker and heat over high heat until the pressure is raised. Reduce heat to medium and cook for 15 minutes. Release the pressure from the pot according to the manufacturer's instructions.\n",
        "picture_link": "5es1mZ9Hja/ACZnz10Kv2I1RGwYX5rq"
    },
    {
        "title": "Chef John's Mayo Method Steak Sauce ",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon oil from canned anchovies ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 teaspoons minced fresh rosemary ADVERTISEMENT",
            "1 teaspoon harissa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mayonnaise, anchovy oil, lemon juice, rosemary, and harissa in a bowl. Let stand about 5 minutes to blend flavors before serving.\n",
        "picture_link": "gFjlvIdKiDQaGaliv9R/60mDpOa54QK"
    },
    {
        "title": "Mashed Potatoes",
        "ingredients": [
            "3 Yukon Gold potatoes, peeled and chopped ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nMash potatoes with milk, sour cream, salt, and pepper in the large pot.\n",
        "picture_link": "CHppQQOC0AeHzNgdTJnCGc2rkZkolxu"
    },
    {
        "title": "Sinful Sour Cream Chicken",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1/2 cup chopped white onion ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat; cook chicken in melted butter until browned completely, 2 to 3 minutes per side. Pour wine into the skillet, bring to a simmer, reduce heat to low, and continue cooking until the chicken is no longer pink in the center and the juices run clear, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from the skillet to a serving platter.\nStir onion into the liquid remaining in the skillet; cook and stir until onion is tender, 5 to 7 minutes. Add sour cream to the skillet; stir until smooth. Season the mixture with salt and pepper; pour over chicken.\n",
        "picture_link": "espJj/T18KDgCV36kVfv/5TyarKQKAO"
    },
    {
        "title": "Ham and Cheese Pot Pie",
        "ingredients": [
            "1 (6 ounce) ham steak, chopped ADVERTISEMENT",
            "1 cup KRAFT 2% Milk Shredded Cheddar Cheese ADVERTISEMENT",
            "1 cup frozen broccoli cuts, thawed, drained ADVERTISEMENT",
            "1 cup frozen cauliflower florets, thawed, drained ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/2 cup PHILADELPHIA Chive & Onion 1/3 Less Fat than Cream Cheese ADVERTISEMENT",
            "1/2 (14.1 ounce) package ready-to-use refrigerated pie crust ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F.\nCombine first 5 ingredients. Microwave cream cheese spread in microwaveable bowl on HIGH 1 min. or until completely melted, stirring every 15 sec. Add to ham mixture; mix well. Spoon into 4 (8-oz.) ramekins.\nUnroll pie crust on lightly floured surface; roll to 12-inch circle. Cut into 4 rounds with 5-inch cookie cutter. Cut leaves from about 1/4 of the trimmings with small cookie cutter or sharp knife; discard remaining trimmings.\nBeat egg and water with fork until blended; brush onto top edges of ramekins. Top with pastry rounds; press gently onto top edges of ramekins to seal. Top with leaf cutouts; brush lightly with egg wash. Discard any remaining egg wash. Place ramekins on baking sheet. Cut slits in crusts to vent.\nBake 30 to 32 min. or until golden brown.\n",
        "picture_link": "yEHFRRtIFqsiCuMYyTzWZ5XYqhrIHJm"
    },
    {
        "title": "Chicken Tortilla Bake",
        "ingredients": [
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "1 cup frozen whole kernel corn, thawed ADVERTISEMENT",
            "12 (6 inch) corn tortillas, cut into strips ADVERTISEMENT",
            "3 cups Tyson® Grilled & Ready® Frozen Fajita Chicken Breast Strips ADVERTISEMENT",
            "1 cup shredded Mexican cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. In a medium bowl combine soup, undrained tomatoes, and corn; set aside.\nSprinkle one-third of tortilla strips over bottom of an ungreased 3-quart rectangular baking dish. Spread half of the Grilled & Ready(R) Fajita Chicken Strips over tortilla strips; spoon half of the soup mixture on top. Repeat layers, ending with a layer of tortilla strips.\nBake, covered, 40 minutes or until bubbly around the edges. Uncover; sprinkle with cheese. Bake 5 minutes or until cheese is melted. Let stand 10 minutes before serving.\n",
        "picture_link": "SO6fhVSwkxXvCsUID5WzHLkzTgRBDJK"
    },
    {
        "title": "Herb Crusted Tilapia with Garlic Butter",
        "ingredients": [
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "2 teaspoons roasted garlic, mashed into a paste ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon oregano ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon dried parsley flakes ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 tilapia fillets ADVERTISEMENT",
            "1 teaspoon lemon juice, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Brush a broiler pan with olive oil.\nStir butter and garlic paste together in a bowl. Divide garlic mixture evenly between two bowls, reserving one bowl for serving.\nStir garlic powder, oregano, Italian seasoning, parsley, and salt together in a bowl.\nPlace tilapia fillets on prepared broiler pan; brush each fillet with garlic butter and sprinkle each with Italian seasoning mixture, reserving 1/2 the garlic butter in the bowl and 1/2 the Italian seasoning mixture.\nBroil fillets in the preheated oven for 2 minutes, brush again with garlic butter, and broil for 2 more minutes. Turn fillets over. Brush with garlic butter and sprinkle with remaining Italian seasoning mixture. Broil until tilapia fillets flake easily with a fork, 3 to 5 minutes. Serve with reserved garlic butter and lemon juice.\n",
        "picture_link": "36RJ95eF5mZJhjkftjl/gAcuZ8Flf8e"
    },
    {
        "title": "Low Carb Cheddar and Garlic Cauliflower Mash",
        "ingredients": [
            "1 head cauliflower, chopped ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cauliflower, garlic, and bay leaf in a pot; pour in enough water to cover. Bring mixture to a boil and cook until cauliflower is tender, about 20 minutes. Drain and discard bay leaf.\nTransfer cauliflower and garlic to a blender; add Cheddar cheese, butter, and sour cream. Blend mixture until desired consistency is reached; season with salt and pepper.\n",
        "picture_link": "kYaUU7S5G73NNsn732Vs9PjwxzkXFhC"
    },
    {
        "title": "Sauteed Brussels Sprouts with Bacon and Onions",
        "ingredients": [
            "6 slices lower-sodium bacon ADVERTISEMENT",
            "1/2 large white onion, diced ADVERTISEMENT",
            "30 Brussels sprouts, halved lengthwise ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels, retaining grease in the skillet. Crumble bacon.\nCook and stir onion in the bacon grease over medium heat until translucent, about 5 minutes. Add Brussels sprouts; cook and stir until Brussels sprouts are lightly browned, about 5 minutes. Season Brussels sprouts mixture with salt and pepper.\nSprinkle bacon over Brussels mixture and stir. Remove skillet from heat, transfer Brussels sprouts mixture to a serving bowl, and sprinkle with Parmesan cheese.\n",
        "picture_link": "glwdXBfVyxP8pu.4KvUCRG0bY9YqkdK"
    },
    {
        "title": "Butternut Squash Lasagna",
        "ingredients": [
            "1 butternut squash, halved and seeded ADVERTISEMENT",
            "1 tablespoon olive oil, divided, or as needed ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "7 cups milk, divided ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "2 cups grated Parmesan cheese, divided ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "4 fresh sage leaves, shredded, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package lasagna noodles ADVERTISEMENT",
            "1/4 teaspoon minced fresh ginger ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil.\nPlace squash, cut-side up, on the prepared baking sheet. Cover squash with aluminum foil.\nBake in the preheated oven until squash is tender, 45 minutes to 1 hour 15 minutes.\nHeat 1 1/2 teaspoons olive oil in a skillet over medium heat; cook and stir mushrooms and garlic in the hot oil until mushrooms are tender, 5 to 10 minutes. Remove skillet from heat.\nHeat remaining 1 1/2 teaspoons olive oil in a separate skillet over medium heat; cook and stir onion in the hot oil until softened, about 5 minutes. Add spinach to onion; cook until spinach is heated through, 3 to 5 minutes. Remove skillet from heat.\nHeat 6 cups milk in a 5-quart saucepan over medium heat; cook and stir until milk is simmering, about 5 minutes. Whisk remaining 1 cup milk and cornstarch together in a bowl until smooth; stir into simmering milk. Bring milk mixture to just under a boil, stirring constantly with a wooden spoon and scraping bottom of pot to prevent scorching, until milk mixture has thickened into a sauce, about 5 minutes; remove pot from heat.\nWhisk 1 1/2 cups Parmesan cheese, honey, nutmeg, sage, salt, and pepper into sauce until smooth. Cover pot with a lid and keep warm over low heat.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.\nReduce oven temperature to 375 degrees F (190 degrees C).\nScrape flesh from butternut squash into a bowl; stir with a fork until evenly mashed. Stir ginger, salt, and pepper into mashed butternut squash.\nSpoon about 1 cup white sauce into the bottom of a 9x13-inch baking dish; arrange a layer of noodles atop white sauce. Layer 1/2 butternut squash mixture, 1/5 remaining white sauce, noodles, spinach mixture, 1/5 white sauce, noodles, 1/2 the mozzarella cheese, mushroom mixture, 1/5 white sauce, noodles, remaining 1/2 butternut squash mixture, 1/5 the white sauce, remaining noodles, remaining 1/5 white sauce, remaining mozzarella cheese, 1/2 cup Parmesan cheese, respectively. Cover dish with aluminum foil and place dish on a baking sheet.\nBake in the preheated oven for 30 minutes. Remove cover and bake until bubbling and cheese is browned, about 15 more minutes. Let stand for 10 minutes before serving.\n",
        "picture_link": "gcoatraLM350z0LTpaK92xITSrMM2Ha"
    },
    {
        "title": "Vegan African Stew",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cups chopped yams ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "2 cups chopped cabbage ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "6 tablespoons flaked coconut ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 cups tomato juice ADVERTISEMENT",
            "1 cup apple juice ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a Dutch oven over medium-high heat. Cook and stir yams, onions, cabbage, tomatoes, coconut, and garlic in the hot oil until the vegetables are slightly browned, 7 to 10 minutes.\nPour tomato juice and apple juice into the Dutch oven; season with ginger, cayenne pepper, and salt. Reduce heat to medium-low and cook at a simmer for 1 hour.\nStir bell pepper and peanut butter into the mixture. Cook, stirring regularly, until the peanut butter is melted completely into the soup, about 30 minutes more.\n",
        "picture_link": "2NsCgNAPrbo6JF8.jqYVDNVSSDN2C3G"
    },
    {
        "title": "Sloppy Joe Mamas",
        "ingredients": [
            "1 tablespoon olive oil, or more if needed ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "1/2 cup Mexican-style hot tomato sauce (such as El Pato Salsa de Chile Fresco®) ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons mustard ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Saute onion and garlic in hot oil until browned, 5 to 7 minutes. Add ground beef; cook and stir until the beef is completely browned, 7 to 10 minutes. Drain and discard grease from the skillet. Transfer beef mixture to a slow cooker.\nStir Mexican-style hot tomato sauce, ketchup, brown sugar, Worcestershire sauce, mustard, cider vinegar, and chili powder into the beef mixture.\nCook on Low for 2 hours (or on High for 1 hour).\n",
        "picture_link": "0AbnwOC8CG0xbSWPtbHDBYOQhV9mpEq"
    },
    {
        "title": "Slow Cooker Swiss Steak and Onion",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons dry mustard ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "2 pounds cube steak ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 onion, sliced thin ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 cups beef broth ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons ground paprika ADVERTISEMENT",
            "2 teaspoons ground thyme ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, salt, mustard, and pepper together in a wide, shallow bowl.\nDredge cube steaks in the flour mixture to coat completely.\nHeat oil in a skillet over medium-high heat. Fry steaks until golden brown, 2 to 3 minutes per side; transfer to a slow cooker, reserving drippings in the skillet.\nSaute onion and garlic in the reserved drippings in the skillet until softened, 2 to 3 minutes more; add to the slow cooker. Discard the oil.\nStir beef broth and tomato paste together in a bowl until the paste dissolves into the broth; add tomatoes, Worcestershire sauce, paprika, thyme, and oregano. Pour the broth mixture over the steaks in the slow cooker.\nCook on Low until the meat is tender to the point of falling apart, 6 to 8 hours.\n",
        "picture_link": "dVdj1k69FFF.CLnjVyalvZ8IeGMox3C"
    },
    {
        "title": "Debbie's Vegetable Lasagna",
        "ingredients": [
            "9 lasagna noodles ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup vegetable broth, or as needed ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup light ricotta cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cups coarsely shredded carrots ADVERTISEMENT",
            "2 cups coarsely chopped zucchini ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain.\nPreheat oven to 375 degrees F (190 degrees C).\nMelt margarine in a skillet over low heat; cook and stir flour, salt, and pepper into the melted margarine until smooth and bubbling, 2 to 3 minutes. Add milk and broth into flour mixture, stirring constantly; bring sauce to a boil. Stir wine into sauce and remove from heat. Stir Parmesan cheese into sauce until smooth.\nWhisk ricotta cheese, egg, and egg white together in a bowl.\nHeat olive oil in a skillet over medium-high heat; saute carrots, zucchini, and spinach until just becoming tender, 5 to 10 minutes. Stir vegetable mixture into ricotta mixture.\nLayer 1/3 the lasagna noodles, 1/3 the ricotta-vegetable mixture, and 1/3 the Parmesan sauce in a 9x13-inch baking dish; repeat layering 2 more times with remaining ingredients, ending with a layer of mozzarella cheese.\nBake in the preheated oven until cheese is lightly browned and bubbling, about 30 minutes.\n",
        "picture_link": "CyICIUiWWB2jovLJvpGS2zyRk8dYqMu"
    },
    {
        "title": "Creamy Chicken Manicotti",
        "ingredients": [
            "8 dried manicotti shells ADVERTISEMENT",
            "1/4 cup finely chopped onion ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups whole milk ADVERTISEMENT",
            "1 (6 ounce) package Tyson® Grilled and Ready® Fully Cooked Refrigerated Grilled Chicken Breast Strips, finely chopped ADVERTISEMENT",
            "1/2 cup chopped cooked ham ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 1/4 cups grated Parmesan cheese ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "Ground nutmeg (optional) ADVERTISEMENT",
            "Fresh flat-leaf parsley (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F. Cook pasta according to package directions. Drain and rinse with cold water; drain and set aside.\nFor sauce, in a medium saucepan cook onion in hot butter over medium heat for 4 minutes or until tender but not brown. Stir in flour and salt. Add milk all at once. Cook and stir until thickened and bubbly. Remove from heat; set aside.\nFor filling, in a medium bowl combine Grilled & Ready(R) Grilled Chicken Breast Strips, ham, egg yolk, the 1/2 teaspoon nutmeg, 1 cup of the Parmesan cheese and the ricotta cheese. Pour about 1/2 cup of the sauce into a buttered 2-quart rectangular baking dish; spread in a thin layer over bottom of dish.\nUse a pastry tube fitted with the largest tip to pipe the filling into the cooked manicotti. (Or carefully spoon about 1/3 cup of the filling into each shell.) Arrange the filled manicotti in the baking dish in a single layer. Pour the remaining sauce over the manicotti. Sprinkle the remaining 1/4 cup Parmesan cheese over the sauce.\nBake, uncovered, for 20 minutes or until manicotti are light golden and heated through. Let stand 5 to 10 minutes before serving. If desired, garnish with a sprinkling of ground nutmeg and parsley.\n",
        "picture_link": "3l5j/H2nCVJJX.ugcxu5WxuaeOZPUNO"
    },
    {
        "title": "RITZ Steakhouse Bites",
        "ingredients": [
            "Creamed Spinach: ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 (6 ounce) package baby spinach leaves ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon minced shallots ADVERTISEMENT",
            "1/2 teaspoon nutmeg ADVERTISEMENT",
            "2 tablespoons heavy cream ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "Pinch of black pepper ADVERTISEMENT",
            "Béarnaise Sauce: ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons minced shallots ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "18 RITZ Crackers ADVERTISEMENT",
            "3 ounces thinly sliced, cooked beef tenderloin, but into bite-sized pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in saute pan over medium heat. Add spinach and cover for 1 minute to steam. Uncover and stir spinach until it is wilted. Drain spinach, dry between paper towels, and chop. Melt butter in the same pan over medium heat. Add shallots and saute for a minute. Add heavy cream and nutmeg; stir to combine. Add chopped spinach and combine thoroughly. Remove from heat when spinach is creamy. Add salt and pepper. Set aside.\nMelt 1 tablespoon butter in a separate saute pan; add shallots and white wine vinegar. Cook until all liquid has evaporated, about a minute. Remove from the pan; set aside to cool.\nAdd egg yolk and lemon juice to blender; slowly blend in half cup of melted butter until mixture is smooth and creamy. Pour into shallots mixture. Stir in chopped fresh tarragon.\nTo assemble bites, place about 1-1/2 teaspoons creamed spinach on top of a RITZ Cracker. Place a slice of steak on top of the creamed spinach, then drizzle with about 1-1/2 teaspoon bearnaise sauce over the steak.\n",
        "picture_link": "psasaxX/Q1Luscv3/m2uEI1EzK7i.ES"
    },
    {
        "title": "Gluten Free Protein Pancakes",
        "ingredients": [
            "1/2 cup cottage cheese ADVERTISEMENT",
            "1/2 cup oats ADVERTISEMENT",
            "7 egg whites ADVERTISEMENT",
            "1 drop vanilla extract ADVERTISEMENT",
            "1 serving cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend cottage cheese, oats, egg whites, and vanilla extract together in a blender until smooth.\nSpray a griddle or skillet with cooking spray and place over medium heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "XgzQN3RbGUvw5/pd7GOpmh811bQ12Hy"
    },
    {
        "title": "Salvadorian Baked Fish",
        "ingredients": [
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "2 large whole white fish, butterflied, rinsed, and patted dry ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "2 lemons, thinly sliced ADVERTISEMENT",
            "2 Roma (plum) tomatoes, thinly sliced ADVERTISEMENT",
            "1 Spanish onion, thinly sliced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking dish with 1 teaspoon olive oil.\nRub remaining olive oil over the fish fillets and place into the baking dish. Season fish with garlic powder, salt, and black pepper; top with minced garlic. Drizzle lime juice over the fish. Arrange lemon slices, tomato slices, onion slices, and bell pepper slices atop the fish. Cover baking dish tightly with aluminum foil.\nBake in preheated oven until fish flakes easily with a fork, 30 to 40 minutes.\n",
        "picture_link": "wuUzt16Fcx2AXqG3rWuV.Bgij/lomoa"
    },
    {
        "title": "Green Tea Latte",
        "ingredients": [
            "1 cup soy milk ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon green tea powder (matcha) ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, combine the soy milk, water, green tea powder and sugar. Warm over medium heat while whisking until hot and foamy. Pour into mugs and enjoy.\n",
        "picture_link": "QwA6raXo9jBnxc6j8h085oj8XLFmddy"
    },
    {
        "title": "Cheezy Macaroni and Little Smokies",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 (10.75 ounce) can condensed Cheddar cheese soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons dried minced onion flakes ADVERTISEMENT",
            "1 (16 ounce) package little smokie sausages ADVERTISEMENT",
            "8 ounces processed cheese, cubed ADVERTISEMENT",
            "1 cup frozen diced carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water, bring to a boil, and stir in the macaroni. Return to a boil and cook the pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 8 minutes. Drain well.\nWhisk together the soup, milk, and onion flakes in a large saucepan over medium-low heat. Bring to a simmer, and stir in the sausage links, cheese, and carrots. Bring the mixture back to a boil, stirring frequently, until the cheese has melted and the mixture is bubbling.\nStir in the hot cooked macaroni, and serve.\n",
        "picture_link": "hPGT.8kPThDlhbNTrtxhRQHAGwFUwle"
    },
    {
        "title": "Mochiko Chicken Wings",
        "ingredients": [
            "3 eggs, beaten ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons Hawaiian sea salt ADVERTISEMENT",
            "6 green onions, finely chopped ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 cup cornstarch ADVERTISEMENT",
            "3/4 cup mochiko (glutinous rice flour) ADVERTISEMENT",
            "5 pounds chicken wings or thighs ADVERTISEMENT",
            "Oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together eggs, soy sauce, sugar, sea salt, green onions, and garlic in a large bowl. Sift together the flour, cornstarch, and mochiko; fold into the egg mixture until smooth. Add chicken and mix until well coated. Cover bowl with plastic wrap and refrigerate overnight.\nRemove the chicken from the refrigerator, and mix again to redistribute. Heat a large pot of oil to 350 degrees F (175 degrees C). Deep fry chicken wings until golden brown and cooked through; drain on paper towels.\n",
        "picture_link": "U.lFnjSRr5ljqyOvC4IJZ8SoIW/iLDG"
    },
    {
        "title": "Quinoa Turkey Stuffing",
        "ingredients": [
            "1 cup quinoa, rinsed ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 pound fresh mushrooms, sliced ADVERTISEMENT",
            "2 apples - peeled, cored, and chopped ADVERTISEMENT",
            "1/4 cup pine nuts ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons poultry seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the quinoa and water in a large, microwave-safe bowl; cover. Cook on HIGH for 20 minutes.\nStir the onion, mushrooms, apples, pine nuts, raisins, garlic, salt, pepper, and poultry seasoning in with the quinoa.\nPack lightly into uncooked turkey. Roast turkey as directed.\n",
        "picture_link": "49jqgBmjI8lqopqLIoF493U/4b0YD4i"
    }
]