[
    {
        "title": "Turkey Rub (Poultry Rub)",
        "ingredients": [
            "1 tablespoon dried thyme ADVERTISEMENT",
            "1 tablespoon dried rosemary ADVERTISEMENT",
            "1 tablespoon dried marjoram ADVERTISEMENT",
            "1 teaspoon coarse salt (such as Himalayan) ADVERTISEMENT",
            "3 tablespoons molasses ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grind thyme, rosemary, marjoram, and salt together with a mortar and pestle. Add molasses and mix until well-combined.\n",
        "picture_link": "rYFspWCqrTy3NSSb3nesLpY3fdUUH8q"
    },
    {
        "title": "BaBa's Thousand Island Dressing",
        "ingredients": [
            "2 cups mayonnaise (such as Hellman's®) ADVERTISEMENT",
            "2 hard-cooked eggs, chopped ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons sweet pickle relish ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup ketchup (such as Heinz®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, eggs, Worcestershire sauce, relish, salt, and black pepper together in a bowl until smooth. Whisk in ketchup until desired color and consistency is reached.\n",
        "picture_link": "DVq4Y.A0LC0BAgBvD5p6J2hkBF3emiq"
    },
    {
        "title": "Unleavened Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nMix flour and salt in a large bowl. Make a well in the center of the flour mixture.\nBeat eggs and melted butter together; pour into the well in the flour mixture and mix with a fork until crumbly. Slowly add milk to the flour mixture, using hands to mix the dough into a ball.\nRoll dough into a flat loaf and put onto the prepared baking sheet.\nBake in preheated oven until lightly browning along the edges, 15 to 20 minutes.\n",
        "picture_link": "oY5SrFHhHoHTLjJYts6vE/Mqot11BXe"
    },
    {
        "title": "Slow Cooker Turkey Chili with Kidney Beans",
        "ingredients": [
            "1 1/4 pounds ground turkey ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 Anaheim chile peppers, chopped ADVERTISEMENT",
            "2 (16 ounce) cans kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (16 ounce) can Mexican-style hot tomato sauce ADVERTISEMENT",
            "1/4 cup chili powder ADVERTISEMENT",
            "1/4 cup cornmeal ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 tablespoon dried onion flakes ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried Mexican oregano ADVERTISEMENT",
            "1 teaspoon beef base ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 cup water, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir turkey, onions, and Anaheim chile peppers in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and transfer turkey mixture to a slow cooker.\nMix kidney beans, Mexican-style tomato sauce, chili powder, cornmeal, garlic, onion flakes, cocoa powder, cumin, ground black pepper, sugar, parsley, oregano, beef base, red pepper flakes, and coriander into turkey mixture. Add enough water to reach desired consistency.\nCook on High for 4 hours (or on Low for 8 to 10 hours).\n",
        "picture_link": "HjHyfkM56vWniV6/4E0Li7RH.BtPVyK"
    },
    {
        "title": "Real Food Orange Cream Ice Pops",
        "ingredients": [
            "1 cup freshly squeezed orange juice ADVERTISEMENT",
            "1 cup canned coconut milk ADVERTISEMENT",
            "3 tablespoons raw honey ADVERTISEMENT",
            "1/2 teaspoon pure vanilla extract ADVERTISEMENT",
            "6 wooden pop sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk orange juice, coconut milk, honey, and vanilla extract together in a large measuring cup or bowl with a spout. Pour mixture into ice pop molds or small paper cups; add wooden pop sticks.\nPlace in freezer until solid, 8 hours to overnight.\n",
        "picture_link": "LVJe4QMzwsEhG4ijRVgB/KyIBi19.vq"
    },
    {
        "title": "Green Dragon Veggie Juice",
        "ingredients": [
            "1/4 large lemon ADVERTISEMENT",
            "1 cup fresh spinach, or to taste ADVERTISEMENT",
            "2 sprigs fresh parsley, or more to taste ADVERTISEMENT",
            "2 stalks celery ADVERTISEMENT",
            "1/3 small jalapeno pepper (optional) ADVERTISEMENT",
            "1 tomato, quartered ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup ice, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process lemon, spinach, parsley, celery, jalapeno pepper, and tomato, respectively, through a juicer. Season juice with salt.\nFill a glass with ice and add juice.\n",
        "picture_link": "csXXfWpz1fZ2vWJOSondYT0peg7/3gu"
    },
    {
        "title": "Easy Breakfast Strata",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "1 quart fat free half-and-half ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "6 slices whole grain bread ADVERTISEMENT",
            "2 cups chopped fresh spinach ADVERTISEMENT",
            "2 cups ham cubes ADVERTISEMENT",
            "1/2 cup thinly sliced green onions ADVERTISEMENT",
            "1 (8 ounce) package shredded fat-free sharp Cheddar cheese ADVERTISEMENT",
            "6 slices whole grain bread, cut into cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Prepare a 13x9-inch baking dish with cooking spray. Put an oven rack in the middle tier of the oven.\nBeat eggs, half-and-half, and black pepper together in a bowl until smooth.\nArrange 6 bread slices into the bottom of the prepared baking dish. Spread about half the ham and half the spinach over the bread. Sprinkle half the green onions and half the Cheddar cheese over the ham and spinach. Spread the bread cubes over the layers and pour 1 cup of the egg mixture over everything. Repeat layering of ham, spinach, green onions, and Cheddar cheese and pour remaining egg mixture over the top.\nCover dish with plastic wrap. Put some soup cans atop the plastic wrap to help keep ingredients immersed in liquid; refrigerate at least 15 minutes.\nBake in preheated oven until the liquid sets in the middle of the dish, about 50 minutes. An instant-read thermometer inserted into the center should read 155 degrees F (68 degrees C). Let the casserole stand for 8 to 10 minutes before serving.\n",
        "picture_link": "9/2Gngt6yOTbjIVsagSqeRbftDNpKI."
    },
    {
        "title": "Easter Bunny 'Butt' Cake",
        "ingredients": [
            "1 (15.25 ounce) package yellow cake mix (such as Duncan Hines®) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 pound flaked coconut, or more as needed, divided ADVERTISEMENT",
            "3 drops red food coloring, or as needed ADVERTISEMENT",
            "3 drops green food coloring, or as needed ADVERTISEMENT",
            "2 marshmallows, halved lengthwise ADVERTISEMENT",
            "1 (16 ounce) container ready-to-use pink frosting, or more as needed ADVERTISEMENT",
            "3 tablespoons ready-to-use white frosting, or as needed ADVERTISEMENT",
            "1 pink fruit rolls (such as General Mills® Fruit Roll-Ups) ADVERTISEMENT",
            "pink paper bunny ears ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 muffin cups. Grease and flour an oven-proof glass or ceramic bowl.\nBeat cake mix, water, vegetable oil, and eggs together in a bowl with an electric mixer on low speed until just-moistened. Increase mixer speed to medium and beat until batter is smooth, about 2 minutes. Fill prepared muffin cups with batter; pour remaining batter into prepared oven-proof bowl.\nBake cupcakes in the preheated oven until golden and the tops spring back when lightly pressed, 18 to 21 minutes. Let cupcakes cool briefly in the muffin tin before transferring to a wire rack to cool completely.\nBake cake in the preheated oven until golden and a skewer inserted into the center of the cake comes out clean, 33 to 45 minutes. Let cake rest in the bowl for 10 to 15 minutes before transferring to a wire rack to cool completely. Transfer cooled cake to a serving platter.\nPlace 2/3 of the coconut into a resealable plastic bag; add red food coloring, seal the bag, and shake until coconut is shaded pink. Repeat process until coconut is your desired shade of pink.\nMeasure out about 1/2 cup of remaining coconut and place in a bowl. Pour remaining coconut into another resealable plastic bag; add green food coloring, seal the bag, and shake until coconut is shaded green. Repeat process until coconut is your desired shade of green.\nSecure 2 cupcakes, tops against the cake, with toothpicks to one end of the cake to form bunny \"feet.\" Place 2 marshmallow halves, cut-side down, on top of each cupcake to complete each \"foot.\" Secure remaining cupcake, top-side against the cake, with a toothpick to the top of the cake to create the \"tail.\"\nSpread pink frosting over cake and \"feet\", excluding the \"tail.\" Cover pink frosting with pink coconut. Spread white frosting over the \"tail\" and cover with reserved white coconut.\nCut fruit roll to form 2 small ovals and 6 smaller circles. Using frosting as \"glue,\" secure 1 oval and 3 circles to each \"foot\" to resemble foot pads. Secure paper bunny ears to the serving plate at the front of the bunny cake using frosting. Sprinkle green coconut around the cake to resemble grass.\n",
        "picture_link": "Wz6JqB/0ExAOH8W0GFPERudAj4LU3OG"
    },
    {
        "title": "Vegetable Steamed Tilapia",
        "ingredients": [
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "6 tilapia fillets ADVERTISEMENT",
            "4 stalks celery, halved lengthwise and crosswise ADVERTISEMENT",
            "1 cup fresh baby carrots ADVERTISEMENT",
            "1 bell pepper, cut into chunks ADVERTISEMENT",
            "1/2 red onion, sliced ADVERTISEMENT",
            "1 pinch Greek seasoning, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil and oil lightly with olive oil.\nArrange tilapia fillets onto prepared baking sheet. Place celery, carrots, bell pepper, and red onion on top of fillets. Season with Greek seasoning, salt, and black pepper. Lay a sheet of aluminum foil over the top and fold edges together to seal the packet.\nBake in the preheated oven until fish flakes easily with a fork, about 20 minutes.\n",
        "picture_link": "CcDrKeyCUccd56Kb5GkyX57cdHrFSYu"
    },
    {
        "title": "Citrus Honey Brined Smoked Turkey",
        "ingredients": [
            "1 gallon hot water ADVERTISEMENT",
            "1 pound kosher salt ADVERTISEMENT",
            "2 quarts vegetable broth ADVERTISEMENT",
            "2 (8 ounce) jars honey ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 (7 pound) bag of ice cubes ADVERTISEMENT",
            "1 (15 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1 Granny Smith apple, cored and cut into large chunks ADVERTISEMENT",
            "1 stalk celery, cut into chunks ADVERTISEMENT",
            "1 small onion, cut into chunks ADVERTISEMENT",
            "1 orange, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix hot water and kosher salt in a 54-quart cooler, stirring until the salt dissolves. Mix in vegetable broth, honey, and orange juice. Pour in the ice cubes, place the turkey into the brine with breast side up, and close the cooler lid. Place the cooler in a cold place and let the turkey marinate overnight or up to 12 hours. Brine temperature must stay colder than 40 degrees F (4 degrees C).\nRemove turkey from brine, discard brine, and dry the turkey thoroughly with paper towels. Mix vegetable oil with poultry seasoning in a bowl, and rub the turkey with the mixture. Place apple, celery, onion, and orange pieces into the cavity of the turkey.\nPreheat an outdoor grill to 400 degrees F (205 degrees C) for indirect heat and lightly oil the grate. Build a 'smoke bomb' by placing about 1 cup of hickory or cherry wood chips into the middle of a 12x12-inch doubled piece of aluminum foil. Gather up the edges of the foil to make a pouch and leave the pouch open at the top. Set the smoke bomb directly onto the coals if grilling with charcoal, or onto the flame bar of a gas grill.\nSet the turkey onto the grill in position for indirect heat, insert a probe thermometer into the thickest part of the turkey breast, not touching a bone, and close the grill. Set the probe thermometer for 160 degrees F (70 degrees C).\nGrill turkey for 1 hour and check the bird; if skin is already golden brown, cover the breast, legs, and wings with aluminum foil. Replace the smoke bomb with a new one; close cover and continue to grill until probe thermometer registers 160 degrees F (70 degrees C), 2 to 3 more hours. Remove the fruit and vegetable pieces from the cavity, cover turkey with aluminum foil, and let rest for 1 hour before carving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Luscious Blueberry Pie Perfection!",
        "ingredients": [
            "2 cups coarse gingersnap cookie crumbs ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 1/2 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "4 cups fresh blueberries, divided ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Move a rack to the center of the oven and preheat oven to 350 degrees F (175 degrees C).\nStir gingersnap crumbs with light brown sugar and melted butter in a bowl until thoroughly combined. Press the mixture into the bottom and up the sides of a 9-inch pie dish.\nBake the crust on the center rack of the preheated oven just until set, 3 to 4 minutes. Baking too long will make the crust hard to cut. Remove the crust and let cool.\nStir cornstarch and water in a saucepan until smoothly mixed; add sugar and 1 1/2 cups blueberries. Bring to a boil over medium heat, stirring until the blueberry sauce is thickened, 1 to 2 minutes. Remove from heat and stir in remaining 2 1/2 cups blueberries and lemon juice.\nPour filling into the gingersnap crust and refrigerate until chilled and set, at least 1 hour.\n",
        "picture_link": "LuVi9iqyjk23XidlRJTqJ9xmsY.Xz32"
    },
    {
        "title": "Fresh Strawberry Lemon Shortcake",
        "ingredients": [
            "1 1/2 cups sliced fresh strawberries ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 tablespoons 2% milk ADVERTISEMENT",
            "1 egg yolk, beaten ADVERTISEMENT",
            "3/4 teaspoon lemon zest ADVERTISEMENT",
            "1/4 cup nonfat plain yogurt ADVERTISEMENT",
            "1/4 cup reduced-fat sour cream ADVERTISEMENT",
            "1 tablespoon agave nectar ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine strawberries and 2 tablespoons sugar in a bowl; cover and refrigerate until ready to serve.\nPreheat oven to 400 degrees F (200 degrees C).\nCombine flour, 2 tablespoons sugar, baking powder, and salt in a bowl. Cut in butter with a knife or pastry blender until mixture resembles coarse crumbs. Whisk milk, egg yolk, and 3/4 teaspoon lemon zest in another bowl; stir into crumb mixture until dough is moistened. Turn dough out onto a lightly floured surface and knead 10 turns. Divide dough in half; pat or roll out into a 3/4-inch thick round. Transfer rounds to a baking sheet.\nBake in preheated oven until golden brown, 8 to 10 minutes. Remove to cool on a wire rack for 15 minutes. Split each shortcake in half horizontally.\nMix yogurt, sour cream, agave nectar, and 1/2 teaspoon lemon zest in a bowl; set aside. Beat whipping cream in another bowl until foamy. Add 1 teaspoon sugar, continuing to beat cream until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks.\nArrange cake bottoms on dessert plates and evenly spread with yogurt mixture. Top each cake with 1/4 of the strawberries and 1/4 of the whipped cream. Place the cake tops over the whipped cream and cover with remaining strawberries and whipped cream.\n",
        "picture_link": "eI8LZoPo6wiTObk6/APTQjxlKoMBQFy"
    },
    {
        "title": "Fried Squash Blossoms",
        "ingredients": [
            "12 zucchini blossoms ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup Italian bread crumbs ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and ground black pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently dip zucchini blossoms in beaten egg and shake off the excess. Press into flour; coat with bread crumbs. Place breaded blossoms on a plate; do not stack.\nHeat olive oil in a large frying pan over medium-high heat. Fry blossoms, working in batches, until both sides are golden brown, about 5 minutes each side. Season with salt and black pepper.\n",
        "picture_link": "QzakstNHxHhwPpcTNoGQmfLPV7vz5jO"
    },
    {
        "title": "Baked French Toast by Marzetti®",
        "ingredients": [
            "1 cup Marzetti's® Old Fashioned Caramel Dip ADVERTISEMENT",
            "3 Granny Smith apples, peeled, cored, and diced into 1/2-inch thick pieces ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "1 medium loaf Italian bread (4 inches in diameter) sliced into 1-inch thick pieces ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a microwave safe bowl, combine apples, cinnamon and water. Microwave for 3-4 minutes. The apples should be slightly tender.\nDrain apples and toss with Marzetti Old Fashioned Caramel Dip. Spoon the apples into bottom of greased 9x13 baking dish.\nIn a mixing bowl, whisk together eggs, milk and vanilla.\nDip each piece of bread into egg mixture and place on top of apple layer. Repeat with remaining bread slices. Spoon any extra egg mixture over bread. Cover with plastic wrap and Refrigerate for 3 hours or overnight.\nPreheat oven to 350 degrees F.\nPour melted butter over the slices of bread and sprinkle with pecans.\nBake 25-30 minutes or until bread is golden brown.\nAllow French toast to stand for a few minutes before eating. Serve with extra warm caramel sauce.\n",
        "picture_link": "PMeCJkvIMEoszJluOKah951QY6VoBWa"
    },
    {
        "title": "Peach-Jalapeno Barbeque Sauce",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 (15 ounce) can sliced peaches, drained ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup canned diced jalapeno peppers ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons liquid smoke flavoring ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir garlic until fragrant and lightly browned, 3 to 5 minutes.\nBlend garlic, peaches, ketchup, vinegar, jalapeno peppers, Worcestershire sauce, brown sugar, liquid smoke flavoring, onion powder, mustard powder, and black pepper in a blender until smooth.\n",
        "picture_link": "k2nDFqG87G5n6nJt9WqlqpqQfUUALj."
    },
    {
        "title": "Vanilla Almond Protein Shake",
        "ingredients": [
            "1/2 cup ice ADVERTISEMENT",
            "1 tablespoon sliced almonds ADVERTISEMENT",
            "1 cup water, divided ADVERTISEMENT",
            "2/3 cup powdered non-fat milk ADVERTISEMENT",
            "1 teaspoon fat-free, sugar-free vanilla pudding mix (such as Jell-o®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice, almonds, and 1/4 cup water in a blender until the almonds have been pulverized. Add remaining water, powdered milk, and pudding mix; continue blending until smooth.\n",
        "picture_link": "lc6a0HzNjho/S4tSM1mEhavjeGy1s36"
    },
    {
        "title": "Raspberry Cherry Compote",
        "ingredients": [
            "2 cups raspberries ADVERTISEMENT",
            "2 cups cherries, pitted and diced ADVERTISEMENT",
            "1/4 cup evaporated cane juice ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon port wine ADVERTISEMENT",
            "1/4 cup tapioca flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir raspberries, cherries, cane juice, and cinnamon together in a saucepan over medium-heat; bring to a boil, stirring frequently. Reduce heat to low, cover the saucepan, and continue cooking until the berries are tender and juicy, about 15 minutes.\nRemove the saucepan from heat. Stir port wine through the berry mixture; gradually add tapioca flour, while stirring, until dissolved completely into the compote.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Southern Pecan Bars",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/3 cup margarine ADVERTISEMENT",
            "1/2 cup brown sugar, packed ADVERTISEMENT",
            "1/4 cup finely chopped pecans ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup dark corn syrup ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup coarsely chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nSift 1 1/2 cup flour with baking powder in a bowl. Cream margarine with 1/2 cup brown sugar in a separate large bowl, beating mixture until smooth. Stir flour mixture into creamed butter mixture and stir in 1/4 cup finely chopped pecans. Press the crust into the bottom of the prepared baking pan.\nBake crust in the preheated oven until hot, about 10 minutes.\nWhisk eggs until foamy in a bowl; stir in dark corn syrup, 1/4 cup brown sugar, 3 tablespoons flour, salt, and vanilla extract. Whisk until the mixture is smoothly combined; pour over prebaked crust. Sprinkle with 3/4 cup pecans and return to oven.\nReturn to oven and bake until the topping is set, 25 to 30 minutes. Cool in the pan before cutting into bars.\n",
        "picture_link": "dFOe9lBroCwrdAP3cL9Icp8tO37opSG"
    },
    {
        "title": "Yogurt Artichoke Dip",
        "ingredients": [
            "1 cup low-fat plain yogurt ADVERTISEMENT",
            "1/2 cup chopped artichoke hearts ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix yogurt, artichoke hearts, garlic powder, basil, and parsley together in a bowl.\nRefrigerate 1 hour before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Slow Cooked Ribs",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 racks baby back pork ribs ADVERTISEMENT",
            "1 teaspoon grill seasoning, or to taste ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "3 tablespoons packed brown sugar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a large baking pan with aluminum foil and spray with cooking spray.\nPlace ribs onto the prepared baking sheet. Season both sides with grill seasoning.\nBake ribs in the preheated oven for 30 minutes; flip ribs over and bake an additional 15 minutes. Cut ribs apart and place into a slow cooker.\nMix ketchup, brown sugar, Worcestershire sauce, Dijon mustard, and garlic in a bowl until thoroughly combined; pour sauce over ribs. Stir to coat. Cook ribs on Low until tender, 4 to 6 hours; stir occasionally.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Asian Vegetable Roll",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 spaghetti squash, halved and seeded ADVERTISEMENT",
            "1/4 cup broccoli florets, chopped ADVERTISEMENT",
            "1 1/2 cups spinach leaves ADVERTISEMENT",
            "4 (10 inch) flour tortillas ADVERTISEMENT",
            "1 teaspoon miso paste ADVERTISEMENT",
            "1/4 cup olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat a baking sheet with cooking spray.\nPlace spaghetti squash half cut-side down on the prepared baking sheet.\nBake until the squash is tender and the flesh shreds easily, about 40 minutes. Shred strands of flesh from rind and place in bowl.\nPlace broccoli in a steamer basket over a pan of boiling water. Steam until tender, about 8 minutes. Add spinach to steamer basket for last 2 minutes. Place broccoli and spinach in separate bowls.\nSpread 1/4 teaspoon miso paste down the center of each tortilla. Place 2 tablespoons of spaghetti squash, 1 tablespoon of spinach, and 1 tablespoon of broccoli florets over the miso paste down the center of the tortillas. Fold up the sides of the tortillas around the filling, then fold up the ends to enclose the filling.\nHeat 1/4 cup of olive oil in a skillet over high heat.\nPlace one rolled tortilla, seam side down, in the frying pan. Gently press the tortilla with a spatula. Cook until the tortilla is golden brown, about 2 or 3 minutes per side, turning once. Fry the remaining tortillas in the same manner, adding olive oil as needed.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peppy Pear Preserves",
        "ingredients": [
            "3 pounds pears - peeled, cored, and chopped ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "1/2 cup chopped crystallized ginger ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "2 teaspoons minced fresh ginger ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chopped pears with sugar, crystallized ginger, lemon juice, fresh ginger, and lemon zest in a large heavy pot; let the mixture stand for 2 hours for pears to release their juice. Place the pot over medium-high heat, bring to a boil; cook, stirring often, until preserves are thick and fall off a metal spoon in sheets, 45 minutes to 1 hour. Pear pieces will be translucent and preserves will be darkened.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the pear preserves into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Fig and Prosciutto Pasta Sauce",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "6 thin slices prosciutto, cut into thin strips ADVERTISEMENT",
            "6 fresh figs, stemmed and quartered ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1/4 teaspoon lemon pepper seasoning, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a saucepan over low heat; gradually stir flour into melted butter until smooth and bubbly, 2 to 4 minutes. Add salt; stir to combine. Remove from heat; gradually stir in milk until smooth.\nReturn white sauce to stovetop; bring to a boil. Reduce heat and simmer over low heat.\nCook and stir prosciutto and figs in a non-stick pan over medium heat until warm, about 5 minutes. Stir lemon zest and lemon pepper seasoning into the white sauce. Serve figs and prosciutto atop sauce.\n",
        "picture_link": "mBzbkxlMr/7Y66G8wtaZTt3N6YHCiTC"
    },
    {
        "title": "Crunchy Pea and Water Chestnut Salad",
        "ingredients": [
            "1 (10 ounce) package frozen peas ADVERTISEMENT",
            "1 cup shredded carrots ADVERTISEMENT",
            "1 (8 ounce) can sliced water chestnuts, drained ADVERTISEMENT",
            "2 green onions, sliced ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 clove garlic, smashed ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1/4 cup mayonnaise (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place frozen peas in a colander; rinse under hot water to thaw. Drain.\nMix peas, carrots, water chestnuts, and green onions together in a bowl.\nWhisk vegetable oil, red wine vinegar, soy sauce, garlic, sugar, paprika, and dry mustard together in a separate bowl; pour over pea mixture. Marinate salad for at least 1 hour.\nStir mayonnaise into salad just before serving.\n",
        "picture_link": "JId3G8Cc5bB4iO0Lz2ba96rEGdcsuGq"
    },
    {
        "title": "Sweet Island Teriyaki Sauce",
        "ingredients": [
            "1/2 cup light soy sauce ADVERTISEMENT",
            "1/4 cup sake ADVERTISEMENT",
            "1/4 cup minced fresh pineapple ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1/4 teaspoon fish sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine soy sauce, sake, pineapple, honey, white sugar, garlic, ginger, and fish sauce in a saucepan over medium heat; cook and stir until just boiling, about 7 minutes. Remove from heat, cool, and store in refrigerator.\n",
        "picture_link": "aiDNGcPpEPNnjzxeY0uytQuTl11teIS"
    },
    {
        "title": "Low Carb Broccoli Soup",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 pounds broccoli, chopped ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "5 cups vegetable broth ADVERTISEMENT",
            "1/4 cup freshly squeezed lemon juice ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat; once the oil is hot, reduce heat to low. Cook and stir onion and garlic in hot oil until softened, 3 to 5 minutes. Add broccoli, season with salt and pepper, and stir. Pour vegetable broth and lemon juice into the pot.\nLoosely cover the pot and simmer the mixture until the broccoli is tender, about 25 minutes. Puree with an immersion blender until smooth. Garnish with Cheddar cheese to serve.\n",
        "picture_link": "0Q5eToPjCtHaYpaXQw1kYWUp4enaPp2"
    },
    {
        "title": "Chai Latte Creme Brulee",
        "ingredients": [
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1 vanilla bean, split and scraped ADVERTISEMENT",
            "4 chai tea bags ADVERTISEMENT",
            "1 extra large egg ADVERTISEMENT",
            "4 extra large egg yolks ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/4 cup white sugar, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk cream, half-and-half, scraped vanilla seeds, and vanilla pod in a saucepan. Place over medium heat and bring just to a boil. Remove from heat and add chai tea bags to the cream mixture; cover and let steep for 15 minutes. Squeeze tea bags and discard; discard spent vanilla bean pod.\nPreheat oven to 300 degrees F (150 degrees C).\nWhisk egg, egg yolks, and 1/2 cup sugar in a bowl until smooth. Slowly whisk in cream mixture, followed by cinnamon, cardamom, cloves, nutmeg, and allspice.\nSpoon cream mixture into 6 6-ounce ramekins. Bring a pot of water to a boil. Place ramekins in a baking pan and carefully pour enough boiling water into the pan to reach halfway up the sides of the ramekins.\nBake in the preheated oven until the desserts are softly set, 35 to 40 minutes. Remove ramekins from the water bath and refrigerate for 4 hours to overnight.\nSprinkle each dessert with about 1 1/2 teaspoon sugar in an even layer. Use a kitchen torch to lightly brown and caramelize the sugar, about 1 minute; let the hot topping cool and harden before serving.\n",
        "picture_link": "r6l0lfEFE0qxnRWG8mDjbQ3NkMhggzi"
    },
    {
        "title": "Mamma K's Fig Preserves with a Twist",
        "ingredients": [
            "3 cups fresh figs, stemmed and quartered ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 lemon, thinly sliced and seeds removed ADVERTISEMENT",
            "2 (3 ounce) packages strawberry-flavored Jell-O® mix ADVERTISEMENT",
            "3 1-pint canning jars with lids and rings, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix figs, sugar, lemon slices, and strawberry gelatin in a large pot. Let stand for 1 hour. Bring to a boil and cook over medium heat, stirring often to prevent burning, until foam has disappeared and the preserves are thickened, 25 to 40 minutes.\nSterilize jars and lids in boiling water for at least 5 minutes. Pack the fig preserves into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area, and wait at least 2 days before opening.\n",
        "picture_link": "av6ZJVdtteqQx/L9HiP7LJZ/HOAC.kS"
    },
    {
        "title": "Cheesy Italian Bread Wedges",
        "ingredients": [
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 (1 ounce) packages dry Italian-style salad dressing mix ADVERTISEMENT",
            "1 teaspoon dried oregano, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "1 cup shredded Colby-Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast and sugar in warm water in a bowl. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes.\nCombine yeast mixture with vegetable oil, salt, and half the flour in a large mixing bowl; stir mixture until no dry spots remain. Stir in remaining flour, 1/2 cup at a time, mixing well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\nPlace dough in a large, lightly-oiled bowl and turn to coat. Cover with a towel and let rise in a warm place until doubled in volume, about at least 2 hours.\nPreheat oven to 400 degrees F (200 degrees C).\nPlace risen dough into an 8x8-inch square baking pan. Cover the top of the dough with Italian salad dressing mix and sprinkle loaf with oregano, black pepper, and red pepper flakes.\nBake in preheated oven until the top is golden brown and the bottom of loaf sounds hollow when tapped, about 30 minutes. About 5 minutes before bread is finished baking, sprinkle the loaf with Colby-Monterey Jack cheese; bake until cheese has melted. Cut into wedges and serve warm.\n",
        "picture_link": "e5EE6GgeYIPhKhVPxQidU45HgIFLN/u"
    },
    {
        "title": "Blueberry Mojito Tea Bread",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat pastry flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 1/2 teaspoons baking powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup sucanat ADVERTISEMENT",
            "1/2 cup grapeseed oil ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 1/2 teaspoons rum flavored extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 lime, zested ADVERTISEMENT",
            "1 tablespoon minced fresh spearmint ADVERTISEMENT",
            "2 cups fresh blueberries ADVERTISEMENT",
            "1 tablespoon turbinado sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour 2 3x7-inch loaf pans. Whisk together the all-purpose flour, whole wheat flour, salt, and baking powder in a mixing bowl; set aside.\nBeat the eggs, sugar, sucanat, grapeseed oil, half-and-half cream, rum extract, vanilla extract, lime zest, and spearmint with an electric mixer in a large bowl until smooth. Stir in the flour mixture until just moistened, then stir in the blueberries, and pour into the prepared loaf pans. Sprinkle the tops evenly with the turbinado sugar.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "aUsx3LCU6Hio3QqlU1K5r5VAjQYe2Wq"
    },
    {
        "title": "Traditional Cured Fish (Umai)",
        "ingredients": [
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 fresh red chile pepper, finely chopped ADVERTISEMENT",
            "1 tablespoon grated lime zest ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "2 skinned red snapper fillets, cut into thin strips ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the yellow onion, red onion, ginger, chile pepper, lime zest, and lime juice in a glass or ceramic bowl. Gently stir in the red snapper, and season to taste with salt. Cover and refrigerate until the snapper turns white and opaque, about 15 minutes. Serve cold.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mango Tango Sorbet",
        "ingredients": [
            "2 mangos - peeled, seeded and diced ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 lime, juiced and zested ADVERTISEMENT",
            "1 orange, juiced and zested ADVERTISEMENT",
            "2 cups tangerine juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the mango pieces and sugar into a blender. Puree until smooth. Add the lime and orange zest and juices along with the tangerine juice. Puree until evenly blended. Pour into a container, and refrigerate at least 1 hour, preferably overnight.\nPour the chilled mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Transfer ice cream to a one- or two-quart lidded plastic container; cover surface with plastic wrap and seal. For best results, sorbet should ripen in the freezer for at least 2 hours or overnight.\n",
        "picture_link": "KFo4SUGGNUMPWL5ASpCWEknFkzfvLBm"
    },
    {
        "title": "Lamb Spaghetti",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 pounds ground lamb ADVERTISEMENT",
            "1 whole head garlic, peeled and crushed ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "4 small potatoes, peeled and cut into 1/2-inch dice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet and cook and stir the ground lamb, garlic, and onion powder until the lamb is no longer pink, breaking the meat apart as it cooks. Stir in lemon juice, cinnamon, and oregano; continue to cook, stirring occasionally, until all the liquid in the skillet evaporates and the lamb and garlic are very well browned, about 20 minutes.\nPour in the water and potatoes, bring the mixture to a boil, and reduce heat to medium-low. Simmer until the potatoes are very tender and beginning to break apart, about 20 minutes. Mash potatoes with a spoon against the side of the skillet to help them thicken the sauce. Season to taste with salt and pepper. Simmer until the gravy is thickened and the flavors have blended, about 10 more minutes (1 hour total). Stir occasionally during cooking.\nBring a large pot of lightly salted water to a rolling boil; cook the linguine in the boiling water until cooked through, but still firm to the bite, about 11 minutes. Drain. Transfer the cooked pasta to plates and top with lamb gravy.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Soju Pork Chops",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 pork chops ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1/4 onion, sliced ADVERTISEMENT",
            "1/2 cup Korean soju ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil and butter in a skillet over high heat. Season the pork chops with salt and pepper, then place in the skillet in the hot oil; cook until browned on both sides, about 3 minutes per side. Reduce heat to medium and continue cooking until the pork is no longer pink in the center, about 6 minutes more. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\nRemove pork chops from the skillet, and set aside. Add the sliced onion to the skillet; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the lemon juice and soju, scraping up any brown bits from the bottom of the skillet. Simmer until liquid as reduced, about 2 minutes. Season with salt and pepper, and drizzle the sauce over the pork chops for serving.\n",
        "picture_link": "eIghsbUh/xqgQeXW9KfXTohM/ee4nuC"
    },
    {
        "title": "Tofu with Gorgonzola and Pesto",
        "ingredients": [
            "1 (12 ounce) package firm tofu ADVERTISEMENT",
            "1 pint cherry tomatoes, halved ADVERTISEMENT",
            "1/2 cup prepared basil pesto sauce ADVERTISEMENT",
            "1 cup crumbled Gorgonzola cheese ADVERTISEMENT",
            "1/2 cup chopped fresh basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain the tofu and slice horizontally into 4 slices. Pat each slice dry and place on a serving plate. Divide the tomatoes evenly amongst the tofu portions. Top each with about 2 tablespoons of basil pesto and 1/4 cup of Gorgonzola cheese. Garnish with fresh basil leaves. Serve cold.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mint-Orange Terrine",
        "ingredients": [
            "9 medium oranges ADVERTISEMENT",
            "2 1/2 cups orange juice ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "4 teaspoons unflavored gelatin ADVERTISEMENT",
            "3 tablespoons chopped fresh mint ADVERTISEMENT",
            "1 tablespoon chopped fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grate the rind from two of the oranges into a saucepan and set aside. Cut away the skin and white pith from all of the oranges. Cut into thin slices, discarding any seeds, and reserving any juice. Pour the orange juice into the saucepan along with the honey, and gelatin; stir over medium heat until the gelatin dissolves.\nMake a thin layer of orange slices on the bottom of an 8x4 inch loaf pan, and sprinkle with some of the 3 tablespoons of chopped mint; alternate layers of orange slices and mint until used up. Slowly pour the hot orange juice over the oranges. Tap the pan lightly to remove any air pockets. Chill overnight until firm, unmold, and cut into thick slices; garnish with 1 tablespoon of mint.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Zola's Adventure Garlic Bread",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "2 cups trail mix with dried cranberries, without chocolate pieces ADVERTISEMENT",
            "1 cup real maple syrup ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 (1 pound) loaf round focaccia bread, cut in half horizontally ADVERTISEMENT",
            "2/3 cup freshly grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1/2 cup of butter in a saucepan over medium heat. Add the onion; cook and stir until deep brown, about 15 minutes. Stir in the maple syrup and trail mix. Heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup drizzled from a spoon forms hard, brittle threads. Pour onto parchment paper, and allow to cool.\nPreheat the oven's broiler.\nIn a small bowl, stir together the remaining butter and garlic. Spread onto the cut side of the focaccia bread halves. Crumble the candied trail mix and onion over the garlic butter, and top with Romano cheese. Place the focaccia onto a baking sheet.\nBroil for 3 to 5 minutes, or until golden brown. Cut into wedges to serve.\n",
        "picture_link": "1wgtAv0iHfFXYpw0ZZ9wRIEQ6PPIbgq"
    },
    {
        "title": "Apple Citrus Pie",
        "ingredients": [
            "1 double crust ready-to-use pie crust (such as Pillsbury®) ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "5 seedless oranges, thinly sliced ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "4 Macintosh apples - peeled, cored, and thinly sliced ADVERTISEMENT",
            "3 tablespoons melted butter, divided ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9 inch pie pan with one of the pie crusts, and chill at least 20 minutes before baking to prevent shrinkage. Preheat oven to 400 degrees F (205 degrees C). Line pastry with a double layer of aluminum foil and a layer of pie weights or dried beans. Bake in the preheated oven until edge of crust is golden, about 10 minutes. Carefully remove the foil and weights and bake until the crust has set, about 5 minutes more. Let cool.\nBring the water and honey to a boil in a saucepan over high heat. Stir in the orange slices, then reduce heat to medium-low. Cover and simmer 30 minutes, then drain, reserving the orange slices. Combine the brown sugar, cinnamon, and ginger in a mixing bowl. Toss the apples with the sugar mixture; set aside.\nSpread 1/3 of the orange slices into the bottom of the pie crust, then top with 1/3 of the sweetened apples. Form 4 more layers with the apples and oranges, then place the second pie crust on top of the pie. Crimp the edges, then cut 3 slits into the top of the pie. Brush the crust with half of the melted butter.\nBake in the preheated oven until the top crust is flaky and golden, about 1 hour. Remove the pie from the oven, and brush with the remaining butter; sprinkle with confectioners' sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Instant Tomato Chutney",
        "ingredients": [
            "4 large ripe tomatoes, chopped ADVERTISEMENT",
            "2 teaspoons dry mustard powder ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "2 cloves garlic, peeled (optional) ADVERTISEMENT",
            "1 teaspoon fenugreek seeds ADVERTISEMENT",
            "2 dried red chile peppers ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 teaspoon chili powder (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a microwave-safe dish, combine the tomatoes, mustard powder, turmeric, garlic, fenugreek, chilies, salt, oil and chili powder. Cook on high power for 3 minutes, or until tomatoes are hot and wilted. Remove the garlic cloves and dried chilies, mix well and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Homemade Bacon",
        "ingredients": [
            "3 pounds whole pork belly ADVERTISEMENT",
            "1 tablespoon smoked paprika ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C).\nSeason pork belly with paprika, salt, and pepper. Tightly wrap pork twice in heavy-duty aluminum foil. Place on a baking sheet and bake in the preheated oven for 2 1/2 hours. Turn off the oven; let pork rest in the oven for 1 hour. Remove meat from oven, leaving it wrapped in aluminum foil, and refrigerate at least 8 hours or overnight.\nRemove pork from foil and slice across the grain in 1/4-inch thick slices. Working in batches, cook pork in a non-stick skillet over medium heat until golden and crisped, 6 to 8 minutes per slice.\n",
        "picture_link": "uBnaNDoBAYc4utPFbKNvVcXfGUdWeI2"
    },
    {
        "title": "Greggae's Bacon Trout",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "2 tablespoons seeded and diced jalapeno pepper ADVERTISEMENT",
            "2 tablespoons diced green onion ADVERTISEMENT",
            "1/2 clove garlic, minced ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "2 (10 ounce) cleaned whole trout, heads removed ADVERTISEMENT",
            "2 sprigs fresh dill ADVERTISEMENT",
            "2 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a 9x13-inch glass baking dish with foil.\nPlace a small saucepan over low heat; heat butter until partially melted. Stir in lemon juice, jalapeno pepper, green onion, and garlic; stir mixture into a paste. Season with sea salt and black pepper.\nPlace each trout onto a large sheet of aluminum foil and stuff the cavity of each fish with butter paste; place a dill sprig and a bacon strip into the cavity over the butter mixture. Fold foil over fish and wrap edges to seal tightly. Place foil packets in the prepared baking dish.\nBake foil packets until fish flakes easily with a fork, 26 minutes. Let fish sit in foil packet for 5 minutes before unwrapping. To serve, transfer fish from foil to a serving plate; discard bacon. Flesh of fish will be white and skin will peel off.\n",
        "picture_link": "rpxj0TAeZE7aF14DLmrm.ptP4Wllms2"
    },
    {
        "title": "Healthier Best Chocolate Chip Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup sweet potato puree ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons hot water ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter, sweet potato, white sugar, brown sugar, and orange juice with an electric mixer in a large bowl until smooth. Add eggs whites one at a time, allowing each egg to blend into butter mixture before adding the next. Beat in vanilla extract. Dissolve baking soda in hot water in a small bowl. Add to sweet potato batter. Stir in flour, chocolate chips, and walnuts. Roll dough into walnut-sized balls and place 2 inches apart onto ungreased baking sheets.\nBake in preheated oven until edges are nicely browned, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Martini Cocktail",
        "ingredients": [
            "3 fluid ounces gin ADVERTISEMENT",
            "1 fluid ounce dry vermouth ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "3 pimiento-stuffed green olives, drained ADVERTISEMENT",
            "1 lemon twist (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gin and vermouth in a cocktail mixing class. Add ice and stir until chilled. Strain into a chilled cocktail glass.\nGarnish with three olives on a pick or a lemon twist.\n",
        "picture_link": "6lHgiG25xQjQv4tD5xl3IlNk0iurgrW"
    },
    {
        "title": "Jillena's Crab Hush Puppies",
        "ingredients": [
            "1 cup self-rising flour ADVERTISEMENT",
            "1 cup self-rising cornmeal ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (15 ounce) can cream-style corn ADVERTISEMENT",
            "1/2 pound crabmeat ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 quart vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix self-rising flour, cornmeal, garlic salt, pepper, corn, crabmeat, onion, and eggs together in a bowl; let sit for 10 minutes.\nHeat oil in a deep-fryer or large saucepan to 365 degrees F (185 degrees C).\nDrop 6 to 8 tablespoon-sized balls of batter into the hot oil; fry until golden brown, 4 to 5 minutes. Remove hush puppies with a slotted spoon and drain on paper towel-lined plate. Repeat with remaining batter.\n",
        "picture_link": "xfwcyUhV/kj0d6.e4RQtRsGyNi/d1Ne"
    },
    {
        "title": "Quinoa with Kumquats and Leeks",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 leek, thinly sliced ADVERTISEMENT",
            "3 cloves garlic, thinly sliced ADVERTISEMENT",
            "8 kumquats, thinly sliced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir leek, garlic, and kumquats until brown, 5 to 10 minutes. Season with salt.\nCook and stir quinoa into kumquat mixture until quinoa is toasted, about 1 minute; add chicken stock and bring to a boil. Reduce heat to low, cover, and simmer until quinoa has absorbed the chicken stock, about 20 minutes.\n",
        "picture_link": "4EUQJemOZs1TglGel5P4WmUK5RCe2L6"
    },
    {
        "title": "Curry Chicken Casserole",
        "ingredients": [
            "2 1/2 cups broccoli florets ADVERTISEMENT",
            "2 cups fresh green beans, trimmed ADVERTISEMENT",
            "1 pound cooked chicken breast, cut into bite-sized pieces ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add broccoli and green beans, cover, and steam until tender, 2 to 6 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace broccoli and green beans in a 9x13-inch baking dish. Cover with chicken and 1 1/2 cups Cheddar cheese.\nHeat chicken broth in a saucepan over medium heat until almost boiling. Mix a small amount of broth with flour in a bowl to create a paste; whisk paste into remaining chicken broth until thickened. Stir in yogurt, fish sauce, lime juice, and curry powder. Season with salt and pepper. Pour curry mixture over chicken. Sprinkle with remaining 1/2 cup Cheddar cheese.\nBake in preheated oven until bubbly, 30 to 45 minutes.\n",
        "picture_link": "CYAyLQGdcsyX87McdYt.088TIFH0yh6"
    },
    {
        "title": "Healthier Sweet Potato Pie I",
        "ingredients": [
            "1 (1 pound) sweet potato ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup low-fat milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (9 inch) unbaked whole wheat pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil sweet potato whole in skin in a small pot until done, 40 to 50 minutes. Drain, cool sweet potato with cold water, and remove skin.\nBreak sweet potato apart in a large bowl. Mix in butter and beat well with an electric mixer. Beat in sugar, milk, eggs, nutmeg, cinnamon, and vanilla extract on medium speed until mixture is smooth. Pour filling into unbaked pie crust.\nBake in preheated oven until knife inserted in center comes out clean, 45 to 55 minutes. Pie will puff up like a souffle, then sink down as it cools.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mussels in a Fennel and White Wine Broth",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 bulb fennel, trimmed and thickly sliced ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, thinly sliced ADVERTISEMENT",
            "1 pound mussels, cleaned and debearded ADVERTISEMENT",
            "1 cup halved cherry tomatoes ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1/4 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper or a silicone baking mat.\nPlace fennel slices in a bowl. Drizzle 1 tablespoon olive oil over fennel and toss to coat. Transfer to prepared baking sheet and roast in the preheated oven until fennel is cooked through and beginning to caramelize, 25 to 35 minutes.\nHeat 1 1/2 tablespoons olive oil in a large skillet over medium-high heat. Add garlic; cook, stirring frequently until garlic is fragrant and light golden, 1 to 2 minutes.\nStir mussels into garlic; toss to evenly combine. Stir in roasted fennel, cherry tomatoes, and white wine. Bring to a boil, cover, and cook until mussels are all opened, 3 to 5 minutes. Stir in parsley and serve.\n",
        "picture_link": "UjHiA178st9MpvX6jkeu9goRp9TuvWK"
    },
    {
        "title": "Healthier BBQ Pork for Sandwiches",
        "ingredients": [
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "3 pounds boneless pork ribs ADVERTISEMENT",
            "1 cup shredded carrot ADVERTISEMENT",
            "4 1/2 fluid ounces barbeque sauce ADVERTISEMENT",
            "4 1/2 ounces mesquite sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour beef broth into slow cooker and add pork ribs. Cook on High until meat shreds easily, about 4 hours. Remove meat and shred with two forks.\nPreheat oven to 350 degrees F (175 degrees C). Transfer shredded pork to a Dutch oven or skillet and stir in carrots, barbecue sauce, and mesquite sauce.\nBake in preheated oven until heated through, about 30 minutes.\n",
        "picture_link": "RK8EO8wbOdYmyXnAL8tilzqfLJnE1.i"
    },
    {
        "title": "Gibson Cocktail",
        "ingredients": [
            "2 1/2 fluid ounces gin ADVERTISEMENT",
            "1/2 fluid ounce dry vermouth ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "2 pickled pearl onions, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gin and vermouth in a cocktail mixing class. Add ice and stir until chilled. Strain into a chilled cocktail glass.\nGarnish with pearl onions.\n",
        "picture_link": "BZO0QB2Sdl9xa69A/gKT2qGaf188pqC"
    },
    {
        "title": "Grandma Susie's Macaroni Salad",
        "ingredients": [
            "2 (8 ounce) packages multicolored spiral pasta ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "2 pickles, chopped ADVERTISEMENT",
            "1 (6 ounce) can sliced black olives ADVERTISEMENT",
            "1/2 cup cubed cooked ham ADVERTISEMENT",
            "1/4 cup red onion, chopped ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "1 tablespoon mustard seed ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook spiral pasta at a boil until tender yet firm to the bite, about 8 minutes; drain and set aside.\nMix yellow and red bell peppers, pickles, black olives, ham, and onion in a large salad bowl; stir in spiral pasta. Mix in the mayonnaise until thoroughly coated. Stir in poppy and mustard seeds; season with salt and black pepper. Refrigerate salad until chilled, 1 to 2 hours.\n",
        "picture_link": "Ho7X8fC0/ANEbTn6SI0bi2Pw8fV07Dm"
    },
    {
        "title": "Watermelon Mango Ice Pops",
        "ingredients": [
            "2 cups cubed seeded watermelon ADVERTISEMENT",
            "1 cup mango chunks ADVERTISEMENT",
            "1/2 cup raspberries ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend watermelon, mango chunks, raspberries, and lemon juice in a blender until smooth; pour into ice pop molds and insert handles or sticks.\nFreeze until firm, at least 4 hours.\n",
        "picture_link": "zvZ.VbKVPjRoMich8djPJbtRRzDbKNe"
    },
    {
        "title": "Cotechino and Braised Beans",
        "ingredients": [
            "1 pound dried cranberry beans ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "1 sprig fresh rosemary ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "1 pound Cotechino sausage ADVERTISEMENT",
            "1 bunch Swiss chard, trimmed and chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cranberry beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight.\nHeat 1 tablespoon olive oil in a Dutch oven over medium-high heat. Stir in onion. Cook, stirring, until onions are softened and translucent, 6 to 8 minutes. Stir in cranberry beans, chicken broth, water, Italian seasoning, bay leaf, red pepper flakes, rosemary, and thyme.\nPierce Cotechino all over with the tip of a knife, then place in broth and beans mixture. Bring to a simmer, skimming any foam that accumulates. Reduce heat to low; cook until beans are tender, 1 hour. Transfer Cotechino to a cutting board; discard string and casing, then slice into 1/4-inch rounds.\nStir Swiss chard into bean and broth mixture. Simmer until chard is wilted, 3 to 4 minutes. Season with salt and black pepper to taste.\nHeat 1 tablespoon olive oil in a skillet over medium-high heat. Working in batches, cook the Cotechino rounds until crisped and browned, about 1 minute per side. Ladle beans into bowls and top with Cotechino rounds.\n",
        "picture_link": "5zTJ0FlRqnbXXP4oIdHDiAikue..mT6"
    },
    {
        "title": "Indian-Style Corn on the Cob in Onion and Yogurt Sauce  ",
        "ingredients": [
            "4 ears corn on the cob, husks and silk removed ADVERTISEMENT",
            "1/4 cup vegetable oil for frying ADVERTISEMENT",
            "1 onion, coarsely chopped ADVERTISEMENT",
            "2 cloves garlic, coarsely chopped ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger, peeled and coarsely chopped ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "6 fresh curry leaves, or more to taste (optional) ADVERTISEMENT",
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Break or cut each corn cob in half. Heat vegetable oil in a large skillet over medium heat and pan-fry corn until golden brown on all sides, about 10 minutes, turning often. Remove corn.\nPulse onion, garlic, and ginger to a smooth paste in a food processor; mix in curry leaves, cumin seeds, chili powder, and sugar. Cook paste in the hot oil over medium-low heat until the oil begins to separate, stirring often, about 10 minutes.\nRemove skillet from heat and let the paste cool; stir in the yogurt. Return corn to yogurt sauce and spoon sauce over corn to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grilled Swordfish Salad",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 (8 ounce) swordfish steaks ADVERTISEMENT",
            "2 ripe mangoes - peeled, pitted, and sliced ADVERTISEMENT",
            "1 (10 ounce) bag baby spinach ADVERTISEMENT",
            "8 cherry tomatoes, quartered ADVERTISEMENT",
            "8 kumquats, trimmed and quartered lengthwise ADVERTISEMENT",
            "1/3 cup extra virgin olive oil ADVERTISEMENT",
            "1/3 cup balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat. Lightly oil grill grate, and place about 4 inches from heat source.\nLightly brush the swordfish steaks and mango slices with 1 tablespoon olive oil.\nCook the swordfish steaks on preheated grill until lightly browned on both sides, turning once, 5 to 7 minutes per side. After turning, arrange mangos slices over the steaks, and cook 5 minutes more.\nToss the spinach, tomatoes, and kumquats together in a bowl. Whisk together 1/3 cup olive oil and balsamic vinegar in a small bowl until well blended. Pour over the spinach mixture and toss to coat evenly. To serve, divide the salad among 4 serving plates, and top with swordfish and mangoes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Creamy Quinoa and Vegetable Soup",
        "ingredients": [
            "2 cups beef broth ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup quinoa ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1 (8 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1 cup fresh green beans, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "1 tablespoon chopped fresh tarragon ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the beef broth, water, and quinoa to a boil in a saucepan. Reduce heat to medium, cover, and cook 5 minutes. Stir in the green onions, mushrooms, green beans, and tarragon; continue cooking until the green beans are tender, about 5 minutes. Stir in the evaporated milk, and season to taste with salt and pepper. Simmer 2 more minutes until heated through.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Parve Cholent",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 potatoes, peeled and cubed ADVERTISEMENT",
            "2 cups brown rice ADVERTISEMENT",
            "2 beets, peeled and quartered ADVERTISEMENT",
            "6 eggs in their shells ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "2 tablespoons seasoned salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons of olive oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more.\nLayer half the potatoes on the bottom of a slow cooker. Add the cooked onions and rice; top with the remaining potatoes and beets.\nNestle the eggs into the mixture: they should be almost completely submerged when you add the water.\nMix the garlic powder and seasoned salt into 1 cup of water. Pour over the cholent. Season with salt and pepper. Drizzle with 1/4 cup of olive oil.\nAdd water to cover. Too much water will make your cholent mushy; not enough may cause it to burn.\nCover with the lid and set your slow cooker on low; cook overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Paul's Apple, Lamb and Lentil Soup",
        "ingredients": [
            "3 pounds lamb shoulder steak ADVERTISEMENT",
            "1 pound lamb neck bones ADVERTISEMENT",
            "1 (16 ounce) package dried lentils ADVERTISEMENT",
            "2 medium yellow onion, chopped ADVERTISEMENT",
            "5 cloves cloves garlic, finely chopped ADVERTISEMENT",
            "2 teaspoons fresh thyme leaves, finely chopped ADVERTISEMENT",
            "2 Red Delicious apples - peeled, cored and diced ADVERTISEMENT",
            "1 cup Cabernet Sauvignon wine ADVERTISEMENT",
            "1 cup fresh cilantro leaves, chopped ADVERTISEMENT",
            "salt and freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim lamb shoulder steak from bones and set aside bones. Cut steak into 1 inch cubes and set aside. Place shoulder and neck bones in a large stockpot and cover with water; simmer bones over medium high heat for 1 to 1 1/2 hours. Remove bones from stockpot and discard. Reserve liquid.\nAdd the cubed lamb, lentils, onions, garlic and thyme to the liquid in the stockpot; cook over medium heat for 15 minutes. Add apples and wine to the stockpot and cook another 15 minutes, or until lentils and lamb are tender. Season with salt and pepper. Serve in bowls sprinkled with cilantro.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Very Personal Bolognese Sauce",
        "ingredients": [
            "3/4 pound lean ground beef ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "3 tablespoons tomato paste ADVERTISEMENT",
            "1 teaspoon harissa ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 teaspoon pressed garlic ADVERTISEMENT",
            "1 tablespoon mascarpone cheese ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble the ground beef into a large skillet over medium-high heat. Add onion and cook, stirring to break up large chunks, until no longer pink. Drain off excess grease. Mix in the tomato paste, harissa and Worcestershire sauce until blended. Stir in the tomato sauce and garlic; reduce heat to low and simmer for 15 minutes.\nStir in the mascarpone cheese, and simmer for another 15 minutes. Remove from the heat, and season with dried basil.\n",
        "picture_link": "1Ymt.h1dKCoP1U0MO/UsR2PJnbxGjSW"
    },
    {
        "title": "Ricotta Kuchen with Streusel Topping",
        "ingredients": [
            "1 cup low-fat milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 1/4 cups bread flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3/4 teaspoon sea salt ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast or bread machine yeast ADVERTISEMENT",
            "1 (24 ounce) carton ricotta cheese ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup light brown sugar, packed ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons non dairy amaretto flavored creamer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the milk, 1 egg, 2 tablespoons of butter, flour, 1/4 cup white sugar, salt and yeast into the pan of your bread machine in the order recommended by the manufacturer. Select the Dough cycle and press Start. Let the dough rise 25 minutes.\nWhile the dough is preparing, in a medium bowl, combine ricotta cheese, 3/4 cup of white sugar, 3 eggs, and vanilla extract. Beat on high speed 3 to 4 minutes.\nGrease a 15x10 inch baking sheet and set aside. Remove dough from bread machine and place on lightly floured surface. Roll out dough into rectangular shape to fit baking sheet. Carefully slide dough onto baking sheet. Using a knife or scissors, start on the long sides and cut 1 inch wide strips in towards the center to make approximately 14 strips on each side. Cut in only far enough to leave a solid strip about 3 inches wide down the center; with the cut strips forming a \"fringe\" on each side. Spread the ricotta mixture along the center strip. Fold the side strips over the ricotta mixture, alternating strips from each side. Pinch or twist the strips into knots to seal. Let the kuchen rest.\nPreheat oven to 350 degrees F (175 degrees C). In a medium bowl, prepare the streusel topping by mixing together the brown sugar, 3 tablespoons of butter, and amaretto creamer. Crumble topping over the top of the kuchen.\nBake 25 to 35 minutes or until the top is golden brown. Cool 20 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grandma Me's Clove-Studded Leg of Lamb",
        "ingredients": [
            "1 (6 pound) bone-in leg of lamb, trimmed ADVERTISEMENT",
            "1 tablespoon whole cloves ADVERTISEMENT",
            "1 (12 ounce) can apricot nectar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch black pepper ADVERTISEMENT",
            "1/4 teaspoon soy sauce ADVERTISEMENT",
            "4 slices lemon, for garnish ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cube vegetable bouillon, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nUsing a sharp knife, cut through the narrow end of the lamb leg about 3 inches from the end. Cut through the meat around the bone. Remove and discard this piece, leaving clean exposed bone. You may be able to have your butcher do this for you. Stick cloves into the lamb leg in an even pattern, then place into a shallow, metal roasting pan.\nBake in preheated oven for 2 hours, then drain off fat and drippings. Whisk together apricot nectar, salt, pepper, and soy sauce in a small bowl; pour over lamb leg. Return the lamb to the oven, and bake until a meat thermometer inserted into the thickest part registers 160 degrees F (71 degrees C) for medium-well doneness, basting frequently. Top the roast with lemon slices, and bake 5 minutes longer.\nRemove the lamb to a serving platter, and cover with aluminum foil. Allow to rest 10 to 15 minutes before slicing. Meanwhile, place the roasting pan on the stove over medium heat. Dissolve the cornstarch in the water, and pour into the roasting pan along with the bouillon cube. Cook and stir until the bouillon dissolves, and the sauce thickens and clears, about 1 minute. Remove the cloves and lemon slices before slicing the lamb and serving with the sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mother's Date Dips from 1940's",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "3 cups whole pitted dates ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 2 baking sheets. In a bowl, sift together the flour, baking powder, and salt.\nBeat butter and sugar in a bowl until light and fluffy with an electric mixer set on medium speed. Add egg and vanilla extract to mixture and beat in. Mix in the flour mixture in 3 additions, alternating with cream. Mixture should form a thick batter.\nOne at a time, dip each date in the batter and place onto the prepared baking sheet.\nBake one sheet at a time in the center of the preheated oven until the batter is lightly browned, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Herb Roasted Turkey with Pan Gravy",
        "ingredients": [
            "1 (12 pound) turkey ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 teaspoon kosher salt and freshly ground black pepper ADVERTISEMENT",
            "1 (26 ounce) carton Swanson® Chicken Stock (Regular or Unsalted) ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon dried basil leaves, crushed ADVERTISEMENT",
            "1 teaspoon dried thyme leaves, crushed ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the package of giblets and neck from the turkey cavity. Rinse the turkey with cold water and pat dry with a paper towel. Tie the ends of the drumsticks together.\nPlace the turkey, breast-side up, on a rack in a roasting pan. Brush the turkey with the oil. Season with the salt and black pepper. Insert a meat thermometer into the thickest part of the meat, not touching the bone.\nStir the stock, lemon juice, basil, thyme and 1/8 teaspoon additional black pepper in a large bowl. Reserve 1 3/4 cups stock mixture for the gravy. Pour the remaining stock mixture over the turkey.\nRoast at 325 degrees F for 3 hours or until the thermometer reads 165 degrees F., basting occasionally with the pan drippings. Begin checking for doneness after 2 1/2 hours of the roasting time.\nRemove the turkey from the pan, cover and keep warm. Spoon off any fat and pour off all but 1 1/2 cups pan drippings.\nStir the reserved stock mixture and the flour in a medium bowl until the mixture is smooth. Add the flour mixture to the pan. Cook and stir over medium heat until the mixture boils and thickens, scraping up the browned bits from the bottom of the pan. Season, if desired. Serve the gravy with the turkey.\n",
        "picture_link": "0.FDcej/NupTS9.hkr66QD7gBjY3m46"
    },
    {
        "title": "Lubed-Up Hot Wings",
        "ingredients": [
            "4 cups vegetable oil for frying ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "1/2 cup brown sugar and butter flavored breakfast cereal (such as Cap'n Crunch®), finely ground ADVERTISEMENT",
            "5 pounds large chicken wings, patted dry with paper towels ADVERTISEMENT",
            "3/4 cup unsalted butter, melted ADVERTISEMENT",
            "3/4 cup hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1/4 cup bourbon whiskey ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon habanero pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nWhisk together eggs and milk in a bowl. In a separate bowl, stir together the bread flour and ground cereal. Coat the wings in the egg mixture, then in the cereal mixture.\nFry the wings, 6 at a time, in the oil until golden brown, 12 to 15 minutes. Let wings drain on paper towels.\nPreheat oven to 200 degrees F (95 degrees C). Line several baking sheets with parchment paper.\nWhile wings are frying, mix the melted butter, hot sauce, bourbon, honey, Worcestershire sauce, and habanero sauce in a large plastic tub with a lid. Place the wings into the sauce, close the lid, and shake to coat wings with sauce.\nPlace the wings on the prepared baking sheets and bake in the preheated oven until the sauce is slightly sticky, about 10 minutes.\n",
        "picture_link": "v8lsGcDtHhzCfHzKKv8NWrISNReLlm6"
    },
    {
        "title": "Kook-a-Cola",
        "ingredients": [
            "Coca Extract: ADVERTISEMENT",
            "1/2 pound crumbled coca leaves (whole leaf coca tea) ADVERTISEMENT",
            "1 1/2 cups 190 proof grain alcohol (such as Everclear®) ADVERTISEMENT",
            "Flavoring: ADVERTISEMENT",
            "10 drops orange oil ADVERTISEMENT",
            "15 drops lemon oil ADVERTISEMENT",
            "5 drops nutmeg oil ADVERTISEMENT",
            "2 1/2 drops coriander oil ADVERTISEMENT",
            "5 drops neroli oil ADVERTISEMENT",
            "5 drops cinnamon oil ADVERTISEMENT",
            "1/2 cup 190 proof grain alcohol (such as Everclear®) ADVERTISEMENT",
            "Syrup: ADVERTISEMENT",
            "1 1/4 gallons water ADVERTISEMENT",
            "15 pounds white sugar ADVERTISEMENT",
            "3/4 fluid ounce caramel color ADVERTISEMENT",
            "1/2 fluid ounce vanilla extract ADVERTISEMENT",
            "1/2 fluid ounce caffeine ADVERTISEMENT",
            "2 cups lime juice ADVERTISEMENT",
            "1 1/2 ounces citric acid powder ADVERTISEMENT",
            "12 1/2 gallons carbonated water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the coca extract, moisten coca leaf powder with 3 ounces of grain alcohol. Then pack the wet leaves into a percolator and add more diluted alcohol until the leaves are fully saturated and slightly covered by alcohol. When the extract begins to drip from the percolator, stop up the hole, cover the percolator tightly and allow to macerate for 2 days. Then continue the percolation, adding more alcohol until you have 8 ounces of extract.\nTo make the flavoring, combine drops of orange oil, lemon oil, nutmeg oil, coriander oil, neroli oil, and cinnamon oil with 1/2 cup of grain alcohol.\nTo make the syrup, mix together water, sugar, caramel, and 1/8 ounce (or 3/4 tablespoon) of coca extract. Stir in vanilla extract, caffeine, lime juice, and citric acid. Combine 1/4 ounce flavoring with the entire amount of syrup.\nTo prepare Kook-a-Cola, combine 1 part flavored syrup to 5 parts carbonated water.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Fruit Cake",
        "ingredients": [
            "4 egg whites ADVERTISEMENT",
            "6 tablespoons water ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 tablespoons cornstarch ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "3/4 cup sliced strawberries ADVERTISEMENT",
            "3/4 cup sliced peaches ADVERTISEMENT",
            "1/2 cup blueberries ADVERTISEMENT",
            "2 cups whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 10 inch round cake pan.\nCombine the egg whites and water in a large glass or metal bowl. Whip the egg whites to soft peaks in a large bowl. Continue to whip, while gradually adding sugar until egg whites can stand in stiff peaks. Continue to whip on medium speed while adding one egg yolk at a time. Combine the flour and baking powder; fold gently into the batter. Pour the batter into the prepared cake pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 30 to 35 minutes. Cool the cake in the pan for 10 minutes before turning out onto a wire rack to cool completely.\nStir the cornstarch with the water in a small bowl to dissolve and set aside. In a medium saucepan, beat together the sweetened condensed milk and the egg yolks. Bring the mixture to a boil over medium-high heat, stirring constantly. Stir in the cornstarch mixture. When the filling thickens, remove from heat and set aside to cool.\nMix together the strawberries, peaches, and blueberries in a medium bowl. Using a thread or a bread knife, slice the cooled cake in half horizontally. Spread the mixed fruit across the bottom half of the cake, pour any fruit juice over the berries to moisten the cake. Spread the cream filling over the top of the fruit. Top with the other half of the cake. Frost the cake with whipped cream or your favorite white frosting.\n",
        "picture_link": "IQd7VM5bgRPdnU7Z4MA5Fk1jdEE7PcK"
    },
    {
        "title": "Grape-Apple Delight",
        "ingredients": [
            "1 (.25 ounce) envelope unflavored gelatin ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 1/2 cups apple juice ADVERTISEMENT",
            "1 cup halved seedless red grapes ADVERTISEMENT",
            "1 cup diced apple ADVERTISEMENT",
            "1/4 cup diced celery ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle gelatin over the water in a small saucepan; allow to soften for 5 minutes. Cook and stir over low heat until gelatin fully dissolves, about 2 minutes. Remove from heat and stir in the apple juice; Transfer to a bowl and chill until the mixture begins to thicken, about 20 minutes.\nMix the grapes, apple, and celery into the gelatin mixture and pour into a 4-cup mold; chill until set, about 2 hours.\n",
        "picture_link": "EgRK2m76YVGC2NfqUHUuhgSUBYXJ3MK"
    },
    {
        "title": "Tangy Banana Salad",
        "ingredients": [
            "1 cup plain yogurt ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 bananas, sliced ADVERTISEMENT",
            "1 teaspoon minced fresh cilantro ADVERTISEMENT",
            "1 pinch chili powder (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the yogurt, mustard powder, and salt in a serving bowl. Add the banana slices and stir gently until bananas are evenly coated with yogurt mixture.\nGarnish with chopped cilantro and chili powder. Serve immediately.\n",
        "picture_link": "dLpeNqvTaAAI6mH8VEu/qzNEUyU1uKi"
    },
    {
        "title": "Sesame Tofu Dressing",
        "ingredients": [
            "1/2 (12 ounce) package tofu, drained ADVERTISEMENT",
            "1 cup nonfat plain yogurt ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tofu, yogurt, sesame seeds, soy sauce, vinegar, and salt in a blender. Blend until smooth.\n",
        "picture_link": "DzgEcAEzT0.IigEWSAW/rw.p619T/gi"
    },
    {
        "title": "Shady Leprechaun",
        "ingredients": [
            "1 1/2 fluid ounces dark rum ADVERTISEMENT",
            "1 pint Irish stout beer (e.g. Guinness®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the rum into a pint glass, then slowly pour in the stout. Enjoy!\n",
        "picture_link": "Vtv5/0/gUHOEG8Oi/IjgPj0bAk/NNjy"
    },
    {
        "title": "Rooibos Brulee Pancakes",
        "ingredients": [
            "3 rooibos tea bags ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "2 cups complete pancake mix (such as Aunt Jemima's Buttermilk Complete®) ADVERTISEMENT",
            "1/4 cup butter, or as needed ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup pecan halves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Steep the rooibos tea bags in the water for 5 minutes; remove tea bags and allow tea to cool.\nHeat a skillet over medium-low heat until a drop of water on the surface sizzles for a moment before disappearing. Whisk together 1 1/2 cups cooled tea with the pancake mix.\nMelt 1 teaspoon butter in the center of the skillet. Place 4 to 5 pecan halves into the melting butter. Pour about 1/3 cup pancake batter directly over pecans and butter. Sprinkle 1/2 tablespoon brown sugar over the top of the pancake, and add another thin pat of butter over the sugar.\nWhen the edges of the pancake appear dry and bubbles form on the top, turn and cook until lightly browned, about 40 seconds. Remove from pan; add any melted sugar from the pan to the top of the pancake. Repeat with remaining pancake mix, butter, pecans, and sugar.\n",
        "picture_link": "5vRDk.K/DhrQQryHnoyp76FwsyUh0Xu"
    },
    {
        "title": "Sue's Torta Rustica",
        "ingredients": [
            "Pastry: ADVERTISEMENT",
            "2 cups unsifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/2 pound sweet Italian sausage ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1 1/2 pounds ricotta cheese ADVERTISEMENT",
            "1/2 pound shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "8 thin slices deli ham ADVERTISEMENT",
            "1 cup sliced pepperoni ADVERTISEMENT",
            "6 hard-cooked eggs, sliced ADVERTISEMENT",
            "1 cup salami, cubed ADVERTISEMENT",
            "2 tablespoons butter, melted and cooled to lukewarm ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the pastry: combine the flour, baking powder, and salt in a bowl. Stir in 3 beaten eggs, 2 tablespoons vegetable oil, and the cold water, and mix just until combined. Wrap the dough in plastic and refrigerate for 20 minutes.\nHeat a large skillet over medium-high heat and stir in the Italian sausage. Cook and stir until the sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Cool.\nDivide the pastry into two unequal pieces, about one-third and two-thirds. Roll the small piece out on a lightly floured surface. Trace the bottom of a springform pan to make a 9-inch circle; keep any scraps of dough. Transfer the circle of dough to a plate or baking sheet and refrigerate. Roll out the larger piece of dough and any leftover scraps into a large circle about 1/4-inch thick. Carefully fold the dough in half and transfer it to a 9-inch springform pan. Let the weight of the dough sink down into the sides of the pan; gently press the dough into the bottom edges. Use a sharp knife or kitchen shears to trim the dough to have a 1-inch overhang. Refrigerate while you assemble the filling.\nPreheat an oven to 350 degrees F (175 degrees C).\nCombine the 1 tablespoon vegetable oil, 3 beaten eggs, the ricotta, mozzarella, and Parmesan cheeses, and the chopped parsley in a bowl and mix well.\nLayer the filling in the pastry-lined springform pan. Place 4 slices of ham, half the pepperoni, and half of the hard-cooked egg slices in the bottom of the pan. Top with half of the cubed salami and half of the cooked Italian sausage. Spread half of the ricotta cheese mixture on top. Repeat the layers.\nTop the filled torta with the chilled round of pastry. Fold the edges over and crimp the crust to seal. Brush the pastry with the melted butter and bake in the preheated oven until the pastry is a deep golden brown, 45 minutes to 1 hour. Let cool at least 15 minutes before slicing.\n",
        "picture_link": "1QAP0Vk.1Q/g1fKsZOiHriF0A1tBOna"
    },
    {
        "title": "Sunchoke (Jerusalem Artichoke) and Leek Soup with Mushrooms",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 large leek, halved lengthwise and thinly sliced crosswise ADVERTISEMENT",
            "6 sunchokes, roughly chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 large carrot, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/2 bunch fresh tarragon, chopped ADVERTISEMENT",
            "1 dash vermouth ADVERTISEMENT",
            "5 cups vegetable broth ADVERTISEMENT",
            "2 bunches watercress ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cups chopped fresh mushrooms ADVERTISEMENT",
            "1/2 bunch fresh tarragon, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium heat. Cook and stir the leek in the hot oil until translucent, 5 to 7 minutes. Stir the sunchokes, celery, carrot, and garlic into the leeks. Season the mixture with salt and pepper. Add the bay leaves and 1/2 bunch chopped tarragon. Increase the heat to high; cook and stir until the vegetables are hot, 2 to 3 minutes.\nPour the vermouth into the pan; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add the vegetable broth, reduce heat to medium-low, and bring the mixture to a simmer; cook until the vegetables are completely tender, about 30 minutes. Reserving a few sprigs for garnish, add the watercress to the soup; allow the watercress to wilt in the hot soup, about 5 minutes.\nWhile the soup simmers, melt the butter in a skillet over medium heat. Add the mushrooms to the melted butter, season with salt and pepper, and cook until completely tender, about 5 minutes. Stir in the remaining tarragon and set aside.\nRemove and discard the bay leaves. Reserve about 1/3 of the soup in a separate pot. Pour the other 2/3 of the soup into a blender in batches, filling the pitcher no more than halfway full. Holding the lid of the blender with towel, carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into the pot with the unblended portion. Serve in bowls, topping each with a large spoonful of the cooked mushrooms and a sprig of watercress.\n",
        "picture_link": "VliDABVGmFagLqfO1oGYW.jdXJnQ1JS"
    },
    {
        "title": "Pomegranate Martini",
        "ingredients": [
            "1 cup ice ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger vanilla flavored vodka ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger peach schnapps ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger pomegranate juice ADVERTISEMENT",
            "1 tablespoon simple syrup ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "lemon-lime soda ADVERTISEMENT",
            "1 slice fresh lime ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ice, vodka, schnapps, pomegranate juice, simple syrup, and lemon juice in shaker. Shake vigorously to chill. Pour into martini glass, top with a splash of chilled lemon-lime soda, and garnish glass with a slice of fresh lime.\n",
        "picture_link": "AIfzthqk/cj6SoOoIBXhXzKntkE/tZi"
    },
    {
        "title": "Grammy Daisy's Potato Dressing",
        "ingredients": [
            "8 potatoes, peeled and chopped ADVERTISEMENT",
            "6 slices bread ADVERTISEMENT",
            "2 stalks celery, minced ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 cups turkey stock ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "2 tablespoons crushed dried summer savory ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large saucepan with enough water to cover, and bring to a boil. Boil 15 minutes, until tender but firm. Drain and mash.\nLightly toast bread, and tear into cubes. Preheat oven to 375 degrees F (190 degrees C). Lightly grease a medium baking dish.\nIn a large bowl, mix mashed potatoes, toasted bread, celery, onion, butter, turkey stock, sage, and savory. Season with salt and pepper.\nTransfer potato mixture to the prepared baking dish. Bake 30 minutes in the preheated oven, or until lightly browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Texas Praline Cake",
        "ingredients": [
            "1 cup butter or margarine ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 tablespoon instant coffee granules ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "5 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup coarsely chopped pecans ADVERTISEMENT",
            "1 cup heavy cream, chilled ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup brown sugar, not packed ADVERTISEMENT",
            "10 pecan halves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease just the bottom of a 10 inch tube pan.\nIn a large bowl, cream together the butter, 1 cup brown sugar and white sugar until smooth. Beat in the eggs one at a time, mixing well after each. Stir in vanilla. Dissolve the coffee crystals in water, and stir into the creamed mixture until blended. Stir together the flour, cocoa, baking powder and salt; stir into the batter until just incorporated. Fold in pecans. Transfer the batter to the prepared pan.\nBake for about 55 minutes in the preheated oven, or until a toothpick inserted into the center of the cake comes out clean. Cool cake in pan on a wire rack.\nIn a chilled bowl, stir together the heavy cream, salt, vanilla and remaining 1/2 cup brown sugar so that the sugar is dissolved. Whip using chilled beaters until stiff. Run a knife around the outer edge of the cake in the pan, and tap it out onto a serving plate. Make sure cake is completely cool before frosting. Decorate with pecan halves if you like.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Creme Fraiche II",
        "ingredients": [
            "1 cup heavy cream ADVERTISEMENT",
            "1 tablespoon plain yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a clean jar with a lid, combine the cream and yogurt. Close the lid, and shake vigorously for 1 minute. Leave the jar out on the counter for about 1 day. It should thicken up. Chill in the refrigerator for 1 day before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hampshire Hoggins",
        "ingredients": [
            "1 pint heavy whipping cream, chilled ADVERTISEMENT",
            "1 (11 ounce) can mandarin oranges, drained and liquid reserved ADVERTISEMENT",
            "1 (8 ounce) package ginger nut cookies (biscuits) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, whip the cream until stiff. Place a thin layer of whipped cream on the bottom of a 1 quart glass bowl, or baking dish. Dip 1/3 of the ginger biscuits into the reserved juice from the can of oranges one at a time, and place in a single layer over the whipped cream. Place about 1/3 of the mandarin orange segments in a layer over the biscuits. Repeat layers, soaking each biscuit in the juice, and ending with whipped cream on the top. Smooth the top of the dish with a palette knife or large spatula.\nRefrigerate for at least 4 hours or overnight to let the flavors mingle before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Secret Fantasy Pie",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/2 cup Irish cream flavored non dairy creamer, liquid ADVERTISEMENT",
            "1/3 cup hazelnut liqueur ADVERTISEMENT",
            "1 (16 ounce) package extra creamy frozen whipped topping, thawed ADVERTISEMENT",
            "2 prepared 8 inch pastry shells, baked and cooled ADVERTISEMENT",
            "1/4 cup unsweetened cocoa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "in a large bowl, mix together sweetened condensed milk, coffee creamer and hazelnut liqueur. Fold in whipped topping. Pour into pie crusts, and lightly sift cocoa on top. Freeze for 8 hours or overnight.\n",
        "picture_link": "1I0UltHnMZh0yl9H3tw9fCBI/wOopXa"
    },
    {
        "title": "Parsley Jelly",
        "ingredients": [
            "2 1/2 cups boiling water ADVERTISEMENT",
            "10 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "2 1/2 cups honey ADVERTISEMENT",
            "1/2 (6 fluid ounce) container liquid pectin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make a strong infusion by pouring the boiling water over the parsley. Let stand for 15 minutes. Strain out bits of parsley, and reserve liquid in a glass or stainless steel saucepan.\nStir the honey and vinegar into the parsley water. Bring to a boil over medium-high heat. Add the pectin, and continue to boil, stirring constantly, for 1 minute. Remove from heat, and skim off any foam from the top. Transfer to sterile jars, and seal in a hot water bath.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Salami",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1/2 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon ground mustard seed ADVERTISEMENT",
            "2 tablespoons sugar-based curing mixture (such as Morton® Tender Quick®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the ground beef, black pepper, garlic, mustard seed and curing salt until well blended. Divide into 2 or 4 rolls, wrap in aluminum foil, and refrigerate for 24 hours.\nBring a large pot of water to a boil. Place the wrapped rolls in the water, and simmer for 1 hour over medium to low heat. Remove carefully, and poke holes in the foil to drain. Set aside to cool. Remove foil, and rewrap with new aluminum foil. Refrigerate until fully chilled, about 3 hours. Slice, and use for sandwiches, crackers, salads or just snacking.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mallorcan Ensaimadas",
        "ingredients": [
            "5 tablespoons lukewarm milk ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "2 cups bread flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together the yeast and milk. In a large bowl, stir together the bread flour, salt and sugar. Make a well in the center, and pour in the yeast mixture. Cover with a light dusting of flour, and let stand for about 15 minutes, until frothy.\nStir together the egg and oil, and pour into the bowl with the flour. Mix until the dough comes together then turn out onto a floured surface, and knead until smooth, about 5 minutes. Place in a greased bowl, and cover. Let stand for about 20 minutes to relax.\nPreheat the oven to 375 degrees F (190 degrees C). Divide the dough into 15 pieces. Roll each piece into a 12 inch long rope. Roll the ropes into a spiral shape, and place on an ungreased baking sheet.\nBake for 10 minutes in the preheated oven, or until golden brown.\n",
        "picture_link": "0t4hhXxQirGAn4CCj6zBwcYBLUzBtJi"
    },
    {
        "title": "Falafel II",
        "ingredients": [
            "1 pound yellow split peas ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh mint ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "cayenne pepper to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 quarts vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place split peas in a large bowl, and cover with water (roughly twice as much water as split peas by volume). Cover, and refrigerate for 24 hours.\nDrain the water from the peas, and mash the peas thoroughly. Mix in onion, garlic, mint, egg, coriander, and cumin. Season with cayenne pepper, salt, and pepper to taste. Cover, and refrigerate for 1 to 2 hours.\nHeat oil in a deep fryer to 365 degrees F (185 degrees C).\nForm split pea mixture into small rounds, flatten slightly, and drop into hot oil. Fry until the falafel are a rich brown color.\n",
        "picture_link": "I2XTMuAKYApFgspPfAo.wb9aBvLQkdm"
    },
    {
        "title": "Texas Teriyaki Marinade",
        "ingredients": [
            "1 cup brown sugar, not packed ADVERTISEMENT",
            "1 1/2 cups teriyaki sauce ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "1/4 teaspoon meat tenderizer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the brown sugar, teriyaki sauce, Worcestershire sauce, liquid smoke and meat tenderizer. Pour over meat, and refrigerate in a sealed container. Shake container occasionally to cover meat. Take out of the refrigerator before cooking, and let come to room temperature while the smoker heats up. Never use barbeque sauce with this marinade.\n",
        "picture_link": "FF/RxE.ZqpY0QDLazpp7RWBO0Im9Lfq"
    },
    {
        "title": "Mike's Bait Shop's Turtle Stew",
        "ingredients": [
            "10 pounds turtle meat, without bones ADVERTISEMENT",
            "8 pounds chicken meat with bones ADVERTISEMENT",
            "8 pounds boneless pork roast ADVERTISEMENT",
            "10 large onions, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 pounds potatoes - peeled and cubed ADVERTISEMENT",
            "2 cups butter ADVERTISEMENT",
            "2 quarts half-and-half cream ADVERTISEMENT",
            "2 gallons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the turtle, chicken and pork meat into separate pots with enough water to cover the meat. Bring each one to a boil, and cook until tender. Discard the water from the turtle and pork, but save the chicken stock. Debone all of the meat, tear or cut into bite-size pieces, and set aside.\nIn a very large stockpot, combine the three meats, onion and reserved chicken stock. Bring to a boil, and cook until the onions are tender, about 45 minutes. Season with salt and pepper to taste. Potatoes can be prepared during this time.\nAdd the potatoes and butter to the stockpot, and cook for about 30 minutes, or until the potatoes are not quite cooked through. Reduce heat to low, and let the soup simmer down. Stir in the half and half cream and milk. Bring the soup to a simmer, and cook for about 15 minutes. Be careful not to curdle the dairy by getting it too hot. Serve soup hot with crackers.\n",
        "picture_link": "eZf9ZAeZRtPvsAz2AxhVXAvjEs8L2U6"
    },
    {
        "title": "Jesse's Spicy Veggie and Turkey Meatball Stew",
        "ingredients": [
            "2 pounds ground turkey ADVERTISEMENT",
            "5 tablespoons vegetable oil, divided ADVERTISEMENT",
            "2 large green bell peppers, cut into strips ADVERTISEMENT",
            "1 large red bell pepper, cut into strips ADVERTISEMENT",
            "1 large yellow bell pepper, cut into strips ADVERTISEMENT",
            "2 large onions, cut into 1/2 inch chunks ADVERTISEMENT",
            "2 cups sofrito sauce ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "4 medium potatoes, cut into 1/2 inch chunks ADVERTISEMENT",
            "4 carrots, sliced ADVERTISEMENT",
            "2 cups broccoli ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "16 ounces low fat mozzarella cheese, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Roll the ground turkey into small meatballs. Heat 1 tablespoon oil in a skillet over medium heat, and cook meatballs 5 minutes, or until evenly browned. Drain, and set aside.\nHeat remaining oil in a large pot over medium heat, and cook the green bell peppers, red bell pepper, yellow bell pepper, and onions until tender. Stir in the sofrito and tomato sauce, and continue cooking until heated through. Mix in potatoes, carrots, and broccoli. Pour in the water and salsa, and bring to a boil. Place meatballs in the pot. Reduce heat to low, and simmer 30 minutes. Top with mozzarella cheese to serve.\n",
        "picture_link": "PNZt5tRBr5HTTF4.hbA93PP.VcoqWOu"
    },
    {
        "title": "German X-Mas Rum Crowns",
        "ingredients": [
            "2 1/3 cups all-purpose flour, sifted ADVERTISEMENT",
            "3 1/2 ounces semisweet chocolate, grated ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "2/3 cup butter, cut into pieces ADVERTISEMENT",
            "2 tablespoons rum ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1/2 cup chopped pistachio nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the flour, chocolate, salt and confectioners' sugar. Mix in butter until the mixture appears crumbly. Add rum and egg, and mix until a smooth dough forms. Wrap in plastic, and refrigerate for at least 1 hour.\nPreheat the oven to 400 degrees F (200 degrees C). Grease cookie sheets.\nRoll dough out into thin 6 inch long ropes. Twist two ropes together, and put the ends together to form a crown. Mix together the egg yolk and water, brush over each crown, and sprinkle with chopped pistachios.\nBake for 15 minutes in the preheated oven, or until firm. Cool cookies on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Salad Taverna",
        "ingredients": [
            "8 ounces dry spinach noodles ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon green hot pepper sauce ADVERTISEMENT",
            "1/2 teaspoon anise seed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "2 tomatoes, coarsely chopped ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large bowl, whisk together olive oil, lemon juice, garlic, hot pepper sauce, anise seed and salt. Mix in cooked pasta, ricotta cheese, tomatoes, and olives. Cover, and chill.\n",
        "picture_link": "sJ7GP2IDhNFeUYTFc6LZv810WwVedw2"
    },
    {
        "title": "Three Bean Dip",
        "ingredients": [
            "1 (15 ounce) can refried beans ADVERTISEMENT",
            "1 (1 ounce) packet taco seasoning mix ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 small tomatoes, chopped ADVERTISEMENT",
            "3 bunches green onions, chopped ADVERTISEMENT",
            "1 cubanella pepper, seeded and chopped ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (15.5 ounce) can navy beans, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread the refried beans in a layer in the bottom of a 9 inch square baking dish. In a small bowl, stir together the taco seasoning mix and cream cheese. Spread the mixture over the refried beans. In a separate bowl, toss together the tomatoes, green onions, cubanella pepper, black beans and navy beans. Spread over the layer of cream cheese. Cover and refrigerate for at least 4 hours before serving to blend the flavors.\n",
        "picture_link": "4WBDBiqsJK/Z/upYJM107t7oSqCheoa"
    },
    {
        "title": "Kosher-Style Corned Beef",
        "ingredients": [
            "5 quarts ice water ADVERTISEMENT",
            "6 ounces salt ADVERTISEMENT",
            "3 ounces Prague powder number 1 ADVERTISEMENT",
            "3 ounces white sugar ADVERTISEMENT",
            "2 tablespoons pickling spice ADVERTISEMENT",
            "25 pounds beef brisket ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large plastic bucket or tub, mix together the ice water, salt, Prague powder, sugar and pickling spice. Submerge meat in the mixture, and refrigerate for 3 to 4 days. A weight may be placed on top of the meat to keep it submerged.\nCook corned beef as you normally would. Simmer or roast for about 50 minutes per pound, or until tender.\n",
        "picture_link": "TuYZ7JU7enacQ13ezwBevbMNYzr8Zlq"
    },
    {
        "title": "Pickled Corn on the Cob",
        "ingredients": [
            "6 ears corn - husked, cleaned and quartered ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "3 cups white vinegar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon pickling spice ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 (3 inch) cinnamon stick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse the corn, and place in a large bowl with the salt and enough water to cover. Refrigerate until needed. Sterilize two 1quart jars in simmering water for 5 minutes.\nIn a large stock pot, stir together the vinegar, sugar and pickling spice. Add the bay leaves and cinnamon stick. Bring to a boil over medium heat, stirring occasionally to be sure the sugar has dissolved.\nDrain and rinse the corn under cold water. Add to the pot with the pickling mixture. Return to a boil, reduce heat to low, and simmer for 10 minutes. Remove corn with a slotted spoon, and fill the sterile jars. Remove the cinnamon stick and bay leaves from the liquid, and discard. Fill the jars of corn with the vinegar mixture to within 1/2 inch of the top. The corn should be completely covered. Wipe the rims of the jars with a clean cloth. Seal with lids and rings.\nProcess the jars in a hot water bath for the time recommended by your local extension in your area. Most areas require about 10 minutes in a water bath of 180 degrees F (82 degrees C). Refrigerate after opening.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hazelnut Chocolate Chunk Muffins",
        "ingredients": [
            "1 cup oil for frying ADVERTISEMENT",
            "3/4 cup hazelnuts ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "2/3 cup brown sugar ADVERTISEMENT",
            "1/4 cup oat bran ADVERTISEMENT",
            "3 tablespoons hazelnut butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup semisweet chocolate chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a 12 cup muffin pan with paper cup liners.\nHeat the oil for frying in a medium, deep skillet over medium-high heat. In a small bowl, toss the hazelnuts in 1 tablespoon flour to lightly coat. Spoon the hazelnuts into the hot oil, and fry until golden brown.\nIn a medium bowl, mix the 2 cups flour, wheat germ, brown sugar, oat bran, hazelnut butter, and egg. Thoroughly mix in baking powder. Stir in the milk, and fold in the chocolate chips. Evenly pour into the lined muffin pan.\nBake 25 to 30 minutes in the preheated oven, until a toothpick inserted in the center of a muffin comes out clean.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Laura's \"Thin Mint\" Brownies",
        "ingredients": [
            "1 (18.25 ounce) package brownie mix (such as Betty Crocker®) ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "20 chocolate mint layer candies (such as Andes®), or more as needed, unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease bottom of 9x13-inch baking dish.\nStir brownie mix, oil, water, and eggs together in a bowl until well-blended. Spread mixture in prepared baking dish.\nBake in preheated oven until a toothpick inserted 2 inches from the side of the dish comes out almost clean, about 25 minutes.\nTransfer baking dish from oven to wire cooking rack and while still hot, arrange mint candies across the top about 1/4- to 1/2-inch apart. Let sit until candies melt, about 3 minutes. Spread melted mints evenly over brownies with a spatula. Cool until top layer hardens, 4 to 5 hours.\n",
        "picture_link": "eGDCm9p9nsysC02pnBafi/vT5tpCpn6"
    },
    {
        "title": "Chocolate-Peanut Butter Patties",
        "ingredients": [
            "1 1/4 cups creamy peanut butter ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "60 vanilla wafer cookies (such as Nilla®) ADVERTISEMENT",
            "1 (11.5 ounce) package milk chocolate chips ADVERTISEMENT",
            "1 tablespoon shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix peanut butter, confectioners' sugar, and vanilla extract together in a small bowl until smooth.\nSpread about 1 teaspoon peanut butter mixture atop each of 30 vanilla wafer cookie and top with another cookie to make 30 sandwiches.\nMix chocolate chips and shortening together in the bowl a double-boiler, cooking and stirring until the chocolate is melted and the mixture is smooth, 5 to 7 minutes; remove from heat.\nLine baking sheets with waxed paper. Dip each cookie sandwich in melted chocolate to coat and place onto waxed paper.\nRefrigerate cookies until the chocolate hardens, 15 to 20 minutes.\n",
        "picture_link": "ZtwLKdM2D9JTIisjspn5zja/ybPkTnq"
    },
    {
        "title": "Sous Vide Cauliflower",
        "ingredients": [
            "1 head cauliflower, cut into 2-inch chunks ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon fish sauce ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat water in sous vide vessel to 185 degrees F (85 degrees C).\nCombine cauliflower, soy sauce, fish sauce, cayenne pepper, and black pepper in a bowl and toss to coat. Place mixture into sous vide bag and vacuum-seal.\nCook cauliflower mixture in sous vide water bath until tender, about 40 minutes.\n",
        "picture_link": "Jq/3tOzI7ecKAH1Fq7FYk57vOBA91r6"
    },
    {
        "title": "Stuffed Pepper Soup",
        "ingredients": [
            "1 1/2 pounds 90%-lean ground beef ADVERTISEMENT",
            "1 large sweet onion, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 bell peppers, stemmed and chopped ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "2 cups prepared salsa ADVERTISEMENT",
            "2 cups tomato sauce ADVERTISEMENT",
            "2 cups chopped canned tomatoes ADVERTISEMENT",
            "1 cup canned black beans, drained ADVERTISEMENT",
            "2 cups cooked rice ADVERTISEMENT",
            "2 cups frozen corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a Dutch oven over medium-high heat. Cook and stir beef, onion, salt, and pepper in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add bell peppers; cook and stir until peppers are softened, about 5 minutes.\nMix chicken stock, salsa, tomato sauce, canned tomatoes, and black beans into ground beef mixture; bring to a boil. Reduce heat to medium and simmer for 45 minutes. Add rice and corn and simmer for 30 minutes more. Season soup with salt and pepper.\n",
        "picture_link": "db3svQkFMeWH3nIiS2d/rVBYipor82O"
    },
    {
        "title": "Spicy Cheesy Mini Meatloaves",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 pound VELVEETA®, cut into 1/2-inch cubes ADVERTISEMENT",
            "1/2 cup crushed tortilla chips ADVERTISEMENT",
            "1 (10 ounce) can RO*TEL Diced Tomatoes and Green Chilies, undrained ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F.\nMix ingredients just until blended.\nPress into 12 muffin pan cups sprayed with cooking spray. Use back of spoon to make indentation in center of each. Place muffin pan on foil-covered rimmed baking sheet.\nBake 20 to 25 min. or until meatloaves are done (160 degrees F).\n",
        "picture_link": "R5CPPR7iGQvsyy4eVnIEYavecBp.gGG"
    },
    {
        "title": "Butternut Chicken and Banana Soup",
        "ingredients": [
            "2 tablespoons coconut oil ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves, cut into chunks ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (15 ounce) can light coconut milk ADVERTISEMENT",
            "2 cups butternut squash cubes ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes with green chile peppers ADVERTISEMENT",
            "3/4 cup sweetened shredded coconut ADVERTISEMENT",
            "2 firm bananas, thickly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt coconut oil in a large pot over medium-high heat. Saute chicken in hot oil until browned completely, about 5 minutes; add celery, onion, curry powder, and garlic and continue to saute until the onion is tender, 8 to 10 minutes more.\nPour chicken broth, water, and coconut milk into the pot; add butternut squash, diced tomatoes with green chile peppers, and coconut. Bring the liquid to a boil, reduce heat to medium-low, and cook the soup at a simmer until the squash is soft, about 40 minutes.\nStir sliced bananas into the soup; simmer until soft, about 5 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Whole Grain Barley and Apple Porridge",
        "ingredients": [
            "1/2 cup hulled barley ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 Golden Delicious apples - peeled, cored, and diced ADVERTISEMENT",
            "2 cups water, or more if needed ADVERTISEMENT",
            "2 teaspoons brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place barley in a bowl and add 1 cup water; soak for 2 hours or overnight. Drain.\nCombine drained barley, apples, 2 cups water, brown sugar, cinnamon, butter, lemon juice, nutmeg, and salt in a saucepan; bring to a boil. Reduce heat to medium-low and simmer until barley and apples are softened and water is absorbed, adding more water if needed, about 1 hour. Remove saucepan from heat and stir walnuts into barley.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Scooter's Tempeh Kale Curry",
        "ingredients": [
            "2 tablespoons coconut oil, divided ADVERTISEMENT",
            "1 (8 ounce) package tempeh, cut into 1/2-inch cubes ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 bunch kale - stems removed and discarded, leaves torn into bite-size pieces ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "3 ounces crumbled goat cheese ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon coconut oil in a large skillet over medium-high heat. Cook and stir tempeh and curry powder in hot oil until fragrant, about 3 minutes. Add onion; cook and stir until slightly softened, about 2 minutes.\nReduced heat to medium and stir kale, remaining coconut oil, and garlic powder into tempeh mixture; cook and stir until kale wilts, about 10 minutes. Transfer to plates and top with goat cheese and sea salt.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]