[
    {
        "title": "Delicious Spinach Manicotti",
        "ingredients": [
            "8 manicotti shells ADVERTISEMENT",
            "1 (15 ounce) container fat-free ricotta cheese ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "2 egg whites, slightly beaten ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon Italian seasoning ADVERTISEMENT",
            "1/8 teaspoon garlic powder, or more to taste ADVERTISEMENT",
            "1 (26 ounce) jar pasta sauce (such as Classico® Florentine Spinach and Cheese) ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook manicotti in boiling water until nearly cooked through yet firm, about 6 minutes; drain.\nPreheat oven to 400 degrees F (200 degrees C).\nMix ricotta cheese, spinach, egg whites, Parmesan cheese, Italian seasoning, and garlic powder together in a bowl; stuff into ricotta shells.\nSpread enough of the pasta sauce into the bottom of a 9x13-inch baking dish to cover completely. Arrange stuffed manicotti shells into the pan. Pour remaining pasta sauce over the stuffed shells. Cover dish tightly with aluminum foil.\nBake in preheated oven until the filling is set and hot in the center, about 45 minutes.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nRemove aluminum foil from baking dish. Sprinkle mozzarella over the manicotti.\nCook under broiler until cheese is melted and slightly browned, 2 to 3 minutes.\n",
        "picture_link": "RKIAC4Aqfdb7d36ovVm25GSkbpnKz0a"
    },
    {
        "title": "Strawberries for Shortcake",
        "ingredients": [
            "4 cups chopped fresh strawberries ADVERTISEMENT",
            "1/3 cup dark corn syrup ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine strawberries with dark corn syrup in a saucepan over medium heat, bring to a boil, and reduce heat to low. Stir until mixture simmers and strawberries give up their juice, about 10 minutes. Remove from heat and stir in sugar and lemon juice until sugar has dissolved. Let cool to room temperature and chill before serving.\n",
        "picture_link": "xV7gqzG7UUWoAdf.IVM9FJQwuFysoeS"
    },
    {
        "title": "Cran Berry Berry Felicita (Happiness)",
        "ingredients": [
            "1 cup cranberry juice ADVERTISEMENT",
            "1/2 cup frozen raspberries ADVERTISEMENT",
            "1/2 cup frozen strawberries ADVERTISEMENT",
            "1/2 cup vanilla yogurt ADVERTISEMENT",
            "1 tablespoon vanilla-flavored protein powder ADVERTISEMENT",
            "2 fresh strawberries, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend cranberry juice, raspberries, strawberries, yogurt, and protein powder in a blender until it is your desired consistency; pour into 2 glasses. Garnish each with a strawberry.\n",
        "picture_link": "AzMbR5bMFa3TR9LKroE0qYl/10jl8d."
    },
    {
        "title": "Porcupine Meatballs in Tomato Sauce",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 cup instant rice ADVERTISEMENT",
            "1 white onion, chopped ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "28 fluid ounces water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground beef, rice, onion, and egg together in a bowl with your hands; shape into tennis-ball sized balls.\nStir tomato sauce and water together in a large pot; bring too a boil. Gently lie meatballs into the sauce, place cover on the pot, and reduce heat to medium-low.\nCook until meatballs are no longer pink in the center, about 35 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\nPut meatballs on a plate, cut each into halves, and ladle sauce over the meatballs to serve.\n",
        "picture_link": "tldEoDIhPO6HKH.3huSE/UJD6Vgjygi"
    },
    {
        "title": "Sweet Baked Delicata Squash",
        "ingredients": [
            "1 tablespoon butter, or as needed ADVERTISEMENT",
            "2 large delicata squash - halved lengthwise, seeded, and cut into 1/4-inch slices ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Generously butter a baking dish.\nSpread squash slices into prepared baking dish.\nBake in preheated oven for 15 minutes.\nStir brown sugar, honey, cinnamon, ginger, and salt together in a bowl; drizzle over the squash.\nContinue baking squash in oven until completely tender, 15 to 20 minutes more.\n",
        "picture_link": "QzjGlBAoknkujSSr7CrcxdX/lEYW1q."
    },
    {
        "title": "5 Minute Slaw",
        "ingredients": [
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/3 teaspoon celery seed ADVERTISEMENT",
            "3 green onions, thinly sliced ADVERTISEMENT",
            "2 (8 ounce) packages coleslaw mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk red wine vinegar, sugar, salt, celery seed, and green onions in a salad bowl until sugar and salt have dissolved. Toss coleslaw mix with dressing. Refrigerate 4 to 6 hours.\n",
        "picture_link": "yabBCwvNtHxuwjNUTZr5eOCS3K4WM9a"
    },
    {
        "title": "Zucchini Soup with Curry Spices",
        "ingredients": [
            "1 1/2 pounds zucchini, sliced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger, grated ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon mustard seeds ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground cardamom ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 cup vegetable stock ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "4 cinnamon sticks (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add zucchini, cover, and steam until slightly tender, 5 to 6 minutes.\nHeat butter in a saucepan over medium heat; cook and stir onion in the melted butter until tender and translucent, 5 to 10 minutes.\nMix grated ginger, cumin, coriander, mustard seeds, ground cinnamon, turmeric, cardamom, cayenne pepper, sea salt, and black pepper in a small bowl. Mix spice mixture into onions until coated.\nMix zucchini into onion mixture; cook and stir until heated through, 2 to 3 minutes. Pour vegetable stock over zucchini mixture; stir well. Simmer until vegetables are tender, 8 to 10 minutes.\nPour zucchini mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\nPour soup into 4 serving bowls; garnish each bowl with 1 tablespoon cilantro and 1 cinnamon stick.\n",
        "picture_link": "31ypkBm4LmyIAH06XBv9xAj8lMzoH3y"
    },
    {
        "title": "Marion's Super Easy Corn Crab Bisque",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 white onion, finely diced ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "2 (15 ounce) cans cream-style corn ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of potato soup ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "2 (6 ounce) cans lump crabmeat ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat; cook and stir onion and garlic in butter until onion is tender, 7 to 8 minutes. Add cream-style corn and cream of potato soup and reduce heat to medium-low; slowly bring to a simmer, stirring frequently. Stir cream and crab into soup, stirring until heated through, about 5 minutes. Season with salt and pepper. Garnish with green onions.\n",
        "picture_link": "kdyQqVcNaeygZjTkLHAEc2jAq7H51yS"
    },
    {
        "title": "Idahoan Molten Lava Cakes",
        "ingredients": [
            "4 ounces bittersweet chocolate, broken into small pieces ADVERTISEMENT",
            "4 ounces semisweet chocolate, broken into small pieces ADVERTISEMENT",
            "1/4 cup unsalted butter, cut into small pieces ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1/4 cup Idahoan® Boxed Original Mashed Potatoes, dry ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon instant espresso powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F.\nLiberally spray six 6 oz ramekins with nonstick cooking spray and place on a baking sheet.\nIn a double boiler, melt the chocolate and butter.\nAlternative: Use a medium size stainless bowl that sits on top of a small saucepan (with water in saucepan) if you do not have a double boiler. Do not let any water get into the melting chocolate.\nRemove from heat and cool.\nIn a large mixing bowl beat eggs with hand mixer for several minutes and thoroughly foamy.\nAdd sugar, dry mashed potatoes, cocoa powder, vanilla extract, espresso powder and salt. Beat a couple of minutes to mix.\nAdd the melted chocolate mixture and beat for five minutes. This recipe works best if lots of air is incorporated into the mixture to make the cakes light and airy.\nPour into ramekins. DO NOT under bake or over bake the cakes. Bake for 15 to 17 minutes. Keep your eye on them; you want them to be molten (a bit soft in the middle), but not too much.\nLet them rest a few minutes before serving. The center may sink a little - don't worry.\nRun a thin knife around the inside edge to help release the cakes.\nTop with powdered sugar and whip cream.\n",
        "picture_link": "PJbtmGRnzMCMLeQV3ekXJHk8iUuuS.y"
    },
    {
        "title": "Bacon-Wrapped Leg of Lamb with Red Wine Reduction",
        "ingredients": [
            "1 (4 pound) leg of lamb ADVERTISEMENT",
            "3 cloves garlic, slivered ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon minced fresh rosemary ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1/2 cup dry red wine ADVERTISEMENT",
            "1 cup beef stock ADVERTISEMENT",
            "1 teaspoon tomato paste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim excess fat and thin membrane from leg of lamb; place into roasting pan. Cut slits in the meat and insert garlic slivers into slits. Mix olive oil, lemon juice, and rosemary in a small bowl; brush mixture over lamb. Lay bacon slices onto the meat. Let roast stand at room temperature for 30 minutes.\nPreheat oven to 325 degrees F (165 degrees C).\nRoast lamb in the preheated oven until an instant-read meat thermometer inserted into the thickest part of the leg, not touching bone, reads 145 degrees F (65 degrees C) for medium-rare or 160 degrees F (70 degrees C) for medium, 1 1/2 to 1 3/4 hours. Transfer lamb to a serving platter, cover loosely with aluminum foil, and let stand while you make the sauce.\nSkim and discard excess grease from pan drippings left in roasting pan; place roasting pan over medium heat. Cook and stir onion in drippings until translucent, about 5 minutes; pour in wine. Stir wine and pan drippings, scraping up and dissolving brown bits of food stuck on the bottom of the pan. Pour in stock, bring sauce to a boil, and reduce heat to low. Stir tomato paste into sauce, bring to a simmer, and cook until sauce has reduced to about 1 cup. Season with salt and black pepper. For a smoother sauce, strain before serving.\n",
        "picture_link": "OVxkR8gaBEKpmHB37607epyQfWmg4j2"
    },
    {
        "title": "Shonna's Waffle Browns",
        "ingredients": [
            "2 cups rehydrated Idahoan® Hash Browns ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped red pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "Sour cream ADVERTISEMENT",
            "Salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix eggs with hash browns.\nStir in veggies and seasonings.\nSpray or brush oil on your waffle iron and heat up.\nPour enough batter to cover the lower cooking surface. Close lid and cook per manufacturers instructions until golden brown.\nServe hot with sour cream and salsa.\n",
        "picture_link": "WSY4SLtKLV4e0or1O1KGYd/6PMiSQr2"
    },
    {
        "title": "Quick Mango Chicken Curry",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 large onion, halved lengthwise and thinly sliced ADVERTISEMENT",
            "1 green bell pepper, thinly sliced (optional) ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1 tablespoon water, or as needed ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves, cut into cubes ADVERTISEMENT",
            "1 cup mango nectar ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a wide-bottomed saucepan or deep skillet over medium heat; cook and stir onion and bell pepper in the hot oil until onion is translucent and bell pepper is tender, 5 to 10 minutes.\nCombine garlic, curry powder, paprika, black pepper, ginger, and cayenne pepper in a bowl; stir in water until paste-like. Add curry paste to onion mixture.\nMix chicken into onion mixture until chicken is coated in curry paste; cook and stir until chicken is lightly browned on all sides, about 5 minutes.\nStir mango nectar, tomato paste, and vinegar into chicken mixture. Reduce heat and simmer until sauce is thickened and chicken is no longer pink in the center, about 15 minutes.\n",
        "picture_link": "pH3YdDs8XBTfK2IQHvgRTwWRmiThk0K"
    },
    {
        "title": "White and Sweet Whipped Potatoes",
        "ingredients": [
            "2 pounds russet potatoes, peeled and cut into cubes ADVERTISEMENT",
            "1 pound sweet potatoes, peeled and cut into cubes ADVERTISEMENT",
            "1 tablespoon chicken bouillon granules ADVERTISEMENT",
            "3/4 cup milk, warmed ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 1/2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1/4 teaspoon allspice ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine russet potatoes and sweet potatoes in a large pot. Pour enough water over the potatoes to cover; add chicken bouillon. Bring water to a boil. Reduce heat to medium-low and simmer until tender, 15 to 20 minutes; drain.\nDump drained potatoes in a large bowl; add milk, butter, brown sugar, salt, pepper, allspice, and nutmeg. Whip the potato mixture with a potato masher or immersion blender until a desired consistency is reached.\n",
        "picture_link": "Y2vlvSJIz.hxODBMS9r9DfSWFXzb6Qu"
    },
    {
        "title": "Mamaw's BBQ Rub",
        "ingredients": [
            "1/4 cup paprika ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 teaspoon meat tenderizer ADVERTISEMENT",
            "1/2 teaspoon onion salt ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix paprika, chili powder, mustard, meat tenderizer, onion salt, garlic salt, and basil in a bowl.\n",
        "picture_link": "KYXi.EdthhJLmb.3VS8jm8OtBv5zmdy"
    },
    {
        "title": "Jean's Zucchini Salad",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "1 1/2 cups thinly sliced zucchini ADVERTISEMENT",
            "1/2 cup thinly sliced celery ADVERTISEMENT",
            "1/4 red onion, thinly sliced ADVERTISEMENT",
            "1/4 green bell pepper, thinly sliced ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "6 tablespoons white sugar, or to taste ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 tablespoon wine vinegar ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix zucchini, celery, red onion, and bell pepper in a bowl.\nWhisk sugar, rice vinegar, water, both amounts of vegetable oil, wine vinegar, basil, salt, and black pepper together in a separate bowl. Drizzle dressing over zucchini mixture; toss to coat. Refrigerate until chilled, 1 to 2 hours.\n",
        "picture_link": "DYylKmgAdihsYvP/Y4EQ7gTOHAVvpjW"
    },
    {
        "title": "Greek Mango Salad",
        "ingredients": [
            "9 tomatoes, cut into cubes ADVERTISEMENT",
            "3 English cucumbers, cut into cubes ADVERTISEMENT",
            "2 red bell peppers, cut into cubes ADVERTISEMENT",
            "2 yellow bell peppers, cut into cubes ADVERTISEMENT",
            "2 orange bell peppers, cut into cubes ADVERTISEMENT",
            "3 mangoes, cut into bite-size pieces ADVERTISEMENT",
            "2 avocados, cut into bite-size pieces ADVERTISEMENT",
            "1 cup balsamic vinegar, or to taste ADVERTISEMENT",
            "1/4 cup Greek seasoning, or to taste ADVERTISEMENT",
            "6 leaves romaine lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomatoes, cucumbers, red bell peppers, yellow bell peppers, orange bell peppers, mangoes and avocados in a large bowl. Add balsamic vinegar and Greek seasoning. Stir salad gently. Set aside for 10 minutes.\nArrange lettuce leaves onto a platter to make a bed of lettuce. Spoon salad mixture onto lettuce.\n",
        "picture_link": "rj1l2nRuv25o4VQreIepTsoP6iXISJW"
    },
    {
        "title": "Tuna Pita Melt",
        "ingredients": [
            "1/2 pita bread round ADVERTISEMENT",
            "1/4 cup tuna, drained ADVERTISEMENT",
            "1/2 dill pickle spear, diced ADVERTISEMENT",
            "1 1/2 teaspoons mayonnaise ADVERTISEMENT",
            "1 1/2 teaspoons olive oil ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 pinch dried rosemary ADVERTISEMENT",
            "1 slice Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly toast pita bread.\nBreak tuna chunks into small pieces in a bowl; stir in pickle, mayonnaise, olive oil, garlic powder, and rosemary until evenly blended.\nPlace Swiss cheese into the pocket of the toasted pita bread and spoon in tuna mixture.\nHeat pita sandwich in the microwave on a microwave-safe dish until cheese is melted, 15 to 20 seconds.\n",
        "picture_link": "aSdj1o9Buk7.4U3ifPicN/OrUbNYi0S"
    },
    {
        "title": "Easy Peach Pie",
        "ingredients": [
            "1 (9 inch) deep dish graham cracker pie crust ADVERTISEMENT",
            "5 fresh peaches - peeled, pitted and sliced ADVERTISEMENT",
            "1 (18 ounce) jar peach glaze ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine peaches and glaze in a mixing bowl. Let stand for a couple of minutes.\nCombine sugar and cream cheese. Mix with an electric mixer on high speed for one minute. Gradually add in the nondairy whipped topping, and mix on medium speed until you have a smooth consistency. Poor mixture into pie shell. Pour peach mixture on top. Cover, and chill for 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Osgood Pie",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup golden raisins ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter and sugar. Mix in egg yolks, and then the spices. Fold in the fruit and nuts.\nIn another bowl, beat egg whites until firm. Fold into fruit and nut mixture. Divide into two pie shells.\nBake at 350 degrees F (175 degrees C) for 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Egg Tarts I",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "5/8 cup butter ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "7 tablespoons confectioners' sugar ADVERTISEMENT",
            "2 tablespoons evaporated milk ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 1/8 cups boiling water ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "2 tablespoons custard powder ADVERTISEMENT",
            "1/4 teaspoon distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nCream butter and confectioners' sugar. Mix in egg yolk, flour, and 2 tablespoons evaporated milk. Roll dough out thinly, and cut out rounds with a fluted cutter. Place into tart molds.\nBake for 12 minutes.\nBeat eggs. Mix in 1/5 cup evaporated milk, custard powder, and white vinegar. Dissolve sugar in boiling water, and pour into custard mixture. Mix well, and let stand to remove air bubbles. Pour the egg custard into the baked tart shells.\nBake for 10 minutes. Cool.\n",
        "picture_link": "BaU2ppOc36QCWmEzPNEvX7nawvdS1Qu"
    },
    {
        "title": "Apricots and Dumplins",
        "ingredients": [
            "5 cups fresh apricots, pitted and sliced ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "8 (6 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine apricots, water, sugar, lemon juice, salt, and butter and margarine in a large pot. Cook over medium low heat till apricots are thoroughly cooked. You may need to adjust the water or sugar, depending on the tartness and the amount of cooking. The apricots need to be very sweet and very juicy.\nCut the tortillas into 1 inch strips.\nAdd tortilla strips to the apricots a few at a time. Cook about 20 minutes on very low heat.\nThis cobbler can also be made in a 3 quart casserole dish, and baked in the oven at 350 degrees F (175 degrees C) for about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Two Minute Chili Pie",
        "ingredients": [
            "1 (9 inch) deep dish pie crust ADVERTISEMENT",
            "2 (15 ounce) cans chili with beans ADVERTISEMENT",
            "1 (15 ounce) can green beans, drained ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix chili, green beans, and cheese. Pour into unbaked crust.\nBake at 375 F (190 degrees C) for 40 minutes or until bubbly and crust is brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Berry Pie",
        "ingredients": [
            "4 (3 ounce) packages strawberry flavored Jell-O® ADVERTISEMENT",
            "4 tablespoons cornstarch ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 quart fresh strawberries, hulled ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan combine gelatin power, cornstarch, sugar and boiling water. Cook over medium-high heat, stirring frequently, until mixture boils and thickens. Let cool to room temperature while you prepare the berries.\nAdd berries to the cooled gelatin mixture. Stir gently to coat, then pour all into crust. Chill uncovered for 1 hour, then cover and store in refrigerator.\n",
        "picture_link": "EbVprPFux9GN2jUdv713t22qB03yYFG"
    },
    {
        "title": "Mock Graham Cracker Crust",
        "ingredients": [
            "1/3 cup cream cheese, softened ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 cup high protein wheat flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream the cheese and butter together with the sugar. Work in the flour a tablespoon at a time until the dough has the grainy consistency of a graham cracker crust. (May take a little more or a little less than 1 cup of flour.)\nRoll up into a ball, wrap in plastic wrap, and put in refrigerator for 15 to 30 minutes to develop some body. Put in pie plate and pat down to cover bottom and sides.\nIf your pie filling is pre-cooked, you will want to bake the crust. Preheat the oven to 325 degrees F (165 degrees C). Bake for 15 to 20 minutes, or until edges start to darken.\n",
        "picture_link": "vUkXeVKSsY.GpNn5fcRQ5f/Er5zreqy"
    },
    {
        "title": "Skinny Piecrust",
        "ingredients": [
            "1/2 cup sifted all-purpose flour ADVERTISEMENT",
            "1/2 cup reduced fat margarine ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Important: have diet margarine at room temperature. Sift flour, salt, and baking powder together in a deep bowl. Add margarine all at once. Cut in with fork or pastry blender and continue mixing until no pastry sticks to the sides of the bowl. Shape into a ball and wrap in wax paper. Refrigerate until thoroughly chilled (one hour or more).\n",
        "picture_link": "MbHnvQZH.mCm1faUyuVXTWIEThtdvAy"
    },
    {
        "title": "Rhubarb Pie III",
        "ingredients": [
            "2 pounds rhubarb, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 drops red food coloring (optional) ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nCombine sliced rhubarb with sugar, flour and nutmeg and mix lightly. Add red food coloring, if using, and mix well.\nPlace mixture into unbaked 9 inch pie shell and dot with butter. Cover with top pastry and cut design in top crust for steam to escape.\nBake for 30 minutes or until crust is golden brown and fruit is bubbly. Let cool and serve.\n",
        "picture_link": "ee98agm3O/gLko9W3e7yDYG746u9R9G"
    },
    {
        "title": "Ricotta Cheese Pie II",
        "ingredients": [
            "1 pint part-skim ricotta cheese ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ricotta cheese in strainer. Drain for about 1 hour, or until most of liquid has been discarded.\nCombine ricotta, sugar, flour, lemon juice, salt, egg yolks, evaporated milk, and milk in a large bowl; mix well.\nIn a separate bowl, beat egg whites until firm. Fold into batter until smooth. Divide filling into pie crusts.\nBake pies for 15 minutes at 425 degrees F (220 degrees C). Reduce oven to 350 degrees F (175 degrees C), and bake for an additional 25 minutes or until a knife inserted in the center comes out clean. Cool on wire racks. Refrigerate.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "BEST Garlic Parmesan Croutons",
        "ingredients": [
            "8 (1/2 inch thick) slices French bread, cut into 3/4-inch cubes ADVERTISEMENT",
            "1 tablespoon creole seasoning (such as Emeril's Bayou Blast!®), or more to taste ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "6 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 clove garlic, sliced thin ADVERTISEMENT",
            "1/8 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nPut cubes in a large bowl and season generously with creole seasoning.\nMelt butter in a saucepan over medium-low heat. Stir Parmesan cheese, garlic, and onion powder into the melted butter; pour over the bread cubes and toss to coat. Spread bread cubes onto a large baking sheet.\nBake in preheated oven for 10 minutes, stir, and continue baking until golden brown and crispy, about 10 minutes more.\n",
        "picture_link": "TbUdzDA8.vtluJyzSpZa/u/XBLCLbi6"
    },
    {
        "title": "Spring Tea Strawberry Soup",
        "ingredients": [
            "2 cups sliced strawberries ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup half and half ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "8 whole strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend sliced strawberries, sour cream, half and half, sugar, and vanilla extract in a blender until smooth. Divide soup into 8 chilled bowls. Top each with a whole strawberry.\n",
        "picture_link": "UP4NEPP3lR18WiRt2vGK9M/DD593ZIS"
    },
    {
        "title": "Baked Ziti Plus",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "2 (28 ounce) cans crushed tomatoes ADVERTISEMENT",
            "1 (28 ounce) can tomato puree ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 pounds Italian link sausage ADVERTISEMENT",
            "2 green bell peppers, cut into 1/2-inch strips ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "2 (16 ounce) packages rigatoni ADVERTISEMENT",
            "2 (16 ounce) packages mozzarella cheese ADVERTISEMENT",
            "1 (24 ounce) carton ricotta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a stockpot over medium-low heat; cook and stir garlic in the hot oil until lightly browned, 1 to 2 minutes.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir ground beef into garlic. Add crushed tomatoes and tomato puree to ground beef mixture; season with salt and pepper. Cover stockpot and simmer mixture, stirring occasionally, until flavors have blended, about 2 hours.\nHeat a large skillet over medium-high heat. Cook sausage links in the hot skillet until browned and not longer pink in the center, 10 to 15 minutes; drain and discard grease. Slice sausages into 1/4-inch rounds. Stir sausage, green bell pepper, and onion into the simmering tomato sauce; cook, stirring occasionally until bell pepper and onion are softened, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until cooked through but firm to the bite, 10 to 11 minutes. Drain and return rigatoni to pot.\nDice about 3/4 the mozzarella into 1/8-inch cubes. Mix cubed mozzarella with ricotta cheese in a bowl. Stir cheese mixture into cooked rigatoni until mozzarella cheese begins to melt. Pour rigatoni-cheese mixture into 2 large casserole dishes; add tomato-meat sauce. Toss well.\nSlice the remaining mozzarella cheese and arrange on top of rigatoni mixtures.\nBake in the preheated oven until mozzarella cheese is melted and browned, about 45 minutes.\n",
        "picture_link": "VL78aBkxFfXzl11OQz4pSVaQd3zi/oe"
    },
    {
        "title": "Sausage-Filled Stars",
        "ingredients": [
            "1 (16 ounce) package square wonton wrappers ADVERTISEMENT",
            "1 pound sage-flavored bulk sausage ADVERTISEMENT",
            "2 cups shredded Colby cheese ADVERTISEMENT",
            "1 bunch green onions, chopped fine ADVERTISEMENT",
            "1/2 red bell pepper, chopped fine ADVERTISEMENT",
            "1/2 green bell pepper, chopped fine ADVERTISEMENT",
            "1/2 cup ranch salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLine each cup a mini-muffin pan with a wonton wrapper, carefully pressing each into the shape of a cup. Take care to not tear the wrapper as they will tear easily.\nBake in preheated oven until golden brown, 8 to 10 minutes. Transfer 'cups' to a baking sheet; repeat until remaining wontons are all baked.\nHeat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned completely, 5 to 7 minutes; drain and discard grease. Set sausage aside to cool.\nStir cooled sausage, Colby cheese, green onions, red bell pepper, green bell pepper, and ranch salad dressing together in a bowl; spoon into the wonton cups.\nBake in oven until cheese has melted and is beginning to bubble, 15 to 20 minutes.\n",
        "picture_link": "x2u1SK6VIcPgQMhv0UPkhzjBomFAZg6"
    },
    {
        "title": "Chicken Marsala from Birds Eye®",
        "ingredients": [
            "2 tablespoons butter or margarine, divided ADVERTISEMENT",
            "1 pound boneless, skinless chicken breasts, pounded thin ADVERTISEMENT",
            "1 (12 ounce) bag Birds Eye® Recipe Ready Marsala Blend ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup Marsala wine ADVERTISEMENT",
            "1/4 cup beef broth ADVERTISEMENT",
            "1/2 teaspoon dried thyme (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 2 tablespoons butter over medium-high heat and cook chicken, turning once, 6 minutes or until golden brown. Remove chicken; set aside.\nIn same skillet add Recipe Ready Marsala Blend, and cook over medium-high heat, stirring occasionally, 6 minutes or until liquid is almost absorbed. Sprinkle with flour and cook, stirring constantly, 1 minute. Stir in wine and broth; bring to a boil.\nReduce heat to low and add back chicken. Simmer 4 minutes or until sauce is thickened and chicken is thoroughly cooked.* Season, with salt and black pepper.\n",
        "picture_link": "1J6O52Xgx81z/RPkWmRdJsb4x3sJWTS"
    },
    {
        "title": "Forgotten Puffs (Chocolate Chip Meringue Cookies)",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup miniature chocolate chips ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nBeat egg whites in a glass or metal bowl until foamy. Gradually add sugar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks. Add vanilla extract and stir. Fold chocolate chips and pecans into the mixture. Drop by teaspoonful onto prepared baking sheet.\nBake in preheated oven for 1 minute. Turn oven off and let cookies continue to bake as the oven cools until light and crispy, 5 hours to overnight.\n",
        "picture_link": "SZjdzbv4mm.C4dCxBVPt9OJGGtH0ZJi"
    },
    {
        "title": "Cheese Stuffed Manicotti",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1 teaspoon roasted garlic ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes with garlic and onion ADVERTISEMENT",
            "1 (12 ounce) can tomato paste ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "1 (8 ounce) package manicotti shells ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "30 ounces cottage cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef, onion, and roasted garlic in the hot skillet until browned and crumbly, 5 to 7 minutes. Continue to simmer until pan juices evaporate, about 10 minutes more. Add diced tomatoes, tomato paste, sugar, 1 1/2 teaspoons salt, oregano, thyme, bay leaf, 1/2 teaspoon pepper, and garlic salt; bring to a boil. Reduce heat to medium-low and simmer until flavors blend, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook manicotti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain and cool slightly.\nMix mozzarella cheese, cottage cheese, 1/4 cup Parmesan cheese, egg, 1/2 teaspoon salt, and 1/2 teaspoon pepper in a bowl. Spoon a generous amount of the cheese mixture into each manicotti shell.\nPour enough tomato-beef sauce to cover the bottom of a 9x13-inch baking dish. Arrange stuffed manicotti over sauce; pour remaining sauce over pasta. Cover with aluminum foil.\nBake in the preheated oven until bubbly, about 30 minutes. Sprinkle remaining 1/4 cup Parmesan cheese over manicotti and return to the oven. Bake until cheese filling is melted, 10 to 15 minutes more.\n",
        "picture_link": "3mVXgoBHgaWRYrW/QtFs6XdsJ4gr/nO"
    },
    {
        "title": "Sugar Spanish Peanuts",
        "ingredients": [
            "2 cups raw Spanish peanuts with skins ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with a plain paper bag or parchment paper.\nMix peanuts, sugar, and water together using a wooden spoon in a large pot over medium-low heat; cook, stirring constantly, until liquid is evaporated and peanuts are coated, 20 to 30 minutes. Carefully pour coated peanuts onto the prepared baking sheet to cool completely.\n",
        "picture_link": "9tqOIzp/cgY4myDnJWadz.EOvvAJ9Ca"
    },
    {
        "title": "Strawberry Graham Cracker Bites",
        "ingredients": [
            "30 sliced fresh strawberries ADVERTISEMENT",
            "1 (7 ounce) can whipped cream ADVERTISEMENT",
            "1 (13 ounce) jar chocolate-hazelnut spread (such as Nutella®) ADVERTISEMENT",
            "30 fresh blueberries ADVERTISEMENT",
            "1 (14.4 ounce) package mini graham crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the bottoms of each strawberry so they can stand upright on a plate; hollow out the top of each strawberry. Spoon whipped cream and chocolate-hazelnut spread into the hollow part of each strawberry; top with 1 blueberry. Cover each filled strawberry with a mini graham cracker.\n",
        "picture_link": "3Puee4MxsXgsqpX69KTbAnBAviYAE/K"
    },
    {
        "title": "Coney Island Hot Dog Chili Sauce",
        "ingredients": [
            "3/4 pound ground round ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 (12 ounce) can tomato paste ADVERTISEMENT",
            "1/2 cup sweet pickle relish ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "4 teaspoons chili powder, or more to taste ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add water, tomato paste, pickle relish, onion, Worcestershire sauce, mustard, chili powder, salt, and sugar; bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until sauce is thickened, about 30 minutes.\n",
        "picture_link": "STpK9TPklm7qodClH09b7oWo1rdqxLO"
    },
    {
        "title": "SpiceBurgs",
        "ingredients": [
            "1 egg, beaten ADVERTISEMENT",
            "1/3 cup barbeque sauce ADVERTISEMENT",
            "1 1/2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1/3 onion, minced ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1/3 cup light sour cream, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nWhisk egg, barbeque sauce, Worcestershire sauce, cayenne pepper, garlic powder, and black pepper together in a large bowl; add ground beef and mix well. Mix bread crumbs and minced onion into the ground beef mixture. Scoop sour cream into the beef mixture by the spoonful; continue mixing and adding sour cream just until moist. Form mixture into 6 large patties.\nCook the patties until they are very firm, hot, and grey in the center, 6 to 8 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\n",
        "picture_link": "RK8mLC7rOGbmPbqhgPOUbIH3zBoeC8C"
    },
    {
        "title": "Tropical Sunshine Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup cubed fresh mango ADVERTISEMENT",
            "1/2 cup cubed fresh pineapple ADVERTISEMENT",
            "1/2 cup coconut water ADVERTISEMENT",
            "1/2 teaspoon freshly squeezed lime juice ADVERTISEMENT",
            "1 sprig fresh chocolate mint, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend banana, orange juice, mango, pineapple, coconut water, lime juice, mint in a blender until smooth.\n",
        "picture_link": "gDpYMtvRPW.nm7ljoo8.RiyGvCzlDmu"
    },
    {
        "title": "Crescent Roll Zucchini Quiche",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 zucchini, thinly sliced ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "1 1/2 teaspoons minced garlic, or to taste ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups half-and-half ADVERTISEMENT",
            "7 eggs ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup shredded Havarti cheese ADVERTISEMENT",
            "1/2 teaspoon nutmeg ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent rolls, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9x9-inch baking dishes.\nHeat butter in a skillet over low heat; cook and stir zucchini, onion, garlic, Italian seasoning, salt, and black pepper in the melted butter until zucchini and onion are tender, about 10 minutes. Drain any excess liquid from zucchini. Remove skillet from heat and cool, 15 to 20 minutes.\nWhisk half-and-half and eggs together in a bowl; stir in zucchini mixture, mozzarella cheese, Havarti cheese, and nutmeg. Season with salt and pepper.\nUnroll crescent roll dough and tear sheet in half. Press each half into the prepared baking dishes, forming a crust. Pour egg mixture evenly into each crust.\nBake in the preheated oven until crust is golden and quiche is set in the middle, about 45 minutes.\n",
        "picture_link": "yeJn2ZGa/d/4eRg.fzhOBHEusa9iA3W"
    },
    {
        "title": "Pizza Supreme",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (12 ounce) bag Birds Eye® Recipe Ready Pizza Supreme Blend ADVERTISEMENT",
            "1 (10 ounce) pre-baked whole wheat or regular pizza crust ADVERTISEMENT",
            "1 cup prepared pizza sauce ADVERTISEMENT",
            "1 ounce sliced pepperoni ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F.\nHeat oil in large nonstick skillet over medium-high heat and cook Recipe Ready Pizza Supreme Blend, stirring occasionally, 10 minutes or until vegetables are softened and any liquid is absorbed.\nArrange pizza crust on baking sheet and evenly spread with pizza sauce. Top with vegetable mixture and pepperoni. Sprinkle with cheese. Bake 10 minutes or until cheese is melted.\n",
        "picture_link": "c9BG5uofQatVHZ8m.FaBfkW5kohaV/2"
    },
    {
        "title": "Basic 100% Whole Wheat Pie Crust",
        "ingredients": [
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "1 tablespoon wheat gluten ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup vegetable shortening ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon water, or more as needed ADVERTISEMENT",
            "21 tablespoons whole wheat flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix 3/4 cup flour, gluten, and salt together in a bowl. Cut shortening into flour mixture using a pastry blender until mixture is crumbly. Mix 2 tablespoons plus 1 teaspoon water into the flour mixture using your hands until dough easily forms a ball; add more water if needed.\nFlatten dough into a pancake-like shape on a floured surface; sprinkle top of dough liberally with about 1 tablespoon flour. Roll dough, using a rolling pin, into a thin pie crust about 1-inch larger than your pie pan. Roll the crust onto the rolling pin and transfer to the pie pan.\n",
        "picture_link": "RL1Fa6rmXCVnZnah.gUI5A2WGMxrbl."
    },
    {
        "title": "Ranchy Fruit and Nut Salad",
        "ingredients": [
            "2 cups mixed salad greens ADVERTISEMENT",
            "1/4 cup ranch dressing ADVERTISEMENT",
            "3/4 cup diced tomato ADVERTISEMENT",
            "3/4 cup dried cranberries ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "1/3 cup almonds ADVERTISEMENT",
            "2 tablespoons flax seeds ADVERTISEMENT",
            "1/3 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon chopped garlic ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix salad greens and ranch dressing together in a bowl until evenly coated. Add tomato, cranberries, sunflower seeds, almonds, flax seeds, sea salt, and garlic; mix well. Top with Parmesan cheese.\n",
        "picture_link": "if96zOOG2M4q6wm081uJ253M3ut3FW6"
    },
    {
        "title": "Cucumber and Onion Relish",
        "ingredients": [
            "7 large cucumbers, grated ADVERTISEMENT",
            "5 large onions, grated ADVERTISEMENT",
            "2 tablespoons salt, or as needed ADVERTISEMENT",
            "3 cups white vinegar ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cucumbers, onions, and salt together in a colander fitted over a bowl; place in the refrigerator for cucumbers and onions to drain, 8 hours to overnight.\nMix vinegar, sugar, water, flour, turmeric, ginger, and black pepper in a large saucepan; bring to a boil. Cook, stirring occasionally, until mixture is thickened, about 5 minutes. Add cucumbers and onions; boil for about 10 more minutes.\nSterilize jars and lids in boiling water for at least 5 minutes. Pack the relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for about 15 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "7SDzetUyW5D4jMIEkA9/zPSnWdMbscK"
    },
    {
        "title": "GG's Shortbread Cookies",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 cup cornstarch ADVERTISEMENT",
            "3 cups all-purpose flour, divided ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup white sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter, 1 1/2 cup white sugar, and confectioners' sugar together in a bowl using an electric mixer until smooth and creamy; mix in cornstarch and 2 cups flour. Make a well in the center of the dough; add egg and mix well. Knead the remaining 1 cup flour into dough using your hands until dough pulls away from the sides of the bowl.\nRoll dough into walnut-sized balls. Pour 1/4 cup white sugar into a bowl; dip top of each ball in sugar. Arrange balls on a baking sheet. Slightly flatten each ball using the bottom of a drinking glass.\nBake in the preheated oven until edges of cookies are lightly browned, about 5 minutes. Cool in the pans for 5 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "r7SgZUVnadF5oBl2yG7LzxPw/1AKNi6"
    },
    {
        "title": "Cheesy Ham 'n' Hash Brown Casserole",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup chopped mushrooms ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "4 cups frozen shredded hash brown potatoes, thawed ADVERTISEMENT",
            "2 cups diced cooked ham ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "1 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 3-quart baking dish.\nHeat olive oil in a large skillet over medium heat; cook and stir mushrooms, onion, and bell pepper in hot oil until onions are translucent, about 5 minutes. Transfer vegetables to a large bowl.\nStir hash brown potatoes, ham, cream of chicken soup, sour cream, about 3/4 cup Cheddar cheese, and about 3/4 cup Parmesan cheese into vegetables. Spread potato mixture into the prepared baking dish. Sprinkle remaining 1/4 cup Cheddar cheese and 1/4 cup Parmesan cheese over potato mixture.\nBake in the preheated oven until bubbly and cheese is melted, 40 to 45 minutes. Let stand for 5 minutes before serving.\n",
        "picture_link": "djiVEPrpkFiOyHwCjsANf/buk/JisVy"
    },
    {
        "title": "Garlic Crouton Slices",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 French baguette, cut into 1-inch thick slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Cover a baking sheet with parchment paper.\nStir olive oil, garlic powder, onion powder, salt, and pepper together in a large mixing bowl; add bread slices and toss to coat. Arrange bread onto prepared baking sheet.\nBake until crispy and no longer soft, about 8 minutes.\n",
        "picture_link": "aXLZHSolTtmIqmGRhXjAdaayZKGsnDO"
    },
    {
        "title": "Spicy Mexican Tuna Salad",
        "ingredients": [
            "1 (5 ounce) can tuna, drained ADVERTISEMENT",
            "1 cup frozen peas, thawed and drained ADVERTISEMENT",
            "2 chipotle peppers in adobo sauce, or more to taste - chopped ADVERTISEMENT",
            "1 tablespoon mayonnaise, or to taste ADVERTISEMENT",
            "1/4 teaspoon dried minced onion, or to taste ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "1 pinch ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tuna, peas, chipotle peppers, mayonnaise, dried minced onion, garlic salt, and black pepper in a bowl until thoroughly combined.\n",
        "picture_link": "HJn37rX9Z66g3iPe/apkkXypSovTjbe"
    },
    {
        "title": "Daiquiri Cocktail",
        "ingredients": [
            "1 1/2 fluid ounces light rum ADVERTISEMENT",
            "1 fluid ounce lime juice ADVERTISEMENT",
            "1 teaspoon simple syrup ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine light rum, lime juice, and simple syrup in a cocktail shaker. Add ice, cover and shake until chilled. Strain into a chilled cocktail glass.\n",
        "picture_link": "8bkpdJ4vvHkC45HiveVDA/n4cil13a."
    },
    {
        "title": "Frozen Daiquiri Cocktail",
        "ingredients": [
            "1 1/2 fluid ounces light rum ADVERTISEMENT",
            "1 tablespoon triple sec ADVERTISEMENT",
            "1 1/2 fluid ounces lime juice ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "1 maraschino cherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine light rum, triple sec, lime juice, and ice in blender with 1 cup crushed ice; blend until smooth. Pour into a Champagne flute.\nGarnish with maraschino cherry.\n",
        "picture_link": "ZbTutGSq3CUGQtBlaGYsTDbOodAplgm"
    },
    {
        "title": "Easiest Layer Dip",
        "ingredients": [
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (16 ounce) jar salsa (such as Newman's Own® medium or hot) ADVERTISEMENT",
            "2 cups shredded Mexican-style cheese blend, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix refried beans with taco seasoning mix in a bowl; spread mixture into the bottom of an 8x8-inch glass baking dish. Spread sour cream over the refried beans; spread salsa over the sour cream. Sprinkle cheese over the top.\nBake in preheated oven until cheese is melted but not bubbling, 6 to 10 minutes.\n",
        "picture_link": "LZbWqAff0.1D0/VwgvwXGHiApnSTHjW"
    },
    {
        "title": "Warm Orange Sauce",
        "ingredients": [
            "3/4 cup freshly squeezed orange juice ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3/4 cup cold water ADVERTISEMENT",
            "2 1/2 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons finely shredded orange peel ADVERTISEMENT",
            "2 fluid ounces triple sec (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring orange juice, sugar, butter, and salt to a simmer in a saucepan over medium heat.\nWhisk cold water and cornstarch in a small bowl; whisk cornstarch mixture into the simmering sauce until thickened and no longer cloudy.\nRemove sauce from heat and stir in orange peel and triple sec. Serve warm.\n",
        "picture_link": "gWmtE8R8uFycWCoPVJQHCBl5kIwGjTu"
    },
    {
        "title": "Sweet Chicken Marsala",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 slice onion, minced ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "2 cups Marsala wine ADVERTISEMENT",
            "1 1/2 cups chicken stock ADVERTISEMENT",
            "5 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "1 tablespoon corn syrup ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon cold water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - pounded flat ADVERTISEMENT",
            "2 tablespoons chopped green onion, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 2 tablespoons butter in a large pot over medium heat. Stir mushrooms, onion, and garlic into the melted butter, increase heat to medium-high, and cook and stir the mixture until the mushrooms are golden brown, 3 to 5 minutes.\nStir Marsala wine, chicken stock, brown sugar, lemon juice, molasses, and corn syrup into the mushroom mixture; bring to a boil and cook, stirring frequently, until the liquid reduces by about half, 10 to 15 minutes.\nWhisk cornstarch into cold water in a small bowl. Stream the cornstarch slurry into the Marsala sauce, stirring continually; cook and stir until the sauce thickens, another 10 to 15 minutes.\nHeat olive oil with 1 tablespoon butter in a large skillet over medium heat; cook chicken until golden brown until no longer pink in the center and the juices run clear, 3 to 5 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nArrange each chicken breast into the center of a plate. Drizzle Marsala sauce over each chicken breast; garnish with green onion to serve.\n",
        "picture_link": "zEYuMZfzV4uNBzvOiBWYXtboPg/77qu"
    },
    {
        "title": "SPICY Enchiladas Verdes de Queso",
        "ingredients": [
            "5 jalapeno peppers, stems removed ADVERTISEMENT",
            "3 fresh tomatillos, husks removed - stemmed and halved ADVERTISEMENT",
            "1/2 yellow onion ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "water, or as needed to cover ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 1/2 cubes chicken bouillon ADVERTISEMENT",
            "1 sprig fresh cilantro ADVERTISEMENT",
            "vegetable oil ADVERTISEMENT",
            "20 (6 inch) corn tortillas ADVERTISEMENT",
            "1 (12 ounce) package queso fresco (Mexican fresh cheese), shredded ADVERTISEMENT",
            "1/2 head lettuce, shredded ADVERTISEMENT",
            "1 small red onion, chopped ADVERTISEMENT",
            "5 tablespoons sour cream, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place jalapeno peppers, tomatillos, yellow onion, garlic, and cumin in a blender; pour in enough water to cover the vegetables. Blend until liquified, about 1 minute.\nHeat 1/3 cup vegetable oil in a skillet over medium-high heat just until oil has begun to warm, about 30 seconds; pour the blended jalapeno mixture into the oil. Stir in chicken bouillon cubes and cilantro. Reduce heat to medium and cook sauce for 30 minutes, stirring occasionally. Remove green sauce from heat and allow to stand while you complete remaining steps.\nHeat 1 cup vegetable oil in a skillet over medium heat. Using a tongs, place each tortilla into the hot oil and fry for a few seconds on each side. Tortillas will be pliable; do not overcook.\nImmerse the fried tortilla into the green sauce to coat; place tortilla on a serving plate. Sprinkle tortilla with about 2 teaspoons shredded queso fresco cheese and roll into a thin enchilada. It's easiest if one person is frying tortillas while another person dips in sauce, fills with cheese, and rolls the tortillas.\nPlace enchiladas onto serving plates; spoon with remaining green sauce and sprinkle with remaining queso fresco cheese. Spread shredded lettuce over the enchiladas and sprinkle with chopped red onion. Top servings with a tablespoon of sour cream.\n",
        "picture_link": "B1PDcgLdjnO98DjAMNBKbIBrY1DjOXO"
    },
    {
        "title": "Sushi House Salad Dressing, It's ORANGE!",
        "ingredients": [
            "3 carrots, peeled and cut in chunks ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger root ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/4 cup white wine vinegar ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 tablespoons peanut oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place carrots, ginger root, soy sauce, vinegar, and orange juice into a blender; blend until liquified. Pour in peanut oil and pulse once or twice just to combine.\n",
        "picture_link": "xrjrFvCf4NJokDphbVnkWKua/XKzrKG"
    },
    {
        "title": "Indonesian Nasi Goreng",
        "ingredients": [
            "12 ounces long grain white rice ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons sunflower seed oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 cloves garlic, coarsely chopped ADVERTISEMENT",
            "1 fresh red chile pepper, seeded and chopped ADVERTISEMENT",
            "1 tablespoon curry paste ADVERTISEMENT",
            "1 bunch green onions, thinly sliced ADVERTISEMENT",
            "2 tablespoons soy sauce, or more to taste ADVERTISEMENT",
            "1 teaspoon sunflower seed oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 ounces roasted peanuts, coarsely chopped ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring rice, water, and salt to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes.\nHeat 2 tablespoons sunflower oil in a wok or skillet over medium-high heat; cook and stir chicken, garlic, and red chile pepper until chicken is golden brown, 5 to 7 minutes. Stir in curry paste until fragrant, about 1 minute. Add cooked rice and green onions, cooking and stirring for 5 minutes more. Season with soy sauce.\nPush rice mixture to one side of the wok. Heat remaining 1 teaspoon sunflower oil in middle of wok; cook and stir eggs until just set, about 1 minute. Stir rice mixture into eggs. Sprinkle with peanuts and cilantro. Serve immediately.\n",
        "picture_link": "yQxRwIW.kPI4NtySVg/TIoE5StS6atC"
    },
    {
        "title": "Healthier Chicken Cordon Bleu I",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "6 slices Jarlsberg cheese ADVERTISEMENT",
            "4 slices cooked ham ADVERTISEMENT",
            "1/4 cup whole wheat bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat a 7x11-inch baking dish with nonstick cooking spray.\nPound chicken breasts to 1/4-inch thickness. Sprinkle each piece of chicken on both sides with salt and pepper. Place one cheese slice and one ham slice on top of each breast. Roll up each breast and secure with a toothpick. lace in baking dish and sprinkle chicken evenly with bread crumbs.\nBake in preheated oven until chicken breasts are no longer pink in center and juices run clear, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from oven and place 1/2 cheese slice on top of each breast. Return to oven and bake until cheese is melted, 3 to 5 minutes. Remove toothpicks and serve immediately.\n",
        "picture_link": "6H3KIj/l0x.IyU8v92SOdiss9yfhVpq"
    },
    {
        "title": "Aviation Cocktail",
        "ingredients": [
            "2 fluid ounces gin ADVERTISEMENT",
            "1 tablespoon maraschino liqueur ADVERTISEMENT",
            "1/4 fluid ounce lemon juice ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "maraschino cherry for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gin, maraschino liqueur, and lemon juice in a cocktail shaker. Add ice, cover and shake until chilled. Strain into a chilled cocktail glass.\nGarnish with maraschino cherry.\n",
        "picture_link": "7nhOlGVGzGaqbSsr2i/beoN7xAcl.h."
    },
    {
        "title": "Curried Green Bean Salad",
        "ingredients": [
            "3 tablespoons minced fresh onion ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "2 teaspoons minced fresh garlic ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 (14.5 ounce) cans green beans, drained ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix onion, curry powder, rice vinegar, garlic, and ginger together in a large bowl. Stir oil into the onion mixture; season with salt and black pepper; mix well. Add green beans and almonds to the mixture; toss lightly to coat.\n",
        "picture_link": "yDmVITCkRvNdwVEnDTpKpKdMZRwtHjO"
    },
    {
        "title": "Pastel Galletas (Cookie Cake)",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "8 small limes, juiced ADVERTISEMENT",
            "1 (20 ounce) package Mexican Maria cookies (galletas Marias) ADVERTISEMENT",
            "1 (15 ounce) can fruit cocktail, drained ADVERTISEMENT",
            "1 (15 ounce) can sliced peaches, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend sweetened condensed milk, evaporated milk, cream cheese, and lime juice in a blender until sauce is creamy. Pour sauce into a bowl.\nDip enough Maria cookies to cover the bottom of a 9x13-inch glass baking dish in the creamy lime sauce. Spread a layer of fruit cocktail over the cookies. Dip and layer a second layer of Maria cookies over the fruit cocktail. Continue dipping and layering cookies and fruit cocktail until the last layer of cookies is about 1 inch from the top of pan. Spread peaches over the dessert.\nCover dessert with plastic wrap and refrigerate 8 hours or overnight before serving.\n",
        "picture_link": "WWcoLdQWqaoDfB8vUZBsUppkObKvi2."
    },
    {
        "title": "Easy Raspberry Salad ",
        "ingredients": [
            "1 pound mixed salad greens ADVERTISEMENT",
            "1 pint fresh raspberries ADVERTISEMENT",
            "1 jicama, peeled and chopped ADVERTISEMENT",
            "4 ounces slivered almonds ADVERTISEMENT",
            "1 cup raspberry vinaigrette, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss salad greens, raspberries, jicama, and almonds together in a large bowl. Drizzle with raspberry vinaigrette to serve.\n",
        "picture_link": "OQZHTN.WOtbdGMD/i2t42FydSLs0Rnu"
    },
    {
        "title": "Bee's Knees Cocktail",
        "ingredients": [
            "2 fluid ounces gin ADVERTISEMENT",
            "1/2 fluid ounce lemon juice ADVERTISEMENT",
            "3/4 fluid ounce honey syrup ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gin, lemon juice, and honey syrup in a cocktail shaker. Add ice, cover and shake until chilled. Strain into a chilled coupe glass.\n",
        "picture_link": "M.f6JifP6nLlKNe5mDBmhCBGy6TXXa6"
    },
    {
        "title": "Layered and Tossed Spicy Chicken Taco Salad",
        "ingredients": [
            "1 (7.75 ounce) can Mexican-style hot tomato sauce ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup green salsa ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "2 cloves garlic, crushed, or to taste ADVERTISEMENT",
            "1 1/2 cups diced rotisserie chicken meat ADVERTISEMENT",
            "1 cup finely shredded Monterey jack cheese ADVERTISEMENT",
            "1 (10 ounce) bag shredded lettuce, chilled ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives ADVERTISEMENT",
            "1/2 cup crushed tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk tomato sauce, sour cream, mayonnaise, green salsa, and lime juice together in a bowl until combined. Refrigerate the dressing while making salad.\nHeat olive oil in a skillet over medium heat and cook onion in hot oil until translucent, about 5 minutes; stir often. Mix garlic into onion and remove from heat; stir cooked chicken in skillet and allow chicken to warm.\nTransfer chicken mixture to a large salad bowl and sprinkle with Monterey jack cheese; cheese will warm and soften. Top chicken and cheese with cold lettuce and pour dressing over salad. Sprinkle in black olives. Toss salad thoroughly with dressing and sprinkle with crushed tortilla chips to serve.\n",
        "picture_link": "mQUwFwuY8sLzxdDHheFA2nw3OhzfZSi"
    },
    {
        "title": "Nancy's Fruit Salad",
        "ingredients": [
            "1 cantaloupe - peeled, seeded, and cubed ADVERTISEMENT",
            "2 red apples, thinly sliced ADVERTISEMENT",
            "1 cup red grapes ADVERTISEMENT",
            "1 (12 ounce) can mandarin oranges in juice ADVERTISEMENT",
            "1/4 cup sweetened flaked coconut (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer about half the cantaloupe in the bottom of a large bowl; top with layers of about half the apple slices, half the grapes, and half the mandarin oranges in juice. Repeat the layering.\nTop the salad with coconut to serve.\n",
        "picture_link": "aYSj/y0qrUWC6GD/.IGea5DaY50VyG6"
    },
    {
        "title": "Blushing Betty (Rhubarb Dessert)",
        "ingredients": [
            "4 pounds rhubarb, cut into 1-inch pieces ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/3 cups raisins ADVERTISEMENT",
            "1/4 cup vegetable shortening ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nMix rhubarb with 2 cups sugar in a large bowl and spread into the prepared baking dish; sprinkle rhubarb with raisins.\nBeat vegetable shortening with 2/3 cup sugar in a bowl; beat in eggs, one at a time, followed by vanilla extract. Whisk flour, baking powder, and salt together in another bowl. Gradually stir the flour mixture into the wet ingredients, alternating with milk, to form a smooth batter. Spread batter over fruit in baking dish.\nBake in the preheated oven until rhubarb filling is bubbling and topping is set and golden brown, about 1 hour.\n",
        "picture_link": "518EK8hFBrW8Xu1hLIScheHO/wENv8e"
    },
    {
        "title": "Chlodnik - Cold Polish Beet Soup",
        "ingredients": [
            "3 beets with leaves and stems - beets peeled and chopped, leaves sliced ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1 small cucumber, grated ADVERTISEMENT",
            "1 hard-cooked egg, chopped ADVERTISEMENT",
            "1/3 cup chopped fresh dill ADVERTISEMENT",
            "3 small green onions, thinly sliced ADVERTISEMENT",
            "1 pint buttermilk ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/3 lemon, juiced ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover beets with water in a pot and bring to a boil; cook until tender about 15 minutes. Remove from heat and stir in chicken stock. Allow beets to cool.\nMix cucumber, egg, dill, and green onions in a bowl. Whisk buttermilk and sour cream until smooth in another bowl. Stir egg mixture and buttermilk mixture into cooled beets. Cover and refrigerate at least 2 hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Zippy Egg Salad",
        "ingredients": [
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon light soy sauce ADVERTISEMENT",
            "1/4 lime, juiced ADVERTISEMENT",
            "1 teaspoon crushed red pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 stalk celery, finely sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, Parmesan cheese, soy sauce, lime juice, red pepper, salt, and black pepper in a bowl.\nStir eggs and celery into the mayonnaise mixture until well coated.\nCover bowl with plastic wrap and refrigerate until chilled before serving.\n",
        "picture_link": "aEEidhlLrCL0jJJyhNRsYKyUgyc8GUm"
    },
    {
        "title": "Fruit Drops I",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup unsweetened applesauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 peaches ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup chopped raisins ADVERTISEMENT",
            "1/4 cup crushed pineapple, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel, pit and slice peaches. Place in small saucepan and add water until just covered. Sprinkle with 3 teaspoons of sugar and boil. Reduce heat and cook until peaches soften. Remove from heat and mash.\nPreheat oven to 400 degrees F (200 degrees C). Grease cookie sheets.\nIn small saucepan, heat oil and honey over low heat. Pour into bowl and beat in egg, applesauce and mashed peaches. Mix in flour, cinnamon and salt until well blended. Fold in oats, raisins and pineapple, stirring well. If the dough seems too dry, add more applesauce 1 tablespoon at a time. Drop by spoonfuls 2 inches apart on cookie sheets.\nBake for 15 to 20 minutes until lightly colored.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange and Onion Salad",
        "ingredients": [
            "6 large oranges ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "1 cup black olives ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel the oranges and cut each one into 4 or 5 crosswise slices. Transfer them to a shallow serving dish and sprinkle them with the vinegar, olive oil, and oregano. Toss gently, cover, and refrigerate for 30 minutes.\nToss the oranges again, arrange the sliced onion and black olives over them decoratively, sprinkle with chives and grind on fresh pepper.\n",
        "picture_link": "n2FbhRrO6ODoPjnY/qjaWMrFRj7nAtO"
    },
    {
        "title": "Deep Dish Pumpkin Pie",
        "ingredients": [
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/4 cups molasses ADVERTISEMENT",
            "1/2 cup buttermilk baking mix ADVERTISEMENT",
            "1 (9 inch) deep dish pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a mixing bowl, blend together the pumpkin, evaporated milk, butter, eggs and vanilla.\nIn a separate bowl, whisk together the cinnamon, nutmeg, allspice, salt, molasses and baking mix. Add to the pumpkin mixture and mix thoroughly.\nPour filling into unbaked pie crust and bake for 50 minutes or until knife inserted comes out clean.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raisin Sauce",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup beef consomme ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, combine butter and flour. Blend together over medium-high heat.\nGradually add consomme, stirring constantly until thickened. Add sugar, Worcestershire sauce, lemon juice and raisins. Mix thoroughly and serve warm.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Homemade Dressing",
        "ingredients": [
            "2 (1 pound) loaves Hawaiian sweet bread ADVERTISEMENT",
            "1 teaspoon sage ADVERTISEMENT",
            "3 teaspoons poultry seasoning ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1/2 onion, finely diced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 1/2 cups dried cranberries ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut day old sweet bread into small pieces and place in large bowl. Add the sage, poultry seasoning, salt and pepper. Toss and allow bread to sit until dry.\nIn a large skillet, melt butter and add celery, onion and water. Stir until heated but not boiling.\nCombine the cranberries, sunflower seeds and vegetable mixture to bowl of dried bread; stir well.\nUse as a stuffing for turkey, or bake in a buttered casserole dish at 350 degrees F (175 degrees C) for 30 to 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Date Rolls",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pound dates, pitted and chopped ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together shortening, 1 cup white sugar and 1 cup of brown sugar. Add eggs, vanilla and 1 tablespoon of water.\nSift flour, soda, and saltTWICE and add to sugar mixture. Divide dough into 2 or 3 parts.\nCook dates, 1/2 cup white sugar and 1 cup water over low heat, stirring constantly until it becomes a smooth paste. Let cool.\nRoll each section of dough into rectangles 1/4 - 1/2 inch thick.\nSpread filling over rectangles and roll up like a jelly roll. Cover and chill dough until firm; 2 - 3 hours.\nPreheat oven to 350 degrees F (180 degrees C). Slice dough 1/4 to 1/2 inch thick. Bake for 10 to 12 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Poppy Seed Pinwheels",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup poppy seeds ADVERTISEMENT",
            "1/2 cup ground walnuts ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon orange zest ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat sugar and 1/2 cup butter with mixer at high speed until light and fluffy. Add flour, vanilla, salt, and egg; beat on low speed until blended, occasionally scraping bowl.\nShape dough into ball. Wrap and refrigerate 1 hour, until firm enough to handle.\nTo Make Filling: Stir remaining ingredients and 4 Tablespoons butter untl mixed. Set aside.\nOn waxed paper, roll half of dough into 10 by 8 inch rectangle. Spread dough with half of the poppy seed mixture. Starting at narrow side, roll jelly-roll fashion. Wrap and refrigerate 1 hour, until firm. Repeat with remaining dough and filling.\nPreheat oven to 375 degrees F (190 degrees C).\nSlice one roll cross-wise into 1/4 inch thick slices. Place 1/2 inch apart on ungreased cookie sheet. Bake 10 to 12 minutes, until lightly browned. Cool on wire rack and repeat with remaining dough.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Snowy Pecan Cookies",
        "ingredients": [
            "4 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate squares and cooking oil in a saucepan.\nLet cool and pour into mixing bowl. Add sugar, eggs and vanilla, mixing until well blended.\nSift dry ingredients together and gradually add to chocolate/egg mixture, stirring well.\nStir in nuts, cover and place in refrigerator overnight.\nPreheat oven to 375 degrees and grease cookie sheets.\nShape dough into small balls, about an inch in diameter. Roll in powdered sugar and place about 2 inches apart on cookie sheet .\nBake for 8 minutes.\n",
        "picture_link": "waS07GAtdj6HS/6wUMJljQTqea7qoYG"
    },
    {
        "title": "Nutty Chocolate Chip Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups quick cooking oats ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup coarsely chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream the margarine, butter and both sugars until light and fluffy.\nAdd the eggs, milk and vanilla and beat until well blended.\nSift the flour, baking powder, baking soda and salt together and add to the butter mixture. Stir just until blended. Stir in the oats until well blended. Fold in the chocolate and walnuts.\nCover and refrigerate the dough for at least 1 hour.\nPreheat oven to 350 degrees. Grease cookie sheets.\nTake a teaspoonful (for small cookies) or a tablespoonful (for large cookies) of dough and shape the dough into balls. Flatten slightly into rounded disks. Place 2 inches apart on the cookie sheets and bake until the edges are slightly browned, about 10 minutes.\nRemove from the oven and let cool on the sheets for about 10 minutes. Remove to wire racks to cool completely.\n",
        "picture_link": "dh0FAz9Loojhc5KbFVDB3pH30hkFo26"
    },
    {
        "title": "Candied Baked Beans",
        "ingredients": [
            "1 (28 ounce) can baked beans ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 (16 ounce) package large marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 9x13 inch baking dish, combine the beans and brown sugar. Mix together well and cover with a single layer of marshmallows.\nBake for 15 to 20 minutes or until marshmallows are golden brown.\n",
        "picture_link": "5dkpOZ1V.xFFU9EPHWwWGeoFzy9h8Ta"
    },
    {
        "title": "Almond Squares I",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "9 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease a 9 inch square baking pan.\nTo make crust: In a large bowl, cream shortening, white sugar and brown sugar. Separate egg and beat in yolk and vanilla, stirring until well blended. Slowly add in the flour and blend well. Mixture will be stiff.\nPress dough evenly into baking pan. Bake for 18 to 20 minutes, or until top is golden brown.\nMelt the chocolate in a double boiler over low heat. Spread the melted chocolate over warm crust. Sprinkle top with almonds. Let cool on wire rack before cutting.\n",
        "picture_link": "zsR1LxlaeIPrEDweZuG3aBPzawrbTba"
    },
    {
        "title": "Great Grandma's Bread Stuffing",
        "ingredients": [
            "9 cups white bread cubes ADVERTISEMENT",
            "3 cups chopped celery ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup melted shortening ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "3 teaspoons paprika ADVERTISEMENT",
            "3 teaspoons salt ADVERTISEMENT",
            "3 teaspoons poultry seasoning ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute; onions in melted shortening.\nMix together bread cubes, celery, baking powder, sauteed onions, paprika, salt, poultry seasoning, and slightly beaten eggs. Mixture will be dry.\nPack lightly into uncooked turkey. Roast turkey as directed.\n",
        "picture_link": "wh4eDxAJTm1rKS6rumchehGBtIGzR2K"
    },
    {
        "title": "Creamed Onions I",
        "ingredients": [
            "2 tablespoons butter, softened ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "20 ounces pearl onions ADVERTISEMENT",
            "50 buttery round crackers, crumbled ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPrepare the sauce by whisking together and cooking the butter, flour, milk, salt and pepper. Cook until smooth.\nPlace onions in a 2 quart casserole dish, pour in white sauce.\nIn a saute pan, melt 2 tablespoons butter and toast cracker crumbs until golden. Sprinkle over onions. Bake 20 minutes or until steaming hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coconut Squares",
        "ingredients": [
            "1/3 cup shortening ADVERTISEMENT",
            "1 cup dried bread crumbs ADVERTISEMENT",
            "1 cup butterscotch chips ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1 2/3 cups sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nMelt shortening over low heat. Pour into 9 inch baking pan. Layer bread crumbs evenly in bottom of pan.\nLayer coconut, chocolate chips, butterscotch chips and nuts over bread crumbs. Drizzle condensed milk over top.\nBake 25 to 30 minutes. Let cool before cutting into bars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Triple Fudge Cookies",
        "ingredients": [
            "7 (1 ounce) squares semisweet chocolate, chopped ADVERTISEMENT",
            "1 (1 ounce) square unsweetened chocolate, chopped ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease cookie sheets.\nMelt the chocolate squares and butter or margarine in a double boiler. Stir well and remove from heat.\nCream sugar and eggs in medium sized bowl until thick and creamy. Mix in vanilla and melted chocolate.\nMix in the flour, baking powder and salt until well blended. Stir in chocolate chips and nuts.\nDrop by teaspoonfuls about 1 1/2 inches apart on cookie sheet. Bake for 8 minutes or until tops crackle and look shiny. Cool 3 to 5 minutes. Remove to racks; cool completely.\n",
        "picture_link": "E3x.uu9IH73v6j4l7j7RChgOC/50NBC"
    },
    {
        "title": "Carrot Walnut Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "2 (4 ounce) jars carrot baby food ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nBeat all ingredients except flour and nuts in a large bowl with mixer on medium speed until blended (mixture will look curdled).\nWith mixer on low speed beat in flour just until blended. Stir in walnuts.\nDrop by rounded tablespoon 2 inches apart on ungreased cookie sheet. Bake 10 to 12 minutes until tops look dry. Cool on cookie sheet 1 minute before removing to a wire rack to cool completely. Frost with Orange Cream Cheese Frosting (see footnote for link to recipe).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Yum Yum Cranberry Parfait",
        "ingredients": [
            "1 cup cranberry sauce ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine leftover cranberry sauce and whipped topping in a 1 to 1 ratio. Mix well and place in freezer until partially frozen. Remove before completely frozen and serve on left over pie.\n",
        "picture_link": "bltfEnur8eEuR77UBmn87R46oMAkFtq"
    },
    {
        "title": "Grandma Randolph's Noodles",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 cups beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the eggs and mix in the salt, pepper and flour. Divide the dough into two halves. Roll out the halves to 1/4 inch thick. Let dry for at least 2 hours. Cut the noodles into 1/2 inch to 1 inch wide and as long as you want strips.\nDrop the noodles into the boiling stock of your choice and boil until soft.\n",
        "picture_link": "VSiwZ9YvnGP1E0lsVuDE6Dc7MpzEhSq"
    },
    {
        "title": "One, Two, Three, Four Cookies",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nIn a large mixing bowl, cream together the margarine and sugar. Add eggs and beat until fluffy.\nIn a separate bowl, mix together the flour, baking powder, and salt. Dissolve the baking soda in the buttermilk and add alternately to the margarine mixture with flour mixture.\nRoll out dough and sprinkle with nutmeg. Cut with a biscuit cutter. Dough will be very soft and delicate.\nBake until lightly browned around the edges. A really soft, chewy cookie.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "A Cranberry Salad Keepsake",
        "ingredients": [
            "1 cup boiling water ADVERTISEMENT",
            "1 (6 ounce) package cherry-flavored gelatin (such as Jell-O®) ADVERTISEMENT",
            "1 (16 ounce) can jellied cranberry sauce ADVERTISEMENT",
            "1 apple - peeled, cored, and diced, or more to taste ADVERTISEMENT",
            "3/4 cup chopped walnuts, or to taste ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir boiling water and cherry gelatin together in a bowl until gelatin is completely dissolved.\nHeat cranberry sauce in a saucepan over medium heat until melted; stir into gelatin mixture.\nStir apples and walnuts into the cranberry sauce mixture; add pineapple with juice and mix well. Refrigerate until set, 8 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "The 'Whiz-Wit' Dip",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 pound thinly sliced rib-eye steak, chopped ADVERTISEMENT",
            "1/2 (4 ounce) jar diced jalapeno peppers (optional) ADVERTISEMENT",
            "1/2 (4 ounce) jar diced pimento peppers (optional) ADVERTISEMENT",
            "1 (8 ounce) package cream cheese (such as Philadelphia®), softened ADVERTISEMENT",
            "1 (15 ounce) jar processed cheese sauce (such as Cheez Whiz®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat; cook and stir onion in the hot oil until tender, 5 to 10 minutes. Remove onion from skillet to a bowl with a slotted spoon, leaving oil in skillet. Cook and stir steak in the same skillet over medium-high heat until browned and liquid has evaporated, 5 to 10 minutes.\nStir onion, jalapeno peppers, and pimento peppers into steak until thoroughly mixed. Add cream cheese to steak mixture; cook and stir until cream cheese is melted, about 5 minutes. Stir cheese sauce into steak mixture; cook and stir until dip is heated through, 3 to 5 minutes. Serve hot.\n",
        "picture_link": "b7Amxz6E92vGKI86c0BWUjn1O78HZci"
    },
    {
        "title": "Smokehouse Burger Quesadillas",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 onion, cut into 1-inch pieces ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "4 flour tortillas ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup French-fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir barbeque sauce into ground beef mixture and simmer until heated through, about 5 minutes.\nPreheat quesadilla maker or preheat oven to 350 degrees F (175 degrees C)\nSpread 1/2 the ground beef mixture onto a tortilla and top with 1/2 the Cheddar cheese and 1/2 the French-fried onions; top with a second tortilla. Repeat with remaining ingredients.\nCook each quesadilla in quesadilla maker or on a baking sheet in preheated oven until golden brown and cheese is melted, 5 to 10 minutes. Cut into triangles with a pizza cutter.\n",
        "picture_link": "afhQZHRQqkDFGBqqFDx7OP98znThnJ2"
    },
    {
        "title": "Yummy Mango Citrus Drink",
        "ingredients": [
            "1 banana, peeled ADVERTISEMENT",
            "1/2 lemon, peeled ADVERTISEMENT",
            "1 mango - peeled, seeded, and cut into wedges ADVERTISEMENT",
            "1/2 orange, peeled ADVERTISEMENT",
            "2 apples, cut into chunks ADVERTISEMENT",
            "2 slices fresh ginger root ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process banana, lemon, mango, orange, apples, and ginger through juicer.\n",
        "picture_link": "Xdz1mA3kCSjH8/I6dbW1.VwUlCJZuzG"
    },
    {
        "title": "Cheesy Burrito Game Day Dip",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "2 (16 ounce) cans refried beans ADVERTISEMENT",
            "4 cups shredded Colby-Monterey Jack cheese, divided ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 (4 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir ground beef, refried beans, 3 cups Colby-Monterey Jack cheese, sour cream, cream cheese, and taco seasoning mix together in a bowl until well mixed. Spread mixture into the prepared baking dish.\nBake in the preheated oven for 20 minutes; sprinkle with remaining 1 cup Colby-Monterey Jack cheese. Continue baking until cheese is melted, about 5 more minutes.\n",
        "picture_link": "V..sT/mjyUKXmnsbrVWDtnU2rjWvVOy"
    },
    {
        "title": "Zucchini Mint Salad",
        "ingredients": [
            "1 small zucchini, cut into 1/4-inch rounds ADVERTISEMENT",
            "1 small yellow squash, cut into 1/4-inch rounds ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon freshly squeezed lemon juice ADVERTISEMENT",
            "1 tablespoon chopped fresh mint ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange zucchini and yellow squash rounds on a plate and sprinkle evenly with salt. Set aside until some of the water is pulled out, about 5 minutes.\nDrizzle zucchini and yellow squash with olive oil and lemon juice and sprinkle with mint; season with black pepper.\n",
        "picture_link": "KhFWoq5rBFpy8VBNEbm53W7xTslMb8u"
    },
    {
        "title": "Andouille, Mushroom, and Lentil Soup",
        "ingredients": [
            "6 cups chicken broth ADVERTISEMENT",
            "3 cups split lentils ADVERTISEMENT",
            "4 andouille sausage links, cut into cubes ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "2 (10 ounce) packages cremini mushrooms, coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, lentils, sausage, cumin, chili powder, and turmeric in a large pot; bring to a boil, reduce heat to low, and simmer until the lentils are tender, 15 to 20 minutes.\nStir mushrooms into the broth mixture; continue cooking until the mushrooms are tender, about 10 minutes more.\n",
        "picture_link": "hmkFDkXR3j2PYXVIgRq/Ag6Yeulri9e"
    },
    {
        "title": "Almond Flour",
        "ingredients": [
            "1 cup almonds, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place almonds, about 1/4 cup at a time, in the food processor. Pulse until you reach a flour-like consistency; sift into a container. Place any remaining almonds chunks back into food processor and pulse. Repeat until all almonds are transformed into flour. Cover container and store flour in refrigerator.\n",
        "picture_link": "HG/bnQ1NyHXQwHwcoEV3KFk6CdxBOxG"
    },
    {
        "title": "Tom's Mulligatawny Soup",
        "ingredients": [
            "3 tablespoons margarine ADVERTISEMENT",
            "2 cups chopped apples ADVERTISEMENT",
            "3/4 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped carrot ADVERTISEMENT",
            "1/2 cup chopped bell pepper ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 gallon chicken stock ADVERTISEMENT",
            "3 1/2 cups stewed tomatoes ADVERTISEMENT",
            "2 whole cloves ADVERTISEMENT",
            "1 pound chicken, cut into chunks ADVERTISEMENT",
            "1 teaspoon minced fresh parsley, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt margarine in a stockpot over medium heat. Cook and stir apples, celery, onion, carrot, and bell pepper in melted margarine until tender, about 5 minutes.\nStir flour, curry powder, salt, and black pepper into the vegetable mixture. Pour chicken stock over the mixture; add tomatoes and cloves. Add the diced chicken and parsley; bring the mixture to a boil. Reduce heat to medium-low and cook at a simmer until the chicken is cooked through, about 30 minutes.\n",
        "picture_link": "FkdBb0M4teNbtACWdCkO8XFjjrzJ6rW"
    },
    {
        "title": "Easy Slow Cooker Baked Beans",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/4 cup diced onion ADVERTISEMENT",
            "1 pound bacon, diced ADVERTISEMENT",
            "4 (14.5 ounce) cans pork and beans ADVERTISEMENT",
            "1 (15 ounce) can kidney beans ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3 tablespoons vinegar ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until browned and crumbly, 5 to 7 minutes; pour into a slow cooker.\nCook and stir bacon in a large skillet over medium-high heat until evenly browned, about 10 minutes; add to beef.\nStir pork and beans, kidney beans, white sugar, ketchup, brown sugar, vinegar, and liquid smoke into the beef mixture.\nCook on Low for 6 to 8 hours.\n",
        "picture_link": "sdqxvtnQJh11Z9Vp3BNATibyIo/icMS"
    },
    {
        "title": "Grilled Honey Chili Flap Steak",
        "ingredients": [
            "Dry Rub: ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "2 teaspoons Mexican oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 pounds flap steak, trimmed of fat ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "2 chipotle peppers, diced ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "2 tablespoons chipotle mustard ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 limes, halved ADVERTISEMENT",
            "4 flour tortillas ADVERTISEMENT",
            "1/2 red onion ADVERTISEMENT",
            "1/4 cup crumbled queso fresco cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir garlic powder, chili powder, Mexican oregano, 1 teaspoon salt, and 1 teaspoon black pepper together in a bowl. Sprinkle garlic powder mixture over both sides of flap steak, pat rub into meat, wrap steak in plastic wrap, and refrigerate for at least 8 hours or overnight.\nWhisk honey, lime juice, cilantro, chipotle peppers, garlic, vegetable oil, apple cider vinegar, chipotle mustard, cumin, 1/2 teaspoon salt, and 1/2 teaspoon black pepper together in a bowl. Cover with plastic wrap and refrigerate 1 to 2 hours. Separate mixture equally into two bowls; one for basting and one for serving.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook steak on the preheated grill until smoke rises from the spice rub. Turn the meat and squeeze the juice from 2 lime halves over the steak. When the spice rub begins to smoke, turn the meat again. Brush the refrigerated honey-lime basting sauce onto both sides of the steak and cook steak to your desired degree of doneness, 8 to 10 minutes per side for medium. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Let meat rest for 5 minutes and chop against the grain into bite-size pieces.\nSpoon grilled meat into tortillas. Top with onion, lime juice, reserved honey-lime serving sauce, and queso fresco cheese.\n",
        "picture_link": "JNtWpEGQdqrfzozgd1DSW3uasW2OmO6"
    },
    {
        "title": "Debbie's Frito® Pie",
        "ingredients": [
            "1 (22 ounce) package corn chips (such as Fritos®) ADVERTISEMENT",
            "1 (15 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 (15 ounce) cans chili without beans (such as Hormel®) ADVERTISEMENT",
            "1 (32 ounce) bag shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread corn chips in a 9x13-inch baking dish. Sprinkle olives evenly over chips.\nMix chili with water in a large bowl; pour mixture over olives and corn chips. Top chili with Cheddar cheese.\nBake in the preheated oven until cheese is melted, about 20 minutes.\n",
        "picture_link": "R.enJp89d8MueyfTdgT7.Qsa72ebOfi"
    },
    {
        "title": "Great Aunt D.J.'s Corn Pudding",
        "ingredients": [
            "1/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "6 large eggs ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "6 cups frozen corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish.\nMix sugar, flour, baking powder, and salt together in a bowl.\nBeat eggs together in a large bowl until well mixed; stir in cream and butter. Gradually stir sugar mixture into egg mixture until smooth; fold in corn until evenly coated. Pour corn mixture into the prepared baking dish.\nBake in the preheated oven until pudding is lightly browned and set in the middle, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet and Crunchy Popcorn Snack Mix",
        "ingredients": [
            "waxed paper ADVERTISEMENT",
            "2 cups crispy corn and rice cereal (such as Crispix®) ADVERTISEMENT",
            "2 cups honey graham cereal (such as Golden Grahams®) ADVERTISEMENT",
            "2 cups peanut butter corn puff cereal (such as Reese's Puffs®) ADVERTISEMENT",
            "2 cups popped popcorn, or more to taste (optional) ADVERTISEMENT",
            "8 ounces candy-coated milk chocolate pieces (such as M&M;'s®) ADVERTISEMENT",
            "1 cup salted peanuts ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup corn syrup ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a large baking sheet with waxed paper.\nCombine crispy corn and rice cereal, honey graham cereal, peanut butter corn puff cereal, popcorn, chocolate pieces, and peanuts in a large bowl.\nMelt butter in a large saucepan over medium heat; whisk in flour until smooth, 2 to 3 minutes. Add brown sugar and corn syrup; bring to a boil, stirring occasionally, until sugar is dissolved, about 1 minute. Stir peanut butter into sugar mixture until creamy, about 3 minutes; pour over cereal mixture and gently toss until coated.\nSpread cereal mixture over prepared baking sheet and allow to cool, about 30 minutes. Once cooled, break mixture into chunks and store in an airtight container.\n",
        "picture_link": "GjYNCIqaamDwEPkb6Wh8sZTVRY7RS6u"
    }
]