[
    {
        "title": "Jamzetti",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 mango - peeled, seeded and diced ADVERTISEMENT",
            "2 (10.75 ounce) cans tomato puree ADVERTISEMENT",
            "8 ounces Cheddar cheese, shredded ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat a large baking dish with cooking spray.\nFill a large pot with lightly salted water, and bring to a rolling boil. Cook pasta in boiling water until cooked through but still firm to the bite, about 12 minutes. Drain.\nPlace a large skillet over medium heat; cook the sausage, onion, and mango in the skillet until the sausage is completely browned, 5 to 7 minutes. Stir in tomato puree and about half the Cheddar cheese; heat until the cheese is melted. Season with salt and pepper. Stir in cooked spaghetti. Transfer mixture to the prepared baking dish. Top with remaining Cheddar cheese.\nBake in preheated oven until the Cheddar cheese is hot and bubbly, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Polish Sausage Corn Chip Quesadillas",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 link kielbasa (Polish) sausage, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/2 tablespoons salsa ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 pinch cumin ADVERTISEMENT",
            "1 1/2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "2 (8 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup slightly crushed tortilla chips ADVERTISEMENT",
            "1 tablespoon softened butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat. Cook the sausage in the hot oil until lightly browned, about 5 minutes. Add the garlic, salsa, chili powder, pepper, garlic salt, and cumin; cook and stir until the garlic has mellowed, about 4 minutes. Place a tortilla onto a microwave-safe plate and top with the sausage mixture. Sprinkle with the shredded Monterey Jack cheese.\nCook the tortilla in the microwave on High until the cheese melts, 45 seconds to 1 minute, depending on the microwave. Sprinkle the tortilla chips on top of the melted cheese and top with the remaining tortilla. Butter both sides of the quesadilla and place in a clean skillet over medium heat. Cook until golden brown; flip and continue cooking until golden brown on the other side, about 4 minutes per side.\n",
        "picture_link": "QOzvXe6xjcjmUgr6yCATQxTIit/dNsO"
    },
    {
        "title": "Cheap Irish Colcannon",
        "ingredients": [
            "2 1/2 cups thinly sliced green cabbage ADVERTISEMENT",
            "1 cup chopped broccoli ADVERTISEMENT",
            "3 cups hot prepared instant mashed potatoes ADVERTISEMENT",
            "4 tablespoons butter, or as needed ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cabbage and broccoli in a saucepan, and fill with just enough water to cover the vegetables. Cover, and bring the water to a boil over high heat. Reduce the heat to medium, and simmer until vegetables are tender, about 5 minutes; drain.\nStir in the prepared mashed potatoes, butter, garlic salt, and black pepper.\n",
        "picture_link": "jMHfOEyI4TwtT0oO13tG3/ilRx4rC.O"
    },
    {
        "title": "Portuguese Beans with Kale and Linguica",
        "ingredients": [
            "2 (16 ounce) packages dry pink beans ADVERTISEMENT",
            "1 pound bacon, cut into 1/4 inch slices ADVERTISEMENT",
            "2 pounds linguica sausage ADVERTISEMENT",
            "2 red onions, chopped ADVERTISEMENT",
            "2 cloves elephant garlic, chopped ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon dried savory ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons smoked paprika ADVERTISEMENT",
            "1 bunch kale, stemmed and chopped ADVERTISEMENT",
            "3 chipotle chiles in adobo sauce, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pink beans into a large container and cover with several inches of cool water; let stand 8 hours or overnight.\nDrain and rinse the beans; pour fresh water into the pot, covering the beans by 3 inches. Bring to a boil over high heat, then reduce the heat to low; cover and simmer gently.\nPlace the bacon into a large skillet set over medium heat. Cook and stir until the bacon has released its grease and has browned, but not become crisp, about 10 minutes. Once done, remove the bacon with a slotted spoon and stir into the beans. While the bacon is cooking, peel the skin off of the linguica and discard. Cut the sausages in half lengthwise, then slice into 1/4 inch thick half moons. Add the sausage to the skillet, and cook until the sausage has browned. Remove with a slotted spoon and stir into the beans.\nStir the onion and garlic into the remaining grease and cook until the onion has softened and turned translucent, about 5 minutes. Stir the onions and garlic into the simmering beans along with the black pepper, savory, cumin, and paprika. Cover and continue simmering for 4 hours.\nStir the kale and chipotle pepper into the beans, and continue simmering 1 to 2 hours until the beans have broken up and thickened to your desired consistency.\n",
        "picture_link": "ka0cGEvr6m4/Z2tlbYO4wAbjcOCuate"
    },
    {
        "title": "Drunken Flat Iron Steak",
        "ingredients": [
            "1 (2 pound) flat iron steak ADVERTISEMENT",
            "1/4 cup dry vermouth ADVERTISEMENT",
            "1/4 cup sweet vermouth ADVERTISEMENT",
            "2 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place steak into a large resealable bag or shallow dish. Pour in the dry vermouth and sweet vermouth and stir to coat the steak. Seal or cover and refrigerate for 6 hours to marinate.\nHeat the oil in a large skillet over medium heat. Remove steak from the bag and discard the marinade. Season the steak on both sides with red pepper flakes. Fry for 3 to 4 minutes per side for medium-rare, or to your desired degree of doneness. Let rest for a few minutes before serving.\n",
        "picture_link": "btBp9PXG38sRT5U6m2/QtPftRanmT6i"
    },
    {
        "title": "No-Bake Haystacks",
        "ingredients": [
            "3 cups quick cooking oats ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 cup roasted peanuts, chopped ADVERTISEMENT",
            "1 cup raisins (optional) ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the oats, coconut, peanuts, and raisins together in a large bowl.\nStir the sugar, milk, butter, and cocoa powder together in a saucepan and bring to a boil; boil for 1 minute and immediately remove from heat. Stir the vanilla into the cocoa mixture; pour over the oat mixture and stir to coat. Scoop heaping tablespoonfuls of the mixture and drop into haystack-like piles onto waxed paper; allow to cool completely before serving.\n",
        "picture_link": "p/xPxQAN6e8.lneVSSzEjnD5m6UVwY."
    },
    {
        "title": "Ham Pineapple Sandwiches",
        "ingredients": [
            "1 (15 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "24 slices whole-grain bread ADVERTISEMENT",
            "60 thin slices deli ham ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine the pineapple and sugar. Bring to a boil, then cook over medium heat, stirring constantly, until thickened, 5 to 10 minutes. Remove from the heat and cool. When cool, stir in the walnuts.\nIn a medium bowl, stir cream cheese to soften, then stir in enough milk to make it easy to spread. Blend in the pineapple mixture. This part can be made the day before if you like.\nSpread about 2 tablespoons of the pineapple mixture onto one side of 12 slices of bread. Top each one of these with 5 thin slices of ham. Top with remaining bread slices.\n",
        "picture_link": "qvIn6fMEP2WXSC7JG5Lw4gqvjCTLaGm"
    },
    {
        "title": "New Orleans Creole Eggnog",
        "ingredients": [
            "30 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "1 tablespoon allspice ADVERTISEMENT",
            "1 teaspoon ground mace ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 tablespoon freshly ground nutmeg ADVERTISEMENT",
            "1 tablespoon freshly ground cinnamon stick ADVERTISEMENT",
            "1/2 cup pure vanilla extract ADVERTISEMENT",
            "1 teaspoon Angostura bitters ADVERTISEMENT",
            "1 cup bourbon or blended whiskey ADVERTISEMENT",
            "1 (750 milliliter) bottle dark rum ADVERTISEMENT",
            "1 (750 milliliter) bottle almond-flavored liqueur, such as Amaretto ADVERTISEMENT",
            "1 (750 milliliter) bottle brandy ADVERTISEMENT",
            "6 quarts heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the eggs with the white sugar, and light and dark brown sugars in a stand mixer until completely blended. Strain the mixture through a fine mesh sieve into a bowl. Stir in the allspice, mace, ginger, cloves, nutmeg, cinnamon, and vanilla.\nPour the bitters, bourbon, rum, almond-flavored liqueur, and brandy into a large, 4 gallon bowl or food safe bucket. Stir in the egg mixture until thoroughly blended. Pour in the heavy cream and continue stirring. Divide into smaller containers and refrigerate. Shake or stir the containers 2 to 4 times each day for 30 days.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caribbean Breeze",
        "ingredients": [
            "ice ADVERTISEMENT",
            "1 fluid ounce orange vodka ADVERTISEMENT",
            "1 fluid ounce raspberry vodka ADVERTISEMENT",
            "1/2 fluid ounce coconut-flavored rum ADVERTISEMENT",
            "2 fluid ounces orange juice ADVERTISEMENT",
            "2 fluid ounces pineapple juice ADVERTISEMENT",
            "1 dash grenadine ADVERTISEMENT",
            "1 orange wedge, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a tall glass with ice. Pour the orange vodka, raspberry vodka, rum, orange juice, pineapple juice, and grenadine over the ice; stir well. Garnish with an orange wedge.\n",
        "picture_link": "9AhFkqR/l4qaleVEAOuZmN3luOlNZzq"
    },
    {
        "title": "Smoked Citrus Goose Breast",
        "ingredients": [
            "1/2 cup orange juice ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1/3 cup Dijon mustard ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "8 goose breast halves ADVERTISEMENT",
            "1 cup hickory wood chips, soaked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the orange juice, olive oil, mustard, sugar, soy sauce, honey, onion, and garlic powder in a bowl; place the goose in the marinade; cover and refrigerate 3 to 6 hours.\nPreheat a smoker for medium heat, about 300 degrees F (150 degrees C). If you do not have a smoker, prepare a grill for indirect heat. Once the coals are ready, throw a handful of the soaked hickory wood chips on to create smoke.\nPlace the goose breasts on the grate. Brush occasionally with the marinade for the first 30 minutes, then discard any unused marinade. Continue to cook until the juices run clear and reach an internal temperature of 165 degrees F (74 degrees C), 10 to 15 minutes longer.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Muscat Gosht (Lamb in Spicy Tomato Gravy)",
        "ingredients": [
            "2 1/4 pounds boneless lamb shoulder, cut into 1 1/2 inch pieces ADVERTISEMENT",
            "3 onions, sliced ADVERTISEMENT",
            "1 3/4 cups chopped tomato ADVERTISEMENT",
            "1 2/3 tablespoons garlic paste ADVERTISEMENT",
            "1 2/3 tablespoons ginger paste ADVERTISEMENT",
            "1 tablespoon black peppercorns ADVERTISEMENT",
            "1 (3 inch) cinnamon stick ADVERTISEMENT",
            "1/4 cup dried chile de arbol peppers ADVERTISEMENT",
            "5 whole clove ADVERTISEMENT",
            "1 teaspoon black cardamom seeds ADVERTISEMENT",
            "9 tablespoons ghee (clarified butter) ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a large wok or skillet over low heat. Combine the lamb, onion, tomato, garlic paste, ginger paste, peppercorns, cinnamon, dried peppers, cloves, cardamom seeds, and salt in the pan and stir; cover and cook until the mutton is tender, 30 to 35 minutes. Stir in the ghee. Cook until the sauce has thickened, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Candy Apple on the Rocks",
        "ingredients": [
            "1/2 cup ice ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger peach schnapps ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger apple schnapps ADVERTISEMENT",
            "2 fluid ounces cranberry juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a glass with ice, and pour in the peach schnapps and apple schnapps; top with cranberry juice.\n",
        "picture_link": "MXrNFBXWI48tm7Gs4XMMQ8apTNi/tWa"
    },
    {
        "title": "Chocolate Wine Balls",
        "ingredients": [
            "3 1/4 cups crushed vanilla wafers ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "3 tablespoons corn syrup ADVERTISEMENT",
            "1/2 cup full-bodied red wine (Cabernet Sauvignon, Cotes du Rhone, Zinfandel, Shiraz or Barolo) ADVERTISEMENT",
            "1 cup red decorator sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the vanilla wafers, confectioners' sugar, cocoa powder, corn syrup and red wine. Mix with a sturdy spoon or your hands until it becomes a uniform dough. Shape into 1 inch balls and roll in red decorator sugar. Store in a covered container in the refrigerator. Allow to come to room temperature before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cinnamon Crown Rolls",
        "ingredients": [
            "2 tablespoons active dry yeast ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 eggs, well beaten ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "Syrup ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar, packed ADVERTISEMENT",
            "1 tablespoon corn syrup ADVERTISEMENT",
            "Topping ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve the yeast in warm water in a large mixing bowl. Let stand until creamy, about 10 minutes. Lightly grease the inside of another large mixing bowl, and set aside.\nMeanwhile, heat the milk and 1/2 cup butter in a pan over medium heat. Stir in 1/2 cup white sugar and salt. Remove from heat, and cool to room temperature. Stir the milk mixture into the yeast mixture until blended. Mix in the eggs, and gradually stir in the flour, 1 cup at a time, to make a soft dough. Turn the dough out onto a clean, lightly floured surface; knead until smooth and elastic, about 10 minutes. Place the dough into the greased bowl, turning to coat the surface. Cover with a damp cloth, and set in a warm place until dough doubles in size, 1 to 2 hours.\nLightly grease a 9 inch tube pan with a solid bottom. Make the syrup by mixing 1/3 cup butter, brown sugar, and corn syrup in a small pan over medium heat. Stir until the butter melts and sugar dissolves. Pour evenly into the bottom of the prepared tube pan.\nPunch down the dough, and turn out onto a lightly floured surface. Cover with a clean cloth, and let rise 10 minutes.\nMeanwhile, make the topping by mixing 3/4 cup white sugar with the cinnamon in a shallow bowl. Pour 1/4 cup melted butter into a second bowl.\nPreheat oven to 350 degrees F (175 degrees C).\nDivide the dough into 1 inch balls. Roll each ball first in the melted butter, then in the cinnamon-sugar mixture. Arrange balls side by side around the bottom of the tube pan. Cover with a cloth, and set in a warm place until the dough doubles in size, about 1 hour. Drizzle1 tablespoon heavy cream over each ball.\nBake until tops are golden brown, 45 to 55 minutes. Remove pan from oven and immediately invert onto a large serving plate.\n",
        "picture_link": "HDMNT/9bu/pfTjgmXhnJXNsvBiNxP3m"
    },
    {
        "title": "Dragon Fruit Shake",
        "ingredients": [
            "1 dragon fruit (pitaya) ADVERTISEMENT",
            "2 tangerines, peeled and segmented ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "4 leaves fresh basil ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 cup sparkling mineral water, chilled ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut two 1/4 inch thick slices from the peeled dragon fruit to use as a garnish; set aside. Place the remaining dragon fruit into a blender along with the tangerine segments, lime juice, basil, brown sugar, and sparkling water. Puree until smooth. Stir in the crushed ice, and pour into glasses. Garnish with the reserved dragon fruit slices to serve.\n",
        "picture_link": "rKQKYTw.B5PJ1xtI9R94MNRbwtRvWZO"
    },
    {
        "title": "Scandinavian-Style Rice Porridge",
        "ingredients": [
            "8 whole green cardamom pods, lightly crushed to remove seeds, discarding pods ADVERTISEMENT",
            "1/2 gallon whole milk ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 cup unsalted butter ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "3 tablespoons unsalted butter, or amount desired ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using a rolling pin, crush the cardamom seeds until very fine. Place the cardamom, milk, rice, and butter into a deep, heavy pan. While slowly stirring the milk mixture, cook over medium heat for 90 minutes. Lower the heat if necessary to prevent the milk from boiling or overheating. Stir in the sugar, and continue cooking until the mixture thickens, about 15 minutes more.\nPour the rice mixture into a serving bowl. Place 3 tablespoons butter on top, and allow to melt. Dust with cinnamon. Serve warm or cold.\n",
        "picture_link": "GtZ4rBOh3ws.i2f96wgn9eaLPWt/vca"
    },
    {
        "title": "Candied Pumpkin Recipe",
        "ingredients": [
            "1/4 cup unsalted butter ADVERTISEMENT",
            "3 cups fresh pumpkin, cut into 1/2-inch cubes ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3/4 cup maple syrup ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium-low heat. Cook the pumpkin in the butter until tender, about 20 minutes. Add the sugar and stir until dissolved. Stir in the syrup, ginger, and cinnamon; remove from heat and allow to cool. Transfer to a bowl and cover. Refrigerate at least 2 hours before serving.\n",
        "picture_link": "Dt6P0otO6YycxsmVGz5O8ZtLaauCh6G"
    },
    {
        "title": "Chihuahua-Style Salsa Verde",
        "ingredients": [
            "12 tomatillos, husked and chopped ADVERTISEMENT",
            "1 (7 ounce) can chopped jalapenos, drained ADVERTISEMENT",
            "1/2 head lettuce, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/3 cup dried cilantro ADVERTISEMENT",
            "3 tablespoons ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 onion, chopped ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the tomatillos, jalapenos, lettuce, garlic, cilantro, cumin, salt, and pepper in a blender or food processor; process until chopped to desired consistency.\nMelt the butter in a saucepan over medium heat; cook the onions in the melted butter until clarified, about 5 minutes. Pour the tomatillo mixture and the chicken broth into the sauce pan; cook, stirring occasionally, until the salsa begins to thicken, about 20 minutes.\n",
        "picture_link": "rPK4HCqMFwHPI7.HLzM6vaGtgJuP0gi"
    },
    {
        "title": "Olive, Lamb, and Red Pepper Casserole",
        "ingredients": [
            "1 (2 pound) spaghetti squash, halved and seeded ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound ground lamb ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 small chopped red onion ADVERTISEMENT",
            "2 red bell peppers, seeded and diced ADVERTISEMENT",
            "5 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "12 ounces ricotta salata cheese, crumbled ADVERTISEMENT",
            "12 pimento-stuffed green olives, sliced ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil. Poke holes in the skin of the squash, and place onto the baking sheet cut-side down. Bake in the preheated oven until soft, about 1 hour. Turn the squash cut-side up, and allow to cool until cool enough to handle, about 30 minutes.\nHeat 1 tablespoon of olive oil in a skillet over medium-high heat. Stir in the ground lamb, and cook until browned and crumbly, about 7 minutes. Once browned, remove the lamb from the skillet and set aside. Heat the remaining 1 tablespoon of olive oil in the skillet over medium heat. Stir in the onion and bell peppers, and cook until the onion has softened and turned translucent, about 5 minutes. Stir in the garlic, basil, rosemary, and oregano. Season to taste with salt and pepper (remember that the ricotta salata is very salty). Continue cooking and stirring until the flavor of the garlic has mellowed, about 3 minutes more.\nScrape the flesh of the warm spaghetti squash into a large bowl. Separate the strands of the squash with a fork, and season with salt and pepper to taste. Place half of the squash into a 9x13 inch baking dish. Evenly spread with half of the lamb, half of the red pepper mixture, half of the olives, sprinkle with half of the cheese, and spread with half of the tomato sauce. Repeat the layers using the remaining squash, lamb, red pepper mixture, olives, cheese, and tomato sauce.\nBake the casserole in the preheated oven until hot and bubbly, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peppermint Patty",
        "ingredients": [
            "2 ice cubes ADVERTISEMENT",
            "2 fluid ounces coffee flavored liqueur ADVERTISEMENT",
            "1 fluid ounce peppermint schnapps ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ice cubes into a chilled rocks glass, and pour the coffee liqueur and schnapps overtop. Bottoms up!\n",
        "picture_link": "ZqxDKnbGd4oQKn9d/CAA8FrfqJs75gS"
    },
    {
        "title": "Sweet Potatoes with Brandy and Raisins",
        "ingredients": [
            "1/4 cup brandy ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "2 tablespoons softened butter ADVERTISEMENT",
            "4 (1 pound) sweet potatoes ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour brandy over raisins in a small bowl, cover, and allow to stand for 2 hours.\nPreheat oven to 350 degrees F (175 degrees C). Butter a 2-quart baking dish with the softened butter.\nPlace sweet potatoes on a baking sheet, and bake in preheated oven until tender, about 30 minutes. Remove and allow to cool until cool enough to handle, then peel the potatoes and slice them 1/2 inch thick. Arrange the potato slices in the prepared baking dish, and sprinkle with sugar and brandy-soaked raisins.\nReturn the sweet potatoes to the oven, and bake 30 to 40 minutes until hot and bubbly.\n",
        "picture_link": "h5GGtLKWeXtToDymlM2OyjHbSIuGB6C"
    },
    {
        "title": "Onion Pepper Relish",
        "ingredients": [
            "10 large yellow onions, cut into wedges ADVERTISEMENT",
            "15 fresh jalapeno peppers ADVERTISEMENT",
            "3 cups white vinegar ADVERTISEMENT",
            "2 tablespoons cracked black pepper ADVERTISEMENT",
            "2 tablespoons pickling salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Shred the onions and jalapeno peppers in a food processor, using the shredding blade.\nCombine the onion, jalapeno pepper, vinegar, black pepper, and salt in a large pot and place over medium heat. Stirring frequently, bring to a full boil; cook for 10 minutes.\nPack the mixture firmly into sterilized pint canning jars to within 3/4 inch of the top. Pour the cooking liquid over the onions to within 1/2 inch of the top and using a spatula, stir gently to remove all air bubbles. Wipe the rims with a clean damp cloth and adjust lids and rings firmly. Process in a boiling water bath for five minutes.\n",
        "picture_link": "e/NxA.EkIrQXLlSvQLMTC1Qqpmg8B7K"
    },
    {
        "title": "Jack-O-Lantern Cookies",
        "ingredients": [
            "1 cup canned pumpkin ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "3/4 cup shortening, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Mix pumpkin, sugar, cinnamon, ginger, and nutmeg in a bowl until thoroughly combined. Set aside.\nSift flour, salt, and baking soda together in a large bowl. Stir in brown sugar, shortening, egg, and molasses, mixing until smooth. Fold in rolled oats.\nRoll cookie dough out to 1/8 inch thick on a lightly floured surface. Cut out 48 circles using a 2 1/2 inch cookie cutter. Arrange 24 of the circles on a baking sheet and place a teaspoon of pumpkin filling on each. Cut Jack-O-Lantern faces on the remaining 24 circles, then lay the faces over the pumpkin filling, sealing the edges.\nBake in the preheated oven until golden brown, 12 to 15 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vinegar Cobbler",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons softened butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nStir the flour and salt together in a mixing bowl. Cut in the shortening until the mixture resembles coarse crumbs. Stir in 1/4 cup of water until a dough forms. Divide the dough into thirds, roll 1/2 inch thick, and cut into strips 1 inch wide; set aside.\nBring the vinegar, 2 cups water, sugar, and vanilla extract to a boil in a large saucepan over high heat. Drop 2/3 of the dough strips into the boiling liquid. Once the liquid returns to a boil, pour into a 8x8 inch baking dish. Use the remaining dough strips to form a crisscross pattern on top of the cobbler. Dot the top with the softened butter.\nBake in the preheated oven until the dough strips are golden brown, 35 to 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tender Shortbread",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/2 cup fructose (fruit sugar) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter and sugar. Add 1 3/4 cups flour gradually, reserving 1/2 cup for pastry board.\nTurn dough out on board and gradually work in remaining flour, if necessary. Roll dough to 1/3 or 1/2 inch thickness; then cut with cookie cutter\nPlace on cookie sheet and bake at 300 degrees F (150 degrees C) for 30 to 35 minutes.\n",
        "picture_link": "JCR7hVJ1474bsCA8eWDPN.olGDxgXSe"
    },
    {
        "title": "Two Hearts Together",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 egg, separated ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/4 cup pink decorator sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In mixer bowl, beat butter, granulated sugar, cream cheese, egg yolk, 1/2 teaspoon almond extract, vanilla and salt until well blended. Add flour, mix well. Chill 2 hours.\nOn floured surface, knead dough to form smooth ball. Divide into thirds. On floured surface, roll out each portion to 1/8 inch thickness. Cut out heart shapes with cookie cutter.\nPlace 1 inch apart on ungreased baking sheets. Brush with slightly beaten egg white and sprinkle with colored sugar. Bake in preheated 375 degrees F (190 degrees C) oven for 7 to 10 minutes. Cool.\nIn saucepan, combine condensed milk, whipping cream and remaining 1/2 teaspoon almond extract. Over medium high heat, cook and stir until mixture comes to a boil. Reduce heat to medium; cook and stir until thickened, 8 to 10 minutes. Cool. Sandwich \"two hearts together\" with caramel mixture. Store tightly covered.\n",
        "picture_link": "EO9T9bnQ35n.tTfhEdtz8hpZD6tmfqO"
    },
    {
        "title": "Stained-glass Sugar Hearts",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1 cup crushed peppermint hard candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter or margarine, shortening, sugars, eggs and vanilla. Add dry ingredients (except candy) and mix well. Dough will be greasy.\nUsing a floured surface and rolling pin, roll out dough. Cut out 2 inch heart shaped cookies. Using a 1 inch heart shaped cookie cutter, cut out a smaller heart in the middle of the larger one. Put cookies on a foil lined cookie sheet.\nInside of cut-out heart, sprinkle crushed candy crumbs (such as red life savers or candy canes). Spread the crumbs to the inside edges of the cookie.\nBake at 350 degrees F (175 degees C) for 10-12 minutes. When cookes have cooled, remove from sheets. The cookie can be frosted if you desire.\n",
        "picture_link": "jJr2ERm1mmjGPIyh9SCVf406PK9tWI."
    },
    {
        "title": "Chocolate Wafer Cookies",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "45 chocolate covered thin mints ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together flour, baking soda and salt. Set aside.\nCream butter or margarine with white and brown sugars. Blend and beat well. Add eggs and water. Stir in vanilla. Add dry ingredients and mix thoroughly.\nCover and refrigerate for 2 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nEnclose 1 chocolate mint wafer in 1 tablespoon of chilled dough. Bake on greased cookie sheet for 10-12 minutes.\n",
        "picture_link": "4hH5qlfGnLObywzfMWXRVI.SJpetozu"
    },
    {
        "title": "Glogg",
        "ingredients": [
            "1 1/2 cups red wine ADVERTISEMENT",
            "1 1/2 cups ruby port wine ADVERTISEMENT",
            "1 cup vodka ADVERTISEMENT",
            "6 pods green cardamom ADVERTISEMENT",
            "5 whole cloves ADVERTISEMENT",
            "2 tablespoons grated orange zest ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "2 ounces slivered almonds ADVERTISEMENT",
            "1/2 tablespoon raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine wine, port, and vodka in a nonreactive pot. Add cardamom, cloves, orange peel, and cinnamon, and gently warm (do not boil) over low heat. Allow to steep for at least 20 minutes (longer is better). Serve in heatproof glasses, sprinkled with almonds and raisins.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Peanut Butter Dreams",
        "ingredients": [
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "4 tablespoons shortening ADVERTISEMENT",
            "1/3 cup chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat sugar, peanut butter, and butter or margarine till fluffy. Blend in water, egg, and vanilla.\nCombine oats, flour and baking soda and add to the mixture.\nShape into balls 1 inch in size. Place on ungreased cookie sheet, and flatten with a glass dipped in sugar. Bake 8 to 10 minutes. Cool completely.\nIn a saucepan over low-heat, melt chocolate and shortening, stir until smooth. Take 1/2 teaspoon and spread over each cookie, sprinkle with nuts. Chill until set.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fraser Shortbread",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3 cups cake flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace butter (not softened) in a large mixing bowl. Add flour, sugar and corn starch. Mix with hands (do not use a mixer) until blended and most of dough is like course cornmeal. It will be very lumpy.\nSpread a portion of the dough into the bottom of a glass pie pan and press firmly into the pan. Add dough until the thickness is about 1/2 inch thick.\nPlace in oven and bake until edges are golden brown. Remove from oven and use a fork to create perforations. Shortbread will break easily when cooled. Remove from pie pan by placing a plate to cover, then flipping over - shortbread will fall out in one piece.\n",
        "picture_link": "1Uif46x0D4lM/AaXScs2asjiNIAoExq"
    },
    {
        "title": "Marco Polo Peanut Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 cup bran flakes cereal ADVERTISEMENT",
            "3/4 cup raw Spanish peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together flour, baking powder and salt. Cream sugars, shortening and egg.\nAdd sifted dry ingredients to creamed mixture alternating with milk. Stir in bran flakes and peanuts. Mix well.\nDrop by teaspoonfuls onto greased baking sheet. Bake at 375 degrees F (190 degrees C) for 10-12 minutes until lightly brown. Store in airtight container.\n",
        "picture_link": "juWHW7a59f2AbuV.Gx.4Xu/5ywVMM6m"
    },
    {
        "title": "Cupid's Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/4 teaspoon peppermint extract ADVERTISEMENT",
            "3 drops red food coloring ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "5 (1.5 ounce) bars milk chocolate candy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together butter or margarine and white sugar until light and fluffy. Blend in egg and vanilla. Sift together flour and salt. Add to creamed mixture and mix well. Stir in oats.\nDivide dough in half. Add peppermint extract and a few drops of food color to half of dough. Chill for several hours.\nPreheat oven to 350 degrees F (175 degrees C).\nRoll out each half of dough to 1/8 inch thickness on surface sprinkled lightly with confectioners' sugar. Cut out half of each color with the 2 1/2 inch heart shaped cookie cutter, and half with a 1 1/2 inch cookie cutter. Try to make it so that you have an equal number of small and large hearts in opposing colors. Place them on unprepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven.\nRemove from oven and place 1 one square (1/8) of a chocolate bar onto the center of each large heart. Place small heart on top and press lightly to secure. Transfer to rack to cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Millionares Shortbread",
        "ingredients": [
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "7/8 cup granulated sugar ADVERTISEMENT",
            "1 dash cream of tartar ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using the back of a large spoon, cream 1/2 cup butter or margarine until it is light. Mix in the confectioners' sugar, then 1/4 tsp. vanilla. Now work in the flour. Knead the dough on an unfloured surface until it is smooth.\nSpray a shortbread pan (8 piece pan) very lightly with a non-stick spray. Put the ball of dough in the middle of the pan, and working from the inside out, firmly press the dough into the pan. Prick the entire surface with a fork, and bake in the pan at 325 degrees F (165 degrees C) for 30-35 minutes or until lightly browned.\nLet short bread cool in its pan for 10 minutes before you loosen the edges with a knife and flip the pan upside down onto a cutting board. If shortbread does not come out right away, tap one edge of the pan against the board. Do not cut!! Allow shortbread to cool.\nCut strips of waxed paper and lay them over the edges of the shortbread pan, being sure to cover the rim completely. Return baked shortbread to pan.\nTo Make the Toffee: Mix the 1 cup less 2 T. sugar, cream of tartar and cream in a small heavy saucepan. Bring to a boil over med-high heat, stiffing constantly, and cook for 2-3 minutes. Add the butter.\nContinue to cook and stir the candy until it turns a pale brown and reaches the soft crack stage. This is usually 285-290 degrees F (approx. 150 degrees C) on a candy thermometer. Another way to test it is to drop a small amount of molten candy into a cup of ice water. If it hardens to a crunchy blob, the candy is ready. Take the pan for the heat and let it cool. Stir in 1/2 t. vanilla.\nNow pour the toffee onto the shortbread. Use as much of the toffee as you like. Let the toffee cool until it is just warm to the touch. Turn the shortbread onto a cutting board and peel off the waxed paper strips. Using a serrated knife, slowly cut the shortbread into serving pieces. Turn the pieces toffee side up to cool completely.\nTo Make Top Chocolate Layer: Melt the chocolate in a small pan over a tiny flame. Cool it slightly then spread a layer of chocolate on top of the toffee layer on the shortbread. Place the finished cookies chocolate side up on a plate and place in the refrigerator to finish hardening. Remove millionaires shortbread 1/2 hour before you plan to eat them. When you serve these fabulous cookies, turn the cookies over so that the chocolate side is down and the pretty side is up.\n",
        "picture_link": "FIPPazTSPkEmEpkDbcrMvuFT/4jz6Du"
    },
    {
        "title": "Insalata Cotta e Cruda",
        "ingredients": [
            "2 artichokes, uncooked and trimmed to the heart ADVERTISEMENT",
            "2 bulbs fennel bulbs, trimmed and quartered ADVERTISEMENT",
            "2 carrots ADVERTISEMENT",
            "1 baking potato ADVERTISEMENT",
            "1/2 head romaine lettuce ADVERTISEMENT",
            "1 medium head Belgian endive ADVERTISEMENT",
            "1 tomato ADVERTISEMENT",
            "2 ounces fontina cheese ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 teaspoon Dijon-style prepared mustard ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the artichoke hearts, fennel, and carrots in salted boiling water until tender but firm, about 8 minutes. Drain. When cool, cut the artichoke hearts and fennel into thin wedges. Cut the carrots on the diagonal into thin slices. Boil the potato in water to cover until tender but firm. Drain, and when cool enough to handle, peel and cut into medium dice.\nCut the romaine into thin strips crosswise. Cut the endive into thin strips lengthwise. Core the tomato, and cut into medium dice.\nTrim the rind from the Fontina, and cut cheese into small matchsticks.\nMound the lettuces in a shallow bowl, and sprinkle with the tomato. Arrange the vegetables over the top. Sprinkle with the Fontina.\nIn a small bowl combine the olive oil, vinegar, and mustard. Salt and pepper to taste. Beat lightly with a fork. Drizzle the dressing over the salad, and toss.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cranberry-Black Cherry Gelatin Salad",
        "ingredients": [
            "1 (6 ounce) package black cherry flavored Jell-O® mix ADVERTISEMENT",
            "1 (16 ounce) container sour cream, room temperature ADVERTISEMENT",
            "1 (16 ounce) can whole cranberry sauce ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2 cups hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gelatin mix and hot water until the gelatin dissolves. Stir in the can of cranberries and mix well. Add the room temperature sour cream and stir to combine. Place gelatin mixture in the refrigerator until almost set. Stir in the walnuts and return to the refrigerator until the mixture is completely set.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Date Nut Logs",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2/3 cup dates, pitted and chopped ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9 inch square baking pan.\nCombine flour and baking powder and set aside. In a large, clean glass or metal bowl, whip egg whites and salt and until foamy. Gradually add sugar and continue to whip until stiff (but not dry). Gradually fold in dry ingredients then fold in dates and nuts.\nSpread evenly in prepared pan. Bake for 20-30 minutes or until firm to touch.\nCool in pan until just cool enough to handle. Cut into finger-sized lengths and roll between palms to form logs. Roll each log in confectioners' sugar. Cool completely on wire rack.\n",
        "picture_link": "/xBRdrJj8rEH9DPuB5O1oKVT2wiIoSa"
    },
    {
        "title": "Pumpkin Spice Ring",
        "ingredients": [
            "1 (18.25 ounce) package angel food cake mix ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pumpkin and pumpkin pie spice, and mix well. Set aside.\nMix cake as directed on package. Fold in pumpkin mixture. Pour into an ungreased tube pan.\nBake at 350 degrees F (175 degrees C) until lightly browned, using the box directions as a guide to cooking time.\n",
        "picture_link": "klvX.5Z31iSDool1RcI8HR5NrSe2Zn2"
    },
    {
        "title": "Sugar Free Chocolate Tea Cookies",
        "ingredients": [
            "1/4 cup shortening ADVERTISEMENT",
            "3 tablespoons sugar substitute with aspartame (such as Equal packets) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons skim milk ADVERTISEMENT",
            "1 1/4 cups cake flour ADVERTISEMENT",
            "1 (1 ounce) square unsweetened chocolate, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream shortening. Add sugar substitute, egg, vanilla and milk and blend well.\nAdd half the flour, mix well and stir in chocolate and the rest of the flour.\nWith cookie press, press onto an ungreased cookie sheet. Use hands and make small ball if you do not have press. Putting flour on your hands, this keeps dough from sticking. Press down with fingers on top of each cookie.\nBake at 350 degrees F (175 degrees C) for 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Heart's Delight",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "5 drops red food coloring ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "5 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, with electric mixer at medium speed, beat 1 cup butter or margarine with 1/2 cup sugar, almond extract, and food coloring until light and fluffy. With wooden spoon, stir in 2 1/2 cups flour until smooth and well combined. Divide dough into 2 parts. Refrigerate, covered, 2 hours.\nPreheat oven to 300 degrees F (150 degrees C).\nOn lightly sugared surface, roll out dough, one part at a time, about 1/4- inch thick. Using heart shaped cookie cutter, cut out cookies. Place, one inch apart, on ungreased cookie sheets. Bake 20 minutes. Cool completely on wire rack. Frost when cool.\nTo Make Frosting: Cook 5 Tablespoons flour and milk until thick, stirring constantly. Let cool. Cream together 1 cup sugar, 1 cup butter and 1 teaspoon vanilla. Add flour/milk mixture. Beat until consistency to spread. When finished it looks like whipped cream. Spread on cookies.\n",
        "picture_link": "0NiNwMe8dUEmZX.1YlhXTo3CNOKxfJO"
    },
    {
        "title": "Log Cabin Cookies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1/2 cup dark corn syrup ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 tablespoon maple flavored extract ADVERTISEMENT",
            "3 cups self-rising flour ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix all ingredients together in the order given. Roll into a log 2 inches in diameter and refrigerate until firm.\nCut into thin slices and place on greased cookie sheet. Bake at 350 degrees F (175 degrees C) for 8 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sedation",
        "ingredients": [
            "ice ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger vodka ADVERTISEMENT",
            "1/4 (1.5 fluid ounce) jigger amaretto liqueur ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger peach schnapps ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger coconut-flavored rum ADVERTISEMENT",
            "1/4 (1.5 fluid ounce) jigger melon liqueur ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger orange juice ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger pineapple juice ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers cranberry juice ADVERTISEMENT",
            "1 twist lemon peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a pint glass with ice, and pour in the vodka, amaretto, peach schnapps, coconut rum, and melon liqueur; stir. Pour in the orange juice and pineapple juice. Float the cranberry juice on top. Garnish with a lemon twist.\n",
        "picture_link": "4IUB/RVyb.155eYVMyKlf/Tz/LO.MGy"
    },
    {
        "title": "Sweet Spiced Tamales",
        "ingredients": [
            "32 dried corn husks ADVERTISEMENT",
            "1 cup vegetable shortening ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups masa harina ADVERTISEMENT",
            "1 1/2 cups warm water ADVERTISEMENT",
            "1/2 cup firmly packed brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "2/3 cup chopped pecans ADVERTISEMENT",
            "1/2 cup brown sugar, divided ADVERTISEMENT",
            "32 5-inch lengths of kitchen twine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak the dried corn husks in hot water until soft, 30-60 minutes.\nBeat the shortening and salt with an electric mixer in a bowl until light and fluffy, and slowly beat in the masa harina 1/4 cup at a time, alternating with 1/4 cup water per addition, until the masa mixture is very light and fluffy. Beat in 1/2 cup brown sugar, baking powder, cinnamon, nutmeg, and vanilla until the mixture forms a soft, fluffy dough, about 5 minutes.\nTo assemble the tamales, drain the corn husks and pat them dry. Spread about 2 tablespoons of the masa dough onto a corn husk, forming a rectangle of dough 1/4 inch thick and about 2x3 inches in size. Spread the dough all the way to the right edge of the corn husk, and about 1/2 inch from the left edge. Spoon about 1 teaspoon pecans in a line down the center of the masa dough, and sprinkle the nuts with about 1 teaspoon of brown sugar.\nRoll the right edge of the corn husk over the filling to the center of the tamale. Fold the left edge towards the center, rolling the filling into the dough, so the plain edge overlaps the rolled tamale. Fold the top end down and the bottom end up, making a tidy package, and tie securely with a piece of kitchen twine.\nFill a large saucepan with water, and place a steamer rack in the pan so the top of the rack is about 2 inches above the water. Place the filled tamales into the steamer with seam sides down. Bring to a boil, cover, and steam the tamales until firm and the dough releases easily from the corn husk, 1 1/2 to 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Embutido (Filipino Meatloaf)",
        "ingredients": [
            "1 1/2 pounds ground pork ADVERTISEMENT",
            "1 (12 ounce) container fully cooked luncheon meat (such as SPAM®), sliced thin ADVERTISEMENT",
            "2 (4 ounce) links chorizo de bilbao (spicy Spanish semi-cured sausage), sliced thin ADVERTISEMENT",
            "2 tablespoons chopped sweet pickle ADVERTISEMENT",
            "1 (1.5 ounce) box raisins ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons soy sauce, or to taste ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nMix together the ground pork, luncheon meat, chorizo de bilbao, pickle, raisin, eggs, salt, and pepper in a large bowl. Form the mixture into 2 logs and wrap with aluminum foil. Place the wrapped logs in a baking dish.\nBake in the preheated oven for 1 hour.\nSet the meatloaves aside to rest. Carefully drain the drippings from the baking dish into a small saucepan placed over medium heat. Stir the soy sauce and corn flour into the drippings; bring to a boil. Cook the mixture at a boil, stirring continually, until the sauce is thick, 5 to 7 minutes. Unwrap the meatloaves and slice; serve the sauce over sliced meatloaf.\n",
        "picture_link": "O9N58WbYuJeT1J9VRMH1mPWuZ5/11fe"
    },
    {
        "title": "Panettone French Toast With Orange Mascarpone Sauce",
        "ingredients": [
            "1 (12 ounce) panettone ADVERTISEMENT",
            "1 (8 ounce) container mascarpone cheese ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "1/3 cup orange marmalade ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice panettone into 1 inch slices; cut each slice into 4 wedges. In a small bowl, whisk together the mascarpone, orange preserves, and orange juice. In a separate large bowl, whisk the eggs, cinnamon, and nutmeg.\nHeat the olive oil in a large skillet over medium heat. Dip the panettone into the egg mixture, coating well. Place into the hot oil; fry until golden brown, about 3 minutes per side. Serve with the orange mascarpone sauce.\n",
        "picture_link": "0bZt70fH0cNUF6kE/VQGHJa7L1B6m4."
    },
    {
        "title": "Currant Cardamom Bread Pudding",
        "ingredients": [
            "3 large eggs ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1/2 cup apple flavored syrup ADVERTISEMENT",
            "1/2 cup raw sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 1/2 teaspoons ground cardamom ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup half-and-half cream ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (16 ounce) loaf day-old French bread, cut into 1/4-inch cubes ADVERTISEMENT",
            "1/2 cup dried currants ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix eggs, butter, apple syrup, sugar, vanilla extract, cinnamon, nutmeg, cardamom, and salt. together in a large bowl. Stir in half and half and milk. Place cubed bread and currants into a large baking dish. Stir in the egg mixture until bread is evenly coated. Cover and refrigerate for 30 minutes.\nPreheat an oven to 350 degrees F (175 degrees C). Uncover the baking dish.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Almond Glazed Onions",
        "ingredients": [
            "1 1/2 pounds small boiling onions, trimmed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/3 cup slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place onions in a large saucepan with enough water to cover by 1 inch. Bring to boil; cook until onions are tender, 20 to 25 minutes. Drain; slip off skins.\nMelt butter and sugar in a deep skillet over medium heat. Stir in water and skinned onions. Cook, stirring, until onions begin to color, about 10 minutes.\nSprinkle the almonds into the skillet. Cook and stir until onions are golden and almonds are lightly toasted, 4 to 5 additional minutes.\n",
        "picture_link": "kwFH3hZpwNtt336hqP1u9opDEQFUD6K"
    },
    {
        "title": "Easy Surprise Cake",
        "ingredients": [
            "13 tablespoons butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease 2 8-inch cake pans.\nPlace the butter and sugar into a mixing bowl, and mash together with a wooden spoon until the mixture is creamy and thoroughly combined. In a separate bowl, beat the eggs, and pour into the butter mixture. Stir until combined.\nSift the flour and baking powder together in a bowl, and lightly stir into the butter mixture. Pour half the batter into each prepared cake pan.\nBake in the preheated oven until a toothpick inserted into the middle of a cake comes out clean, 20 to 25 minutes. Cool in pans for 10 minutes before removing to finish cooling on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dark Chocolate Macadamia Brownies",
        "ingredients": [
            "8 ounces dark chocolate, broken into pieces ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups superfine sugar (or granulated sugar, processed to fine texture in a food processor) ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup macadamia nuts, cut into quarters ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line a 9x11-inch baking pan with parchment paper.\nIn a saucepan over low heat, melt together the dark chocolate and butter. Beat the mixture with an electric mixer on low speed until well blended, and beat in eggs, sour cream, vanilla extract, sugar, and flour until thoroughly combined. Stir in the macadamia nuts, and pour the batter into the prepared baking pan.\nBake in the preheated oven until the top forms a cracked crust, 30 to 35 minutes. Let cool in the pan about 10 minutes before moving to a wire rack to finish cooling.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bopis",
        "ingredients": [
            "1/2 pound pork liver ADVERTISEMENT",
            "1/2 pound pork lung ADVERTISEMENT",
            "1/2 pound pork heart, cut into bite-size pieces ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pork liver and the pork lung in two separate pots and cover with water. Bring each pot to a boil; cook at a boil until tender, about 10 minutes. Drain both and allow to cool before chopping into bite-size pieces. Set aside.\nCombine the liver, lung, and heart in a large pot over medium heat; add the bay leaves, vinegar, and water. Season with salt and pepper. Bring the mixture to a simmer and cook for 5 minutes.\nMeanwhile, heat the olive oil in a large saucepan over medium heat; cook the onion and garlic in the hot oil until fragrant, about 5 minutes. Stir the tomatoes into the mixture and simmer 5 minutes. Pour the pork liver mixture from the pot into the saucepan; cook and stir together for 5 minutes more. Serve hot.\n",
        "picture_link": "WiuUhpIe.bqUfxqAFYcp7ycnE5MFT/C"
    },
    {
        "title": "Sundal",
        "ingredients": [
            "1 cup dried chickpeas ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 tablespoon cooking oil ADVERTISEMENT",
            "1 teaspoon skinned split black lentils (urad dal) ADVERTISEMENT",
            "1 teaspoon mustard seeds ADVERTISEMENT",
            "2 dried red chile peppers ADVERTISEMENT",
            "2 green chile peppers, halved lengthwise ADVERTISEMENT",
            "1/2 mango, grated ADVERTISEMENT",
            "1/2 cup fresh grated coconut ADVERTISEMENT",
            "1 sprig fresh curry leaves ADVERTISEMENT",
            "1 pinch asafoetida powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chickpeas into a large container and cover with several inches of cool water; allow to soak for 8 hours or overnight. Drain.\nCombine the chickpeas and 3 cups water in a large pot over medium heat; cook until the chickpeas are tender, but not yet mushy, 30 to 45 minutes. Drain.\nHeat the oil in a skillet over medium heat. Fry the urad dal, mustard seeds, and dried red chile peppers in the hot oil. When the seeds begin to splutter, add the chickpeas, green chile peppers, mango, coconut, curry leaves, and asafoetida powder; season with salt. Mix well and cook until completely heated, 2 to 3 minutes. Remove from heat and add the lemon juice. Serve warm or at room temperature.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Rum-Flavored Black Beans and Rice",
        "ingredients": [
            "2 cups uncooked white rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 cup chopped carrot ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 large onion, chopped ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 cup dark rum ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.\nMeanwhile, heat the olive oil in a large skillet over medium heat. Stir in the carrots, celery, garlic, and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the black beans, salt, pepper, 1/4 cup of parsley, and dark rum. Continue cooking until heated through. Serve over a bed of rice and garnish with 1 teaspoon of parsley.\n",
        "picture_link": "qFF0r8bANwX7AgZx9.RGKtGqRWZl12W"
    },
    {
        "title": "Chicken, Pickles, and Potatoes",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "8 bone-in, skinless chicken thighs ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "6 potatoes, quartered ADVERTISEMENT",
            "2 cups petite pickles (such as Mt. Olive®), halved ADVERTISEMENT",
            "1 cup baby carrots, halved ADVERTISEMENT",
            "1 (6 ounce) can black olives with juice ADVERTISEMENT",
            "1 cup pickle juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the flour in a shallow dish and season lightly with salt, pepper, and garlic powder. Season the chicken thighs with salt and pepper, and dredge in the flour. Heat the olive oil in a large skillet over medium-high heat.Cook the chicken in the hot oil until golden, about 3 minutes. Flip chicken and brown on the other side, 3 additional minutes. Pour in the chicken broth.\nStir in the potatoes, pickles, carrots, black olives with juice, and pickle juice. Reduce heat to medium, cover, and cook until the potatoes are tender and the chicken thighs are no longer pink at the bone and the juices run clear, about 40 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "QQant/qpeP3WOwx53.ikPRYuaBUPvXq"
    },
    {
        "title": "Strawberry Cream Freeze",
        "ingredients": [
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1 cup cold milk ADVERTISEMENT",
            "1 (3.4 ounce) package JELL-O Vanilla Flavor Instant Pudding ADVERTISEMENT",
            "1 1/2 cups thawed COOL WHIP Whipped Topping ADVERTISEMENT",
            "20 NILLA Wafers, coarsely broken ADVERTISEMENT",
            "1 cup sliced fresh strawberries ADVERTISEMENT",
            "1/2 cup strawberry ice cream topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make the filling: Beat cream cheese in large bowl with mixer until creamy. Gradually beat in milk. Add dry pudding mix; beat 2 minutes. Stir in COOL WHIP, wafers and berries. Swirl in ice cream topping.\n",
        "picture_link": "RZxLS2U.qvSKJ9kUGK2gk9d/yX/k/gS"
    },
    {
        "title": "Thai Curry Pork Lettuce Wraps (Nam Prik Ong)",
        "ingredients": [
            "1/4 cup white rice ADVERTISEMENT",
            "2 pounds ground pork ADVERTISEMENT",
            "1 red onion, finely chopped ADVERTISEMENT",
            "2 tablespoons red curry paste (such as Mae Ploy) ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/4 cup water (optional) ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "12 leaves lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast the rice in a skillet over medium-high heat until lightly browned. Transfer the rice to a mortar and pestle or a food processor and grind into a coarse powder.\nCook pork in a skillet over medium-high heat for 4 minutes. Place the onions in the skillet with the pork and continue to cook and stir until the onions are translucent, about 4 minutes. Stir in the curry paste and cook until aromatic. Mix in the tomato paste and reduce the heat to a simmer. Pour in 1/4 cup water if the pork seems dry and begins to stick to the bottom of the pan. Add the roasted, ground rice and continue to simmer until the ground rice is tender, about 5 minutes. Stir in lime juice and fish sauce to taste. Serve pork in lettuce leaves.\n",
        "picture_link": "W5x2AvzblPqeyZT94rADmKzeoRX6xWm"
    },
    {
        "title": "Spicy Sesame Noodle Salad",
        "ingredients": [
            "3 1/2 ounces uncooked linguine pasta ADVERTISEMENT",
            "9 ounces fresh green beans, trimmed and cut on the diagonal ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "3 tablespoons canola oil ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon Asian (toasted) sesame oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "2 small serrano chile peppers, chopped ADVERTISEMENT",
            "2 cups carrots, cut into matchsticks ADVERTISEMENT",
            "1 cup thinly sliced green onions ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a saucepan with lightly salted water and bring to a rolling boil. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink, and rinse with cold water until the pasta is cool.\nBring a saucepan of lightly salted water to a boil, stir in the green beans, and cook, stirring occasionally, until the beans are bright green and slightly tender, 5 to 8 minutes. Drain the beans, and rinse with cold water to chill.\nIn a large salad bowl, combine lime juice, canola oil, soy sauce, brown sugar, sesame oil, garlic, orange zest, and serrano peppers, stirring until the sugar has dissolved. Allow the dressing to stand for 30 minutes. Lightly toss in the carrots, green onions, linguini and green beans, and season to taste with salt and pepper. Cover and chill before serving.\n",
        "picture_link": "RKTX014Vv5QdGZ2MFBvUVXsR4sqSByu"
    },
    {
        "title": "Stuffed Cranberry Apples",
        "ingredients": [
            "1/2 cup sour cream ADVERTISEMENT",
            "1/3 cup dried cranberries ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "1 (15 ounce) package ready-to-use refrigerated pie crust ADVERTISEMENT",
            "6 apples, cored ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nMix the sour cream, cranberries, brown sugar, and orange zest together and set aside. Slice each pie crust into three strips. Wrap each cored apple with one strip of pastry, covering the bottom of the apple, but leaving the top open. Fill each apple with the prepared filling. Place the wrapped and filled apples into a baking dish.\nBake the apples in the preheated oven until the pastry is evenly browned and the apples are tender, about 30 minutes. Let the apples stand at room temperature for 10 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Party Corned Beef Puffs",
        "ingredients": [
            "2 1/2 cups finely chopped deli corned beef ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1/4 teaspoon prepared horseradish ADVERTISEMENT",
            "1 cup beer ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the corned beef, onion, mustard, mayonnaise, and horseradish. Cover and refrigerate.\nPreheat an oven to 450 degrees F (230 degrees C).\nIn a large pot, bring beer and butter to a rolling boil. Stir in flour and salt until the mixture forms a ball. Transfer the dough to a large mixing bowl. Using a wooden spoon or stand mixer, beat in the eggs one at a time, mixing well after each. Drop by teaspoonfuls onto a lightly greased baking sheet.\nBake for 10 minutes in the preheated oven. Reduce temperature to 350 degrees F (175 degrees C) and bake an additional 10 minutes until golden brown. Centers should be dry.\nWhen the shells are cool, split the puffs and fill with the corned beef mixture. Refrigerate until ready to serve.\n",
        "picture_link": "RIAmFw8ySpH365AW.RKyIIed9gu8Itm"
    },
    {
        "title": "Hearty Sausage Soup II",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (1 pound) package smoked sausage, chopped ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "10 cups water ADVERTISEMENT",
            "3 cups chopped cabbage ADVERTISEMENT",
            "2 carrots, thinly sliced ADVERTISEMENT",
            "1 (15.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "4 beef bouillon cubes ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon dried thyme leaves ADVERTISEMENT",
            "1 dash cayenne pepper ADVERTISEMENT",
            "2 small zucchini, chopped ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (8 ounce) package thin egg noodles ADVERTISEMENT",
            "grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large stockpot over medium-high heat; cook the sausage, onions, bell pepper, and garlic in the hot oil until the onion is tender, 5 to 7 minutes. Add the water, cabbage, carrots, diced tomatoes, tomato paste, beef bouillon cubes, seasoned salt, thyme, and cayenne pepper to the stockpot and bring to a boil. Reduce heat to medium-low, place a cover on the stockpot, and cook the soup at a simmer for 45 minutes. Stir the zucchini and beans into the soup; cook another 10 minutes.\nBring a large pot with lightly salted water to a rolling boil. Cook the egg noodles in boiling water until cooked yet firm to the bite, about 5 minutes. Drain and stir into the soup. Ladle the soup into bowls, and top with Parmesan cheese to serve.\n",
        "picture_link": "W2uZyMJHI/.KtkF.6QQE5HRUlvUAjYC"
    },
    {
        "title": "Mexican Orange Chicken",
        "ingredients": [
            "8 chicken drumsticks ADVERTISEMENT",
            "8 chicken thighs ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 1/2 cups cubed cooked ham ADVERTISEMENT",
            "1 1/2 cups canned pineapple chunks ADVERTISEMENT",
            "1 (12 ounce) package bacon slices, cut into 2 inch pieces ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "8 cups freshly squeezed orange juice ADVERTISEMENT",
            "1/4 cup chicken bouillon granules ADVERTISEMENT",
            "1/4 cup butter, cut into small chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Grease a 9x12-inch baking dish with a cover.\nPlace the chicken drumsticks and thighs in the prepared baking dish, and sprinkle with salt and pepper. Evenly distribute the ham, pineapple chunks, bacon, and raisins over the chicken.\nStir together the orange juice and chicken bouillon granules in a bowl, and pour the mixture over the top of the dish. Dot the top evenly with chunks of butter.\nCover, and bake in the preheated oven until the chicken is very tender and the sauce has started to reduce, about 1 1/2 hours. Uncover, baste the chicken pieces with the juices in the bottom of the pan, and return to the oven until the chicken is golden, about 30 more minutes.\n",
        "picture_link": "MF9cZdZjTOnw9a2tw3q8woGfU86EkHG"
    },
    {
        "title": "Empanada Filling",
        "ingredients": [
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "12 pitted kalamata olives, diced ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "3 hard-cooked eggs, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir flour into water in a small bowl until dissolved.\nHeat oil in a large skillet over medium heat and saute onion in oil until softened, about 5 minutes; add ground beef, olives, cumin, and paprika. Cook and stir the beef mixture until the beef is completely browned, 7 to 10 minutes.\nPour flour-water mixture into the beef and stir to coat evenly. Add raisins, stir, and cook until the raisins are plump, about 5 minutes. Fold eggs into the beef mixture; season with salt and pepper. Set aside to cool before using to fill empanadas.\n",
        "picture_link": "0ASx5t5hOB7eImp61OTCwDZv6J9Gnc6"
    },
    {
        "title": "Pizzagna",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "4 cups prepared marinara sauce ADVERTISEMENT",
            "1 pound bulk Italian sausage ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "3 cups cottage cheese ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/3 cup Parmesan cheese ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "1 (8 ounce) package no-boil lasagna noodles, or more if needed ADVERTISEMENT",
            "1/2 cup mini pepperoni pieces, or more to taste ADVERTISEMENT",
            "1/2 cup sliced mushrooms, or to taste (optional) ADVERTISEMENT",
            "1/4 cup sliced black olives, or to taste (optional) ADVERTISEMENT",
            "3 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nHeat spaghetti sauce in a saucepan over medium heat.\nCook and stir sausage and water in a large skillet over medium heat, using a potato masher to break sausage into small pieces, until sausage is crumbly and almost cooked through, about 5 minutes. Add pepper and onion; cook and stir until onion is tender, 5 to 10 minutes.\nStir cottage cheese, eggs, Parmesan cheese, and parsley together in a bowl.\nSpread about 1 cup warmed spaghetti sauce into the bottom of the prepared baking dish. Arrange 3 lasagna noodles over the sauce. Spread 1/2 of the cottage cheese mixture over the noodles, another 1 cup spaghetti sauce over the cheese, and 2/3 cup sausage mixture over the top. Sprinkle 1/2 of the pepperoni pieces, 1/2 of the sliced mushrooms, and 1/2 of the olives over the sausage mixture. Scatter 1/3 the mozzarella cheese over the top and arrange 3 lasagna noodles atop the cheese. Repeat layering again.\nPour remaining spaghetti sauce over the lasagna and sprinkle remaining mozzarella cheese over the top. Cover baking dish with aluminum foil.\nBake in the preheated oven until sauce is bubbling around the edges, about 25 minutes. Remove aluminum foil and continue baking until cheese is melted and golden, about 5 minutes more. Cool for 15 minutes before slicing.\n",
        "picture_link": "Y2UdHay44loZFlIc5w7XTWV/2QLd2b6"
    },
    {
        "title": "Char Siu Chicken",
        "ingredients": [
            "1 cup brown sugar ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons hoisin sauce ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon sriracha sauce ADVERTISEMENT",
            "1 tablespoon sherry ADVERTISEMENT",
            "1 tablespoon red food coloring (optional) ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1/2 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "1/8 teaspoon liquid smoke flavoring (optional) ADVERTISEMENT",
            "12 skinless, boneless chicken thighs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk brown sugar, soy sauce, hoisin sauce, honey, garlic, sriracha sauce, sherry, food coloring, sesame oil, Chinese five-spice powder, and liquid smoke together in a bowl; pour into a resealable plastic bag. Add chicken thighs, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 24 to 48 hours.\nPreheat oven to 350 degrees F (175 degrees C). Line a roasting pan with aluminum foil and place a roasting rack in the bottom of the pan.\nRemove chicken from marinade and place on the rack in the prepared roasting pan.\nPour marinade into a saucepan; bring to a boil, reduce heat to low, and simmer for 3 to 5 minutes. Remove from heat.\nBake chicken in the preheated oven, turning once and basting occasionally with marinade, until the juices run clear, about 1 hour. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "0iP5GyU20PKG9RnngdU/FlvrbRUnP9i"
    },
    {
        "title": "Strawberry Waffles",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "1/2 cup vanilla Greek-style yogurt ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "3/4 cup chopped strawberries, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat and grease a waffle iron according to manufacturer's instructions.\nSift flour, baking powder, and salt together in a bowl. Whisk buttermilk, yogurt, butter, eggs, and sugar together in a separate bowl; stir into flour mixture until batter is smooth. Fold strawberries into batter.\nPour about 1/3 cup batter into preheated waffle iron; cook until lightly browned, 5 to 7 minutes. Repeat with remaining batter.\n",
        "picture_link": "vRGc0PnO3f5IUq018/eziU46Re9yKdG"
    },
    {
        "title": "Stuffed Italian Meatloaf",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 cup pasta sauce ADVERTISEMENT",
            "1/2 cup Italian-style bread crumbs, or more as needed ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 large cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nThoroughly mix beef, pasta sauce, bread crumbs, onion, ketchup, egg, garlic, oregano, salt, and ground black pepper together using your hands in a large bowl.\nSpread 1/2 the meat mixture into the bottom of a loaf pan. Spread mozzarella cheese over the center of the meat. Spread remaining meat mixture over the cheese, pressing edges of meat together on the sides to seal in the cheese.\nBake in the preheated oven until meat is no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "pYsKM3pYev/cWXbfnYxt0XjnLw1kjWu"
    },
    {
        "title": "Layered Meatball Bake",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 (16 ounce) package chicken-flavored stuffing mix (such as StoveTop® Stuffing Mix for Chicken) ADVERTISEMENT",
            "1 (10.75 ounce) can reduced-fat, reduced-sodium condensed cream of mushroom soup ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 (1 pound) package frozen turkey meatballs ADVERTISEMENT",
            "2 cups frozen peas ADVERTISEMENT",
            "1 cup shredded 2% milk cheddar cheese (such as Kraft®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCombine water and margarine in a saucepan; bring to a boil. Stir stuffing mix into margarine mixture. Cover saucepan and remove from heat. Let stand for 5 minutes; fluff stuffing with a fork.\nStir cream of mushroom soup and milk together in a 9x13-inch baking dish; fold in meatballs and peas. Sprinkle Cheddar cheese over meatball mixture. Layer stuffing over cheese layer.\nBake in the preheated oven until cooked through and cheese is melted, 20 to 25 minutes.\n",
        "picture_link": "VIoL3X2KfbmpuG.Ai1kVOkvTeQ0.I5W"
    },
    {
        "title": "Papa a la Huancaina (Huancayo-Style Potatoes)",
        "ingredients": [
            "12 Yukon Gold potatoes ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "6 chile peppers, halved lengthwise and seeded ADVERTISEMENT",
            "1 pound cream cheese, softened ADVERTISEMENT",
            "1 pound queso fresco (Mexican fresh cheese), crumbled ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/3 cup evaporated milk ADVERTISEMENT",
            "4 hard-boiled eggs, halved lengthwise ADVERTISEMENT",
            "8 leaves lettuce ADVERTISEMENT",
            "8 black olives, pitted and halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and set aside to cool slightly.\nHeat olive oil in a skillet over medium heat. Cook onion until tender, about 10 minutes.\nBring a small saucepan of water to a boil. Boil chile peppers until soft, about 5 minutes. Run chiles under cold water to cool until cool enough to handle; remove and discard skins.\nBlend onion, chile peppers, cheese, vegetable oil, garlic, salt, and pepper in a blender until smooth. Stream evaporated milk into the blended mixture while continuing to blend until a creamy sauce is achieved.\nArrange 1 lettuce leaf onto each of 8 plates. Halve potatoes and arrange 3 halves onto each lettuce leaf. Drizzle creamy sauce over the potatoes. Top each with an egg half and two black olive halves.\n",
        "picture_link": "NhgrhWtHUxju3qSbqFa0oRkd02c7weC"
    },
    {
        "title": "Indian-Inspired Cauliflower and Potato Casserole",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 head cauliflower, cut into florets ADVERTISEMENT",
            "2 russet potatoes, peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1/2 cup unsweetened coconut milk ADVERTISEMENT",
            "1 jalapeno pepper, diced (optional) ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "1/4 cup sliced almonds ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nCombine cauliflower, potatoes, and water in a large microwave-safe bowl. Cover and cook in microwave on high for 4 minutes. Drain well.\nStir cream of chicken soup, mayonnaise, coconut milk, jalapeno pepper, and curry powder together in a bowl; season with salt and pepper. Add drained cauliflower and potatoes to cream of chicken soup mixture; mix well and pour into prepared baking dish. Sprinkle bread crumbs and almonds over vegetables and drizzle with butter.\nBake in the preheated oven until bubbly and lightly browned, about 50 minutes. Allow casserole to rest for 10 minutes before serving.\n",
        "picture_link": "FuKlZh1/A.gutoUIZsIfNRXsvDqn1jy"
    },
    {
        "title": "Cumin-Spiced Red Lentil Burgers",
        "ingredients": [
            "3/4 cup red lentils ADVERTISEMENT",
            "olive oil cooking spray ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "3 carrots, finely chopped ADVERTISEMENT",
            "1 orange bell pepper, finely chopped ADVERTISEMENT",
            "2 stalks celery, finely chopped ADVERTISEMENT",
            "3 cloves garlic, pressed and divided ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "3/4 cup gluten-free bread crumbs ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1/4 cup chopped fresh parsley, divided ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, divided ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup plain Greek yogurt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "8 leaves Bibb lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour lentils into a large saucepan with cold water to cover by 2 inches. Bring water to a boil, reduce heat to medium, and simmer until lentils are tender, about 10 minutes; drain.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper. Coat paper with a layer of cooking spray.\nHeat olive oil in a skillet over medium-high heat. Saute onion in hot oil until golden, about 6 minutes; add carrots, bell pepper, celery, and about 2/3 of the garlic. Continue to saute the mixture until the carrots begin to soften, 5 to 7 minutes. Season mixture with cumin and cayenne pepper; remove skillet from heat.\nStir lentils, bread crumbs, eggs, 3 tablespoons parsley, 3 tablespoons cilantro, salt, and pepper into the vegetable mixture; shape into patties and arrange onto the prepared baking sheet.\nBake patties in preheated oven for 15 minutes, flip, and continue baking until brown and crispy, 10 to 15 minutes more.\nWhisk yogurt, lemon juice, and the remaining parsley and cilantro together in a small bowl.\nPut each burger into a lettuce leaf and top with a dollop of yogurt sauce.\n",
        "picture_link": "kLt928k9wtKaED5Hpl1MalQO1IfVBSa"
    },
    {
        "title": "Braised Cabernet Beef Short Ribs",
        "ingredients": [
            "2 pounds beef short ribs, or more to taste ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 cloves garlic cloves, minced and divided ADVERTISEMENT",
            "3 cups beef broth ADVERTISEMENT",
            "1 cup Cabernet Sauvignon wine ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season ribs with salt, garlic powder, and black pepper. Sprinkle flour over both sides of the ribs.\nHeat oil in a large pot over medium-high heat. Cook about half the garlic in the hot oil until golden brown, 2 to 3 minutes; add short ribs and cook until completely browned, 2 to 3 minutes per side.\nPour beef broth and wine into the pot; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Transfer ribs and liquid to the crock of your slow cooker; put remaining garlic and sliced onion atop the ribs.\nCook on Low for 5 hours. Remove ribs to a wide and shallow serving bowl. Ladle liquid from crock into a large skillet.\nBring the liquid in a skillet to a boil and cook until reduced in volume by half, 5 to 7 minutes. Pour sauce over the ribs and turn ribs to coat.\n",
        "picture_link": "OzfvbQlRjz1ms/XGandwLXBBRrMlmoW"
    },
    {
        "title": "Vegan Japanese Winter Squash and Leek Soup",
        "ingredients": [
            "1 (2 pound) Japanese winter squash (kabocha), halved and seeded ADVERTISEMENT",
            "3 tablespoons canola oil, or more as needed ADVERTISEMENT",
            "1 large sweet onion, chopped ADVERTISEMENT",
            "3 large leeks - white part cut horizontally and green parts cut lengthwise ADVERTISEMENT",
            "2 cups water, or more as needed ADVERTISEMENT",
            "3 small russet potatoes, chopped ADVERTISEMENT",
            "3 large carrots, cut into rounds ADVERTISEMENT",
            "4 cups vegetable stock, or more if needed ADVERTISEMENT",
            "1 pinch garlic salt, or more to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Arrange squash, cut-side up, on a baking sheet.\nBake in the preheated oven until squash is tender, 30 to 40 minutes; cool slightly. Remove skin from squash and chop the flesh.\nHeat canola oil in a large pot over medium heat; cook and stir onion and white parts of leek until golden brown, 10 to 15 minutes.\nMix water, green parts of leeks, potatoes, baked squash, and carrots to onion mixture; bring to a boil. Reduce heat, cover pot, and simmer, stirring every 10 minutes and adding more water as needed, until vegetables are tender, about 1 hour.\nPour vegetable stock into vegetable mixture; season with garlic salt and pepper. Raise temperature to medium and cook until boiling, 15 to 20 minutes.\n",
        "picture_link": "Lf2wTkszzS9Vscd4rg.W5aOZaaMPxFe"
    },
    {
        "title": "Red Lentil Burgers",
        "ingredients": [
            "1 1/2 cups hot water ADVERTISEMENT",
            "1 cup red lentils ADVERTISEMENT",
            "1 large onion, minced ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon spicy Dijon mustard, or more to taste ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "2 tablespoons all-purpose flour, or as needed ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and lentils in a saucepan; bring to a boil and cook until the water is completely absorbed and the lentils tender yet holding form, 15 to 20 minutes. Transfer lentils to a large bowl and let cool.\nStir onion, cilantro, garlic, mustard, cumin, parsley, garlic powder, and red pepper flakes into the lentils; add flour as needed to help absorb excess moisture and bind ingredients together. Shape lentil mixture into 4 patties.\nPrepare a large skillet with cooking spray and heat over medium heat.\nCook burgers in the hot skillet until firm and hot in the center, 4 to 7 minutes per side.\n",
        "picture_link": "ZnlXd6.g4x1zN4aQMHpbJyEw10iy5ra"
    },
    {
        "title": "Mediterranean Lentil Patties",
        "ingredients": [
            "Patties: ADVERTISEMENT",
            "2 cups dry lentils ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "8 cups cooked brown rice ADVERTISEMENT",
            "1 cup tahini ADVERTISEMENT",
            "1 cup Dijon mustard ADVERTISEMENT",
            "1/2 bunch parsley, chopped ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 cups fine bread crumbs ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "1 cup tahini ADVERTISEMENT",
            "1 cup water, or to taste ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put lentils in a large pot with enough water to cover by 2 inches; bring to a boil and cook until tender, about 20 minutes. Transfer lentils to a large bowl.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Saute onion, bell pepper, and celery in hot oil until onion is slightly browned, 5 to 7 minutes; add to lentils and stir.\nStir rice, 1 cup tahini, mustard, lemon juice, parsley, and lemon juice into the lentil mixture; shape into patties.\nSpread bread crumbs into a wide, shallow bowl. Press patties into the bread crumbs to coat.\nHeat 1/4 cup olive oil in a saucepan over medium-high heat. saute garlic in olive oil until fragrant, 1 to 2 minutes. Stir cumin into the oil and remove pan from heat; add water, 1 cup tahini, and lemon juice and stir until smooth. Season sauce with salt.\nHeat a large skillet over medium heat. Cook patties in hot skillet until beginning to crisp, 7 to 10 minutes per side. Drizzle sauce over patties to serve.\n",
        "picture_link": "xMk6c3tiZ1NOUWoJrM7DbBlKQkPTto2"
    },
    {
        "title": "Grandma Nickie's Deep Fried Cauliflower",
        "ingredients": [
            "3 cups oil for frying, or as needed ADVERTISEMENT",
            "1 head cauliflower, broken into florets ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat frying oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nToss cauliflower florets with salt in a bowl. Stir egg and vegetable oil together in a bowl; whisk flour and milk into egg mixture until batter is smooth. Working in batches, drop several pieces of cauliflower into batter and stir to coat.\nWorking in batches, fry battered cauliflower pieces in preheated oil until they rise to the top of the oil and float, 2 to 4 minutes. Carefully turn pieces over and continue frying until golden brown, about 2 minutes more.\n",
        "picture_link": "9FT96rtjGZUerMZmeB9IVOt8vAViJei"
    },
    {
        "title": "Butter Cream Easter Egg Candies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 (16 ounce) packages confectioners' sugar ADVERTISEMENT",
            "1 (12 ounce) bag semisweet chocolate chips ADVERTISEMENT",
            "2 tablespoons pastel multi-colored candy sprinkles, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter in a bowl using an electric mixer until smooth and creamy. Mix cream cheese and vanilla into creamed butter until smooth; stir in confectioners' sugar until incorporated. Cover bowl with plastic wrap and refrigerate until mixture is firm, about 2 hours.\nRoll sugar mixture into small egg-shapes; arrange on a baking sheet. Refrigerate until firm, about 2 hours more.\nLine a baking sheet with waxed paper.\nMelt chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Dip eggs into melted chocolate using a fork or wooden skewer until evenly coated.\nArrange dipped eggs on the prepared baking sheet; garnish with sprinkles. Allow chocolate to harden, about 30 minutes. Place eggs in paper muffin or candy cups and store in refrigerator.\n",
        "picture_link": "QZ1H5gf/I0MN7TifpQ3ulC9W0tuc36G"
    },
    {
        "title": "Spicy Pepper and Onion",
        "ingredients": [
            "2 tablespoons olive oil, or to taste ADVERTISEMENT",
            "1 red bell pepper, seeded and thinly sliced ADVERTISEMENT",
            "1 sweet onion (such as Vidalia®), thinly sliced ADVERTISEMENT",
            "1 (8 ounce) package assorted sliced mushrooms, or to taste ADVERTISEMENT",
            "3 cloves garlic, smashed and chopped ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "2 teaspoons ground turmeric ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "3 pinches cayenne pepper ADVERTISEMENT",
            "2 tablespoons water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Saute bell pepper and sweet onion in hot oil until softened, 5 to 7 minutes. Stir mushrooms and garlic into the pepper mixture; cook until garlic is fragrant, about 1 minute.\nStir Worcestershire sauce, parsley, ketchup, basil, turmeric, red pepper flakes, cumin, and cayenne pepper into the pepper mixture. Place cover on the skillet, reduce heat to medium-low, and simmer until mixture thickens, 20 to 30 minutes. If mixture is too dry, add water and stir.\n",
        "picture_link": "CyOyWRcHR8WJ2o6tNRuxShv50wFD6fy"
    },
    {
        "title": "'Meat's Too Expensive!' Vegetarian Burgers",
        "ingredients": [
            "water to cover ADVERTISEMENT",
            "1 cup dried lentils ADVERTISEMENT",
            "1/2 cup wheat germ ADVERTISEMENT",
            "1 small onion, finely diced ADVERTISEMENT",
            "1/2 cup finely chopped green bell pepper ADVERTISEMENT",
            "1/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon finely chopped green chile pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup vegetable oil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour enough water into a pot that will cover lentils and wheat germ; bring to a boil. Add lentils and wheat germ, reduce heat, and simmer until lentils are tender, adding more water if needed, 20 to 25 minutes. Remove pot from heat and cool slightly; mash lentil mixture until thick and lumpy.\nTransfer mashed lentil mixture to a bowl. Mix onion, green bell pepper, mozzarella cheese, egg, green chile pepper, garlic, salt, and pepper into lentil mixture until thoroughly mixed; shape into 8 patties.\nHeat about 2 tablespoons vegetable oil in a large skillet over high heat. Lower heat to medium-high and cook 4 patties in the hot oil until golden brown, about 3 minutes per side. Repeat with remaining oil and patties.\n",
        "picture_link": "mpprJ6khPNK9u3tMLSzwKpdTsHFrFya"
    },
    {
        "title": "Slow Cooker Black-Eyed Pea and Sausage Soup",
        "ingredients": [
            "10 cups water ADVERTISEMENT",
            "1 (1 pound) package smoked sausage, sliced ADVERTISEMENT",
            "1 1/2 cups chopped carrot ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "5 cubes chicken bouillon ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 pound dried black-eyed peas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 10 cups water into a 5-quart slow cooker crock; add sausage, carrot, celery, onion, chicken bouillon, bay leaves, garlic powder, and oregano.\nPour black-eyed peas into a saucepan; add enough water to cover by a few inches. Bring water to a boil, remove saucepan from heat, drain the peas, and add them to the slow cooker.\nCook on Low for 8 hours. Remove and discard bay leaves before serving.\n",
        "picture_link": "9N5gtDl2cOwXrnw8Ob4awlSfrwxziUy"
    },
    {
        "title": "Good, Bad, and Yummy Pancakes",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk all-purpose flour, whole wheat flour, white sugar, baking powder, salt, and cinnamon together in a large bowl. Make a well in the center of the dry ingredients.\nPour milk and vanilla extract into the well; add beaten eggs. Mix wet and dry ingredients together until smooth.\nGrease a skillet with oil and heat over medium heat.\nPour 1/4 cup of batter per pancake into the hot skillet; cook until bottom is golden brown and there are many small pinholes in the top of the pancake, about 2 minutes. Flip pancake and continue cooking until golden brown and the middle of the pancake is set, 2 to 3 minutes. Repeat with remaining batter, greasing skillet with oil between pancakes as needed.\n",
        "picture_link": "9VXUxMsNRSkhwIYEZpDkSHf0XQs1Zf."
    },
    {
        "title": "Fragola Pazzo (Crazy Strawberry)",
        "ingredients": [
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "2 pints fresh strawberries, hulled and quartered ADVERTISEMENT",
            "1 (1 ounce) square unsweetened chocolate, grated, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix balsamic vinegar, sugar, and black pepper together in a bowl. Add strawberries and stir to coat; marinate in refrigerator until chilled, about 10 minutes. Grate chocolate over top as a garnish.\n",
        "picture_link": "IGfLFVPgSIXVdQE1JFWCcyMwTyT2R8C"
    },
    {
        "title": "Wild Rice Patties",
        "ingredients": [
            "2 cups cooked wild rice ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 teaspoons tapioca ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons vegetable oil, or more if needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir rice, eggs, tapioca, green onion, and salt together in a bowl.\nHeat oil in a skillet over medium high heat.\nSpoon about 1/3 cup of the rice mixture into hot oil; fry until well-browned, 3 to 4 minutes per side. Remove to a plate lined with paper towels to drain. Repeat until all batter is used.\n",
        "picture_link": "DsLMvtjnInFqJxkdwjPk9dVLQ7Y2hT6"
    },
    {
        "title": "Quinoa Crepes",
        "ingredients": [
            "1 cup quinoa flour ADVERTISEMENT",
            "1 cup almond milk ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk quinoa flour, almond milk, eggs, honey, and sea salt together in a bowl until batter is smooth. Stir butter into batter.\nHeat a lightly greased a skillet or griddle over medium-low heat. Pour 1/4 cup batter into the skillet and immediately rotate the skillet until the batter evenly coats the bottom in a thin layer. Cook until the top of the crepe is no longer wet and the bottom has turned light brown, about 2 minutes. Run a spatula around the edge of the skillet to loosen; flip crepe and cook until the other side has turned light brown, about 30 seconds. Repeat with remaining batter.\n",
        "picture_link": "xBjzZJLM7/AtYXvFAkAcXJvFu1swm/m"
    },
    {
        "title": "Caramelized Corned Beef",
        "ingredients": [
            "1 (3 pound) flat-cut corned beef ADVERTISEMENT",
            "1 (32 ounce) carton beef stock ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "5 large red potatoes, quartered ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 small head red cabbage, cut into 2-inch wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place corned beef in a slow cooker. Pour beef stock over corned beef and add enough water to raise liquid to within 2 inches of top.\nCook on Low for 5 hours 15 minutes to 7 hours 15 minutes. Add potatoes to slow cooker and cook for 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C) and set rack to center. Grease a roasting pan.\nRemove corned beef from slow cooker and blot dry with a paper towel. Strain potatoes from slow cooker using a slotted spoon, reserving liquid in slow cooker. Place corned beef, fat-side up, and potatoes, cut-side up, in the roasting pan; generously brush with olive oil.\nCook in the preheated oven until outside of corned beef is caramelized and browned, 45 to 60 minutes.\nPlace cabbage in the slow cooker; cook on Low until tender, 15 to 20 minutes.\nSlice corned beef and serve in roasting pan with potatoes. Strain cabbage and serve on the side.\n",
        "picture_link": "uGnZiue18SPKlDdOVKH6Ne62aki068W"
    },
    {
        "title": "Lemon Blueberry Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 (16.25 ounce) package white cake mix ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons lemon extract ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 cup cold heavy whipping cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/3 cup blueberry pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 8-inch pans.\nBeat cake mix, water, egg whites, vegetable oil, and lemon extract together in a bowl using an electric mixer on medium speed until batter is well combined, about 2 minutes. Pour batter into prepared pans.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 25 to 30 minutes. Cool in pans for 10 minutes before transferring it to a wire rack to cool completely.\nBeat cream in a chilled bowl using an electric mixer until soft peaks are almost forming into stiff peaks; place bowl in refrigerator.\nBeat cream cheese, sugar, and vanilla extract together in a separate bowl using an electric mixer until smooth and creamy. Fold whipped cream into cream cheese mixture.\nPlace 1 cake on a plate; top with blueberry pie filling. Place second cake atop blueberry filling. Generously frost cake with whipped cream cheese frosting.\n",
        "picture_link": "xUAXeeqmfEx8g36e0AfnTeXzkkqzAuq"
    },
    {
        "title": "Roasted Cauliflower with Dates and Pine Nuts",
        "ingredients": [
            "1 head cauliflower, cut into florets ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup unsalted butter ADVERTISEMENT",
            "1/3 cup pine nuts ADVERTISEMENT",
            "1/2 cup coarsely chopped Medjool dates ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nSpread cauliflower florets onto a baking sheet; season with salt and pepper.\nBake in the preheated oven for 10 minutes. Stir cauliflower and continue baking until golden brown around the edges, about 20 more minutes.\nHeat butter in a small skillet over medium-low heat; cook and stir pine nuts until golden brown, about 5 minutes. Add dates and garlic to pine nuts; cook until dates are softened, 2 to 3 minutes. Season with salt.\nTransfer hot cauliflower to a serving bowl. Drizzle pine nut mixture over cauliflower and toss to coat. Serve warm or at room temperature.\n",
        "picture_link": "jczLFOwKMC5a7X36SYrSxrf1Sruhz6e"
    },
    {
        "title": "Diced Sweet Potatoes with Onions and Garlic",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 large sweet potatoes, peeled and cut in 1-inch cubes ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "2 pinches ground black pepper ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat the inside of a glass or non-stick baking dish with olive oil.\nPlace sweet potatoes into the prepared baking dish and turn to evenly coat with the olive oil in the baking dish. Season sweet potatoes with salt and pepper. Add onion and garlic to sweet potato mixture.\nBake in the preheated oven until sweet potatoes are tender, about 1 hour.\n",
        "picture_link": "l9UJz6IvY2wGX0GWSTZb77w3C3JzgtK"
    },
    {
        "title": "Bacon-Bleu Cheese Ball",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (3 ounce) package bacon bits (such as Oscar Mayer®) ADVERTISEMENT",
            "3 ounces crumbled blue cheese ADVERTISEMENT",
            "1/4 cup blue cheese salad dressing, or to taste ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 cup dried parsley, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cream cheese, bacon bits, blue cheese, salad dressing, green onions, and garlic powder together in a bowl. Form mixture into 2 balls, cover each with plastic wrap, and refrigerate until chilled and firm, 3 hours or overnight.\nRemove cheese balls from plastic wrap and roll in parsley.\n",
        "picture_link": "OF1NZ6qM/Kmu5W7TqXrsO.Qf0DdfMCG"
    },
    {
        "title": "Pistachio Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 (15.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup club soda ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "1 (1.3 ounce) envelope dry whipped topping mix (such as Dream Whip®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a fluted tube pan (such as Bundt(R)).\nBeat cake mix, vegetable oil, club soda, eggs, and 1 package pistachio pudding mix together in a bowl until blended; pour into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the cake comes out clean, 30 to 40 minutes. Turn cake onto a cooling rack and cool completely.\nBeat milk, 1 package pistachio pudding mix, and whipped topping mix together in a bowl using an electric mixer on high until frosting forms stiff peaks. Spread frosting on cake.\n",
        "picture_link": "O2mxfcfB.Cuwwu5a3g0PROGdydfYm6a"
    },
    {
        "title": "Scrambled Eggs and Shrimp",
        "ingredients": [
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "10 cooked large shrimp ADVERTISEMENT",
            "1/4 cup cocktail sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat; saute onion until translucent, 5 to 10 minutes. Add eggs to onion and season with salt. Cook and stir until eggs are set, about 5 minutes. Stir shrimp and cocktail sauce into eggs; cook until warm, 3 to 4 minutes.\n",
        "picture_link": "gwpAQqnVZSoCVVWHmrmfTJqE7.7SpD6"
    },
    {
        "title": "Mediterranean Pesto Pizza",
        "ingredients": [
            "2 tablespoons prepared pesto ADVERTISEMENT",
            "2 (6 inch) Greek pita flatbreads ADVERTISEMENT",
            "1/2 cup feta cheese ADVERTISEMENT",
            "2 small tomatoes, chopped ADVERTISEMENT",
            "8 pitted Kalamata olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread pesto onto each pita; top with feta cheese, tomatoes, and Kalamata olives. Place each pita onto a baking sheet.\nBake in the preheated oven until cheese is melted, 6 to 8 minutes.\n",
        "picture_link": "FpsfBc4EUuqUjienMiMfCxpbnViboYS"
    },
    {
        "title": "Waffle Sandwich with Cheese, Spinach and Spicy Mustard",
        "ingredients": [
            "1 roma (plum) tomato, thinly sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 teaspoons butter, softened ADVERTISEMENT",
            "4 thickly-sliced pieces multigrain bread ADVERTISEMENT",
            "1 teaspoon spicy brown mustard ADVERTISEMENT",
            "1 cup fresh spinach, or to taste ADVERTISEMENT",
            "4 slices part-skim mozzarella cheese ADVERTISEMENT",
            "2 teaspoons chopped sweet onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions.\nArrange tomato slices on a work surface, pouring off any excess juice. Season tomato slices with salt and pepper.\nSpread 1/2 teaspoon butter onto 1 side of each bread slice. Lay 1 bread slice, butter-side down, in the hot waffle iron. Spread 1/2 teaspoon mustard onto bread slice in waffle iron; top with 1/4 cup spinach, 2 slices mozzarella cheese, 1 teaspoon onion, half the tomato slices, and 1/4 cup spinach, respectively. Lay 1 slice bread, butter-side up, atop the spinach layer.\nClose waffle iron and toast sandwich until lightly browned, about 2 minutes. Repeat with remaining ingredients.\n",
        "picture_link": "nHri3OANif2YT5hyvRR.l57ZZXvajNC"
    },
    {
        "title": "Curried Coconut Egg Drop Soup",
        "ingredients": [
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1/8 teaspoon curry powder ADVERTISEMENT",
            "1/8 teaspoon chili powder ADVERTISEMENT",
            "1 pinch ground ginger ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken broth, coconut milk, green onion, cilantro, curry powder, chili powder, and ground ginger to a boil in a saucepan; lower heat and simmer.\nSlowly drizzle beaten egg in thin ribbons into soup using a fork, whisking until egg is cooked, 2 to 3 minutes.\n",
        "picture_link": "fZzsQq6bnO4tFSWC1oy38ZTRYjzE1E."
    },
    {
        "title": "Tuna Stuffed Deviled Eggs",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1 (4.5 ounce) can tuna, drained and flaked ADVERTISEMENT",
            "2 teaspoons sweet pickle relish, drained ADVERTISEMENT",
            "1 teaspoon mustard ADVERTISEMENT",
            "1/4 teaspoon white sugar (optional) ADVERTISEMENT",
            "1/8 teaspoon onion powder ADVERTISEMENT",
            "2 1/2 tablespoons mayonnaise, or as needed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pinch paprika, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan; cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nCut eggs in half lengthwise; place yolks in a small bowl. Mash egg yolks with a fork; stir in tuna, pickle relish, mustard, sugar, and onion powder. Stir mayonnaise into tuna mixture until mixture is creamy but remains firm; season with salt and pepper.\nPlace egg whites cut-side-up on a serving platter. Spoon tuna mixture into egg white halves; sprinkle with paprika.\n",
        "picture_link": "yoQZqpBnktkdnv6Xoq/Rn7tAvbKMRGy"
    },
    {
        "title": "Salt and Vinegar Potato Chips",
        "ingredients": [
            "4 potatoes, thinly sliced ADVERTISEMENT",
            "cold water to cover ADVERTISEMENT",
            "3 cups white vinegar ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put potato slices in a large bowl. Pour enough cold water over the potatoes to cover completely. Soak potatoes, gently agitating every 10 minutes, for 30 minutes; drain.\nSpread potatoes slices onto paper towel; pat dry with more paper towels.\nMix vinegar and 1 cup cold water in the large bowl; add potatoes. Cover bowl with plastic wrap and refrigerate for 30 minutes, stir gently, and continue chilling at least 30 minutes more.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nWorking in batches, use a slotted spoon to remove potato slices from vinegar mixture and gently add to the hot oil. Fry potatoes until golden brown, 5 to 7 minutes per batch. Remove chips to a bowl lined with paper towel to drain.\nUse the paper towel to lift chips from the bowl and put them into a separate bowl; season with salt. Spread the salted chips onto paper towel to further dry and cool completely.\n",
        "picture_link": "JtOslAYStmTWq1QtB.4HtcwNTNUcDIm"
    },
    {
        "title": "Shrimp Crepes",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "Crepes: ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 pounds shrimp, peeled and deveined ADVERTISEMENT",
            "8 ounces lobster meat (optional) ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 9x12-inch baking dish with cooking spray.\nBeat 1 1/2 cups milk and eggs together in a large bowl using an electric mixer until frothy, about 2 minutes. Add 1 1/4 cups flour and 1/4 teaspoon salt to milk mixture; beat until incorporated, about 2 more minutes.\nHeat a non-stick skillet over medium heat. Pour 1/4 cup batter into the skillet and immediately rotate the skillet until the batter evenly coats the bottom in a thin layer. Cook until the top of the crepe is no longer wet and the bottom has turned light brown, about 4 minutes. Run a spatula around the edge of the skillet to loosen; flip crepe and cook until the other side has turned light brown, about 2 more minutes.\nWhisk water, 1/4 cup flour, 1/4 teaspoon salt together in a bowl.\nPlace butter and garlic in a non-stick skillet over low heat. Cover skillet and cook until garlic is golden brown, about 7 minutes. Add shrimp and lobster meat; stir, cover skillet, and cook until shrimp are bright pink and cooked through, about 5 minutes. Add lemon juice and cayenne pepper; stir, cover skillet, and cook for 5 more minutes.\nWhisk water-flour mixture and stir into shrimp mixture. Sprinkle Parmesan cheese over shrimp mixture; cook and stir over medium heat until thickened, about 1 minute. Remove skillet from heat and spoon shrimp filling onto each crepe. Roll each crepe around filling and place in the prepared baking dish.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine 1 cup milk, mayonnaise, and 1 tablespoon flour in a small saucepan; cook and stir over medium heat until bubbling, 2 to 3 minutes. Drizzle sauce over filled crepes.\nBake in the preheated oven until crepes are cooked through and sauce is bubbling, 25 to 30 minutes.\n",
        "picture_link": "as2cHYI.TR.BwMJ1AhTAIA2TJOcSOKy"
    },
    {
        "title": "Alexa's Gourmet Grilled Cheese",
        "ingredients": [
            "4 slices marbled rye bread, divided ADVERTISEMENT",
            "4 teaspoons softened salted butter, or as needed, divided ADVERTISEMENT",
            "2 teaspoons Dijon mustard, or to taste ADVERTISEMENT",
            "4 slices shredded sharp Cheddar cheese ADVERTISEMENT",
            "4 slices Swiss cheese (such as Lorraine®) ADVERTISEMENT",
            "1 tomato, thinly sliced ADVERTISEMENT",
            "1 avocado - peeled, pitted, and thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a cast-iron skillet or non-stick pan over high heat until skillet is warm; reduce heat to medium.\nArrange 2 bread slices in the hot skillet. Add 1 teaspoon butter under each slice in the skillet; flip bread so butter-side is face-up. Spread about 1 teaspoon mustard onto each bread slice; top with 1 slice Cheddar cheese, 1 slice Swiss cheese, tomato slices, and avocado slices. Top each avocado layer with 1 slice Cheddar cheese, 1 slice Swiss cheese, and 1 slice bread. Spread butter onto top piece of bread; flip sandwich and cook until cheeses are slightly melted, 2 to 3 minutes.\nTransfer sandwiches to a microwave-safe plate and heat in microwave until cheeses are fully melted, no longer than 30 seconds.\n",
        "picture_link": "/Nt2o6SiJRKfyroT/U5nbA.cHVxuH4C"
    },
    {
        "title": "Spicy Peanut Shrimp Rice Noodles",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3/4 white onion, chopped ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 pound frozen shrimp, thawed ADVERTISEMENT",
            "2 (14.5 ounce) cans fire-roasted diced tomatoes ADVERTISEMENT",
            "2 tablespoons creamy peanut butter ADVERTISEMENT",
            "1 teaspoon red chile paste, or more to taste ADVERTISEMENT",
            "1 (8 ounce) package wide rice noodles ADVERTISEMENT",
            "hot water to cover ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, or to taste ADVERTISEMENT",
            "1/4 cup Greek-style yogurt, or to taste ADVERTISEMENT",
            "1/4 cup chopped peanuts, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large pan or skillet over medium heat; saute onion, garlic, and red pepper flakes until garlic is slightly browned, 2 to 3 minutes. Add shrimp; cook and stir until shrimp begin to firm, about 5 minutes.\nStir tomatoes, peanut butter, and red chile paste into shrimp mixture; bring to a boil. Reduce heat and simmer until sauce thickens, about 20 minutes.\nPlace noodles in a large bowl and cover with hot water. Set aside until noodles are softened, about 15 minutes. Drain and rinse thoroughly.\nDivide noodles among serving plates; top with shrimp sauce. Garnish each serving with cilantro, yogurt, and peanuts.\n",
        "picture_link": "A/QD1TOIC4Xzkm636idQzPWvRW76F7e"
    },
    {
        "title": "Easy Sesame Wings",
        "ingredients": [
            "1/2 cup cornstarch ADVERTISEMENT",
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/4 cup oil ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 (3 pound) bag chicken wings, tips removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk cornstarch, soy sauce, oil, flour, sugar, eggs, sesame seeds, salt, and garlic powder together in a bowl. Pour marinade into a resealable plastic bag. Add chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator, 5 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Line a rimmed baking sheet with aluminum foil.\nRemove chicken from marinade and transfer to the prepared baking sheet. Discard unused marinade.\nBake in the preheated oven until no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "o98IfZBI/1hUp13reCLFYhC4fxMl/ey"
    },
    {
        "title": "Rollatini with Pork and Rosemary Filling",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/2 pound ground pork ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons chopped fresh rosemary ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - pounded to 1/4 inch thickness ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Filling: Heat the olive oil in a medium skillet over medium heat. Add the onion and garlic and saute until golden. Add the pork and season with salt and pepper to taste. Cook the pork, crumbling with a fork, for about 10 minutes. Stir in the rosemary. Remove mixture from skillet with a slotted spoon and remove all but 2 tablespoons of the pork fat.\nLay the chicken breasts flat and season with salt and pepper to taste. Spoon equal amounts of the pork mixture onto each breast, and roll each one up tightly. Secure each roll with 2 toothpicks.\nHeat the skillet with the reserved pork fat over medium high heat until almost smoking. Saute chicken on one side for 3 to 4 minutes or until golden brown. Turn over. Turn heat to medium and saute chicken until cooked through, 5 to 6 minutes.\n",
        "picture_link": "72xZ6laLX.KWDgcMZENxIByDK1Qdp3q"
    },
    {
        "title": "Old Fashioned Red Devil's Food Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup sour milk ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "1/3 cup hot water ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 - 9 inch pans. Sift together 2 cups flour, cocoa, baking soda and 1/2 teaspoon salt. Set aside.\nIn a large bowl, cream shortening and 1 1/2 cup sugar until light and fluffy. Add eggs one at a time, beating well after each. Add flour mixture alternately with sour milk. Add 1 cup boiling water and 1 teaspoon vanilla.\nDivide batter into two 9 inch pans. Bake at 350 degrees F (175 degrees C) for 30 minutes, or until a toothpick inserted into the cake comes out clean. Allow layers to cool, then spread Pecan Filling between layers.\nTo make Pecan Filling: In a sauce pan, combine 1/3 cup sugar, 1 tablespoon flour, butter, milk and egg yolks. Cook over medium heat, stirring constantly, until thick. Remove from heat, add 1/8 teaspoon salt and 1/2 teaspoon vanilla. Stir in pecans and set aside to cool. Spread between layers of cake, then frost with Satin Seafoam Icing.\nTo make Satin Seafoam Icing: In a sauce pan, combine 3/4 cup brown sugar, 3/4 cup white sugar, cream of tartar and 1/3 cup hot water. Cover and bring to a boil. Uncover and cook until 246 degrees F (120 degrees C). Remove from heat. In a large bowl, beat egg whites until foamy. While beating with an electric mixer at medium speed, slowly pour hot syrup in a thin stream over egg whites. Turn mixer to high speed, and continue beating until stiff peaks form, and frosting is thick enough to spread. Add 1/2 teaspoon vanilla.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]