[
    {
        "title": "Irish Cream Chocolate Mousse",
        "ingredients": [
            "6 eggs, separated ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup chilled heavy cream ADVERTISEMENT",
            "3 1/2 tablespoons Irish cream liqueur ADVERTISEMENT",
            "8 ounces chocolate, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, beat the egg yolks and sugar with an electric mixer set on medium speed until pale, creamy, and starting to thicken, about 5 minutes.\nWith clean beaters, whip the cream in a non-plastic bowl on medium speed until fluffy and the cream forms stiff peaks. Use a rubber spatula or wire whisk to fold 1/3 of the yolk mixture into the whipped cream. Gently run the spatula through the center of the bowl, then around the sides of the bowl, repeating until fully incorporated. Add the remaining yolk mixture and then the Irish cream liqueur, folding just until incorporated.\nIn a microwave-safe bowl, heat the chocolate very gently on low power just until melted; stir to dissolve any lumps. Very gently fold the chocolate into the Irish cream mixture as before, keeping as much fluffy volume as possible. With clean beaters, beat the egg whites on medium-high speed in a non-plastic bowl to stiff peaks; gently fold the egg whites into the chocolate mixture until evenly incorporated. Spoon the mousse into individual dessert cups or glasses, and chill for 4 to 6 hours.\n",
        "picture_link": "GYChS6TctP6GasxZBDJ6Rn0WsxGJfHS"
    },
    {
        "title": "Saltine Cracker Pudding",
        "ingredients": [
            "2 eggs, separated ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "4 cups 2% milk ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "2 cups crushed saltine crackers ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg yolks and sugar together in a bowl with an electric mixer until fluffy and pale yellow, 1 to 3 minutes. Heat milk in a large saucepan over medium heat, and whisk in the egg yolk mixture until smooth; boil for 1 minute. Mix in the coconut and cracker crumbs; bring to boil, reduce heat to low, and simmer the mixture until thick, about 5 minutes.\nBeat the egg whites in a glass or metal mixing bowl with an electric mixer until they hold stiff peaks; gently fold into the coconut mixture, and mix in the vanilla extract. Serve warm or cold. Refrigerate leftovers.\n",
        "picture_link": "iVLtqXQK5HDmSwQ7kA7ohe5OYbIqVl6"
    },
    {
        "title": "Arugula Salad with Avocado Citrus Vinaigrette",
        "ingredients": [
            "1 avocado - peeled, pitted and diced ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "2 tablespoons grapefruit juice ADVERTISEMENT",
            "2 tablespoons rice wine vinegar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "3 tablespoons chopped cilantro ADVERTISEMENT",
            "1 leaf fresh mint, chopped ADVERTISEMENT",
            "1 leaf fresh basil, chopped ADVERTISEMENT",
            "2 1/2 cups baby arugula leaves ADVERTISEMENT",
            "2 ounces kalamata olives, pitted and halved ADVERTISEMENT",
            "2 ounces cherry tomatoes, halved ADVERTISEMENT",
            "2 tablespoons freshly shaved Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the avocado, red onion, lime juice, grapefruit juice, rice wine vinegar, black pepper, and sea salt in a blender, and process until smooth, about 30 seconds. While the blender is running, drizzle in the olive oil; add honey, cilantro, mint, and basil leaves, and process for a few more seconds to leave the herbs visible as small flecks.\nToss the arugula, kalamata olives, and cherry tomatoes in a salad bowl; sprinkle with shaved Parmesan cheese. Pour vinaigrette over the salad, and toss to serve.\n",
        "picture_link": "G587MEBuUuaJaVY5BVyY80Dq9rWAnyG"
    },
    {
        "title": "Redskin Hodge Podge",
        "ingredients": [
            "4 red potatoes, cubed ADVERTISEMENT",
            "3 cloves garlic, peeled ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/2 cup fat free milk ADVERTISEMENT",
            "2 tablespoons heavy cream (optional) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 cups shredded cooked chicken ADVERTISEMENT",
            "1 (15.25 ounce) can sweet yellow corn, drained ADVERTISEMENT",
            "1 (8 ounce) package corn bread mix (such as Jiffy®) ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes and garlic into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Combine potatoes and garlic with 1/4 cup melted butter, milk, heavy cream, and salt. Mash the potatoes until smooth, then stir in Parmesan cheese.\nPreheat an oven to 375 degrees F (190 degrees C).\nMix the chicken and corn in a 9x13-inch baking dish, then spread the mixture into an even layer. Spread the mashed potatoes on top; set aside. Combine the cornbread mix, sugar, and egg in a bowl. Spread the mixture over the mashed potatoes.\nBake in the preheated oven until golden brown and a toothpick inserted into the center comes out clean, 20 to 25 minutes. Spread the remaining 1 tablespoon of butter over the cornbread, and allow to melt completely before serving.\n",
        "picture_link": "aLZTfpMo9F08Hv8fRKDPBqeQYZGYohO"
    },
    {
        "title": "Quinoa Chocolate Treats",
        "ingredients": [
            "2 cups chocolate chips ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 drops peppermint extract ADVERTISEMENT",
            "3 cups uncooked quinoa, rinsed ADVERTISEMENT",
            "1 cup marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a baking tray.\nHeat the chocolate chips, cinnamon, brown sugar, butter, and peppermint extract together in a large saucepan over low heat; cook and stir until the mixture forms a smooth liquid. Fold the quinoa and marshmallows into the chocolate mixture until evenly distributed; immediately spread into the prepared tray. Allow to cool completely before cutting into triangles to serve.\n",
        "picture_link": "5vR5EvK.33uCiUT.xsc8ePaSLYWFu7S"
    },
    {
        "title": "Green Chili Roast",
        "ingredients": [
            "1 (3 pound) beef top round roast ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 (4 ounce) cans chopped mild green chilies ADVERTISEMENT",
            "1 (4 ounce) can chopped hot green chilies ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "12 (8 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season beef roast with salt and black pepper; place in slow cooker. Spoon the mild and hot chiles over the roast. Pour in the water.\nCover slow cooker; set to High. Cook until roast shreds with a fork; 4 to 6 hours. Shred meat; serve on tortillas.\n",
        "picture_link": "VSWBIgP7ewyuaV9UFit0NB7osJ5wp2O"
    },
    {
        "title": "Vegan Black and White Bean Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 celery rib, chopped ADVERTISEMENT",
            "1 tablespoon crushed garlic ADVERTISEMENT",
            "1 teaspoon thyme ADVERTISEMENT",
            "1 (14.5 ounce) can black beans, drained ADVERTISEMENT",
            "8 cups vegetable broth, divided ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 (14.5 ounce) can white beans, drained ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large stock pot over medium heat. Cook the onion, celery, garlic, and thyme together in the hot oil until the celery is soft, 7 to 10 minutes. Add the black beans, 4 cups vegetable broth, and the cumin to the pot; mix to combine. Stir the white beans, the remaining vegetable broth, and the sage into the mixture; bring to a gentle boil and simmer 30 minutes.\n",
        "picture_link": "gFunTfa11RLszwaIm9OuhCOkyPGM4Ou"
    },
    {
        "title": "Pasta with Thai-Style Chicken",
        "ingredients": [
            "1 (16 ounce) package fusilli pasta ADVERTISEMENT",
            "3/4 pound fresh green beans, trimmed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves, thinly sliced ADVERTISEMENT",
            "2 tablespoons fresh ginger root, peeled and grated ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the fusilli, and return to a boil. Cook the pasta uncovered, stirring occasionally, for 5 minutes; then stir in the green beans. Cook until the pasta has cooked through but is still firm to the bite and the green beans are tender but bright green, about 7 more minutes. Drain the pasta and green beans well in a colander set in the sink.\nHeat olive oil in a large skillet over medium heat, and cook the chicken just until it loses its pink color, about 2 minutes. Stir in ginger, garlic, salt, and red pepper flakes, and cook until the garlic is fragrant, about 1 minute; stir the coconut milk and lime juice into the skillet with the chicken. Bring the mixture to a boil; mix in the drained pasta, green beans, and cilantro. Reheat to a simmer.\n",
        "picture_link": "dT9N9DQarIXJTVCxUDJJ.aKyrcmhwq."
    },
    {
        "title": "Tuscan Grill Panini",
        "ingredients": [
            "1/2 cup KRAFT Tuscan House Italian Dressing and Marinade, divided ADVERTISEMENT",
            "2 (4 ounce) boneless skinless chicken breast halves ADVERTISEMENT",
            "1 red pepper, cut into strips ADVERTISEMENT",
            "1 small zucchini, cut lengthwise in half, then sliced crosswise ADVERTISEMENT",
            "4 slices Italian bread ADVERTISEMENT",
            "1/2 cup KRAFT Shredded Low-Moisture Part-Skim Mozzarella Cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Reserve 1 tablespoon dressing; pour remaining over chicken and vegetables in shallow dish. Stir vegetables and turn chicken to evenly coat both sides of each piece. Refrigerate 30 min. to marinate.\nHeat panini grill. Meanwhile, drain chicken and vegetables; discard marinade. Cook chicken and vegetables in skillet on medium heat 10 min. or until chicken is done (165 degrees F) and vegetables are crisp-tender, turning chicken after 5 min. and stirring vegetables occasionally.\nFill bread slices with chicken, vegetables, cheese and basil to make 2 sandwiches; brush outsides with reserved dressing. Grill 5 min. or until golden brown.\n",
        "picture_link": "n1bfuY2SW2Wkr.xduR54Z075D1V6TNC"
    },
    {
        "title": "Burger Spice Rub",
        "ingredients": [
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons sea salt ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons dried sage ADVERTISEMENT",
            "1 pinch crushed red pepper, or to taste ADVERTISEMENT",
            "1 pinch chili powder, or to taste ADVERTISEMENT",
            "1 pinch dried thyme, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix brown sugar, sea salt, paprika, black pepper, onion powder, garlic powder, cumin, sage, red pepper flakes, chili powder, and thyme in a bowl until well blended. Store in an airtight container.\n",
        "picture_link": "UnmCe7nAk3t2vGd/nugRLTqRDQPqdii"
    },
    {
        "title": "Swampland Cheesecake",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "6 tablespoons margarine, softened ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix the graham crackers, pecans, and 1/3 cup of sugar in a bowl, and mash the softened margarine into the crumbs until thoroughly combined. Press the crumb mixture into the bottom of a 10-inch springform pan. In a bowl, beat the cream cheese, 2 cups of sugar, eggs, and lemon juice together with an electric mixer set on medium speed until fluffy and well blended; spoon the mixture on top of the crumbs.\nBake in the preheated oven until set, about 1 hour and 10 minutes; remove from oven, and let cool for 30 minutes. Mix the sour cream, 1/2 cup of sugar, and vanilla extract together in a bowl; top the cheesecake with the sour cream mixture. Return to oven, and bake 10 more minutes. Allow to chill in refrigerator at least 4 hours to set.\n",
        "picture_link": "IMTaxuBvQhc9o0MDo11MQdDXh3K/AR6"
    },
    {
        "title": "Very Berry Delicious Burrito",
        "ingredients": [
            "4 Mission® Large/Burrito-size Flour Tortillas ADVERTISEMENT",
            "8 tablespoons JIF® Peanut Butter ADVERTISEMENT",
            "4 tablespoons SMUCKER'S® Strawberry Jam ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1 cup diced fresh strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread each tortilla with 1/4 of each ingredient. Roll into a burrito and cut in half. Serve immediately or wrap in plastic wrap, place in refrigerator for later use.\n",
        "picture_link": ".G7bd5XVH3KrfT/OD3jGoE6JttkO6M2"
    },
    {
        "title": "Broccoli Polonaise",
        "ingredients": [
            "1 pound broccoli, cut into florets ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1 hard-boiled egg, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the broccoli, cover, and steam until just tender, 2 to 6 minutes depending on thickness. Drain broccoli and place into a serving dish.\nIn a small saucepan over medium heat, melt the butter; stir in bread crumbs and Parmesan cheese, and cook until the crumbs are golden brown, 1 to 2 minutes. Sprinkle the browned crumbs onto the steamed broccoli, and toss gently. Sprinkle the broccoli with chopped egg.\n",
        "picture_link": "BdMqh.FZZa33PfCuEuhqRc0IIL9xuuG"
    },
    {
        "title": "Dazzlin' Chicken -n- Dumplin's",
        "ingredients": [
            "6 chicken breast halves ADVERTISEMENT",
            "4 cups water, or as needed to cover ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 1/4 cups all-purpose flour, divided ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/4 cups heavy cream ADVERTISEMENT",
            "1 tablespoon chopped parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken breasts into a large soup pot, cover with water, and sprinkle in the salt, black pepper, and sage. Bring to a boil over medium heat, then reduce heat and simmer until the chicken is no longer pink inside, about 30 minutes. Remove the chicken to a bowl, and let cool; shred chicken when cooled.\nWhile chicken is cooling, bring the chicken broth left in the pot back to a boil over medium heat, and stir in the celery, onion powder, and garlic powder. Reduce heat to a simmer, and cook until the celery is tender, about 20 minutes.\nMeanwhile, whisk 1 cup of all-purpose flour, the whole wheat flour, salt, and baking powder together in a mixing bowl. Stir in the cream to make a dough. Sprinkle a work surface with the remaining 1/4 cup of flour, and roll the dough out about 1/4-inch thick. Using a pizza cutter, cut the dough into 1 1/2 inch squares. Toss the dumplings in the flour on the work surface.\nDrop the dumplings, a few at a time, into the simmering broth. Stir frequently to keep them from sticking to the bottom; allow to simmer until the dumplings puff up and the broth thickens, about 30 minutes; stir in the cooked shredded chicken and parsley. Bring back to a boil, and serve hot in bowls.\n",
        "picture_link": "W8CTPo/py6ZQWTHLuU8fgpVQC399/4S"
    },
    {
        "title": "Holiday Waffles",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 1/4 cups milk ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "3 drops food color ADVERTISEMENT",
            "2 tablespoons confectioners' sugar for dusting (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions.\nWhisk together the flour, baking powder, salt, and sugar; set aside. Beat the eggs in a mixing bowl with the milk, vegetable oil, and food color. Stir the flour into the egg mixture until only slight lumps remain.\nPour batter into waffle iron in batches, and cook until crisp and golden brown. Sprinkle with confectioners' sugar to serve.\n",
        "picture_link": "umn/XpEPBF.vDsK91uY7bxJy6Nt7m3m"
    },
    {
        "title": "Banana Monkey",
        "ingredients": [
            "1 cup pina colada mix ADVERTISEMENT",
            "1 fluid ounce coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "1 fluid ounce vodka ADVERTISEMENT",
            "1/3 banana, mashed ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pina colada mix, coffee-flavored liqueur, vodka, banana, and 1/2 cup of ice into a blender. Cover, and puree until smooth. Add ice a little at a time and repeat until drink reaches desired consistency.\n",
        "picture_link": "99c968LGUl7QHwvAR3Hi37eyblexmwa"
    },
    {
        "title": "Gluten-Free Delicious Soft Oatmeal Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon gluten-free vanilla extract ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "1/2 cup sorghum flour ADVERTISEMENT",
            "1/2 cup sweet rice flour ADVERTISEMENT",
            "1/2 cup brown rice flour ADVERTISEMENT",
            "1/2 cup almond meal ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nBeat the butter, brown sugar, and white sugar together with an electric mixer in a large bowl until smooth. Beat the eggs, one at a time, into the butter mixture until completely blended; add vanilla extract.\nWhisk cornstarch, sorghum flour, sweet rice flour, brown rice flour, almond meal, cinnamon, baking soda, and salt together in a bowl. Stir flour mixture into butter mixture; add oats and mix to form a soft dough. Roll dough into walnut-sized balls and place 2 inches apart onto prepared baking sheet.\nBake in the preheated oven until cookies are golden and set, about 10 minutes. Cool cookies on the baking sheet for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "bs7hu0R.DwfT5.iM4zcy76YxJ1pKK.."
    },
    {
        "title": "Orzo with Sun-Dried Tomatoes and Kalamata Olives",
        "ingredients": [
            "2/3 cup orzo pasta ADVERTISEMENT",
            "1/2 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "1/2 cup pitted kalamata olives ADVERTISEMENT",
            "1/2 cup pesto ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook orzo in the boiling water, stirring occasionally until cooked through but firm to the bite, about 11 minutes. Drain.\nMix orzo pasta, tomatoes, and olives together in a large bowl. Pour pesto over pasta mixture and stir to coat. Sprinkle Parmesan cheese over the pasta mixture; stir. Drizzle olive oil over the salad and stir to achieve your preferred moisture level.\n",
        "picture_link": "W7MqUTzuGLWd0a8vMp4A/coPWLrqmz6"
    },
    {
        "title": "Not-Barbecued Short Ribs",
        "ingredients": [
            "3 large onions, chopped ADVERTISEMENT",
            "7 pounds beef short ribs, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 (20 ounce) cans pineapple chunks in juice, undrained ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "7 tablespoons Worcestershire sauce ADVERTISEMENT",
            "5 tablespoons ketchup ADVERTISEMENT",
            "4 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1 tablespoon dried sage ADVERTISEMENT",
            "1 tablespoon dried thyme ADVERTISEMENT",
            "1 1/2 teaspoons dry mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread onion into the bottom of the crock of your slow cooker. Season short ribs with salt and pepper; place atop the onion.\nMix water, pineapple chunks with juice, brown sugar, Worcestershire sauce, ketchup, garlic, sage, thyme, and mustard together in a bowl; pour over the ribs.\nCook on High for 4 hours (on on Low for 6 to 8 hours).\n",
        "picture_link": "G6W5Woo9nB8.II3s2MjkAKBfyDR.TXy"
    },
    {
        "title": "Coconut Chicken with Green Beans",
        "ingredients": [
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "6 cups trimmed green beans ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "3 large skinless, boneless chicken breast halves, cut into chunks ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 tablespoons coconut butter (optional) ADVERTISEMENT",
            "3 tablespoons almond butter (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat coconut milk in a large saucepan over low heat. Simmer green beans in coconut milk until soft, about 10 minutes.\nHeat vegetable oil in a skillet over medium heat. Cook and stir chicken and onion in hot oil until the chicken pieces are no longer pink in the center, about 10 minutes.\nStir chicken mixture into the green bean mixture; cook together for 2 minutes. Transfer to a serving platter.\nMelt coconut butter and almond butter together in a saucepan over low heat; drizzle over chicken and green beans.\n",
        "picture_link": "g7Gidr5K/ivrRpP58kEcxu.qfLAI.Ea"
    },
    {
        "title": "Amazing Tofu Scramble",
        "ingredients": [
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1/4 cup minced carrot ADVERTISEMENT",
            "1/4 cup diced fresh shiitake mushrooms ADVERTISEMENT",
            "1 (12 ounce) package firm tofu, crumbled ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/8 teaspoon sea salt, or to taste ADVERTISEMENT",
            "freshly ground black pepper to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat; saute onion until softened, about 2 minutes. Add carrot to onion and saute until slightly softened, about 2 more minutes. Add mushrooms to onion mixture and saute until mushrooms are slightly tender, about 2 more minutes.\nStir tofu, turmeric, cumin, salt, and pepper into onion mixture; saute until tofu is cooked through, about 2 more minutes.\n",
        "picture_link": ".xlCM21K8C9axDkWL2SzyCdLQfhtgvm"
    },
    {
        "title": "Brussels Sprout Hash",
        "ingredients": [
            "1/4 cup honey-flavored butter ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 pound Brussels sprouts, grated ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons white cooking wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt honey-flavored butter in a large skillet over medium-high heat; saute onion in butter until golden and glazed, 5 to 7 minutes.\nAdd Brussels sprouts to the skillet; season with salt and pepper. Saute sprouts until crisp-tender, 5 to 7 minutes. Remove skillet from heat, drizzle wine over the sprouts, and toss to coat.\n",
        "picture_link": "7zhoMHSE4ow22K7857Jh9jS5Ye8pwe2"
    },
    {
        "title": "My Chicken Spaghetti",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 (1 pound) package processed cheese food (such as Velveeta®), cut into cubes ADVERTISEMENT",
            "2 cups chopped cooked chicken ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes; drain.\nMelt margarine in a large saucepan over medium heat. Stir flour into the margarine until the flour is completely moistened. Gradually stream milk into the saucepan while whisking with the flour mixture until the milk is incorporated into a smooth mixture.\nStir processed cheese food into the milk mixture in small amounts, letting each addition melt smoothly into the liquid before adding the next; add chicken, chicken broth, mushrooms, salt, and cayenne pepper. Stir mixture, add cooked spaghetti, and toss to coat. Divide the chicken spaghetti between 2 baking dishes.\nBake in preheated oven until the sauce is thick and the edges begin to brown, about 30 minutes.\n",
        "picture_link": "fuNjhMDz7SESnztbFCf7.MzRBR7kU56"
    },
    {
        "title": "Killer Crackers",
        "ingredients": [
            "1 tablespoon coconut oil ADVERTISEMENT",
            "4 teaspoons chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 1/2 tablespoons chopped fresh mushrooms ADVERTISEMENT",
            "1 tablespoon frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1/3 cup almond flour ADVERTISEMENT",
            "1/3 cup coconut flour ADVERTISEMENT",
            "2 tablespoons flax seed meal ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt coconut oil in a skillet over medium heat; saute onion and garlic until onion is tender, about 5 minutes. Add mushrooms; saute until tender, about 5 minutes. Add spinach and cook until warmed, 2 to 3 minutes. Remove pan from heat and slightly cool vegetables.\nMix almond flour, coconut flour, flax seed meal, salt, and pepper in a bowl.\nTransfer vegetable mixture to a work surface and finely chop. Stir vegetable mixture into flour mixture; add eggs, water, and olive oil. Mix until dough is thoroughly combined and holds together.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nTurn dough onto the prepared baking sheet and press into a flat rectangle. Place a second sheet of parchment paper atop dough and roll dough between the 2 sheets until about 1/16-thick. Remove top parchment paper. Cut edges of dough to make an even rectangle. Add excess dough to 1 end of rectangle and re-roll into even thickness.\nCut dough into 1-inch squares using a pizza cutter, keeping dough together.\nBake in the preheated oven until edges are browned, 18 to 20 minutes. Cool completely and break into squares.\n",
        "picture_link": "zBxE8pnUlUw9GHcbQoilsJ6IS89SEmG"
    },
    {
        "title": "Super-Easy Nutella® Cookies",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup chocolate-hazelnut spread (such as Nutella®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix flour and sugar together in a bowl; add eggs and mix until incorporated. Stir chocolate-hazelnut spread into flour mixture until dough is smooth. Roll dough into 2-inch balls and lightly press onto a baking sheet.\nBake in the preheated oven until edges of cookies are starting to harden, 20 to 25 minutes.\n",
        "picture_link": "1LnCnJEwrzSRhluCUCyQhQPfIjYIvbi"
    },
    {
        "title": "Red Velvet Milkshake",
        "ingredients": [
            "1 cup chocolate ice cream ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "3 tablespoons red velvet cake mix ADVERTISEMENT",
            "1 tablespoon cream cheese frosting (optional) ADVERTISEMENT",
            "2 tablespoons whipped cream, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cream, milk, cake mix, and frosting together in a blender until smooth; pour into a glass and top with whipped cream.\n",
        "picture_link": "aRfv1beYzm3G2yTpxvQ5vBr2BR6bY2W"
    },
    {
        "title": "Apple Pie Oatmeal Breakfast",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "3 apples, diced ADVERTISEMENT",
            "1 cup steel cut oats ADVERTISEMENT",
            "1 cup apple juice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, diced apples, oats, apple juice, and cinnamon together in a slow cooker.\nCook on Low, stirring hourly, until the oats are tender and the mixture reaches your preferred consistency, 4 to 6 hours.\n",
        "picture_link": "3ypljwWC3n0noP02CcVR1cZNuXDtm7W"
    },
    {
        "title": "British Hot Cross Buns",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 cup unsalted butter, softened, cut into pieces ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2/3 cup dried currants ADVERTISEMENT",
            "1/4 cup diced candied citron ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "2/3 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk in a small saucepan to 110 degrees F (43 degrees C); pour milk into a bowl. Whisk 1/2 cup flour and yeast into milk; cover with plastic wrap and let stand until bubbly, about 15 minutes.\nPlace 1 2/3 cups flour, 1/3 cup white sugar, salt, cinnamon, cloves, ginger, and nutmeg into the bowl of a stand mixer with paddle attachment; turn mixer on for a few seconds on low speed to combine. Place butter into flour mixture; mix on low speed until incorporated, about 2 minutes.\nPlace yeast mixture and egg into flour mixture; mix on low speed for 2 minutes. Stop mixer and allow to rest for 10 minutes; mix on medium speed until smooth and elastic, about 2 minutes. At slowest speed, mix currants and citron into dough until evenly distributed, about 1 minute.\nButter the inside of a large bowl; place dough in bowl, turn to butter dough on all sides. Cover bowl with plastic wrap; let dough rise in a warm place until doubled in size, about 1 hour.\nLine a baking sheet with parchment. Turn dough out onto a lightly floured surface. Pat dough into a rough square, and cut into 12 equal pieces. Form each piece into a round bun; place on prepared baking sheet. Press a cross into each bun with the back of a knife; cover buns with a damp cloth and allow to rise until doubled in size, about 45 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake buns in the preheated oven until deep golden brown, about 15 minutes.\nBring 2 tablespoons white sugar with 1 tablespoon water to a boil in a small saucepan. Remove buns from oven; lift parchment and transfer buns to a wire rack. Brush immediately with sugar glaze; allow buns to cool completely, about 20 minutes.\nStir confectioners' sugar and remaining 2 teaspoons water together in a small bowl; heat icing mixture in microwave until smooth and warm to the touch, about 10 seconds. Place icing in a sandwich bag, snip off one corner of the bag, and pipe in a cross over fully cooled buns; allow icing to dry for 30 minutes.\n",
        "picture_link": "hZnoXtfXqxlXLgPbi3KVle3yt/5.JWC"
    },
    {
        "title": "Tuna and Lemon Pasta",
        "ingredients": [
            "1 (16 ounce) package whole-wheat spaghetti ADVERTISEMENT",
            "2 (7 ounce) cans albacore tuna in water, drained and flaked ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "1/4 cup chopped fresh dill, or to taste ADVERTISEMENT",
            "2 tablespoons red pepper flakes ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes; drain.\nTransfer spaghetti to a large bowl; add flaked tuna, feta cheese, red onion, dill, red pepper flakes, lemon zest, and lemon juice to the bowl and toss.\n",
        "picture_link": "GLK8j9FcvRhF5U95IQbXQhGJsJK5aLO"
    },
    {
        "title": "Sriracha Deviled Eggs",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "2 tablespoons mayonnaise, or as needed ADVERTISEMENT",
            "2 tablespoons Sriracha hot chili sauce, or more to taste ADVERTISEMENT",
            "1/8 teaspoon dry mustard ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pinch smoked paprika, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan; cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nCut eggs in half lengthwise; place egg yolks in a small bowl. Mash yolks with a fork; stir mayonnaise, Sriracha sauce, dry mustard, and cayenne pepper into yolks until smooth; season with salt. Spoon yolk mixture into a resealable plastic bag; snip off one corner of the bag.\nPlace egg whites cut-side up on a serving platter. Pipe the yolk mixture into egg white halves; sprinkle with smoked paprika. Refrigerate deviled eggs, covered, until ready to serve.\n",
        "picture_link": "v62q74lu1FkC0dda9o5M9EghXgDlpLK"
    },
    {
        "title": "Leek and Potato Chowder",
        "ingredients": [
            "3 leeks ADVERTISEMENT",
            "6 tablespoons butter, divided ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 (15 ounce) cans chicken broth ADVERTISEMENT",
            "5 small red potatoes, peeled and diced ADVERTISEMENT",
            "2 slices crispy cooked bacon, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup water as needed ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Clean leeks by cutting off the roots and the tips of the leaves. Make a vertical cut from the root end to the tops, being careful to not cut through completely. The leeks will now open like the pages of a book, and any mud can be cleaned out between the leaves under the faucet. Slice the cleaned leeks into quarter-inch strips.\nMelt half the butter in a skillet over medium-high heat. Saute leeks in hot butter until wilted, 3 to 5 minutes; transfer to a slow cooker.\nMelt remaining butter in the same skillet over low heat. Gradually whisk flour into the melted butter until the mixture forms a clump of dough. Slowly stream chicken broth into the skillet, continually whisking until the broth is entirely incorporated; pour over the mixture in the slow cooker. Add bacon and potatoes to the slow cooker. Season mixture with salt and pepper; stir.\nCook on Low until the potatoes are soft, stirring water into the mixture if it gets too thick, at least 2 hours. Stir half-and-half into the mixture and continue cooking for 1 hour more.\n",
        "picture_link": "N9sRyIroUC1eQvOU/vllbMF52/t1P7G"
    },
    {
        "title": "Easy Overnight Oatmeal",
        "ingredients": [
            "non-stick cooking spray ADVERTISEMENT",
            "4 cups almond milk ADVERTISEMENT",
            "2 cups steel-cut oats ADVERTISEMENT",
            "2 cups chopped apples ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat the inside of a slow cooker with cooking spray.\nCombine almond milk, oats, apples, raisins, walnuts, brown sugar, butter, cinnamon, and salt in the prepared slow cooker.\nCook on Low for 7 to 8 hours.\n",
        "picture_link": "p6Gk2HPvk7E6yYB0Nk5Up.U8FsE2bkC"
    },
    {
        "title": "Red Velvet Belgium Waffles",
        "ingredients": [
            "Waffles: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups buttermilk ADVERTISEMENT",
            "1/3 cup melted butter, cooled ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon white vinegar ADVERTISEMENT",
            "1 tablespoon red velvet food coloring (such as Lorann Professional Kitchen®) Red Velvet Bakery Emulsion) or as desired ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "6 ounces cream cheese, softened ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup whole milk, or more as needed ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "2 tablespoons confectioners' sugar, or to taste (optional) ADVERTISEMENT",
            "6 tablespoons whipped cream, or to taste (optional) ADVERTISEMENT",
            "1 cup sliced strawberries, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, white sugar, baking powder, cocoa powder, and salt together in a bowl.\nBeat buttermilk, melted butter, eggs, 2 teaspoons vanilla extract, and vinegar together in a bowl until smooth. Stir red food coloring into buttermilk mixture. Mix buttermilk mixture into flour mixture until just combined.\nPreheat a waffle iron according to manufacturer's instructions.\nBeat cream cheese and softened butter together in a bowl using an electric mixer until smooth and fluffy. Gradually mix 2 cups confectioners' sugar into cream cheese mixture, alternating with milk and 1 teaspoon vanilla extract, until glaze is smooth.\nSpoon 1/4 to 1/2 cup waffle batter into preheated waffle iron. Cook according to manufacturer's directions. Repeat with remaining batter.\nLightly dust each waffle with remaining confectioners' sugar, drizzle with glaze, and top each with whipped cream and strawberries.\n",
        "picture_link": "D2yJXX3Wp.T4XmiN8PubTBflj32bH1K"
    },
    {
        "title": "Tortellini in Chicken Broth",
        "ingredients": [
            "2 cups low-sodium chicken broth ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1/2 (16 ounce) package frozen cheese tortellini ADVERTISEMENT",
            "1 cup chopped watercress ADVERTISEMENT",
            "2 scallions, sliced ADVERTISEMENT",
            "3 drops hot red pepper sauce (optional) ADVERTISEMENT",
            "2 tablespoons grated Romano cheese ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir broth and water together in a pot; bring to a boil. Stir frozen tortellini into broth mixture and cook, stirring occasionally, until tortellini float to the top and the filling is hot, 6 to 8 minutes. Stir watercress and scallions into broth mixture and cook until watercress wilts, about 2 minutes. Add hot pepper sauce. Sprinkle with Romano cheese and black pepper to serve.\n",
        "picture_link": "MH/o.pJEq.dFWaBtIJ2jbZH24X1ggqe"
    },
    {
        "title": "Lemony Cranberry Hazelnut Scones with Lemon Glaze",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon freshly grated lemon zest ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup cold unsalted butter ADVERTISEMENT",
            "1/3 cup fresh cranberries ADVERTISEMENT",
            "1/4 cup chopped hazelnuts ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon heavy whipping cream ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nWhisk flour, white sugar, baking powder, lemon zest, and salt together in a large bowl. Cut unsalted butter into flour mixture with a knife or pastry blender until the mixture resembles coarse crumbs. Add cranberries and hazelnuts.\nBeat 2 eggs and buttermilk together with a fork in a small bowl; add egg mixture to flour mixture and mix until the dough starts to come together and is just moistened. Let dough rest for 10 minutes.\nTurn dough out on a lightly-floured surface and pat dough into a 1-inch thick circle. Cut circle in half with a sharp knife and cut each half into four sections. Gently transfer each section with a floured spatula to the prepared baking sheet.\nWhisk 1 egg and cream together in a small bowl. Brush egg-cream mixture over each scone.\nBake in the preheated oven until the scones are golden brown and sound hollow when tapped, about 30 minutes. Remove to a wire rack.\nStir confectioners' sugar and lemon juice together in a bowl until desired glaze consistency is reached. Drizzle glaze over warm scones.\n",
        "picture_link": "LIv4Jf8TJhYfYn4.0EGWaRgyMmopgS6"
    },
    {
        "title": "Coconut Flour, Almond Butter, and Raisin Cookies",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 cup almond butter ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup sifted coconut flour ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nBeat eggs, almond butter, honey, and vanilla extract together in a large bowl. Sift coconut flour into the egg mixture while continually stirring. Fold raisins into the mixture. Drop mixture by the spoonful onto prepared baking sheet.\nBake in preheated oven until golden brown, about 14 minutes. Cool cookies slightly on sheet before moving to a rack to cool completely.\n",
        "picture_link": "wHPbpBXQfTlaKESW5.DbC1W1CJrZd3a"
    },
    {
        "title": "Vermicelli Soup",
        "ingredients": [
            "12 ounces vermicelli pasta ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/4 yellow onion ADVERTISEMENT",
            "2 tomatoes ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using a large saute pan, fry vermicelli in vegetable oil till golden brown.\nIn a food processor or blender, blend the water, onion, tomatoes, garlic and salt. Strain.\nPour blended mixture over the vermicelli and allow to simmer till all the liquid has been evaporated or absorbed.\n",
        "picture_link": "4johZV2x21fh6inVwpB9VYYIdxF2.CC"
    },
    {
        "title": "Fried Pie Crust",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine butter, coconut, flour and brown sugar in a sauce pan. Cook on medium heat until a rich brown color, stirring frequently.\nPour into pie plate and press out to edges evenly with a fork.\nAllow to cool before filling.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tangy Chili",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (15 ounce) can sloppy joe sauce ADVERTISEMENT",
            "1 (11 ounce) can whole kernel corn ADVERTISEMENT",
            "1 (16 ounce) can chili beans in spicy sauce ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium sized saute pan, brown ground beef and then drain fat.\nIn a medium sauce pan combine browned beef, sloppy joe mix, corn, chili beans and mushrooms. Stir, heat through, and then serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cornish Pastie II",
        "ingredients": [
            "1 recipe pastry for a (10 inch) double crust pie ADVERTISEMENT",
            "2 cups thinly sliced potatoes ADVERTISEMENT",
            "1/2 cup sliced onion ADVERTISEMENT",
            "1/2 pound round steak, thinly sliced and cut in 1/2 inch pie ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Divide pastry in three equal parts. Roll 1/3 to make 8x15 inch rectangle. Trim edges and cut to make two 7-inch squares. Place on baking sheet. Repeat with other two thirds of pastry.\nArrange layer of potatoes on half of each pastry square, top with layer of onion and then with meat. Sprinkle with salt and pepper and dot with butter.\nMoisten pastry edges with cold water and fold over to make triangles; press edges together to make tight seal. A tight seal retains steam and makes juicy pastries.\nBake at 375 degrees F (190 degrees C) for 1 hour or until meat is tender. Serve hot with chili sauce, ketchup, or pickle relish or serve cold for sandwiches.\n",
        "picture_link": "rqspT.PPhkZoRdL2N8Z5Kwi/zKIbviW"
    },
    {
        "title": "Mushroom, Spinach and Cheese Torta",
        "ingredients": [
            "2 cups chopped onions ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "6 cups fresh mushrooms, sliced ADVERTISEMENT",
            "10 ounces spinach - rinsed, stemmed, and dried ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 cups ricotta cheese ADVERTISEMENT",
            "1 1/2 cups grated Parmesan cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 (16 ounce) package phyllo dough ADVERTISEMENT",
            "2 teaspoons sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSaute onion and garlic in oil in large saucepan until onion is translucent. Add mushrooms and spinach and continue cooking until mushrooms have released their juices and spinach has wilted. Continue cooking until liquid has evaporated. Remove from heat.\nBeat eggs slightly in large bowl. Add ricotta and parmesan, sour cream, bread crumbs and parsley to eggs. Drain excess liquid from vegetables, then add to cheese mixture. Stir until well blended.\nBrush some of melted butter on large baking sheet. Count out 6 phyllo leaves and carefully lift them up and lay flat on buttered baking sheet.\nSpread filling over middle of leaves, leaving a 3 inch border all around. Brush edges with butter.\nOn top of the filling, lay down 2 leaves of phyllo at a time, brushing top leaf with butter each time. After 4 pairs, fold corners of all phyllo leaves up over filling, and brush with butter.\nLay down 2 more pairs of leaves, buttering top leaf of each pair. Tuck edges under torta, corners first, then sides. Sprinkle top with sesame or poppy seeds.\nBake at 375 degrees F (190 degrees C) for 50 minutes or until filling is set and phyllo is crisp and golden. Allow to rest 10 minutes before slicing.\n",
        "picture_link": "brlqMuTk3q.dvXj8ekwuOnR2auVxeFi"
    },
    {
        "title": "Marshmallow Apple Pie",
        "ingredients": [
            "6 Granny Smith apples ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "14 large marshmallows ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees F). Line pie pan with plain pastry.\nPeel, remove core and slice apples. Place in pie shell.\nCombine sugar, salt and nutmeg. Sprinkle over apples. Dot with butter.\nBake at 425 degrees F (220 degrees C) for 30 minutes, or until crust is brown and the apples are tender. Remove from oven.\nCover the apples with halved marshmallows. Brown in slow oven 325 degrees F (165 degrees C). Serve warm.\n",
        "picture_link": "DZdtvBqr6YInfV9pH5tFC1.xxBYz/IG"
    },
    {
        "title": "Sausage Plait",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "10 tablespoons butter ADVERTISEMENT",
            "12 ounces pork sausage ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tomatoes, peeled and sliced ADVERTISEMENT",
            "1 yellow onion ADVERTISEMENT",
            "2 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 pinch Italian seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C)\nIn a large bowl, mix flour, margarine and water to a firm dough, and knead until smooth and silky. Roll dough out to a 12 inch square, and place on a greased cookie sheet.\nMix meat, ketchup and herbs. Place filling in the center of pastry, and spread so that there are 4 inches of dough on each side.\nPlace tomatoes, chopped onion and eggs on top of the filling. Cut 1 inch strips from the sides of the pastry, and lace over the top. bake 30 to 40 minutes at 375 degrees F (190 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Basler Mehlsuppa",
        "ingredients": [
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup sliced onion ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "4 cups beef stock ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "4 thick slices whole wheat bread ADVERTISEMENT",
            "1/2 cup shredded Gruyere cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a heave saucepan over medium heat, heat the flour gently until it begins to turn pale golden brown, stirring constantly. Remove from heat.\nIn another pan, saute onions in butter. When transparent, blend them into the flour. Gradually add the beef stock, the wine and the salt and pepper to taste. Cook gently, stirring frequently, for about 30 minutes.\nPut a slice of bread in each person's bowl with a good sprinkling of cheese on top. Pour soup into each bowl and serve at once.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cucumber Soup II",
        "ingredients": [
            "2 cups cucumber - peeled, seeded and shredded ADVERTISEMENT",
            "2 tablespoons grated onion ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of celery soup ADVERTISEMENT",
            "2 cups cottage cheese ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "1 pinch seasoning salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grate cucumber and onion, and strain out liquid.\nIn a blender, mix cream of celery soup, buttermilk, cucumber and onion mixture. Blend, add one cup of cottage cheese and blend again.\nSince the blender may not hold all of the ingredients, pour half of blended mixture into a bowl. Add remaining cottage cheese and blend. Combine all soup into one bowl and stir in seasoning salt. Refrigerate until ready to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Duck Soup (Czarnina)",
        "ingredients": [
            "1 (4 pound) wild duck, whole ADVERTISEMENT",
            "4 cups duck blood ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 stalk celery, cut into 2 inch pieces ADVERTISEMENT",
            "1 sprig chopped fresh parsley ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "5 whole allspice berries ADVERTISEMENT",
            "2 whole cloves ADVERTISEMENT",
            "16 ounces pitted prunes ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 tart apple - peeled, cored and chopped ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover whole duck with water in large stock pot. Add salt, and bring to a boil. Skim off foam.\nPlace celery, parsley, allspice, and cloves in a cheese cloth bag, and add to stock pot. Cover and cook over low heat until meat is tender, approximately 1 1/2 hours.\nRemove cheese cloth bag from stock pot. Remove duck. Discard bones, cut up meat, and return to the broth.\nMix in prunes, raisins and apple. Simmer for 30 minutes.\nIn a medium bowl, beat flour and sugar into cream until smooth. Beat in duck blood gradually. Add 1/2 cup hot soup stock to blood mixture, blending thoroughly. Pour mixture slowly back into stock pot, stirring constantly until soup comes to a boil. Season to taste with salt, pepper, lemon juice and vinegar.\n",
        "picture_link": "90ufWevV77/jwhRf66wNiyH0s/PBsHK"
    },
    {
        "title": "Grison Beef Stew",
        "ingredients": [
            "1 1/2 pounds beef brisket ADVERTISEMENT",
            "1 large head cabbage ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "8 ounces bacon, cooked and cubed ADVERTISEMENT",
            "1/2 cup sliced onion ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 cup beef stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut out the main stem of the cabbage and discard the thick stems of the outer leaves. Wash well and boil for 5 minutes in salted water. Drain and reserve.\nHeat the butter in a heavy ovenproof casserole dish and fry the bacon and onions for 2 to 3 minutes. Add bay leaves, salt, pepper and a pinch of Nutmeg.\nCut meat into thick slices and place on the bacon and onion mixture. Add wine and beef stock, bring to a boil and simmer for 1 hour. Now add a layer of cabbage Leaves, cover tightly and simmer very gently for another hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pinto Bean Pie I",
        "ingredients": [
            "1 cup cooked pinto beans with juice ADVERTISEMENT",
            "4 eggs, room temperature ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "2 (9 inch) deep dish frozen pie crusts, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMash beans until very smooth; set aside. In a large bowl, beat eggs; mix in beans, sugar, vanilla, melted butter or margarine, and coconut until well blended. Pour filling into two pie crusts.\nBake until filling is set, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sherry and Brie Soup",
        "ingredients": [
            "6 cups chicken stock ADVERTISEMENT",
            "1/8 cup butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "12 ounces Brie cheese - rind removed, room temperature ADVERTISEMENT",
            "1/4 cup dry sherry ADVERTISEMENT",
            "1/4 cup julienned carrots ADVERTISEMENT",
            "1/4 cup julienned celery ADVERTISEMENT",
            "1/8 cup fresh sliced mushrooms ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter or margarine in 3-quart saucepan over low heat. Add flour and mix well, cooking until it just starts to turn golden. Add stock and whip vigorously, bring to boil and reduce to simmer. Skim foam off top, and continue to simmer until reduced to 2/3 its original quantity and the sauce is the consistency of heavy cream.\nStrain through fine sieve. Return sauce to pan, and cook over low heat. Add brie cheese, cook slowly, stirring occasionally, until the cheese has melted.\nAdd sherry and vegetables and simmer lightly until the vegetables are al dente. Heat heavy cream over low heat and add to soup. Season soup with salt and pepper. Garnish with fresh chives or scallion.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Oven Stew I",
        "ingredients": [
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "8 carrots, chopped ADVERTISEMENT",
            "5 potatoes, chopped ADVERTISEMENT",
            "3/4 cup tomato sauce ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "3 tablespoons tapioca ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stock pot combine meat, onion, carrots and potatoes.\nMix together tomato sauce, water, tapioca, sugar and season with salt and pepper. Pour over meat and vegetables and cover. Bake at 250 degrees F (120 degrees C) for 5 hours.\n",
        "picture_link": "nbvhmnt880RrQBGbkqh3HuJkhkTIS4K"
    },
    {
        "title": "Ripe Grape Pie",
        "ingredients": [
            "2 1/2 cups seedless grapes ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nWash fully ripened grapes. Separate the grape pulp and skins. In a sauce pan over medium heat cook grape pulp slowly until soft. Rub cooked pulp through a sieve. Combine the sieved pulp and grapes skins.\nMix the flour and sugar together and add to grape mixture. Stir in the melted butter and pour into one 9 inch unbaked pie shell. Cover top with strips of pastry. You can make a lattice pattern if desired.\nBake at 425 degrees F (220 degrees C) for about 25 minutes.\n",
        "picture_link": "CxFjdKNQzqMXpo2eQFE3/U4.iLDaihK"
    },
    {
        "title": "Lentil Frankfurter Soup",
        "ingredients": [
            "1 cup dry lentils, rinsed ADVERTISEMENT",
            "2 slices bacon, diced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped carrots ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "2 cups canned tomatoes ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "6 frankfurters, sliced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute bacon and onion.\nPlace lentils, bacon, onion, celery, carrots, water or stock, tomatoes, and bay leaf together in a large pot and simmer until tender, about 45 minutes.\nAdd sliced wieners and salt and pepper to taste, and continue cooking for about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peanut Butter Pie VII",
        "ingredients": [
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 tablespoons cornstarch ADVERTISEMENT",
            "2 cups scalded milk ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the confectioners' sugar and the peanut butter blend until thoroughly combined and light. Spread 3/4 of this mixture across the bottom of the baked pie shell.\nCombine cornstarch, 2/3 cup white sugar, salt and scalded milk. Mix well. Pour a small amount of the milk mixture over the egg yolks. Mix, then add the egg yolk mixture to the scaled milk mixture. In a saucepan over medium heat cook the egg yolk mixture until it thickens. Add the butter and the vanilla. Remove from the heat and allow to cool slightly then pour into the baked pie shell.\nBeat egg whites into soft peaks add 1/2 cup of the white sugar and continue beating until glossy and stiff. Spread meringue over top of pie. Sprinkle with the remaining peanut butter and confectioners' sugar mixture\nBake at 350 degrees F (175 degrees C) until meringue is lightly browned. Allow pie to cool before serving.\n",
        "picture_link": "9qV/d8ITQhlW588pzZ9xdt5Vz5vKJLy"
    },
    {
        "title": "Pinto Bean Pie II",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1 cup pinto beans, cooked and mashed ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together butter, sugars and eggs (slightly beaten). Add beans and nuts, mix well and pour into unbaked pie shell.\nBake at 350 degrees F (175 degrees C) for 35 to 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Root Stew",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "7 cups water ADVERTISEMENT",
            "1/2 cup baby carrots ADVERTISEMENT",
            "1 small rutabaga, chopped ADVERTISEMENT",
            "4 large potatoes, chopped ADVERTISEMENT",
            "1 small head cabbage, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine hamburger, onion, and celery in a stock pot. Cook and stir over medium heat until the meat is browned. Drain excess grease.\nStir in ketchup, water, baby carrots, rutabaga and potatoes. Bring to boil, then simmer on low heat for 20 minutes.\nMix in chopped cabbage. Simmer an additional 30 to 45 minutes, or until vegetables are tender.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grouper with Lemon White Sauce",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon lemon pepper ADVERTISEMENT",
            "4 (6 ounce) grouper fillets ADVERTISEMENT",
            "3 tablespoons clarified butter ADVERTISEMENT",
            "3 1/2 tablespoons chilled butter ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 1/2 cups hot milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, salt, pepper, and lemon pepper in bowl until well blended. Reserve 4 1/2 tablespoons of seasoned flour in a small bowl, and set aside. Rinse grouper fillets, and pat dry. Dredge grouper in the seasoned flour.\nMelt the clarified butter in a skillet over medium-high heat. Place the grouper in the skillet and cook until lightly browned and the fish is easily flaked with a fork, 2 to 4 minutes on each side. Remove from skillet, and set aside. Drain any remaining clarified butter in the skillet, and wipe clean. Add the chilled butter and lemon juice to the skillet. Cook and stir until the butter is melted. Gradually whisk in the reserved seasoned flour; cook and stir for 5 minutes. Stir in the hot milk, whisking constantly until the sauce has thickened, about 5 minutes more. Serve sauce over the grouper.\n",
        "picture_link": "1sttZdGtWhs.C8CpvlKlv95FTp1P6FS"
    },
    {
        "title": "Sweet Plantain Pie",
        "ingredients": [
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "2 ounces cooked ham, cut into small dice ADVERTISEMENT",
            "1/2 cup sofrito ADVERTISEMENT",
            "12 small pitted olives, chopped ADVERTISEMENT",
            "1 tablespoon capers, drained and chopped ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/2 cup tomato sauce ADVERTISEMENT",
            "5 large plantains ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "3/4 teaspoon white sugar ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Butter a baking dish.\nHeat the canola oil in a large skillet over medium-high heat. Cook the ground pork and cooked ham in the hot oil until the pork is completely cooked and no longer pink, 7 to 10 minutes. Remove from the skillet and set aside, reserving 2 tablespoons of the drippings in the skillet.\nReduce the heat to medium-low. Place the skillet over the heat and add the sofrito; cook and stir the sofrito for 5 minutes. Add the olives, capers, salt, garlic powder, oregano, and tomato sauce to the sofrito; cook and stir another 5 minutes. Return the ground pork and ham to the skillet and stir; simmer for 15 minutes, stirring a few times while it cooks.\nBring a pot of lightly salted water to a boil. Rinse the plantains and cut off their tips, leaving the skin on; cut each plantain into 2 to 3 segments each about 3 inches long. Cook the plantains in the boiling water until tender, about 15 minutes; drain and peel. Put the peeled plantains in a mixing bowl and mash with a potato masher. Add the softened butter and sugar; mix.\nSpread about half of the plantain mixture into the bottom of the prepared baking dish. Layer the meat mixture over the plantains. Top with the remaining plantain mixture.\nBake in the preheated oven for 15 minutes. Brush the top with the melted butter and continue baking until the top is browned, about 10 minutes more. Remove from oven and allow to rest 10 to 15 minutes before slicing to serve.\n",
        "picture_link": "zpJsgyuGwoXf1jWbodaxAGMgj898nX."
    },
    {
        "title": "Lebanese Seven Spices",
        "ingredients": [
            "1/2 cup ground black pepper ADVERTISEMENT",
            "1/2 cup ground cumin ADVERTISEMENT",
            "1/2 cup paprika ADVERTISEMENT",
            "1/4 cup ground coriander ADVERTISEMENT",
            "1/4 cup ground cloves ADVERTISEMENT",
            "4 teaspoons ground nutmeg ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons ground cardamom ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the black pepper, cumin, paprika, coriander, clove, nutmeg, cinnamon, and cardamom together until evenly blended. Store the spice mix in an airtight container.\n",
        "picture_link": "GuRz8PifWo0ygCWMNwMLEcX7lIVJSWS"
    },
    {
        "title": "Grandma Earhart's Pepper Pot Casserole",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup sliced celery ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "1 cup grated Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat the vegetable oil with butter in a large skillet over medium heat, and cook the onion, celery, and green pepper until the vegetables are tender, stirring occasionally, about 8 minutes. Mix in the pork sausage, and cook until the meat is browned, breaking it up into crumbles as it cooks, about 8 more minutes. Drain off excess grease. Stir in the tomatoes, garlic powder, basil, sage, and Worcestershire sauce, mixing until well combined.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain well in a colander set in the sink. Mix the noodles gently into the pork mixture, and place into a 9x12-inch baking dish. Sprinkle the top with Cheddar cheese.\nBake in the preheated oven until the cheese is bubbling and browned, 30 to 40 minutes.\n",
        "picture_link": "xVzjYr1IFOuiAf5cYWKcg.afowcDPJe"
    },
    {
        "title": "Apricot Chicken Curry",
        "ingredients": [
            "8 chicken drumsticks ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "4 cups apricot nectar ADVERTISEMENT",
            "1 teaspoon cornstarch, or as needed ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "3 tablespoons Madras curry powder ADVERTISEMENT",
            "1 cup dried apricots ADVERTISEMENT",
            "1 large onion, roughly chopped ADVERTISEMENT",
            "1 large green bell pepper, roughly chopped ADVERTISEMENT",
            "4 carrots, thinly sliced ADVERTISEMENT",
            "1 fresh green chile pepper, minced (optional) ADVERTISEMENT",
            "1/2 cup chopped water chestnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Season the chicken drumsticks with salt and pepper.\nHeat olive oil in a large oven-safe skillet over medium heat. Stir in garlic and red pepper flakes; cook and stir until garlic is softened and is fragrant, 1 to 2 minutes. Place the drumsticks in the skillet, and brown the chicken on all sides, about 3 minutes on each side. Transfer the skillet to the oven.\nBake the chicken drumsticks in the preheated oven until no longer pink at the bone and the juices run clear, 7 to 10 minutes.\nBring the apricot nectar to a boil in a large pot over medium-high eat, then reduce heat to medium-low. Mix cornstarch and water together in a small bowl; stir cornstarch mixture and curry powder into the apricot nectar. Add dried apricots. Transfer the baked drumsticks into the apricot mixture.\nHeat the skillet used to cook the chicken over medium heat. Stir in the onion, green bell pepper, carrots, and green chile pepper; cook and stir until the onion has softened. Pour the drumsticks and apricot sauce into the skillet. Cover and simmer until the vegetables are tender, about 10 minutes. Season with salt and pepper. Stir in water chestnuts just before serving.\n",
        "picture_link": "xEq1Ali6v5jm67dyEjji7D8I/z7h6pW"
    },
    {
        "title": "Chicken Chili Verde",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "1 pound boneless skinless chicken breast halves, cut into 1-inch pieces ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "1 (18.5 ounce) can Progresso® chicken corn chowder soup ADVERTISEMENT",
            "1 (15 ounce) can Progresso® Black Beans, drained, rinsed ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "2 tablespoons chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large 4-quart saucepan, heat oil over medium-high heat until hot. Cook onion and garlic in oil 2 to 3 minutes or until onion begins to turn translucent. Add chicken pieces, salt and pepper. Cook 3 to 5 minutes or until chicken is no longer pink in center.\nReduce heat to medium; stir in soup and beans. Simmer 5 minutes. Remove from heat; stir in lime juice and chopped cilantro.\n",
        "picture_link": "Acieiz5cZBsoZvVeilvqXvdBGMBRyA6"
    },
    {
        "title": "Chicken Salad Fit for a Dragon",
        "ingredients": [
            "2 cups cooked chicken, diced ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 large stalk celery, diced ADVERTISEMENT",
            "1/2 cup pine nuts ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 1/2 tablespoons sweet pickle relish ADVERTISEMENT",
            "1 small jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/4 teaspoon cracked black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the chicken, mayonnaise, celery, pine nuts, lemon juice, relish, jalapeno pepper, and black pepper together in a mixing bowl until evenly blended. Cover, and refrigerate 20 to 30 minutes to allow the flavors to blend.\n",
        "picture_link": "nGtjU7Ap2zbJ7qhfbEt6ndkr0xt8fpK"
    },
    {
        "title": "Mushroom and Chicken with Sour Cream Soup",
        "ingredients": [
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "1/2 teaspoon dried tarragon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 bunch green onions, lighter half chopped thin and darker green half discarded ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "2 cups chopped button mushrooms ADVERTISEMENT",
            "1 cup chopped rotisserie chicken ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "3 cubes beef bouillon ADVERTISEMENT",
            "3 1/2 cups hot water ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 1/2 teaspoons cornstarch ADVERTISEMENT",
            "1 cup cold milk ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper hot sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium heat. Stir the tarragon, nutmeg, green onions, and 2 pinches of salt into the melted butter; cook and stir until the green onions are softened, about 4 minutes. Add the mushrooms, stir to coat, and continue cooking until the mushrooms are tender, about 5 minutes more. Fold the chicken into the mixture and cook together until the chicken gets hot, about 1 minute. Sprinkle the flour over the mixture; stir until completely absorbed into the mixture, 3 to 4 minutes.\nDissolve the beef bouillon cubes in the hot water; pour into the chicken mixture about 1/2 cup at a time, stirring to dissolve any clumps of flour between batches. Increase heat to bring the mixture to a boil; return heat to medium. Stir the sour cream into the mixture until well integrated.\nDissolve the cornstarch into the cold milk; stir into the soup. Increase the heat to medium-high and cook the soup until it begins to bubble on the sides, but not boiling; again return heat to medium, stirring continually. Add the lemon juice, cayenne pepper sauce, salt, and pepper; stir. Serve hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "My Plum Crisp",
        "ingredients": [
            "1 cup rolled oats ADVERTISEMENT",
            "1 tablespoon softened butter ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "6 ripe plums, pitted and chopped ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon softened butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nMix together 1 cup of rolled oats, 1 tablespoon of butter, and 2 tablespoons of brown sugar in a bowl; press the mixture into the bottom of the prepared baking dish. Lightly toss together the plums, white sugar, flour, cinnamon, and nutmeg in another bowl. Spread the plum mixture over the crust. Mix 1 cup of oats, 2 tablespoons of brown sugar, and 1 tablespoon of butter in a bowl until well combined, and sprinkle the crumble mixture over the top of the plums.\nBake in the preheated oven until the plum filling is bubbling and the crisp topping is browned, about 35 minutes. Serve warm.\n",
        "picture_link": "/raPsCSC5JVTzmEF0Ey/NCN2yY06Sku"
    },
    {
        "title": "Pig Slop",
        "ingredients": [
            "1 (16 ounce) package kielbasa sausage, cut into half moons ADVERTISEMENT",
            "1 (28 ounce) can baked beans (such as Bush's Original®) ADVERTISEMENT",
            "1 (15.5 ounce) can chili beans, drained ADVERTISEMENT",
            "1 (15.25 ounce) can corn kernels, drained ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 (8 ounce) package shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nPlace the kielbasa, baked beans, chili beans, corn, bell pepper, and onion into a mixing bowl. Sprinkle in the chili powder and Cheddar cheese. Stir until evenly mixed, then pour into a 9x13-inch baking dish.\nBake in the preheated oven until the mixture is hot and the cheese has melted, 25 to 30 minutes.\n",
        "picture_link": "AM2lnaAvdYyfj6dl3oijpyrVh6knPGW"
    },
    {
        "title": "Plum Peach Chicken",
        "ingredients": [
            "3 plums, pitted and roughly chopped ADVERTISEMENT",
            "1 peach, pitted and roughly chopped ADVERTISEMENT",
            "1/4 cup mixed fruit and vegetable juice drink (such as Juicy Juice Harvest Surprise®) ADVERTISEMENT",
            "1 pinch crushed red pepper flakes, or to taste ADVERTISEMENT",
            "1 pinch ground paprika, or to taste ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 plum, pitted and chopped ADVERTISEMENT",
            "1 peach, pitted and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x9-inch baking dish with cooking spray.\nPlace 3 plums and 1 peach into the work bowl of a food processor with the juice drink, red pepper flakes, paprika, and cinnamon; process until smooth. Sprinkle the chicken on both sides with salt and pepper; place into the prepared baking dish. Pour about 3/4 of the fruit sauce over the chicken. Set the remaining sauce aside.\nBake the chicken in the preheated oven until the sauce has thickened and baked onto the meat, the chicken is no longer pink inside, and the juices run clear, about 50 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nPlace each chicken breast on a plate and spoon the reserved fruit sauce over the chicken. Place 1 chopped plum and 1 chopped peach into a bowl, and mix the fruit together; garnish each chicken breast with 1/3 of the chopped fruit.\n",
        "picture_link": "s8sAolYJwzmtRr9V0eqjJzb7jyEmive"
    },
    {
        "title": "Patriotic French Toast",
        "ingredients": [
            "1 (10 ounce) package frozen strawberries, thawed ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "8 thick slices bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 250 degrees F (120 degrees C).\nCombine the thawed strawberries with their juice and the blueberries in a bowl; set aside. Beat together the softened cream cheese and confectioner's sugar until smooth; set aside. Whisk the milk, eggs, vanilla, and cinnamon in a shallow bowl.\nMelt butter over medium heat in a large skillet or griddle. Dip bread into egg mixture, coating thoroughly. Cook until well-browned on both sides, about 5 minutes. Place cooked slices on baking sheet and place in oven to keep warm until ready to serve.\nSpread the cream cheese mixture over each slice of french toast, then top with 2 tablespoons of the fruit. Serve immediately.\n",
        "picture_link": "vDizmH29XDyOAstBwJDFlJIUyqKlO4a"
    },
    {
        "title": "Honey-Curry Sauce",
        "ingredients": [
            "1/3 cup melted butter ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1/4 cup yellow mustard ADVERTISEMENT",
            "fresh lemon juice ADVERTISEMENT",
            "4 teaspoons yellow curry powder ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the butter, honey, mustard, lemon juice, curry powder, and pepper together in a glass bowl; heat in microwave on High until hot, about 1 minute.\n",
        "picture_link": "5.LEqdjx0Fn14q591vfdcIqFB8/pHMC"
    },
    {
        "title": "Honey Roasted Peanuts",
        "ingredients": [
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2/3 cup brown sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 pound skinless peanuts ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix white sugar with salt until blended, and set aside. Stir the honey, brown sugar, and water together in a large pan over medium-low heat until the mixture boils and the sugar crystals have dissolved. Cook the syrup until thickened and bubbling, 10 to 15 minutes. Stir in the peanuts, remove from heat, and mix in the butter. Place the peanuts into a deep bowl, sprinkle with white sugar-salt mixture, and shake the dish to coat with sugar mixture and prevent the peanuts from sticking together. Let cool.\n",
        "picture_link": "PRz8gz7YNmra3dWV62ErBl7oZTw97V."
    },
    {
        "title": "Southwestern Lasagna",
        "ingredients": [
            "4 cups canned crushed tomatoes ADVERTISEMENT",
            "1 (7 ounce) can diced green chiles ADVERTISEMENT",
            "1 (4 ounce) can diced jalapeno peppers ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "10 sprigs fresh cilantro, chopped ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "2 pounds chorizo sausage ADVERTISEMENT",
            "1 (32 ounce) container ricotta cheese ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "1 (16 ounce) package Mexican style shredded four cheese blend ADVERTISEMENT",
            "1 (8 ounce) package no-cook lasagna noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomatoes, green chiles, jalapenos, onion, garlic, cilantro, and cumin in a large saucepan. Cook over medium heat until the mixture comes to a boil. Reduce heat to low and simmer until the onion is soft, about 45 to 60 minutes.\nMeanwhile, heat a large skillet over medium-high heat and stir in the chorizo. Cook and stir until the chorizo is crumbly, and evenly browned. Drain and discard any excess grease.\nPreheat an oven to 350 degrees F (175 degrees C). Stir together the ricotta cheese and eggs. Set aside.\nTo assemble, spread 1/3 of the tomato sauce in the bottom of a 9x13-inch baking dish. Spread the sausage over the tomato sauce. Pour 1/2 of the remaining sauce over the sausage and sprinkle 1/2 of the shredded cheese over the top of the sauce. Arrange a layer of noodles lengthwise over the cheese. Spread the ricotta cheese mixture over the noodles and place another layer of noodles over the ricotta. Top with the remaining tomato sauce and shredded cheese. Cover with foil: to prevent sticking, either spray foil with cooking spray, or make sure the foil does not touch the cheese.\nBake in a preheated oven for 30 minutes. Remove foil, and bake until the top is browned, about 15 to 30 minutes.\n",
        "picture_link": "XCEUsaJ062nCFzyemm2KU4gnhQUmmjS"
    },
    {
        "title": "Oven Roasted Hominy",
        "ingredients": [
            "1 (15.5 ounce) can white hominy, drained and rinsed ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with a sheet of aluminum foil.\nPat the rinsed hominy dry with paper towels and place into a mixing bowl. Sprinkle with garlic powder and chili powder. Drizzle with the vegetable oil, and toss until evenly coated. Spread onto the prepared pan in a single layer.\nBake in the preheated oven, stirring every 10 minutes, until the hominy is crisp and dry, 40 to 50 minutes. Allow to cool to room temperature before serving.\n",
        "picture_link": "abf6M/N6PGg/MgW.W25pjR3B54Qupci"
    },
    {
        "title": "Whiskey Mojo Marinade",
        "ingredients": [
            "1/4 cup canola oil ADVERTISEMENT",
            "4 cloves garlic, peeled and crushed ADVERTISEMENT",
            "1/2 cup whiskey (such as Jack Daniel's®) ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup lime juice ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 cup reduced-sodium soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the marinade, whisk together the canola oil, garlic, whiskey, orange juice, lime juice, cumin, and soy sauce.\nTo use the marinade, pour into a resealable plastic bag. Add up to two pounds of meat, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator at least 1 hour, preferably overnight.\n",
        "picture_link": "MPIgwo56TLQAKXXWZBfXUtzE8r5FOYO"
    },
    {
        "title": "Green Bean Casserole by Kikkoman",
        "ingredients": [
            "1 1/2 pounds fresh string beans, blanched ADVERTISEMENT",
            "5 tablespoons butter or margarine ADVERTISEMENT",
            "1 (10 ounce) package fresh mushrooms, sliced ADVERTISEMENT",
            "1/2 cup sliced onions ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 cup Kikkoman Panko Bread Crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer the blanched string beans in the bottom of a greased casserole dish. Melt butter in a large skillet. Saute the mushrooms, onion and garlic in the butter until the onions are soft. Add the Cream of Mushroom soup. Stir to combine soup and vegetables in the skillet, pour mixture over the string beans. Sprinkle with Panko Bread Crumbs. Bake at 350 degrees F for 20 minutes or until breadcrumbs are browned.\n",
        "picture_link": "Rxil1Oxwoe8v0KtWHgHPBgbyDuwdNHO"
    },
    {
        "title": "Very Green Broccoli Soup",
        "ingredients": [
            "Soup: ADVERTISEMENT",
            "1 1/2 pounds fresh broccoli ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1 tablespoon finely chopped garlic ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "1/2 cup finely chopped celery ADVERTISEMENT",
            "Gray salt ADVERTISEMENT",
            "2 teaspoons finely chopped fresh thyme leaves ADVERTISEMENT",
            "5 cups Progresso® chicken broth ADVERTISEMENT",
            "2 cups packed fresh spinach leaves ADVERTISEMENT",
            "2 teaspoons freshly grated lemon peel ADVERTISEMENT",
            "1 cup whipping cream or buttermilk (if using buttermilk, use half the lemon peel) ADVERTISEMENT",
            "Freshly ground pepper ADVERTISEMENT",
            "Gremolata: ADVERTISEMENT",
            "1/4 cup Progresso® panko crispy bread crumbs ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons pine nuts, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut broccoli florets from stems. Peel tough outer skin from stems; trim off fibrous ends. Cut stems into 1/2-inch pieces.\nIn 4-quart Dutch oven, heat oil and butter over medium-high heat until butter is melted. Add garlic; cook, stirring occasionally, until light brown. Stir in onion and celery; season with salt. Reduce heat to medium-low; cook about 10 minutes, stirring occasionally, until vegetables are tender.\nMeanwhile, in small bowl, stir together gremolata ingredients; set aside.\nStir thyme, broccoli stems and broth into soup. Heat to boiling. Cook uncovered over medium heat about 3 minutes. Stir in broccoli florets; cook about 7 minutes, stirring occasionally, until broccoli is very tender. Stir in spinach and lemon peel (spinach will wilt).\nIn blender, cover and puree soup in small batches. (At this point, soup can be covered and refrigerated up to 1 day or frozen up to 1 month.) Return soup to Dutch oven; reheat over medium-low heat. Stir in cream; season to taste with additional salt and the pepper.\nLadle soup into warm individual soup bowls. Sprinkle 1 tablespoon gremolata onto each serving. Pass remaining gremolata at table.\n",
        "picture_link": "byT2UkoDscP2YAcXCKLqJYli1NkiAqi"
    },
    {
        "title": "Poached Chicken Breast",
        "ingredients": [
            "1 (32 fluid ounce) container chicken stock ADVERTISEMENT",
            "32 fluid ounces water, or more if needed ADVERTISEMENT",
            "1 yellow onion, peeled and slits cut into it ADVERTISEMENT",
            "1 bunch celery, stalks (including leaves) separated ADVERTISEMENT",
            "3 carrots ADVERTISEMENT",
            "2 tablespoons tomato paste, or more to taste ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "5 whole black peppercorns ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast halves, each cut in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken stock, water, yellow onion, celery, carrots, tomato paste, salt, peppercorns, and bay leaf in a large pot; bring to a gentle simmer. Decrease heat to medium-low and simmer, checking the flavor occasionally, until vegetables are slightly tender, 30 to 45 minutes.\nBring stock to a boil and add chicken, pouring in more water if chicken isn't completely covered in liquid. Bring poaching liquid to a boil; remove pot from heat and cover tightly with a lid until chicken is no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "qvZ7TwCXuS3hx4SJvNR6ebXFGa2Hbou"
    },
    {
        "title": "Red Beans and Rice from Hillshire Farm®",
        "ingredients": [
            "1 (14 ounce) package Hillshire Farm® Smoked Sausage ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, seeded, chopped ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 (15.5 ounce) cans kidney beans, rinsed, drained ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 teaspoons hot pepper sauce, or to taste ADVERTISEMENT",
            "Hot cooked long-grain white rice ADVERTISEMENT",
            "Chopped fresh parsley (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut sausage into 1/2-inch slices. Heat a 5 to 6-quart pan over medium-high heat for 3 minutes. Add sausage, onion, green pepper, celery and garlic; cook, stirring occasionally, 5-6 minutes or until vegetables are tender.\nStir in kidney beans, chicken broth, oregano, thyme and bay leaf. Bring to a boil; reduce heat to medium and cook 12-15 minutes or until slightly thickened. Add hot sauce to taste.\nRemove bay leaf and serve over hot cooked rice. Sprinkle with chopped parsley if desired.\n",
        "picture_link": "KimayInzuC1g0JclX/4Z8GXBhyMqi4G"
    },
    {
        "title": "Sarah's Delicious Bouillabaisse",
        "ingredients": [
            "2 tablespoons grapeseed oil or olive oil, divided ADVERTISEMENT",
            "1/2 sweet onion, diced ADVERTISEMENT",
            "2 garlic cloves, crushed ADVERTISEMENT",
            "1/4 teaspoon saffron threads ADVERTISEMENT",
            "1/4 teaspoon fennel seed ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1 (24 ounce) jar Classico® Tomato and Basil Sauce ADVERTISEMENT",
            "3 cups seafood stock ADVERTISEMENT",
            "1/2 teaspoon salt, divided ADVERTISEMENT",
            "12 ounces cod (or other lean white-fleshed fish fillets), cut into bite-size pieces ADVERTISEMENT",
            "1/4 teaspoon crushed rosemary ADVERTISEMENT",
            "1/4 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "1/2 pound shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon of the oil in a Dutch oven over medium-low heat. Add the onion and garlic and cook, stirring occasionally, until the onion is soft but not browned, about 5 minutes.\nCrumble in the saffron; add the fennel seeds and the red pepper flakes. Cook for 1 minute.\nAdd the Classico sauce, seafood stock and 1/4 teaspoon of the salt. Bring to a boil; reduce the heat to low and simmer until the onion is tender, about 20 minutes.\nPlace the fish in a bowl and sprinkle with the remaining 1/4 teaspoon salt and the rosemary, thyme, and marjoram. Add the shrimp and the remaining tablespoon oil. Toss gently to coat.\nPlace the fish and shrimp into the tomato base mixture. Cook over medium-low heat until the shrimp is opaque throughout and the fish begins to flake apart, about 5 minutes.\n",
        "picture_link": "HgyHEazdPu9ElBqMeiHTypK/kMwf3iK"
    },
    {
        "title": "Roasted Asparagus with Sea Salt and Parmesan",
        "ingredients": [
            "1 pound asparagus spears, trimmed and cut into 1 1/2-inch pieces ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon Diamond Crystal® Coarse Sea Salt ADVERTISEMENT",
            "1 lemon, finely zested and juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace asparagus pieces in large bowl. Add Parmesan cheese, butter, garlic, black pepper, Diamond Crystal(R) Coarse Sea Salt, lemon juice, and lemon zest. Toss to coat evenly.\nTransfer asparagus to baking dish in a single layer. Bake until asparagus is tender and beginning to brown, stirring occasionally, about 15 minutes.\n",
        "picture_link": "KggjlBQbSIygmYioEIygekZzckYsR72"
    },
    {
        "title": "Beefy Italian Ramen Skillet",
        "ingredients": [
            "1 pound ground beef, or to taste ADVERTISEMENT",
            "16 slices pepperoni, or to taste ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 (3 ounce) packages beef-flavored ramen noodles ADVERTISEMENT",
            "1 green bell peppers, cut into strips ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef and pepperoni slices in the hot skillet until beef is completely browned, 5 to 7 minutes. Stir tomatoes, water, and the seasoning packet contents from the ramen noodles into the beef mixture.\nBreak ramen noodle blocks into halves and add to beef mixture with the green bell pepper; cook until the noodles soften, about 5 minutes.\nRemove skillet from heat, sprinkle mozzarella cheese over the beef mixture, and place a cover on the skillet; let mixture sit until cheese melts, 2 to 3 minutes.\n",
        "picture_link": "LfqSQMTwuYyXtLeJLDMyY.dEewOAJW2"
    },
    {
        "title": "Slow Cooker Jambalaya (Vegan)",
        "ingredients": [
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "8 ounces seitan, cut into cubes ADVERTISEMENT",
            "8 ounces smoked vegan sausage, cut into 2-inch slices ADVERTISEMENT",
            "1/2 large onion, chopped ADVERTISEMENT",
            "1/2 large green bell pepper, seeded and chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon miso paste ADVERTISEMENT",
            "1 1/2 teaspoons Cajun seasoning ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 cup rice ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drizzle the bottom of a 4-quart slow cooker crock with olive oil. Stir tomatoes with juice, seitan, sausage, onion, green bell pepper, celery, vegetable broth, garlic, miso paste, Cajun seasoning, thyme, and oregano into crock.\nCook on Low for 4 hours. Add rice to the crock and cook on High until rice is cooked through, about 30 minutes more. Garnish with parsley.\n",
        "picture_link": "3D4fVMfjp0J2P8gr2UtTsM0H4dHjlIa"
    },
    {
        "title": "Smoky BBQ Wings",
        "ingredients": [
            "3 1/2 pounds chicken wings ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1/4 cup TABASCO® brand Chipotle Pepper Sauce ADVERTISEMENT",
            "4 cloves garlic, grated ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove tips from chicken wings and discard. Combine remaining ingredients in a bowl and stir until smooth, and divide the mixture in half.\nPut the chicken and half of the sauce in a resealable plastic bag, shake to coat well and place in the refrigerator from 3 hours to overnight. Reserve the remaining sauce in the refrigerator until ready to serve with wings.\nPreheat oven to 350 degrees F. Remove the chicken from the marinade and place skin side down, in a shallow baking dish. Discard marinade.\nBake for 50 minutes, flipping over half way through baking. Increase heat to broil and broil wings until crisped, about 3 minutes. Serve immediately with reserved dipping sauce.\n",
        "picture_link": "YhPsyaTH.JSsXjQJV7UV1tYtMjx9o8G"
    },
    {
        "title": "Butterscotch Cheesecake Bars",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (11 ounce) package butterscotch chips ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk (such as Eagle Brand®) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nHeat butterscotch chips and butter together in a saucepan, stirring frequently, over low heat until melted, about 5 minutes. Remove saucepan from heat and stir graham cracker crumbs into butterscotch mixture. Measure 2/3 cup graham cracker-butterscotch mixture and set aside; press remaining mixture into the prepared baking dish to form a crust.\nBeat cream cheese in a bowl using an electric mixer until light and fluffy. Add sweetened condensed milk, egg, and vanilla extract; mix well. Pour cream cheese mixture over crust. Sprinkle reserved graham cracker-butterscotch mixture over cream cheese mixture layer.\nBake in the preheated oven until a knife inserted in the center comes out clean, 25 to 30 minutes.\n",
        "picture_link": "RXIuRJRmjOdwbZ0eHCOclrIePl9wCTi"
    },
    {
        "title": "Chef John's Rustic Italian Corn Bread ",
        "ingredients": [
            "1 cup warm water ADVERTISEMENT",
            "1/2 cup bread flour ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/8 teaspoon white sugar ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "2 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 cups bread flour, or as needed ADVERTISEMENT",
            "1 tablespoon cornmeal, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir warm water, 1/2 cup bread flour, yeast, and sugar together in a bowl. Let stand until the yeast softens and forms a creamy mixture, about 40 minutes.\nMix 1/2 cup cornmeal, olive oil, and salt into yeast mixture. Gradually add bread flour to yeast mixture until a dough pulls together.\nKnead dough on a lightly floured work surface until smooth and elastic, 10 to 12 minutes. Place dough in a large, lightly-oiled bowl and turn to coat. Cover with a damp towel and let rise in a warm place until doubled in volume, about 2 hours.\nTurn dough out onto a lightly floured surface and roll into a 14-inch wide rectangle. Roll dough, starting from the long-end, into a loaf, finishing seam-side down.\nDust a baking sheet with 1 tablespoon cornmeal. Place loaf on baking sheet, cover with a dry towel, and let rise until doubled, about 1 hour.\nPreheat oven to 425 degrees F (220 degrees C). Place a shallow pan of water on the lower rack of the oven.\nCut a 1/2-inch deep slash down the center of the loaf.\nBake in preheated oven until the top is golden brown and the bottom of loaf sounds hollow when tapped, 35 to 40 minutes. Cool on a wire rack.\n",
        "picture_link": "BuUdRN0W7AfJdpvhQdkZb4MHDMcLQHe"
    },
    {
        "title": "Salisbury Steak Slow Cooker-Style",
        "ingredients": [
            "2 1/2 pounds extra lean ground beef ADVERTISEMENT",
            "3/4 cup finely chopped onion ADVERTISEMENT",
            "3/4 cup finely chopped celery ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup finely chopped mushrooms ADVERTISEMENT",
            "1/2 cup Italian-seasoned panko (Japanese bread crumbs) ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons whole wheat flour ADVERTISEMENT",
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 (4 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1/2 onion, thinly sliced ADVERTISEMENT",
            "2 (10.75 ounce) cans reduced-fat, reduced-sodium cream of mushroom soup (such as Campbell's® Healthy Request) ADVERTISEMENT",
            "3/4 cup low-sodium beef broth ADVERTISEMENT",
            "2 tablespoons low-sodium Worcestershire sauce ADVERTISEMENT",
            "1 (1 ounce) packet dry onion gravy mix ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground beef, chopped onion, celery, milk, chopped mushrooms, and panko together in a large bowl; shape into 10 patties.\nMix all-purpose and whole wheat flours together in a wide, shallow bowl. Dredge patties in the flour mixture just to coat and move to a platter, taking care to not stack the patties.\nHeat 2 tablespoons oil in a large skillet over medium-high heat. Cook patties in hot oil until browned, 3 to 5 minutes per side. Arrange browned patties in a slow cooker crock.\nHeat remaining oil in a small skillet over medium heat. Cook and stir sliced mushrooms and sliced onion in hot oil until tender, about 5 minutes.\nStir cooked mushroom and onion mixture with cream of mushroom soup, beef broth, Worcestershire sauce, onion gravy mix, and black pepper together in a bowl until smooth; pour over the beef patties in the slow cooker.\nCook on High until patties are very firm, hot, and grey in the center, 3 to 3 1/2 hours (or on Low for 4 to 5 hours). An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\n",
        "picture_link": "Dr.DnWdtpyvAJnp/gFlGEAvHgYgP7uy"
    },
    {
        "title": "Avocado Chicken Spread",
        "ingredients": [
            "1 avocado - peeled, pitted, and mashed ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "1/2 cup chopped cooked chicken ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix avocado, onion, chicken, lime juice, garlic powder, salt, and pepper together in a bowl.\n",
        "picture_link": "BBAPMCSGAg8xJ7lHduXi2GPjAiwGrQq"
    },
    {
        "title": "Dill Veggie Dip",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup light sour cream ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried dill ADVERTISEMENT",
            "salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mayonnaise, sour cream, dried minced onion, parsley, and dill together in a bowl; season with salt and pepper.\nCover bowl with plastic wrap and refrigerate until the onion re-hydrates, about 30 minutes.\n",
        "picture_link": "E/SwpNtQljwz1KTgBni51Kk/XY6aIP."
    },
    {
        "title": "Chef John's Grilled Lamb Steaks ",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "1 bunch fresh tarragon leaves, torn ADVERTISEMENT",
            "1/2 bunch fresh mint leaves, torn ADVERTISEMENT",
            "2 tablespoons plain yogurt ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "4 center-cut lamb leg steaks, 1 1/2-inch thick ADVERTISEMENT",
            "Vinaigrette: ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 tablespoons sherry vinegar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh mint ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk tarragon, 1/2 bunch mint, yogurt, 1 tablespoon olive oil, garlic, cumin, and 1 teaspoon black pepper together in a bowl; pour marinade into a resealable plastic bag. Add lamb steaks, coat with marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator, 8 hours to overnight.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nWhisk 1/4 cup olive oil, sherry vinegar, honey, salt, and pepper together in a bowl. Add 2 tablespoons chopped mint and stir to combine vinaigrette.\nRemove steaks from marinade and scrape off all herbs and garlic; discard marinade. Drizzle steaks with 1 tablespoon olive oil and season with salt and pepper.\nCook steaks on the preheated grill until browned on the outside and slightly pink in the center, about 6 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Transfer steaks to a plate, drizzle 1/2 of the vinaigrette over the steaks, cover the steaks with foil, and let rest for 10 minutes. Transfer steaks to individual plates and drizzle remaining vinaigrette over each.\n",
        "picture_link": "yvMBG9OmuX2Zr2Z.jRHAakIYzP0gw/."
    },
    {
        "title": "Uncle Monkey Smoothie",
        "ingredients": [
            "2 bananas, cut into small chunks ADVERTISEMENT",
            "1/4 cup vanilla yogurt ADVERTISEMENT",
            "5 ice cubes ADVERTISEMENT",
            "3 tablespoons peanut butter ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend bananas, yogurt, ice cubes, peanut butter, milk, and sugar together in a blender until smooth.\n",
        "picture_link": "kZtdjgW6VvReVlVLvMCir/7RRcMX/Nm"
    },
    {
        "title": "Bed and Breakfast Baked Oatmeal ",
        "ingredients": [
            "1 cup oatmeal ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 egg, or more to taste ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "1/4 cup chopped nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nMix oatmeal, baking powder, and sugar together in a large bowl. Beat milk and egg together in a separate bowl; add to oatmeal mixture and stir to incorporate. Stir cranberries, coconut, and nuts into the oatmeal mixture; spread into the prepared baking dish.\nBake in preheated oven until beginning to brown along the edges, 50 to 60 minutes.\n",
        "picture_link": "LotoRhkPHuEKFYFwA9LtS/ZyVZG2Yl6"
    },
    {
        "title": "Easy Crustless Quiche",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "1 pound sausage ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 pound shredded Cheddar cheese ADVERTISEMENT",
            "3 cups heavy whipping cream ADVERTISEMENT",
            "8 large eggs ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook and stir bacon and sausage in a large skillet and over medium-high heat until evenly browned and bacon is crisp, about 10 minutes; drain on a paper towel-lined plate.\nBrush butter on the bottom and sides of a 9x13-inch baking dish. Sprinkle Parmesan cheese into the bottom of the baking dish and top with bacon and sausage. Spread Cheddar cheese over bacon and sausage.\nBeat cream, eggs, and half-and-half together in a bowl. Slowly pour egg mixture over cheese and sausage into the baking dish.\nBake in the preheated oven until a knife inserted into the center of the quiche comes out clean, about 1 hour. Cool for 10 minutes before slicing.\n",
        "picture_link": "mPkK.mD7JMPrxIGpmqAsXYAgzQE8oiq"
    },
    {
        "title": "Grands!® Cheesy BBQ Cups",
        "ingredients": [
            "1 pound lean (at least 80%) ground beef, cooked, drained ADVERTISEMENT",
            "3/4 cup barbeque sauce ADVERTISEMENT",
            "1 (10.2 ounce) can Pillsbury® Grands!® Flaky Layers refrigerated biscuits ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In 10-inch nonstick skillet, mix cooked beef and barbecue sauce. Heat over medium-high heat, stirring constantly, until hot.\nPull each biscuit apart into 2 layers; press each into 4-inch round. Place 1 round in each of 8 greased regular-size muffin cups. Firmly press in bottom and up side, forming 1/4-inch rim. Fill with beef mixture; sprinkle with cheese.\nBake at 375 degrees F 13 to 15 minutes or until edges of biscuits are golden brown. Cool 1 minute; remove from pan.\n",
        "picture_link": "IW4hj38wFHReRAi2cukGBuDhWWPSeBG"
    },
    {
        "title": "Creamy Tomato Soup (No Cream)",
        "ingredients": [
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "4 cups canned tomatoes ADVERTISEMENT",
            "3 slices bread, cubed ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a Dutch oven or heavy stockpot over medium-low heat; cook and stir onion and garlic in hot oil until tender, about 5 minutes. Add tomatoes to onion mixture, crushing with a potato masher. Stir bread, basil, and brown sugar into tomato mixture and simmer until bread is completely saturated and starts to break down, about 10 minutes.\nPour tomato mixture into a blender no more than half full; add butter. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Return pureed soup to Dutch oven over medium heat; add broth and simmer until heated through, about 5 minutes. Season soup with salt and pepper.\n",
        "picture_link": "YQoQGztmsJEWga3QGoAniHaV5woZx3O"
    },
    {
        "title": "Sausage Mushroom Pizza",
        "ingredients": [
            "2 tablespoons cornmeal ADVERTISEMENT",
            "2 pounds frozen pizza dough, thawed or Whole Wheat Sesame Dough (below) ADVERTISEMENT",
            "1/2 cup pizza sauce ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper ADVERTISEMENT",
            "8 ounces bulk Italian sausage, cooked and drained ADVERTISEMENT",
            "1 cup thinly sliced fresh mushrooms ADVERTISEMENT",
            "8 ounces shredded Italian cheese blend ADVERTISEMENT",
            "Grated Parmesan cheese (optional) ADVERTISEMENT",
            "Snipped fresh basil (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F. Cover two large baking sheets with Reynolds Wrap(R) Heavy Duty Aluminum Foil. Sprinkle with cornmeal.\nDivide Whole Wheat Sesame Seed Dough or thawed pizza dough into 8 equal portions. Cover and let rest for 10 minutes.\nRoll each portion of dough on a lightly floured surface into a 6-inch circle. Transfer to prepared baking sheets. Prick the crusts with a fork. Do not let rise.\nBake about 7 minutes or until light brown. In a small bowl, combine pizza sauce and crushed red pepper. Top each crust with pizza sauce, then with sausage and mushrooms. Sprinkle with Italian blend cheese. Bake 5 minutes more or until cheese melts. If desired, sprinkle with Parmesan cheese and/or fresh basil.\nGrilling: Line grill rack with heavy duty aluminum foil. Preheat grill; reduce heat to medium-hot. Brush tops of dough circles with 1 tablespoon olive oil. Place dough circles, oiled sides down, on foil-lined grill rack. Cover and grill about 1 minute or until bottom is browned and firm. Transfer dough circles to a clean surface, grilled side up. Top pizzas as directed above. Return assembled pizzas to the foil-lined grill rack. Cover and grill 2 to 3 minutes or until bottom is browned and cheese has melted, rearranging pizzas as necessary to assure even browning.\n",
        "picture_link": "aNCK6HCPBAeeBsJyvoVJsA4Ji4syh/u"
    },
    {
        "title": "Cinnamon Apples",
        "ingredients": [
            "2 apples, diced ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place apples in a microwave-safe bowl; heat in microwave for 30 seconds. Sprinkle sugar and cinnamon over apples and stir to coat. Heat apples in microwave until soft and warm, about 1 minute more.\n",
        "picture_link": "pma2XPCfc/sg.6EQFI1Bz9KQKFHFva6"
    },
    {
        "title": "After Thanksgiving Casserole",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1 (8 ounce) package bread stuffing cubes ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "2 cups turkey gravy ADVERTISEMENT",
            "2 cups chopped cooked turkey ADVERTISEMENT",
            "1 (15 ounce) can cream-style corn ADVERTISEMENT",
            "3 cups mashed potatoes ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat butter in an oven-proof skillet over medium heat; cook and stir celery and onion in the hot butter until onion is softened, about 10 minutes. Add bread cubes and chicken broth; stir to combine.\nMix gravy and turkey together in a bowl; spoon over stuffing mixture. Layer corn atop turkey gravy. Spread mashed potatoes over corn layer.\nBake casserole in the preheated oven until heated through, 20 minutes. Sprinkle with Cheddar cheese; return to oven. Bake until cheese is melted, about 10 minutes.\n",
        "picture_link": "cNcuGoM./rZ32U3um1rwryihrhW8Aka"
    },
    {
        "title": "Honey Glazed Carrots and Pears",
        "ingredients": [
            "3 Anjou pears, peeled and cut into chunks ADVERTISEMENT",
            "3 pounds carrots, peeled and sliced ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add pears; cover and steam until tender, 5 to 10 minutes. Transfer pears to a bowl. Add carrots to steamer, cover, and cook until tender, about 10 minutes; add carrots to bowl with pears.\nHeat butter in a saucepan over medium heat; stir in brown sugar, honey, cinnamon, and nutmeg. Bring to a simmer, stirring occasionally, until sugar has melted and glaze is slightly reduced, 5 to 10 minutes.\nPour glaze over pears and carrots; toss to coat. Remove pears and carrots with a slotted spoon and transfer to a serving dish; sprinkle with parsley.\n",
        "picture_link": "ze/d8nIrQGOKYu3BhYGKsh.z9T55FDa"
    },
    {
        "title": "Bacon Sweet Potato Cornbread",
        "ingredients": [
            "5 slices bacon ADVERTISEMENT",
            "1 1/4 cups cornmeal ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup mashed cooked sweet potato ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nCook and stir bacon in a 9-inch cast-iron skillet over medium-high heat until browned, about 10 minutes. Remove and chop bacon, leaving 1 tablespoon of bacon drippings in skillet.\nWhisk cornmeal, salt, and baking soda in a bowl. Stir sweet potato, buttermilk, and eggs together in a separate bowl until thoroughly combined. Stir sweet potato mixture into dry ingredients and mix chopped bacon into batter. Pour batter into the cast-iron skillet.\nBake corn bread in the preheated oven until browned and bread feels firm to the touch, about 30 minutes. Turn corn bread onto a serving plate and cut into wedges for serving.\n",
        "picture_link": "bae5VCEJPMfdbpqXW9RKYxTrnnLgRJy"
    },
    {
        "title": "Bracciole (Flank Steak Rolls)",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 hard-boiled egg, chopped ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "1 tablespoon olive oil, or more if needed ADVERTISEMENT",
            "2 pounds flank steak, pounded until thin ADVERTISEMENT",
            "5 toothpicks, or as needed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 tomato, chopped, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a large skillet over medium heat; cook and stir onion in the hot oil until tender, about 10 minutes. Season with 1 teaspoon salt and 1 teaspoon pepper.\nMix parsley, garlic, Parmesan cheese, egg, 1 pinch salt, and 1 pinch pepper in a bowl; drizzle in about 1 tablespoon olive oil, while continually stirring, until a sticky consistency is reached.\nSpread parsley filling in a thin layer atop flank steak; roll steak in a jelly-roll style and fasten ending piece to steak with toothpicks to contain filling.\nPour remaining 1 tablespoon olive oil into skillet with onions over medium heat; cook steak roll in the onion mixture, turning steak until browned on all sides, 2 to 3 minutes per side. Add tomato sauce, sugar, and chopped tomato to the steak mixture; simmer over very low heat until steak is cooked through and sauce has slightly reduced, 1 to 1 1/2 hours.\n",
        "picture_link": "hpqx0zDlprAGlIXLUEqzFKBVC87rC.."
    },
    {
        "title": "Mango Habanero Salsa",
        "ingredients": [
            "1 habanero pepper ADVERTISEMENT",
            "1/2 mango - peeled, seeded, and cubed ADVERTISEMENT",
            "1/3 large sweet onion, cut into 1/2-inch slices ADVERTISEMENT",
            "1 tablespoon vegetable oil, or more as needed ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1/4 cup fresh cilantro, or to taste ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 pinch ground cumin, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace habanero pepper, mango, and onion on a baking sheet. Drizzle with olive oil; toss to coat evenly.\nRoast on the middle rack of the preheated oven for 10 minutes. Turn on the oven's broiler and roast for 5 more minutes. Move baking pan to the oven's top shelf; broil until onion and mango begin to brown and habanero pepper blisters, about 3 more minutes. Remove and slightly cool.\nWearing gloves, remove stem from habanero pepper and place pepper in a small food processor or blender; add mango, onion, garlic, cilantro, lime juice, and salt. Season with black pepper and cumin. Pulse until salsa is combined and slightly chunky. Refrigerate for 2 hours before serving for flavors to blend.\n",
        "picture_link": "GMsiCZmEK0GEsi6MSipXnrsTyi89e9K"
    },
    {
        "title": "Gluten-Free Casserole",
        "ingredients": [
            "8 cups water ADVERTISEMENT",
            "2 cups green beans, chopped ADVERTISEMENT",
            "1 teaspoon extra-virgin olive oil ADVERTISEMENT",
            "1 small onion, chopped fine ADVERTISEMENT",
            "1 1/2 pounds ground turkey ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "2 teaspoons chopped fresh thyme ADVERTISEMENT",
            "1 cup frozen peas ADVERTISEMENT",
            "1 cup mushrooms, chopped ADVERTISEMENT",
            "2 zucchini, chopped ADVERTISEMENT",
            "2 cups crushed tomatoes ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "2 tablespoons freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a large pot. Cook green beans at a boil until just softened, about 3 minutes; drain.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large skillet over medium-low heat. Cook and stir onion in hot oil until translucent, 3 to 5 minutes.\nCrumble ground turkey into the skillet and increase heat to medium-high. Season turkey generously with salt and pepper; cook and stir until the turkey is completely browned, 7 to 10 minutes. Reduce heat to medium. Stir garlic, basil, and thyme through the turkey mixture; cook, stirring occasionally, another 3 minutes.\nRemove turkey mixture from skillet with a slotted spoon and transfer to a 9x13-inch casserole dish. Reserve 2 tablespoons of the pan drippings for later use and discard remainder.\nHeat the reserved pan drippings in the skillet over medium heat. Stir green beans, peas, mushrooms, and zucchini into the hot pan drippings; season with salt and black pepper. Cook and stir vegetable mixture until hot, about 5 minutes; add to casserole dish and stir to combine. Pour crushed tomatoes over the turkey and vegetable mixture. Top with a layer of mozzarella cheese. Sprinkle Parmesan cheese over the mozzarella cheese.\nBake in preheated oven until the cheese is melted and vegetables are tender, about 20 minutes. Rest dish 10 minutes before serving.\n",
        "picture_link": "bT4a0tWeE7oDfJMf8AjpcamLC1HVyxK"
    }
]