[
    {
        "title": "Butterscotch Filling",
        "ingredients": [
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the brown sugar, corn starch, salt, and water in a small saucepan. Bring mixture to a boil, and stir constantly for 1 minute. Remove from heat, and add the butter or margarine.\nAllow the mixture to cool slightly, and spread between layers.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Banana Cake IV",
        "ingredients": [
            "1 1/8 cups butter ADVERTISEMENT",
            "1 1/2 cups self-rising flour ADVERTISEMENT",
            "2 ripe bananas, mashed ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1/4 teaspoon banana extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 x 5 inch loaf tin well.\nBeat the egg whites until very stiff.\nCream butter or margarine and sugar until light and fluffy. Beat the egg yolks with the banana essence and the milk; stir into creamed mixture. Fold in bananas and walnuts. Sift the flour, and fold into the creamed mixture. Carefully fold in the egg whites. Pour batter into the prepared tin.\nBake for 40 to 50 minutes. Turn out onto a wire rack, and cool. Slice and serve.\n",
        "picture_link": "zmTp6Hoqs4TtEapqEWW7dXb/YVuaQZe"
    },
    {
        "title": "Yum Yum Cake I",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2/3 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup reserved pineapple juice ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "10 maraschino cherries, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C), grease and lightly flour a 9x13 inch pan.\nIn a small bowl, mix flour, baking powder and salt. Set aside.\nBeat shortening for 30 seconds, add sugar, lemon and orange zest and beat until light and fluffy. Add eggs one at a time, beating well after each. Add pudding mix. Add flour mixture, alternating with milk and juices beating well after each addition.\nPour into pan. Bake at 350 degrees F (175 degrees C) for 30 to 45 or until toothpick inserted into center of cake comes out clean. Cool in pan.\nTo make the topping: Mix vanilla pudding with milk and set aside. Beat cream cheese until smooth, add cool whip, then pudding and mix on lowest speed until well combined. Spread on top of cooled cake. arrange pineapples and cherries on top.\n",
        "picture_link": ".9la6aowAAfmm.Eu.zLhXpqKKFuFKku"
    },
    {
        "title": "Butterfly Buns",
        "ingredients": [
            "1 cup self-rising flour ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon hot water ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons cherry jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven 350 F (175 degrees C). Line a 12-cup-muffin-pan with paper baking cups.\nCream 1/4 cup butter or margarine and white sugar together until pale yellow and fluffy. Gradually add small amounts of beaten egg, beating continuously. In a small bowl, combine cocoa powder and hot water. Stir cocoa mixture into batter. Fold in flour using figure eight movement. If the mixture is too stiff, batter should slowly drop off spoon when lifted from bowl, add a small amount of water. Divide mixture into 12 muffin cups.\nBake for 15 to 20 minutes, or until well risen and firm to touch. Allow to cool.\nCream 1/4 cup butter or margarine until soft. Gradually add sifted confectioners sugar and vanilla extract. Mix cream filling until smooth.\nCut circles from tops of muffins, and halve these to resemble butterfly wings. Put a small amount of cherry jam in the cut out hole, and cover with a teaspoon of cream filling. Place the wing shapes into the cream filling curved side down.\n",
        "picture_link": "RE13UnOXUfnn5mxXT8JBTCGWZltCDc."
    },
    {
        "title": "Bride's Cake",
        "ingredients": [
            "1 1/2 pounds butter ADVERTISEMENT",
            "5 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/8 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon ground mace ADVERTISEMENT",
            "4 1/2 tablespoons lemon juice ADVERTISEMENT",
            "4 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 tablespoons vanilla extract ADVERTISEMENT",
            "15 eggs ADVERTISEMENT",
            "3/8 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease and flour three round tube pans, one 10 inch, one 8 inch, and one 5 inch.\nSift the flour, baking soda, ground mace, and 2 1/4 cups of the sugar into a large bowl.\nUsing your hands, rub in the butter into the flour mixture.\nSeparate the eggs. Add the lemon juice and the vanilla to the egg yolks and beat well. Add the egg yolk mixture a little at a time to the flour mixture using your hands to combine the ingredients.\nIn a large bowl whip the egg whites with the salt and the cream of tartar until stiff. Gradually beat in the remaining 2 1/4 cups of the sugar till the whites are very stiff and glossy. Fold in the beaten egg whites into the batter in four portions, folding in very gently with your hands until no white lumps are visible. Spoon batter into the prepared pans.\nBake at 300 degrees F (150 degrees C) for 2 1/2 hours for the 10 inch pan, 2 1/4 hours for the 8 inch pan, and 1 1/2 hours for the 5 inch pan. Cakes are done when they shrink from the sides of the pans. Remove the 5 inch cake from the oven and let stand in pan for one hour before turning out. When the 8 inch cake is done turn off the oven and let it stand for 1/2 hour more in oven, remove it then 15 minutes later remove the 10 inch cake. Let the 8 and 10 inch cakes stand on cooling rack for 1/2 hour before turning out. Allow cakes to cool overnight before frosting. If the cake tiers are to be separated by pillars, the holes left by the tube pans may be covered by rounds of cardboard before they are iced. Use Decorator Frosting and decorate as desired.\n",
        "picture_link": "gjaMWo6Hc94zXKdn8XGSU0KpU4R8kAy"
    },
    {
        "title": "Honey Comb Coffee Cake",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1/2 teaspoon orange extract ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1/2 teaspoon orange extract ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C); grease and flour a 9 inch square baking pan.\nCombine flour, 1/2 cup sugar, 1/2 cup butter or margarine, 1/3 cup milk, eggs, baking powder, 1/2 teaspoon orange extract , and almond extract until well mixed. Spread batter into prepared pan.\nTo Make Topping: In a heavy 2 quart saucepan combine 1/2 cup butter or margarine, pecans, 1/4 cup sugar, honey, nutmeg, 1 tablespoon milk, and 1/2 teaspoon orange extract. Cook over medium heat, stirring occasionally, until mixture comes to a full boil . Continue cooking, stirring occasionally, for 2 or 3 minutes. Pour topping evenly over coffee cake.\nBake 22 to 27 minutes, or until wooden pick inserted in center comes out clean.\n",
        "picture_link": "vdaycHv6FBk6.Wu7hXsRYaJbMjIOiqW"
    },
    {
        "title": "White Velvet Cake I",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 fresh coconut ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, sift 2 1/2 cups flour, baking powder, and salt together and set aside.\nBlend shortening and 1 1/2 cups sugar. Mix in the flour mixture. Add 3/4 cup milk; beat for 2 minutes. Add egg whites, 1 teaspoon vanilla and 1/4 cup milk. Beat well.\nGrease and flour two 9 inch round pans. Pour the batter into the pans.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes. Cool cake layers on a wire rack.\nRemove the meat from the coconut and shred it.\nTo Make Frosting: Moisten 1 tablespoon flour with a small amount of water to make a paste. Combine 1 cup milk, coconut milk, 1 cup sugar, 1 teaspoon vanilla, and shredded coconut in a saucepan. Mix in flour paste, and cook for 10 minutes. Cool the frosting, and spread over cake.\n",
        "picture_link": "4vjxVKvKPEjw8LsfNjWTmvdpxPkE/ui"
    },
    {
        "title": "Chocolate Custard Cake",
        "ingredients": [
            "3 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "1 3/4 cups cake flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine chocolate, 1/2 cup milk, brown sugar, and egg yolks. Cook over low heat, stirring constantly, until custard is thick and smooth. Cool.\nStir together flour, soda, baking powder, and salt.\nIn a large bowl, cream butter or margarine. Blend in white sugar, beating until light and fluffy. Mix together 3/4 cup milk and vanilla. Stir flour mixture into creamed mixture alternately with flavored milk. Make 3 dry and 2 liquid additions, combining lightly after each. Stir in cooled chocolate custard.\nBeat egg whites to form stiff but moist peaks. Fold into cake batter, and beat by hand for 1 minute. Turn batter into two greased and floured 8 inch round cake pans.\nBake at 350 degrees F (175 degrees C) for 25 to 30 minutes, or until cake springs back when lightly touched. Cool layers for 5 minutes, and then remove from pans. Cool completely.\n",
        "picture_link": "wFe3o5L0nVR6msZqz3wfaa7oEIrpAE6"
    },
    {
        "title": "Luxury Loaf",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate, grated ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease one 9x5x3 inch loaf pan.\nCream butter and sugar together until fluffy. Beat in eggs one at a time, beating well after each addition. Stir in vanilla, orange rind and juice.\nIn another bowl, put flour, baking powder, salt, and nutmeg. Stir in grated chocolate and nuts. Pour into first bowl. Stir all together until moistened. Spoon into a greased 9x5x3 inch loaf pan.\nBake in 325 degree F (165 degree C) oven for 1 hour and 15 minutes until a toothpick inserted in center comes out clean. Let stand 10 minutes. Remove loaf from pan to cool on cake rack. Wrap.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Molasses Sponge Cake",
        "ingredients": [
            "5 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "5 egg yolks ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "3/4 cup cake flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat egg whites to form moist peaks. Gradually beat in 1/4 cup white sugar and salt. Beat until very stiff and shiny.\nBeat egg yolks and 1/4 cup white sugar together until very light and fluffy. Beat in molasses, grated lemon rind and lemon juice. Stir in cake flour. Fold meringue gently into batter. Pour batter into an ungreased 9 inch tube pan.\nBake for 45 minutes. Remove cake from oven, and invert until cool. Loosen edges, and remove cake from pan.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Polish Doughnuts",
        "ingredients": [
            "1 (0.6 ounce) cake compressed fresh yeast ADVERTISEMENT",
            "3 tablespoons warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "3/4 cup margarine ADVERTISEMENT",
            "5 egg yolks ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "8 cups all-purpose flour ADVERTISEMENT",
            "8 cups shortening for frying ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Smash up yeast in a medium bowl. Add water and 1 teaspoon sugar, and mix until pasty. Set aside. Let rise until spongy.\nScald milk with margarine. Cool to lukewarm.\nBeat egg yolks. Add 3/4 cup sugar, and mix thoroughly. Add the cooled scalded milk mixture, and beat until foamy. Mix in yeast mixture. Add flour gradually, beating after each addition. Beat until thick and springy. Add flour only as needed to make a soft dough; too much will make hard doughnuts. Cover, and let rise until doubled.\nShape dough into small balls. Let rise on floured waxed paper until doubled\nIn a deep-fryer, heat shortening to 375 degrees F (190 degrees C). Fry until brown. Roll in sugar. Cool.\n",
        "picture_link": "qxeWOV09MsIyWVwseZnbNrXAvt0u5fy"
    },
    {
        "title": "Oatmeal Bread III",
        "ingredients": [
            "1 1/2 cups soy milk ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons liquid lecithin ADVERTISEMENT",
            "1 cup oat flour ADVERTISEMENT",
            "3/4 cup brown rice flour ADVERTISEMENT",
            "1/4 cup soy flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon arrowroot powder ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together oat flour, rice flour, soy flour, baking powder, arrowroot powder, sea salt, and cinnamon. Stir in rolled oats.\nIn a large bowl, mix together soy milk, honey, oil, and lecithin. Stir in the flour mixture, and mix well. The batter will be stiff. Scoop batter into a lightly oiled 9 x 5 inch loaf pan, and smooth into place.\nBake at 375 degrees F (190 degrees C) for 75 minutes, or until the loaf is firm and lightly browned. A toothpick inserted in the center should come out clean. If loaf gets too dark before it is done, tent with aluminum foil for the remainder of the baking time. Cool completely before removing from pan and slicing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Beaten Biscuits",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1/4 cup lard, chilled and cut into small pieces ADVERTISEMENT",
            "1/3 cup light cream ADVERTISEMENT",
            "2 tablespoons cold water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (230 degrees C).\nSift flour, salt, baking powder, and sugar together. Use a fork to \"cut\" the lard into the flour until it looks like coarse meal. Using a standing mixer, or a wooden spoon, mix the dough as you slowly add the cream. Mix well to form the dough into a ball, adding water if needed.\nPlace the dough onto a tabletop, and knead slightly. With a mallet or a one-piece rolling pin, beat the dough a few times to form it into a rough rectangle. Fold the dough over, and then beat it out again. Repeat this process until the dough becomes white and blisters form on the surface, about 15 minutes.\nRoll out the dough to about 1/4 inch thick. Cut into 2 inch rounds, and prick the top a few times with the tines of a fork. Place on greased baking sheets.\nBake for 15 minutes, or until golden.\n",
        "picture_link": "jGRG3v.mO.pGYJqhtvWNZQwDEhG2l3q"
    },
    {
        "title": "Birthday Party Cake",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups cake flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup boiling milk ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs and sugar together for 5 minutes. Cover and place in the refrigerator overnight. In the morning, beat the egg and sugar mixture for 5 minutes more.\nPreheat oven to 350 degrees F (175 degrees C). Grease three 8 inch cake pans.\nSift the flour, salt, and baking powder together. Add the flour mixture alternately with the boiling hot milk to the egg and sugar mixture. Stir in vanilla extract. Pour the batter into the prepared pans.\nBake at 350 degrees F (175 degrees C) for 15 to 20 minutes. Let cakes cool then fill and frost with Seven Minute Frosting.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rice Bread (Pirog)",
        "ingredients": [
            "1 (0.6 ounce) cake compressed fresh yeast ADVERTISEMENT",
            "1/4 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup golden raisins ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup white rice ADVERTISEMENT",
            "2 cups cold milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast in warm water; set aside.\nScald 1 cup milk, and combine with 1/2 cup sugar and 1/2 cup butter or margarine. Set aside to cool.\nIn a separate bowl beat eggs. Add eggs, vanilla, and pinch of salt to cooled milk mixture. Mix together. Add yeast mixture. Gradually add flour and raisins until dough comes away from the bowl. Knead the dough until pliable. Avoid handling the dough more than necessary! Place dough in a well oiled bowl. Set aside to rise until doubled in size in a draft free area.\nCombine 2 cups cold milk, 1/4 cup sugar, and pinch of salt in a saucepan. Stir in rice, and bring to a boil. Add 1 tablespoon butter. Lower heat, cover, and cook for about 20 minutes, until done. Set aside to cool.\nPunch down the dough, and knead a couple of times. Place into the center of a 9 x 14 inch casserole dish that has been sprayed with non-stick cooking spray and lightly floured. Spread dough in dish by patting gently to all sides. Let rise for 15 minutes.\nSpread rice on top of dough, and pull sides up gently to form an envelope type design. Rice will show in center. Brush the top lightly with melted butter and sprinkle with cinnamon.\nPlace in a preheated 375 degree F (190 degrees C) oven. Lower temperature to 350 degrees F (175 degrees C). Bake for 30 to 40 minutes, until golden.\n",
        "picture_link": "7WjMQaI6s1FfV3tZhNWKIc7CPPe9psS"
    },
    {
        "title": "Prosciutto Filling for Calzones",
        "ingredients": [
            "1 1/2 pounds ricotta cheese ADVERTISEMENT",
            "3 (1/2 ounce) slices prosciutto, diced ADVERTISEMENT",
            "3 tablespoons grated Romano cheese ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl mix together the ricotta cheese, prosciutto, Romano cheese, Parmesan cheese, eggs, parsley, garlic, salt, and pepper.\n",
        "picture_link": "bRgMyVjqxPTrIsEoJEt1ph9LWVZCmgO"
    },
    {
        "title": "Black Walnut Cake I",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped black walnuts ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "4 cups sifted confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped black walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch tube pan.\nIn a large bowl, cream 1 cup butter, shortening, brown sugar, and white sugar. Add eggs, one at a time, beating well after each addition. Sift together flour, baking powder, and salt, and add alternately with milk to the creamed mixture. Stir in 1 teaspoon vanilla and 1 cup black walnuts. Pour batter into prepared pan.\nBake in the preheated oven for 80 to 90 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\nIn a mixing bowl, cream together cream cheese and 1/4 cup butter. Add confectioners' sugar, beat well. Stir in 1 teaspoon vanilla. Frost cooled cake, and sprinkle with 1/2 cup nuts.\n",
        "picture_link": "NnX31d07RFVpbwObnuSU2roG14VDb/m"
    },
    {
        "title": "Rocky Road Cheesecake",
        "ingredients": [
            "1 cup chocolate cookie crumbs ADVERTISEMENT",
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter or margarine, and combine with the cookie crumbs. Press mixture into bottom of 9 inch springform pan. Bake at 350 degrees F (175 degrees C) for 10 minutes.\nIn a small saucepan, soften gelatin in water; stir over low heat until dissolved.\nIn a large bowl, combine cream cheese, sugar, cocoa, and vanilla; blend with an electric mixer on medium speed. Gradually add gelatin mixture, and blend. Fold in whipped cream, 2 cups marshmallows, and nuts; pour onto crust. Chill until firm.\n",
        "picture_link": "ne3TgNtKkhzRCXzB3GR0KZs86x7171G"
    },
    {
        "title": "Sauerkraut Surprise Cake",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup drained and chopped sauerkraut ADVERTISEMENT",
            "16 ounces semisweet chocolate chips ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 3/4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 13x9 inch cake pan.\nIn a large mixing bowl, cream 1/2 cup butter or margarine and sugar until light. Beat in eggs, one at a time; add 1 teaspoon vanilla.\nSift together flour, baking powder, baking soda, 1/4 teaspoon salt and cocoa powder. Add to creamed mixture alternately with water, beating after each addition. Stir in sauerkraut. Pour batter into prepared pan.\nBake at 350 degrees F (175 degrees C) for 35 to 40 minutes. Let cake cool in pan. Frost with Sour Cream Chocolate Frosting. Cut into squares to serve.\nTo Make Sour Cream Chocolate Frosting: Melt the semi-sweet chocolate pieces and 4 T butter or margarine over low heat. Remove from heat. Blend in the sour cream, 1 teaspoon vanilla, and 1/4 teaspoon salt. Gradually add sifted confectioners' sugar to make spreading consistency. Beat well. Spread over cooled cake.\n",
        "picture_link": "yIiE.QjlnZkreqng639SsnW/GJGK1HG"
    },
    {
        "title": "Festive Fruitcake",
        "ingredients": [
            "12 cups raisins ADVERTISEMENT",
            "3 cups dried currants ADVERTISEMENT",
            "2 pounds candied mixed fruit ADVERTISEMENT",
            "1 pound candied cherries ADVERTISEMENT",
            "1 (16 ounce) jar maraschino cherries, drained ADVERTISEMENT",
            "1 1/4 cups dates, pitted and chopped ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 cups butter, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "12 egg yolks ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 teaspoons unsweetened cocoa powder ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "4 cups chopped walnuts ADVERTISEMENT",
            "12 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C). Grease four 9 x 5 x 3 inch loaf pans, and then line with brown paper or foil. Grease again.\nIn a large container stir raisins, currants, candied fruit mix, candied cherries, maraschino cherries, dates, and 1 cup flour together until all the fruit is well coated with flour.\nMeasure 2 1/4 cup flour, baking powder, baking soda, salt, cocoa, cinnamon, and nutmeg into a medium bowl. Stir to mix.\nIn a very large bowl, cream the butter or margarine with the sugar. Beat in egg yolks three at a time. Stir in pineapple with juice and vanilla. Add flour mixture in 3 parts alternately with fruit juice in 2 parts to the creamed mixture, beginning and ending with flour mixture. Stir in walnuts.\nIn another bowl, beat egg whites until stiff. Fold egg whites into batter, and stir in fruit gently. Divide batter among pans. Smooth.\nBake for about 3 hours until an inserted wooden pick comes out clean.\n",
        "picture_link": "y0xG9DKzZChsBoG9Vu2noXDPlXxQfwm"
    },
    {
        "title": "Orange Cinnamon Sticks",
        "ingredients": [
            "1 (11 ounce) container refrigerated soft bread stick dough ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon orange juice ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Unroll the dough. Separate into strips. Twist each strip on a flat surface. Place 1 inch apart on a large ungreased cookie sheet.\nIn a small bowl, combine margarine or butter, honey, orange juice, and orange rind. Mix well. Brush this mixture on the breadstick twists.\nIn a small bowl, combine sugar and cinnamon. Sprinkle over the twists.\nBake in a preheated 350 degrees F (175 degrees C) oven for 15 to 18 minutes, or until golden brown.\n",
        "picture_link": "pYD6.w0deivu8VS2jo0knkaUNWGnY5S"
    },
    {
        "title": "Carrot Thyme Bread",
        "ingredients": [
            "2 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "1 cup rye flour ADVERTISEMENT",
            "2 1/4 cups bread flour ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 tablespoons dried thyme ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 cups grated carrots ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ingredients in the bread machine pan in the order suggested by the manufacturer. Select Basic Bread setting, and then press Start.\nAllow the loaf to cool before slicing.\n",
        "picture_link": "Wg6oTTOplWMtyDEhAlhYRKLnjiUw2Eu"
    },
    {
        "title": "Cassata Cake Ricotta Cheese Filling",
        "ingredients": [
            "2 1/4 cups confectioners' sugar ADVERTISEMENT",
            "2 pounds whole milk ricotta cheese ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "2 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1/2 cup candied lemon peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the ricotta cheese well and add the confectioner's sugar and the cinnamon. Add the vanilla and grate the chocolate in using the coarse side of a grater. Stir in the candied lemon peel and mix. Chill until ready to use.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roasted Beer Butt Lime Chicken",
        "ingredients": [
            "1 (5 pound) whole chicken ADVERTISEMENT",
            "1 1/2 limes, halved ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons dried rosemary ADVERTISEMENT",
            "1/2 (12 ounce) can beer ADVERTISEMENT",
            "1/4 red onion, peeled ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Rinse the chicken, inside and out, and pat skin dry with paper towels.\nSqueeze juice from lime halves over the outside of the chicken and place the squeezed halves in the cavity. Sprinkle cavity with minced garlic. Stir salt, black pepper, and rosemary in a small bowl and season the outside of the chicken with the mixture.\nPlace chicken upright in a roasting pan, with the beer can inserted into the cavity far enough so the chicken doesn't fall over. Place the onion into the neck cavity to block steam from escaping. Pour water into the bottom of the pan.\nRoast the chicken upright in the preheated oven until sizzling and an instant-read meat thermometer inserted into the thickest part of a thigh reads 180 degrees F (80 degrees C), 1 1/2 to 2 hours. Baste occasionally with pan drippings. Let chicken cool for about 10 minutes before serving.\n",
        "picture_link": "lmMGpfo1BfM.kcWdSWFKC3wowYbCiyG"
    },
    {
        "title": "Grasshopper Cocktail",
        "ingredients": [
            "3/4 fluid ounce creme de menthe ADVERTISEMENT",
            "3/4 fluid ounce white creme de cacao ADVERTISEMENT",
            "1/4 fluid ounce heavy cream ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine creme de menthe, creme de cacao, cream, and ice in a cocktail shaker. Cover and shake until chilled. Strain into chilled cocktail glass.\n",
        "picture_link": "Am.FgFpmEzuDX2tKtp8DFwT4BczIs/2"
    },
    {
        "title": "Ham Cucumber Cups",
        "ingredients": [
            "16 1/2-inch thick slices of cucumber ADVERTISEMENT",
            "1/2 cup coarsely chopped cooked ham ADVERTISEMENT",
            "3 tablespoons reduced-fat mayonnaise ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Use a melon baller to scoop out the center of each cucumber slice, leaving the bottom of the slice intact to make a small cup.\nPlace ham, mayonnaise, Dijon mustard, and curry powder in a food processor and pulse a few times to mince and combine the filling.\nSpoon about 2 teaspoons filling into each cucumber cup.\n",
        "picture_link": "lXeDHaf2Ncn.RBm7x7ctb6s7QXQXFfa"
    },
    {
        "title": "Chicken, Grape, and Rice Salad",
        "ingredients": [
            "1 2/3 cups water ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "1 (5 ounce) package long grain and wild rice mix (such as Mahatma®) ADVERTISEMENT",
            "4 cooked chicken breast halves, chopped ADVERTISEMENT",
            "1/2 red onion, chopped, or to taste ADVERTISEMENT",
            "1 1/2 cups seedless red grapes, quartered ADVERTISEMENT",
            "1/2 cup cashews ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and margarine to a boil in a saucepan; reduce heat to low and stir in long grain and wild rice mix. Cover and simmer until rice is tender, about 25 minutes. Fluff with fork and allow rice mix to cool thoroughly.\nMix cooled rice mix with chicken, red onion, grapes, cashews, and mayonnaise. Serve immediately or chill before serving.\n",
        "picture_link": "uqWMJQaVgka5ufr88lSbIYJ50fAvGoK"
    },
    {
        "title": "Barbecue Pork Chops Medley",
        "ingredients": [
            "4 sheets (12x18-inches each) Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "4 bone-in pork chops, 1/2 inch thick ADVERTISEMENT",
            "2 cups frozen baby corn and bean blend* ADVERTISEMENT",
            "Garlic salt ADVERTISEMENT",
            "1 (18 ounce) bottle barbecue sauce ADVERTISEMENT",
            "2 stalks celery, sliced ADVERTISEMENT",
            "2 green onions, sliced ADVERTISEMENT",
            "Hot cooked rice (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F or grill to medium-high.\nCenter one pork chop on each sheet of Reynolds Wrap(R) Aluminum Foil. Arrange vegetables beside each pork chop. Sprinkle pork chops and vegetables with garlic salt. Combine barbecue sauce, celery and onions; spoon over pork chops.\nBring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside. Repeat to make four packets.\nBake 18 to 22 minutes on a cookie sheet in oven.\nOR grill 14 to 16 minutes in covered grill.\nServe with rice, if desired.\n",
        "picture_link": "gGOmHluDHfV0J13rdCJOZkZ.rBUEdPu"
    },
    {
        "title": "White Russian Cocktail",
        "ingredients": [
            "2 fluid ounces vodka ADVERTISEMENT",
            "1 fluid ounce coffee-flavored liqueur ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "1 fluid ounce heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vodka, coffee liqueur, and ice in an old-fashioned glass. Pour in cream.\n",
        "picture_link": "98InvzqgPoyFapJRYKjGN69x6aLHESy"
    },
    {
        "title": "Oatmeal Rhubarb Pancakes",
        "ingredients": [
            "1 1/3 cups unbleached all-purpose flour ADVERTISEMENT",
            "10 tablespoons quick cooking oats ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/3 cups nonfat milk ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 banana, mashed ADVERTISEMENT",
            "1 cup finely chopped rhubarb ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, oats, brown sugar, cinnamon, baking soda, and salt in a large bowl. Mix milk and lemon juice in another bowl; stir in banana. Stir banana mixture into flour mixture; fold in rhubarb.\nHeat a griddle or large skillet over medium heat. Drop 1/4 cupfuls of batter onto the griddle and cook until bubbles form and the edges are dry, about 2 minutes. Flip, and cook until browned on the other side, about 2 minutes more. Repeat with remaining batter.\n",
        "picture_link": "UnK/ESGmayJBHKDIlAfllHKB8edPrM."
    },
    {
        "title": "Panzanella Salad (Bread Salad)",
        "ingredients": [
            "4 plum (roma) tomatoes, seeded and cubed ADVERTISEMENT",
            "1 cucumber, peeled and diced ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "1/2 cup cubed fontina cheese ADVERTISEMENT",
            "1/2 cup pitted and chopped kalamata olives ADVERTISEMENT",
            "2 tablespoons coarsely chopped fresh basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup extra virgin olive oil ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 (1 pound) loaf day-old Italian bread, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss tomatoes, cucumber, onion, fontina cheese, olives, basil, oregano, parsley, salt, and black pepper with olive oil and balsamic vinegar in a large bowl. Allow mixture to rest for 10 minutes.\nPlace bread cubes in a large dish. Pour tomato mixture over bread and toss to coat. Bread salad should be served within 2 hours.\n",
        "picture_link": "ov2Ei6egZPQbYJcZTKQcl5hab8nVR9S"
    },
    {
        "title": "Tropsicles",
        "ingredients": [
            "1 1/2 cups low-fat vanilla yogurt ADVERTISEMENT",
            "1 cup sliced mango ADVERTISEMENT",
            "1 (8 ounce) can pineapple chunks, undrained ADVERTISEMENT",
            "1 small banana ADVERTISEMENT",
            "1 orange, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend yogurt, mango, pineapple chunks with juice, banana, and orange juice in a blender until smooth. Pour into ice pop molds; freeze until set, 4 to 6 hours.\n",
        "picture_link": "Bc.wfWy2l6KPO2R6rZtY5Tq3EMFeBti"
    },
    {
        "title": "Classic Jewish Chicken Soup",
        "ingredients": [
            "1 whole chicken, giblets removed ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "2 tablespoons dried dill weed (optional) ADVERTISEMENT",
            "2 tablespoons dried parsley (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 large carrots, peeled and cut into cubes ADVERTISEMENT",
            "2 potatoes, peeled and cut into cubes ADVERTISEMENT",
            "2 leeks, diced ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 large kohlrabi bulb, peeled and diced ADVERTISEMENT",
            "3 parsnips, peeled and cut into cubes ADVERTISEMENT",
            "2 tablespoons chicken bouillon granules (optional) ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put chicken in a large pot with the chopped onions. Pour enough water into the pot to cover; add dill, parsley, salt, and pepper. Bring to a boil, reduce heat to medium-low, and cook at a simmer for 45 minutes.\nSkim and discard any foam from the top of the simmering liquid. Remove chicken to a cutting board. Remove as much meat from the chicken bones as possible; cut into chunks.\nReturn the liquid to a boil. Add carrots, potatoes, leeks, celery, kohlrabi, and parsnips to the boiling liquid. Reduce heat to medium-low and cook until the vegetables are tender, about 20 minutes. Stir cooked chicken chunks and chicken bouillon into the mixture. Season again with salt and pepper. Cook until the chicken is hot, about 5 minutes.\n",
        "picture_link": "HHp7eC5zrPWeZUIyEwEHreZR9d.PZ6q"
    },
    {
        "title": "Paleo Roasted Whitefish with Leeks and Bacon",
        "ingredients": [
            "4 leeks, sliced ADVERTISEMENT",
            "2 ounces bacon, chopped ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 1/2 pounds whitefish fillets ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 475 degrees F (245 degrees C).\nToss leeks with bacon and 1/4 cup olive oil and place in a baking pan.\nRoast in the preheated oven until leeks are softened, about 10 minutes. Add 1 tablespoon thyme and white wine; roast 10 more minutes.\nTop with whitefish and drizzle with 2 tablespoons olive oil; bake until the fish flakes easily with a fork, about 10 minutes. Garnish with thyme sprig.\n",
        "picture_link": "8Jk73Jv.KnqA.SCbQTtW4pdTPwkF9sS"
    },
    {
        "title": "White Sangria with Kiwi",
        "ingredients": [
            "1 (750 milliliter) bottle Chardonnay wine ADVERTISEMENT",
            "1 liter club soda ADVERTISEMENT",
            "3 tablespoons orange-flavored liqueur (such as Cointreau®) ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 cup seedless green grapes ADVERTISEMENT",
            "2 kiwis, peeled and sliced ADVERTISEMENT",
            "1 large pear, thinly sliced ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "8 sprigs mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix Chardonnay wine, club soda, orange-flavored liqueur, sugar, grapes, kiwis, and pear in a large pitcher. Stir until sugar is dissolved. Pour wine mixture into wine glasses filled with ice, making sure each glass has some fruit. Garnish with mint sprigs.\n",
        "picture_link": "5xvufvtOSIC1JJnDcncZzY/Z5m3jNTK"
    },
    {
        "title": "Spicy Grilled Trout",
        "ingredients": [
            "1 whole trout, cleaned ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon spicy Hungarian paprika ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut several diagonal slashes with a sharp knife in each side of trout. Mix lemon juice, vegetable oil, cumin, chili powder, paprika, black pepper, and salt into a paste in a small bowl; apply to the sides of the fish, spreading it into the slashes. Refrigerate trout for 1 hour.\nPreheat an outdoor grill for medium-high heat. A grill thermometer should read 400 degrees F (205 degrees C). Spray a piece of aluminum foil large enough to hold the fish with cooking spray and place it onto the grill.\nPlace trout onto the piece of foil and grill, turning one time, until the fish is opaque and the flesh flakes easily, about 5 minutes per side.\n",
        "picture_link": "hXaO3iCqz9DgaZf/6KKP44AZ.3796P."
    },
    {
        "title": "Upside Down Rhubarb Cake",
        "ingredients": [
            "4 cups chopped rhubarb ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (3 ounce) package strawberry-flavored Jell-O® mix ADVERTISEMENT",
            "3 tablespoons quick-cooking tapioca ADVERTISEMENT",
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nMix rhubarb, sugar, strawberry gelatin mix, and tapioca in a bowl. Spread the rhubarb mixture into the bottom of the prepared baking pan.\nBeat white cake mix, water, vegetable oil, and eggs in a large mixing bowl until moistened; beat with an electric mixer on medium speed for 2 minutes. Pour the cake batter over the rhubarb mixture.\nBake in the preheated oven until a toothpick inserted into the middle of the cake layer comes out clean, about 35 minutes. Let cake stand for 5 to 10 minutes before inverting on a plate.\n",
        "picture_link": "z0TEwNhvZG.rJ1ztkFEg.kWAGHxmDyS"
    },
    {
        "title": "Hot Mocha",
        "ingredients": [
            "1 tablespoon unsweetened Dutch-processed cocoa powder ADVERTISEMENT",
            "1 packet Sweet'N Low granulated sugar substitute, or to taste ADVERTISEMENT",
            "1 cup hot coffee ADVERTISEMENT",
            "Skim milk ADVERTISEMENT",
            "Cocoa powder, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mug or coffee cup, mix the cocoa and Sweet'N Low together. Add a few tablespoons of the coffee and stir until the cocoa is completely dissolved. Pour in the remaining coffee.\nFoam the milk. Spoon a generous amount over the hot mocha. Garnish with a pinch of cocoa powder, if desired.\n",
        "picture_link": "j/G9fi8Du2F5Y9d9y03.DiixZMoDNc6"
    },
    {
        "title": "Indian Curry Potato Fries",
        "ingredients": [
            "1 cup vegetable oil for frying, or as needed ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "5 russet potatoes, peeled and cubed ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon mild curry paste (such as Patak's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour enough oil into a frying pan to cover the bottom 1/3-inch deep; add garlic, cumin, salt, turmeric, and black pepper. Heat oil mixture over medium heat.\nCook and stir potatoes in the hot oil, turning occasionally, until cooked through, golden brown, and crisp on the outside, 10 to 15 minutes. Add fresh cilantro and curry paste and stir to coat. Fry until cilantro is dark green and crisp, about 1 more minute. Remove potatoes with a slotted spoon and transfer to serving dish.\n",
        "picture_link": "kGabiHN.s.TgXBzh.vSx1kqQQJgJNSC"
    },
    {
        "title": "Simple Peanut Butter and Tomato Sandwich",
        "ingredients": [
            "peanut butter ADVERTISEMENT",
            "2 slices whole wheat bread ADVERTISEMENT",
            "1/4 teaspoon white sugar, or to taste ADVERTISEMENT",
            "1 tablespoon low-fat creamy salad dressing (such as Miracle Whip Light®) ADVERTISEMENT",
            "1 tomato, thickly sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread peanut butter on one slice of bread; sprinkle with white sugar. Spread creamy salad dressing on the other slice of bread; top with tomato slices. Sprinkle tomatoes with salt and pepper. Place the 2 sides together and enjoy!\n",
        "picture_link": "SzDxC5NbCUN62XNeBuPfOrCiZpXYkqG"
    },
    {
        "title": "Todd and Jenny's Favorite Summertime Fluff Pie",
        "ingredients": [
            "2 (6 ounce) containers lemon yogurt ADVERTISEMENT",
            "1 (8 ounce) container extra-creamy whipped dessert topping ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "1 cup raspberries ADVERTISEMENT",
            "1 cup blackberries (optional) ADVERTISEMENT",
            "1 (9 inch) prepared deep dish graham cracker pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix lemon yogurt and whipped dessert topping together in a large bowl. Fold blueberries, raspberries, and blackberries into the yogurt mixture; pour into prepared pie crust.\nRefrigerate until the mixture sets, about 4 hours.\n",
        "picture_link": "ej20cQjGCn30grS.So43cgjlyWSeho."
    },
    {
        "title": "Paleo Spaghetti Squash with Spinach and Bacon Cream",
        "ingredients": [
            "1/2 pound bacon ADVERTISEMENT",
            "1 tablespoon bacon drippings ADVERTISEMENT",
            "1 large spaghetti squash, halved and seeded ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 large onion, coarsely chopped ADVERTISEMENT",
            "1 eggplant, chopped ADVERTISEMENT",
            "1 clove garlic, minced, or to taste ADVERTISEMENT",
            "1 teaspoon Italian herb blend ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "2 cups fresh spinach leaves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons nutritional yeast, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels; crumble and set aside. Leave 1 tablespoon bacon drippings in the skillet.\nPlace halved and seeded spaghetti squash cut sides down in a large glass baking dish with 1/4 cup water. Microwave on high until squash is steaming and tender, 10 to 12 minutes. Using a fork, scrape spaghetti squash strands from skin. Set aside in a large serving dish and keep warm.\nCook and stir onion and eggplant in remaining bacon drippings in a large skillet over medium heat until the onion turns translucent and eggplant is tender, 8 to 10 minutes. Stir in garlic and Italian herb blend. Add coconut milk, bring to a simmer, and cook until warmed through, 2 to 4 minutes. Remove from heat and use an immersion blender to puree the eggplant-coconut mixture until smooth.\nReturn blended coconut milk sauce to skillet over medium-high heat and stir in crumbled bacon and spinach. Simmer, stirring often, until spinach is wilted and sauce is heated through, about 5 minutes. Pour sauce over spaghetti squash and sprinkle with nutritional yeast to taste.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apricot Almond Pilaf",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 small carrot, finely chopped ADVERTISEMENT",
            "1 cup basmati rice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 7/8 cups water ADVERTISEMENT",
            "1/4 teaspoon saffron threads, crushed ADVERTISEMENT",
            "1 tablespoon rose water ADVERTISEMENT",
            "1/4 cup dried apricots, diced ADVERTISEMENT",
            "1/4 cup slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium heat; cook and stir onion and carrot until onion is translucent, about 5 minutes. Stir in basmati rice and salt; cook and stir until rice is slightly opaque, about 3 minutes.\nPour in water; stir to combine. Mix in saffron threads, rose water, apricots, and almonds; bring to a boil. Reduce heat to low, cover, and simmer until rice has absorbed the liquid, about 20 minutes. Remove from heat and allow pilaf to stand covered for 10 more minutes. Stir before serving.\n",
        "picture_link": "OCYRozWdzzLs3iYOAbEz3IQJ.YyF./K"
    },
    {
        "title": "Don's Cocktail Sauce",
        "ingredients": [
            "1 cup ketchup ADVERTISEMENT",
            "3 tablespoons chili sauce ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon prepared horseradish, or to taste ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "12 drops hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir ketchup, chili sauce, lemon juice, horseradish, Worcestershire sauce, and hot pepper sauce together in a bowl until smooth.\nCover bowl with plastic wrap and refrigerate until chilled, at least 15 minutes.\n",
        "picture_link": "FN0cu2MUctL590h3LPS167KyKdvz.dW"
    },
    {
        "title": "Fresh Green Bean and Mushroom Casserole",
        "ingredients": [
            "1 1/2 pounds fresh green beans, trimmed and cut into bite-size pieces ADVERTISEMENT",
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon ranch dressing mix ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1 1/2 cups fat-free milk ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBring a large pot of lightly salted water to a boil. Add green beans and cook uncovered until tender but still firm to the bite, 10 to 15 minutes. Drain.\nMelt butter in a saucepan over medium heat; whisk flour, ranch dressing mix, and white pepper into butter until a paste-like consistency is reached. Pour milk into butter mixture; cook, whisking constantly, until sauce is thick and bubbly, 5 to 10 minutes.\nSpray a nonstick skillet with cooking spray and place over medium heat. Cook and stir onion and garlic in hot skillet until slightly softened, about 2 minutes. Transfer 1/2 of the onion mixture to a plate and return skillet to heat.\nStir mushrooms into skillet with remaining onion mixture; cook and stir until mushrooms are tender, about 5 minutes.\nStir mushroom mixture, green beans, and sauce together in a 1 1/2-quart casserole dish. Stir reserved onion mixture and bread crumbs together in a bowl; sprinkle over green bean mixture.\nBake in the preheated oven until hot and bubbling, 25 to 30 minutes.\n",
        "picture_link": "jSjr/Of/2aRsFVK8ushxNKngA0AgSr."
    },
    {
        "title": "Corned Beef Special Sandwiches",
        "ingredients": [
            "1/3 cup Russian salad dressing ADVERTISEMENT",
            "8 slices Jewish rye bread ADVERTISEMENT",
            "1 pound thin-sliced corned beef ADVERTISEMENT",
            "1/2 pound prepared coleslaw ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread about 1/4 of the Russian salad dressing onto one side of each of four bread slices; top each with 4 ounces corned beef and 2 ounces coleslaw. Finish sandwich construction with remaining bread slices. Halve sandwiches diagonally before serving.\n",
        "picture_link": "MHmNZJRcdJQxTuk4UjcGgXe4rwz18TS"
    },
    {
        "title": "Fiesta Chicken Burritos",
        "ingredients": [
            "1 pound skinless boneless chicken breasts ADVERTISEMENT",
            "2 teaspoons Gay Lea Butter ADVERTISEMENT",
            "1 pinch Pinch salt ADVERTISEMENT",
            "1 pinch Pinch pepper ADVERTISEMENT",
            "2 cups shredded Ivanhoe Old Cheddar ADVERTISEMENT",
            "2/3 cup Gay Lea Sour Cream ADVERTISEMENT",
            "1 cup diced green pepper ADVERTISEMENT",
            "1/3 cup salsa ADVERTISEMENT",
            "1/2 cup sliced black olives (optional) ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "4 large flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut chicken into small 1-inch (2.5cm) cubes. In skillet, melt butter over medium high heat and cook chicken for about 8 minutes or until no longer pink inside. Salt and pepper to taste. Pour into large bowl and stir in 1/2 cup (375mL) of the cheese, sour cream, green pepper, salsa, olives, jalapeno, and cilantro.\nPreheat oven to 350 degrees F (180 degrees C).\nDivide mixture among tortillas: Fold and roll to enclose filling completely; place seam side down in small baking dish. Sprinkle with remaining cheese.\nBake in centre of oven for about 20 minutes or until cheese is melted and tortillas are crispy.\n",
        "picture_link": "fYv3DTEdXtkvIveGYtQXqcb0zJg8B6."
    },
    {
        "title": "Autumn Sunshine Cocktail",
        "ingredients": [
            "6 ice cubes ADVERTISEMENT",
            "2 fluid ounces bourbon ADVERTISEMENT",
            "1 fluid ounce maple syrup ADVERTISEMENT",
            "1 fluid ounce brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1 clementine, juiced and peel cut into 1x1/4-inch strips ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ice cubes in a shaker. Pour bourbon, maple syrup, orange liqueur, clementine juice, and lemon juice over ice, cover the shaker, and shake until chilled, about 15 seconds. Strain into a chilled martini glass.\nLight a match or lighter over the cocktail and squeeze 1 piece of clementine peel near the flame to flame the oil. Rub peel on the rim of the glass and drop peel into cocktail.\n",
        "picture_link": "nRO9yrKWIpWn/n6Ub9Z703gfhkjV9CK"
    },
    {
        "title": "Slow Cooker Cilantro-Lime Chicken Tacos",
        "ingredients": [
            "3 sheets aluminum foil, rolled into balls ADVERTISEMENT",
            "1 (5 pound) whole chicken ADVERTISEMENT",
            "1 teaspoon seasoned salt (such as Pappy's Choice®), or more to taste ADVERTISEMENT",
            "8 cloves garlic, or more to taste, crushed ADVERTISEMENT",
            "8 limes, quartered ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "20 corn tortillas, warmed ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put aluminum foil balls in the bottom of a slow cooker crock.\nSeason chicken with seasoned salt. Rub half the garlic on the inside surfaces of the chicken's cavity and leave them inside. Squeeze 8 lime quarters into the cavity; drop the squeezed quarters into the cavity. Place the chicken atop the foil balls. Squeeze 8 more lime quarters over the outside of the chicken; drop squeezed lime quarters into the bottom of the crock. Rub remaining garlic over the outside of the chicken and put garlic in the bottom of the crock. Pour white wine into the crock.\nCook on Low until the chicken meat pulls apart easily, 5 to 6 hours.\nRemove chicken to a cutting board. Remove meat from bones and shred completely. Serve chicken on warmed tortillas with cilantro for topping and lime wedge.\n",
        "picture_link": "swBTHiIBo19ZRHRTeZ5OdYRAxX98rvm"
    },
    {
        "title": "Cottage Cheese Meatball Marinara",
        "ingredients": [
            "1 cup Nordica 2% Cottage Cheese ADVERTISEMENT",
            "1/2 cup plain dry breadcrumbs ADVERTISEMENT",
            "1/4 cup grated Ivanhoe Parmesan Cheese, or as needed ADVERTISEMENT",
            "3 cloves garlic, minced and divided ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 pound extra lean ground beef ADVERTISEMENT",
            "1 mild Italian pork sausage, casing removed ADVERTISEMENT",
            "3 cups passata or pureed, strained tomatoes ADVERTISEMENT",
            "1/2 cup grated onion ADVERTISEMENT",
            "Pinch hot pepper flakes ADVERTISEMENT",
            "1/2 cup chopped fresh basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F (220 degrees C). Stir the cottage cheese with the breadcrumbs, Parmesan cheese, 1 clove garlic, eggs and half each of the salt and pepper until well combined. Crumble in the ground beef and sausage meat; gently mix until well combined.\nShape the mixture into 24 equal-sized meatballs; arrange, in a single layer, in a 9 x 13-inch (3 L) baking dish. Bake for 15 minutes or until lightly browned and set.\nMeanwhile, stir the passata with the grated onion, hot pepper flakes, remaining garlic, salt and pepper. Pour the tomato mixture evenly over the meatballs and cook for 30 minutes or until meatballs are cooked through and sauce is slightly thickened; gently stir in basil. Serve with additional Parmesan cheese to taste. Serve meatballs over hot cooked pasta or rice.\n",
        "picture_link": "kBdAOkRfCLhuzPtik/qg3iR8icQWNDy"
    },
    {
        "title": "Healthy Oatmeal Strawberry Smoothie",
        "ingredients": [
            "2 cups milk, or more to taste ADVERTISEMENT",
            "1 1/2 cups strawberries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup oats, or more to taste ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend milk, strawberries, sugar, oats, and egg together in a blender until smooth and creamy.\n",
        "picture_link": "H3TuW3qjzxEJrfSpYvkv.TAbY83MhQO"
    },
    {
        "title": "Split Pea Soup with Pork Belly",
        "ingredients": [
            "1 yellow onion, chopped ADVERTISEMENT",
            "1/4 pound pork belly, diced ADVERTISEMENT",
            "4 cups water, more if needed ADVERTISEMENT",
            "1 cup vegetable broth, or more if needed ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 cups split peas ADVERTISEMENT",
            "1 teaspoon ground thyme ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir onion and pork belly in a large pot over medium heat until pork is browned and onion is translucent, 10 to 15 minutes. Add water, vegetable broth, white wine, split peas, thyme, celery seed, bay leaves, salt, and pepper; stir to combine. Bring to a boil, reduce heat, cover, and simmer until flavors have combined, about 2 hours, stirring occasionally. Remove bay leaves before serving.\n",
        "picture_link": "Ky6UFNsJ4Jq9rDGnIaGdVYbmXWjYo26"
    },
    {
        "title": "Butternut Squash Gratin",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 large onions, cut into 1-inch squares ADVERTISEMENT",
            "3 tablespoons chopped fresh sage ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "3 pounds butternut squash - peeled, seeded, and cut into 1/2-inch cubes ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "10 tablespoons heavy whipping cream ADVERTISEMENT",
            "1 cup fresh bread crumbs ADVERTISEMENT",
            "1 1/2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a gratin baking dish with butter.\nHeat 1 tablespoon butter and olive oil in a large skillet over low heat; add onions and sage. Cover and cook, stirring occasionally, until onions are browned, about 25 minutes. Season with salt and black pepper.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add squash, cover, and steam until tender, 10 to 20 minutes. Transfer squash to prepared gratin dish; toss with garlic and 3/4 teaspoon salt. Add the caramelized onions to the pan and gently mix to combine.\nWarm cream in a saucepan over low heat; pour over squash mixture. Stir to coat. Combine bread crumbs and 1 1/2 tablespoons melted butter together in a bowl; sprinkle over squash mixture.\nBake in the preheated oven until gratin is bubbling and breadcrumbs are browned, 20 to 25 minutes.\n",
        "picture_link": "pvcW2gjWjJojfVEId.fRbaImBjd9eZW"
    },
    {
        "title": "Best Oreo® Milkshake EVER!",
        "ingredients": [
            "2 scoops chocolate ice cream ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 tablespoons whipped cream, or more to taste ADVERTISEMENT",
            "1 tablespoon chocolate syrup ADVERTISEMENT",
            "2 chocolate sandwich cookies (such as Oreo®) ADVERTISEMENT",
            "1/4 cup whipped cream ADVERTISEMENT",
            "2 chocolate sandwich cookies (such as Oreo®), crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend chocolate ice cream, milk, 2 tablespoons whipped cream, chocolate syrup, and 2 chocolate sandwich cookies in a blender until smooth and frothy. Divide milkshake between two glasses. Top each with 2 tablespoons whipped cream and crushed chocolate sandwich cookies.\n",
        "picture_link": "1UDHu0mmQ7mCNKTFdzN/dAuR.e2PuPy"
    },
    {
        "title": "Beef and Plum Stew (Inspired by the Hunger Games)",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 yellow onion, cut into large chunks ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "4 slices bacon, cut into small pieces ADVERTISEMENT",
            "2 cups Merlot wine ADVERTISEMENT",
            "1 cup dried plums, quartered ADVERTISEMENT",
            "2 cups mushrooms, sliced ADVERTISEMENT",
            "1 (14.5 ounce) can stewed, diced tomatoes ADVERTISEMENT",
            "20 ounces cubed beef stew meat ADVERTISEMENT",
            "1 1/2 teaspoons mustard powder ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat. Cook and stir onion and garlic in the melted butter until lightly brown, 8 to 10 minutes. Cook bacon in the onion mixture until browned, 5 to 7 minutes.\nHeat wine in a separate pot over medium heat until simmering. Add dried plums to wine and cook for about 10 minutes. Add mushrooms, cover pot, and reduce heat to low.\nCook and stir tomatoes and beef into bacon mixture until beef is browned, about 20 minutes. Transfer bacon and beef mixture to the wine mixture. Add mustard powder, sage, cloves, salt, and pepper. Cook stew over medium heat for 2 1/2 hours.\n",
        "picture_link": "x9KDk5vtt/BzmMdw6zCOjIsit9xvTAS"
    },
    {
        "title": "Puffed Millet Squares",
        "ingredients": [
            "1/2 cup natural peanut butter ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 1/2 cups puffed millet cereal ADVERTISEMENT",
            "1/2 cup chopped dried mixed fruit ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease an 8x8-inch pan.\nCombine peanut butter, honey, and salt together in a large saucepan; bring to a boil. Add vanilla extract. Remove from heat and stir in millet and dried fruit. Press mixture into the prepared pan. Refrigerate until chilled, about 1 hour.\n",
        "picture_link": "/egmLylUKMomwC3wvJowEJZmhDaTjpi"
    },
    {
        "title": "Easy Mini Apple Pies",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 apples - peeled, cored, and diced ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "2 (10 ounce) cans refrigerated biscuit dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat. Cook and stir apples, sugar, cinnamon, vanilla extract, and salt in the melted butter until the apples are tender, about 5 minutes.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nFlatten biscuit dough on a flat work surface. Place a portion of apple filling into the middle of each dough portion. Fold dough around the filling and pinch the edges together to seal.\nFry pies in the hot oil until golden brown, about 10 minutes. Drain on paper towels.\n",
        "picture_link": "s0ON6W2kLADPWs.UCJXrnuBv1leTaLG"
    },
    {
        "title": "Easy Creamy Bell Pepper Marinara",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 small onion, sliced ADVERTISEMENT",
            "1/2 large red bell pepper, cut into matchstick-sized pieces ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "32 ounces tomato sauce (such as Classico® Tomato and Basil Sauce) ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon balsamic vinegar ADVERTISEMENT",
            "1 dash hot sauce, or to taste ADVERTISEMENT",
            "1 1/2 cups chopped fresh spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a large skillet over medium heat; cook and stir onion, red bell pepper, and garlic until tender, 5 to 10 minutes. Stir in flour until dissolved and thickened, about 5 minutes. Pour in milk, stirring constantly, until well mixed. Add Parmesan cheese; stir until cheese is melted, 5 minutes.\nStir tomato sauce into creamy onion mixture; season with black pepper, balsamic vinegar, and hot sauce. Cook and stir until heated through, 5 to 10 minutes. Sprinkle spinach over sauce to serve.\n",
        "picture_link": "wWpwU6xlty9dCtXcuVrMZJerd2k7vka"
    },
    {
        "title": "Green Pea and Ham Salad",
        "ingredients": [
            "1 (10 ounce) package frozen peas, thawed and drained ADVERTISEMENT",
            "2 cups cubed fully cooked ham ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons onion, chopped ADVERTISEMENT",
            "1 1/2 teaspoons mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix peas, ham, Cheddar cheese, mayonnaise, onion, and Dijon mustard in a large bowl. Cover and refrigerate at least 2 hours before serving.\n",
        "picture_link": "OcRLgnCZyaBGnR5xpzr6UgPMl0hwZHq"
    },
    {
        "title": "Meringue Bones",
        "ingredients": [
            "6 egg whites ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 225 degrees F (110 degrees C). Line 2 baking sheets with aluminum foil and grease the foil.\nBeat egg whites with cream of tartar and salt in a bowl with an electric mixer until egg whites are foamy. Gradually beat in sugar, a few tablespoons at a time, beating until the sugar dissolves in the meringue before adding more. Continue beating until the meringue is glossy and forms a sharp peak when beaters are lifted straight up out of the bowl; beat in vanilla extract. Spoon the meringue into a pastry bag fitted with a small tip.\nPipe meringue into small bone shapes on the prepared aluminum foil. You must pipe all the shapes at once or the meringue will deflate.\nPlace cookie sheets into the preheated oven and bake for 1 hour. No not open oven door or peek during baking. Turn the oven off and let the meringue bones cool in the oven without opening door for 1 hour. Gently and carefully remove cookies from aluminum to prevent broken bones.\n",
        "picture_link": "NEgsn7SKUX9eebss52xPNHo93TBSnCm"
    },
    {
        "title": "Blueberry Freezer Jam",
        "ingredients": [
            "4 cups white sugar ADVERTISEMENT",
            "2 cups crushed blueberries ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 (2 ounce) package powdered fruit pectin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sugar and blueberries together in a bowl; let stand for 10 minutes, stirring occasionally.\nStir lemon juice and pectin together in a separate small bowl; add to blueberry mixture. Stir constantly until sugar is completely dissolved and no longer grainy, about 3 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the blueberry into the hot, sterilized jars, filling the jars to within 1/2 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. Let stand at room temperature for 24 hours until set.\nRefrigerate for up to 3 weeks or freeze for up to 1 year. Thaw in refrigerator.\n",
        "picture_link": "4AA7jmQhaEBmXcbZqYwNcn5QkKLIL1u"
    },
    {
        "title": "Irish Coffee Cocktail",
        "ingredients": [
            "1 tablespoon sugar ADVERTISEMENT",
            "1 1/2 fluid ounces whiskey ADVERTISEMENT",
            "6 fluid ounces hot coffee ADVERTISEMENT",
            "1 teaspoon white sugar, or more to taste (optional) ADVERTISEMENT",
            "1/4 cup whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sugar on a plate or shallow bowl. Lightly wet the rim of an Irish coffee glass with a moistened paper towel. Dip the rim in sugar to coat.\nPour Irish whiskey into the prepared glass. Fill with coffee to within 1/2 inch of top. Add sugar and stir. Top with whipped cream.\n",
        "picture_link": "Y3DgJdfCc0FgkyINkPyMuhMCWfUrOqC"
    },
    {
        "title": "Easy Smoked Turkey",
        "ingredients": [
            "1 (12 pound) thawed whole turkey, neck and giblets removed ADVERTISEMENT",
            "1 tablespoon chopped fresh savory ADVERTISEMENT",
            "1 tablespoon chopped fresh sage ADVERTISEMENT",
            "1 tablespoon salt (optional) ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1/8 cup olive oil ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse the turkey and pat dry with paper towels. Combine savory, sage, salt, and black pepper in a bowl; rub half the herb mix inside the turkey's cavity and inside the neck cavity. Loosen turkey skin over breast and legs; rub remaining half of the herb mixture underneath the loosened skin. Rub olive oil over the entire turkey.\nLight 20 charcoal briquettes and place half of them on each side on the lower grate of a kettle charcoal grill. Place a drip pan or disposable aluminum baking pan in the middle of the lower grate and pour in water. When the coals are gray with ash, place a 2-inch square piece of hickory or other hardwood onto each bank of coals.\nPlace turkey on the cooking grate and cover the grill. Monitor the heat with a grill thermometer to maintain temperature between 150 and 250 degrees F (65 to 120 degrees C); add 3 to 5 coals to each side about every 1 1/2 hours. If pieces of hardwood burn away, add more to keep a steady stream of smoke rising from the wood. If open flames erupt when you open the lid, douse them with a drizzle of water or beer.\nSmoke the turkey for 20 minutes per pound, about 4 hours; let the heat increase to 250 degrees F (120 degrees C) during the last hour of smoking. An instant-read meat thermometer inserted into the thickest part of a thigh, not touching a bone, should reach 165 degrees F (75 degrees C).\n",
        "picture_link": "IK1jAggtnxNuJ0giPcVDAqjttczgc1O"
    },
    {
        "title": "Microwave Bread-and-Butter Pickles",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon mustard seed ADVERTISEMENT",
            "1/4 teaspoon celery seed ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "2 large English cucumbers, thinly sliced ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sugar and vinegar in a large microwave-safe bowl until sugar has dissolved; mix in salt, mustard seed, celery seed, and turmeric. Stir cucumbers and onion into the pickling mixture.\nMicrowave on high, stirring twice, until cucumber slices are tender and onion is translucent, 7 to 8 minutes. Chill before serving.\n",
        "picture_link": "7mqDm8XZ3IYgwKf8ZJ4NpZfEwreCK1u"
    },
    {
        "title": "Kamikaze Cocktail",
        "ingredients": [
            "1/2 fluid ounce lime juice ADVERTISEMENT",
            "1/2 fluid ounce triple sec ADVERTISEMENT",
            "1/2 fluid ounce vodka ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lime juice, triple sec, and vodka in a cocktail shaker. Add ice, cover and shake until chilled. Strain into chilled short glass or cocktail glass.\n",
        "picture_link": "zlOEUhdwKu4JS5gknhWl1kZ7vJTTc1a"
    },
    {
        "title": "Millet Pie",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 cup oats ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 cup millet ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1/2 cup diced carrot ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "1/2 cup diced potato ADVERTISEMENT",
            "1/4 cup safflower oil ADVERTISEMENT",
            "1/4 cup tamari sauce ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 recipe pastry for a 9-inch double crust pie ADVERTISEMENT",
            "1 egg, beaten (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 1 cup water and oats to a boil in a saucepan; reduce heat and simmer until water is absorbed, 10 minutes. Bring 1 1/2 cups water and millet to a boil in a separate saucepan; reduce heat and simmer until water is absorbed and millet is tender, 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine oats, millet, onion, carrot, celery, potato, safflower oil, tamari, allspice, nutmeg, cloves, salt, and black pepper together in a large bowl; mix well.\nPress 1 pie crust pastry into a 9-inch pie pan. Pour filling into pie crust. Top with second pie crust pastry; pinch edges together. Pierce a few areas of the top crust to allow pie to ventilate during baking. Brush top crust with beaten egg.\nBake pie in the preheated oven until crust is golden brown, about 40 minutes.\n",
        "picture_link": "EBV4DZMA6ZRw/vTbcmf.BrtXz4unxfS"
    },
    {
        "title": "Rum Rickey Cocktail",
        "ingredients": [
            "1/2 fluid ounce lime juice ADVERTISEMENT",
            "1 1/2 fluid ounces light rum ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "2 fluid ounces club soda ADVERTISEMENT",
            "1 lime wedge ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lime juice and rum in a highball glass. Add ice and club soda and stir well.\nGarnish with a lime wedge.\n",
        "picture_link": "c6PoUxTTXksmdddsSCf1RmaDXjV3wme"
    },
    {
        "title": "Slow Cooker Stuffed Zucchini",
        "ingredients": [
            "2 large zucchini, trimmed and halved lengthwise ADVERTISEMENT",
            "4 ripe tomatoes, cored ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon crushed garlic ADVERTISEMENT",
            "4 fresh basil leaves ADVERTISEMENT",
            "1 teaspoon dried Italian herb seasoning ADVERTISEMENT",
            "1 teaspoon white sugar (optional) ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 pound bulk sweet Italian sausage ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup grated mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scoop out flesh from the zucchini halves, leaving shells about 1/8 inch thick. (Zucchini flesh may be saved for another use.)\nPlace tomatoes, 1/4 cup olive oil, salt, black pepper, garlic, basil leaves, Italian herb seasoning, and sugar into a food processor and pulse until blended, about 1 minute. Set mixture aside.\nHeat 3 tablespoons olive oil in a large skillet over medium heat; cook and stir onion until translucent, about 5 minutes. Add sausage to skillet and cook, stirring often, until browned and crumbly, about 10 minutes. Stir in the tomato mixture and heat until simmering; stir in Parmesan cheese.\nPlace hollowed-out zucchini shells into the bottom of a large slow cooker, trimming them to fit if necessary. Spoon the sausage mixture into the shells, cover the cooker, and cook on High until tender, about 6 hours. Remove cover and spread a layer of mozzarella cheese over each stuffed zucchini. Cover and cook on High until cheese has melted, about 10 more minutes.\n",
        "picture_link": "izeAILmzFfb940nJ1nZ4wCX6toWcgSe"
    },
    {
        "title": "Hot Greek Salad",
        "ingredients": [
            "1 cup orzo pasta ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon Greek seasoning, or to taste ADVERTISEMENT",
            "2 cups fresh spinach ADVERTISEMENT",
            "1 cucumber, cubed ADVERTISEMENT",
            "1 tomato, cubed ADVERTISEMENT",
            "1 (15 ounce) can large black olives, drained ADVERTISEMENT",
            "2 tablespoons sun-dried tomato vinaigrette ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook orzo in the boiling water, stirring occasionally until cooked through but firm to the bite, about 10 minutes. Drain and keep warm.\nHeat olive oil in a large skillet over medium heat; cook and stir chicken, garlic, and Greek seasoning until chicken is no longer pink in the center and juices run clear, about 10 minutes. Add spinach, cucumber, tomato, olives, and vinaigrette; lower heat and simmer until spinach begins to wilt, 5 to 10 minutes. Serve over orzo; top with feta cheese.\n",
        "picture_link": "rG7oiWxegztSYnwNHbf5HBQiNlNyXeW"
    },
    {
        "title": "Delish Black Mission Figs!",
        "ingredients": [
            "8 Black Mission figs, cut in half ADVERTISEMENT",
            "1/4 cup crumbled goat cheese, or as needed ADVERTISEMENT",
            "3 slices prosciutto, trimmed of all fat and cut into strips ADVERTISEMENT",
            "2 tablespoons honey, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nArrange fig halves, cut sides up, on a baking sheet. Top each fig half with goat cheese; lay prosciutto strips atop goat cheese layer.\nBroil figs in the preheated oven until prosciutto is crisp and goat cheese is melted, 3 to 5 minutes.\nTransfer the warm figs to a serving platter and drizzle with honey.\n",
        "picture_link": "AeG/3lvEX3z5piKrIQKet.ci2OyvbB."
    },
    {
        "title": "African Cabbage Stew",
        "ingredients": [
            "1 large head cabbage, diced ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "4 roma (plum) tomatoes, diced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (15 ounce) can mackerel in tomato sauce ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "1 pinch seasoned salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cabbage into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until just tender, about 10 minutes. Drain.\nHeat canola oil in a saucepan over medium heat. Cook and stir onion and garlic in hot oil until onion is translucent, 5 to 7 minutes. Stir tomatoes into onion mixture, place cover on saucepan, and cook until tomatoes are soft, 10 to 15 minutes.\nMix water and tomato paste in a small bowl until smooth; pour into the saucepan. Stir the mixture, replace the cover, and cook another 5 minutes. Add mackerel in tomato sauce; season with red pepper flakes and seasoned salt. Stir drained cabbage into the mixture. Cover saucepan and simmer mixture until mackerel is hot, 10 to 15 minutes.\n",
        "picture_link": "z7qkP1.4hCVSuxPl45Ek9c0moLB9Jbq"
    },
    {
        "title": "Easy Cheesy Vegetable Soup",
        "ingredients": [
            "1 1/2 quarts water ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "4 medium potatoes, chopped ADVERTISEMENT",
            "1 (16 ounce) package frozen broccoli, cauliflower and carrots ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 (2 pound) loaf processed cheese, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the water, onion, potatoes, frozen vegetables and bouillon in a large pot. Bring to a boil, reduce heat to medium and cook 10 minutes, or until potatoes are tender.\nMix cream of mushroom soup, cream of chicken soup and cream of celery soup into the pot. Stir in the processed cheese until melted. Continue cooking 45 minutes, or to desired consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Masala Spicy Tea",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 tea bags ADVERTISEMENT",
            "1 whole black peppercorn ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "2 whole cardamom pods ADVERTISEMENT",
            "2 whole cloves ADVERTISEMENT",
            "1/2 cup sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water to a boil in a saucepan over high heat. Reduce the heat to medium, and stir in the tea bags, peppercorn, cinnamon sticks, cardamom pods, and cloves. Let boil for 1 minute.\nPour in the condensed milk, and bring back to a boil. Remove from the heat, strain into cups, and serve.\n",
        "picture_link": "gZadGIfBtO1D2K/GwAfmATGhaMo7QNy"
    },
    {
        "title": "Cherry Berry Peach Pie",
        "ingredients": [
            "1 (15 ounce) package pastry for a double crust 9-inch pie ADVERTISEMENT",
            "3 cups peeled, sliced peaches ADVERTISEMENT",
            "1 cup Bing cherries, pitted and halved ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 tablespoon milk, or as needed ADVERTISEMENT",
            "1 teaspoon white sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Press one pie crust pastry into a 9-inch pie plate. Cut the remaining pie crust pastry into 3/4-inch strips to be used for the lattice top.\nMix peaches, cherries, blueberries, and lemon juice together in a large bowl. Add 1/2 cup white sugar, brown sugar, flour, cinnamon, and salt; stir to coat. Pour fruit mixture into the prepared pie crust. Weave a lattice top over the fruit filling using the pie crust strips. Brush top crust with milk; sprinkle with about 1 teaspoon white sugar.\nBake in the preheated oven for 10 minutes. Reduce heat to 350 degrees F (175 degrees C); bake until fruit filling is bubbling and lattice top is lightly browned, 45 to 50 minutes.\n",
        "picture_link": "fUh2eDxg6ND9UW3glN1sxpQnz4FVEqa"
    },
    {
        "title": "Fried Cinnamon Sweet Potato Chips",
        "ingredients": [
            "2 sweet potatoes, thinly sliced ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1 teaspoon white sugar, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sweet potatoes and milk together in a bowl. Mix flour, 1 tablespoon sugar, 1 teaspoon cinnamon, ginger, and 1/2 teaspoon salt together in a separate bowl. Remove a few sweet potato slices at a time, allowing excess milk to drip offl; dip the slices into the flour mixture. Place the coated sweet potatoes on a plate. Repeat with remaining sweet potatoes.\nHeat vegetable oil in a large skillet over medium-high heat.\nCombine 1 teaspoon sugar, 1/2 teaspoon cinnamon, and 1/4 teaspoon salt in a small bowl.\nFry the coated sweet potatoes, working in 2 to 3 batches, until crisp, 5 to 7 minutes. Drain chips on a paper towel-lined plate. Sprinkle with cinnamon-sugar mixture.\n",
        "picture_link": "3uH3bgb6CEMDuSC2FUkInF/kzjvF.xO"
    },
    {
        "title": "Rice Cooker Super Cheesy Polenta",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup polenta ADVERTISEMENT",
            "1/4 teaspoon salt, or more to taste ADVERTISEMENT",
            "2 ounces shredded Cheddar cheese ADVERTISEMENT",
            "2 ounces shredded Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place butter, onion, and garlic in rice cooker; close lid and turn on cooker. Cook until onion is soft and translucent, stirring occasionally, 10 to 15 minutes. Add chicken broth, milk, polenta, and salt. Cover and cook on full cycle, stirring occasionally, until polenta has absorbed the liquid, about 20 minutes. Add Cheddar cheese, Parmesan cheese, and black pepper; stir until cheese is melted.\n",
        "picture_link": "qxqToa.Ms8obcNxEorWBHAKGUas.NwG"
    },
    {
        "title": "Menny's Blueberry Barbecue Sauce",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (1/2 inch) piece fresh ginger, grated ADVERTISEMENT",
            "3 cups blueberries ADVERTISEMENT",
            "1/4 cup real maple syrup ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon smoked paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir onion, garlic, and ginger until onion is softened, about 8 minutes. Add blueberries, maple syrup, cider vinegar, balsamic vinegar, Worcestershire sauce, molasses, lemon juice, cinnamon, cumin, chili powder, paprika, smoked paprika, salt, and black pepper; stir to combine. Simmer over medium-low heat until sauce is slightly reduced and bubbling, 5 to 7 minutes.\nRemove skillet from heat; cool slightly. Pour sauce into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\n",
        "picture_link": "UkVvhDD/kQySlzVkRgDCRwmz7VPQI5S"
    },
    {
        "title": "Tequila Garlic Prawns",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "10 cloves garlic, crushed ADVERTISEMENT",
            "1 pound large shrimp, deveined ADVERTISEMENT",
            "1/4 cup best-quality white tequila ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "1/2 bunch cilantro, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat; cook the garlic in the hot oil until lightly golden, 2 to 3 minutes. Add the shrimp, tequila, and lime juice; cook until the shrimp turn pink, 3 to 5 minutes. Remove from heat and sprinkle the cilantro over the shrimp; toss to combine; peel and eat.\n",
        "picture_link": "NWCKWlEXgxWkGbPCc.ZWo42XUL.eDHu"
    },
    {
        "title": "Lobster Sauce for Mashed Potatoes",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 (7 ounce) cans lobster meat, diced ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "2 large stalks celery, diced ADVERTISEMENT",
            "2 carrots, peeled and chopped ADVERTISEMENT",
            "1 teaspoon minced fresh thyme ADVERTISEMENT",
            "1/8 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon whole black peppercorns ADVERTISEMENT",
            "1/8 teaspoon seasoned salt ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/8 teaspoon lemon juice ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/2 cup cream sherry ADVERTISEMENT",
            "1 quart heavy cream ADVERTISEMENT",
            "1/2 teaspoon salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat. Stir in the lobster, onion, celery, carrot, thyme, parsley, peppercorns, seasoned salt, bay leaf, and lemon juice. Cook, stirring constantly, over medium heat to soften the vegetables, about 10 minutes. Stir in the flour and tomato paste; cook for another 5 minutes, stirring constantly. Pour in sherry and cook for a minute or two to cook off the alcohol.\nPour in the heavy cream, and bring to a simmer. Reduce heat to low, simmer until the sauce has thickened, and will coat the back of a spoon, about 15 minutes. Strain through a fine mesh strainer, and discard the solids. Season to taste with salt and pepper.\n",
        "picture_link": "cv53zgpaz1B0zZplkp3ocKPJIsdNjzC"
    },
    {
        "title": "Quinoa Pilau",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger, finely chopped ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 tablespoons finely chopped fresh mint ADVERTISEMENT",
            "2 tablespoons finely chopped fresh cilantro ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon chopped blanched almonds, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water, 1/2 teaspoon sea salt, and quinoa to a boil in a saucepan; cook until quinoa has absorbed all the water, 15 to 20 minutes.\nHeat olive oil in a large skillet over medium heat; cook and stir onion and ginger until onion is lightly browned, 10 to 12 minutes. Add cinnamon and cloves; stir to coat. Stir in cooked quinoa.\nRemove skillet from heat; stir in mint and cilantro. Season with sea salt and black pepper. Allow mixture to cool; fluff with fork before serving. Garnish with blanched almonds.\n",
        "picture_link": "/V2cRYA4Bqbb59VXifgys2LJGmjuUa6"
    },
    {
        "title": "Rachel's Rose Sangria",
        "ingredients": [
            "2 trays ice cubes ADVERTISEMENT",
            "1 cup rum ADVERTISEMENT",
            "1 cup brandy ADVERTISEMENT",
            "1 1/2 cups white Zinfandel wine ADVERTISEMENT",
            "4 cups lemon-lime flavored soda ADVERTISEMENT",
            "1/2 cup diced apple ADVERTISEMENT",
            "1/2 cup seedless green grapes, halved ADVERTISEMENT",
            "1/2 cup seedless red grapes, halved ADVERTISEMENT",
            "1/2 lemon, sliced and cut into small pieces ADVERTISEMENT",
            "1/2 lime, sliced and cut into small pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ice cubes into a glass pitcher. Pour in the rum, brandy, wine, and lemon-lime soda and stir to blend. Add the apple, grapes, lemon, and lime to the pitcher, and stir again. Pour into glasses.\n",
        "picture_link": "EznVkVjRK8gK25KoFBYs.9XwctMR1ja"
    },
    {
        "title": "Granny's Lemon Yum Yum",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup softened butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed, divided ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "6 tablespoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nCombine the flour and pecans in a mixing bowl. Mix in the softened butter until the mixture is evenly moistened and no clumps of butter remain. Press the crust evenly over the prepared baking sheet.\nBake in the preheated oven until golden brown, 10 to 15 minutes. Remove from the oven and allow to cool completely.\nBeat the cream cheese and confectioners' sugar in a bowl until light and fluffy. Fold in 1 1/2 cups of the whipped topping, then spread the mixture over the cooled crust. Chill in the refrigerator.\nStir the sugar, cornstarch, and salt together in a saucepan along with enough water to make a paste. Stir in the eggs until smooth, then add the remaining water, vinegar, and lemon juice. Cook and stir over medium-low heat until thick and smooth, about 10 minutes. Remove from the heat and stir in 1 tablespoon of butter and the lemon extract. Chill the mixture until cold.\nSpread the cold lemon mixture evenly over the cream cheese layer. Top with the remaining whipped topping.\n",
        "picture_link": "U6CXZ.1W.E36qeRSznAagwy4mv/O83i"
    },
    {
        "title": "Fresh Veggie Wraps",
        "ingredients": [
            "1 ripe avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "8 (8 inch) flour tortillas ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1 cucumber, sliced ADVERTISEMENT",
            "1 green bell pepper, cut into strips ADVERTISEMENT",
            "1 head lettuce, chopped ADVERTISEMENT",
            "1 (8 ounce) package fresh mozzarella cheese, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare spread: mash diced avocado, mayonnaise, salt, garlic powder, onion powder, and cayenne pepper in a bowl with a fork until well blended.\nAssemble wraps: spread tortillas with a layer of avocado spread. Place diced tomatoes, cucumber slices, bell pepper strips, lettuce, and mozzarella cheese slices onto each wrap, leaving about 2 inches of space at the bottom. Fold bottoms up. Roll tortillas over vegetables firmly to enclose fillings.\n",
        "picture_link": "/FlQgnURlbnM0Tsh6vzAhgccuT3LRi2"
    },
    {
        "title": "Chicken with Black Beans",
        "ingredients": [
            "1 tablespoon light soy sauce ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken breast meat - cubed ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 (2 inch) pieces fresh ginger, cut into matchsticks ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup fermented black beans, rinsed and mashed ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 green bell pepper, chopped ADVERTISEMENT",
            "2 red bell pepper, chopped ADVERTISEMENT",
            "4 green onions, cut into 1-inch pieces ADVERTISEMENT",
            "1 small carrot, sliced ADVERTISEMENT",
            "2 tablespoons oyster sauce ADVERTISEMENT",
            "1 teaspoon thick soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the light soy sauce, cornstarch, 1 teaspoon of sugar, and pepper in a large glass or ceramic bowl. Add the chicken breast and toss to evenly coat. Cover the bowl with plastic wrap, and marinate in the refrigerator for 10 minutes.\nHeat the water in a large skillet over medium-high heat until boiling. Quickly stir in the chicken and cook for 3 to 4 minutes. Chicken will not be cooked through. Drain the water and place chicken on a plate. Set aside. Carefully wipe down the skillet and heat the vegetable oil over medium heat. Cook and stir the ginger and garlic until fragrant. Stir in the chicken, black beans and 1 tablespoon of sugar. Cook the chicken breasts until no longer pink in the center. Stir in the red and green peppers, green onions, carrots, oyster sauce, and thick soy sauce. Cook and stir for 1 minutes.\n",
        "picture_link": "QqhSZCFnqtNR83pUr25GeBNS7xr.kdy"
    },
    {
        "title": "Brandied Pumpkin Pie",
        "ingredients": [
            "2 prepared, unbaked pie crust, thawed ADVERTISEMENT",
            "2 eggs, slightly beaten ADVERTISEMENT",
            "1 (15 ounce) can pumpkin ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "2/3 cup brown sugar ADVERTISEMENT",
            "1/4 cup brandy ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nWhisk together the eggs, pumpkin, milk, brown sugar, brandy, salt, cinnamon, ginger, cloves, and nutmeg in a large bowl until smooth. Pour the mixture into the pie crusts. Cover the outside edge of each pie with aluminum foil.\nBake in preheated oven for 25 minutes; remove foil. Continue to bake until a knife inserted near the center of a pie comes out clean, about 25 minutes more.\nCool completely on a wire rack before serving. Store unused portion in refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cran-Apple-Pear Sauce",
        "ingredients": [
            "2 (16 ounce) cans whole berry cranberry sauce ADVERTISEMENT",
            "1 (20 ounce) can apple pie filling ADVERTISEMENT",
            "2 (15 ounce) cans sliced pears, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the cranberry sauce, apple pie filling and pears. Chill until serving.\n",
        "picture_link": "y5A6AWxQ5To6GbgazH7JGFIBe8RkER2"
    },
    {
        "title": "Easy Cabbage Casserole",
        "ingredients": [
            "1 small head cabbage, shredded ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 large onion, thinly sliced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 1/2 cups Italian-seasoned bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix cabbage, Cheddar cheese, onion, cream of celery soup, and butter in a large bowl. Mixture will be dry. Transfer to a large baking dish, spreading vegetables evenly; sprinkle with breadcrumbs. Cover baking dish with aluminum foil.\nBaked in preheated oven for 45 minutes and remove foil. Continue baking until bubbly and lightly browned, about 15 minutes more.\n",
        "picture_link": "m7CqRupQxbwTPRz5nCLs9H5BnQhrIwu"
    },
    {
        "title": "Crunchy Pea Salad with Bacon",
        "ingredients": [
            "1 cup zesty Italian-style salad dressing ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 (10 ounce) package frozen peas ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup chopped peanuts ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "5 slices cooked bacon, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together Italian-style dressing and mayonnaise in a bowl. Fold in peas, celery, peanuts, and onion until well mixed. Refrigerate until serving. Crumble bacon on top just before serving.\n",
        "picture_link": "oXNGi/0QWmXOrgFbyA5zp1y9U32Cg2m"
    },
    {
        "title": "Chicken Delirious and Buttered Rice (for Pressure Cooker)",
        "ingredients": [
            "2 onions, chopped ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "4 carrots, cut into match-stick size pieces ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts, cut into cubes ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 cup whiskey ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "3/4 cup vinegar ADVERTISEMENT",
            "1 teaspoon red pepper flakes, or more to taste ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon Asian (toasted) sesame oil ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 1/4 cups white rice ADVERTISEMENT",
            "1 tablespoon butter, or to taste ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place onions, green bell peppers, and carrots in the pressure cooker; add chicken. Whisk 1 cup orange juice, whiskey, brown sugar, vinegar, red pepper flakes, ginger, and sesame oil together in a bowl; pour over chicken mixture. Stir to combine. Place lid on pressure cooker and lock; bring to full pressure over medium heat until chicken is no longer pink in the center, 15 minutes. Let pressure come down naturally, about 15 minutes.\nWhile chicken is cooking, combine water and rice in a microwave-safe casserole dish. Cook on high in microwave until water is absorbed and rice is tender, 15 to 20 minutes. Stir butter into rice; toss well.\nWhisk 1/2 cup orange juice and cornstarch together in a bowl; stir into hot chicken mixture until whiskey sauce is thickened. Serve chicken over the hot buttered rice.\n",
        "picture_link": "ybf9C/mJhQEjwvvzWim.iXhFBtUcRTq"
    },
    {
        "title": "Knoepfla Soup",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "8 cups chicken broth ADVERTISEMENT",
            "2 (10.5 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "2 potatoes, cut into 1-inch cubes ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, eggs, milk, and salt together in a bowl, beating dough until it holds together. Turn dough out onto a well-floured work surface, knead a few times until no longer sticky, and roll dough out about 1/2 inch thick. Cut the dough into 1- to 1 1/2-inch squares.\nBring a large pot of lightly salted water to a boil and gently drop the dumplings into the boiling water a few at a time, stirring to keep them from sticking. Boil until all dumplings have risen to the top, 8 to 10 minutes. Remove from water with a slotted spoon and transfer to a bowl.\nBring chicken broth to a boil in a large soup pot and whisk in cream of chicken soup and cream until soup is smoothly combined. Stir in potatoes, onion, and dumplings, reduce heat to medium-low, and simmer until dumplings and potatoes are tender and the soup is thickened, 25 to 40 minutes.\n",
        "picture_link": "g30ddLsTNjHvWRtjJ046/csF1PvdqJm"
    },
    {
        "title": "Chocolate Fun Clay",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1 tablespoon candy sprinkles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the chocolate chips in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave). Do not overheat or chocolate will scorch. Stir in the corn syrup until smooth. Scrape the mixture onto a plate; cover with wax paper. Allow the clay to rest overnight at room temperature.\nRoll or shape the clay; decorate with candy sprinkles.\n",
        "picture_link": "g0l/ptxoMNCg0amFeVhGLXWlpbhtvGO"
    },
    {
        "title": "Pasta with Tofu and Walnuts",
        "ingredients": [
            "8 ounces penne or other pasta of your choice ADVERTISEMENT",
            "1/2 (14 ounce) package firm tofu ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup sliced red onion ADVERTISEMENT",
            "3/4 cup quartered fresh mushrooms ADVERTISEMENT",
            "2/3 cup whole walnuts ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "1 tablespoon black pepper ADVERTISEMENT",
            "grated Romano cheese to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until tender; drain.\nIn the meantime, cut the tofu into 1/4 inch thick by 2 inch wide slices. Heat the olive oil in a saute pan over medium-high heat. Cook the garlic and onions and cook until they begin to soften, about 1 minute. Stir in the mushrooms, walnuts, vinegar, and black pepper, turn heat to medium-low and allow to simmer for 2 to 3 minutes. Gently fold in the tofu slices, cover, and allow to simmer for about 5 minutes more.\nWhen the pasta has cooked, toss it with the tofu mixture, and sprinkle with Romano cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Egg and Sausage Souffle",
        "ingredients": [
            "1 1/2 cups bulk pork sausage ADVERTISEMENT",
            "3 cups herb seasoned croutons ADVERTISEMENT",
            "2 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1 (10.75 ounce) can condensed golden mushroom soup ADVERTISEMENT",
            "3/4 teaspoon ground mustard ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown sausage in a large skillet over medium-high heat; drain fat.\nPlace croutons in a 9X13 inch baking dish. Sprinkle cheese over croutons; top with browned sausage. Beat eggs and 2 1/2 cups of milk in a mixing bowl, and pour over the casserole. Cover baking dish, and refrigerate overnight.\nThe following morning, preheat oven to 300 degrees F (150 degrees C). Combine the mushroom soup, ground mustard, and the remaining 1/2 cup milk; pour over the top of the casserole.\nBake, uncovered, until browned and set, about 1 1/2 hours.\n",
        "picture_link": "QkH/K3mJRnTxRnPK/P0gr8Id.26zmA6"
    },
    {
        "title": "Lobster Fricassee",
        "ingredients": [
            "1/2 cup finely chopped carrot ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cups dry white wine ADVERTISEMENT",
            "2 (1 1/2 pound) whole lobsters ADVERTISEMENT",
            "2 tablespoons brandy ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, combine the carrot, celery, onion and white wine. Bring to a boil. Add lobsters, cover, and cook until lobsters turn bright red, about 8 minutes. Remove lobsters from the sauce and allow to cool.\nWhen the lobsters have cooled enough to handle, cut each one in half lengthwise. Remove the lobster meat from the shell and claws, keeping it and the shell intact. Discard the tomalley if desired. Slice each tail piece into 4 medallions and set aside.\nContinue to simmer the wine and vegetables in the skillet until the liquid has been reduced by half, about 10 minutes. Return the shells to the sauce and stir in the brandy. Simmer for 5 minutes. Strain the stock through a sieve or mesh strainer into a saucepan. Stir in the heavy cream and cook over medium heat until thickened, about 10 minutes. Stir in the butter just until melted. Add the lobster meat to the sauce and cook over low heat until heated through.\n",
        "picture_link": "e52FTP/Rm9si1MPjrdwsaXNxjkiMFCK"
    },
    {
        "title": "Strawberry Cream Parfaits with Coconut Macaroons",
        "ingredients": [
            "1 quart strawberries, hulled and sliced ADVERTISEMENT",
            "7 1/2 tablespoons sugar ADVERTISEMENT",
            "1 1/2 cups heavy whipping cream ADVERTISEMENT",
            "3/4 teaspoon finely grated orange zest ADVERTISEMENT",
            "8 ounces crumbled store-bought coconut macaroons ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix strawberries and 6 Tbs. of the sugar in a bowl; let stand until berries release their liquid, 30 to 60 minutes.\nWhen ready to assemble dessert, beat cream and orange zest to soft peaks, gradually adding remaining 1 1/2 Tbs. sugar.\nPour 6 Tbs. of the strawberry juice that has collected in the bowl over the crumbled macaroons. Toss to coat.\nTo assemble, choose six goblets that hold at least 12 ounces; in each, make two layers in the following order: scant 1/4 cup macaroons, scant 1/4 cup whipped cream, 1/4 cup strawberries. Refrigerate until ready to serve, up to 2 hours.\n",
        "picture_link": "CzzhjvINNGzexpNAYL6QNaaygTK.Icy"
    },
    {
        "title": "Chicken a la Fire Station",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "6 tablespoons butter, divided ADVERTISEMENT",
            "1 envelope dry Italian-style salad dressing mix ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/4 cup sherry wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C), and grease a 7x11 inch baking dish.\nPound the chicken breasts with a meat mallet until flattened. Place 1 tablespoon of butter on each breast, and sprinkle with Italian dressing mix. Roll up the breasts, secure them with toothpicks, and place in the baking dish.\nWhisk together the cream of chicken soup, sour cream, and sherry in a bowl until smooth, and pour over the chicken rolls.\nBake in the preheated oven until the chicken is cooked through and tender and the sauce is bubbling, about 1 1/2 hours.\n",
        "picture_link": "p.zkU5bGQeoci2hoYL5urgvrZZ1WrlS"
    },
    {
        "title": "Smoked Fish Pie",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 onions, halved and sliced ADVERTISEMENT",
            "6 potatoes, peeled and cubed ADVERTISEMENT",
            "2 cups frozen green peas ADVERTISEMENT",
            "2 (6 ounce) salmon fillets, cut into 1 inch cubes ADVERTISEMENT",
            "1 pound smoked haddock fillets, undyed, cut into 1 inch cubes ADVERTISEMENT",
            "1 cup flaked or chopped smoked salmon ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 1/2 cups Red Leicester cheese, grated ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nHeat the oil in a skillet over medium heat. Add the onions; cook and stir until tender, 5 to 10 minutes.\nPlace the potatoes in a separate saucepan and fill with enough water to cover. Bring to a boil, then cook over medium heat until tender enough to pierce with a fork. Drain and transfer potatoes to the prepared baking dish.\nAdd the onions, salmon, haddock, and smoked salmon to the baking dish, tossing to mix.\nIn the same skillet that the onions were cooked in, melt the butter over medium heat. Stir in flour so there are no lumps. Cook and stir for a few minutes, then gradually stir in the milk. Simmer, stirring frequently, until the sauce begins to thicken. Season with nutmeg, salt, and pepper; remove from the heat. Stir in most of the Cheddar cheese until melted, reserving some to sprinkle over the top of the casserole. Pour the sauce over the contents of the baking dish, and sprinkle with the remaining Cheddar cheese.\nBake in preheated oven until the salmon is cooked through and the cheese on top is toasted, about 30 minutes.\n",
        "picture_link": "mkPbVZYR5otsyGenE.uAJSCGvtTZ8u."
    },
    {
        "title": "Mango Quinoa Salad",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "3 mangoes, peeled and chopped ADVERTISEMENT",
            "1 cup chopped cucumber ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "1/3 cup chopped green onions ADVERTISEMENT",
            "2 cups packed fresh baby spinach ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/4 cup Mazola® Corn Oil ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "1 tablespoon mango chutney ADVERTISEMENT",
            "1/4 teaspoon Spice Islands® Fine Grind Black Pepper ADVERTISEMENT",
            "1 1/2 teaspoons Spice Islands® Curry Powder ADVERTISEMENT",
            "1/4 teaspoon Spice Islands® Ground Mustard ADVERTISEMENT",
            "1/4 teaspoon Spice Islands® Ground Ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat water and salt in a medium saucepan; bring to boil. Add quinoa and cook until tender but still firm to bite, stirring occasionally, about 12 minutes. Remove from heat and let rest for 5 minutes. Transfer to medium bowl. Add mango, cucumber, red pepper and onion to quinoa. Mix well.\nTo make dressing: Blend oil, vinegar, chutney, black pepper, curry, mustard and ginger in a food processor. Add 1/4 cup dressing to quinoa mixture. Stir to coat. Spoon quinoa salad over spinach OR mix spinach with quinoa mixture. Drizzle with remaining dressing. Chill if desired.\n",
        "picture_link": "uWi3t7xvHXBLJ1S2T9HmgZ4wPoj4ZdG"
    },
    {
        "title": "Caramelized Onion and Jalapeno Quesadillas",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 jalapeno peppers, chopped ADVERTISEMENT",
            "2 tablespoons vegetable oil, or as needed ADVERTISEMENT",
            "4 (10 inch) flour tortillas ADVERTISEMENT",
            "1 cup shredded Mexican cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium-low heat; cook and stir onion until softened and lightly browned, about 10 minutes. Add jalapeno peppers to onion; cook and stir until onion is browned, about 10 minutes more. Transfer onion mixture to a plate.\nHeat about 1 tablespoon olive oil in the same skillet and add 1 tortilla. Top tortilla with 1/4 cup Mexican cheese blend, 1/2 of the onion mixture, and 1/4 cup Mexican cheese blend, respectively; top with 1 tortilla. Cook quesadilla until browned and cheese is melted, 1 to 2 minutes per side. Repeat with remaining oil, tortillas, cheese, and onion mixture.\n",
        "picture_link": "zyJnrSQWWxevEyuCGNhtCVCihFrxvPm"
    },
    {
        "title": "Deep-Fried Zucchini Spirals",
        "ingredients": [
            "3 cups vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 zucchini, cut into spirals using a spiral slicer ADVERTISEMENT",
            "1 teaspoon seafood seasoning (such as Old Bay®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nWhisk egg and milk together in a bowl; pour into a gallon-size resealable plastic bag. Whisk flour and cornstarch together in another bowl; pour into a separate gallon-size resealable plastic bag.\nPlace zucchini spirals into milk mixture, seal the bag, and turn to coat spirals completely. Transfer zucchini to flour mixture, seal the bag, and shake gently to coat completely. Remove spirals from flour mixture and shake gently to remove any excess flour.\nWorking in batches, cook zucchini spirals in the preheated oil until golden brown and cooked through, 2 to 4 minutes. Transfer zucchini to a paper towel-lined plate to drain. Sprinkle seafood season over cooked zucchini spirals.\n",
        "picture_link": "SsHh8BzWQYBZIrppA3mCmM/2Roycx3y"
    }
]