[
    {
        "title": "Mint Citrus Water",
        "ingredients": [
            "2 quarts water ADVERTISEMENT",
            "1 lemon sliced, or as desired ADVERTISEMENT",
            "2 limes, sliced, or as desired ADVERTISEMENT",
            "1/2 cup mint leaves ADVERTISEMENT",
            "1/2 cup sliced cucumber, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water into a pitcher.\nMix lemon slices, lime slices, mint leaves, and cucumber together in a bowl; add to water and stir.\nRefrigerate water mixture, stirring 1 time per day, until flavors have infused, 2 to 3 days.\n",
        "picture_link": "B3bgM7EpScOb.zPnC6FXG4tdDJCplu6"
    },
    {
        "title": "'Pizza' Shepherd's Pie",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes with garlic and basil, drained ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "3/4 pound frozen pizza dough, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCook and stir beef in a large skillet over medium-high heat, stirring occasionally and breaking up lumps, until no longer pink, 3 to 4 minutes. Drain beef and return to skillet.\nAdd tomatoes and black pepper to beef; bring to a simmer and cook until slightly thickened, about 5 minutes. Spoon mixture into a 9-inch deep-dish pie plate. Scatter mozzarella cheese over the top. Stretch pizza dough over top with your hands, pressing it onto the edge of the pie plate.\nBake in the preheated oven until crust is golden brown, about 30 minutes. Let stand 10 minutes before cutting.\n",
        "picture_link": "9o7dWdha7dBiiX0IjBo2X6dw.K9tk5u"
    },
    {
        "title": "Carrot Morning Glory Muffins (Gluten Free Optional)",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup rolled oats (not instant or quick oats) ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon freshly ground nutmeg ADVERTISEMENT",
            "4 tablespoons unsalted butter, softened ADVERTISEMENT",
            "1/2 cup packed light or dark brown sugar ADVERTISEMENT",
            "1 cup Mott's® Cinnamon Applesauce ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "2 cups finely shredded carrots ADVERTISEMENT",
            "1/2 cup coarsely chopped walnuts ADVERTISEMENT",
            "1/4 cup shredded sweetened coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F and line a standard 12-cup muffin pan with paper liners.\nWhisk the flour(s), oats, baking powder, cinnamon, salt, ginger, and nutmeg together in a medium bowl. Set aside.\nWith a stand mixer fitted with the paddle attachment or an electric hand mixer, beat the butter and sugar together on medium speed for about 3 minutes until a thick paste forms. Scrape the beaters and the bowl.\nAdd the applesauce and eggs and beat on medium-low speed until the sugar paste breaks up and a loose batter forms. Stir in the carrots, walnuts, and coconut.\nGently stir in the flour mixture just until it is incorporated--don't over mix. The batter will be very thick.\nDivide the batter evenly between the 12 muffin cups, mounding it to the brim of each paper liner.\nBake for about 25 minutes, until the muffins are browning on top. Cool in the pan for 5 minutes, then transfer to a wire rack to cool completely.\n",
        "picture_link": "ckLRnEgTCYXPDqo/y/G60/3SmIX8/LS"
    },
    {
        "title": "Easy One-Pan Taco Skillet",
        "ingredients": [
            "1 pound extra lean ground beef ADVERTISEMENT",
            "1 (8.8 ounce) pouch UNCLE BEN'S® Ready Rice® Long Grain & Wild ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "1/2 cup frozen whole kernel corn, thawed ADVERTISEMENT",
            "1 cup shredded white Cheddar cheese ADVERTISEMENT",
            "2 green onions, sliced (optional) ADVERTISEMENT",
            "1 (12 ounce) bag tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large nonstick skillet over medium heat. Cook ground beef, crumbling as it cooks, until browned, about 8 minutes. Drain liquid from pan. Add water and taco seasoning to beef.\nCook rice according to package directions. Add cooked rice to beef mixture; stir in corn. Increase heat and bring to a boil. Simmer until liquid is absorbed, about 7 minutes, stirring constantly. Remove pan from heat.\nSprinkle in the cheese and mix to incorporate. Top with green onions if desired. Serve with tortilla chips.\n",
        "picture_link": "He0p0./A65N.UqsHQK9pk7PNN.Eo6vW"
    },
    {
        "title": "Whipped Banana \"Ice Cream\"",
        "ingredients": [
            "2 bananas, peeled and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sliced bananas in an airtight container and freeze until solid, about 1 1/2 hours.\nBlend frozen bananas in blender until whipped and smooth.\n",
        "picture_link": "29yo22aOfSzgz.yi4miOHcZeEyqnE72"
    },
    {
        "title": "Big Ray's White Bean, Kale, and Kielbasa Soup",
        "ingredients": [
            "1 bunch kale, stems removed and discarded ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "8 ounces kielbasa sausage, sliced thin ADVERTISEMENT",
            "1 bunch green onions, sliced ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 (15.5 ounce) can white beans, drained and rinsed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper to taste ADVERTISEMENT",
            "1 pinch grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Roll kale leaves into tight tubes and cut crosswise into 1/4-inch strips.\nHeat oil in a large, heavy saucepan over medium heat. Cook and stir kielbasa in hot oil until browned, about 5 minutes. Stir green onion with sausage; cook until onions soften, about 3 minutes. Add kale; cook and stir until kale wilts, about 3 minutes.\nPour chicken broth over kielbasa mixture; add beans and stir. Bring the mixture to a boil, reduce heat to low, and cook at a simmer until kale is completely tender, about 15 minutes. Season mixture with salt and pepper and top with Parmesan cheese.\n",
        "picture_link": "ylF61hVitgtzvQkUXO.571A0RLyXwIu"
    },
    {
        "title": "Turkey Tom Kha Gai",
        "ingredients": [
            "6 cups turkey broth ADVERTISEMENT",
            "2 stalks lemongrass, bruised and sliced ADVERTISEMENT",
            "1 (3 inch) piece fresh ginger, sliced ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro stems ADVERTISEMENT",
            "2 kaffir lime leaves, sliced, or more to taste ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes, or more to taste ADVERTISEMENT",
            "1 pound cooked turkey, cut into small cubes ADVERTISEMENT",
            "1 cup clamshell mushrooms, separated ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "2 teaspoons palm sugar ADVERTISEMENT",
            "1 (13 ounce) can coconut milk ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1/4 cup green onions, chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro leaves ADVERTISEMENT",
            "1/4 teaspoon chili oil, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine turkey broth, lemongrass, ginger, cilantro stems, lime leaves, and red pepper flakes in a pot over medium-high heat. Bring to a simmer, reduce heat to medium-low, and simmer until flavors blend, 20 to 30 minutes.\nStain broth mixture through a fine-mesh sieve, discard vegetables, and return broth to the pot.\nStir turkey, mushrooms, fish sauce, and palm sugar into broth; simmer until mushrooms are tender and turkey absorbs broth flavor, about 15 minutes.\nPour coconut milk, lime juice, green onions, and cilantro leaves into broth. Bring soup to a simmer and drizzle in chili oil.\n",
        "picture_link": "2zuE77R9lzTHRcQf/rU.8xgx13Tge2y"
    },
    {
        "title": "Tellang's Breakfast Casserole",
        "ingredients": [
            "2 large potatoes, peeled and grated ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (16 ounce) package bulk pork breakfast sausage (such as Jimmy Dean®) ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 cup shredded Gouda cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a casserole dish.\nRinse shredded potatoes in a colander with cold water; drain and squeeze potatoes to remove liquid.\nMelt butter in a large skillet over medium heat; add potato. Season potato with salt and pepper; stir. Place a cover on the skillet and cook until potato is tender, about 3 minutes.\nHeat a separate skillet over medium-high heat. Cook sausage in the skillet, breaking with a spatula into crumbles, until completely browned, 5 to 7 minutes. Stir potatoes into the sausage and remove skillet from heat. Spread the sausage and potato mixture into the prepared casserole dish.\nBeat eggs and cream together in a bowl; add Gouda cheese and stir. Pour the egg mixture atop the sausage and potato mixture.\nBake in preheated oven until the egg is set, about 25 minutes.\n",
        "picture_link": "FI5q0zUrIQpWHiMl1wBpe9RGQvU.h2q"
    },
    {
        "title": "Totchos Libre",
        "ingredients": [
            "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater Tots®) ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 (1 ounce) packet taco seasoning mix ADVERTISEMENT",
            "1 cup shredded Mexican cheese blend ADVERTISEMENT",
            "1 cup shredded pepperjack cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1/2 cup chopped black olives ADVERTISEMENT",
            "1/2 cup fresh jalapeno pepper slices ADVERTISEMENT",
            "1 avocado - peeled, pitted, and cut into chunks ADVERTISEMENT",
            "1/4 cup chopped scallions ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spread potato nuggets out onto a baking sheet.\nBake in the preheated oven until nuggets are golden brown and crisp, 22 to 24 minutes.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes. Add water and taco seasoning to beef; bring to a boil, reduce heat to low, and simmer until liquid reduces, about 5 minutes.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Arrange potato nuggets on an oven-proof platter and cover evenly with ground beef; spread Mexican cheese and pepperjack cheese over the top.\nCook potato nuggets under the broiler until cheese melts, 1 to 3 minutes. Whisk sour cream and lime juice together in a bowl. Top potato nuggets with tomatoes, black olives, jalapenos, avocado, sour cream mixture, scallions, and cilantro, respectively.\n",
        "picture_link": "h2Py9MmufxzyIOMVHWNKc20UBwWUWvG"
    },
    {
        "title": "Crispy Pork Belly",
        "ingredients": [
            "1/2 pound whole pork belly, skin removed ADVERTISEMENT",
            "1/2 teaspoon smoked paprika, or to taste ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C).\nSeason pork belly all over with smoked paprika, salt, and black pepper. Wrap pork in parchment paper; wrap a second time in aluminum foil, and a third time in another sheet of aluminum foil. Place pork packet in a baking dish.\nRoast in the preheated oven until tender for 6 hours. Let cool in wrappings to room temperature; place cooled packet in refrigerator and chill for 8 hours or overnight.\nUnwrap chilled meat. Save any rendered fat that falls away when unwrapping pork.\nCut meat into 6 equal-size portions. Cut 1/8-inch by 1/8-inch slashes in the fat-side of the pork. Season with salt.\nHeat 2 tablespoons reserved pork fat in a skillet over medium heat. Place pork belly, fat side down, in hot fat; cook until well-browned on all sides and heated through, 5 to 10 minutes. Transfer pork belly to a plate, drizzle with olive oil and season with pepper.\n",
        "picture_link": "aTeG4uzPJT4ALuJ4WpfgIhpO9c/s0Xu"
    },
    {
        "title": "Mrs. Carrigan's Honey Wheat Bread",
        "ingredients": [
            "1 cup warm water ADVERTISEMENT",
            "2 tablespoons warm water ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour warm water, honey, butter, whole wheat flour, bread flour, salt, and yeast, respectively, into the pan of a bread machine.\nSet the bread machine to Basic, 2 pound loaf, light crust, and select Start. Cool completely before slicing.\n",
        "picture_link": "75IWCek8icgSqhL0mYrMcadfpQYywvG"
    },
    {
        "title": "Green Tea Cake",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon honey, or to taste ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 tablespoon green tea powder (matcha) ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat eggs together in a bowl using an electric mixer on medium speed until volume doubles or triples, about 7 minutes. In the following order, add sugar, honey, flour, baking powder, green tea powder, and water to eggs, beating 15 to 30 seconds before each addition. Pour batter into a 9-inch cake pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 25 to 30 minutes.\n",
        "picture_link": "ef.i3pj/sohh/jaGCgnBEgM6JM0ELfm"
    },
    {
        "title": "Tuna and Vegetable Casserole",
        "ingredients": [
            "1/2 (12 ounce) package egg noodles ADVERTISEMENT",
            "1 cup 1-inch pieces fresh-cut green beans ADVERTISEMENT",
            "1 cup bite-size summer squash pieces ADVERTISEMENT",
            "1 cup frozen peas ADVERTISEMENT",
            "1 cup sliced carrots ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/3 cup 2% milk ADVERTISEMENT",
            "1 (7 ounce) can albacore tuna, drained and broken into chunks ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup French-fried onions (such as French's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.\nPreheat oven to 425 degrees F (220 degrees C).\nCombine green beans, squash, peas, and carrots in a microwave-safe glass or ceramic bowl; cook until tender, 3 to 10 minutes. Rinse vegetables with cold water and drain.\nHeat olive oil in a skillet over medium-high heat; saute mushrooms in hot oil until tender, 5 to 7 minutes.\nWhisk mushroom soup and milk together in a large bowl; add vegetables, mushrooms, tuna, onion, and Cheddar cheese. Mix in Worcestershire sauce, salt, and black pepper. Pour mixture into a casserole dish and top with French fried onions.\nBake in the preheated oven until bubbling, about 20 minutes.\n",
        "picture_link": "KR6yE2d1fk49Lvfv9hKuqIuxhrxu9Qy"
    },
    {
        "title": "Grilled Fruit and Vegetable Kabobs",
        "ingredients": [
            "For the kabobs: ADVERTISEMENT",
            "2 small yellow squash, halved lengthwise and cut into 1/4-inch-thick slices ADVERTISEMENT",
            "2 small zucchini, halved lengthwise and cut in 1/4 inch slices ADVERTISEMENT",
            "1/2 medium red onion, diced in 1/2-inch pieces ADVERTISEMENT",
            "1/2 medium red bell pepper, diced in 1/2-inch pieces ADVERTISEMENT",
            "1 cup sliced fresh pineapple, diced in 1/2-inch pieces ADVERTISEMENT",
            "1 cup cherry tomatoes ADVERTISEMENT",
            "8 wooden skewers ADVERTISEMENT",
            "For the marinade: ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 clove garlic, minced fine ADVERTISEMENT",
            "3 tablespoons chopped flat-leaf parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat grill to low, 325 degrees 350 degrees .\nAssemble kabobs, alternating different vegetables and pineapple on wooden skewers.\nCombine all ingredients for marinade in medium bowl and mix well.\nBrush marinade onto fruit and veggie kabobs.\nLine grill with Reynolds Wrap(R) Aluminum Foil.\nPlace kabobs on grill on aluminum foil and grill for 10 to 15 minutes, or until veggies are desired doneness.\nTransfer kabobs to plate to cool before serving.\n",
        "picture_link": "8PFifR.bnaGF93V6vAqbwtufXbTDwQq"
    },
    {
        "title": "Chocolate Coconut Cake from King Arthur Flour®",
        "ingredients": [
            "1/2 cup King Arthur Coconut Flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1/2 cup Dutch-process cocoa powder ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "6 large eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F. Grease an 8 1/2 x 4 1/2-inch loaf pan or an 8-inch square cake pan.\nSift together the coconut flour and baking powder, mixing to combine; set aside.\nIn a large, microwave-safe bowl, melt the butter with the cocoa, stirring until well blended.\nWhisk the sugar, salt, vanilla, and eggs into the butter-cocoa mixture. Add the coconut flour and baking powder, whisking until smooth.\nPour the batter into the prepared pan. Let it rest for 10 minutes.\nBake the loaf or cake until set, and a cake tester inserted into the middle comes out clean. This will take 35 to 45 minutes for the loaf pan, or 30 to 35 minutes for the square pan.\nCool the cake in the pan for 30 minutes before turning it out onto a rack to cool completely. The cake is easiest to slice when it's completely cool.\n",
        "picture_link": "7CRbf1bpMfiQZqS.SeL/X1.qxEhu5YO"
    },
    {
        "title": "Venison Stew",
        "ingredients": [
            "2 tablespoons bacon grease ADVERTISEMENT",
            "2 pounds venison, cut into chunks ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 teaspoon anchovy paste ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 teaspoon ground thyme ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 pound small red potatoes, chopped ADVERTISEMENT",
            "4 carrots, chopped ADVERTISEMENT",
            "1/2 cup sliced mushrooms ADVERTISEMENT",
            "1/2 cup frozen peas ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nHeat bacon grease in an oven-proof pot or Dutch oven over medium heat. Cook and stir venison in the hot grease until browned on all sides, about 5 minutes. Transfer venison to a plate using a slotted spoon. Add onion to hot grease; cook and stir until tender, 4 to 5 minutes.\nMix garlic, tomato paste, and anchovy paste together in a small bowl; add to onions. Stir flour into onion mixture until dissolved.\nPour wine, beef broth, and chicken broth into the pot; bring to a boil while scraping the browned bits of food off of the bottom of the pot with a wooden spoon. Add thyme and bay leaves to pot and bring liquid to a simmer. Return venison to pot. Cover pot.\nSimmer stew in the preheated oven for 1 hour. Add potatoes, carrots, and mushrooms to stew and simmer in the oven until potatoes are tender, about 1 hour more. Add peas and stir.\n",
        "picture_link": "E4882O.zO8Ncdo8y.SC/8l.wwk2M17K"
    },
    {
        "title": "Slow Cooker Pork Loin with Apple Butter",
        "ingredients": [
            "1 (2 1/2 pound) boneless pork loin roast ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup apple butter ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "2 sprigs fresh rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork roast in a slow cooker; sprinkle thyme over the top. Cover roast with onion and garlic; spread apple butter over the top. Pour chicken broth into the bottom of the slow cooker and place rosemary sprigs in broth.\nCook on Low for 6 to 8 hours.\n",
        "picture_link": "IsxhaorpKeFLqzMyEnaDK.lgYIv27q6"
    },
    {
        "title": "Slow-Cooker Cheesy Chicken & Potatoes",
        "ingredients": [
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "1 pound red potatoes, very thinly sliced ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "8 (4 ounce) boneless, skinless chicken thighs, halved ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/4 pound VELVEETA®, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place peppers in slow cooker sprayed with cooking spray; top with potatoes. Sprinkle paprika over chicken. Place 4 thighs in slow cooker; cover with soup and remaining thighs. Cover with lid.\nCook on LOW 6 to 8 hours (or on HIGH 3 to 4 hours).\nUse slotted spoon to transfer chicken and vegetables to platter; cover to keep warm. Set slow cooker on HIGH heat. Add VELVEETA and Worcestershire sauce to reserved liquid in slow cooker; stir. Cover with lid; cook 5 min. Stir until VELVEETA is completely melted and sauce is well blended. Spoon over chicken and vegetables; top with parsley.\n",
        "picture_link": "T8lP5hOpjtxSy2sr0ZeY.pT2QyWNCPO"
    },
    {
        "title": "Southern Sweet Grilled Pork Chops",
        "ingredients": [
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "1/4 cup apple butter ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 (4 ounce) pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk barbeque sauce, apple butter, brown sugar, black pepper, and garlic together in a microwave-safe bowl; heat in microwave until sugar dissolves, about 30 seconds. Stir until sauce is smooth.\nPlace pork chops on a plate and pour sauce over chops. Refrigerate for flavors to soak into pork chops, 1 to 2 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook pork chops on grill until cooked through, about 15 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "eFFDyHmIK/JUwdNQs5WQvDUb8uIgPku"
    },
    {
        "title": "Low-Carb Tuna and Mackerel Cakes",
        "ingredients": [
            "1 (15 ounce) can mackerel in brine, drained ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 (5 ounce) can tuna packed in water, drained ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 egg, beaten ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 teaspoons salt-free seasoning blend (such as Mrs. Dash®) ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon dried sweet basil ADVERTISEMENT",
            "1 (3.5 ounce) bag pork rinds, crushed ADVERTISEMENT",
            "butter-flavored cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mackerel, onion, tuna, Parmesan cheese, mayonnaise, eggs, Dijon mustard, seasoning blend, paprika, and basil together in a bowl. Add pork rind crumbs, 1 to 2 tablespoons at a time, until mixture holds together. Form mixture into balls and flatten into 1/2-inch-thick cakes.\nHeat a large non-stick skillet over medium-high heat and grease with cooking spray. Arrange cakes in the hot skillet and spray each cake with cooking spray.\nCook cakes, working in batches if needed, in the hot skillet until browned, 3 to 5 minutes; gently flatten cakes with the back of a fork. Flip cakes and cook until other side is browned, 3 to 5 minutes. Transfer cakes to a paper towel-lined plate.\n",
        "picture_link": "den3p2IyugQ/8BuDnFoC3tpcGCxqW.q"
    },
    {
        "title": "Tomato Bisque with Chicken",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 (28 ounce) can Italian-style diced tomatoes ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "2 cups shredded roasted chicken ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon sea salt, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Cook and stir onion and garlic in hot oil until onion is soft, about 5 minutes. Sprinkle flour evenly over the onion mixture; add tomatoes, chicken broth, oregano, basil, and parsley.\nBring the liquid to a boil and cook until the tomatoes are softened, 8 to 10 minutes.\nPour soup into a blender no more than half full. Cover and hold lid in place. Pulse blender a few times before leaving on to blend. Puree soup in batches until smooth and return to the pot.\nStir chicken, heavy cream, sea salt, and pepper into the soup; simmer until the chicken is hot, about 5 minutes.\n",
        "picture_link": "IMrtGui11fvDBMM6eOss7Cf2Ne7LklS"
    },
    {
        "title": "Easy Mustard-Glazed Broiled Salmon ",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 teaspoons rice vinegar ADVERTISEMENT",
            "1/2 teaspoon Sriracha hot sauce (optional) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 (5 ounce) salmon fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil and rub with vegetable oil.\nStir mustard, vinegar, Sriracha sauce, and salt together in a bowl until glaze is smooth.\nLay salmon fillets, skin-side down, on the prepared baking sheet. Brush fillets with mustard glaze.\nCook in the preheated oven until salmon is golden and flakes easily with a fork, 5 to 8 minutes.\n",
        "picture_link": "fj3qA72XPRqDxp4jGl7jRt5IKZuZTA2"
    },
    {
        "title": "Chef John's Green Goddess Dressing",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/3 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "1/3 cup chopped fresh tarragon ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "2 tablespoons fresh lemon juice, or more to taste ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 anchovy fillet ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend mayonnaise, sour cream, parsley, tarragon, chives, lemon juice, rice vinegar, anchovy fillet, garlic, cayenne pepper, salt, and black pepper in a blender until smooth.\n",
        "picture_link": "EXNkibcr6nivtUMLg8e1G5zKrS.chlq"
    },
    {
        "title": "7-Layer Salad",
        "ingredients": [
            "1/2 head lettuce, torn ADVERTISEMENT",
            "1 cucumber, peeled and chopped, or more to taste ADVERTISEMENT",
            "3 cups frozen peas, thawed ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "4 hard-boiled eggs, peeled and sliced ADVERTISEMENT",
            "1 cup creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "12 ounces cooked crumbled bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer lettuce, cucumber, peas, Cheddar cheese, and egg, respectively, in a 9x13-inch casserole dish.\nWhisk creamy salad dressing, sugar, and vinegar together in a bowl until dressing is smooth; spread over the egg layer. Crumble bacon over dressing layer.\n",
        "picture_link": "HJSk29drN2dvBFg9gedKI4tiXeR2aeG"
    },
    {
        "title": "Chef John's Peach Blackberry Flognarde",
        "ingredients": [
            "1 1/4 cups milk ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon fresh thyme leaves ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pint fresh blackberries ADVERTISEMENT",
            "1 fresh peach, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a casserole dish.\nWhisk milk, sugar, and flour together in a large bowl. Add eggs, vanilla extract, thyme leaves, black pepper, and salt; whisk until batter is smooth.\nSpread blackberries and peach slices out in the prepared casserole dish. Pour batter over the top.\nBake in the preheated oven until fruit is hot and batter is set, about 45 minutes. Cool completely.\n",
        "picture_link": "j6JWFNDvVlg7oHfiUlMHAHIIHDPEC8K"
    },
    {
        "title": "Christina's Slow Cooker Chili",
        "ingredients": [
            "3 pounds ground beef ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes, or more to taste ADVERTISEMENT",
            "2 (6 ounce) cans tomato paste ADVERTISEMENT",
            "1/4 cup chili powder ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "1 tablespoon chipotle pepper powder ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "3 (14.5 ounce) cans kidney beans, rinsed and drained ADVERTISEMENT",
            "4 cups chopped onions ADVERTISEMENT",
            "4 cups chopped bell peppers ADVERTISEMENT",
            "3 jalapeno peppers, chopped ADVERTISEMENT",
            "2 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nMix diced tomatoes and tomato paste together in the slow cooker; add chili powder, oregano, cumin, chipotle pepper powder, and cayenne pepper and stir. Layer ground beef, kidney beans, onions, bell peppers, jalapeno peppers, and garlic over tomato mixture.\nCook on High for 3 hours. Reduce heat to Low and cook until flavors have blended, at least 3 hours more. Add more diced tomatoes, if desired.\n",
        "picture_link": "/61NxoNwEZZozIYK2OriAwtntHW2y7K"
    },
    {
        "title": "Frozen Strawberry Smoothie Bars",
        "ingredients": [
            "8 fresh strawberries, hulled and quartered ADVERTISEMENT",
            "1/4 cup plain yogurt ADVERTISEMENT",
            "1/4 cup apple juice ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend strawberries, yogurt, apple juice, and honey in a blender until smooth.\nPour blended mixture into ice pop molds; freeze until solid, about 12 hours.\n",
        "picture_link": "XH4yTfo5YSIVA7lk51AVm/s07fJOawi"
    },
    {
        "title": "Garlic, Cilantro, and Lime Sauteed Shrimp",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 cloves garlic, crushed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 pounds shrimp, peeled and deveined ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "1/2 lime, juiced, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat. Saute onion, garlic, salt, and pepper in hot oil until onion is soft and golden, about 5 minutes.\nStir shrimp into onion mixture; saute until shrimp are bright pink on the outside and the meat is no longer transparent in the center, about 2 minutes per side. Season with salt and pepper. Add cilantro and lime juice; toss to coat.\n",
        "picture_link": "hl7.yDQp3emY/JY4c3HqiQgSjwocKia"
    },
    {
        "title": "Tembleque Puerto Rican Coconut Pudding",
        "ingredients": [
            "2 (14 ounce) cans coconut milk ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir coconut milk, sugar, and salt together in a saucepan. Spoon a few tablespoons of the coconut milk mixture into a small bowl and stir cornstarch into the mixture to dissolve; pour into the mixture in the saucepan. Bring the mixture to a boil while stirring constantly; cook until smooth and thick, about 5 minutes.\nPour the coconut milk mixture into molds, cover each with plastic wrap, and refrigerate until cold and firm, 3 hours to 2 days.\nRun a thin knife around the edges of the mold and invert onto a plate to remove putting. Garnish tops with cinnamon.\n",
        "picture_link": "mtoZqAQa/mXBLE9A9JRh4MX0jewiS76"
    },
    {
        "title": "Lemon Chicken Stir-Fry",
        "ingredients": [
            "1 lemon ADVERTISEMENT",
            "1/2 cup reduced sodium chicken broth ADVERTISEMENT",
            "3 tablespoons reduced-sodium soy sauce ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 pound boneless skinless chicken breasts, trimmed and cut into 1-inch pieces ADVERTISEMENT",
            "10 ounces mushrooms, halved or quartered ADVERTISEMENT",
            "1 cup diagonally sliced carrots (1/4-inch thick) ADVERTISEMENT",
            "2 cups snow peas, stem and strings removed ADVERTISEMENT",
            "1 bunch scallions, cut into 1-inch pieces, white and green parts divided ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grate 1 teaspoon lemon zest and set aside. Juice the lemon and whisk 3 tablespoons of the juice with broth, soy sauce and cornstarch in a small bowl.\nHeat oil in a large skillet over medium-high heat. Add chicken and cook, stirring occasionally, until just cooked through, 4 to 5 minutes. Transfer to a plate with tongs. Add mushrooms and carrots to the pan and cook until the carrots are just tender, about 5 minutes. Add snow peas, scallion whites, garlic and the reserved lemon zest. Cook, stirring, until fragrant, 30 seconds. Whisk the broth mixture and add to the pan; cook, stirring, until thickened, 2 to 3 minutes. Add scallion greens and the chicken and any accumulated juices; cook, stirring, until heated through, 1 to 2 minutes.\n",
        "picture_link": "Dm7EHNHUlfDHmMHNmaHXXRL2ExWJMwO"
    },
    {
        "title": "Mikes' Coleslaw",
        "ingredients": [
            "1/2 cup almonds ADVERTISEMENT",
            "5 cups shredded cabbage ADVERTISEMENT",
            "1 1/2 cups dried cranberries ADVERTISEMENT",
            "3/4 cup celery, diced ADVERTISEMENT",
            "3/4 cup chopped green onion ADVERTISEMENT",
            "3/4 cup chopped red bell pepper ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/2 cup mayonnaise (such as Hellman's®) ADVERTISEMENT",
            "1 1/2 tablespoons honey mustard ADVERTISEMENT",
            "1 1/2 tablespoons honey ADVERTISEMENT",
            "3 pinches dried basil, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spread almonds onto a baking sheet.\nToast almonds in the preheated oven until golden and fragrant, about 10 minutes. Cool completely.\nStir cabbage, cranberries, celery, green onion, red bell pepper, and toasted almonds together in a large bowl.\nWhisk mayonnaise, honey mustard, honey, basil, salt, and pepper together in a small bowl until dressing is thick and creamy. Pour dressing over cabbage mixture and stir to coat. Cover the bowl with plastic wrap and refrigerate until flavors combine, about 3 hours.\n",
        "picture_link": "JvNVJPgZdHf8twLQqAeQnLPDHCOaR.S"
    },
    {
        "title": "Strawberry Banana Nutella® Smoothie",
        "ingredients": [
            "6 fluid ounces low-fat milk ADVERTISEMENT",
            "6 ounces plain fat-free Greek yogurt ADVERTISEMENT",
            "1 banana, sliced ADVERTISEMENT",
            "4 fresh strawberries ADVERTISEMENT",
            "2 tablespoons chocolate-hazelnut spread (such as Nutella®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend milk, yogurt, banana, strawberries, and chocolate-hazelnut spread together in a blender until smooth.\n",
        "picture_link": "x9n7iuPoaQuspA8ol0xTdWMl7SdHOIK"
    },
    {
        "title": "Eggs Florentine",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup mushrooms, sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 (10 ounce) package fresh spinach ADVERTISEMENT",
            "6 large eggs, slightly beaten ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons cream cheese, cut into small pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat; cook and stir mushrooms and garlic until garlic is fragrant, about 1 minute. Add spinach to mushroom mixture and cook until spinach is wilted, 2 to 3 minutes.\nStir eggs into mushroom-spinach mixture; season with salt and pepper. Cook, without stirring, until eggs start to firm; flip. Sprinkle cream cheese over egg mixture and cook until cream cheese starts to soften, about 5 minutes.\n",
        "picture_link": "4dZO.MsPRdFp79WcZNoxtvfjijA6MxW"
    },
    {
        "title": "Quick and Easy Carrot and Chickpea Salad",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 clove garlic, finely chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "2 cups shredded carrots ADVERTISEMENT",
            "1 (14 ounce) can chickpeas (garbanzo beans), drained and rinsed ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons chopped white onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, lemon juice, garlic, cumin, salt, and black pepper together in a bowl until dressing is smooth; add carrots, chickpeas, parsley, and onion and toss to coat.\n",
        "picture_link": "hjxpmr9ItaxkbmVx8..F/DuwgXDWUie"
    },
    {
        "title": "S'mores Indoors",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/4 cup coconut oil, melted, divided ADVERTISEMENT",
            "1 cup chocolate chips ADVERTISEMENT",
            "12 large marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease 12 muffin cups with cooking spray.\nStir graham cracker crumbs and 2 tablespoons coconut oil together in a bowl. Press cracker mixture into the bottoms of the prepared muffin cups.\nCombine chocolate chips and remaining coconut oil in a microwave-safe glass or ceramic bowl; melt in the microwave in 30-second intervals, stirring after each melting, for 1 to 1 1/2 minutes (depending on your microwave). Divide melted chocolate mixture evenly among muffin cups.\nPress 1 marshmallow horizontally into chocolate in each muffin cup; refrigerate until chocolate is firm, 1 to 2 hours.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nBake s'mores in the preheated oven until marshmallows are browned and puffed, 1 to 1 1/2 minutes. Return muffin tin to refrigerator to set chocolate and marshmallow, 30 to 60 seconds. Loosen and remove s'mores from the muffin cups with a butter knife.\n",
        "picture_link": "o3.zb5vhNwtXxpiEBgZc07j2qGiCRb."
    },
    {
        "title": "PB Banana Oat Smoothie",
        "ingredients": [
            "1 banana, broken in half ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "1/4 cup old-fashioned rolled oats ADVERTISEMENT",
            "1/2 cup vanilla yogurt ADVERTISEMENT",
            "1/2 cup skim milk ADVERTISEMENT",
            "1 1/2 tablespoons peanut butter ADVERTISEMENT",
            "1 teaspoon honey, or to taste ADVERTISEMENT",
            "1 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put banana, ice, oats, yogurt, skim milk, peanut butter, honey, and cinnamon, respectively, in a blender; blend until smooth.\n",
        "picture_link": "AEzyBYY6DPnaLECgBEpMJZYoDr4LHUe"
    },
    {
        "title": "Lela's Protein Mango Smoothie",
        "ingredients": [
            "1/2 mango, chopped, or more to taste ADVERTISEMENT",
            "1/2 cup low-fat vanilla yogurt ADVERTISEMENT",
            "1/2 cup almond milk ADVERTISEMENT",
            "1/2 cup ice ADVERTISEMENT",
            "1 scoop vanilla whey protein powder ADVERTISEMENT",
            "1 teaspoon honey, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend mango, yogurt, almond milk, ice, protein powder, and honey together in a blender until smooth.\n",
        "picture_link": "91rvbyjPBUQGcwZb/WkjkY.H9vW0/Wa"
    },
    {
        "title": "Crunchy Cauliflower and Tomato Salad",
        "ingredients": [
            "1/3 cup extra-virgin olive oil ADVERTISEMENT",
            "3 tablespoons white wine vinegar ADVERTISEMENT",
            "1 teaspoon fresh lemon juice, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 large head cauliflower, chopped small ADVERTISEMENT",
            "1/4 cup minced red onion ADVERTISEMENT",
            "1/4 cup minced fresh parsley ADVERTISEMENT",
            "2 garlic cloves, minced ADVERTISEMENT",
            "1 cup cherry tomatoes, halved, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, vinegar, lemon juice, salt, and pepper together in a bowl until dressing is smooth.\nMix cauliflower, red onion, parsley, and garlic together in a large bowl. Drizzle dressing over cauliflower mixture; toss to coat. Gently fold tomatoes into salad. Chill salad in refrigerator up to 3 hours before serving.\n",
        "picture_link": "BskaXe/skWGfvRHAdXn3uO6kBbXGHSa"
    },
    {
        "title": "Perfect Vanilla Tea",
        "ingredients": [
            "1 cup boiling water ADVERTISEMENT",
            "1 orange pekoe tea bag ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon white sugar (optional) ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour boiling water into a mug. Steep tea bag in water for 3 minutes; remove and discard.\nStir milk, sugar, vanilla extract, and cinnamon into the tea.\n",
        "picture_link": "VbYqbvvjogbUt7YDD9pNd3Ed0x/Lpsa"
    },
    {
        "title": "Quick Catfish Fillets",
        "ingredients": [
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "4 (6 ounce) fillets catfish ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup oyster sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the flour, salt, and pepper. Dredge the catfish fillets in the flour mixture to lightly coat.\nHeat the olive oil in a large skillet over medium-high heat, and cook the catfish fillets 3 minutes on each side, until golden brown. Reduce heat to medium-low, and brush fillets with oyster sauce. Cover skillet, and continue cooking 5 minutes, or until fish is easily flaked with a fork.\n",
        "picture_link": "RDYs2XCACM..vsG6Iawl2Drc.H.s/Oi"
    },
    {
        "title": "Cucumber Crab Snacks",
        "ingredients": [
            "1 large cucumber, cut into 1/4-inch slices ADVERTISEMENT",
            "1 (8 ounce) package whipped cream cheese ADVERTISEMENT",
            "2 (6 ounce) cans crabmeat, drained and flaked ADVERTISEMENT",
            "1 (8 ounce) jar cocktail sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread each cucumber slice with cream cheese, layer with crabmeat, and top with cocktail sauce. Place in the refrigerator to chill, or serve right away.\n",
        "picture_link": "FTDKwen9RXk/X4lrukUtl7LD17zja3C"
    },
    {
        "title": "Jamaican Patties",
        "ingredients": [
            "3 pounds lean ground beef ADVERTISEMENT",
            "2 cups seasoned bread crumbs ADVERTISEMENT",
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "1 bunch (1-inch) pieces green onions ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup Maggi™ liquid seasoning ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon pepper ADVERTISEMENT",
            "1 teaspoon vinegar-based hot pepper sauce ADVERTISEMENT",
            "2 recipes pie crust pastry ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the ground beef, bread crumbs, tomato sauce, green onions, soy sauce, Maggi seasoning, salt, pepper, and hot sauce. You may need to use your hands. Set aside.\nPreheat the oven to 425 degrees F (220 degrees C).\nRoll out the pie crust dough to 1/8 inch thickness, and cut into 6 inch circles using a large coffee can. Place a heaping tablespoon or slightly more of the meat mixture into the center of the circle, and fold over to make a half circle shape. Crimp the edges together using the tines of a fork, and place the pies on baking sheets. The pies may also be frozen at this point. Whisk together the egg and water in a small bowl using a fork. Brush the egg wash over the tops of the pies.\nBake for 30 to 40 minutes in the preheated oven, until golden brown. If you are baking frozen pies, add an additional 10 minutes.\n",
        "picture_link": "KZIDqoXD9p9POoWHiFS9U1ni1BUXiQe"
    },
    {
        "title": "Colorful Four Bean Salad",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "6 stalks celery, chopped ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped ADVERTISEMENT",
            "1 medium red onion, chopped ADVERTISEMENT",
            "1 (4 ounce) jar pimento peppers, drained and chopped ADVERTISEMENT",
            "1 (14 ounce) can cut green beans ADVERTISEMENT",
            "1 (14.5 ounce) can yellow wax beans ADVERTISEMENT",
            "1 (15 ounce) can lima beans ADVERTISEMENT",
            "1 (15 ounce) can dark red kidney beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk together the white sugar, vinegar, and vegetable oil. Stir in the celery, green pepper, red onion and pimentos. Pour the green beans, wax beans, lima beans and kidney beans into a colander, and rinse under cold water. Let drain for a few minutes, then stir into the bowl with the rest of the salad. Store in a large jar in the refrigerator, and shake or turn occasionally for 1 day to marinate. If you do not have a sealed container, simply stir the salad every few hours. This keeps for about a week, but will be gone sooner.\n",
        "picture_link": "WojThbgCF5fnj4MGE70LzwtSDUB0wNe"
    },
    {
        "title": "Rhode Island Red Clam Chowder",
        "ingredients": [
            "1 (46 fluid ounce) can clam juice ADVERTISEMENT",
            "1 (10 ounce) can whole baby clams, drained and juice reserved ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "3 large carrots, chopped ADVERTISEMENT",
            "3 large potatoes, peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 (6.5 ounce) can tomato sauce ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour clam juice, and the juice from the canned clams into a large pot. Bring to a boil. Add onion, carrots, and potatoes; and simmer over medium heat for 15 minutes, or until tender. Stir in the tomato soup and tomato sauce, and season with parsley and black pepper. Add clams last, and cook just until heated through.\n",
        "picture_link": "r6acxCi.eDbgNz0FGMfgnxxfV/csMCG"
    },
    {
        "title": "Tex Mex Shark and Shrimp",
        "ingredients": [
            "1 (16 ounce) package uncooked wide egg noodles ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 pound shark steaks, cut into chunks ADVERTISEMENT",
            "1 pound frozen medium shrimp ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes and green chiles ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add egg noodles, cook for 6 to 8 minutes, until al dente, and drain.\nHeat the olive oil in a skillet over medium heat. Mix in the shark, shrimp, and tomatoes with green chiles. Cover, and cook 15 minutes, or until shark is easily flaked with a fork.\nServe the shark mixture over the cooked egg noodles. Sprinkle with mozzarella cheese, and season with pepper.\n",
        "picture_link": "xIFtwrOx6Tdo.XlA4iM.iBpnmOdqUzO"
    },
    {
        "title": "Ranch Red Skin Potato Salad",
        "ingredients": [
            "11 red potatoes ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1 (15.5 ounce) container ranch-style dip (such as T. Marzettis®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat. Reduce heat and simmer until tender, about 20 minutes. Drain and refrigerate until cold, then cut into bite-size pieces.\nWhile the potatoes simmer, cook the bacon. Place the bacon in a large skillet; cook over medium-high heat until brown and crisp, about 10 minutes. Drain the bacon slices on a paper towel-lined plate; crumble.\nCombine the cooked potatoes, crumbled bacon, Cheddar cheese, and green onions in a large bowl. Fold in the ranch dip. Refrigerate overnight.\n",
        "picture_link": "tQdiqvLcD1wxidyagaRZ2WSQ7BpnaUW"
    },
    {
        "title": "Pastetnik Potatoes",
        "ingredients": [
            "1 pound potatoes, peeled and cut into 1 inch cubes ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F (220 degrees C).\nIn a medium bowl, toss potatoes with olive oil to coat, and place in a shallow roasting pan or baking dish. Season with salt and pepper.\nBake for 1 hour, or until golden brown and tender. Remove from the oven, and transfer potatoes to a large bowl. Stir in yogurt and mayonnaise to coat. Serve immediately.\n",
        "picture_link": "o0gVG0rtq/nF1gYT.0zD.OdoPQRSkaW"
    },
    {
        "title": "Montigott",
        "ingredients": [
            "2 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "2 (6 ounce) cans tomato paste ADVERTISEMENT",
            "1 pound turkey sweet Italian sausages, casings removed ADVERTISEMENT",
            "1 pound turkey hot Italian sausages, casings removed ADVERTISEMENT",
            "1 1/2 (16 ounce) packages mostaccioli pasta ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 (16 ounce) packages shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the tomato soup, tomato sauce and tomato paste into a slow cooker, and stir to blend. Crumble in the sweet and hot Italian sausages. Cover, and cook on low for 4 to 6 hours, stirring occasionally until the meat is cooked through, and the sauce is flavorful.\nWhen the tomato sauce is almost done, bring a large pot of lightly salted water to a boil. Add the mostaccoli pasta, and cook for 8 to 10 minutes, until tender. Drain and rinse.\nPreheat the oven to 375 degrees F (190 degrees C). Coat a 9x13 inch baking dish and an 8x8 inch baking dish with cooking spray. Layer the noodles and cheese in the two dishes to an even depth ending with cheese on the top, splash a little bit of the milk over each layer of cheese as you go except for the top layer.\nBake for 15 minutes, or until cheese is melted and a little brown on the top. Cut into wedges, and spoon the sauce over them to serve.\n",
        "picture_link": "mI0.foRiELeAx6caoosA/GAbjqJcUQa"
    },
    {
        "title": "Fresh Peach Dumplings Served with Hard Sauce",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter flavored shortening ADVERTISEMENT",
            "5 tablespoons ice water ADVERTISEMENT",
            "6 fresh peaches - peeled, pitted and halved ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the flour and salt. Cut in the butter flavored shortening using your hands or a pastry blender until the mixture resembles coarse crumbs. Sprinkle the ice water over the dough, and stir until the mixture comes together. Knead the dough briefly, then divide into 6 pieces.\nPreheat the oven to 375 degrees F (190 degrees C).\nOn a lightly floured surface roll out each piece of dough into a thin circle. Place two peach halves together, and wrap in each circle of dough, sealing at the top. Place the dumplings onto an ungreased baking sheet.\nBake dumplings for 30 minutes in the preheated oven, or until golden brown. While the dumplings are baking, make the sauce. In a medium bowl, mix together the butter, egg, nutmeg, vanilla and salt using an electric mixer on low speed. Gradually mix in the confectioners' sugar. Spoon over warm dumplings.\n",
        "picture_link": "XCYlNxFr/TcE4FdD0FrOu6E0cyAR1PO"
    },
    {
        "title": "Crab and Shrimp Pasta Salad",
        "ingredients": [
            "1 (16 ounce) package uncooked tri-colored spiral pasta ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package imitation crabmeat, flaked ADVERTISEMENT",
            "1 (6.5 ounce) can tiny shrimp, drained ADVERTISEMENT",
            "1 pint grape tomatoes, halved ADVERTISEMENT",
            "1 English cucumber, diced ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 red bell pepper, seeded and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add the pasta, and cook until tender, about 10 minutes. Drain, and rinse under cold water to cool. Transfer to a large bowl, and set aside.\nIn a small bowl, mix together the mayonnaise, vinegar, olive oil, salt and pepper. Pour over the pasta and stir to coat. Add the crab, shrimp, tomatoes, cucumber, black olives and bell pepper; mix gently to coat with the dressing. Taste, and adjust seasoning if desired. If the pasta is too dry, mix in more mayonnaise.\n",
        "picture_link": "zNqG.b8uX68SpvfDxGXCAyRT/qA2/FG"
    },
    {
        "title": "Sun-Dried Tomato Palmiers",
        "ingredients": [
            "6 oil-packed sun-dried tomatoes ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 (8 ounce) can refrigerated crescent dinner rolls ADVERTISEMENT",
            "1 egg yolk, beaten with 1 teaspoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Drain sun-dried tomatoes, reserving 1 1/2 tablespoons oil. Finely chop the sun-dried tomatoes.\nIn a small bowl, combine, sun-dried tomatoes, reserved oil, garlic, and 1 tablespoon Parmesan cheese.\nLay roll dough out flat, and seal perforations. Spread tomato and cheese mixture evenly over the dough. Starting at one long end, roll the dough up to the middle. Roll up other long end to meet in the middle. Cut into 1/2 inch slices. Arrange on a greased cookie sheet, and brush with egg yolk mixture.\nBake in preheated oven for 5 minutes, or until golden brown. Turn over, and continue baking for 5 minutes. Remove from oven, and sprinkle with remaining 2 tablespoons Parmesan cheese. Serve warm.\n",
        "picture_link": "AYd6OnRrNlHFMDTXOXTX20MZaFF52JG"
    },
    {
        "title": "Leftover Roast Brunswick Stew",
        "ingredients": [
            "1 1/2 pounds cooked, shredded beef chuck roast ADVERTISEMENT",
            "2 (10 ounce) cans mixed vegetables, with liquid ADVERTISEMENT",
            "2 1/2 cups barbeque sauce ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the shredded roast in a slow cooker. Mix in the vegetables with liquid, barbeque sauce, Worcestershire sauce, and beef broth.\nCover, and cook at least 1 hour on High.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pineapple Jupiter",
        "ingredients": [
            "2/3 cup cold milk ADVERTISEMENT",
            "1/3 cup cold water ADVERTISEMENT",
            "1 (6 ounce) can frozen pineapple juice concentrate ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 banana, peeled and chopped ADVERTISEMENT",
            "6 ice cubes ADVERTISEMENT",
            "ground cinnamon to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, blend the milk, water, pineapple juice concentrate, sugar, vanilla extract, banana, and ice cubes until smooth. Sprinkle with cinnamon, and serve immediately.\n",
        "picture_link": "yfNS4usm4xJf0MYLBPilgZgw19d5vNK"
    },
    {
        "title": "Southern Sauce",
        "ingredients": [
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together the mayonnaise, mustard and sugar until well blended. I like to stir 50 times clockwise, and 50 times counter clockwise to get the sauce nice and thick.\n",
        "picture_link": "0Dwa4Msfb8W9p6V/p0.Amm9tnK2GQda"
    },
    {
        "title": "Chinese Dan-Bin",
        "ingredients": [
            "1 slice bacon ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (6 inch) corn tortilla ADVERTISEMENT",
            "1/4 cup sweet corn kernels ADVERTISEMENT",
            "1 tablespoon smooth salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fry the slice of bacon in a skillet over medium-high heat. Set aside. Reduce the heat to medium. Pour the egg into the skillet, and sprinkle with corn. Cook for less than 10 seconds.\nLay the tortilla over the whole egg. After the egg is firm and attached to the tortilla, flip over, and lay the bacon on top. Put salsa over the bacon, and wrap. Remove from the skillet, cut into small pieces and serve hot.\n",
        "picture_link": "F1.pNGISArnPyuf7gncZv/Sy3Wf7n/2"
    },
    {
        "title": "Coleslaw with Peas",
        "ingredients": [
            "1 (10 ounce) package frozen peas, thawed ADVERTISEMENT",
            "2 cups finely shredded cabbage ADVERTISEMENT",
            "1 green onion, thinly sliced ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "1 teaspoon white wine vinegar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon curry powder ADVERTISEMENT",
            "3/4 cup salted peanuts, coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix the peas, cabbage, and green onion.\nIn a separate bowl, mix the sour cream, mayonnaise, mustard, vinegar, salt, and curry powder.\nPour the sour cream mixture over the cabbage mixture, and toss to coat. Cover, and refrigerate at least 1 hour, or overnight. Sprinkle with peanuts to serve.\n",
        "picture_link": "4EwYv8Pe6XJEv2mTQND2faVDq40jvF2"
    },
    {
        "title": "Honey and Onion Mustard Sauce",
        "ingredients": [
            "1/2 cup spicy brown mustard ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1/4 cup finely chopped green onion (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the mustard, honey, mayonnaise, lemon juice and onion powder. For best results, use an electric hand mixer, but do not whip. Stir in green onion. Use immediately, or refrigerate until needed.\n",
        "picture_link": "MFqiPFmWF3H.aB0ysDD09jtlAQZYjC."
    },
    {
        "title": "Jerk Chicken Pizza",
        "ingredients": [
            "1 green bell pepper ADVERTISEMENT",
            "4 teaspoons olive oil, divided ADVERTISEMENT",
            "1 skinless, boneless chicken breast half - finely chopped ADVERTISEMENT",
            "1 tablespoon jerk sauce, or to taste ADVERTISEMENT",
            "3 cloves garlic, diced ADVERTISEMENT",
            "1 portobello mushroom, finely chopped ADVERTISEMENT",
            "1 (10 ounce) package pre-baked thin pizza crust ADVERTISEMENT",
            "1/2 cup pizza sauce ADVERTISEMENT",
            "1 (4 ounce) package thinly sliced salami ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler. Brush the green pepper with 1 teaspoon olive oil, and place on a baking sheet. Broil about 5 minutes on each side, until skin begins to scorch. Remove from heat, and seal in a plastic container for 15 minutes. Cut into strips, remove seeds, pulp, and skin, and dice.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat the remaining olive oil in a skillet over medium heat, and cook the chicken 10 minutes, until juices run clear. Mix in the roasted green pepper, jerk sauce, garlic, and portobello mushroom. Cook and stir 5 minutes, until heated through.\nPlace the pizza crust on a pizza pan, and spread with pizza sauce. Arrange the salami, then the chicken mixture evenly over the sauce. Top with mozzarella cheese.\nBake pizza 10 minutes in the preheated oven, or until cheese is melted and bubbly.\n",
        "picture_link": "EgjS2GWTxiX.s0.erIO/8rG63lSHdTW"
    },
    {
        "title": "Duck Cassoulet",
        "ingredients": [
            "1 pound pork sausage links, sliced ADVERTISEMENT",
            "1 tablespoon whole cloves ADVERTISEMENT",
            "1 whole onion, peeled ADVERTISEMENT",
            "3 sprigs fresh parsley ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "1/2 pound bacon ADVERTISEMENT",
            "1 sprig fresh rosemary ADVERTISEMENT",
            "1 pound dry navy beans, soaked overnight ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "3 carrots, peeled and sliced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 pound skinned, boned duck breast halves, sliced into thin strips. ADVERTISEMENT",
            "1 fresh tomato, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, brown the sliced sausage over medium heat.\nInsert whole cloves into onion. Roll bacon up, and tie with a string. Tie together parsley, thyme, and rosemary.\nIn a large slow cooker, place soaked beans, sausage, bacon, onion studded with cloves, fresh herbs, bay leaf, carrots, minced garlic, and duck. Add enough water to cover the other ingredients. Cook for 1 hour on HIGH. Reduce heat to LOW, and continue cooking for 6 to 8 hours.\nRemove onion, bacon, and herbs. Stir in chopped tomatoes. Continue cooking for 1/2 hour. Serve.\n",
        "picture_link": "3orn4EPXTt9N.GZiXihFXODaaYtw1UG"
    },
    {
        "title": "Carolyn's KOOL-AID® Pickles",
        "ingredients": [
            "1 (32 ounce) jar dill pickles ADVERTISEMENT",
            "2 (0.13 ounce) packages unsweetened red KOOL-AID® ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Open pickle jar, and pour off the liquid from the jar into a bowl. Add KOOL-AID(R) and sugar to the pickle liquid, and stir until the sugar is completely dissolved. Pour mixture back into the pickle jar, making sure that pickles are completely covered and there are no air spaces. Cover jar tightly and shake well.\nRefrigerate the pickles for at least one week before serving.\n",
        "picture_link": "fEPQDgf4ziK96RXfQV.ILQwap0JEDe."
    },
    {
        "title": "Vietnamese Chicken Cabbage Salad",
        "ingredients": [
            "1 head cabbage, cored and shredded ADVERTISEMENT",
            "2 onions, halved and thinly sliced ADVERTISEMENT",
            "2 cups shredded, cooked chicken breast ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons lemon juice, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the cabbage, onions, and chicken. Toss with olive oil until everything is lightly coated. Season with salt and pepper and continue to toss while adding lemon juice. Add enough lemon juice so that you can taste it in every bite. Cover and refrigerate for at least 4 hours before serving. The longer it sets the more the flavors mesh together and the better it tastes!\n",
        "picture_link": "BginrdsIcke8m5k45v1DLV9lipPFCBO"
    },
    {
        "title": "Easy Pumpkin Rice",
        "ingredients": [
            "4 cups instant rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 (29 ounce) can pumpkin puree ADVERTISEMENT",
            "1 1/2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the rice and water in a large saucepan over medium heat; bring to a boil; cover and reduce heat to medium-low; simmer until the water is completely absorbed, 15 to 20 minutes.\nStir together the pumpkin puree, pumpkin pie spice, brown sugar, butter, and salt in a separate saucepan over medium-low heat. Cook until warm. Stir pumpkin mixture into cooked rice.\n",
        "picture_link": "UOUiH9IqM0NymLRRqwUipTdjCI6XUNG"
    },
    {
        "title": "Mom's Creamy Asparagus Spread",
        "ingredients": [
            "1 (15 ounce) can asparagus tips, drained ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup finely chopped almonds ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "1 teaspoon finely minced onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash asparagus in bowl; pour off any remaining liquid. Mix in the cream cheese, almonds, mayonnaise, and onion until thoroughly blended. Cover, and refrigerate until serving.\n",
        "picture_link": "Ha24VWLbcVudCWXovi1QxG28Ot7O2tO"
    },
    {
        "title": "North Carolina BBQ Sauce",
        "ingredients": [
            "1 gallon white vinegar ADVERTISEMENT",
            "1 1/3 cups cayenne pepper ADVERTISEMENT",
            "1 1/8 cups ground black pepper ADVERTISEMENT",
            "3/4 cup mustard powder ADVERTISEMENT",
            "1/2 cup salt ADVERTISEMENT",
            "3 lemons ADVERTISEMENT",
            "2 (10 fluid ounce) bottles Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the vinegar, cayenne pepper, black pepper, mustard powder, salt, lemons, and Worcestershire sauce in a large pot; bring to a simmer. Bring to a boil, then turn heat to low and simmer for at least 30 minutes.\n",
        "picture_link": "8zW58wRk9gBWSqHwQCM.KSa4ZEMeDbO"
    },
    {
        "title": "Authentic Chinese Steamed Fish",
        "ingredients": [
            "1 (4 pound) whole rockfish, dressed ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 green onion, thinly sliced diagonally ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger, peeled and cut into matchstick strips ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot 1/2 full with water and place a bamboo steamer with lid on top of the pot. Bring to a rolling boil. Scrub the scales off of the fish and rinse with cold water. Place the fish onto a small metal plate, belly side down.\nPlace into the steamer and cover. Cook until the fish is no longer opaque and flakes easily, 10 to 12 minutes. Try not to take the lid off the pot until it is done steaming; this will ensure a fully-cooked and tender fish.\nWhile the fish is steaming, combine the vegetable oil, green onions, and ginger in a small saucepan. Cook over medium-high heat until the ginger bubbles. Carefully pour the hot oil over the steamed fish. Drizzle with soy sauce to serve.\n",
        "picture_link": "54/wMeXRad2MkXA1qqOfm3HjeX.12z2"
    },
    {
        "title": "Caramel Liqueur",
        "ingredients": [
            "2 (14 ounce) cans sweetened condensed milk ADVERTISEMENT",
            "1 1/4 cups spiced rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the labels from the cans of milk. Place the cans into a large saucepan, and cover with a few inches of water. Bring to a boil over high heat, then reduce heat to medium, cover, and simmer for 4 hours. Keep an eye on the water level, and add water as needed to keep at least an inch of water above the cans. After the cans have boiled for 4 hours, remove from the boiling water and set aside to cool for 35 minutes.\nOpen the cans and scrape the browned milk into a bowl, whisk in the spiced rum until smooth, then pour into a bottle with a top. The liqueur will keep for several months in the refrigerator.\n",
        "picture_link": "wEnncbJaglKgUPolR7IpZK8AmQWZhna"
    },
    {
        "title": "Beef Pinwheels II",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1 cup corn flakes cereal, coarsely crushed ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon chopped fresh parsley ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/8 tablespoons white sugar ADVERTISEMENT",
            "3/8 cup shortening ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease two baking sheets.\nBeat the egg in a bowl until smooth. Add the ground beef, cayenne pepper, crushed cereal, onion, salt, black pepper, and parsley. Mix until evenly combined; set aside. Stir together the flour, baking powder, salt, and sugar in a separate bowl. Cut in the shortening with a pastry blender until no lumps of shortening remain and the mixture takes on a sandy appearance. Stir in the milk until a dough forms.\nRoll the dough out to a 10x15-inch rectangle on a well-floured surface. Spread the meat mixture evenly over the entire surface of the dough. Roll the dough into a cylinder from one of the wide ends to form a 15-inch long log. Cut the log into 3/4-inch slices and place on to the prepared baking sheets.\nBake in the preheated oven until dark golden brown, 30 to 45 minutes. Serve hot.\n",
        "picture_link": "cfAjYG7bPP3PIxjFBtJnrw43VCd9wbK"
    },
    {
        "title": "Turkey Curry",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1/2 teaspoon ground tumeric ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "2 green chile peppers, halved lengthwise ADVERTISEMENT",
            "1 pound cubed cooked turkey ADVERTISEMENT",
            "1 teaspoon spicy red chili powder ADVERTISEMENT",
            "1/2 tablespoon garam masala ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil over medium heat in a large skillet. Sprinkle the cinnamon into the oil and stir until fragrant. Stir the onion into the cinnamon oil and cook for 5 minutes, until softened and golden in color. Stir in the garlic, ginger, and turmeric, and continue to cook for 3 additional minutes. Pour in 1/4 water and cook for 2 minutes, adding a bit more water if mixture is too thick.\nStir the green chilies, turkey, chili powder, garam masala, and the rest of the water into the sauce. Cover and cook for 10 minutes until mixture has thickened to sauce consistency, adding additional water if mixture looks dry. Taste the curry and add salt if needed.\n",
        "picture_link": "7.jHBcl5HHlHHIjpROrDabzJrr7Sxxq"
    },
    {
        "title": "Melonade",
        "ingredients": [
            "1 cup ice cubes ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers melon liqueur ADVERTISEMENT",
            "2 fluid ounces sweet and sour mix ADVERTISEMENT",
            "1 fluid ounce vodka ADVERTISEMENT",
            "2 fluid ounces lemon-lime soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a tumbler with ice cubes and pour in the melon liqueur, sour mix, vodka, and lemon-lime soda. Stir to mix.\n",
        "picture_link": "kgzeM/1jCJiXbf/IFtNDiKU.Gha5KCm"
    },
    {
        "title": "Sherika's Easy Corn Fudge",
        "ingredients": [
            "2 3/4 cups semisweet chocolate chips ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 1/4 cups frozen corn kernels ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the chocolate chips, milk, corn, and salt in a small saucepan over low heat. Stir and cook until chocolate is melted. Remove from heat and stir in the vanilla.\nLine a square dish with waxed paper. Spread the chocolate mixture into the lined dish. Chill in refrigerator until firm, about 2 hours. Peel off waxed paper and cut into small squares. Store covered in refrigerator.\n",
        "picture_link": "xZWsTf9CB660mG1jKoCVJWT376AxnnG"
    },
    {
        "title": "Sweet Tomato Meatballs",
        "ingredients": [
            "3 tablespoons water ADVERTISEMENT",
            "3 sun-dried tomatoes, finely chopped ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/4 onion, minced ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1/4 cup half-and-half ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the water and tomatoes in a small saucepan over medium heat; cook until the water is absorbed.\nMix together the tomatoes, ground beef, onion, bread crumbs, half-and-half, salt, and pepper in a bowl. Form the mixture into golf ball-sized spheres.\nHeat the olive oil in a skillet over medium heat. Cook the meatballs in the heated oil until no longer pink in the center, turning several times to maintain even coloring; remove and set aside, reserving drippings in the skillet. Stir the water and cornstarch together to dissolve cornstarch, then mix into the drippings. Replace skillet over medium heat, bring to a boil and stir until thickened; serve on side of meatballs.\n",
        "picture_link": "KyNAvl1t6R3rKQ6y0D9LhwSdGDOEUPO"
    },
    {
        "title": "Persimmon Cheesecake",
        "ingredients": [
            "2 cups chopped walnuts ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "2 cups pureed persimmons ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 1/4 cups sour cream ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nChop the walnuts in a food processor until fine. Mix together in a bowl with the brown sugar and melted butter. Press the mixture into the bottom of a 9-inch springform pan.\nBake in the preheated oven for 12 minutes. Set aside to cool completely.\nCombine the persimmons, cream cheese, 1 1/4 cup sugar, 3/4 cup sour cream, cinnamon, and ginger in a food processor. Blend in processor until smooth, stopping occasionally to scrape edges of food processor bowl with a spatula. Add the eggs, one at a time, and process until fully incorporated. Pour the mixture over the cooled crust.\nBake in the preheated oven until mostly set with the center being slightly jiggly, 60 to 75 minutes.\nWhile the cheesecake is baking, whisk together the 1 1/4 sour cream, 3 tablespoon white sugar, and vanilla extract. Spread evenly over the cheesecake while still hot and return to oven another 10 minutes. Allow to cool completely. Loosely cover with aluminum foil and refrigerate 4 to 8 hours or overnight before serving.\n",
        "picture_link": "B6DKaiVAh75HSn50.MVid.rQaW9tqsC"
    },
    {
        "title": "Tostones",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 green plantains, peeled, and cut into 1-inch pieces ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat. Add the plantain slices and fry until they soften, 5 to 10 minutes. Remove from the oil and drain on paper towels.\nUse a tostonera (a press) to slightly mash each piece until it is about 1/2 inch thick. If you do not have a tostonera, use a mallet or place the pieces between a folded paper bag and press down with a saucer. Press all of the pieces before going onto the next step.\nReturn the pieces to the hot skillet and fry until crispy, about 3 minutes per side. Drain on paper towels and season with garlic powder and salt while still warm.\n",
        "picture_link": "PpXgZhHLEx7FQ45vWRZW6302rIOAgwW"
    },
    {
        "title": "Crock Pot or Slow Cooked Flank Steak",
        "ingredients": [
            "3 pounds flank steak ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 large carrot, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1/4 teaspoon ground dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the flank steak with salt and pepper and place into a slow cooker. Add the carrot and onion; season with thyme and bay. Pour in the water.\nCook on High for 4 hours; turn the steak over and press down into the liquid. Continue cooking until a fork easily passes through the meat, about 4 hours more.\n",
        "picture_link": "6LIOMbkxQl6cTHarl3W21vqwO0i0sZC"
    },
    {
        "title": "Classic ANGEL FLAKE Coconut Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (7 ounce) package BAKER'S ANGEL FLAKE Coconut, divided ADVERTISEMENT",
            "1 cup cold milk ADVERTISEMENT",
            "1 pkg. (4 serving size) JELL-O Vanilla Flavor Instant Pudding & Pie Filling ADVERTISEMENT",
            "1/4 cup powdered sugar ADVERTISEMENT",
            "1 (8 ounce) tub COOL WHIP Whipped Topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare cake batter as directed on package; stir in 2/3 cup of the coconut. Pour evenly into two 9-inch round baking pans. Bake as directed on package. Cool in pans 10 min.; remove to wire racks. Cool cakes completely.\nPour milk into medium bowl. Add dry pudding mix and sugar. Beat with wire whisk 2 min. or until well blended. (Mixture will be thick.) Gently stir in whipped topping. Refrigerate 15 min.\nPlace one cake layer on serving plate; spread top with 1 cup of the pudding mixture. Sprinkle with 3/4 cup of the remaining coconut; cover with second cake layer. Spread top and side with remaining pudding mixture; press remaining coconut into pudding mixture. Refrigerate at least 1 hour. Store leftovers in refrigerator.\n",
        "picture_link": "3/QKfxG/zJ/nHXZIAz.EXls5OLWoAhG"
    },
    {
        "title": "The Ultimate Shaken Bloody Mary",
        "ingredients": [
            "2 (12 fluid ounce) cans tomato juice ADVERTISEMENT",
            "1/4 teaspoon hot sauce such as Tabasco ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon dill weed ADVERTISEMENT",
            "1 tablespoon seafood seasoning, such as Old Bay™ ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 cup vodka ADVERTISEMENT",
            "4 cornichons (small dill pickles) ADVERTISEMENT",
            "2 cups ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the tomato juice, hot sauce, Worcestershire sauce, dill, seafood seasoning, celery salt, and vodka into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into ice-filled glasses, and garnish with cornichons to serve.\n",
        "picture_link": "YzxYVSiaHM9v.2Y3UoWCDsVJ66AccQC"
    },
    {
        "title": "Peaches 'N Cream Banana Breakfast Smoothie",
        "ingredients": [
            "1 1/4 cups milk ADVERTISEMENT",
            "1/4 cup vanilla yogurt ADVERTISEMENT",
            "1 banana, broken into chunks ADVERTISEMENT",
            "1 packet peaches and cream flavor instant oatmeal ADVERTISEMENT",
            "2 packets granular no-calorie sucralose sweetener (such as Splenda®) (optional) ADVERTISEMENT",
            "5 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the milk, yogurt, banana, instant oatmeal, sweetener, and ice cubes into a blender. Cover, and puree until smooth. Pour into glasses to serve.\n",
        "picture_link": ".l2QGOJiZhFLWu797jn3JaKK9SfZTjC"
    },
    {
        "title": "Pittsburgh Football Party Cilantro Salsa",
        "ingredients": [
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "3 large fresh tomatoes, diced ADVERTISEMENT",
            "1 red onion, diced ADVERTISEMENT",
            "2 jalapeno peppers, seeded and chopped (optional) ADVERTISEMENT",
            "2 tomatillos, diced ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 teaspoon hot chili sauce (such as Sriracha) (optional) ADVERTISEMENT",
            "1 teaspoon freshly ground cumin seed ADVERTISEMENT",
            "salt, to taste ADVERTISEMENT",
            "corn tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the cilantro, tomatoes, red onion, jalapeno, tomatillos, lime juice, hot chili sauce and cumin seed in a large bowl. Season with salt to taste.\nCover and refrigerate overnight before serving to blend flavors. Serve with tortilla chips.\n",
        "picture_link": "naoB3TJBOa7RIc15mxmzsM9llxnE9gi"
    },
    {
        "title": "Sweet Potato Pie with Marshmallow Meringue Topping",
        "ingredients": [
            "Graham Cracker Crust: ADVERTISEMENT",
            "1 1/2 cups crushed graham crackers ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "5 tablespoons butter, melted ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "Sweet Potato Pie Filling: ADVERTISEMENT",
            "1 1/2 cups canned sweet potatoes, drained and mashed ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup whipping cream ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground mace ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "Meringue Topping: ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix the graham cracker crumbs together with 1/3 cup white sugar, butter, and 1/8 teaspoon salt in a mixing bowl. Spread evenly over the bottom and sides of a 9 inch pie pan.\nBake the graham cracker crust in preheated oven until lightly browned, about 5 minutes. Remove from oven, and cool on a rack.\nPreheat oven to 400 degrees F (200 degrees C).\nTo make the sweet potato filling, place the mashed sweet potatoes in a mixing bowl. Whisk in the brown sugar, whipping cream, eggs, vanilla, cinnamon, mace, and salt until smooth and evenly blended. Pour the sweet potato mixture into the baked graham cracker crust.\nBake the pie in preheated oven until the center is set, about 45 minutes. Remove from oven and cool on a rack.\nTo make the marshmallow meringue, place the marshmallows and milk in a pan; cook over low heat, folding mixture gently until marshmallows are half melted. Remove pan from the heat. Continue folding until marshmallows melt completely, and the mixture becomes smooth and fluffy.\nPlace the egg whites in a separate mixing bowl, and beat until soft peaks form. Gradually add 1/4 cup white sugar, and continue beating until stiff peaks form. Beat in vanilla and salt. Gently fold the egg whites into the marshmallow mixture, and spread over the top of the pie.\nReturn the pie to the oven and cook until the meringue is toasted, 5 to 10 minutes.\n",
        "picture_link": "3PXBcCf9/XKj28nlRRCpewoms1/pejq"
    },
    {
        "title": "The BEST Macaroni Salad You Will EVER Have!!",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 (12 ounce) can tuna in water, drained and flaked ADVERTISEMENT",
            "6 hard-cooked eggs, chopped ADVERTISEMENT",
            "2 large tomatoes, finely chopped ADVERTISEMENT",
            "1 large white onion, finely chopped ADVERTISEMENT",
            "1 cucumber, finely chopped ADVERTISEMENT",
            "3 cups creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1/2 cup 2% milk ADVERTISEMENT",
            "1/4 cup white sugar, or to taste ADVERTISEMENT",
            "3 tablespoons prepared yellow mustard ADVERTISEMENT",
            "1 1/2 tablespoons ground black pepper, or to taste ADVERTISEMENT",
            "1/2 tablespoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water until cooked through but firm to the bite, 8 minutes; drain. Rinse with cold water to cool completely; drain.\nMix macaroni, tuna, eggs, tomatoes, onion, and cucumber in a large mixing bowl.\nWhisk salad dressing and milk together in a separate bowl until smooth. Beat sugar, mustard, pepper, and salt into the dressing mixture; pour over the macaroni mixture and stir to coat.\nCover bowl with plastic wrap and refrigerate at least 2 hours.\n",
        "picture_link": "Upl9NFvQNgs7AnvL7ES9uOOJCM8uBBK"
    },
    {
        "title": "Watergate Salad from DOLE®",
        "ingredients": [
            "1 (4 serving size) package instant pistachio flavor pudding mix ADVERTISEMENT",
            "1 (20 ounce) can DOLE® Crushed Pineapple, undrained ADVERTISEMENT",
            "1 cup miniature marshmallows ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 1/2 cups thawed whipped topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix dry pudding mix, crushed pineapple, marshmallows and pecans in large bowl until well blended. Gently stir in whipped topping; cover.\nRefrigerate 1 hour or until ready to serve.\n",
        "picture_link": "UoXuThZAxpMBp34Azn6K7N9GJx4nQRi"
    },
    {
        "title": "Shrimp and Jalapeno Nachos",
        "ingredients": [
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 avocado, peeled and pitted ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 pound small Gulf shrimp (50 to 60 per pound), thawed and drained ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/4 teaspoon ground dried chipotle pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "50 large (restaurant-style) tortilla chips, or as needed ADVERTISEMENT",
            "2 jalapeno peppers, seeded and very thinly sliced ADVERTISEMENT",
            "3 1/2 cups shredded pepperjack cheese, or as needed ADVERTISEMENT",
            "15 cherry tomatoes, sliced - or as needed ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sour cream, avocado, and lemon juice in a blender or food processor; blend until smooth and creamy. Transfer into a plastic decorating bottle with a long tip. Refrigerate avocado-cream sauce until needed.\nPlace shrimp into a bowl; combine with vegetable oil, ground chipotle pepper, salt, black pepper, and cayenne pepper.\nPlace a large nonstick pan over high heat. Cook shrimp in the hot pan in a single layer until barely cooked through and pink, about 1 minute per side. Transfer to a plate and let shrimp cool.\nPreheat the oven's broiler. Line a baking sheet with aluminum foil and lightly grease the foil.\nLay tortilla chips onto the prepared baking sheet in a single layer. Place 1 shrimp onto each chip. Add 1 slice jalapeno and 1 large pinch pepperjack cheese on top of each shrimp.\nBroil under preheated broiler until cheese is melted and chips are lightly toasted, about 1 minute. Watch carefully; chips will burn quickly.\nRemove nachos from baking sheet and arrange onto a serving platter; drizzle with avocado-cream sauce and sprinkle with cherry tomatoes and cilantro before serving.\n",
        "picture_link": "duxmAj6ULnlsu8VMceANjKbgHGTgZ3O"
    },
    {
        "title": "Whitney and Ashley's Flawless Roasted Vegetables",
        "ingredients": [
            "1 sheet Reynolds® Parchment Paper ADVERTISEMENT",
            "1 medium onion, cut into 1/2 -inch wedges ADVERTISEMENT",
            "2 large zucchini, sliced 1/2-inch thick ADVERTISEMENT",
            "2 large yellow squash, sliced 1/2-inch thick ADVERTISEMENT",
            "1 medium red bell pepper, sliced 1/2-inch thick ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 teaspoons dried Italian seasoning* ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "1 lemon, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F.\nLine a shallow baking pan with Reynolds(R) Parchment Paper.\nPlace vegetables in a large bowl. Add olive oil, seasoning or herbs, salt and pepper and toss to coat.\nSpread vegetables in a single layer in the parchment paper-lined pan. Sprinkle additional Italian seasonings or fresh herbs on top of the vegetables, if desired.\nPlace pan of vegetables into the oven on the top rack.\nBake 15 minutes or until vegetables are crisp-tender.\nSqueeze lemon over vegetables for even more flavor.\n",
        "picture_link": "hU6mE7xPUv306G/Sv7oLviMhBkG6EY2"
    },
    {
        "title": "Summer Fresh Raspberry Pie",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "4 cups fresh raspberries, divided ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 (9 inch) baked pie crust ADVERTISEMENT",
            "1 cup whipped cream for garnish ADVERTISEMENT",
            "1 teaspoon lemon zest for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 cup raspberries and 1/2 cup water in a saucepan over medium heat; cook and stir until raspberries soften, about 5 minutes. Strain raspberries into a bowl through a fine mesh sieve; discard seeds. Return mashed berries to the saucepan.\nStir cornstarch and 1/4 cup cold water in a bowl until dissolved and stir into mashed berries; add sugar.\nHeat raspberry mixture over medium heat, stirring constantly, until thickened, about 5 minutes. Stir in lemon juice. Allow raspberry sauce to cool to room temperature.\nLine the prepared pie crust with remaining 3 cups raspberries. Pour raspberry sauce over berries and chill until set. Serve garnished with whipped cream and lemon zest.\n",
        "picture_link": "DKUCQxRCleC8T7KbqxTU0TU21GomBtO"
    },
    {
        "title": "Peanut-Butterfinger Cream Pie",
        "ingredients": [
            "1 (10 inch) graham cracker or chocolate crumb crust ADVERTISEMENT",
            "1 (8 ounce) package reduced-fat cream cheese, at room temperature ADVERTISEMENT",
            "1/2 cup creamy peanut butter ADVERTISEMENT",
            "1/2 cup powdered sugar ADVERTISEMENT",
            "1 (8 ounce) container light frozen whipped topping, thawed, divided ADVERTISEMENT",
            "4 NESTLE® BUTTERFINGER® Fun Size Candy Bars, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese, peanut butter and powdered sugar in large mixer bowl until smooth. Stir in about 1 cup whipped topping until well mixed. Fold in remaining whipped topping. Chop 3 Butterfinger bars and fold into mixture until well distributed.\nSpoon into crust. Freeze for 3 to 4 hours or until firm. Before serving, chop remaining Butterfinger bar and sprinkle around perimeter of pie.\n",
        "picture_link": "pTOpiPw8x6ZMynxqHjwj6G4YNz81tAm"
    },
    {
        "title": "Grilled Kale Salad",
        "ingredients": [
            "olive oil cooking spray ADVERTISEMENT",
            "1 bunch kale, stems removed and discarded, leaves torn into bite-sized pieces ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "2 carrots, cut into matchstick-sized pieces ADVERTISEMENT",
            "2 jalapeno peppers, seeded and diced, or to taste ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate. Form a sheet of aluminum foil into the shape of a baking sheet; spray with cooking spray.\nMix kale, red onion, carrots, jalapeno peppers, garlic, olive oil, salt, and pepper together in a bowl. Spread kale mixture onto the prepared aluminum foil.\nPlace the aluminum foil 'baking sheet' onto the preheated grill; cook, tossing kale using tongs, until kale reduces in size and desired texture is reached, 6 to 8 minutes.\n",
        "picture_link": "r73kdW4Qf5CPTzcM2AxArUY515yo6Ee"
    },
    {
        "title": "Perfect Fried Green Tomatoes",
        "ingredients": [
            "4 green tomatoes, cut into 1/4-inch slices ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt, divided ADVERTISEMENT",
            "2 teaspoons ground black pepper, divided ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 cup cornmeal ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "2 cups canola oil, or as needed ADVERTISEMENT",
            "Cajun Ranch Sauce: ADVERTISEMENT",
            "1/2 cup ranch dressing ADVERTISEMENT",
            "2 tablespoons Cajun seasoning ADVERTISEMENT",
            "2 teaspoons hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season tomato slices with salt and pepper.\nCombine flour, 1 teaspoon salt, and 1 teaspoon pepper in a shallow bowl. Pour buttermilk in a second shallow bowl. Mix cornmeal, parsley, paprika, 1 teaspoon salt, 1 teaspoon pepper, and cayenne pepper in a third shallow bowl.\nDredge each tomato slice in the flour mixture to coat, dip into the buttermilk, and finish by pressing each side of the tomato into the cornmeal mixture to coat. Lay coated tomato slices onto a baking sheet; rest to let tomatoes absorb flavor of coating, 10 to 15 minutes.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nGently drop tomato slices into the hot oil and cook until golden brown and floating, 2 to 3 minutes. Drain on a plate lined with paper towel.\nWhisk ranch dressing, cajun seasoning, and hot pepper sauce together in a small bowl; serve with the fried tomato slices.\n",
        "picture_link": "A544Mu.MslaGhXU29MWcV1.CrWz0ImC"
    },
    {
        "title": "New Quiche Lorraine",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1 (9 inch) frozen deep dish pie crust, thawed ADVERTISEMENT",
            "1/2 cup diced white onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "4 large eggs, beaten ADVERTISEMENT",
            "1/2 cup shredded Swiss cheese ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble. Reserve about 2 tablespoons bacon drippings in the skillet.\nCook and stir onion and garlic in reserved bacon drippings over medium heat until onion is softened, 5 to 10 minutes.\nPlace thawed pie crust in a pie dish; prick holes in the bottom and sides of crust using a fork.\nBake crust in the preheated oven until lightly browned, about 8 minutes. Remove crust from oven and reduce oven temperature to 325 degrees F (165 degrees C).\nWhisk half-and-half and sour cream together in a bowl; beat eggs into half-and-half mixture. Mix Swiss cheese, salt, black pepper, and cayenne pepper into half-and-half mixture; add bacon, onion mixture, and parsley. Pour mixture into the crust.\nBake in the preheated oven until a knife inserted into the center of the quiche comes out clean, about 45 to 50 minutes. Cool for 10 minutes before slicing into wedges.\n",
        "picture_link": ".qiN8STey/6lsdJtw6D6R4fLn1KllEW"
    },
    {
        "title": "Barbeque Shredded Beef",
        "ingredients": [
            "1 cup chopped onion, or more to taste ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "4 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1 1/2 pounds boneless beef chuck roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir onion, tomato sauce, brown sugar, vinegar, chili powder, soy sauce, salt, and mustard together in a slow cooker; add roast. Spoon onion mixture over the beef to coat.\nCook on High for 7 hours. Shred meat in slow cooker with a pair of forks. Continue cooking 1 hour more.\n",
        "picture_link": "HgQodQCHrl/FdRX2eDbPJaMvV6v.Lne"
    },
    {
        "title": "Chocolate - Peanut Butter No Bake Cookies",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "3 tablespoons cocoa powder ADVERTISEMENT",
            "2 cups quick-cooking oats ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with aluminum foil and spray with cooking spray.\nCombine sugar, milk, margarine, and cocoa powder in a saucepan; bring to a boil, stirring often, for 1 minute. Remove from heat and stir in oats, peanut butter, and vanilla extract. Drop about 1 tablespoon of mixture per cookie onto the prepared baking sheet. Let stand until cookies are cooled and firm, about 30 minutes.\n",
        "picture_link": "a29JAV2XeQxjS80YI3OzQ.LO56Rh5Ze"
    },
    {
        "title": "Scotch Shortbread",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup butter, at room temperature ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon white sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nMix flour, butter, and 1/2 cup sugar together in a bowl using your hands until dough is well combined. Press dough into an ungreased 11 1/2x 7 1/2-inch pan or jelly roll pan. Sprinkle with 1 tablespoon sugar.\nBake in the preheated oven until edges are light brown, 20 to 30 minutes. Cut shortbread into squares in the pan while still warm. Cool completely before removing squares from pan.\n",
        "picture_link": "4xm0scvYRw7xN1VKl3FSGKAd7NZcoyu"
    },
    {
        "title": "Roasted Eggplant Lasagna",
        "ingredients": [
            "1 large eggplant, peeled and cut into 1/4-inch slices ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "1 (16 ounce) container ricotta cheese ADVERTISEMENT",
            "2 cups shredded Italian cheese blend ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 sprigs fresh oregano, chopped ADVERTISEMENT",
            "3 sprigs fresh thyme, chopped ADVERTISEMENT",
            "10 grinds fresh black pepper ADVERTISEMENT",
            "2 1/2 cups tomato sauce ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "6 slices part-skim mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPlace eggplant slices on a wire rack; sprinkle with salt. Let sit until some liquid starts beading on slices, about 20 minutes. Rinse salt off eggplant slices and pat dry. Brush olive oil over both sides of each slice. Arrange eggplant slices on a baking sheet.\nRoast in the preheated oven for 10 to 15 minutes. Flip eggplant slices and continue roasting until slices are tender and lightly browned, 15 to 20 more minutes. Remove eggplant from oven and reduce temperature to 350 degrees F (175 degrees C).\nMix ricotta cheese, Italian cheese blend, egg, garlic, oregano, thyme, and black pepper together in a bowl.\nLine a 9-inch square pan with aluminum foil. Coat the bottom of the pan with about 1/2 cup tomato sauce; top with 1/2 of the eggplant slices. Layer eggplant slices with 1/2 of the spinach, 1/2 of the ricotta mixture, and 1/2 of the remaining tomato sauce. Continue layering with remaining ingredients, ending with sauce. Top with mozzarella slices. Cover pan with aluminum foil.\nBake in the preheated oven for 30 minutes. Remove aluminum foil and continue baking until cheese is brown and bubbling, 5 to 10 more minutes.\n",
        "picture_link": "Y1acydPP5qtPTRRLxbCDvOgopF4Srz2"
    },
    {
        "title": "Chicken 'N Pasta Primavera",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound boneless, skinless chicken, thinly sliced ADVERTISEMENT",
            "1 (12 ounce) bag Birds Eye® Recipe Ready Primavera Blend ADVERTISEMENT",
            "1 cup prepared Alfredo pasta sauce ADVERTISEMENT",
            "8 ounces fettuccine, cooked according to package directions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large nonstick skillet over medium-high heat and cook chicken, stirring occasionally, 8 minutes or until almost done. Remove chicken from pan.\nAdd Recipe Ready Primavera Blend and cook, stirring frequently, 5 minutes or until just tender. Stir in pasta sauce and bring to a boil. Add fettuccine and chicken and toss to coat.* Serve, if desired, with additional parmesan cheese and season with black pepper.\n",
        "picture_link": "VqTTDBq21iohsppKU0wY6Hr.8Xu3Oha"
    },
    {
        "title": "Simple Chicken Stroganoff",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (16 ounce) package egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir cream of mushroom soup, sour cream, and Worcestershire sauce in bowl until well blended. Pour half the soup mixture in a 9x13-inch baking dish. Arrange chicken breast halves in baking dish and cover with remaining soup mixture.\nBake chicken in preheated oven until no longer pink in the center and the juices run clear, about 1 hour. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.\nCut chicken into bite-size pieces and serve over egg noodles with mushroom sauce.\n",
        "picture_link": "Wn8Sk7sqRO5IknYtb9FRXpQpVL2Auya"
    },
    {
        "title": "Turnip Bake",
        "ingredients": [
            "1 large turnip, peeled and cubed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "2 large apples - peeled, cored, and diced ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch casserole dish.\nPlace turnip into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 15 to 20 minutes. Drain and transfer to a bowl.\nMash turnip, 2 tablespoons butter, salt, and pepper together until smooth.\nToss apples with 2 tablespoons brown sugar and cinnamon in a bowl.\nSpread half the turnip mixture into the prepared casserole dish; top with half the apples. Repeat with remaining turnip mixture and apple mixture.\nMix flour, 1/4 cup brown sugar, and 2 tablespoons softened butter by hand in a bowl until mixture is an evenly coarse meal-texture; sprinkle over casserole.\nBake in the preheated oven until cooked through and bubbling, about 1 hour.\n",
        "picture_link": "stvVJp5VbUVVeJc97riwhA5jZNT.Ixi"
    },
    {
        "title": "Grilled Mahi Mahi with Lemon Caper Sauce",
        "ingredients": [
            "6 (6 ounce) mahi mahi fillets (or other firm white fish) ADVERTISEMENT",
            "2 tablespoons Crisco® Pure Olive Oil ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 (4 ounce) jar Crosse & Blackwell® Capers, rinsed and drained ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "6 cups mixed salad greens ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place fish in a shallow dish and rub with olive oil, lime juice and salt and pepper. Cover and leave at room temperature 2 hours.\nHeat grill to medium-high. Grill fish 4 minutes on each side. Combine mayonnaise, capers and lemon juice. Serve fish on bed of mixed greens and top with mayonnaise mixture.\n",
        "picture_link": "VxyIfexY17jv6XYclUAGB8S82DkiLuO"
    },
    {
        "title": "Pumpkin Oat Bars",
        "ingredients": [
            "1 1/2 cups quick cooking oats ADVERTISEMENT",
            "1/4 cup packed dark brown sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon nutmeg ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "1 large egg, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups pumpkin puree ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and 8x8-inch baking pan.\nStir oats, brown sugar, baking powder, cinnamon, nutmeg, pumpkin pie spice, and kosher salt together in a bowl; make a well in the center. Pour half-and-half, egg, and vanilla extract into well in the center of the oat mixture; stir to combine. Add pumpkin to half-and-half oat mixture and mix thoroughly. Pour pumpkin batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 25 to 30 minutes.\n",
        "picture_link": "zdha9Aqf/Xj0wLmAXgRhB6O8TLFPSVq"
    },
    {
        "title": "Paleo Coconut Dark Chocolate Chip Cookies",
        "ingredients": [
            "2 cups almond flour ADVERTISEMENT",
            "2/3 cup shredded unsweetened coconut ADVERTISEMENT",
            "1/3 cup coconut flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup almond butter, softened ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 1/2 teaspoons coconut oil, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup dark chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix almond flour, shredded coconut, and coconut flour together in a bowl.\nBeat egg in a large bowl. Beat almond butter, honey, coconut oil, and vanilla extract into the egg until dough is smooth.\nStir chocolate chips into dough and mix until just combined. Scoop dough into walnut-sized balls and place 1-inch apart onto ungreased baking sheets.\nBake in the preheated oven until set, about 10 minutes.\n",
        "picture_link": "jkOkkVrgAFtekGLe86c0KmtCtjgObve"
    },
    {
        "title": "Classic Cocktail Meatballs",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 (6 ounce) package STOVE TOP Stuffing Mix for Chicken ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (12 ounce) jar grape jelly ADVERTISEMENT",
            "1 (12 ounce) bottle chili sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F.\nMix meat, stuffing mix, water and eggs until blended. Shape into 50 (1-1/2-inch) meatballs; place in 2 foil-lined 15x10x1-inch pans sprayed with cooking spray.\nBake 16 min. or until done (160 degrees F). Meanwhile, bring jelly and chili sauce to boil in large saucepan on medium heat, stirring occasionally.\nAdd meatballs to sauce; stir to evenly coat.\n",
        "picture_link": "Y84iKDRE8lgCZd0IewOJWrVQLm1xokO"
    },
    {
        "title": "Raspberry Marinade",
        "ingredients": [
            "1/2 cup all fruit raspberry jam ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine raspberry jam, pineapple juice, soy sauce, rice vinegar, garlic, and basil. Add chicken breasts, and turn to coat evenly. Cover, and refrigerate for at least 4 hours.\nPreheat grill for medium heat, and lightly oil grate.\nCook chicken breasts on grill until meat is no longer pink, and juices run clear.\n",
        "picture_link": "OH4gIdJRdP4kjLIiHZYTcmaNMdijaum"
    }
]