[
    {
        "title": "Chocolate Turtles® Cheesecake",
        "ingredients": [
            "7 ounces caramels ADVERTISEMENT",
            "1/4 cup evaporated milk ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "1 (9 inch) prepared chocolate cookie crumb crust ADVERTISEMENT",
            "6 ounces cream cheese, softened ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1/2 cup hot fudge topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place caramels and evaporated milk in a saucepan. Heat over low heat, stir continually until smooth for about five minutes. Stir in 1/2 cup chopped pecans. Pour into pie crust.\nCombine cream cheese, sour cream, and milk in a blender. Process until smooth. Add pudding mix; process for about 30 seconds more.\nPour pudding mix over caramel layer, covering completely. Chill, loosely covered, until set (it usually takes about 15 minutes).\nDrizzle fudge topping over pudding layer in a decorative pattern. Sprinkle top of cake with remaining pecans. Chill, loosely covered, until serving time.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Chip Walnut Pie",
        "ingredients": [
            "3/4 cup packed light brown sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1 cup coarsely chopped walnuts ADVERTISEMENT",
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "1/2 cup heavy cream, chilled ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, stir together brown sugar, flour, baking powder, and 1/4 teaspoon cinnamon. Add eggs, stir until blended. Stir in chocolate chips and walnuts. Pour into baked pie crust.\nBake at 350 degrees F (175 degrees C) for 25 to 30 minutes until lightly browned and set. Serve slightly warm or at room temperature with spiced cream.\nTo Make Spiced Cream: Mix together whipping cream, confectioners' sugar, vanilla, 1/4 teaspoon cinnamon, and nutmeg.\n",
        "picture_link": "jGr7m34.ue.GjZGFKi2VvvgzFvUdoG6"
    },
    {
        "title": "Friday Night Veggie Soup",
        "ingredients": [
            "1 (16 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "3 pounds potatoes - peeled, boiled and diced ADVERTISEMENT",
            "1 onion, finely diced ADVERTISEMENT",
            "1 celery, sliced ADVERTISEMENT",
            "2 (14.5 ounce) cans peeled and diced tomatoes ADVERTISEMENT",
            "1 (29 ounce) can tomato sauce ADVERTISEMENT",
            "9 3/4 cups water ADVERTISEMENT",
            "2 (1 ounce) packages dry onion soup mix ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine frozen vegetables, potatoes, onion, celery, tomatoes, tomato sauce, water, and onion soup mix, mix well. Cover and cook over medium low heat, stirring occasionally, for 2-3 hours.\nServe hot with cold evaporated milk, if desired.\n",
        "picture_link": "w2nh48ASSdV5alG0XT1./CuwxOugyrC"
    },
    {
        "title": "Rivel Soup",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 cup whole corn kernels, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the flour, salt, and beaten egg and mix together with the fingers until mixture is crumbly.\nPour this mixture into the gently boiling broth, add the corn and cook about 10 minutes. The rivels will look like boiled rice when cooked.\n",
        "picture_link": "rYHqMvMDN.c3LB8iGha8d8p/s3fd.2i"
    },
    {
        "title": "Ukrainian Borscht",
        "ingredients": [
            "6 cups water ADVERTISEMENT",
            "1 cup white kidney beans ADVERTISEMENT",
            "4 medium beets, peeled and shredded ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "4 large carrots, shredded ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 potatoes, peeled and diced ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 tablespoons chicken bouillon powder ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1/2 cup dry potato flakes ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "4 tablespoons chopped fresh dill weed ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pot, add 6 cups of the water and pinto beans and simmer for about 1 hour or until beans start to split. Make sure the beans are covered with water at all times during simmering. Save water along with the beans to add to borscht later.\nPeel and shred red beets, then place in a large cooking pot and add 6 cups of the water. Boil beets until just tender, but do not overcook. Save water along with beets to combine later with the remaining ingredients.\nPeel and shred carrots, then place in separate pot along with 3 cups of the water. Boil until tender, but do not overcook. Save water along with carrots to add later to borscht.\nIn a separate pot, add potatoes and 2 cups of the water and cook until tender. Mash potatoes in their own liquid and set aside to add to borscht later.\nIn a separate pot, add chopped celery, chopped onions, diced green and red peppers, chopped garlic, 4 cups water and chicken soup base and simmer until vegetables are just tender. When tender, transfer to the cooking pot with beets.\nAdd cooked beans, carrots and mashed potatoes to cooking pot. Now add vegetable broth, mix well and bring to boil. Add instant potato flakes, black pepper, soy sauce, dill weed, sugar, vinegar and cook for another 5 minutes. If borscht appears too thick, add additional water and cook for 2 minutes longer. Adjust seasonings to taste. If desired, garnish each serving with a dollop of sour cream.\n",
        "picture_link": "cEYfnzN9I4gFDRaX64mz3SIhbjvhGTe"
    },
    {
        "title": "Dream Cream Cheese Pie",
        "ingredients": [
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "3 bananas ADVERTISEMENT",
            "2 (9 inch) prepared graham cracker crusts ADVERTISEMENT",
            "1 (21 ounce) can apple pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice bananas, and arrange on the bottom of each pie crust.\nMix confectioners' sugar, cream cheese, and nondairy whipped topping with an electric mixer for about 2 minutes. Divide mixture into pie shells. Top with fresh fruit or pie filling of you choice.\nChill in freezer for 2 hours, or leave in refrigerator over night. Serve!!!\n",
        "picture_link": "u1S8T7Ggbvjyrf0C0BuS5XhCrKPi/Oa"
    },
    {
        "title": "Cory's Best Calamari",
        "ingredients": [
            "2 pounds squid, cleaned and sliced into rounds ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse and drain squid well. Pat squid dry with paper towels. Sprinkle salt on squid.\nPut flour and a few squid in a small paper or plastic bag. Shake the squid rounds in the bag until coated. Remove squid and place more in the sack to coat.\nHeat oil in a medium size frying pan over a high heat. Fry the calamari in the oil until golden brown and crispy. Drain the calamari on paper towels. Serve hot.\n",
        "picture_link": "wV13xg7alssUg8YgYpCp7P7JKMzRiNi"
    },
    {
        "title": "Cream of Tomato (Tofu)",
        "ingredients": [
            "4 cups tomatoes, diced ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (14 ounce) package soft tofu ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute tomatoes and onion in olive oil until onions are clear.\nBlend the canned soup and tofu in a blender, then add this blended mixture to the sauteed onions and tomatoes. Warm through and add water as needed. Add salt and pepper to taste, and top with chopped fresh basil.\n",
        "picture_link": "d8kKvjtdzwj60rorqV.MWnT0Ghb9Nha"
    },
    {
        "title": "Safta Miriam's Passover Seven Layer Cake",
        "ingredients": [
            "3 1/2 (1 ounce) squares bittersweet chocolate, chopped ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 cup superfine sugar ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "8 matzo sheets ADVERTISEMENT",
            "1 (750 milliliter) bottle concord grape wine ADVERTISEMENT",
            "1/4 cup finely chopped nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate in a small bowl in the microwave by heating at 30 second intervals, and stirring between each one. When chocolate is almost melted, just remove from the microwave and stir until smooth. Set aside.\nIn a large bowl, cream together the margarine and sugar until light and fluffy. Beat in the egg yolks one at a time until well blended. In a separate bowl, whip egg whites with a pinch of superfine sugar until stiff. Fold the melted chocolate into the sugar mixture, then fold in the egg whites.\nPour 1/4 of the bottle of wine into an 8x8 inch baking dish. Soak one of the matzo sheets briefly on both sides, then remove to a serving platter. If you soak too long, it will break apart and become hard to work with. Spread a thin layer of the chocolate cream over the soaked matzo. Continue soaking and layering the matzos and chocolate cream, leaving enough of the chocolate mixture to frost the sides when finished. Add more wine to the dish as necessary for soaking.\nPress chopped nuts onto the sides, or sprinkle them on top for garnish. Refrigerate overnight to allow the chocolate and wine to blend flavors.\n",
        "picture_link": "NUKQ8/yaLoQ4MEWWPGl.TaiU3Gb4aSq"
    },
    {
        "title": "Vernell's Slaw",
        "ingredients": [
            "1 large head cabbage, cored and shredded ADVERTISEMENT",
            "3/4 cup white sugar, divided ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the shredded cabbage into a large glass baking dish or other glass dish. Do not use metal or plastic. Sprinkle with 1/2 cup of white sugar and the salt.\nIn a separate microwave safe bowl, combine the remaining sugar, oil, vinegar, mustard, celery seed and pepper. Stir to blend in the sugar, then heat until boiling in the microwave, about 3 minutes. Immediately, but carefully pour the boiling mixture over the cabbage. Toss with a wooden or plastic utensil to evenly coat the cabbage.\nLet stand out on the counter for several hours, stirring occasionally. Cover and refrigerate. Toss before serving, and serve with a slotted spoon.\n",
        "picture_link": "eU2U0LbCFA1WD3kufD9xhOoIzEBZzyq"
    },
    {
        "title": "Potatoes and Onions",
        "ingredients": [
            "3 potatoes, cubed ADVERTISEMENT",
            "1/4 cup fat free Italian-style dressing ADVERTISEMENT",
            "2 cups fresh sliced mushrooms ADVERTISEMENT",
            "1 onion, finely diced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a pot of boiling water until tender. Drain well.\nSpray a frying pan with non-stick cooking spray and pour in dressing. Over a medium heat fry the mushrooms, onions and celery. When cooked to your desired texture pour the mixture over the potatoes. Serve hot.\n",
        "picture_link": "oGxp1D9rTCpkwGwqNa/V9mOC0rA/m4m"
    },
    {
        "title": "Easy Stuffing",
        "ingredients": [
            "6 ounces dry bread stuffing mix ADVERTISEMENT",
            "10 slices day-old bread, torn into small pieces ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter or spray one 2 quart casserole dish.\nPrepare stuffing according to directions on box; place stuffing in a large bowl.\nAdd the dried bread, eggs and water; mix well and place in casserole dish.\nCover and bake 45 to 60 minutes.\n",
        "picture_link": "dVz02IvKonto/trTe54GqD5frW1Lxbe"
    },
    {
        "title": "Fresh Corn Spoon Bread",
        "ingredients": [
            "4 cups milk ADVERTISEMENT",
            "1 1/4 cups cornmeal ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 cup sweet corn ADVERTISEMENT",
            "1/3 cup chopped green onions ADVERTISEMENT",
            "1/4 cup unsalted butter, cubed ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Butter one 8x8x2- inch glass baking dish.\nWhisk milk, cornmeal, and salt in a heavy saucepan over medium heat. Bring mixture to a boil, whisking constantly until mixture begins to thicken, about 4 minutes. Reduce heat to low and cook until the mixture is very thick, stirring frequently, about 20 minutes.\nTransfer cornmeal to a large bowl. Stir in corn, green onions, and butter. Add the egg yolks one at a time, stirring after each one.\nBeat the egg whites until stiff peaks form. Fold half of the egg white mixture into the warm cornmeal to lighten it; fold in remaining egg whites. Spread the batter evenly in the prepared pan.\nBake in preheated oven until light, puffed and golden brown, about 30 minutes. Serve immediately.\n",
        "picture_link": "P/YZspQlyYglYij0UIKNDZpn2glX73S"
    },
    {
        "title": "Candie's SIMPLY Great Punch",
        "ingredients": [
            "2 (46 fluid ounce) cans fruit punch ADVERTISEMENT",
            "1 (2 liter) bottle lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "1/2 gallon French vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour chilled punch and soda into punch bowl. Scoop out entire half-gallon of ice cream, and carefully slide into punch.\n",
        "picture_link": "X05JSb.nX/c261/46HfdG1nnZZ4.s06"
    },
    {
        "title": "Spicy Tomato Chutney",
        "ingredients": [
            "4 pounds ripe tomatoes ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1 cup red wine vinegar ADVERTISEMENT",
            "2 onions, diced ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "2 teaspoons mixed spice ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "1 tablespoon curry paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a saucepan with water, and bring to a boil. Place tomatoes in boiling water, and cook for 3 to 5 minutes, or until skins begin to crack and peel. Remove from water, cool, and peel.\nPuree tomatoes with ginger and garlic in a food processor or blender.\nPlace tomato mixture, sugar, vinegar, onions, and golden raisins in a large saucepan. Season with mixed spice, chili powder, paprika, and curry paste. Simmer over medium heat until thick. Refrigerate until ready to use.\n",
        "picture_link": "gSitzNvKRf1ANBsPV/PX84L8wwFn7zW"
    },
    {
        "title": "Pumpkin Frozen Yogurt",
        "ingredients": [
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1 1/2 cups low-fat plain Greek-style yogurt ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the pumpkin, yogurt, maple syrup, vanilla extract, cinnamon, nutmeg, and cloves until smooth. Refrigerate the mixture until thoroughly chilled; freeze in an ice cream freezer according to manufacturer's instructions. Pack the frozen yogurt into a sealed container, and freeze until serving time.\n",
        "picture_link": "N4vP7X7.tRdaRvCsqfX2GzW2E1178dS"
    },
    {
        "title": "Whipping Cream Chicken",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place a ceramic, glass, or metal mixing bowl into the freezer to chill.\nMelt the butter in a skillet over medium heat until the foam subsides. Sprinkle the chicken breasts with seasoned salt on both sides, and brown in the melted butter, 5 to 8 minutes per side. Transfer the chicken breasts into a 9x12-inch baking dish. Place the mushrooms in the skillet with the chicken drippings, and cook and stir until the mushrooms have begun to brown, about 10 minutes. Pour the mushrooms and pan drippings over the chicken breasts.\nPour the cream into the chilled mixing bowl, and whip on high speed with an electric mixer until the cream is fluffy and forms soft peaks, 1 to 3 minutes. Lightly spoon the whipped cream on top of the chicken breasts.\nBake in the preheated oven until the cream is bubbly and the top is golden brown, about 25 minutes.\n",
        "picture_link": "1Rb0/oU9puikymlqVS0CtULDa1Iui5a"
    },
    {
        "title": "Black and Tan",
        "ingredients": [
            "1 (12 fluid ounce) bottle lager beer (such as Harp®) ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle Irish stout beer (such as Guinness®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently pour half the lager beer into a tall beer glass. Place a large tablespoon, dome side up, an inch or so above the lager beer, with the tip of the spoon pointed slightly downhill. Slowly pour half the stout beer over the tablespoon, so the stout gently pours down the side of the glass in a thick trickle. Allow to stand a few seconds so 2 distinct layers of beer form.\n",
        "picture_link": "PDvU94WsifE0x/RsCUIQoBY4N52e7iC"
    },
    {
        "title": "Farfalle Pasta with Zucchini and Lemon-Cream Sauce",
        "ingredients": [
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 1/2 cups whole milk ricotta cheese, at room temperature ADVERTISEMENT",
            "1/2 cup mascarpone cheese ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons grated fresh lemon peel, or more to taste ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "4 cups thinly sliced zucchini ADVERTISEMENT",
            "6 cloves garlic, thinly sliced ADVERTISEMENT",
            "1 teaspoon salt, divided ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the bow tie pasta and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Reserve 1/2 cup of pasta cooking water, and drain the farfalle well in a colander set in the sink.\nWhile the farfalle are boiling, mix together the ricotta, mascarpone, and Parmesan cheeses in a large serving bowl, and stir in the lemon peel and basil until the mixture is well combined.\nHeat olive oil in a large skillet over medium heat, and cook and stir the zucchini and garlic until the zucchini are tender but still bright in color, about 8 minutes. Stir about 1/4 cup of the reserved pasta cooking water into the cheese mixture and mix until smooth; add the hot drained pasta and cooked zucchini, and lightly toss with the sauce. Season with the salt and pepper. If mixture is too thick, add a little more pasta cooking water, 1 tablespoon at a time, until the sauce is the desired thickness.\n",
        "picture_link": "SqcLu8kY96HOFZopumaktDK8lSFt5Su"
    },
    {
        "title": "Easy Chicken Pasta",
        "ingredients": [
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breasts, cut into cubes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nHeat the olive oil in a large skillet over medium heat. Season the chicken breasts with salt and pepper. Add the chicken and garlic to the skillet. Cook and stir until the chicken is no longer pink in the center, 7 to 10 minutes. Stir in the white wine. Toss the pasta with chicken in the skillet until the chicken is evenly distributed.\n",
        "picture_link": "gBqoxIToE496TkG437zMfmXBLvNdQq2"
    },
    {
        "title": "Green Lentils and Rice Assyrian Style",
        "ingredients": [
            "1 cup dry green lentils ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup basmati rice ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the lentils into a pot and cover with the water. Bring to a rolling boil over high heat for 5 minutes, then cover and remove from heat.\nHeat 2 tablespoons vegetable oil in a skillet over medium heat. Stir in the rice for about 1 minute, until the grains turn opaque and white, then stir in the lentils and water. Bring the rice mixture to a boil, then cover and reduce heat to medium-low for 5 minutes. Stir once, then cover and reduce heat further to low. Continue cooking without uncovering the lid until the rice is tender, about 15 minutes more.\nMeanwhile, heat the remaining 2 tablespoons vegetable oil in the skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. When the rice is ready, stir in the caramelized onion and season with salt.\n",
        "picture_link": "HWLgW3Uv043gvENhiYzb1SwR7eRiAbi"
    },
    {
        "title": "Chocolate Ganache S'mores",
        "ingredients": [
            "14 whole graham crackers, crushed ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "9 ounces bittersweet chocolate chips ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 tablespoon dark rum (optional) ADVERTISEMENT",
            "1 (10 ounce) package large marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish with cooking spray.\nCombine the graham cracker crumbs, melted butter, sugar, and cinnamon in a mixing bowl. Mix until evenly moistened, then press into the bottom of the prepared baking dish. Bake in the preheated oven until the crust is lightly browned and smells toasted, about 5 minutes.\nPlace the chocolate into a medium bowl. Heat the cream in a small sauce pan over medium heat. Bring just to a boil. When the cream has come to a boil, remove from the heat immediately and pour over the chocolate chips; whisk until smooth. Stir in the optional rum. Pour evenly over the graham cracker layer.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nPlace an even layer of marshmallows on top of the chocolate. Broil until the marshmallows are lightly toasted, about 1 minute. Refrigerate until chocolate has hardened, about 45 minutes. Cut into bars using a pizza cutter sprayed with non-stick cooking spray.\n",
        "picture_link": "FOFsb8B7t20GYWDzfVVZVI0ndPFaGwu"
    },
    {
        "title": "Veggie Bulgur Salad (Kisir)",
        "ingredients": [
            "1 cup fine bulgur ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "2 large tomatoes, finely chopped ADVERTISEMENT",
            "1 cucumber, diced ADVERTISEMENT",
            "2 green bell peppers, finely chopped ADVERTISEMENT",
            "1 red bell pepper, finely chopped ADVERTISEMENT",
            "7 green onions, finely chopped ADVERTISEMENT",
            "1/2 cup minced fresh parsley ADVERTISEMENT",
            "1/2 cup minced fresh mint leaves ADVERTISEMENT",
            "1 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "juice of 1 fresh lemon ADVERTISEMENT",
            "2 tablespoons pomegranate molasses ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bulgur in a bowl; stir in the boiling water. Cover and let stand for 20 minutes.\nMeanwhile, heat 2 tablespoons olive oil in a skillet over medium heat. Stir in the chopped onion; cook and stir until the onion has softened and turned translucent, about 5 minutes.\nDrain the bulgur and return it to the bowl. Add the cooked onion, chopped tomatoes, cucumber, green and red bell peppers, green onions, parsley, mint, and red pepper flakes. Drizzle with 2 tablespoons olive oil, the lemon juice, and the pomegranate molasses. Toss gently until the salad is thoroughly combined. Serve immediately, or refrigerate until serving.\n",
        "picture_link": "SmCbXvbK96mBunv.cLH0LDBbGW1LQGG"
    },
    {
        "title": "Graham Cracker Fudge",
        "ingredients": [
            "1 (12 ounce) bag milk chocolate chips ADVERTISEMENT",
            "2 (14 ounce) cans sweetened condensed milk ADVERTISEMENT",
            "1 (14.4 ounce) package graham cracker, crushed into fine crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the chocolate chips and condensed milk in a saucepan over low heat; cook and stir until the chocolate has melted and the mixture is smooth. Stir in the crushed graham crackers.\nPour into well-greased 13 x 9 inch glass baking dish and smooth into an even layer. Allow to cool until firm, about 2 hours, before serving.\n",
        "picture_link": "0WZkgw.tT2VLVd/8lt.O2RLd0vswUuW"
    },
    {
        "title": "Everything But The... Blackberry Cobbler",
        "ingredients": [
            "5 cups fresh blackberries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup cold butter ADVERTISEMENT",
            "1/2 cup pecans, chopped ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/3 cup hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nPlace the blackberries in a large saucepan with 1 cup of sugar. Dissolve the cornstarch in the cold water, and stir into the berries. Bring to a simmer over medium-high heat, and cook until bubbly and thickened, 3 to 5 minutes. Pour the blackberries into a 9x13-inch baking dish; set aside.\nWhisk the flour with 1/2 cup sugar, baking powder, cinnamon, and salt in a mixing bowl. With a pastry cutter, cut in the cold butter until crumbly. Stir in the pecans, oats, and brown sugar until evenly blended. Stir in the hot water until evenly moistened. Drop the batter over the blackberries by the spoonful.\nBake in the preheated oven until the top is golden brown and the berries are bubbly, about 25 minutes.\n",
        "picture_link": "m5xh6AZn9JEotLXZO6KIfB.DAKpNBC."
    },
    {
        "title": "Gina's Crab Stuffed Chicken Breast",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup chicken broth ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/3 cup dry white wine ADVERTISEMENT",
            "1/4 cup onion, chopped ADVERTISEMENT",
            "1 cup buttery round crackers, crushed ADVERTISEMENT",
            "1 (8 ounce) can crabmeat ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make sauce: melt butter in a saucepan. Stir in flour until smooth, Cook and stir 5 minutes, then gradually stir in broth, milk and white wine. Cook on low until sauce thickens fully, about 20 minutes. Remove from heat and set aside.\nMix together onion, cracker crumbs, crab meat, parsley, and 1/4 cup of the sauce.\nPound chicken breasts to 1/4 inch thickness. Spoon 1/4 of the crab mixture on the edge of each chicken breast; roll up. Place chicken rolls in a lightly greased 9x13 inch baking dish, fold side down, then top with remaining white sauce.\nCover dish and bake at 350 degrees F (175 degrees C) or until chicken juices run clear, about 1 hour. Sprinkle with cheese and bake, uncovered, until the cheese is lightly browned, about 5 minutes more.\n",
        "picture_link": "exastvHwxBkim.IVXzuqVAETJcjOJAe"
    },
    {
        "title": "Restaurant Style Sausage Gravy and Biscuits",
        "ingredients": [
            "1 (16 ounce) package bulk pork breakfast sausage (such as Bob Evans®) ADVERTISEMENT",
            "1 (26.5 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (16.3 ounce) can refrigerated biscuit dough (such as Pillsbury Grands!®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the sausage into a deep, heavy skillet over medium heat, and cook and stir until the sausage is browned and crumbly, about 15 minutes. Drain excess grease, and mix the sausage with the cream of mushroom soup and water. Bring to a boil, reduce heat to a simmer, and cook until the gravy has thickened, about 15 minutes.\nWhile gravy is simmering, pop open the can of biscuit dough, and gently separate biscuits. Place them onto a an ungreased baking sheet about 2 inches apart.\nBake biscuits until golden brown, 13 to 17 minutes; split the biscuits in half, place onto serving plates, and ladle gravy over biscuits to serve.\n",
        "picture_link": "SRlQu0XBwirxFoJG.MEvnrnHZVYnsvi"
    },
    {
        "title": "Spicy Sausage Broccoli Rabe Parmesan",
        "ingredients": [
            "8 ounces whole wheat rotini pasta ADVERTISEMENT",
            "3 bunches broccoli rabe, trimmed ADVERTISEMENT",
            "4 (4 ounce) links hot Italian sausage, cut into 1 inch pieces ADVERTISEMENT",
            "1 tablespoon sausage drippings ADVERTISEMENT",
            "2 garlic cloves, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the rotini, and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 6 minutes. Drain well in a colander set in the sink.\nPlace a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the broccoli rabe, recover, and steam until just tender, about 2 minutes depending on thickness.\nPlace the Italian sausage into a large skillet over medium heat, and cook until browned and no longer pink inside, about 5 minutes. Remove sausage from pan and set aside; drain excess grease, leaving about 1 tablespoon of sausage drippings in the pan. Sprinkle in the garlic, and cook until it starts to brown, about 1 minute; stir in half the broccoli rabe. Cook and stir until the rabe has wilted, and add the remaining rabe and the diced tomatoes. Cook until all the rabe is tender, about 5 minutes; sprinkle with salt and black pepper.\nReturn the sausage to the skillet, and cook just until the meat is hot; sprinkle with Parmesan cheese, crushed red pepper flakes, and a drizzle of olive oil. Serve over hot rotini.\n",
        "picture_link": "alAfIuBaneSevErc9rDpEVWEzMjohH6"
    },
    {
        "title": "Italian Square Meatballs",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1/2 cup onion, chopped (optional) ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt (optional) ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1/4 cup Italian-seasoned dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C). Line a 9x12-inch baking dish with aluminum foil, and spray with nonstick cooking spray.\nMix the egg and onion together in a mixing bowl. Add the ketchup and ground beef, then season with pepper, salt, Italian seasoning, and bread crumbs; combine until evenly blended. Place the mixture into the prepared pan, and pat into an 8-inch square. Use a table knife or metal spatula to cut the square into 6 vertical strips, then cut the strips horizontally into 6 pieces each for a total of 36 pieces. Do not separate the pieces, just press through the meat to separate it.\nBake in the preheated oven until the meatballs are no longer pink in the center, 20 to 25 minutes. Drain off any grease, and separate the meatballs with a knife to serve.\n",
        "picture_link": "CIxp1nK87/DlM5v5GYq36yg/ciRr/hq"
    },
    {
        "title": "Dan's Fallin' Apart Pork Pot Roast with Cracked Pepper Gravy",
        "ingredients": [
            "1/4 cup garlic powder ADVERTISEMENT",
            "1/4 cup onion powder ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "1 tablespoon freshly cracked black pepper ADVERTISEMENT",
            "1 (3 1/2) pound pork shoulder roast ADVERTISEMENT",
            "1/2 cup Creole-style butter injectable marinade (such as Tony Chachere's Roasted Garlic & Herb Marinade®) ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 large shallots, chopped ADVERTISEMENT",
            "2 cloves elephant garlic, chopped ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 sweet onions (such as Vidalia®), peeled and quartered ADVERTISEMENT",
            "7 red potatoes ADVERTISEMENT",
            "10 large baby carrots ADVERTISEMENT",
            "4 stalks celery, cut into 4 pieces ADVERTISEMENT",
            "1 tablespoon freshly cracked black pepper ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "6 tablespoons dry brown gravy mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a mortar, smash together 1/4 cup of garlic powder, 1/4 cup of onion powder, the crushed red pepper flakes, and 1 tablespoon of cracked black pepper until the mixture forms a fine powder. Place the spice mix into a large shallow bowl.\nInject the pork roast all over with the Creole marinade; blot moisture from the outside of the roast. Rub the spice mix all over the pork roast to thoroughly coat. Melt the butter in a large skillet over medium heat, then cook and stir the shallots and elephant garlic until the garlic becomes lightly golden brown. Sear the coated pork roast in the hot butter on all sides until the spice coating is golden brown, 1 to 2 minutes per side. Place the roast into a roasting pan or Dutch oven with the fat side up; scrape up the butter, cooked shallots and garlic, and sprinkle around the roast. Arrange the sweet onions, red potatoes, carrots, and celery pieces around the roast. Mix 1 cup of water with the remaining spice rub, and pour evenly over roast.\nCover the roasting pan with a lid, and cook in the preheated oven until the meat is very tender, 3 3/4 to 4 hours.\nRemove the roast and set aside on a serving platter; surround the meat with the cooked vegetables. Whisk 1 tablespoon of cracked black pepper, 2 tablespoons of garlic powder, 1 tablespoon of onion powder, and the brown gravy mix together with 2 cups of water in a bowl, and whisk the mixture into the liquid left in the roasting pan. Place the pan over medium heat, and cook, whisking constantly, until the gravy has come to a boil and has thickened, about 5 minutes. Serve alongside the roast and vegetables.\n",
        "picture_link": "ifpcnB.v5hYaVMbRanL8d2DwiY65bO."
    },
    {
        "title": "Pasta with Lentil Soup Sauce",
        "ingredients": [
            "1 (16 ounce) package uncooked spaghetti ADVERTISEMENT",
            "2 (19 ounce) cans lentil soup ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain, but do not rinse, and return to pot. Stir in lentil soup and season with black pepper. Heat through and serve.\n",
        "picture_link": "o.zvTVG6gMrJLb2D9aerwEmj9AWnAKu"
    },
    {
        "title": "Syrian Spaghetti",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nBring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain and stir in tomato sauce, tomato paste, cinnamon, oil, salt and pepper. Transfer to prepared dish.\nBake in preheated oven for 1 hour, or until top is crunchy.\n",
        "picture_link": "R8ktbzMhF5YfB8OyV3J0/5u82V1TRTu"
    },
    {
        "title": "Preacher's Delight",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (14 ounce) can cream of coconut ADVERTISEMENT",
            "3/4 cup pineapple juice ADVERTISEMENT",
            "1 (16 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare and bake white cake mix according to package directions for a 9x13 inch pan. Remove cake from oven. While still hot, using a utility fork, poke holes all over the top of the cake.\nMix cream of coconut, sweetened condensed milk and pineapple juice together. Pour over the top of the hot cake. Let cake cool completely then frost with the whipped topping. Keep cake refrigerated\n",
        "picture_link": "CwM4vK1QhQsMskFO3jjWJsEOz4/E9he"
    },
    {
        "title": "Chocolate Lovers Cheesecake",
        "ingredients": [
            "4 (1 ounce) squares semisweet chocolate, chopped ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (9 inch) prepared chocolate cookie crumb crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C.) In the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.\nIn a large bowl, beat the cream cheese, sugar and vanilla until smooth. Slowly beat in eggs, one at a time. Blend in melted chocolate. Pour filling into crust.\nBake in the preheated oven for 40 minutes, or until filling is set. Allow to cool. Refrigerate for at least 3 hours before serving.\n",
        "picture_link": "Z8RacZfMkszq2SwOxZhZ10dvXjvoEYK"
    },
    {
        "title": "Hot Dog Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 drops red food coloring ADVERTISEMENT",
            "3 tablespoons flaked coconut ADVERTISEMENT",
            "2 drops green food coloring ADVERTISEMENT",
            "1 (4.5 ounce) tube prepared yellow frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together the butter, confectioners' sugar and vanilla until smooth. Stir in the flour until dough is smooth. Remove 1 cup of dough, then cover and refrigerate remaining dough. Knead the red food coloring into the 1 cup of dough until the color of a hot dog is achieved. Refrigerate all dough for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Divide the red dough into 16 portions. Roll each piece into a 2 1/2 inch long sausage shape. For buns, divide the white dough into 16 portions and shape into 3 inch logs. Slice them almost in half lengthwise. Spread the buns open and place the hot dog doughs inside, leaving buns open. Place 2 inches apart onto ungreased cookie sheets.\nBake for 12 to 15 minutes in the preheated oven, or until firm. Remove from cookie sheets to cool. In a small jar or plastic bag, combine the coconut and green food coloring. Shake until coconut is evenly colored. Sprinkle over hot dog cookies when cool and make a zig zag with the yellow frosting for mustard.\n",
        "picture_link": "FsY9ZnWfIwb6Ehu90QrRWeJhebS3xW2"
    },
    {
        "title": "Cheddar Jalapeno Shrimp",
        "ingredients": [
            "2 pounds large shrimp, peeled and deveined and butterflied ADVERTISEMENT",
            "8 ounces sharp Cheddar cheese, cut into strips ADVERTISEMENT",
            "3 fresh jalapeno peppers, seeded ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon Old Bay Seasoning TM, or to taste ADVERTISEMENT",
            "2 pounds thick cut bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the jalapeno peppers into thin strips. Place a strip or two of jalapeno pepper and cheddar cheese inside each shrimp.\nSprinkle the stuffed shrimp with garlic powder and Old Bay Seasoning TM. Wrap each shrimp with a slice of bacon and secure with a toothpick. Thread shrimp onto skewers.\nGrill over medium high heat for 10 to 15 minutes, or until firm.\n",
        "picture_link": "6a.Fswwo4dtktn/VWIK3IlQv9zxs8dS"
    },
    {
        "title": "Swedish Rye Bread II",
        "ingredients": [
            "3 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "4 1/2 cups hot water ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons orange zest ADVERTISEMENT",
            "1 1/2 tablespoons caraway seed ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "7 1/2 cups rye flour ADVERTISEMENT",
            "7 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve the yeast in the warm (110 degree F) water. Let sit until creamy, about 10 minutes.\nPour the hot water in a large mixing bowl, add the honey, salt, sugar, orange zest, caraway seeds and butter; briefly stir. Let cool to lukewarm.\nCombine the yeast mixture with the honey orange mixture. Stir in the rye flour. Mix the bread flour, 1/2 cup at a time, until the dough comes together. Turn the dough out onto a lightly floured surface and knead until smooth and supple, about 8 minutes. Lightly oil a large mixing bowl. Place the dough in the bowl and turn to coat with oil. Cover with a damp towel and let rise in a warm place until doubled in volume, about 1 hour. Meanwhile, lightly grease three 9x5 inch loaf pans.\nTurn the dough out onto a lightly floured surface and divide into three equal pieces. Form each piece into a loaf and place in prepared pans. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake at 350 degrees F (175 degrees C) for 40 to 50 minutes, or until the top of the loaves are golden and the bottoms sound hollow when tapped.\n",
        "picture_link": "0C0uTq31JOLRp.wljRTvSYMvcFIW9O2"
    },
    {
        "title": "Godfather",
        "ingredients": [
            "1 fluid ounce Scotch whiskey ADVERTISEMENT",
            "1 fluid ounce amaretto liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a rocks glass with ice, combine the scotch and amaretto. Stir.\n",
        "picture_link": "2zgBCcVr1p8lgG80zykyl9Hf9VsKY/S"
    },
    {
        "title": "Easy Oven Beef Stew",
        "ingredients": [
            "3 pounds chuck roast ADVERTISEMENT",
            "1 packet dry onion soup mix ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle ginger ale ADVERTISEMENT",
            "1 (8 ounce) can mushrooms, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C).\nCut the roast into cubes, then place in a 10x15 inch roasting pan with soup mix, ginger ale and mushrooms; mix well.\nBake in preheated oven for 4 hours.\n",
        "picture_link": "VxaesPyvpkDC6kdjJ/TlIUGNSEWYEEi"
    },
    {
        "title": "On the Go Casserole",
        "ingredients": [
            "1/2 pound hot sausage, fried and drained ADVERTISEMENT",
            "1/4 cup sliced black olives ADVERTISEMENT",
            "1/4 cup sliced green olives ADVERTISEMENT",
            "1 cup whole kernel corn ADVERTISEMENT",
            "1 cup chopped stewed tomatoes ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 cup cubed Cheddar cheese ADVERTISEMENT",
            "1 cup cooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 2 quart casserole dish, combine the sausage, black olives, green olives, corn, tomatoes, mushrooms, cheese and rice. Mix all together well.\nBake at 350 degrees F (175 degrees C) for 30 minutes.\n",
        "picture_link": "aCYGwdCezZnEsdbLe8HGh9GmxSkMZ8y"
    },
    {
        "title": "Tongue Tacos",
        "ingredients": [
            "1 beef tongue ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 bunch fresh cilantro, chopped ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 (6 inch) corn tortillas ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Simmer the tongue in water to cover until no longer pink, about 50 minutes per pound of tongue. Remove from water and let rest until cool enough to handle. Peel the skin off the tongue, trim the gristle, and cut into bite-size pieces.\nWhile the tongue is cooling, combine tomatoes, onion and cilantro in a medium bowl. Mix well and set aside.\nIn large skillet, heat oil over medium heat. Cook tongue with salt and pepper until heated through and slightly colored, 5 to 10 minutes. Drain.\nIn a small skillet, heat tortillas 1 minute on each side. To assemble tacos, layer tongue and tomato mixture inside a folded tortilla and sprinkle with lemon juice. Serve immediately.\n",
        "picture_link": "r91LvbaovTT5MAcQXjGu6i33HMMLZ8."
    },
    {
        "title": "Kumquats",
        "ingredients": [
            "1 pound ripe kumquats ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash kumquats and cover with water in a non-aluminum saucepan. Bring to a boil and simmer for 30 minutes. Add sugar and cinnamon, return to a boil and cook for 5 minutes. Remove from heat and drain.\n",
        "picture_link": "UD.M13iIOH36GXI38nlakeguek3zRV6"
    },
    {
        "title": "Chicken Curry V",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (2 inch) piece cinnamon stick ADVERTISEMENT",
            "1 whole cardamom pod ADVERTISEMENT",
            "1/2 star anise pod ADVERTISEMENT",
            "3 whole cloves ADVERTISEMENT",
            "2 teaspoons chopped fresh curry leaves ADVERTISEMENT",
            "1 tablespoon chopped shallots ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 slice fresh ginger root, chopped ADVERTISEMENT",
            "4 tablespoons curry paste ADVERTISEMENT",
            "1/2 cup thick coconut milk ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 pounds skinless, boneless chicken breast halves - cut into 2 inch pieces ADVERTISEMENT",
            "2 tablespoons tamarind juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large, deep skillet over medium heat. Saute the cinnamon, cardamom, anise, cloves and curry leaves for 2 to 3 minutes, then stir in shallots, garlic and ginger and saute until fragrant. Stir in curry paste and cook for 5 minutes, stirring constantly.\nPour in the coconut milk and water and let simmer for 3 to 4 minutes; add chicken, tamarind juice and salt and simmer, stirring occasionally, for 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Berry Parfait",
        "ingredients": [
            "1/3 cup blueberries ADVERTISEMENT",
            "1/3 cup strawberries ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1/2 cup raspberries ADVERTISEMENT",
            "1/2 cup blackberries ADVERTISEMENT",
            "1 pint vanilla frozen yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine blueberries, strawberries and whipped topping. Blend until smooth. Transfer to a mixing bowl and fold in raspberries and blackberries. Layer the berry mixture with the frozen yogurt in 6 dessert glasses, finishing with a berry layer. Serve at once.\n",
        "picture_link": "66WbXb3hpoVjmDw/qh8Hwq8EeYG7K/a"
    },
    {
        "title": "Peanut Butter Pie XVI",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "3 cups whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare pudding according to package directions. Mix in peanut butter until evenly distributed but not completely combined with pudding. Pour mixture into pastry shell. Top with whipped cream. Chill before serving.\n",
        "picture_link": "0OyJOok57hX6V4f2Ew18KpRwp1gUAua"
    },
    {
        "title": "Sixteenth Century Orange Chicken",
        "ingredients": [
            "2 1/2 pounds skinless, boneless chicken breast meat - cubed ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "2 oranges, peeled and segmented ADVERTISEMENT",
            "4 pitted prunes ADVERTISEMENT",
            "4 pitted dates ADVERTISEMENT",
            "1/2 cup dried currants ADVERTISEMENT",
            "1/2 teaspoon whole cloves ADVERTISEMENT",
            "1 teaspoon black peppercorns ADVERTISEMENT",
            "1/2 teaspoon ground mace ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon rose water ADVERTISEMENT",
            "3/4 cup white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken stock in a large saucepan over high heat. Add oranges, prunes, dates, currants and cloves and boil until the fruit has broken down a bit, about 7 to 10 minutes.\nStir in peppercorns, mace, sugar, rose water and wine; reduce heat to low and simmer for about 10 minutes. Strain and set aside.\nBrown chicken in a large skillet until lightly browned on both sides; add reserved sauce and cook together, turning and basting, until chicken is cooked through and juices run clear, about 20 to 25 minutes.\n",
        "picture_link": "3.Vs.VnMJKfTSRZWFOXJUFWzVgRKztC"
    },
    {
        "title": "Almost Heaven Peanut Butter Cookies",
        "ingredients": [
            "1 (11 ounce) package pie crust mix ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, combine the pie crust mix, peanut butter and brown sugar. Incorporate the water, one tablespoon at a time, while mixing gently. Roll into 1 inch balls. Place onto a cookie sheet and flatten slightly with a fork.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "JbWdCQyBCV9fFLh9.I2sy1jkmy3jJUS"
    },
    {
        "title": "Smoked Salmon Cheesecake",
        "ingredients": [
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons fine dry bread crumbs ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "28 ounces cream cheese, softened ADVERTISEMENT",
            "4 egg ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "1/2 pound smoked salmon, chopped ADVERTISEMENT",
            "1/2 cup shredded Swiss cheese ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLightly butter an 8 inch springform pan. Mix 2 tablespoons Parmesan cheese with the breadcrumbs. Sprinkle this mixture into the pan; turn and tap pan to coat inside of pan. Wrap a large piece of foil underneath and up the sides of the pan. Be careful not to tear any holes in the foil.\nIn a medium skillet or frying pan, melt butter over medium heat. Add onions and green peppers and saute until tender, about 5 minutes. Remove from heat and let cool slightly.\nIn a large bowl, beat together cream cheese, eggs and cream until well blended. Fold in onions, peppers, salmon, Swiss cheese, 3 tablespoons Parmesan cheese, salt and pepper. Pour into prepared pan.\nPlace the wrapped springform pan inside a large roasting pan. Place the pans in the oven and pour enough boiling water into the outside pan to come 2 inches up the side of the springform pan.\nBake until firm to the touch, about 1 hour and 40 minutes. Carefully remove both pans from the oven and turn off the heat. Lift springform pan out of the water and return it to the oven. Let stand in the cooling oven for 1 hour. Transfer to a wire rack and let cool completely.\n",
        "picture_link": "nH9tWN2ld8utyFliI.s4fjUA0BIOv9q"
    },
    {
        "title": "Berry Good Smoothie II",
        "ingredients": [
            "1 nectarine, pitted ADVERTISEMENT",
            "3/4 cup strawberries, hulled ADVERTISEMENT",
            "3/4 cup blueberries, rinsed and drained ADVERTISEMENT",
            "1/3 cup nonfat dry milk powder ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine nectarine, strawberries, blueberries, milk powder and crushed ice. Blend until smooth. pour into glasses and serve.\n",
        "picture_link": "mWWViUtyAWXO59MO9zOsc7fG/NkVixK"
    },
    {
        "title": "Roasted Garlic, Bell Pepper and Tomato Blender Sauce",
        "ingredients": [
            "5 cloves garlic, chopped ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "5 tablespoons olive oil, divided ADVERTISEMENT",
            "6 small tomatoes ADVERTISEMENT",
            "1 (16 ounce) jar roasted red bell peppers ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon dried red pepper flakes ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPlace whole unpeeled head of garlic in an oven-safe dish with 1/4 cup water and drizzle 1 tablespoon olive oil on garlic. Roast in preheated oven for about 45 minutes.\nMeanwhile, put tomatoes in a blender and blend until pureed. Add bell peppers and blend until pureed.\nBreak roasted cloves of garlic and squeeze 5 cloves into blender; blend in garlic. Add 4 tablespoons olive oil and blend briefly. Add salt and pepper to taste, dried red pepper flakes and basil; blend.\nThe sauce is ready, but can either be refrigerated for a couple of days to blend the flavors or can be frozen. Sauce can be served cold or heated up until just warm.\n",
        "picture_link": "InR1wtRKT6iJuz5suj2bcZO4yd7z0.q"
    },
    {
        "title": "Colorful Beverage",
        "ingredients": [
            "1 (64 fluid ounce) bottle orange juice ADVERTISEMENT",
            "1 (64 fluid ounce) bottle cranberry juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the orange juice into ice cube trays and freeze them. Chill the cranberry juice in the refrigerator.\nWhen the orange juice cubes are frozen, Place them in a large pitcher and pour in the cranberry juice.\n",
        "picture_link": "NxnPHfGw9C0cp0itBTsI2.ZZlZIvdWu"
    },
    {
        "title": "Quick Cream Cheese Pie",
        "ingredients": [
            "1 (18.75 ounce) can ready-to-use strawberry glaze ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "4 cups sliced fresh strawberries ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup cold milk ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread a thin layer of the fruit glaze onto the bottom and sides of the pie crust. Top with a single layer of fresh fruit.\nIn a large bowl, beat cream cheese until smooth. Mix in milk until all cream cheese lumps are gone. Add pudding mix and beat until completely blended. Fold in 1/2 of the whipped topping until blended.\nSpoon 1/2 the mixture into the pie crust. Add another layer of fruit glaze and fruit, then the rest of the cream cheese mixture. Put on final layer of fruit glaze and fruit; top with remaining whipped topping. Decorate the top of the pie with remaining fresh fruit. Cover and refrigerate overnight.\n",
        "picture_link": "LT2VjMmUktpeRB3RC4BDdyclGgSItlm"
    },
    {
        "title": "Starbucks® Pumpkin Bread",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup light brown sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup canned pumpkin ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 8-1/2x4-1/2-inch loaf pan.\nCombine flour, baking soda, nutmeg, cinnamon, cloves, baking powder, and salt together in a large bowl.\nBeat eggs, white sugar, brown sugar, and vanilla extract in a large bowl with an electric mixer on high speed until combined, about 30 seconds. Beat in pumpkin and oil. Add flour mixture; mix until batter is blended and smooth.\nPour batter into the prepared loaf pan.\nBake in the preheated oven until the top is dark brown and a toothpick inserted into the center of the bread comes out clean, about 70 minutes. Let cool in the pan, about 30 minutes. Invert onto a wire rack and slice it into 1-inch thick slices.\n",
        "picture_link": "KGePrcqtKk4YbzChXyUjp/cO7JFB/iO"
    },
    {
        "title": "Rigatoni alla Genovese",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "6 ounces pancetta or salt pork, diced ADVERTISEMENT",
            "2 1/2 pounds beef chuck ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "1/2 cup diced carrot ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2/3 cup white wine ADVERTISEMENT",
            "4 pounds yellow onions, sliced ADVERTISEMENT",
            "2 pounds red onions, sliced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 (16 ounce) boxes uncooked rigatoni ADVERTISEMENT",
            "1 tablespoon chopped fresh marjoram leaves ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "2 tablespoons freshly grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Cook pancetta until most of fat is rendered out, about 6 minutes. Remove cooked pancetta with a slotted spoon and save.\nRaise heat to high and transfer meat to the pot. Season with salt. Cook and stir until liquid releases from beef and begins to evaporate, and meat browns, 10 to 15 minutes.\nReduce heat to medium-high. Add celery, carrots, reserved cooked pancetta, salt and pepper. Cook and stir about 5 minutes. Add a heaping tablespoon of tomato paste, bay leaf, and white wine. Cook and stir, scraping up the brownings from the bottom of the pan, 2 to 3 minutes. Add sliced onions. Reduce heat to medium. Cover pot and cook 30 minutes without stirring. After 30 minutes, stir onions and meat until well mixed. Cover again, and cook another 30 minutes. Stir.\nReduce heat to low and cook uncovered 8 to 10 hours, stirring occasionally. Skim off fat as mixture cooks. If sauce seems to reduce too much, add water or broth as needed to maintain a sauce-like consistency. Cook until beef and onions seem to melt into each other.\nBring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally until just barely al dente, 10 to 12 minutes. Drain.\nAdd rigatoni to the sauce and cook until heated through. Serve topped with a pinch of marjoram and freshly grated Parmigiano-Reggiano cheese.\n",
        "picture_link": "gs/U9lrcJFXU9dMjY.SOpka7iCKj3C2"
    },
    {
        "title": "Buttery Buttermilk Biscuits",
        "ingredients": [
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups cold LAND O LAKES® Butter ADVERTISEMENT",
            "1 1/2 cups cold buttermilk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour, salt, baking powder, and baking soda together in a mixing bowl.\nSlice the butter into 1/8-inch to 1/4-inch pieces. Put the butter pieces in the flour and mix with your hands, gently rubbing the flour and butter together between your fingers without directly touching the butter to avoid melting it. Mix until the butter pieces are dime-size and covered by the flour mixture.\nStir buttermilk into the flour mixture; mix just until ingredients are combined and form into a ball.\nLine a baking sheet with parchment paper.\nDust work surface and top of dough with flour. Roll out dough into a 3/4-inch-thick rectangle. Fold into thirds (like a letter) using a bench scraper, if needed. Turn dough a half turn, and roll back into a 3/4 inch thick rectangle. Repeat twice more, folding and rolling dough a total of three times.\nFold the dough into thirds once more and transfer the dough to the prepared pan. Cover with plastic wrap and refrigerate 20 minutes.\nPlace the dough on the work surface and roll it out again to 3/4 inch thickness. Use a cookie or biscuit cutter to cut the dough into rounds.\nPlace the biscuits about 1 inch apart on parchment-lined sheet pan. Cover biscuits and refrigerate for at least 20 minutes.\nPreheat oven to 500 degrees F (260 degrees C).\nBrush the tops of the biscuits with buttermilk. Place biscuits in preheated oven.\nImmediately reduce oven temperature to 375 degrees F (190 degrees C).\nBake until biscuits are lightly browned and golden all around (any lighter and they will be doughy inside), 12 to 15 minutes. Allow biscuits to cool for 5 minutes; serve warm.\n",
        "picture_link": "wGgBboWGIa3a8ln/dJV6f/ATnDsZ4Je"
    },
    {
        "title": "Quick-Fix Beef Burrito Skillet",
        "ingredients": [
            "3/4 pound extra-lean ground beef ADVERTISEMENT",
            "1 (35 gram) package 40%-less-sodium taco seasoning mix ADVERTISEMENT",
            "1 (19 ounce) can no salt-added kidney beans ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "4 small flour tortillas, cut into 1-1/2-inch pieces ADVERTISEMENT",
            "1 cup CRACKER BARREL Shredded Light Tex Mex Cheese ADVERTISEMENT",
            "1/3 cup light sour cream ADVERTISEMENT",
            "1/3 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown meat in large nonstick skillet on medium-high heat; drain.\nAdd next 4 ingredients; stir. Bring to boil; simmer on medium-low heat 5 minutes, stirring occasionally.\nStir in tortilla pieces; top with cheese. Cover. Remove from heat; let stand 5 minutes or until cheese is melted. Top with sour cream and onions.\n",
        "picture_link": "QRSAjfnWTe.qtxG1h38Z3ZtRokhYkH."
    },
    {
        "title": "Pressure Cooker Macaroni and Cheese",
        "ingredients": [
            "3 cups chicken broth ADVERTISEMENT",
            "1 pound rotini pasta ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "8 fluid ounces heavy whipping cream ADVERTISEMENT",
            "1 cup shredded mild Cheddar cheese ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 cup shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon yellow mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken broth, rotini, water, heavy cream, mild Cheddar cheese, sharp Cheddar cheese, extra-sharp Cheddar cheese, cream cheese, butter, Parmesan cheese, yellow mustard, salt, and black pepper in a pressure cooker. Seal and bring to high pressure according to manufacturer's instructions. Once full pressure is reached, cook for 7 minutes.\nRelease pressure using quick-release method according to manufacturer's instructions.\n",
        "picture_link": "nnkmkE8qFE1RPuPcHkUn6Fa28FIJ.86"
    },
    {
        "title": "Traditional Swedish Pancakes",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs in a large bowl; add milk, flour, sugar, 1 tablespoon vegetable oil, and vanilla extract and mix until batter is very thin.\nHeat a griddle or a Swedish plett pan over medium heat; add about 1 teaspoon oil. Pour a small amount of batter onto the griddle and tip griddle to spread the batter into a thin layer; cook until lightly browned, 2 to 3 minutes. Flip pancake and cook until browned on the other side, 2 to 3 minutes more. Roll pancake and place on a plate. Repeat with remaining batter.\n",
        "picture_link": "QIkmcLlmoZsbWjKCbBmGfB2isVJ5xh."
    },
    {
        "title": "Spaghetti Sauce with Fresh Tomatoes",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "4 pounds fresh tomatoes, peeled and chopped ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Add onion and garlic powder; cook and stir until onion is translucent, about 5 minutes. Add tomatoes, sugar, basil, parsley, and salt. Bring to a boil. Reduce heat and simmer, stirring occasionally, until sauce thickens, 1 to 2 hours.\n",
        "picture_link": "uA4DUoAjUHFR0lpwjR5Z.SR0Z8yt71K"
    },
    {
        "title": "Creamsicle® Pancakes",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir milk, orange juice, and orange zest together in a bowl. Mix flour, sugar, baking powder, baking soda, and salt together in a separate large bowl. Whisk egg, butter, and vanilla extract into the orange juice mixture. Whisk orange juice mixture into flour mixture until smooth batter forms.\nHeat a lightly oiled skillet over medium-high heat. Drop batter in 1/4-cup spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "wZnIW1xqoCsgZPCZHj04K6LjMQRTrrm"
    },
    {
        "title": "Chicken Paillard",
        "ingredients": [
            "4 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "Marinade: ADVERTISEMENT",
            "1/3 cup dry white wine (optional) ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 small shallot, chopped ADVERTISEMENT",
            "2 teaspoons extra-virgin olive oil ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper, divided ADVERTISEMENT",
            "1/2 teaspoon salt, divided ADVERTISEMENT",
            "4 cups trimmed arugula ADVERTISEMENT",
            "8 ounces cherry tomatoes, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound chicken breasts on a work surface using a meat tenderizer or heavy pan to 1/4-inch thick. Whisk wine, juice of 1 lemon, shallot, 2 teaspoons olive oil, and garlic together in a shallow bowl. Add chicken breasts; marinate for 15 minutes.\nWhisk juice of 1 lemon, vinegar, 1 tablespoon olive oil, and lemon zest together in a large bowl; stir in 1/4 teaspoon salt and 1/4 teaspoon pepper. Add arugula and tomatoes; toss to combine.\nPreheat an outdoor grill for high heat and lightly oil the grate, or heat a skillet over high heat.\nRemove chicken from marinade; season with remaining 1/4 teaspoon salt and 1/4 teaspoon pepper.\nCook chicken on preheated grill until golden brown and just cooked through, 2 to 3 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Plate chicken with arugula salad on top.\n",
        "picture_link": "cijQgJAdaHuJoaY6VXEn1WHtKFSIy6W"
    },
    {
        "title": "Sensational Strawberry Shortcake",
        "ingredients": [
            "1 quart strawberries, sliced ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 cups sweetened whipped cream ADVERTISEMENT",
            "3 sprigs fresh mint (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Lightly grease two 9-inch round cake pans.\nGently stir strawberries and 1/2 cup sugar in a bowl; chill.\nCombine flour, 1/4 cup sugar, baking powder, salt, and nutmeg in a bowl; cut in butter with a knife or pastry blender until mixture resembles coarse crumbs. Whisk milk and egg yolks in a bowl, then stir into flour mixture until just moistened. Divide in half and pat into prepared cake pans.\nBeat egg whites until foamy in a large bowl. Continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Spread over dough; sprinkle with 1/4 cup sugar.\nBake in preheated oven until golden, 40 to 45 minutes. Cool 10 minutes before removing from pan to wire rack; cool completely.\nPlace one cake layer on a large serving plate; spread with half the whipped cream, spoon half the strawberries over cream. Repeat layers; garnish with mint.\n",
        "picture_link": "SraBhXcSCeBxkbflj1BnDqH8xIbNRNK"
    },
    {
        "title": "Lemon Pistachio Zucchini Bread",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1 small lemon, zested ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "1 cup chopped pistachio nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray two 9x5-inch loaf pans with cooking spray.\nMix flour, baking soda, and salt in a bowl. Beat eggs, sugar, and vegetable oil together in another bowl; stir in yogurt, lemon zest, lemon juice, and vanilla extract. Gradually stir flour mixture into wet ingredients until just moistened; fold zucchini and pistachios into batter. Pour batter evenly into prepared loaf pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 45 to 55 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "mOjlZcVhN3vpa8XV0EFEpBavJ2kFf7O"
    },
    {
        "title": "4th of July Blast Smoothie",
        "ingredients": [
            "1 cup fresh blackberries, or more to taste ADVERTISEMENT",
            "5 large strawberries, hulled and halved ADVERTISEMENT",
            "1 large banana ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "2 cups crushed ice ADVERTISEMENT",
            "1 teaspoon white sugar, or to taste (optional) ADVERTISEMENT",
            "12 fresh blackberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1 cup blackberries, strawberries, banana, orange juice, and ice into a blender in that order, and blend on high speed until smooth, 30 seconds to 1 minute. Pour into 4 glasses and top each serving with 3 blackberries for garnish.\n",
        "picture_link": "O.YwTLrn2HiVFd05a9.KzOtZW12OiWS"
    },
    {
        "title": "Purple Apple Slaw with Peanut Butter Dressing",
        "ingredients": [
            "6 tablespoons rice wine vinegar ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "5 tablespoons creamy peanut butter ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons minced fresh ginger root ADVERTISEMENT",
            "1 1/2 tablespoons minced garlic ADVERTISEMENT",
            "1/2 head red cabbage, finely shredded ADVERTISEMENT",
            "2 Braeburn or Fuji apples - peeled, cored, and finely diced ADVERTISEMENT",
            "1/4 cup finely minced white onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk rice wine vinegar, olive oil, peanut butter, soy sauce, brown sugar, ginger, and garlic together in a bowl to make a smooth dressing.\nToss red cabbage, apples, and onion in a large salad bowl and pour dressing over slaw; toss to coat. Chill before serving.\n",
        "picture_link": "yhNgZRBgwTEbO2yk55DL5xLR5fhKgle"
    },
    {
        "title": "Easy Rhubarb Pudding Cake",
        "ingredients": [
            "1 (18.25 ounce) box yellow cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "5 cups chopped rhubarb ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan.\nStir cake mix, 1 cup water, vegetable oil, and eggs in a bowl until moistened; beat with an electric mixer on medium speed for 2 minutes. Pour batter into prepared cake pan. Top the batter with rhubarb and sprinkle with sugar and cinnamon; pour 1 cup hot water evenly over the cake.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out clean or with moist crumbs, 50 minutes to 1 hour.\n",
        "picture_link": "D15tJUMP1D/1GnZaW3LD5rUuW3tfZ26"
    },
    {
        "title": "Chicken in Peanut Sauce",
        "ingredients": [
            "1 cup tomato puree ADVERTISEMENT",
            "1/2 cup smooth peanut butter ADVERTISEMENT",
            "1/2 cup fresh orange juice ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast cutlets, pounded flat ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup water, or as needed (optional) ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons chopped unsalted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thoroughly mix tomato puree, peanut butter, orange juice, soy sauce, and honey in a bowl. Stir ginger and curry powder into the tomato mixture.\nSeason chicken cutlets with salt and black pepper.\nHeat olive oil in a skillet over medium heat; cook chicken in hot oil until golden brown, about 3 minutes per side. Pour the tomato mixture over the chicken, reduce heat to medium-low, and place a cover on the skillet; cook at a simmer, stirring occasionally, until the chicken is cooked through and the sauce thickens, about 30 minutes. Add water as needed to thin sauce if it gets too thick.\nSprinkle parsley and peanuts over the chicken to serve.\n",
        "picture_link": "lQEyadPz6a2NZmzec0hi0hzCRhxSkH6"
    },
    {
        "title": "Brownie Cups",
        "ingredients": [
            "14 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "1 1/2 cups finely crushed animal cracker cookies ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C). Lightly grease 24 muffin cups.\nBeat cocoa powder, 3/4 cup butter, oil, and 2 cups sugar with an electric mixer in a large bowl until smooth. Add eggs one at a time, allowing each egg to blend into butter mixture before adding the next. Beat in vanilla extract with last egg. Mix flour mixture into egg mixture until just incorporated. Fold in walnuts, mixing just enough to evenly combine.\nCombine animal cracker crumbs, 1/3 cup sugar, and 6 tablespoons butter in a bowl; mix until well blended. Press cracker mixture into the bottom of each prepared muffin cup. Pour brownie mixture into muffin cups, filling 3/4 full.\nBake in preheated oven until a toothpick inserted in center comes out clean, 25 to 35 minutes.\n",
        "picture_link": "b09u685/FV3nnLKJPJQ2z9Zn7mEp9.e"
    },
    {
        "title": "Sausage Alfredo Stuffed Peppers",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 (12 ounce) package fresh mushrooms, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pound bulk spicy pork sausage ADVERTISEMENT",
            "1/2 (14 ounce) package cooked bacon, diced ADVERTISEMENT",
            "1 1/2 (8 ounce) packages Neufchatel cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 teaspoons garlic and herb seasoning, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 large green bell peppers, tops and seeds removed ADVERTISEMENT",
            "1 (16 ounce) jar Alfredo sauce ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13 baking dish.\nHeat olive oil in a large skillet over medium heat; cook and stir onion, mushrooms, garlic, and salt until onion is slightly translucent and softened, 7 to 10 minutes.\nCook and stir sausage in a separate skillet over medium heat, breaking into crumbles, until browned, about 10 minutes. Add bacon, Neufchatel cheese, and sour cream; stir to combine. Add mushroom mixture to sausage mixture, reserving about 1/4 cup mushroom mixture. Season with garlic and herb seasoning, salt, and black pepper.\nWarm Alfredo sauce with the reserved mushroom mixture in a pan over medium-low heat, 3 to 5 minutes.\nStuff each bell pepper with sausage-mushroom mixture; place in the prepared baking dish. Top each bell pepper with Cheddar cheese; pour warmed Alfredo sauce over and around the bell peppers. Cover baking dish with aluminum foil.\nBake in the preheated oven until bell peppers are beginning to soften, about 30 minutes. Remove aluminum foil and bake until cheese is melted, 10 to 20 more minutes.\n",
        "picture_link": "HzIOdteBSj3jxTak41NEAoAtS5q0UQW"
    },
    {
        "title": "Nikki's Best Rhubarb Dessert Ever",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 cups chopped rhubarb ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix 3 cups flour and brown sugar in a large bowl; cut in softened butter with a knife or pastry blender until mixture resembles coarse crumbs. Reserve 1 1/2 cups flour mixture; pat remainder into the bottom of a 9x13-inch pan.\nBake in preheated oven until crust is lightly browned, about 15 minutes.\nBeat eggs in a large bowl; mix 1/4 cup flour, white sugar, half-and-half, and salt into eggs, beating until smooth.\nSprinkle chopped rhubarb over baked crust. Pour egg mixture over rhubarb; top with reserved flour mixture.\nBake in preheated oven until eggs are set and lightly browned, 40 to 45 minutes.\n",
        "picture_link": "CYPvCpUGbJiX3rExVPuz5ZgPGiKy0Ve"
    },
    {
        "title": "Perfect Peach Smoothie",
        "ingredients": [
            "1 large peach, sliced and frozen ADVERTISEMENT",
            "1 banana, cut into pieces and frozen ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup soy milk ADVERTISEMENT",
            "1 tablespoon ground flax seed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend peach, banana, orange juice, soy milk, and flax seed in a blender until smooth.\n",
        "picture_link": "gd.ipy/w9DkauLfjHwVzcZEof0VkTCW"
    },
    {
        "title": "Cream of Green Garlic and Potato Soup",
        "ingredients": [
            "4 russet potatoes, peeled and chopped into equal-sized chunks ADVERTISEMENT",
            "3 cups chopped green garlic, white and light green parts only ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 ounces minced prosciutto ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 quart chicken broth, or more as needed ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons chopped fresh chives for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in bowl of water. Set aside.\nSoak green garlic in a bowl of water to remove dirt or sand. Drain and set aside.\nHeat olive oil in a skillet over medium heat; cook and stir minced prosciutto until it begins to sizzle, about 2 minutes. Add green garlic and continue to cook, stirring frequently. Do not let the garlic brown. Season with salt, black pepper, and cayenne pepper; cook and stir for 1 to 2 more minutes.\nMix chicken broth into green garlic mixture and bring to a simmer. Reduce heat to low, cover and cook for 30 minutes.\nRemove potatoes from the bowl of water and add them to the garlic and broth mixture. Cook until potatoes are tender and easily smashed against the side of the pot, about another 30 minutes. Add broth as needed.\nTransfer potato chunks and some green garlic chunks to a blender with about 1/2 cup cooking liquid. Puree until smooth, adding more cooking liquid as needed.\nStir blended potato mixture back into the pot; stir in heavy cream. Cook over medium-high heat until cream is warmed through, about 5 minutes. Season with salt and black pepper to taste. Garnish with fresh chopped chives.\n",
        "picture_link": "bm372HTXBKTSnrgREao.iQ/udwErbQe"
    },
    {
        "title": "Deep Dish Strawberry Pie",
        "ingredients": [
            "1 pastry for a 9-inch deep dish pie crust ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "2 quarts fresh strawberries, hulled, divided ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "3/4 cup ginger ale ADVERTISEMENT",
            "3 1/2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Press pie crust pastry into a 1/2-inch deep dish pie plate. Prick bottom and sides of pastry with fork.\nBake in the preheated oven until lightly brown, 10 to 12 minutes. Cool completely on a wire rack.\nMelt chocolate chips in a saucepan over medium-low heat, stirring constantly, 1 to 3 minutes. Paint melted chocolate in the bottom and inside of cooled pie crust. Place chocolate-painted crust in freezer to harden the chocolate, about 30 minutes.\nPlace the prettiest strawberry, cut-side down, in the center of the chocolate crust. Arrange as many attractive strawberries as possible around the center strawberry, so they appear as circles around the center.\nMash the remaining strawberries in a bowl; transfer to a saucepan. Add sugar and lemon juice; bring to a boil, stirring frequently.\nWhisk ginger ale and cornstarch together in a bowl until smooth; gradually stir into boiling strawberry mixture. Reduce heat to medium-low and simmer, stirring constantly, until thickened, 12 to 14 minutes. Remove from heat and cool for about 5 minutes.\nSpoon strawberry sauce over strawberries in pie shell. Chill in refrigerator until pie is set, at least 8 hours.\n",
        "picture_link": "MN7WLZTQM8aGkqLBkQFxKRy3GmnhEUu"
    },
    {
        "title": "Creamy Rosemary Au Gratin Potatoes",
        "ingredients": [
            "3 tablespoons butter, divided ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "4 russet potatoes - scrubbed, unpeeled, and cut into 1/4-inch slices ADVERTISEMENT",
            "1 onion, sliced into rings ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Grease a 1-quart baking dish with about 1 teaspoon butter.\nMelt remaining butter in a saucepan over medium heat. Add flour and 1/2 teaspoon sea salt; whisk constantly for 1 minute. Pour half-and-half into flour mixture, stirring and cooking until mixture has thickened, about 4 minutes.\nLayer half the potatoes into the bottom of prepared baking dish. Top with onion slices, rosemary, 1/2 cup Cheddar cheese, and remaining potatoes; season with sea salt and pepper. Sprinkle 1 cup Cheddar cheese and paprika over potatoes. Pour half-and-half mixture over potato mixture; cover with aluminum foil.\nBake in preheated oven until potatoes are tender, about 75 minutes. Remove aluminum foil and continue baking until potatoes are lightly browned, about 15 minutes.\n",
        "picture_link": "q9qVt8Yk4SBV6fk3IP/62wm6ylB8mdW"
    },
    {
        "title": "Grilled Mahi Mahi in Thai Coconut Sauce",
        "ingredients": [
            "1 1/2 cups coconut milk ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons chopped green onion ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "4 teaspoons minced fresh ginger root ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon fish sauce ADVERTISEMENT",
            "2 (6 ounce) mahi mahi fillets ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a grill pan over medium heat.\nStir coconut milk, 2 tablespoons cilantro, 2 tablespoons green onion, lime juice, ginger, garlic, and fish sauce together in a saucepan; bring to a boil. Brush the mahi mahi fillets with enough sauce to coat. Cook the remaining sauce at a boil until slightly thickened, 3 to 4 minutes.\nCook the mahi mahi in the grill pan until the fish flakes easily with a fork, about 7 minutes per side. Transfer to a serving platter, top with the sauce, and garnish with 2 tablespoons cilantr and 2 tablespoons green onion to serve.\n",
        "picture_link": "7q1JiPq0Rn3XIFC8YqQZyK47DLEt2Eu"
    },
    {
        "title": "Almost Authentic Caesar Salad",
        "ingredients": [
            "3 thick slices French bread, cut into cubes ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt ADVERTISEMENT",
            "1 1/2 teaspoons anchovy paste ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "fresh ground black pepper to taste ADVERTISEMENT",
            "1/3 cup canola oil ADVERTISEMENT",
            "1 head romaine lettuce, coarsely chopped ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nArrange French bread cubes in a single layer on a baking sheet with a rim. Melt butter in a small saucepan over medium heat; cook and stir 1 clove garlic until fragrant, 1 to 2 minutes. Pour butter mixture over bread cubes; season with salt, black pepper, and parsley. Toss to coat.\nBake in the preheated oven until lightly browned on the outside and crisp in the middle, 10 to 15 minutes.\nWhisk lemon juice, Dijon mustard, Worcestershire sauce, kosher salt, anchovy paste, 1 clove garlic, and black pepper together in a bowl. Slowly drizzle in canola oil, while whisking lemon mixture with opposite hand until emulsified.\nCombine romaine lettuce, Parmesan cheese, and half the dressing in a bowl; toss to coat. Add croutons and remaining dressing; toss to coat.\n",
        "picture_link": "y6k7C2lsnB/43hVFf/wu.6VQXKv/syG"
    },
    {
        "title": "Grilled Corn with Cilantro Lime Butter",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 1/2 tablespoons fresh lime juice ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "8 ears corn on the cob, unhusked ADVERTISEMENT",
            "3 quarts cold water, or as needed to cover ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter in a bowl until smooth; mix in cilantro, lime juice, and cayenne pepper until thoroughly combined. Cover and refrigerate 1 hour to blend flavors.\nPeel husks back from ears of corn starting at the top, leaving the husks attached at the bottom of the ears. Remove all the corn silk and close husks over the ears again. Cover corn ears with cold water in a large bowl until husks are thoroughly soaked, about 20 minutes.\nPreheat grill for medium heat and lightly oil the grate.\nPlace the corn in husks onto the hot grate and grill covered until husks are charred and the corn kernels are tender, 20 to 25 minutes, turning often. Strip off husks and serve corn with cilantro lime butter.\n",
        "picture_link": "NtC3ocMNXHjPZa5FHQNe5vk2TTn4HIC"
    },
    {
        "title": "Mauigirl's Mango Salsa",
        "ingredients": [
            "2 cups chopped ripe mango ADVERTISEMENT",
            "1/4 cup chopped sweet onion (such as Maui) ADVERTISEMENT",
            "1/4 cup finely chopped red bell pepper ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 jalapeno pepper, seeded and finely chopped ADVERTISEMENT",
            "1 teaspoon grated lime zest ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mango, onion, bell pepper, cilantro, lime juice, jalapeno pepper, lime zest, and ginger in a bowl; cover and chill for 8 hours to overnight.\n",
        "picture_link": "VzobK4FrDHS6X/vqM8xPZ0Pm5zr.Nai"
    },
    {
        "title": "Chicken Enchiladas With Mole Sauce",
        "ingredients": [
            "2 tablespoons lard ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon cumin seeds ADVERTISEMENT",
            "2 poblano peppers, seeded and thinly sliced ADVERTISEMENT",
            "2 Anaheim peppers, seeded and thinly sliced ADVERTISEMENT",
            "4 skinless, boneless chicken thighs, cut into chunks ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "4 dried guajillo chiles, stemmed and seeded ADVERTISEMENT",
            "2 dried ancho chiles, stemmed and seeded ADVERTISEMENT",
            "1 corn tortilla, cut into 1-inch strips ADVERTISEMENT",
            "4 tomatoes, cut in half crosswise ADVERTISEMENT",
            "3 tomatillos, cut in half crosswise ADVERTISEMENT",
            "2 tablespoons lard ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "5 cloves garlic, sliced ADVERTISEMENT",
            "2 teaspoons cumin seeds ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon white sugar, or more to taste ADVERTISEMENT",
            "3 ounces dark chocolate, coarsely chopped ADVERTISEMENT",
            "12 corn tortillas ADVERTISEMENT",
            "1/2 bunch fresh cilantro, coarsely chopped ADVERTISEMENT",
            "1/2 cup crumbled queso fresco ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 2 tablespoons lard in a stockpot. Stir in 1/2 onion, 2 cloves garlic, 1 teaspoon salt, 1 tablespoon cumin seeds, poblano peppers, and Anaheim peppers; cook and stir until onions are soft, 5 to 8 minutes. Add chicken thighs and 4 cups chicken broth, cover, and simmer until reduced, about 40 minutes.\nHeat 2 cups chicken broth in a saucepan until it begins to simmer, about 5 minutes. Pour broth into a blender.\nToast guajillo chiles and ancho chiles in a dry skillet on medium-high heat until hot and aromatic, 3 to 4 minutes. Place toasted chiles and tortilla strips in the blender with the hot broth. Press them down so they are fully submerged and soak until softened, about 10 minutes. Blend the chile and tortilla mixture until smooth.\nCook tomatoes and tomatillos in a dry skillet on medium-high heat until soft and blackened, 3 to 4 minutes per side.\nMelt 2 tablespoons lard in a large skillet over medium heat. Stir in 1/2 sliced onion, 5 garlic cloves, 2 teaspoons cumin seeds; cook and stir until onions are soft and golden, 5 to 8 minutes. Add onion mixture to the blender with the chile mixture and blend until smooth.\nPour chile puree into a large saucepan over medium heat. Stir in 2 cups chicken broth, salt, sugar, and chocolate. Bring mixture to a simmer; cook and stir until chocolate is melted, about 5 minutes.\nToast tortillas in a dry skillet over medium heat until golden and soft, 2 to 3 minutes per side. Fill each tortilla with 1/3 cup chicken mixture. Roll and place seam side down on a plate. Continue with remaining tortillas, 3 per plate. Top each trio of tortillas with 1/3 cup mole sauce, 1 to 2 tablespoons chopped cilantro, and 1 to 2 tablespoons queso fresco.\n",
        "picture_link": "qlo2FBpOHiDdWCF/QKaa/so/gRkJoTu"
    },
    {
        "title": "Light Spaghetti Salad",
        "ingredients": [
            "2 (12 ounce) packages spaghetti ADVERTISEMENT",
            "1 small red onion, finely chopped ADVERTISEMENT",
            "1 red bell pepper, seeded and finely chopped ADVERTISEMENT",
            "1 cucumber, chopped ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1 (16 ounce) bottle fat-free Italian salad dressing ADVERTISEMENT",
            "1 (.7 ounce) package dry Italian salad dressing mix (such as Good Seasons®) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain and rinse in cold water.\nPlace spaghetti into a large salad bowl and toss with red onion, red bell pepper, cucumber, tomato, Italian salad dressing, salad dressing mix, and salt. Chill before serving; salad is better the longer it chills.\n",
        "picture_link": "yKcq12QuxGfH0p5J2bNJQbR.IwNqc0."
    },
    {
        "title": "Lobster Scrambled Eggs",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1/2 teaspoon chopped fresh tarragon ADVERTISEMENT",
            "4 ounces cooked lobster meat, cut into bite-sized pieces ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs and tarragon in a small bowl. Set aside.\nSprinkle lobster pieces with cayenne pepper.\nMelt butter in nonstick pan over medium-low heat. Add lobster; cook, stirring, until warmed through, 2 to 4 minutes. Stir in egg mixture; increase heat to medium and scramble eggs, stirring constantly, until nearly set, 3 to 4 minutes.\n",
        "picture_link": "zcFJ4sywT40B3vCg158zUEhxKimLpEa"
    },
    {
        "title": "Unhealthy Quinoa Mac and Cheese",
        "ingredients": [
            "5 slices bread, crusts removed and cubed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "3 cloves garlic, diced ADVERTISEMENT",
            "2 cups quinoa ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "2 cups skim milk ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "8 ounces sharp Cheddar cheese, shredded ADVERTISEMENT",
            "4 ounces mozzarella cheese, shredded ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 large tomato, cored and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nProcess cubed bread in a food processor to make bread crumbs. Set aside.\nHeat olive oil in a deep ovenproof skillet or Dutch oven. Add onion; cook and stir until softened, about 5 minutes. Add garlic; cook and stir until fragrant, about 1 minute.\nAdd quinoa, chicken stock, and water to the skillet. Bring to a simmer; cover and cook until quinoa is tender, about 10 minutes.\nHeat 1/4 cup butter in a saucepan over medium-low heat. Add flour; cook and stir to form a paste, about 2 minutes. Slowly whisk in skim milk. Season with salt and ground black pepper; simmer on low until thickened, about 5 minutes. Remove saucepan from heat; stir in Cheddar and mozzarella cheeses, a little at a time, until combined. Stir cheese sauce into quinoa mixture in the skillet.\nMelt 1 tablespoon butter in a separate skillet over medium heat. Add bread crumbs; cook and stir until crumbs are toasted, about 2 minutes. Place tomato slices on top of quinoa; top with bread crumbs. Quinoa mixture will be soupy but will firm up during baking.\nBake in the oven until golden brown, about 25 minutes. Allow to rest for 5 minutes before serving.\n",
        "picture_link": "7Vz7hZKb5ZxkiKS12m58ZIf4VVz6P.y"
    },
    {
        "title": "Zucchini Crisp",
        "ingredients": [
            "8 cups cubed peeled zucchini ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup brown sugar, packed ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nMix zucchini, white sugar, lemon juice, cinnamon, and nutmeg in a large bowl. Pour mixture into baking dish.\nCombine brown sugar, oats, and flour in another bowl. Cut in margarine until mixture resembles coarse crumbs; sprinkle over zucchini.\nBake in preheated oven until bubbly and zucchini is tender, 40 to 45 minutes.\n",
        "picture_link": "65S3Y36wU95aErTmhRJsJQIlJJuj.Fy"
    },
    {
        "title": "Cranberry Orange Bread (For Bread Machine)",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "3/4 cup plain yogurt ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon orange oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour, cranberries, yogurt, water, honey, butter, yeast, salt, and orange oil in the pan of a bread machine in the order recommended by the manufacturer. Select \"light crust\" setting; press Start.\n",
        "picture_link": "9hBMU9WHV3IaCUenk/qjsO01rywTpmC"
    },
    {
        "title": "Quick Lemon Poppy Seed Muffins",
        "ingredients": [
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 lemons, zested ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 10 muffin cups or line with paper muffin liners.\nBeat sugar and oil together in a bowl with an electric mixer. Add eggs and lemon zest; beat until smooth.\nStir flour, poppy seeds, baking powder, and salt together in bowl; gradually beat into the sugar mixture alternately with buttermilk and 2 tablespoons lemon juice until you achieve a smooth batter. Stir vanilla extract into the batter; pour into prepared muffin tins.\nBake in the preheated oven until golden and the tops spring back when lightly pressed, 25 to 35 minutes. Cool muffins in pans for a few minutes before moving to a wire rack to cool completely.\nStir confectioners' sugar and 2 tablespoons lemon juice together in a bowl; drizzle over tops of cooled muffins.\n",
        "picture_link": "HNI/tZMTxKcHQinq1JAKjhT6ehTni/a"
    },
    {
        "title": "Sweet and Simple Lemon Tart",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup sifted confectioners' sugar ADVERTISEMENT",
            "1 cup sifted all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons fresh lemon juice, or more to taste ADVERTISEMENT",
            "2 teaspoons grated lemon peel ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking pan.\nCombine butter with 1/4 cup confectioners' sugar in a bowl until smooth; stir in 1 cup flour. Press dough into prepared baking pan; pierce crust with fork in several places to prevent crust from puffing up during baking.\nBake crust in the preheated oven until slightly golden brown, 10 to 15 minutes. Let cool.\nWhisk white sugar and eggs in a bowl; stir 3 tablespoons flour into mixture and add lemon juice, lemon peel, and salt. Whisk until thoroughly combined. Pour mixture into baked tart crust.\nBake until filling is set, 20 to 25 minutes. Let cool and dust with 3 tablespoons confectioners' sugar.\n",
        "picture_link": "KoiVK52H0ELVZ.rGFjHF1wIThxPeQly"
    },
    {
        "title": "Connie's Sweet and Sour Christmas Meatballs ",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "2 slices bread, crumbled ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1 cup beef bouillon ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat egg and water in a bowl; add ground beef, bread crumbs, salt, and black pepper to eggs and mix thoroughly. Form ground beef mixture into bite-size meatballs; place meatballs into a large baking dish.\nBake in the preheated oven until meatballs are browned and no longer pink inside, 25 to 30 minutes.\nMix ketchup, beef bouillon, and vinegar in a large saucepan or Dutch oven. Combine brown sugar and cornstarch in a small bowl and stir brown sugar mixture into ketchup mixture. Bring to a boil, reduce heat to low, and stir until sauce is thickened and bubbling and brown sugar has dissolved, about 5 minutes. Add meatballs to sauce, stir until coated, and serve.\n",
        "picture_link": "gjzIQj86yXuoRRVHcnIF79NdL1kqIvO"
    },
    {
        "title": "Italian Shrimp Caprese Pasta",
        "ingredients": [
            "8 ounces uncooked dried linguine ADVERTISEMENT",
            "2 squares Italian Herb Saute Express® Saute Starter ADVERTISEMENT",
            "1 pound uncooked medium shrimp, peeled, deveined ADVERTISEMENT",
            "1 cup grape tomatoes, halved ADVERTISEMENT",
            "1 cup fresh mozzarella pearls or cubed mozzarella ADVERTISEMENT",
            "1/4 cup chopped fresh basil leaves ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to package directions; drain.\nMelt Saute Express(R) squares in 12-inch nonstick skillet over medium-low heat just until bubbles begin to form.\nAdd shrimp.\nSaute 5-7 minutes or until shrimp turn pink. Add pasta, tomatoes, mozzarella and basil; stir until coated and heated through. Sprinkle with Parmesan cheese.\n",
        "picture_link": "af3PuHkwc621BZnpJKiGQ.iPsskHj2u"
    },
    {
        "title": "Hillbilly Breakfast",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 pound bulk pork sausage ADVERTISEMENT",
            "1 4x4-inch square prepared cornbread, crumbled ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (10 ounce) package frozen bell pepper and onion mix, thawed ADVERTISEMENT",
            "1 dash hot sauce, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large skillet over medium heat; cook and stir sausage until browned and crumbly, about 8 minutes. Gently mix cornbread with sausage and cook until heated through, about 3 minutes. Stir eggs into sausage and cornbread, one at a time, cooking until eggs are scrambled and firm.\nStir bell pepper and onion mix into skillet; cook until heated through, stirring occasionally, about 5 minutes. Season with hot sauce, salt, and black pepper.\n",
        "picture_link": "ZBn2tg2TRyeL26mw0/.FivYLZw2P9cK"
    },
    {
        "title": "Grilled Broccoli--My Kids Beg for Broccoli",
        "ingredients": [
            "2 heads broccoli, cut into large florets ADVERTISEMENT",
            "1 (16 fl oz) bottle balsamic vinaigrette salad dressing (such as Kraft®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place broccoli and salad dressing in a large resealable plastic bag, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 8 hours, turning bag occasionally.\nPreheat an outdoor grill for high heat and lightly oil the grate. Drain broccoli.\nGrill broccoli on preheated grill until vegetables are tender and browned, turning occasionally, 5 to 7 minutes.\n",
        "picture_link": "fju9DMOshU3p4YiynUbr3jc/MXAaxq6"
    },
    {
        "title": "Mushroom Cream Sauce With Shallots",
        "ingredients": [
            "2 lobster mushrooms, cut into cubes ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons grated Asiago cheese ADVERTISEMENT",
            "1/2 shallot, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place mushrooms in a nonstick skillet over medium heat; add water. Cook, stirring occasionally, until water is evaporated, about 5 minutes.\nWhisk cream and flour into mushrooms until flour is incorporated. Add Asiago cheese, shallot, salt, and black pepper to mushroom mixture, stirring constantly. Cook and stir until sauce thickens, about 7 minutes.\n",
        "picture_link": "LT06Gx.m0TdWWE6ZPoBeWZ/9XRSMn1."
    },
    {
        "title": "Wabbit-Approved Carrot Raisin Salad",
        "ingredients": [
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/2 cup crushed pineapple in juice ADVERTISEMENT",
            "3 large carrots, shredded ADVERTISEMENT",
            "1/4 cup raisins, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix yogurt and pineapple in a bowl until blended; fold in carrots and raisins.\n",
        "picture_link": "4Vifg1Q8cr1OHbFMeH0FjCbt9ExCKfK"
    },
    {
        "title": "Fresh Homemade Salsa",
        "ingredients": [
            "2 cups chopped tomatoes ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "1/4 cup chopped yellow onion ADVERTISEMENT",
            "2 tablespoons canned green chilies ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 cloves garlic, peeled ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomatoes, red onion, yellow onion, green chilies, lime juice, cilantro, garlic, cumin, and salt in a food processor. Pulse processor until mixture is combined, yet remains chunky. Transfer to a bowl, cover with plastic wrap, and refrigerate at least 1 hour.\n",
        "picture_link": "HPxgCZnoHvFpWDGt8VWBEwBJb.QJCWi"
    },
    {
        "title": "Rice and Beef Stuffed Tomatoes",
        "ingredients": [
            "7 tomatoes ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup instant rice ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 clove garlic, diced ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (6 fluid ounce) can tomato juice (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nCut tops from tomatoes and scoop out the pulp; transfer pulp to a bowl and chop. Reserve tops of tomatoes.\nBring water to a boil in a saucepan, pour in the rice, and cover pan; let stand until rice absorbs water, about 5 minutes.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix cooked rice, onion, garlic, garlic salt, and black pepper into ground beef; add reserved tomato pulp and tomato sauce. Bring the mixture to a boil, reduce heat to low, and simmer until thickened, 10 minutes.\nSet hollowed-out tomatoes into the prepared baking dish and fill each tomato with ground beef mixture. If desired, place tomato tops back on filled tomatoes. Pour tomato juice over filled tomatoes for extra juiciness.\nBake in the preheated oven until tomatoes are tender and filling is hot, about 20 minutes.\n",
        "picture_link": "o.NK2EFFtL068wpJJ2PuDyYrsCwXp6m"
    },
    {
        "title": "Pasta e Fagioli ala Weeble",
        "ingredients": [
            "1 cup ditalini pasta ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "4 slices bacon, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "1 (15 ounce) can Romano beans, drained ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "1 pinch crushed dried chile pepper ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 teaspoons grated Romano cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat; stir in the ditalini, and return to a boil. Cook, uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 6 minutes; drain.\nHeat olive oil in a large pot over medium heat; stir in onion and bacon and saute until onions are soft, about 5 minutes. Stir garlic into onion mixture; cook over medium-low heat just until fragrant, about 1 minute.\nStir chicken broth, beans, tomato paste, and chile pepper into onion-bacon mixture; bring to a simmer and cook until fully heated through, about 10 minutes. Stir ditalini and parsley into the soup; season with salt and pepper. Sprinkle each serving with Romano cheese.\n",
        "picture_link": "NSSHlij8B0WkhesGkM/rNVr2Vv5iQVG"
    },
    {
        "title": "Creamy Homestyle Turnips",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "5 large turnips, cut into cubes ADVERTISEMENT",
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 green onion, minced ADVERTISEMENT",
            "1/2 teaspoon oregano ADVERTISEMENT",
            "1/2 teaspoon parsley flakes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat. Cook and stir garlic in melted butter until browned, about 5 minutes. Stir turnips into the butter and garlic; cook and stir until just beginning to soften, 7 to 10 minutes. Add cream and Parmesan cheese to the turnip mixture; bring to a simmer and cook, stirring regularly, until the liquid thickens, 10 to 15 minutes. Stir green onion, oregano, parsley, salt, and black pepper into the turnip mixture; cook until the green onion slightly wilts, 1 to 2 minutes.\n",
        "picture_link": "gAZX/U161mTuLgry/ybCpTVP8RTt07."
    },
    {
        "title": "Wild Rocket (Arugula) and Parmesan Salad",
        "ingredients": [
            "2 (5 ounce) packages arugula ADVERTISEMENT",
            "1/4 cup roughly chopped cilantro ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 teaspoon balsamic vinegar ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1/4 cup shaved Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss arugula and cilantro together in a large salad bowl. Drizzle arugula mixture with lemon juice, olive oil, and balsamic vinegar. Sprinkle with red pepper flakes and black pepper; toss salad again. If desired, add more lemon juice, olive oil, balsamic vinegar, red pepper flakes, and black pepper to taste.\nSprinkle salad with Parmesan cheese shavings and toss again to serve.\n",
        "picture_link": "37jgJjOPsVI11r6mv0WTGd3sP76/7HK"
    },
    {
        "title": "Celyne's Green Juice - Juicer Recipe",
        "ingredients": [
            "2 oranges, peeled ADVERTISEMENT",
            "1 lemon, peeled ADVERTISEMENT",
            "1 green apple, quartered ADVERTISEMENT",
            "1 cup fresh spinach ADVERTISEMENT",
            "1 leaf kale ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process oranges, lemon, green apple, spinach, and kale through a juicer according to manufacturer's recommendations.\n",
        "picture_link": "oA1FwNWktQxcurWBkvKtcdxPCm2bivy"
    },
    {
        "title": "Costa del Sol Barbeque Sauce",
        "ingredients": [
            "1 1/2 cups ketchup ADVERTISEMENT",
            "7 ounces brown sugar ADVERTISEMENT",
            "1/2 red onion, finely chopped ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "3 1/2 fluid ounces red wine vinegar ADVERTISEMENT",
            "2 ounces butter ADVERTISEMENT",
            "1/2 small red chile pepper, finely chopped, or to taste ADVERTISEMENT",
            "3 cloves garlic, finely chopped ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ketchup, brown sugar, red onion, honey, vinegar, butter, red chile pepper, garlic, cayenne pepper, paprika, salt, and black pepper in a saucepan; bring to a boil. Reduce heat to low and simmer, stirring occasionally, until sauce is slightly thickened, about 20 minutes. Blend with a hand blender until smooth.\n",
        "picture_link": "WE2SNR/8UKvr/cEQPueDusckMtaDLr2"
    },
    {
        "title": "Coconut Fish Curry",
        "ingredients": [
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 1/4 ounces coconut milk, divided ADVERTISEMENT",
            "4 1/4 ounces water, divided ADVERTISEMENT",
            "3 1/2 ounces cod, cut into bite-size pieces ADVERTISEMENT",
            "1 large tomato, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine curry powder, ground ginger, and ground turmeric in a skillet; toast the spices over medium heat until browned, about 5 minutes. Pour olive oil and garlic into the spice mixture and stir to make a paste.\nStir onion into the spice mixture; cook and stir until the onion is tender, 5 to 7 minutes. Stir about half the coconut milk and half the water into the onion mixture; simmer together for 5 minutes. Add cod to the mixture; continue cooking until the fish is firm, about 5 minutes. Add tomato, remaining coconut milk, and remaining water to the skillet; cook until the tomato is softened, about 5 minutes.\n",
        "picture_link": "ZKwbuS2jcHRkFuGssBuCQIHRz3p1eIi"
    }
]