[
    {
        "title": "Potato Waffles",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 cups mashed potatoes ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat.\nCook and stir onion and garlic in the melted butter until onion is tender, 5 to 7 minutes.\nPreheat a waffle iron according to manufacturer's instructions.\nCombine onion mixture, mashed potatoes, flour, eggs, salt, and black pepper in a large bowl until well blended.\nScoop 1/4 to 1/2 cup batter (depending on size of waffle iron) into the center of waffle iron and close lid. Cook until golden brown, 3 to 5 minutes.\n",
        "picture_link": "mL3tk4v299RGf4sHNpGZYZMIcesmzgW"
    },
    {
        "title": "Southern-Style Neck Bones",
        "ingredients": [
            "2 onions, roughly chopped ADVERTISEMENT",
            "5 cloves garlic, roughly chopped ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "4 pounds pork neck bones ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nSprinkle 3/4 of the onion and garlic into the bottom of a roasting pan; pour in the vinegar and water. Season the neck bones with salt and pepper and place into the roasting pan. Sprinkle the remaining onion and garlic over the neck bones; cover the roasting pan tightly with aluminum foil.\nBake in the preheated oven for 2 hours, basting every 30 minutes. Be sure to recover the foil every time you baste. After 2 hours, remove the foil and continue baking until the neck bones are golden brown, about 45 minutes.\n",
        "picture_link": "xKZqt9rBxUWN.JYcHZ4hGgF/.9VcPHS"
    },
    {
        "title": "Zucchini Spice Cake",
        "ingredients": [
            "3 cups grated unpeeled zucchini ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup unsweetened applesauce ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x13 inch pan.\nPlace grated zucchini in a colander and set aside to drain.\nWhisk together the flour, baking soda, baking powder, white sugar, brown sugar, cinnamon, cloves, nutmeg, and salt in a large bowl until well blended. Beat the eggs, applesauce, oil, and vanilla in a separate bowl until smooth. Fold in the flour mixture, then stir in the zucchini. Pour the batter into the prepared pan.\nBake until a toothpick inserted in the center comes out clean, 45 to 55 minutes. Allow to cool completely before cutting.\n",
        "picture_link": "9LlBWhRFOHaIb6KCmFw46rWmTBWqwOe"
    },
    {
        "title": "Parker's Famous Margaritas",
        "ingredients": [
            "5 fluid ounces tequila ADVERTISEMENT",
            "3 fluid ounces fresh lime juice ADVERTISEMENT",
            "1 fluid ounce sweetened lime juice ADVERTISEMENT",
            "3 fluid ounces triple sec (orange-flavored liqueur) ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "1 lime, cut into wedges ADVERTISEMENT",
            "rimming salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure the tequila, lime juice, sweetened lime juice and triple sec into a cocktail shaker and add a generous scoop of ice. Cover and shake until the shaker is frosty, about 30 seconds.\nRub a lime wedge around the rim of a margarita glass and dip in salt. Fill each glass with ice. Strain equal amounts of the cocktail into the glasses to serve. Garnish with a lime wedge.\n",
        "picture_link": "YO0rfYf/CdcgO1C5PkP8MfIG7q6SFci"
    },
    {
        "title": "Winter Chicken Bake",
        "ingredients": [
            "1 sweet potato ADVERTISEMENT",
            "1/2 medium sweet onion, chopped ADVERTISEMENT",
            "1 medium apple - peeled, cored, and chopped ADVERTISEMENT",
            "3 carrots, peeled and chopped ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons barbecue sauce ADVERTISEMENT",
            "1 cup cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking dish.\nPierce the sweet potato several times with a fork and cut in half. Place in a microwave-safe dish; pour water to about 1/2-inch deep. Cook in microwave 10 minutes.\nArrange the onion, apple, and carrots into the bottom of the prepared baking dish. Brush the barbecue sauce on both sides of the chicken breasts and lay atop the vegetables. Peel the sweet potato and cut into large chunks; scatter into the baking dish. Sprinkle the cranberries over the dish.\nBake in the preheated oven until the chicken is tender and no longer pink in the center, 45 to 55 minutes. Allow to cool 5 minutes before serving.\n",
        "picture_link": "r1D/mXuvifTxsN6xbrfPQ8KM3synFqm"
    },
    {
        "title": "Grinch Kabobs",
        "ingredients": [
            "24 green grapes ADVERTISEMENT",
            "1 large banana, cut into 24 slices, or as needed ADVERTISEMENT",
            "24 hulled strawberries, tips removed ADVERTISEMENT",
            "24 miniature marshmallows ADVERTISEMENT",
            "24 toothpicks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thread 1 grape, 1 banana slice, 1 strawberry (narrow end facing up), and 1 marshmallow onto 1 toothpick to resemble the Grinch's head in his red hat. Repeat with remaining grapes, banana slices, strawberries, and marshmallows.\n",
        "picture_link": "u4m/dJD.vsMUEGZ0gvR.JRDFFCP5OoS"
    },
    {
        "title": "Turkey-Lentil Chili",
        "ingredients": [
            "2 cups dry lentils ADVERTISEMENT",
            "2 quarts vegetable broth ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 pound turkey sausage ADVERTISEMENT",
            "2 tomatoes, peeled, seeded, and chopped ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon dried thyme leaves ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "1 (8 ounce) container plain lowfat yogurt ADVERTISEMENT",
            "1/4 cup chopped fresh parsley for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring lentils and vegetable broth to a boil in a large pot over high heat. Reduce heat to medium, and simmer for 10 minutes.\nMeanwhile, heat the olive oil in a large skillet over medium-high heat. Stir in the garlic, onion, celery, and sausage; cook and stir until the sausage is crumbly and no longer pink, about 10 minutes. Stir in tomatoes, turmeric, cumin, thyme, and red pepper flakes; cook 5 minutes more.\nStir the sausage mixture into the simmering lentils. Continue simmering until the lentils are tender, 20 to 30 minutes. Season to taste with salt. Garnish each serving with a dollop of yogurt and a sprinkle of chopped parsley to serve.\n",
        "picture_link": "LPjCxdNTQ5TIdHKEpW8p2ZzfHLW2YmS"
    },
    {
        "title": "Delightful Indian Coconut Vegetarian Curry in the Slow Cooker",
        "ingredients": [
            "5 russet potatoes, peeled and cut into 1-inch cubes ADVERTISEMENT",
            "1/4 cup curry powder ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 large green bell pepper, cut into strips ADVERTISEMENT",
            "1 large red bell pepper, cut into strips ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix (such as Lipton®) ADVERTISEMENT",
            "1 (14 ounce) can unsweetened coconut cream ADVERTISEMENT",
            "water, as needed ADVERTISEMENT",
            "1 1/2 cups matchstick-cut carrots ADVERTISEMENT",
            "1 cup green peas (optional) ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into the bottom of a slow cooker.\nMix the curry powder, flour, chili powder, red pepper flakes, and cayenne pepper together in a small bowl; sprinkle over the potatoes. Stir the potatoes to coat evenly. Add the red bell pepper, green bell pepper, onion soup mix, and coconut cream; stir to combine.\nCover the slow cooker and cook on Low until the mixture is bubbling, adding water as needed to keep moist, 3 to 4 hours. Add the carrots to the mixture and cook another 30 minutes. Stir the peas into the mixture and cook until the vegetables are tender to your liking, about 30 minutes. Garnish individual portions with cilantro to serve.\n",
        "picture_link": "MRIuv0P3Bo/JnQsghkS92yS89nEHD7G"
    },
    {
        "title": "Spinach Caprese Salad",
        "ingredients": [
            "1 cup baby spinach leaves ADVERTISEMENT",
            "1 large tomato, sliced 3/4 inch thick ADVERTISEMENT",
            "1 ball of fresh mozzarella cheese, sliced ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread the spinach out on a serving plate. Place the slices of tomato on the bed of spinach. Top each slice of tomato with a slice of fresh mozzarella. Sprinkle the basil over the salad and drizzle with olive oil and balsamic vinegar.\n",
        "picture_link": "0/3byY1PcbRL7i4j.ahszQO/8r2P/E2"
    },
    {
        "title": "Bob's Slow Cooker Braciole",
        "ingredients": [
            "2 (26 ounce) jars marinara sauce ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1 (1 1/2-pound) flank steak, pounded to 1/4 inch ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "ground black pepper ADVERTISEMENT",
            "5 slices bacon ADVERTISEMENT",
            "1 cup shredded Italian cheese blend ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the marinara sauce into the slow cooker and set on High to warm.\nCombine the eggs and the breadcrumbs in a small bowl. Sprinkle both sides of the meat with salt and pepper. Pat the breadcrumb mixture over one side of the flank steak, leaving about a one inch border around edges. Top breadcrumbs with the bacon slices; sprinkle with shredded cheese. Starting from one long side, tightly roll flank steak into a log. Use string or toothpicks to secure the log in 4 or 5 places.\nHeat oil in a heavy skillet. Sear the stuffed flank steak in the hot oil until well browned on all sides, about 10 minutes. Transfer the meat to the warm sauce in the slow cooker. Spoon sauce over meat to cover.\nTurn slow cooker to Low; cook meat until very tender, 6 to 8 hours. Remove string/toothpicks before slicing. Serve with marinara.\n",
        "picture_link": "rF5yzpZlpC2LbzzW7Ae8js6HdGmb1q2"
    },
    {
        "title": "Barbequed Cabbage",
        "ingredients": [
            "1/2 head cabbage, cut into thick shreds ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "freshly ground pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat.\nEvenly divide the cabbage among 4 squares of aluminum foil. Sprinkle 2 tablespoons of soy sauce over each pile of cabbage, and place a tablespoon of butter on top. Season with pepper to taste, and fold the sides of the foil over the cabbage, sealing to form a packet.\nPlace packets onto preheated grill, and cook until the cabbage is tender, 15 to 20 minutes.\n",
        "picture_link": "b1RfbTZtVdUbsHC/5FFePQQU0uTID8C"
    },
    {
        "title": "White Sauce for Pasta",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cube chicken bouillon, crumbled ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "1 cup 2% milk ADVERTISEMENT",
            "ground white pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter and margarine in a saucepan over medium-low heat; stir in flour and bouillon until roux is well blended. Continue to cook and stir until thickened and lightly browned, about 5 minutes. Increase heat to medium and whisk water into roux until smooth. Stir in milk; cook and stir until thickened, about 2 minutes more. Season with white pepper.\n",
        "picture_link": "eNc3joI/SaL3cmF7jV6Kfmr9LET3pYa"
    },
    {
        "title": "Dry Buttermilk Ranch Mix",
        "ingredients": [
            "1/4 cup dry buttermilk powder ADVERTISEMENT",
            "2 tablespoons dried minced onion ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 tablespoon dried chives ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried celery flakes ADVERTISEMENT",
            "1/2 teaspoon white pepper ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the buttermilk powder, dried onion, parsley, chives, salt, garlic powder, dried celery flakes, white pepper, paprika, and dill together, and store in a cool, dry place. For a finer texture, place ingredients in a blender and pulse several times.\n",
        "picture_link": "vqQi20nlmMviGpxANpP8Fv2PX0WB03G"
    },
    {
        "title": "Holly's Chicken Cordon Bleu Casserole",
        "ingredients": [
            "4 cups cornflake crumbs ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "10 cooked skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 cups shredded Swiss cheese ADVERTISEMENT",
            "1 pound cooked ham, diced ADVERTISEMENT",
            "1/2 pound sliced fresh mushrooms ADVERTISEMENT",
            "1 bunch green onions, sliced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons butter, melted (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.\nMix the corn flake crumbs, Parmesan cheese, and 1/4 cup melted butter in a large bowl, then spread about 2/3 of the crumb mixture into the bottom of the prepared baking dish. Layer half the chicken breast strips over the crumb base, and sprinkle with salt and black pepper. Cover with half the Swiss cheese, then a layer of ham, followed by layers of mushrooms and green onions.\nMix the cream of chicken soup and sour cream together in a bowl, and spread the mixture over the green onion layer. Place the rest of the chicken strips onto the soup layer, followed by the rest of the Swiss cheese. Top the casserole with the remaining 1/3 of the crumb mixture. Drizzle with 2 more tablespoons of melted butter if desired.\nCover the casserole with aluminum foil, and bake in the preheated oven for 45 minutes; remove the foil and bake until the casserole is bubbling, the cheese has melted, and the crumb topping is brown, an additional 15 minutes.\n",
        "picture_link": "n6Ig89iSQh61h.mfihFQJppHLhz9V/e"
    },
    {
        "title": "Hearty Ranch and Bacon Potato Soup",
        "ingredients": [
            "6 slices smoked bacon ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "1 (32 ounce) carton low-sodium chicken broth ADVERTISEMENT",
            "10 potatoes, peeled and cubed ADVERTISEMENT",
            "4 teaspoons all-purpose flour ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "2 cups half-and-half cream ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large Dutch oven and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, crumble and reserve for topping.\nCook and stir the onions and celery in the bacon drippings until tender, 5 to 10 minutes. Add chicken broth and potatoes, and bring to a boil over high heat. Reduce heat to medium-low and simmer until potatoes are fork-tender. Remove from heat and mash about 1/3 of the potatoes.\nIn a large bowl, combine flour and dry ranch mix. Whisk in the half-and-half and sour cream, beating well to combine thoroughly. Slowly whisk the sour cream mixture into the soup. Gently heat soup over medium heat to warm, do not boil. Season the soup with salt and pepper. To serve, top each bowl of soup with a sprinkle of bacon crumbles, Cheddar cheese and green onion.\n",
        "picture_link": "k13PCvMGDYBmdifK/6gI3ToX1.T63HS"
    },
    {
        "title": "Honey and Rosemary Sweet Potatoes",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "3 large sweet potatoes, peeled and cut in 1-inch cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with foil or parchment paper.\nMix the olive oil, honey, rosemary, salt, and black pepper together in a large bowl, and stir the sweet potato cubes in the mixture to coat. Remove sweet potato cubes with a slotted spoon, and arrange in a single layer on the prepared baking sheet.\nBake in the preheated oven until tender, about 45 minutes. Turn oven heat up to 450 degrees F (230 degrees C) and bake until browned, another 15 minutes.\n",
        "picture_link": "deWnBDB/Jfp95knkBlqfm/r1Ed8sTWO"
    },
    {
        "title": "Fire-Roasted Tomato and Spinach Pasta",
        "ingredients": [
            "6 ounces linguine pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes, with juice ADVERTISEMENT",
            "1 (9 ounce) box frozen creamed spinach, thawed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nMeanwhile, heat the olive oil in a large saucepan over medium heat. Stir in the garlic, and cook until softened, about 3 minutes. Stir in the fire-roasted tomatoes and bring to a simmer. Cook 1 minute before adding the creamed spinach. Cook and stir 5 minutes; season to taste with salt and pepper. Stir the drained linguine into the tomato sauce before serving.\n",
        "picture_link": "KfmrxKDvqJ3YBJPLTuzMDxcLzHwGkvG"
    },
    {
        "title": "Filet Mignon with Bacon Cream Sauce",
        "ingredients": [
            "4 (4 ounce) filet mignon (beef tenderloin) ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "3 slices bacon, chopped ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 shallots, diced ADVERTISEMENT",
            "1/4 cup half-and-half cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\nBrush the filets with olive oil, and cook on the preheated grill to desired doneness (about 4 minutes per side for medium rare). An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Set the steaks aside on a platter tented with aluminum foil to rest.\nWhile the steaks are resting, prepare the sauce: cook and stir the chopped bacon in a small saucepan over medium heat until the bacon pieces are crisp, 3 to 5 minutes. Stir in the butter and shallots, and cook and stir until the shallots are soft and translucent, about 5 minutes more.\nStir in the half-and-half, bring the mixture to a simmer over medium-low heat, and cook, stirring occasionally, until the sauce is slightly thickened, about 8 minutes. Season to taste with salt and pepper, and serve over the steaks.\n",
        "picture_link": "G7/t72CNqhmxcrVslvS4/pc11V6LonO"
    },
    {
        "title": "Pudding Shots",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1/2 cup Irish cream liqueur (eg. Bailey's®) ADVERTISEMENT",
            "1/2 cup vodka (eg. Smirnoff®) ADVERTISEMENT",
            "1 (4 serving size) package instant chocolate pudding mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the milk, Irish cream liqueur, vodka, and instant pudding mix in a bowl until combined. Continue whisking for 2 minutes.\nSpoon the pudding mixture into shot glasses or disposable 'party shot' cups. Chill until set, about 30 minutes. The shots will have the consistency of mousse.\n",
        "picture_link": "X22iTmbLdcGtDiWcl8dyi2i9MmsS5WW"
    },
    {
        "title": "Pull-Apart Hot Cross Buns",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "4 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1 1/4 cups lukewarm milk ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup golden raisins (optional) ADVERTISEMENT",
            "1/4 cup dried cherries (optional) ADVERTISEMENT",
            "1/4 cup dried cranberries (optional) ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle the yeast over the warm water and let stand until dissolved, about 5 minutes. Place the flour, salt, sugar, cardamom, 1 1/4 cups of milk, butter and egg into the bread machine. Pour the yeast mixture on top. Close the lid and set the machine for the Dough setting. If using raisins, dried cherries or dried cranberries, add them at the beep.\nWhen the dough has finished, divide into 12 portions and shape into balls. Place them into a greased 9x13 inch baking dish. Cover with plastic wrap and set aside to rise until doubled in size, about 45 minutes.\nPreheat the oven to 350 degrees F (175 degrees C). Remove the plastic wrap from the rolls. Bake in the preheated oven until golden brown, 20 to 25 minutes. Make frosting by whisking together the confectioners' sugar, 1/4 cup of milk and almond extract until smooth. When the buns are cool, drizzle frosting over them in a cross shape.\n",
        "picture_link": "rKBAH6GGT76K7nRH8d1aCZyurRAuw/y"
    },
    {
        "title": "Savory Stuffed Chicken Breast with Plum Glaze",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "2 pieces cornbread, crumbled ADVERTISEMENT",
            "2 slices cooked bacon, crumbled ADVERTISEMENT",
            "2 tablespoons minced celery ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/4 cup chicken stock ADVERTISEMENT",
            "1/3 cup chicken stock ADVERTISEMENT",
            "1/3 cup plum jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a skillet over high heat. Using a paring knife, cut a pocket into the side of each breast. Place into skillet and sear until lightly browned on both sides, but not cooked through. Set aside.\nCombine cornbread, bacon, celery, onion, butter, and 1/4 cup chicken stock; mix until well combined. Stuff each breast with cornbread mixture.\nBake in preheated oven for 25 minutes.\nWhile the chicken is baking, bring 1/3 cup chicken stock to a simmer. Whisk in plum jam, and simmer over medium-low heat until most of the chicken stock has evaporated.\nPour plum glaze over chicken breasts, and cook for an additional 10 minutes and the center of the stuffed breast reaches 160 degrees F (70 degrees C).\n",
        "picture_link": "vf/oUlOx2oKqqmnH2O36Aas4740ISM."
    },
    {
        "title": "Oma's Fabulous Matzo Ball Soup",
        "ingredients": [
            "2 (10 ounce) packages matzo crackers ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons minced fresh parsley ADVERTISEMENT",
            "2 onions, minced ADVERTISEMENT",
            "5 ounces matzo meal ADVERTISEMENT",
            "96 ounces chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil.\nBreak matzo crackers into small pieces, and place in a large bowl. Add water to cover; allow to soak for a few minutes, until soft. Drain off excess water.\nMelt butter in a large skillet over medium heat and stir in drained matzos; stir until mixture is dry and slightly brown. Remove from heat, and mix in eggs, salt and pepper to taste, parsley, and onions.\nMix in just enough matzo meal to make mixture hold together. Roll one golf ball-size matzo ball. Place matzo ball in the boiling water to test the mixture. The ball must rise to the top of the water and not break apart. If it does not rise, then too much matzo meal was added. In this case, add another beaten egg to the mixture and try again. When desired consistency is reached, roll all of mixture into golf ball size spheres.\nIn a large saucepan, bring chicken broth to a slow boil over medium heat; add balls to broth. Serve soup as the balls rise to the top of the broth.\n",
        "picture_link": "SRMNLTYr0nb.aRGElZJ21tFh6QXhrA6"
    },
    {
        "title": "Cheese Ball",
        "ingredients": [
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 tablespoon diced onion ADVERTISEMENT",
            "1 tablespoon chopped green bell pepper ADVERTISEMENT",
            "1/4 tablespoon seasoning salt ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the cream cheese, pineapple, onion, bell pepper and seasoning salt.\nForm into a ball and roll in chopped pecans. Chill and serve with butter crackers.\n",
        "picture_link": "a/pw9je5xvjQGnD6yrWU9OuRzyCyi5u"
    },
    {
        "title": "Chickpea Macaroni Salad",
        "ingredients": [
            "1 cup macaroni ADVERTISEMENT",
            "1 (19 ounce) can chickpeas (garbanzo beans), drained ADVERTISEMENT",
            "4 tomatoes, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "6 ounces feta cheese, crumbled ADVERTISEMENT",
            "1 cup pitted black olives ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a medium saucepan of lightly salted water to a boil. Add macaroni, and cook 8 to 10 minutes, or until al dente. Rinse under cold water to chill, and drain.\nMeanwhile, combine the chickpeas, tomatoes, onion, garlic, feta cheese, olives, salt, pepper, olive oil, and lemon juice in a large bowl. Set aside to marinate while the pasta is cooking.\nMix macaroni with chickpea mixture. Cover, and refrigerate for at least 30 minutes to blend flavors.\n",
        "picture_link": "vljqBnYsfjZmdq5ha1fkkVQ7W14koei"
    },
    {
        "title": "Fresh Fig Cake",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1 cup chopped fresh figs ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 cups chopped fresh figs ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray two 8-inch round cake pans with vegetable oil spray.\nIn a medium bowl, sift together flour, salt and baking powder. Set aside.\nIn a large mixing bowl, cream butter with the sugar until fluffy. Add egg and beat well. Add flour mixture alternately with the evaporated milk. Fold in vanilla and almond extracts and chopped figs.\nDivide into two prepared 8 inch round cake pans. Bake at 350 degrees F (175 degrees C) for 30 minutes, or until a toothpick inserted into the center comes out dry.\nTo make the filling: In a saucepan, combine 2 cups figs, brown sugar, water and lemon juice. Bring to a boil. Reduce heat to a simmer and cook until thickened, about 20 minutes. Spread thinly between layers of cake and on top.\n",
        "picture_link": "GOgLLPA/8/RQA4dT9fK9hYBH0gdC0nq"
    },
    {
        "title": "Pumpkin Stew",
        "ingredients": [
            "2 pounds beef stew meat, cut into 1 inch cubes ADVERTISEMENT",
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 large potatoes, peeled and cubed ADVERTISEMENT",
            "4 carrots, sliced ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (14.5 ounce) can whole peeled tomatoes, chopped ADVERTISEMENT",
            "2 tablespoons beef bouillon granules ADVERTISEMENT",
            "1 sugar pumpkin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons oil in a large saucepan over medium-high heat. Place beef in the saucepan and cook until evenly brown. Mix in the water, potatoes, carrots, green bell pepper, garlic, onion, salt and pepper. Bring to a boil. Reduce heat and simmer approximately 2 hours.\nDissolve the bouillon into the beef mixture. Stir in the tomatoes.\nPreheat oven to 325 degrees F (165 degrees C).\nCut top off the pumpkin and remove seeds and pulp. Place the pumpkin in a heavy baking pan. Fill the pumpkin with the beef mixture. Brush outside of the pumpkin with remaining oil.\nBake in the preheated oven 2 hours, or until tender. Serve the stew from the pumpkin, scraping out some of the pumpkin meat with each serving.\n",
        "picture_link": "/fC5Yn6PoAFbSTCvZZAkChh3WuSOeze"
    },
    {
        "title": "Flaky Crescent Mushroom Turnovers",
        "ingredients": [
            "1/4 pound fresh mushrooms, coarsely chopped ADVERTISEMENT",
            "2 tablespoons minced fresh parsley ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "3 tablespoons butter, divided ADVERTISEMENT",
            "1 (8 ounce) can refrigerated crescent roll dough ADVERTISEMENT",
            "2 1/2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium saucepan over medium heat, slowly cook and stir the mushrooms, parsley and onion in 2 tablespoons butter until tender. Drain and set aside.\nSeparate the dough into 4 rectangles. Cut rectangles in half, forming 8 squares, and arrange on a large baking sheet. Place 1 tablespoon mushroom mixture on each square. Top each square with 1 teaspoon Parmesan cheese. Fold the squares into triangles.\nIn a small saucepan, melt remaining butter. Brush triangles with butter and sprinkle with sesame seeds.\nBake in the preheated oven 10 to 15 minutes, until golden brown. Serve warm.\n",
        "picture_link": "9lU8XVnLQ.0Qe2gsyLFopsSt2I0E.gS"
    },
    {
        "title": "Eve's Chicken Quarters",
        "ingredients": [
            "4 chicken leg quarters ADVERTISEMENT",
            "1 (4.5 ounce) package instant long grain and wild rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 cup chopped broccoli ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken quarters in a 9x13 inch baking dish and bake in preheated oven, covered, for 45 minutes.\nMeanwhile, in a large bowl combine rice and seasoning packages, water, soup, sour cream, crushed garlic, minced garlic and broccoli. Mix well.\nRemove chicken to a platter and drain oil. Spread rice mixture in the bottom of the baking dish, then arrange chicken on top of rice. Bake uncovered for 30 to 45 minutes, or until wild rice is opened up and liquid is absorbed.\n",
        "picture_link": "boXWoz0rr15IC6relKTN61Tthhy.tP."
    },
    {
        "title": "Five Flavor Pound Cake II",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 teaspoons coconut extract ADVERTISEMENT",
            "2 teaspoons rum flavored extract ADVERTISEMENT",
            "2 teaspoons butter flavored extract ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a tube pan.\nSift the flour with the baking powder and salt.\nCream butter or margarine, oil, and sugar until fluffy. Add eggs one at a time, beating well after each addition. Mix in flour mixture alternately with milk, beginning and ending with flour. Mix well. Stir in 1 teaspoon each coconut flavoring, butter flavoring, rum extract, lemon extract, and vanilla extract. Pour batter into prepared pan.\nBake for 1 1/2 hours or until cake tests done.\nIn a small saucepan, combine water, sugar, and 1 teaspoon each coconut flavoring, butter flavoring, rum extract, vanilla extract, and almond extract. Boil until the sugar has dissolved completely. Spoon over hot cake. Cool cake.\n",
        "picture_link": "uhOjJWV5ksFaIDNTe9MkeBsjIDexG1q"
    },
    {
        "title": "Kolaches From the Bread Machine",
        "ingredients": [
            "1 1/4 cups warm water ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1/3 cup milk powder ADVERTISEMENT",
            "1/4 cup instant mashed potato flakes ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 7/8 cups bread flour ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "1 (12 ounce) can cherry pie filling ADVERTISEMENT",
            "1 (12 ounce) can poppyseed filling ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, softened butter, egg, egg yolk, milk powder, potato flakes, sugar, salt, flour and yeast in the pan of the bread machine in the order recommended by the manufacturer. Select Dough cycle; press Start. Check dough after 5 minutes of mixing, adding 1 to 2 tablespoons of water if necessary.\nWhen the cycle is complete, spoon out dough with tablespoon and roll into walnut sized balls. Place 2 inches apart on a lightly greased cookie sheet. Cover and let rise until doubled, about 1 hour.\nFlatten balls slightly with the palm of your and make a depression in center with your thumb. Fill with 1 tablespoon of filling. Cover and let rise for about 30 minutes. Meanwhile, preheat oven to 375 degrees F (190 degrees C).\nBake in preheated oven for 13 to 15 minutes, until lightly browned. Remove from oven and brush with melted butter. Cool on wire rack.\n",
        "picture_link": "0meszLZ94fSA7ud2ZD1GLvZ4q8lOazq"
    },
    {
        "title": "Sunshine S'more Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) package French vanilla cake mix ADVERTISEMENT",
            "2 tablespoons graham cracker crumbs ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "24 milk chocolate candy kisses ADVERTISEMENT",
            "1/2 cup graham cracker crumbs ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 24 muffin cups with paper liners.\nIn a large bowl, combine the cake mix, 2 tablespoons graham cracker crumbs, water and egg whites. Beat for 2 minutes at high speed of an electric mixer.\nDivide batter evenly among paper lined cups, filling about 2/3 full. Place a chocolate kiss in each cupcake, pressing in lightly. Spoon 1 teaspoon graham cracker crumbs onto each cupcake.\nBake at 350 degrees F (175 degrees C) for 18 to 25 minutes. Remove from the oven and top each cupcake with 1 teaspoon marshmallow creme. Dip spoon into hot water to prevent sticking. Return to oven for about 1 minute to melt slightly.\n",
        "picture_link": "71zUwXjYt.Su40UXRh1J18xslTK49Gi"
    },
    {
        "title": "Oh So Tender Brisket",
        "ingredients": [
            "3 pounds beef brisket ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1 3/4 fluid ounces liquid smoke flavoring ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C).\nCoat the inside of an oven roasting bag with flour. Place brisket inside of bag. Pour liquid smoke over the brisket and sprinkle on garlic powder, dry onion soup mix, and ground black pepper. Seal bag. Using a fork, make two sets of holes in the top of the roasting bag.\nLay bag in a broiling pan. Bake in a preheated oven for 6 to 8 hours.\n",
        "picture_link": "CLe6yIsmdleDa1DM8BDCqt/VlXDMyxe"
    },
    {
        "title": "Neapolitan Bundt Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon strawberry extract ADVERTISEMENT",
            "1/4 cup chocolate syrup ADVERTISEMENT",
            "3 drops red food coloring ADVERTISEMENT",
            "2/3 cup confectioners' sugar ADVERTISEMENT",
            "3 tablespoons chocolate syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease and flour a 12-cup bundt pan. Preheat oven to 350 degrees F (175 degrees C).\nBlend the cake mix, water, oil, and eggs on low speed until moistened. Beat 3 minutes on medium speed. Pour 1/2 of the batter into the bundt pan.\nMeasure 1/2 of the remaining batter into a small bowl and stir in the strawberry extract and food color (as much as you want to make a pretty, dark pink color). Carefully pour this into the pan.\nStir 1/4 cup chocolate syrup into the remaining batter and carefully pour this into the pan on top of the strawberry batter.\nBake for about 40 minutes in a 350 degree F (175 degrees C) oven. Cool 15 minutes.\nRemove from pan and drizzle chocolate glaze over the top.\nTo make chocolate glaze: Mix together confectioners' sugar and 3 tablespoons chocolate syrup until smooth. If necessary, a few drops of water or a small amount of additional confectioners' sugar may be added until the desired consistency is obtained. Drizzle over top of the bundt cake.\n",
        "picture_link": "a0Xo/.rYv9c9pfuZprDDOrXxshUG5ve"
    },
    {
        "title": "Irish Cream Liqueur II",
        "ingredients": [
            "1 (750 milliliter) bottle Irish whiskey ADVERTISEMENT",
            "8 3/4 ounces milk chocolate ADVERTISEMENT",
            "2 (14 ounce) cans sweetened condensed milk ADVERTISEMENT",
            "2 (12 fluid ounce) cans evaporated milk ADVERTISEMENT",
            "2 1/2 cups heavy cream ADVERTISEMENT",
            "1/4 teaspoon instant coffee granules ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour a small amount of whiskey into a large bowl. In the top of a double boiler, melt chocolate, stirring constantly until smooth. Mix the melted chocolate with the whiskey in the bowl. Gradually stir in the sweetened condensed milk and the evaporated milk. Stir in the cream, instant coffee granules, and the remaining whiskey.\nPour mixture into 3 (750 ml) bottles, seal and store in refrigerator. Best if kept at least 1 month before using. To serve: shake bottle well, serve in small glasses over crushed ice.\n",
        "picture_link": "0S7n5pKJTCuIBdUyMKrKKLUgR..G1NS"
    },
    {
        "title": "Herman Pancakes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup Herman Sourdough Starter ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together flour, baking soda, salt, sugar and baking powder. Add the sourdough starter, oil, eggs and milk; beat well.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.\n",
        "picture_link": "NT6.n4ZE7dVV5WOYqaKzq1vdykRfv5C"
    },
    {
        "title": "Slow Cooker Spaghetti Chicken",
        "ingredients": [
            "1 (16 ounce) package spaghetti, cooked and drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "8 ounces processed cheese food ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - boiled and cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain and set aside.\nPut chicken soup, mushroom soup, tomatoes with green chile peppers and cheese in slow cooker over medium heat. Stir together and cook until cheese has melted.\nStir cooked chicken and spaghetti into cheese mixture and heat through. Reduce heat to medium low and cook for about 40 minutes.\n",
        "picture_link": "pOZRNCMwYa0QtjQxCZhxq8l9P2gTx9O"
    },
    {
        "title": "Hawaiian Bread II",
        "ingredients": [
            "2 (.25 ounce) envelopes active dry yeast ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup pineapple juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in 1/2 cup warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, beat together the yeast mixture, eggs, pineapple juice, 1/2 cup water, sugar, ginger, vanilla, and melted butter. Gradually stir in flour until a stiff batter is formed. Cover with a damp cloth and let rise in a warm place for 1 hour.\nDeflate the dough and turn it out onto a well floured surface. Divide the dough into three equal pieces and form into round loaves. Place the loaves into three lightly greased round cake pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven for 25 to 30 minutes, or until bottom of a loaf sounds hollow when tapped.\n",
        "picture_link": "t.6r8rqrivqC3E1iqk7AKRnoE4U1sf."
    },
    {
        "title": "Roasted Vegetable Chicken",
        "ingredients": [
            "1 (4 pound) whole chicken ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 whole onions ADVERTISEMENT",
            "4 carrots, cut into 2 inch pieces ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "6 potatoes, peeled ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nSeason chicken with salt and pepper to taste; place in a large roasting pan. Arrange vegetables around chicken, add water to the bottom of the pan, and cover pan tightly with aluminum foil.\nRoast at in preheated oven, basting occasionally, for 2 hours, removing the foil for the last half hour or so of cooking. Roast until chicken is golden brown and a thermometer inserted into the thigh reaches 165 degrees F (74 C). Let chicken rest 10 minutes before carving.\n",
        "picture_link": "Y43d/JRPIUHQJ9oq9YcI1q1E/Qys45O"
    },
    {
        "title": "Coconut Sour Cream Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1 (16 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease and flour two 9 inch pans. Prepare cake mix as directed by manufacturer, adding almond extract. Bake according to instructions on package. When cake is cool, remove from pans and cut in half, horizontally.\nTo make the filling, mix together the sour cream and sugar in a medium sized bowl. stir in 1 1/2 cups of the coconut. reserve 1 cup of this mixture and spread the rest between the cooled cake layers. Fold whipped topping into the remaining filling, frost the outside of the cake. Sprinkle the remaining coconut over the top of the frosted cake.\nRefrigerate from 1 to 3 days before serving.\n",
        "picture_link": "fjzMGNfR3lBeijCn98DKs12ASqiMPsS"
    },
    {
        "title": "Easy Gravy",
        "ingredients": [
            "2 tablespoons fat drippings (from any type of roasted meat) ADVERTISEMENT",
            "2 cups broth OR bouillon ADVERTISEMENT",
            "2 tablespoons Argo® Corn Starch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook fat drippings and broth in a roasting pan or saucepan over medium heat, until hot.\nStir corn starch and water in a small bowl until smooth; add to pan. If desired, add a dash of poultry seasoning for chicken and turkey gravies, a sprinkle of thyme for beef or a pinch of rosemary for pork. Stirring constantly with a wire whisk, bring to a boil over medium heat and boil 1 minute. Season with salt and pepper.\n",
        "picture_link": "6jwwbBAkESLKhhjU2vPkNsmO7wmg0uS"
    },
    {
        "title": "Grilled Salmon Fillets with a Lemon, Tarragon, and Garlic Sauce",
        "ingredients": [
            "4 (4 ounce) fillets salmon ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon finely grated lemon zest ADVERTISEMENT",
            "2 tablespoons chopped fresh tarragon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare a grill for high heat.\nSeason the salmon fillets with salt and pepper and drizzle with olive oil.\nWhisk together the mayonnaise, mustard, olive oil, garlic, lemon juice, tarragon, salt and pepper; set aside.\nLightly oil the grill grate. Cook the salmon on the grill until the fish flakes easily with a fork, 5 to 10 minutes. Place on a serving plate and top with the prepared sauce.\n",
        "picture_link": "NA/SCZmKAg56boXtHpfbbmf8HvhWXqO"
    },
    {
        "title": "Kris' Lentil Sausage Soup",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 carrots, sliced ADVERTISEMENT",
            "2 stalks celery with leaves, chopped ADVERTISEMENT",
            "1 pound kielbasa sausage, sliced ADVERTISEMENT",
            "2 quarts chicken broth ADVERTISEMENT",
            "1 (15 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 pound dry lentils, rinsed ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large stockpot over medium heat. Stir in the onion, carrots, and celery; cook and stir for 2 minutes. Add kielbasa, chicken broth, tomatoes, garlic, lentils, and bay leaves and bring to a boil. Reduce heat and simmer for 2 hours. Season to taste with salt and pepper.\n",
        "picture_link": "kE9Onfp6ZfHVFVF4.YlcU5CZwpeTjXK"
    },
    {
        "title": "Sweetened Spaghetti Squash",
        "ingredients": [
            "1 spaghetti squash, halved lengthwise and seeded ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "2 tablespoons cold butter ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Line a large baking dish with aluminum foil.\nGenerously spread the softened butter over the flesh of the squash; lie in the prepared baking dish with the cut sides facing down.\nBake in the preheated oven for 30 minutes. Flip the squash and put about half the butter and about half the brown sugar in each of the cavities of the squash halves. Return to the oven until the outer shell is soft, about 10 minutes more. Spoon the flesh of the squash into a bowl to serve.\n",
        "picture_link": "FFI8ty0TP3x9w7YBNPNBkGRkU/9sAx."
    },
    {
        "title": "Rum-Spiked Horchata",
        "ingredients": [
            "1 cup uncooked long grain rice ADVERTISEMENT",
            "2 quarts warm water ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup rum, or to taste (optional) ADVERTISEMENT",
            "16 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the rice and warm water together in a bowl, and let stand for 1/2 hour. Reserving the water, drain, and place the rice in the bowl of a food processor. Add the cinnamon and process until a paste forms. Return the rice to the water and let stand at least 2 hours, stirring occasionally as the water turns milky white.\nStrain the rice through a fine sieve into a bowl or pitcher. Stir in the milk, condensed milk, vanilla, and rum, if desired, until evenly blended. Refrigerate at least 2 hours.\nTo serve, divide the ice cubes between four glasses, and pour the chilled horchata over the ice.\n",
        "picture_link": "qp6nYFnbWSgraOOanUoWM/ZIAunVkWK"
    },
    {
        "title": "Hot Pepper Mustard",
        "ingredients": [
            "40 banana peppers (5 inches long), stems removed ADVERTISEMENT",
            "4 cups prepared yellow mustard ADVERTISEMENT",
            "5 cups white sugar ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "4 cups apple cider vinegar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the seeds from the banana peppers and place the peppers into a blender or food processor. Process until smooth. Pour into a large pot and stir in the mustard, sugar, honey, apple cider vinegar and salt. Bring to a boil, so that it is boiling so hard it cannot be stirred down.\nStir together the flour and water until smooth. Pour into the boiling mixture. Continue to boil, stirring constantly, for 5 minutes. Pour into sterile pint jars and seal with new lids and rings. Process in a boiling water bath for 5 to 10 minutes, depending on your altitude.\n",
        "picture_link": "mKQhCTLdYgCq5lYSY6s1LF7bhWO9C4O"
    },
    {
        "title": "Italian Meatloaf in Zucchini Boats",
        "ingredients": [
            "1 large zucchini, cut in half lengthwise ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 1/2 pounds ground beef sirloin ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups Italian seasoned bread crumbs ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1/4 cup grated carrot ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (26.5 ounce) can spaghetti sauce, divided ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nScoop out and discard zucchini seeds, leaving the hollowed-out shells. Sprinkle the garlic salt into the hollowed-out zucchini, and set aside. Heat olive oil in a skillet over medium heat, and cook the onion and garlic until the onion is translucent, about 5 minutes. Remove from heat and allow to cool.\nIn a mixing bowl, mix the ground beef, eggs, bread crumbs, basil, carrot, and Parmesan cheese together with the onion mixture. Stuff the zucchini halves with the meat mixture, and place them into a baking dish. Spoon about half the spaghetti sauce over the zucchini, covering all the meat and allowing sauce to drip down the sides of the zucchini boats.\nBake in the preheated oven until the meat is no longer pink in the center and the zucchini are tender, about 45 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Sprinkle the mozzarella cheese over the zucchini, and return to oven until the cheese melts, about 5 more minutes. Heat the remaining spaghetti sauce in a small saucepan over medium heat while the zucchini boats are cooking. Serve the zucchini boats with the additional sauce on the side.\n",
        "picture_link": "wbV79ZtlKnvmAaF1rdIP7pO2lW7/enC"
    },
    {
        "title": "Fat Pete's Fudge",
        "ingredients": [
            "2/3 cup butter ADVERTISEMENT",
            "4 1/2 cups white sugar ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "2 (7 ounce) jars marshmallow creme ADVERTISEMENT",
            "16 ounces chocolate candy (such as Hershey's®) ADVERTISEMENT",
            "2 1/2 cups milk chocolate chips ADVERTISEMENT",
            "2 cups peanut butter (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13-inch baking pan. Set aside.\nBring butter, sugar, and evaporated milk to a boil in a saucepan over medium heat. Boil for 5 to 7 minutes, then remove from heat and quickly stir in the marshmallow cream, chocolate candy, and chocolate chips, until the chocolate has melted and is fully incorporated. Pour chocolate mixture into the prepared baking pan. Dot the top of the fudge with peanut butter. Swirl a knife through the fudge and peanut butter to create a marble effect. Cover and refrigerate until firm, about 1 hour. Cut into squares for serving.\n",
        "picture_link": "O1e7XQz58kJTQlKKKdbDWgttFgDesQO"
    },
    {
        "title": "Creamy Penne Pasta",
        "ingredients": [
            "1 (16 ounce) package penne pasta ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1/4 cup chopped fresh oregano ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large saucepan over medium heat, heat olive oil. Stir in garlic, basil, oregano, parsley, tomato, salt and pepper, and cook 5 minutes. Stir in cream cheese until melted. (Add meat, if desired, at this time.) Heat through, toss with cooked pasta and serve.\n",
        "picture_link": "HNw0pPX7XRAFcIbumI.0HPx5Joo5aaq"
    },
    {
        "title": "Cindy's Beef Tips",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "1/4 cup canola oil, divided ADVERTISEMENT",
            "1 large onion, coarsely chopped ADVERTISEMENT",
            "3 cups beef broth ADVERTISEMENT",
            "1 (10.75 ounce) can fat free condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can skim milk ADVERTISEMENT",
            "1 (8 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "2 tablespoons cornstarch (optional) ADVERTISEMENT",
            "1 tablespoon water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable plastic zipper bag, place flour, seasoned salt, black pepper, garlic powder, and onion powder. Stir the flour and seasonings together, and add the beef stew meat. Seal the bag and shake several times to coat the beef cubes with seasoned flour. Brush off excess flour.\nHeat half of the canola oil in a large skillet over medium-high heat. Fry half of the beef cubes, turning them over until all sides are nicely browned, 5 to 10 minutes. Remove the browned beef to a plate, and repeat with the rest of the canola oil and beef cubes. Transfer to plate, and cook and stir the onion in the hot skillet until translucent, about 5 minutes.\nWhisk together beef broth, mushroom soup, and skim milk until smooth. Return the beef cubes to the skillet together with any juices on the plate, add the mushrooms, and pour the broth mixture over the beef and mushrooms. Turn heat to low, and simmer until the meat is very tender, about 3 hours. For a thicker gravy, mix cornstarch and water to make a smooth paste, and stir into the gravy. Simmer about 2 minutes to thicken.\n",
        "picture_link": "73Dta/MHWdi0lytjtdabDZhLwTm3Ydm"
    },
    {
        "title": "K-Dub's Alfredo Ravioli Bake",
        "ingredients": [
            "1 (25 ounce) package frozen cheese ravioli ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 skinless, boneless chicken breasts, cut into 1-inch pieces ADVERTISEMENT",
            "2 tablespoons Italian seasoning ADVERTISEMENT",
            "1 (16 ounce) jar prepared Alfredo sauce ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a rolling boil; boil the ravioli until it floats and the filling is hot, 6 to 8 minutes; drain.\nMelt the butter in a skillet over medium heat. Add the chicken to the skillet, season with the Italian seasoning, and cook and stir until the chicken is no longer pink in the middle, about 15 minutes.\nSpread about 1/2 cup of Alfredo sauce into the bottom of the prepared baking dish. Arrange enough ravioli over the sauce to cover the bottom of the dish completely. Top the ravioli with about half the cooked chicken. Sprinkle 1 cup of the mozzarella cheese over the chicken; season with salt and pepper. Repeat the layers until all ingredients are used.\nBake in the preheated oven until heated through completely and the mozzarella cheese is melted, about 25 minutes. Sprinkle the Parmesan evenly over the top of the dish; return to oven to cook another 5 minutes before serving.\n",
        "picture_link": "JPwb6m2.uG.xMEQGjMIulDa7Mg.hOnu"
    },
    {
        "title": "Garlic Spread",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium mixing bowl combine cream cheese and butter, mixing until well blended. Add parsley, onion and garlic and mix well.\nRefrigerate for 1 to 3 hours. The mixture becomes more flavorful the longer it chills.\n",
        "picture_link": "JbGi5yqbAJePOaagtlh5aRgbWaqxNSa"
    },
    {
        "title": "Slow Cooker Blackberry Pork Tenderloin",
        "ingredients": [
            "1 (2 pound) pork tenderloin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon dried rubbed sage ADVERTISEMENT",
            "1 tablespoon crushed dried rosemary, or to taste ADVERTISEMENT",
            "1 (16 ounce) jar seedless blackberry jam ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons dry red wine (such as Cabernet Sauvignon, Merlot, or a blend) ADVERTISEMENT",
            "1/2 cup dry red wine (such as Cabernet Sauvignon, Merlot, or a blend) ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 cup fresh blackberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the pork tenderloin on all sides with salt, pepper, sage, and rosemary. Place the tenderloin into a slow cooker, and spoon the blackberry jam, 1/4 cup honey, and 2 tablespoons of red wine over the pork. Set the cooker to Low, and cook until very tender, 4 to 5 hours.\nAbout 15 minutes before serving time, pour 1/2 cup red wine, 2 tablespoons of honey, and the fresh blackberries into a saucepan. Bring to a boil over medium-low heat, and simmer until the sauce thickens slightly and some of the berries burst, about 15 minutes.\nTo serve, slice the tenderloin and spoon blackberry-wine sauce over slices.\n",
        "picture_link": "4j8yNsSm34GyxVjpWH4pF8jd6iBL9uu"
    },
    {
        "title": "Bifana",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1/3 cup cider vinegar ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon dried red chile pepper ADVERTISEMENT",
            "4 cups diced rhubarb ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "1/3 cup golden raisins ADVERTISEMENT",
            "1 1/2 pounds pork tenderloin ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 sprigs fresh cilantro, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the chutney: Combine sugar, vinegar, ginger, garlic, cumin, cinnamon, cloves and red pepper in a large saucepan. Bring to simmer over low heat, stirring occasionally, until sugar dissolves. Add rhubarb, onion and raisins. Increase heat to medium-high and cook until rhubarb is tender and mixture thickens slightly. Remove from heat and let cool completely.\nPreheat oven to 400 degrees F (200 degrees C).\nTo cook pork: Sprinkle pork with cumin, salt and pepper. Heat oil in large, heavy skillet over high heat. Add pork and brown on all sides, about 5 minutes.\nTransfer pork to roasting pan. Brush with 6 tablespoons of the chutney. Place in preheated oven, brushing occasionally with 6 more tablespoons chutney. Cook until thermometer inserted into center registers 145 degrees (63 degrees C), about 25 minutes. Slice pork into medallions. Garnish with cilantro sprigs and serve with remaining chutney.\n",
        "picture_link": "gWg.p1u/6r6yBT/FLbXnH2WsejlOVzS"
    },
    {
        "title": "Crab and Pea Salad",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "1 (10 ounce) package frozen green peas, thawed ADVERTISEMENT",
            "1 pound imitation crab meat, flaked ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nIn a medium bowl, combine peas, imitation crab, bacon, mayonnaise, and onion powder. Mix thoroughly. Cover and refrigerate until serving.\n",
        "picture_link": "ROk7HYQHxEutkcd0F2EH0XOItOCMtZa"
    },
    {
        "title": "Slow Cooker Cheesy Chicken and Tortillas",
        "ingredients": [
            "1 1/4 pounds skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 3/4 cups Swanson® Natural Goodness Chicken Broth ADVERTISEMENT",
            "2 (10.5 ounce) cans Campbell's® Condensed Cream of Chicken Soup or Campbell's® Condensed 98% Fat Free Cream of Chicken Soup ADVERTISEMENT",
            "8 (6 inch) flour tortillas, cut into 1-inch pieces ADVERTISEMENT",
            "2 cups shredded Mexican cheese blend ADVERTISEMENT",
            "6 cups hot cooked long-grain white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken into a 4-quart slow cooker. Sprinkle with the chili powder and cumin. Pour in the broth.\nCover and cook on LOW for 8 to 9 hours* or until the chicken is cooked through. Remove the chicken to a cutting board. Using 2 forks, shred the chicken.\nReserve 1 cup liquid in cooker, adding additional broth, if needed, to make 1 cup. Stir the soup into the cooker. Stir in chicken.\nHeat the oven to 350 degrees F. Layer half the chicken mixture, tortillas and cheese in a 13x9x2-inch baking dish. Repeat the layers.\nBake for 30 minutes or until the mixture is hot and bubbling. Serve over the rice.\n",
        "picture_link": "wK8A3GfuM4CRuwXemt1zfU.mQKp.0d."
    },
    {
        "title": "One Pot Pinto Beans",
        "ingredients": [
            "6 1/4 cups water ADVERTISEMENT",
            "1 cup condensed chicken broth ADVERTISEMENT",
            "2 pounds dried pinto beans ADVERTISEMENT",
            "5 cloves cloves garlic, chopped ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "1 tablespoon red pepper flakes, or to taste ADVERTISEMENT",
            "salt, or to taste ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese (optional) ADVERTISEMENT",
            "1 (16 ounce) container pico de gallo (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, condensed chicken broth, beans, garlic, onion, and crushed red pepper flakes into a large saucepan; season to taste with salt and pepper. Bring to a simmer; cover. Cook, stirring occasionally, until beans are soft, about 3 1/2 hours. You may need to add additional water to keep the beans from drying out.\nMash cooked beans with a potato masher to desired consistency. Stir in mozzarella and pico de gallo before serving.\n",
        "picture_link": "t6qQ.3XwRJ9GpA/4LQFrbbdAPukZHpi"
    },
    {
        "title": "Love Mussels",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons minced shallots ADVERTISEMENT",
            "1 tablespoon capers ADVERTISEMENT",
            "3 cups canned tomato sauce ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 pound mussels, cleaned and debearded ADVERTISEMENT",
            "1 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat. Swirl olive oil into melted butter. Cook garlic, shallots, and capers in oil and butter until shallots are translucent, about 5 minutes. Mix in tomato sauce, Italian seasoning, and red pepper flakes; stir until well incorporated. Cover and reduce heat to medium-low; allow to simmer for 10 minutes.\nAdd mussels to the pan and cover tightly. Raise heat to medium-high and cook until all mussels have opened, about 10 minutes. Remove from heat, garnish with chopped green onions to serve. Discard any unopened mussels.\n",
        "picture_link": "z733Fl..9lbzEYyPSlk09rSHMVPxxeq"
    },
    {
        "title": "Banana Pound Cake With Caramel Glaze",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "2 cups brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 ripe bananas, mashed ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C). Combine flour, baking powder, baking soda, and salt in a bowl. Set aside. Grease and flour a fluted tube pan.\nBeat 1 cup of butter, shortening, 2 cups of brown sugar, and 1 cup of white sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the bananas, followed by the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in 2 teaspoons of vanilla extract with the last egg. Pour in the flour mixture alternately with the milk, mixing until just incorporated. Fold in the pecans; mixing just enough to evenly combine. Pour the batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour and 20 minutes.\nMeanwhile, prepare the glaze. Heat 1/2 cup of butter, 1/4 cup of brown sugar, 1/4 cup of white sugar, 1 teaspoon of vanilla extract, and heavy cream in a saucepan over medium heat. Stir continuously until the sugars have dissolved, then gently simmer for 1 minute. Pour over baked cake while still in the pan. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "g6JkbI1tSckdXD5rOFESXY.xDBADKa6"
    },
    {
        "title": "My Chicken Pho Recipe",
        "ingredients": [
            "4 ounces dry Chinese egg noodles ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon minced lemon grass ADVERTISEMENT",
            "5 green onions, chopped ADVERTISEMENT",
            "2 cups cubed cooked chicken ADVERTISEMENT",
            "1 cup bean sprouts ADVERTISEMENT",
            "1 cup chopped bok choy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large saucepan of water to a boil over high heat. Add noodles and return water to boil. Boil until soft, about 8 minutes. Drain and reserve noodles.\nBring chicken stock, fish sauce, garlic, ginger, lemon grass, and green onions to a boil in a large pot. Reduce to a simmer; cook for 10 minutes. Stir in the chicken, bean sprouts, and bok choy. Cook pho until heated through, about 5 minutes.\nDivide the cooked noodles between 2 large bowls. Pour pho over noodles; serve immediately.\n",
        "picture_link": "Ev31W34sEwYve2TCeF8QlusMpJpgZBm"
    },
    {
        "title": "Banana Prune Muffins",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup mashed banana ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup chopped pitted prunes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a muffin pan, or use paper liners.\nIn a large bowl, combine sugar, oil and eggs. Beat until smooth. Blend in banana and vanilla. Mix together flour, baking powder, baking soda, salt and cinnamon, then stir into egg mixture until just moistened. Mix in the prunes. Spoon into muffin cups.\nBake in the preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of a muffin comes out clean.\n",
        "picture_link": "9bIpeABrvNlv3zGZ3Ol7rEK.sRQZnHK"
    },
    {
        "title": "Pizza Sauce and Dough",
        "ingredients": [
            "PIZZA DOUGH: ADVERTISEMENT",
            "1/4 cup warm water (100 to 110 degrees) ADVERTISEMENT",
            "1 teaspoon active dry yeast ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "4 cups bread flour ADVERTISEMENT",
            "2 tablespoons Italian-style seasoning ADVERTISEMENT",
            "1 teaspoon salt, divided ADVERTISEMENT",
            "1 1/4 cups flat beer ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "PIZZA SAUCE: ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "1 (28 ounce) can roma tomatoes, with juice ADVERTISEMENT",
            "2 (6 ounce) cans tomato paste ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon chopped fresh oregano ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.\nIn a food processor, combine flour, Italian seasoning and salt. Pulse until mixed. Add yeast mixture, flat beer and oil. Pulse until a ball is formed. Scrape dough out onto a lightly floured surface, and knead for several minutes until dough is smooth and elastic. Allow dough to rest for 2 to 3 minutes. Divide dough in half, and shape into balls. Place dough balls in separate bowls, and cover with plastic wrap. Allow to rise at room temperature for about 1 hour, then store in the refrigerate overnight.\nTo make the sauce: Heat olive oil in a saucepan over medium heat. Saute onions until tender. Stir in garlic, and cook for 1 minute. Crush tomatoes into saucepan. Add tomato paste, basil, parsley and oregano. Simmer for 10 minutes.\n",
        "picture_link": "AqwP/MR7dUZQfoNu2p4RLfyjSgO/60a"
    },
    {
        "title": "Kevin's Teriyaki Chicken",
        "ingredients": [
            "1 1/2 cups pineapple juice ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon white pepper ADVERTISEMENT",
            "4 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the pineapple juice, soy sauce, ginger, garlic powder, and white pepper. Reserve a small amount of the marinade separately for dipping later.\nPlace chicken in marinade, and add enough water to cover. Cover, and refrigerate for 24 hours.\nHeat an outdoor grill for medium-high heat.\nBrush grate lightly with oil. Grill chicken 5 to 7 minutes per side, depending on thickness. Chicken is done when inside is no longer pink and juices run clear.\n",
        "picture_link": "Dns2Oqes8s1qq4wWCuOSnECEa.YtxoS"
    },
    {
        "title": "Calabacitas",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 small zucchini, diced ADVERTISEMENT",
            "1 fresh poblano chile pepper, seeded and chopped ADVERTISEMENT",
            "1 cup frozen whole kernel corn ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Add onion and garlic, and cook, stirring until translucent. Add zucchini and poblano pepper, and saute until soft. Stir in corn and beans, and heat through. Season with salt to taste.\n",
        "picture_link": "63EICdiu.JbRZxSTNPvndkM8s.31u8u"
    },
    {
        "title": "Five Layer Ice Cream Bars",
        "ingredients": [
            "1 1/2 cups evaporated milk ADVERTISEMENT",
            "2/3 cup chocolate chips ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pound chocolate sandwich cookies, crushed ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1/2 gallon vanilla ice cream, softened ADVERTISEMENT",
            "1 1/2 cups roasted Spanish peanuts ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, combine evaporated milk, 1/2 cup butter, chocolate chips, and confectioners' sugar. Bring to a boil, and cook 8 minutes, stirring constantly. Remove from heat, and stir in vanilla extract. Allow to cool thoroughly.\nIn a large bowl, mix together crushed chocolate sandwich cookies and 1/2 cup melted butter. Press onto the bottom of a 9x13 inch pan; freeze until firm. Spread softened ice cream over crust, then freeze until firm. Spread top with cooled fudge sauce, and sprinkle with peanuts; freeze until firm. Spread with whipped topping, and freeze until firm, or overnight.\n",
        "picture_link": "Kv9xISpo6lxKZyLWRF2L/kyqLHFec9i"
    },
    {
        "title": "Chicken and Chinese Vegetable Stir-Fry",
        "ingredients": [
            "14 ounces skinless, boneless chicken breast meat - cut into bite-size pieces ADVERTISEMENT",
            "1/2 cup oyster sauce ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 (8 ounce) can sliced water chestnuts, drained ADVERTISEMENT",
            "1 cup snow peas ADVERTISEMENT",
            "1 small head broccoli, cut into florets ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the chicken, oyster sauce, and soy sauce in a mixing bowl until the chicken is evenly coated with the sauce; set aside.\nHeat the vegetable oil in a wok or large skillet over high heat. Stir in the garlic and onion; cook and stir until the onion is limp, about 1 minute. Add the chicken and marinade. Cook and stir until the chicken has browned and is no longer pink, about 10 minutes.\nPour in 1/2 cup of water; season with pepper and sugar. Add the water chestnuts, snow peas, and broccoli. Cover; boil until the vegetables are just tender, about 5 minutes. Dissolve the cornstarch in 1/4 cup of water. Stir into the boiling mixture; cook until thick and no longer cloudy.\n",
        "picture_link": "AyOjLkbgPxO7dD.aHALeb4Mt.K3xI6q"
    },
    {
        "title": "Spicy Indian Chicken Curry Yummy",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "4 boneless, skinless chicken thighs, cut into bite-size pieces ADVERTISEMENT",
            "1 large white onion, finely chopped ADVERTISEMENT",
            "2 tablespoons ginger garlic paste ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1/2 (2 inch) stick cinnamon stick, broken into pieces ADVERTISEMENT",
            "8 pods whole green cardamom pods ADVERTISEMENT",
            "4 bay leaves ADVERTISEMENT",
            "6 whole cloves ADVERTISEMENT",
            "1 tablespoon red pepper flakes, or to taste ADVERTISEMENT",
            "15 whole black peppercorns ADVERTISEMENT",
            "2 teaspoons coriander seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a small pot over medium heat. Add chicken, onion, and ginger garlic paste. Season with curry powder, cinnamon stick, cardamom pods, bay leaves, cloves, red pepper flakes, black peppercorns, and coriander seeds. Cover, and simmer for about 30 minutes, stirring occasionally. At this point, gravy will be runny; if you want to thicken, remove lid, and cook until liquid is reduced.\n",
        "picture_link": "npsHkt5Rg2AJtCCXT.E1.eEF2R3S.1C"
    },
    {
        "title": "Greasy Chicken",
        "ingredients": [
            "6 chicken thighs ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 lemons ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "5 cloves garlic, peeled and chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish, soak chicken thighs in soy sauce. Squeeze juice from the lemons into the dish. Let stand for at least 10 minutes.\nWhile the chicken is marinating, melt butter in a large skillet or wok. Add garlic and fry until tender. Add chicken thighs and cook on medium high until the juices run clear, about 20 to 25 minutes.\nServe over white rice with pan drippings.\n",
        "picture_link": "t9C0a4hwozzwnNl6mY3sz2k4RD6iy5S"
    },
    {
        "title": "Asparagus and Mushroom Puff Pastry Pie",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 bunches fresh asparagus, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "6 cloves garlic, diced ADVERTISEMENT",
            "1 pound sliced fresh mushrooms ADVERTISEMENT",
            "1 cup prepared hollandaise sauce ADVERTISEMENT",
            "1 (17.25 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nMelt the butter in a large skillet over medium heat. Add the asparagus, and cook for about 10 minutes. Stir in the mushrooms and garlic; cook and stir until the mushrooms are tender. Set aside.\nPrepare the hollandaise sauce according to package directions. Stir into the asparagus and mushrooms.\nLay one sheet of puff pastry out flat in the bottom of a 9x13 inch baking dish, letting any extra dough go up the sides. Spread the asparagus mixture evenly over the dough. Top with the other sheet of pastry, and pinch the edges together to seal.\nBake for 25 to 30 minutes in the preheated oven, until pastry is golden brown. Cool for a few minutes before slicing and serving.\n",
        "picture_link": "1xYjDB5ga6AdhRQJosnPgQ02RIr.r2u"
    },
    {
        "title": "Easy Baked Ham",
        "ingredients": [
            "1 (4 pound) fully-cooked spiral cut ham ADVERTISEMENT",
            "1 (20 ounce) can sliced pineapple, drained with juice reserved ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "1 liter ginger ale ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nRemove as much of the ham from the bone as you can. Layer one third of the ham in the bottom of a 6 quart casserole dish. Top with a few pineapple rings and 1/4 of the brown sugar. Repeat the layers, ending with pineapple rings on top, but don't sprinkle the last 1/4 of brown sugar.\nPour any juice left in the pineapple can over the ham. Then pour in enough of the ginger ale to fill the dish about half way. Sprinkle the remaining brown sugar over the top.\nCover with aluminum foil and bake for 20 minutes in the preheated oven. Uncover and cook for an additional 20 minutes.\n",
        "picture_link": "p9b9067o4ytrw4TQtK1MeJcoPnLE0CW"
    },
    {
        "title": "Fortune Cookies So Easy",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, melted and cooled ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets, or line with parchment paper. Have fortunes ready to go on small strips of paper.\nIn a large glass or metal bowl, whip egg whites and sugar on high speed of an electric mixer until frothy, about 2 minutes. Reduce speed to low, and stir in melted butter, vanilla, almond extract, water and flour one at a time, mixing well after each. Consistency should resemble pancake batter. Spoon the batter into 3 inch circles on the prepared baking sheets. Leave room between for spreading.\nBake for 5 to 7 minutes in the preheated oven, or until the edges begin to brown slightly. Quickly remove one at a time, place a message in the center, and fold in half. Fold the ends of the half together into a horse shoe shape. If they spring open, place them in a muffin tin to cool until set.\n",
        "picture_link": "gVgo7uGjPXskykz9fHwVpZIUM4kq5uy"
    },
    {
        "title": "Coq Au Vin, My Way",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "6 skinless chicken thighs ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "3 medium tomatoes, sliced ADVERTISEMENT",
            "4 portobello mushrooms, sliced ADVERTISEMENT",
            "1 pinch salt (optional) ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "1/3 cup Burgundy wine ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/4 cup shredded Gruyere cheese ADVERTISEMENT",
            "2 tablespoons cornstarch (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Add the chicken thighs, crushed garlic, and Italian seasoning. Brown the chicken thighs on both sides, then add the tomatoes and portobello mushrooms. Season with salt and pepper. Reduce heat to low, cover, and simmer for about 30 minutes.\nStrain off about half of the liquid from the skillet, and pour in the Burgundy wine. Cover, and simmer for another 30 minutes. Remove the chicken, tomatoes and mushrooms to a 8 or 9 inch square baking dish. Cover with sliced onion, and set aside.\nPreheat the oven to 350 degrees F (175 degrees C). Bring the liquid remaining in the skillet to the boiling point over medium-low heat. Gently whisk in the heavy cream and Gruyere cheese. Remove from the heat, and stir until smooth. If the sauce is not thick enough, whisk in the cornstarch, and simmer over very low heat until it thickens. Pour the sauce over the chicken in the baking dish.\nBake for 30 minutes in the preheated oven, until onions are tender. Let rest for 5 minutes before serving.\n",
        "picture_link": "3cMUCveb1IJe6rzBisSgutSepXxiW2a"
    },
    {
        "title": "Cabbage and Pasta",
        "ingredients": [
            "1 (12 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 medium head cabbage, chopped ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add farfalle pasta, and cook for 8 to 10 minutes or until al dente; drain.\nMelt the butter in a skillet over medium heat. Stir in the cabbage, onion, and garlic, and season with salt and pepper. Cook 15 minutes, or until the cabbage and onion are tender.\nIn a large bowl, toss together the cooked farfalle and the cabbage mixture. Serve warm.\n",
        "picture_link": "NqHnCB3nuUL6UYZtwVHTDaVx/F3zug."
    },
    {
        "title": "Grilled Radishes",
        "ingredients": [
            "20 ounces radishes, sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons butter, cut into small pieces ADVERTISEMENT",
            "1 cube ice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the grill for high heat.\nPlace the radishes, garlic, butter, and ice cube on a double layer of aluminum foil large enough to wrap contents. Season with salt and pepper. Tightly seal foil around contents.\nPlace foil packet on the grill, and cook 20 minutes, or until radishes are tender.\n",
        "picture_link": "osIQCe9l44wqKrEkMRyU0X5zc2BXCKS"
    },
    {
        "title": "Bryan's Spicy Red Lentil Soup",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 1/2 cups chopped red onion ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1 1/2 cups frozen chopped spinach ADVERTISEMENT",
            "2 cups dry red lentils ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 1/2 teaspoons ground cardamom ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large pot over medium heat, and cook the onion until golden brown. Season with salt and pepper. Mix in tomatoes, spinach, and lentils, and pour in water. Season with basil, cardamom, cumin, cayenne pepper, and curry powder. Bring to a boil, reduce heat to low, and simmer 25 minutes, stirring occasionally, until lentils are tender.\nTransfer the soup to a blender (or use a hand held blender), and blend until smooth before serving.\n",
        "picture_link": "QHYFNjUMCgGt1Yw2GUMl/6nXpXL3hZO"
    },
    {
        "title": "Maple-Curry Chicken",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 red bell pepper, seeded and chopped ADVERTISEMENT",
            "1 yellow bell pepper, seeded and chopped ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped ADVERTISEMENT",
            "2 cups cubed cooked chicken breast meat ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "1/4 cup pure maple syrup ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "2 1/2 tablespoons hot curry paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter and oil in a large skillet over medium heat. Add onion and peppers, and cook until onions are soft and translucent. Stir in cooked chicken and garlic, and sprinkle with sugar. Cook, stirring for about 3 minutes, then stir in maple syrup, and cook for about 5 more minutes, until caramelized.\nStir in curry paste and heavy cream, and reduce heat to low. Simmer uncovered for 10 to 15 minutes, or until the sauce reaches your desired thickness.\n",
        "picture_link": "rRBIZVh0Y29O5t/GgkbJjAOe.LbJgTy"
    },
    {
        "title": "Bum's Lunch",
        "ingredients": [
            "4 (4 ounce) cube steaks ADVERTISEMENT",
            "4 medium potatoes, thinly sliced ADVERTISEMENT",
            "1 large onion, thinly sliced ADVERTISEMENT",
            "4 teaspoons margarine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nLay out 4 squares of aluminum foil. Place one cube steak onto each piece of foil. Spread margarine over the steaks, and season with salt and pepper. Layer one sliced potato over each steak, and a few rings of onion. Season again with salt and pepper if you like. Fold the foil around the food, and seal into a packet. Place packets onto a baking sheet.\nBake for 45 minutes in the preheated oven, until the beef is no longer pink, and the potatoes are tender. Open carefully, as hot steam will be released.\n",
        "picture_link": "30Kiw.DX3NcR9nRFk4Xgeypv0gDgO2O"
    },
    {
        "title": "Orzo with Tomato and Fried Tofu",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 (14 ounce) package extra firm tofu, diced ADVERTISEMENT",
            "3 medium tomatoes, diced ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "2 cups orzo pasta ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (4 ounce) package crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add orzo pasta and cook for about 5 minutes, until tender. Drain.\nHeat olive oil in a large frying pan or wok over medium-high heat. Fry the garlic and green onions for 20 to 30 seconds until fragrant. Add the tofu, and continue cooking until golden brown.\nStir in the tomatoes, lemon juice, and basil; cook for another minute. Combine with the cooked orzo pasta, season to taste with salt and pepper. Serve sprinkled with crumbled feta cheese.\n",
        "picture_link": "PEGNu.A82Thxafa5N0GluKY/UnMz4Tq"
    },
    {
        "title": "Creamy Cream Cheese Frosting",
        "ingredients": [
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "1 3/4 cups confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat cream cheese and sugar until smooth. Fold in whipped topping.\n",
        "picture_link": "YS9NhxG8TNTLo0wCGFbaDEonDWshYx6"
    },
    {
        "title": "Taco Seasoning III",
        "ingredients": [
            "1/4 cup unbleached all-purpose flour ADVERTISEMENT",
            "1/2 cup dried onion flakes ADVERTISEMENT",
            "1 teaspoon dried minced garlic ADVERTISEMENT",
            "1 cup chili powder ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "4 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a jar with a tight fitting lid, combine flour, onion flakes, garlic, chili powder, oregano, cumin, and salt. Close lid securely, and shake well to mix contents. One half cup is equivalent to 1 (1.25 ounce) package of taco seasoning.\n",
        "picture_link": "XN.Y965fJadafL/xug8y5iLaKWy2KoK"
    },
    {
        "title": "Irish Eggs",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "6 potatoes, peeled and sliced ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, melt butter over medium high heat. Add potatoes, onion and green pepper; saute until potatoes are browned. Stir in eggs and cook until eggs are set. Serve warm.\n",
        "picture_link": "2gjH8qZOtH7uTvMPzucdqo9.yc4kqTu"
    },
    {
        "title": "Applesauce Doughnuts",
        "ingredients": [
            "2 quarts oil for frying ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup firmly packed light brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 cup unsweetened applesauce ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in deep-fryer to 375 degrees F (190 degrees C).\nSift together flour, baking powder, baking soda, cinnamon, nutmeg, cloves and salt onto piece of waxed paper.\nIn a large bowl, use an electric mixer at medium speed to beat together sugar, brown sugar and eggs until fluffy. Beat in 2 tablespoon oil. Stir flour mixture into egg mixture, alternately with milk, beginning and ending with dry ingredients, until well blended. Stir in applesauce and vanilla.\nCarefully drop batter by level tablespoons, 3 or 4 at a time, into hot oil. Do not overcrowd pan or oil may overflow. Fry, turning once with tongs, for 3 minutes or until golden. Transfer with tongs to paper toweling to drain. Cool completely.\n",
        "picture_link": "xf6cX1X34XExMkJhZr5X92BRobipw9e"
    },
    {
        "title": "Tuna Delicious",
        "ingredients": [
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (6 ounce) can tuna, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add egg noodles and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet over medium heat, fry onion in oil until browned. Mix in tuna and mushroom soup. Stir in sour cream and heat through. Mix together the cooked egg noodles and sauce and serve.\n",
        "picture_link": "7l6yCehcuC1A3a6W2X55yzm5lDSUtQ6"
    },
    {
        "title": "Scallops One - Two - Three",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "12 sea scallops, rinsed and drained ADVERTISEMENT",
            "3 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut the bacon slices in half and wrap each half around a scallop. Use a toothpick to secure in place. Drizzle lemon juice over scallops. Place on a cookie sheet.\nBake in a preheated oven for 15 to 20 minutes or until bacon is cooked. Serve warm.\n",
        "picture_link": "Sizsmtx5IBEu/Caa9Evf4.2C.USa0Ii"
    },
    {
        "title": "Slow Cooker Chicken Stew",
        "ingredients": [
            "3 pounds skinless, boneless chicken breast meat - cut into bite-size pieces ADVERTISEMENT",
            "1/2 teaspoon olive oil ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon Italian-style seasoning ADVERTISEMENT",
            "1 apple - peeled, cored and cut into eighths ADVERTISEMENT",
            "3 small red potatoes, cut into eighths ADVERTISEMENT",
            "1 onion, cut into eighths ADVERTISEMENT",
            "1 (1.25 ounce) envelope dry onion gravy mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium high heat. Saute garlic and chicken until lightly browned.\nPlace chicken and garlic in slow cooker; add water, soup, pepper, salt, seasoning, apple, potatoes, onion and gravy mix. Mix all together.\nSet heat on Low setting and simmer slowly for 6 to 8 hours.\n",
        "picture_link": "RWOYr81kpQktt.T.ZJexY98bxyfIzHW"
    },
    {
        "title": "Seven-Up™ Pound Cake",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "7 fluid ounces lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a large bowl, cream together the butter, shortening and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla and lemon extracts. Beat in the flour alternately with the lemon-lime soda, mixing just until incorporated.\nPour batter into prepared pan. Bake in the preheated oven for 70 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool on a cake rack for 30 minutes before removing from the pan.\n",
        "picture_link": "ZX7je4uZ4aHVL1j0T2ki/8eLDqy6JDq"
    },
    {
        "title": "Traditional Creamy Coleslaw",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons seasoned rice wine vinegar ADVERTISEMENT",
            "1 1/2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (28 ounce) package coleslaw mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, sugar, rice wine vinegar, lemon juice, horseradish, onion powder, dry mustard, celery salt, salt, and black pepper in a large mixing bowl, stirring to dissolve sugar. Fold coleslaw mix into dressing. Cover bowl and refrigerate 1 hour before serving.\n",
        "picture_link": "e2h7Kfq0/DwN9j3kwtDGqOSgA0eDXTy"
    },
    {
        "title": "Famous Taco Seasoning Mix",
        "ingredients": [
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 1/2 teaspoons dried minced onion ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "3/4 teaspoon crushed beef bouillon cube ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 dash onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, chili powder, dried minced onion, salt, paprika, crushed beef bouillon, sugar, cayenne pepper, garlic powder, and onion powder together in a bowl.\n",
        "picture_link": "acC/RZZ01hiTzje8W9RTnSRvaAUph6q"
    },
    {
        "title": "Fast and Easy Creamed Spinach",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "2 (16 ounce) bags fresh spinach ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 pinch freshly grated nutmeg ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons minced shallot ADVERTISEMENT",
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon freshly grated lemon zest ADVERTISEMENT",
            "2 tablespoons finely shredded Parmigiano-Reggiano cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour olive oil into a large soup pot, place over high heat, add spinach, and cover. Cook for 1 minute, uncover, and lightly stir until most of the leaves are bright green and wilted, about 2 minutes. Quickly drain spinach in a strainer and transfer to a plate lined with 4 or 5 paper towels. Once cool enough to handle, squeeze as much liquid from the spinach as possible. Transfer spinach to a cutting board and coarsely chop.\nMix salt, black pepper, cayenne pepper, and nutmeg in a small bowl.\nPlace a large skillet over medium heat, melt butter in skillet, and stir shallot in the hot butter until just barely golden and translucent, 3 to 4 minutes. Stir seasoning mixture into shallot mixture and pour in cream. Raise heat to medium-high and reduce cream sauce to about half, about 5 minutes. Stir in lemon zest.\nReduce heat to low and toss spinach with cream sauce in skillet. Cook and stir until spinach is heated through and coated, about 2 minutes. Stir Parmigiano-Reggiano cheese into spinach until thoroughly combined; serve immediately.\n",
        "picture_link": "ymn/yif8YgkagjzEU/KdKSfHbeidMy2"
    },
    {
        "title": "Paleo Cauliflower Rice",
        "ingredients": [
            "1 large head cauliflower, cut into large chunks ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cauliflower chunks in a food processor and pulse until broken down into rice-size pieces.\nHeat olive oil in a skillet over medium heat; add cauliflower 'rice', salt, and pepper. Cover skillet and cook until heated through, 3 to 5 minutes. Remove lid and fluff 'rice' with a fork.\n",
        "picture_link": "RiL4QWEcJ2V0QlQTCCupx9haxZ31ww2"
    },
    {
        "title": "Chef John's Sweet Potato Casserole ",
        "ingredients": [
            "Sweet potatoes: ADVERTISEMENT",
            "2 1/2 pounds sweet potatoes, peeled and cubed ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "1/4 cup buttermilk ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground allspice ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "Pistachio crust: ADVERTISEMENT",
            "1/2 cup chopped roasted, salted pistachios ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 1/2-quart baking dish with butter.\nPlace sweet potato cubes into a large pot, cover with water, and add a large pinch of salt. Bring to a boil and cook until a knife is easily inserted into a sweet potato cube, about 10 minutes. Drain well. Return to the pot and mash 2 tablespoons butter into sweet potatoes.\nWhisk eggs, maple syrup, buttermilk, milk, vanilla extract, cayenne pepper, allspice, and 1/2 teaspoon salt together in a large bowl until smooth. Gradually mash sweet potatoes into egg mixture, starting with 2 tablespoons of sweet potato mixture, until all sweet potatoes are incorporated. Transfer sweet potatoes into prepared baking dish.\nMix pistachios, brown sugar, flour, and 1/4 cup melted butter together until completely mixed. Crumble topping evenly over top of sweet potatoes. Use the back of a fork to gently press pistachio mixture down onto sweet potatoes.\nBake in the preheated oven until topping is browned and casserole is set, 25 to 30 minutes. If desired, place under oven's broiler for 5 minutes to give topping a little more brown color. Let rest to cool slightly before serving, about 10 minutes.\n",
        "picture_link": "s/Sqginhv/2uDGabZs0n2QrKZJ6VWHG"
    },
    {
        "title": "Turkey Taco Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/4 pounds ground turkey ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 carrots, cut into 1/4 inch rounds ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 1/2 cups frozen corn ADVERTISEMENT",
            "5 cloves garlic, chopped ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/2 bunch chopped fresh cilantro, divided ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 green chile pepper, halved lengthwise ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "3 1/2 cups chicken broth ADVERTISEMENT",
            "1 cup water, or more as needed ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium-high heat and stir in the ground turkey. Cook and stir until the turkey is crumbly, evenly browned, and no longer pink. Transfer turkey to a bowl; set aside.\nIn the same skillet, stir in the onion; cook and stir until the onion is nearly translucent, about 5 minutes. Add the carrots and celery. Continue to cook and stir until tender, about 8 more minutes.\nStir in the corn, garlic, taco seasoning, cumin, chili powder, dried oregano, and about 1/4 cup cilantro along with the cooked turkey. Cook and stir until fragrant, about 2 minutes.\nMix in the tomatoes, kidney beans, green chile pepper, olives, chicken broth, water, and lime juice. Season with salt and black pepper. Bring to a boil, then reduce heat to low and continue to simmer for 20 minutes. Remove chile halves, and garnish with the remaining cilantro before serving.\n",
        "picture_link": "Qec94kXRZbgEf2qTfMy4E1T8VZvE6NO"
    },
    {
        "title": "Chef John's Chicken French ",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken breast cutlets, pounded flat ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "1/2 cup dry sherry ADVERTISEMENT",
            "2 lemons, juiced ADVERTISEMENT",
            "1/4 cup cold butter, cut into chunks ADVERTISEMENT",
            "1 tablespoon chopped fresh flat-leaf parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs and milk together in a shallow bowl. Whisk flour, salt, black pepper, and cayenne pepper together in another shallow bowl.\nGently press chicken into flour mixture to coat; shake off excess flour. Dip into egg mixture and coat completely.\nHeat olive oil and 1 tablespoon butter together in a large skillet over medium heat. Cook chicken in hot oil until lightly browned, 2 to 3 minutes per side. Transfer chicken to a plate.\nCook and stir vegetable broth, sherry, and lemon juice in the same skillet; bring to a boil and cook until sauce is reduced by half. Remove from heat and add cold butter chunks; stir until butter is melted and sauce is shiny and thickened, 1 to 2 minutes. Stir parsley into sauce and season with salt and pepper.\nReturn chicken to the skillet over medium heat, spoon sauce over the top, and cook until chicken is heated through and no longer pink in the center, 1 to 3 minutes more.\n",
        "picture_link": "zDJKGxA0TR6Nrcghe8bzvgcvOW.6FCi"
    },
    {
        "title": "Herbed Slow Cooker Turkey Breast",
        "ingredients": [
            "1 (3 pound) bone-in turkey breast half ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1/4 cup whipped cream cheese spread with garden vegetables ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon minced fresh parsley ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place turkey breast into a slow cooker. Combine butter, whipped cream cheese spread, soy sauce, parsley, basil, sage, thyme, black pepper, and garlic powder in a small bowl until smooth. Brush herb mixture over the turkey breast. Cover slow cooker.\nCook until turkey is tender, 4 to 6 hours on High or 8 to 10 hours on Low.\n",
        "picture_link": "oy8DznK/Rfx25p12cu5Fi81Eol40eV."
    },
    {
        "title": "Sweet Hot Mustard Chicken Wings",
        "ingredients": [
            "2 pounds chicken wings, separated at joints, tips discarded ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "2 teaspoons cider vinegar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil; coat the aluminum foil with cooking spray.\nArrange the wings on the prepared baking sheet so they do not touch; season with salt.\nBake in the preheated oven until browned and crispy on top, about 20 minutes. Flip the wings with tongs and cook until no longer pink in the center and the juices run clear, about 20 minutes more.\nStir together the Dijon mustard, yellow mustard, honey, cider vinegar, salt, pepper, and hot sauce in large mixing bowl. Add the wings to the bowl and toss with a spatula to coat evenly. Allow to sit for about five minutes and toss again to re-coat. Transfer to a plate to serve.\n",
        "picture_link": "fLi3WIdSGBMOVPFPrkA/wZHW1tZAoM."
    },
    {
        "title": "Mushroom Sauce",
        "ingredients": [
            "2 cups fresh sliced mushrooms ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon shallots, minced ADVERTISEMENT",
            "1/2 cup chopped mushrooms ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/4 cup red wine ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1 tablespoon arrowroot powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saute pan, melt 1/4 cup butter over medium heat. Add sliced mushrooms; cook and stir until soft. Remove mushrooms from pan, and set aside.\nAdd 1 tablespoon butter to pan, and melt . Add shallots; cook and stir until translucent. Add mushrooms, and cook until soft. Add thyme, bay leaf, and red wine. Reduce.\nIn a small bowl, dissolve arrowroot in 1/4 cup cold beef broth. Stir remaining broth into sauce, and bring to a boil. Whisk in arrowroot mixture, and stir until thick. Add reserved mushrooms. Season to taste with freshly ground black pepper and salt.\n",
        "picture_link": "nAVXkVt/JU0M5vXxWqmwQLGa0HPLKeW"
    },
    {
        "title": "Bulgur Chickpea Salad",
        "ingredients": [
            "1 cup bulgur ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup fresh lemon juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 cup chopped green onions ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "1 cup grated carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a heatproof bowl, pour boiling water over bulgur. Let stand 1 hour at room temperature.\nIn a small bowl, beat together oil, lemon juice, salt, and pepper. Pour over bulgur; and mix with a fork.\nPlace bulgur in the bottom of a nice glass serving bowl. Layer vegetables and garbanzo beans in this order on top of the bulgur: green onions, garbanzo beans, parsley, and carrots on top. Cover, and refrigerate. Toss salad just before serving.\n",
        "picture_link": "KOJC3.vPd0D16NzWihzOfQPeHBUQ.dq"
    },
    {
        "title": "Mexican Rice Pilaf",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 1/2 cups vegetable broth ADVERTISEMENT",
            "1 1/2 cups instant brown rice ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 large tomato, seeded and chopped ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, heat oil over medium high heat. Add onion and garlic; cook for 3 minutes, stirring occasionally. Stir in broth, rice, chili powder, jalapeno peppers, and cumin. Cover, and bring to a boil over high heat. Reduce heat, and simmer for 4 minutes. Stir in bell pepper. Cover. Simmer for 5 minutes, or until liquid is absorbed.\nStir tomato and shredded cheese into hot cooked rice.\n",
        "picture_link": "HeZ15V0ZzF30ge4mMDyuAaDz7ymQHDu"
    },
    {
        "title": "Potato and Broccoli Casserole",
        "ingredients": [
            "1 head fresh broccoli, cut into florets ADVERTISEMENT",
            "6 large potatoes, cubed ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of broccoli soup ADVERTISEMENT",
            "2 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 teaspoon Dijon-style prepared mustard ADVERTISEMENT",
            "1 cup crushed saltine crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a 3 quart casserole dish.\nIn a large bowl, mix together cream soups, cheddar cheese, sour cream, and mustard. Stir in potatoes and broccoli. Spoon into prepared casserole dish. Top with crushed crackers.\nBake for 45 minutes to 1 hour, or until potatoes are tender.\n",
        "picture_link": "p9cFwlqlQpgj.XjiMFSPJzMmoNeFo0W"
    },
    {
        "title": "Chocolate Orange Truffles",
        "ingredients": [
            "1/4 cup unsalted butter ADVERTISEMENT",
            "3 tablespoons heavy cream ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate, chopped ADVERTISEMENT",
            "2 tablespoons orange liqueur ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate, chopped ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium-high heat, combine butter and cream. Bring to a boil, and remove from heat. Stir in 4 ounces chopped chocolate, orange liqueur, and orange zest; continue stirring until smooth. Pour truffle mixture into a shallow bowl or a 9X5 in loaf pan. Chill until firm, about 2 hours.\nLine a baking sheet with waxed paper. Shape chilled truffle mixture by rounded teaspoons into small balls (a melon baller also works well for this part). Place on prepared baking sheet. Chill until firm, about 30 minutes.\nIn the top of a double boiler over lightly simmering water, melt remaining 4 ounces chocolate with the oil, stirring until smooth. Cool to lukewarm.\nDrop truffles, one at a time, into melted chocolate mixture. Using 2 forks, lift truffles out of the chocolate, allowing any excess chocolate to drip back into the pan before transferring back onto baking sheet. Chill until set.\n",
        "picture_link": "VG6bb5MVuh92VhSbTk1Y54ZrFO4oiw."
    },
    {
        "title": "Delicata Creamy Squash Soup",
        "ingredients": [
            "3 delicata squash, halved lengthwise and seeded ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cups vegetable broth ADVERTISEMENT",
            "1 1/2 cups heavy whipping cream ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Place the squash, cut sides down, in a baking dish. Add 1/8 inch water in baking dish, cover with foil and bake 35-40 minutes or until tender. Cool.\nIn a large saucepan, melt butter. Add onion and cook over low heat, stirring occasionally until onion is softened but not brown.\nScrape the squash out of the flesh and add to onions. Add the stock and heavy cream. Cook over moderate heat, stirring occasionally, about 25 minutes.\nPuree the soup in a blender or food processor. Season with salt and pepper to taste and serve.\n",
        "picture_link": "S3K1bMqjvZsx9U5sJP3MstpkkxQX7la"
    }
]