[
    {
        "title": "Fruited Coleslaw",
        "ingredients": [
            "3 cups shredded cabbage ADVERTISEMENT",
            "3 cups crushed pineapple in syrup, drained ADVERTISEMENT",
            "1 cup apple, cored and chopped ADVERTISEMENT",
            "1/2 cup miniature marshmallows ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 cup diced canned peaches, drained ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, combine cabbage, pineapple, apple, marshmallows, celery, peaches, mayonnaise, and salt. Toss until the mixture in well coated with the mayonnaise. Refrigerate until you are ready to serve.\n",
        "picture_link": "t3IU0pzBnuzo2hyR.9SQ.M958DzYmCK"
    },
    {
        "title": "Cassie's Wishy Chicken",
        "ingredients": [
            "1 (4 pound) whole chicken ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "5 tablespoons salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup thousand island dressing ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the sectioned chicken parts in a shallow, nonporous dish so that the pieces fit snugly.\nIn a separate, nonporous small bowl, combine the lemon juice, salt, paprika, ground black pepper, garlic and thousand island dressing. Mix well, pour over the chicken and add water to cover.\nCover and refrigerate, allowing the chicken to marinate for 8 hours.\nPrepare an outdoor grill for indirect heat and lightly oil grate.\nGrill chicken over indirect heat for about 50 minutes, or until temperature reaches 180 degrees F (80 degrees C). Discard any excess marinade.\n",
        "picture_link": "WSdhmdwPv/wY1KW4IBSzO.Lc/a5lSZ."
    },
    {
        "title": "Irish Soda Bread III",
        "ingredients": [
            "1 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 1/4 cups bread flour ADVERTISEMENT",
            "2 tablespoons dry milk powder ADVERTISEMENT",
            "3 teaspoons caraway seed ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "2/3 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add ingredients in order suggested by your manufacturer. Select fruit bread or basic bread setting. Add raisins when indicated by your manufacturer.\n",
        "picture_link": "X7HCSHQ.jksviM9MaL7sWf0DD4EzBIi"
    },
    {
        "title": "Peas Rice",
        "ingredients": [
            "1 cup basmati rice ADVERTISEMENT",
            "1 tablespoon butter or margarine ADVERTISEMENT",
            "2 whole cloves ADVERTISEMENT",
            "1 (2 inch) piece cinnamon stick ADVERTISEMENT",
            "1 serrano pepper, chopped ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1/4 cup green peas ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and drain the rice.\nHeat a saucepan over a medium heat. Add butter or margarine and let melt. Stir in cloves, cinnamon, Serrano chile, and ginger. Saute briefly. Mix in rice and stir to coat it evenly. Stir in peas, salt, and sugar. Pour in water and bring the water to a boil.\nReduce heat to simmer and let rice cook covered for 15 to 20 minutes; or until rice is tender.\n",
        "picture_link": "ekvj9CkhlRdTAwlqXF9L9upvt5DD0dW"
    },
    {
        "title": "Rocky Road Drops",
        "ingredients": [
            "1 (12 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "2 cups butterscotch chips ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "2 cups peanuts ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "4 cups chow mein noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the top of a double boiler, melt the chocolate and butterscotch chips.\nIn a large bowl, combine the raisins, peanuts, marshmallows and chow mein noodles. Add melted chocolate mixture and quickly mix well.\nDrop by tablespoons onto wax paper; allow to sit until hardened.\n",
        "picture_link": "6t.XMxAT8uF3H.5OQ0ZlSdwENy/N9qu"
    },
    {
        "title": "Low Fat Turkey Burgers",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "2 cubes beef bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat and lightly oil grate.\nIn a large bowl, combine the ground turkey and the bouillon and mix well. Form into four patties.\nGrill over high heat for 3 minutes per side, or until internal temperature equals 160 degrees F (70 degrees C).\n",
        "picture_link": "HDP/wDSbgkJ8/6U2.d3Z9opbPiHyuZ6"
    },
    {
        "title": "Shrimp Scampi and Tomato Broil",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler, and set the oven rack about 6 inches from the heat source.\nHeat the oil in a large, oven-proof skillet over medium heat; add the garlic, and cook until lightly browned, about 1 minute. Stir in the shrimp and the tomatoes. Cook just until the shrimp turn pink, 3 to 5 minutes. Pour in wine; simmer for 2 additional minutes.\nTop shrimp with mozzarella cheese, and broil until the cheese is melted and golden. Sprinkle with Parmesan cheese and dried parsley before serving.\n",
        "picture_link": "U7pISctEQ1DyJpU99qm30Ge9SEQxa9."
    },
    {
        "title": "CraZee's Creamy Seafood and Pasta",
        "ingredients": [
            "2 (8 ounce) packages fresh pasta of your choice ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "8 ounces medium shrimp, peeled and deveined ADVERTISEMENT",
            "8 ounces small scallops ADVERTISEMENT",
            "1/2 yellow bell pepper, cut into strips ADVERTISEMENT",
            "1/2 orange bell pepper, cut into strips ADVERTISEMENT",
            "1/8 teaspoon Cajun seasoning ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nBring white wine and milk to a simmer in a small saucepan over medium-high heat. Whisk in sour cream and Parmesan cheese, reduce heat to medium-low, and simmer until thickened, about 5 minutes. Remove from the heat and stir in cilantro.\nMeanwhile, heat olive oil in a skillet over medium-high heat. Add shrimp and scallops, and cook until the shrimp begin to firm and turn pink. Stir in the yellow and orange peppers, season with Cajun seasoning, salt, and pepper; continue cooking until peppers are tender.\nTo serve, place cooked pasta into a serving bowl, top with seafood mixture, and pour sauce overtop.\n",
        "picture_link": "Kod59HNqwFDudL7TT34/k0zC/aUsUvq"
    },
    {
        "title": "Shrimp Kisses with Feta Cheese",
        "ingredients": [
            "20 peeled and deveined medium shrimp ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "3 large jalapeno peppers, seeded and cut into slivers ADVERTISEMENT",
            "10 slices thick sliced bacon, cut in half ADVERTISEMENT",
            "20 toothpicks, soaked in water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-low heat, and lightly oil the grate.\nUse a sharp paring knife to cut down the backs of the shrimp nearly all the way through, so you can spread apart the two halves. Open up the shrimp and lay them out onto your work surface. Spoon some crumbled feta cheese onto each shrimp, then top with slivers of jalapeno pepper. Close up the shrimp and wrap each with a strip of bacon; secure with a toothpick.\nCook on the preheated grill until the bacon has begun to crisp and the shrimp is no longer translucent in the center, 10 to 15 minutes.\n",
        "picture_link": "Cfv7Wi81NWiBojddT2HUZrnQXu5RwOG"
    },
    {
        "title": "Huckleberry-Lemon Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/3 cup half-and-half cream ADVERTISEMENT",
            "3/4 teaspoon lemon zest ADVERTISEMENT",
            "3/4 cup fresh huckleberries ADVERTISEMENT",
            "1 cup powdered sugar ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 teaspoon lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Grease a baking sheet.\nWhisk together the flour, sugar, baking powder, and salt in a large bowl. Using a pastry blender, cut in butter and lemon juice until evenly mixed and slightly crumbly. Whisk together the eggs and half-and-half in a small bowl; add 3/4 teaspoons lemon zest with the egg mixture to flour mixture, and mix gently just until well blended and forming a dough. Fold in the huckleberries.\nDivide dough in half, and on a floured surface, shape each half into a ball, then flatten slightly. Cut each round into six wedges; place on prepared baking sheet.\nBake in the preheated oven until tops are golden brown, about 12 minutes. Whisk together powdered sugar and lemon juice to make a glaze. Drizzle glaze on cooled scones. Sprinkle with remaining lemon zest for garnish.\n",
        "picture_link": "K.3WTeXnSYX0yLm/gE5xu.h0YqaZWdu"
    },
    {
        "title": "Chicken Mole with Four Chiles",
        "ingredients": [
            "4 dried mulato chiles ADVERTISEMENT",
            "4 dried ancho chiles ADVERTISEMENT",
            "4 dried guajillo chiles ADVERTISEMENT",
            "4 dried pasilla chilies ADVERTISEMENT",
            "2 teaspoons lard, or more as needed ADVERTISEMENT",
            "1 large onion, peeled and chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 (7 inch) flour tortilla ADVERTISEMENT",
            "2 (5 inch) corn tortillas ADVERTISEMENT",
            "1 plantain, peeled and chopped ADVERTISEMENT",
            "1/2 cup almonds ADVERTISEMENT",
            "1/2 cup peanuts ADVERTISEMENT",
            "1/8 cup sesame seeds ADVERTISEMENT",
            "1 (14 ounce) can whole peeled tomatoes ADVERTISEMENT",
            "1 tablet of Mexican chocolate, such as Abuelita or Ibarra ADVERTISEMENT",
            "1 whole chicken ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the stems, veins and seeds from the chiles (you might want to wear gloves when you do this). Heat the lard in a heavy skillet over medium heat. Add the chiles, and cook and stir until the chiles are fragrant, about 1 minute, being careful not to burn them. Remove the chiles and place them in a large bowl.\nStir in the onion and garlic, and cook until the onion is soft and translucent, about 5 minutes. Remove and add to the bowl with the chiles.\nBreak the flour and corn tortillas into pieces, and add them to the skillet. Toast on both sides, turning often, until golden brown, about 3 minutes. Remove; add to the bowl.\nIf needed, melt a small amount of additional lard in the skillet. Add the plantain pieces to the skillet, and cook and stir until lightly browned, about 5 minutes. Remove plantain; add to the bowl.\nStir the almonds and peanuts into the skillet, and cook and stir until fragrant, about 1 minute. Sprinkle in the sesame seeds and continue cooking until sesame seeds are lightly browned, 15-30 seconds. Remove; add to the bowl.\nWarm the tomatoes over medium heat in the skillet until heated through, about 5 minutes. Remove from heat. Break the chocolate into chunks and stir into the tomatoes until melted. Pour the chocolate and tomato mixture into the bowl with the chile mixture; stir to combine.\nWorking in small batches, puree the mixture in a blender until smooth, adding a small amount of water if needed to make a smooth sauce.\nPlace the chicken into a large Dutch oven; pour the sauce over the chicken. Cover and simmer over medium low heat until the chicken falls off the bone, 2-3 hours.\n",
        "picture_link": "Ebrav3ayuCeQIXUufNdWJBeQCNKL9yO"
    },
    {
        "title": "Lebanese Baked Eggplant",
        "ingredients": [
            "2 eggplants ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound beef stew meat, cut into small pieces ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "2 large potatoes, cut into 1 inch cubes ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut eggplants into half-inch slices; sprinkle with 1 teaspoon salt and let stand for 20 minutes; blot up the liquid with a paper towel.\nPreheat an oven to 350 degrees F (175 degrees C).\nHeat the olive oil in a skillet over medium heat; brown the onion and stew meat in the hot oil. Stir in the walnuts and cook another 2 minutes; remove from heat.\nArrange half of the eggplant slices in the bottom of a 9x13 inch baking dish; spoon the beef mixture over the layer of eggplant. Top the beef mixture with the remaining eggplant slices, potatoes, and tomatoes; season with salt and pepper.\nBake uncovered in preheated oven until the eggplant is soft; about 1 hour.\n",
        "picture_link": "MM9sWSnVMETFpvsk1hWwYQ8tMhr0.dS"
    },
    {
        "title": "Homemade Graham Crackers",
        "ingredients": [
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2/3 cup brown sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a large baking sheet. Whisk together the flour, baking powder, and cinnamon in a bowl; set aside.\nUse an electric mixer to beat the butter and brown sugar together until light. Stir in the flour mixture. Slowly pour in the water; stir until dough is formed. Refrigerate dough for 30 minutes.\nOn a well floured board, roll dough to between 1/8 and 1/4 inch thick. Use a knife or cookie cutter to cut dough into squares or rectangles. Transfer crackers to prepared baking sheet.\nBake in preheated oven until light brown, 11 to 13 minutes. Remove crackers from oven. Use a fork to pierce multiple holes on tops of crackers.\n",
        "picture_link": "a1v6/tQuhrcZ5/N8RoY8AH4xMdHIx8O"
    },
    {
        "title": "Nina's Texas Chili",
        "ingredients": [
            "2 teaspoons cooking oil ADVERTISEMENT",
            "3 pounds beef top sirloin, thinly sliced ADVERTISEMENT",
            "2 pounds sweet Italian sausage, casings removed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "20 ounces diced tomatoes ADVERTISEMENT",
            "3 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "2 teaspoons chicken bouillon granules ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "2 tablespoons cayenne pepper ADVERTISEMENT",
            "6 tablespoons chili powder ADVERTISEMENT",
            "3 tablespoons dried oregano ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup masa (corn flour) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large pot over medium heat; cook the steak, sausage, onion, green pepper, red, pepper, yellow pepper, and garlic in the pot until the onions and peppers are soft, about 5 minutes. Add the diced tomatoes, tomato sauce, chicken bouillon, honey, and kidney beans; bring to a boil. One at a time, stir in the cayenne pepper, chili powder, oregano, black pepper, salt, and sugar. Sprinkle the Cheddar cheese into the chili in small batches and stir to melt. Reduce heat to low and slow cook about 2 hours. Thicken by stirring the masa through the chili, and simmering for 10 minutes.\n",
        "picture_link": "EsNgxOX0AQdhjY.lkvxr0oo79DWp5gm"
    },
    {
        "title": "No Mess Squash on the Barbeque",
        "ingredients": [
            "2 yellow squash, cut into 1/2-inch slices ADVERTISEMENT",
            "2 zucchini, cut into 1/2-inch slices ADVERTISEMENT",
            "2 tomatoes, cut into wedges (optional) ADVERTISEMENT",
            "1 small onion, sliced and separated into rings ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill to medium heat. Cut two sheets of heavy duty aluminum foil, each approximately 18 inches long.\nPlace the yellow squash, zucchini, tomatoes, onion, and garlic in the center of one sheet of aluminum foil. Drizzle with olive oil; season with salt and pepper. Place second sheet of foil on top of vegetables. Fold edges together tightly to seal packet.\nPlace packet on the top rack of the preheated grill. Cook for 15 minutes. Turn packet over and continue to cook until vegetables are tender, 15 to 20 minutes.\nCarefully cut an \"X\" into top of packet and pour vegetables and juices into serving bowl. Garnish with parsley.\n",
        "picture_link": "xQkYOF3lTdNw5DFcAaufJuG46eHY50a"
    },
    {
        "title": "Cucumber and Blue Cheese Salad",
        "ingredients": [
            "1 cucumber, cubed ADVERTISEMENT",
            "1 tomato, cubed ADVERTISEMENT",
            "3 stalks celery, cubed ADVERTISEMENT",
            "1 (3.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/4 cup crumbled blue cheese ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cucumber, tomato, celery, black olives, and blue cheese in a mixing bowl. Pour in the red wine, mix, and you're done!\n",
        "picture_link": "XxiYSCoWFuENdRBdnE0n7BqgijG1kOa"
    },
    {
        "title": "Edamame Dumplings",
        "ingredients": [
            "1 (1 pound) package frozen edamame (green soybeans), thawed ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "1 dash hot sauce ADVERTISEMENT",
            "2 (12 ounce) packages small won ton wrappers ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "4 cubes chicken bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly-salted water to a boil. Add edamame and boil for 10 minutes; drain. Rinse with cold water.\nPlace edamame in a food processor; turn processor on to low. Drizzle in 1/4 cup water and olive oil while continuing to process until combined. Turn off the food processor and add the sour cream, salt, pepper, green onion, garlic, lemon juice, and hot sauce. Process until mixture is smooth.\nPlace 1 teaspoon of the mixture in the center of each won ton wrapper. Bring 2 opposite corners of the wrapper together to form a triangle; pinch the edges closed. Bring farthest corners of the triangle together and overlap one another. Use a little bit of water on the corners and pinch them together to ensure they stay together.\nStir together 6 cups water and the bouillon cubes in a large, deep skillet over medium heat; bring to a gentle boil. Lay the wontons in the water, assuring they don't touch one another; cook until tender, about 5 minutes; plate. Ladle broth from skillet over won tons to serve.\n",
        "picture_link": "nO4B.gULBP7NThxYk3aUmEgoQG3yKw2"
    },
    {
        "title": "Jalapeno-Lime Chicken",
        "ingredients": [
            "1/2 cup orange juice ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "2 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the orange juice, lime juice, cumin, garlic, and jalapeno pepper in a bowl; pour into a resealable plastic bag. Add the chicken breasts, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator 2 to 4 hours.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source. Remove the chicken from the marinade and shake off excess. Discard the remaining marinade. Place the chicken on a broiling pan.\nBroil the chicken breasts until no longer pink in the center and the juices run clear, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "JN2V1b1gu3rRrmlYHebl51vpW7bl9ce"
    },
    {
        "title": "Orange Pork Chops with Tarragon",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "4 (6 ounce) boneless pork loin chops ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons dry white wine ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 teaspoon dried tarragon ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Season pork chops with salt and pepper, and cook in the hot oil until lightly browned on both sides, about 4 minutes per side. Add the wine, orange juice, and tarragon, and bring to a simmer. Reduce heat to medium-low, cover and simmer, stirring occasionally, 10 to 15 minutes, until the pork is no longer pink in the center. Remove the pork chops from the skillet, set aside, and keep warm.\nDissolve the cornstarch in the water, and stir into the simmering liquid until the sauce thickens, about 45 seconds. Pour sauce over the pork chops to serve.\n",
        "picture_link": "cjb.YnyPhIiMghTBnjXehNi77/SFHPm"
    },
    {
        "title": "Grilled Guacamole",
        "ingredients": [
            "4 Hass avocados, halved and pitted ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/2 cup reduced-fat sour cream ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce (e.g. Tabasco™), or to taste ADVERTISEMENT",
            "12 cherry tomatoes, quartered ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for low heat, and lightly oil grate.\nCook the avocados on the preheated grill until just slightly browned and caramelized. Allow to cool to room temperature, then remove the skins, and cube. Place 1/2 cup of the avocado into a mixing bowl, and mash together with the onion, jalapeno pepper, and sour cream. Stir in the lime juice, garlic salt, and hot pepper sauce, then gently fold in the remaining avocado along with the cherry tomatoes and cilantro. Chill 30 minutes before serving.\n",
        "picture_link": "e.5tqiQCi9B1HHUum0/MRfErP6vgGQm"
    },
    {
        "title": "Edible Play Dough",
        "ingredients": [
            "2 cups powdered milk ADVERTISEMENT",
            "2 cups honey ADVERTISEMENT",
            "2 cups peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the milk, honey, and peanut butter; shape into balls.\n",
        "picture_link": "ecDYZyx9dJ7x8rTuoEyRHuGFjhqnilC"
    },
    {
        "title": "Pineapple Upside-Down Muffins",
        "ingredients": [
            "1 (10 ounce) can pineapple slices in juice, drained ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons chopped walnuts (optional) ADVERTISEMENT",
            "1/2 cup regular rolled oats ADVERTISEMENT",
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup packed light brown sugar ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "2 tablespoons pineapple juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple ADVERTISEMENT",
            "1 cup grated carrot ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease 12 muffin cups. Stack the pineapple slices and cut them into 6 wedges. Set aside.\nSprinkle 1 teaspoon of brown sugar into the bottom of each muffin cup. Sprinkle in 1/2 teaspoon of walnuts over the sugar, and then place two wedges of pineapple into each cup. Set aside.\nIn a large bowl, stir together the oats, whole wheat flour, all-purpose flour, baking powder, baking soda, salt and cinnamon. In a separate bowl, whisk together the eggs, 1/2 cup of brown sugar, canola oil, pineapple juice and vanilla. Stir the wet ingredients into the dry just until moistened. Fold in the crushed pineapple, carrot, raisins and walnuts. Spoon evenly into the prepared muffin cups.\nBake the muffins until the tops spring back when lightly pressed, about 20 minutes. While the muffins are still hot, loosen the edges from the pan using a small knife and invert onto a serving tray so that the pineapple is on top. Serve upside-down while still warm or at room temperature.\n",
        "picture_link": "S.tkXYembrC2TXreo04l2e4/yEJRVDG"
    },
    {
        "title": "Lebanese-Style Tabouli",
        "ingredients": [
            "2/3 cup water ADVERTISEMENT",
            "1/3 cup bulgur ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 cup fresh lemon juice ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 3/4 pounds tomatoes, chopped ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "2 bunches fresh parsley, chopped ADVERTISEMENT",
            "1 bunch fresh mint, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water to a boil in a small saucepan over high heat. Remove from the heat, stir in the bulgur, cover, and let stand 20 minutes.\nScrape the bulgur into a mixing bowl, and stir in the salt, cinnamon, lemon juice, olive oil, tomatoes, onions, parsley, and mint. Stir, then refrigerate uncovered 1 hour until cold.\n",
        "picture_link": "0Ez/G8frKaLjzpRt/UMsUr1sQwqIjNm"
    },
    {
        "title": "Grandma Smith's New Brunswick-Style Turkey Stuffing",
        "ingredients": [
            "3 potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 celery stalks, finely chopped ADVERTISEMENT",
            "1 large onion, minced ADVERTISEMENT",
            "2 tablespoons dried summer savory ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "6 slices bread, cut into cubes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two, then mash.\nMelt the butter in a skillet over medium heat; cook the celery and onion in the butter until the onion has turned translucent, 5 to 7 minutes. Fold into the mashed potatoes along with the savory, and allow to cool until just warm.\nPlace the cooled mashed potatoes into a large bowl, and stir in the beaten egg. Gently fold in cubed bread, then season to taste with salt and pepper. Refrigerate until ready to use.\nUse as a stuffing for turkey, or bake in buttered loaf pans at 350 degrees F (175 degrees C) for 30 to 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Johnson Family Cinnamon Rolls",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons nonfat dry milk powder ADVERTISEMENT",
            "3 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the water, oil, dry milk powder, 3 1/2 tablespoons sugar, salt, flour, and yeast into a bread machine in the order recommended by the manufacturer. Run the machine on the Dough cycle. At the end of the cycle, remove the dough and place it on a floured work surface.\nMix 1/3 cup of sugar with the cinnamon in a bowl, and set aside. Spray a 9x13 inch pan with cooking spray.\nRoll the dough out into a 10x15 inch rectangle. Spread the softened butter over the dough and sprinkle evenly with the sugar-cinnamon mixture. Roll up the dough from the long side into a tight roll. Cut the roll into 12 slices about 3/4 inch thick and place the slices into the prepared baking pan with the rolls barely touching each other. Cover with a cloth, and let rise in a warm place until doubled, 30 to 60 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake the rolls in the preheated oven until the tops of the rolls are golden brown, 15 to 20 minutes.\n",
        "picture_link": "yO3gEUXJH3LqKkPBYUJ7QQguKWE46dK"
    },
    {
        "title": "Double Dare Peaches",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 habanero peppers, seeded and halved ADVERTISEMENT",
            "8 fresh peaches - peeled, pitted and sliced ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 gallon vanilla ice cream ADVERTISEMENT",
            "1/4 cup crushed jalapeno and habanero peanut brittle (such as Klondike Candies®) (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium-low heat. Add the habanero peppers, and cook 5 to 8 minutes, stirring frequently. Remove and discard the peppers, then stir the peaches into the flavored butter. Increase the heat to medium-high. Cook and stir until the peaches begin to sizzle in the butter, then stir in the brown sugar and cinnamon. Continue stirring until the peaches are tender and the sugar has turned into a golden brown glaze, 3 to 5 minutes more.\nSpoon the peaches into individual bowls. Scoop the ice cream over the peaches, and sprinkle with peanut brittle to serve.\n",
        "picture_link": "TT62ejfqO1d9ah.cRpGm7jr13RCSd4i"
    },
    {
        "title": "Chicken Things",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - cut into cubes ADVERTISEMENT",
            "1/2 cup Worcestershire sauce ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In an electric skillet, combine the chicken cubes, Worcestershire sauce, 1/2 cup of honey, salt and pepper. Let sit for a minute to mingle the flavors, then turn the heat to 400 degrees F (200 degrees C). If using a regular skillet, turn the heat to medium-high.\nCook chicken for 20 minutes, stirring occasionally to prevent sticking. Drain off juices, and then add the remaining honey. Continue cooking until the sauce becomes thick and sticks to the chicken.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Standard Greek Salad",
        "ingredients": [
            "5 cucumbers, sliced ADVERTISEMENT",
            "5 large tomatoes, coarsely chopped ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "1 (4 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "1 (2.25 ounce) can pitted green olives, chopped ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together cucumbers, tomatoes, red onion, feta cheese, and green olives. Sprinkle with red wine vinegar. Refrigerate until serving.\n",
        "picture_link": "ByCFJOv/qLUYDCnA5EEX7Q.r4IHLAlu"
    },
    {
        "title": "Mindy's Berry Nice Smoothie",
        "ingredients": [
            "1/2 cup vanilla soy milk ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "2 cups frozen mixed berries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine soy milk, orange juice, wheat germ and frozen berries. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "g.x5GMdkdsNJ0L84tL0vvzvmAcpEg5C"
    },
    {
        "title": "Salmon in Oyster Sauce",
        "ingredients": [
            "2 tablespoons oil ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "3 green onions, sliced ADVERTISEMENT",
            "1/4 cup oyster sauce ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 pounds salmon fillets ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons warm water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a medium skillet over medium heat. Stir in garlic and brown sugar, and cook until garlic is lightly browned. Stir in green onions, and cook until tender. Mix in oyster sauce and water.\nPlace salmon fillets into skillet, and reduce heat to medium low. Spoon sauce mixture over fillets. Cook 10 to 15 minutes, until fish is easily flaked with a fork.\nRemove fish from skillet, and set aside. Mix cornstarch and warm water into the remaining sauce mixture. Stir until thickened to desired consistency. Pour over salmon to serve.\n",
        "picture_link": "FBfozcQooeAPgSLqQ7CZkzdSWlFSQVy"
    },
    {
        "title": "Rice Crust for Pizza",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked long-grain white rice ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup shredded part-skim mozzarella cheese ADVERTISEMENT",
            "1/8 teaspoon hot pepper sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water and rice in a medium saucepan, and bring to a boil. Cover, reduce heat to low, and simmer for 20 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nIn a medium size mixing bowl, mix together cooked rice, beaten egg, mozzarella cheese, and Tabasco sauce. Press mixture evenly into a lightly greased 12 inch pizza pan, covering bottom and sides.\nBake in preheated oven for 4 minutes, or until set. Remove crust from oven, and let cool slightly before layering with your favorite sauce and other goodies.\n",
        "picture_link": "gVifwLpsOdiuI3DpERiGdijgrMyhnxa"
    },
    {
        "title": "White Barbeque Sauce",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the water, butter, vinegar and salt into a jar and screw the lid on tight. Shake vigorously until well blended.\nUse on chicken or turkey when grilling. Baste every 15 minutes, until meat is cooked through.\n",
        "picture_link": "bSAYG5Iz1l./v5IU8XERw5V8sX8hoGW"
    },
    {
        "title": "Crumbed Avocado Steak",
        "ingredients": [
            "4 Scotch fillets (chuck eye) ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups fresh bread crumbs ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 avocado - peeled, pitted and sliced ADVERTISEMENT",
            "Mustard Sauce ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/2 cup butter, diced and softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound the steaks out to 1/2 inch thickness.\nCoat steaks lightly with flour seasoned with salt and pepper. Dip steaks into lightly-beaten eggs, then coat with combined breadcrumbs and parsley, pressing on firmly. Place steaks on to tray, and refrigerate until ready to cook.\nIn a large frying pan, heat 1/4 cup butter and oil over medium-high heat. Cook steaks until golden brown, and cooked to desired doneness. Remove from pan, and keep warm.\nIn a metal bowl, whisk together egg yolks, lemon juice, salt, pepper, and mustard. Place the bowl over simmering water, and stir until sauce is thick and creamy. Whisk in the remaining 1/2 cup softened butter, and remove from heat.\nPlace steaks onto serving plates, place two slices of avocado on each steak, and spoon the Mustard Sauce over each one.\n",
        "picture_link": "djJMKQffldmgGVZIbJjkax7z5Erbqu."
    },
    {
        "title": "Eva Claiborne's Hen and Dressing",
        "ingredients": [
            "1 (6 pound) whole chicken ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "2 stalks celery ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 (9x9 inch) pans cornbread, cooled and crumbled ADVERTISEMENT",
            "12 biscuits, crumbled ADVERTISEMENT",
            "2 cups diced celery ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "1 tablespoon dried sage ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "1 dash crushed red pepper ADVERTISEMENT",
            "9 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken, 1 onion, 2 stalks celery, and salt in a large pot with enough water to cover. Bring to a boil. Reduce heat, and gently boil 90 minutes, or until chicken meat falls easily from the bone. Drain, reserving broth. Chop chicken, and set aside.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a large baking dish.\nIn a large bowl, mix crumbled cornbread, crumbled biscuits, 2 cups celery, 2 large onions, sage, poultry seasoning, seasoned salt, and red pepper. Stir in eggs and reserved chicken broth. The mixture should be very thin.\nTransfer mixture to the prepared baking dish. Bake 45 minutes in the preheated oven, stirring often.\nMix chicken into the dressing mixture. Continue baking 15 minutes, until lightly browned.\n",
        "picture_link": "pi/SypuNcSgdaxb7DxOvW7shCkl829i"
    },
    {
        "title": "Shudderuppers",
        "ingredients": [
            "1 (14 ounce) package individually wrapped caramels, unwrapped ADVERTISEMENT",
            "1 (10.5 ounce) package large marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Build a nice fire and let the wood burn down into coals. This takes about an hour.\nThread a marshmallow onto a stick, then thread a caramel candy onto the stick in front of the marshmallow. Roast over the coals from the fire until the marshmallow is the desired doneness, but not on fire. Pull the marshmallow up over the caramel so that it is inside. Let cool and enjoy!\n",
        "picture_link": "FJqenunJAUlZ1rJxv3QqLBH2aVu1lQy"
    },
    {
        "title": "Pork and Hominy Stew",
        "ingredients": [
            "1 (2 pound) pork roast, diced ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "salt and pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 (15.5 ounce) cans white hominy ADVERTISEMENT",
            "20 dried chile de arbol peppers ADVERTISEMENT",
            "water ADVERTISEMENT",
            "1 1/4 cups finely chopped onion ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "12 corn tortillas, warmed ADVERTISEMENT",
            "2 limes, quartered ADVERTISEMENT",
            "1 bunch fresh cilantro, chopped ADVERTISEMENT",
            "1 1/2 cups shredded cabbage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat; add diced pork, cumin, and salt and pepper to taste. Cook, stirring frequently, until evenly browned.\nTransfer pork to a large pot. Stir in hominy and 3 cups water. Cook over medium heat for 1 hour.\nWhile pork and hominy are cooking, place chiles in a small saucepan with 2 cups water. Boil for 45 minutes, covered. Drain, and remove stems. Place chiles in a blender with 1/4 cup water, onion, and garlic. Blend until smooth (you may still see seeds). Set aside.\nServe pork and hominy soup in bowls, garnished with lime juice, cilantro, cabbage. For spicy soup, stir one teaspoon of chile into each bowl of soup.\n",
        "picture_link": "2jSC489gitchTtv69AcxsoklX6peUfK"
    },
    {
        "title": "Friendship Fruit Starter",
        "ingredients": [
            "1 (15 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "1 (15 ounce) can apricot halves, drained ADVERTISEMENT",
            "1 (15 ounce) can sliced peaches, drained ADVERTISEMENT",
            "1 (10 ounce) jar maraschino cherries, drained ADVERTISEMENT",
            "1 1/4 cups brandy ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large glass jar, combine drained pineapple chunks, drained apricot slices, drained sliced peaches, drained maraschino cherries, brandy and sugar. Stir gently with wooden spoon. Cover and let stand at room temperature for 3 weeks, stirring at least twice a week. Drain and reserve the liquid - This liquid is your starter for the Thirty Day Friendship Cake.\n",
        "picture_link": "QyQNXEUc.CygkjXkTFAxfLb3.GKYoXO"
    },
    {
        "title": "Minty Green Bean Salad",
        "ingredients": [
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 pound fresh green beans ADVERTISEMENT",
            "4 cloves garlic, thinly sliced ADVERTISEMENT",
            "2 slices onion, chopped ADVERTISEMENT",
            "1 sprig fresh mint leaves ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1/2 tablespoon minced garlic ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon prepared mustard ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, bring the water and sugar to a boil, and cook the green beans 10 minutes, or until tender but crisp; drain.\nTransfer green beans to a medium bowl, and mix with garlic, onion, and mint.\nIn a small container with a lid, mix olive oil, cider vinegar, garlic, basil, mustard, salt, and pepper. Shake until well blended. Toss into the green bean mixture.\n",
        "picture_link": "rHszO6HBVcVcyHkDTfRlrVbuf3BHL5m"
    },
    {
        "title": "Laurie's Tequila Marinade",
        "ingredients": [
            "1 cup tequila ADVERTISEMENT",
            "1 cup Worcestershire sauce ADVERTISEMENT",
            "1 cup teriyaki sauce ADVERTISEMENT",
            "1 dried jalapeno pepper, seeded ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine tequila, Worcestershire sauce, teriyaki sauce, dried pepper, black pepper and salt. Blend until smooth. Pour over your favorite cut of meat and marinate for 8 to 24 hours.\n",
        "picture_link": "YT9av6EcCTlo1mP5HRbQPZMVDwniLcK"
    },
    {
        "title": "Sweet and Sour Meatballs V",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1 cup fresh bread crumbs ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1/3 cup finely chopped onion ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 (12 ounce) bottles chile sauce ADVERTISEMENT",
            "1 cup grape jelly ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine the milk and bread crumbs. Add ground beef, onion, egg, salt and pepper. Mix thoroughly and form into 1 inch balls.\nIn a large saucepan, combine chili sauce, grape jelly and water; bring to a simmer. Gently drop the meatballs into the chili sauce mixture and simmer for about 1 hour. Occasionally skim off excess fat, as necessary.\nStir in sour cream just before serving. Remove from heat before sour cream comes to a boil.\n",
        "picture_link": "/UOiEv4GyD.lGOGp804X0Bh1n5VJSpu"
    },
    {
        "title": "Di's Buffalo Wings",
        "ingredients": [
            "24 chicken drumettes ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "4 cups oil for frying ADVERTISEMENT",
            "2/3 cup unbleached all-purpose flour ADVERTISEMENT",
            "2/3 cup cornmeal ADVERTISEMENT",
            "1 teaspoon coarse salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon garlic powder, divided ADVERTISEMENT",
            "1/4 teaspoon onion powder to taste ADVERTISEMENT",
            "1 1/2 teaspoons Italian-style seasoning ADVERTISEMENT",
            "1 stick unsalted butter ADVERTISEMENT",
            "1 cup hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken drumettes and buttermilk in a large bowl. Soak drumettes approximately 30 minutes.\nHeat oil in deep-fryer to 375 degrees F (190 degrees C).\nIn a medium bowl, sift together flour and cornmeal. Mix in coarse salt, black pepper, cayenne pepper, garlic powder, onion powder and Italian-style seasoning. Dip the drumettes in the flour mixture, then place in the hot oil. Fry until golden brown, 12 to 13 minutes. Remove from oil and drain on paper towels.\nMelt butter in a medium saucepan over low heat. Blend in the hot pepper sauce. Remove from heat and use for dipping the fried drumettes.\n",
        "picture_link": "Jc1Tb6wvXJylLrJMVlW1fIhjypZynhW"
    },
    {
        "title": "Basboosa",
        "ingredients": [
            "1 1/2 cups semolina flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3 tablespoons flaked coconut ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "6 whole almonds, split in half ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "2 tablespoons rose water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the semolina flour, 1/2 cup of sugar, yogurt, oil, coconut, and baking powder. Set aside for 30 minutes.\nIn a small saucepan over medium-high heat, stir together the water, 1 3/4 cups sugar, and rosewater. Bring to a boil, and boil for 3 or 4 minutes. Remove from heat, and set aside to cool to room temperature.\nPreheat the oven to 350 degrees F (175 degrees C). Spread the semolina batter into the bottom of a 9x13 inch baking pan. Slice into squares or diamonds, and place on almond half onto each piece.\nBake for 20 minutes in the preheated oven, or until light brown. Switch the oven setting to broil, and broil until the top is golden, 2 to 3 minutes. Remove from the oven, and pour the syrup over the squares. Serve warm.\n",
        "picture_link": "Lyn9DByBPO7sNHXEnUWzi6FD7VElcUe"
    },
    {
        "title": "Spicy Pineapple Sauce",
        "ingredients": [
            "1 (20 ounce) can crushed pineapple in heavy syrup, drained with syrup reserved ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "3/4 cup orange juice ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix the crushed pineapple, cornstarch and ground ginger. Gradually stir in enough of the reserved pineapple juice to make the mixture smooth.\nIn a medium saucepan over medium heat, blend orange juice and maple syrup. Cook and stir 5 minutes, until clear and thickened. Mix in the pineapple mixture. Continue to cook and stir until well blended and thick, about 15 minutes.\n",
        "picture_link": "DNWN3hI.zPvRgZCtlsbUKm5SLkWfhm."
    },
    {
        "title": "Tough Buck Barbecue",
        "ingredients": [
            "4 pounds venison ribs ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons dark molasses ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add ribs and bay leaves, reduce heat, and simmer for 2 hours.\nTo prepare the barbecue sauce: While meat is simmering, heat butter in a large heavy skillet over medium high heat. Saute onion and celery until tender. Stir in water, ketchup, lemon juice, vinegar, Worcestershire sauce, brown sugar and molasses. Season with chili powder and black pepper. Reduce heat, and simmer for 2 hours.\nPreheat oven to 250 degrees F (120 degrees C). Drain meat, and arrange in a roasting pan. Sprinkle with salt, and cover with barbecue sauce. Roast in preheated oven for 2 hours, basting every 1/2 hour.\n",
        "picture_link": "/MnyGOUOC0mZAXOBEi3Ol57echtaqA6"
    },
    {
        "title": "Strawberry Kiwi Milkshakes",
        "ingredients": [
            "4 cups sliced fresh strawberries ADVERTISEMENT",
            "4 cups sliced kiwifruit ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "4 cups vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the strawberries, kiwi, milk, and ice cream in a blender (in batches, if necessary), and blend until smooth. Pour into tall cups, and enjoy!\n",
        "picture_link": "0AjGGXG9VXoo59aYAiODADvPcUGBOuO"
    },
    {
        "title": "Butter Balls I",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F and grease cookie sheets.\nCream butter.\nAdd eggs, sugar and vanilla. Mix well.\nAdd sifted dry ingredients. Stir until well blended.\nCut dough into pieces about 2 inches by 2 inches. Dip in white sugar. Roll dough into palm of hand until round. Dip in brown sugar and place on greased cookie sheet about 2 inches apart.\nBake at 400 degrees F for about 10 minutes or until light brown.\n",
        "picture_link": "EL9mhDGCQtqkWHiLcn47zWwlMGVJvgm"
    },
    {
        "title": "Tex-Mex Potatoes",
        "ingredients": [
            "4 baking potatoes ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (16 ounce) can chili beans in spicy sauce, undrained ADVERTISEMENT",
            "1 tablespoon vegetarian Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon minced jalapeno peppers ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scrub potatoes and prick in several places with toothpick or sharp knife. Place on paper towel in microwave and cook at high power for 8 minutes Turn and rotate potatoes and cook for another 8 to 10 minutes or until tender. Alternately you can bake potatoes in a 400 degrees F (200 degrees C) oven for about 1 hour or until tender\nOver medium high, heat oil in a medium skillet. Saute onions and bell peppersuntil softened. Stir in beans, Worcestershire sauce, and jalapeno peppers. Reduce heat to low, cover and simmer for 5 to 6 minutes.\nSplit potatoes and top with bean mixture. Sprinkle with cheese.\n",
        "picture_link": "STpADpI315295jFxgFZWh5Zu9APLhDW"
    },
    {
        "title": "Divinity Cookies",
        "ingredients": [
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine dry ingredients. Cream sugar, shortening, egg and vanilla. Mix dry ingredients into creamed mixture and blend in nuts.\nRoll into balls, place on cookie sheet and flatten with a fork. Bake at 350 degrees F (175 degrees C) for 10 to 12 minutes.\n",
        "picture_link": "dp1DshDKud2ee9LQA4CWMWIcZIAP4r."
    },
    {
        "title": "Muesli Bars I",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1/3 cup chopped hazelnuts ADVERTISEMENT",
            "1/3 cup shredded coconut ADVERTISEMENT",
            "1/3 cup sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 11x7 inch baking pan.\nIn medium sauce pan, over low heat, combine butter or margarine, brown sugar and honey. Cook, stirring, until butter or margarine is melted and sugar is dissolved. Remove from heat. Add oats, nuts, coconut and sesame seeds. Mix with a wooden spoon until well combined. Press mixture evenly into the prepared baking pan.\nBake for 15 to 18 minutes in the preheated oven, until the top is golden brown. Let cool in the pan and cut into bars.\n",
        "picture_link": ".zZ40dVxm/MjBoe5ngMm.Rp7htc9uiy"
    },
    {
        "title": "Fruity Gelatin Salad",
        "ingredients": [
            "7 fluid ounces lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "1 (3 ounce) package lime flavored Jell-O® mix ADVERTISEMENT",
            "8 ounces cream cheese ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "1 teaspoon mayonnaise ADVERTISEMENT",
            "1 cup frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a non-reactive sauce pan, combine the carbonated beverage and marshmallows; heat until dissolved stirring constantly. Add gelatin and stir until dissolved.\nAdd cream cheese and blend by hand or with electric mixer until smooth.\nAdd pineapple and juice, nuts, mayonnaise and whipped topping. Pour into 7x11 dish, chill until set.\n",
        "picture_link": "0ZkCLqvNW2alPTl49OwMqpf2EieQbi6"
    },
    {
        "title": "Oatmeal-Currant Scones",
        "ingredients": [
            "1/4 cup orange juice ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cup dried currants ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 cup unsalted butter, cubed ADVERTISEMENT",
            "1 1/3 cups cold milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nHeat the orange juice and the water in a small pan, add the currants. Simmer the mixture for 1 minute, then let it sit until it cools slightly.\nIn a food processor, grind the oats with the flour, salt, baking powder, baking soda, and sugar. Add the butter. Run the machine in short spurts until the mixture has the consistency of sand. Transfer the mixture to a large mixing bowl.\nAdd milk and orange/currant mixture to the large mixing bowl. Stir until the mixture begins to hold together.\nForm the dough into a large ball with your hands, adding a bit of milk if necessary. Press or roll out the ball of dough until it is 1 inch thick. Cut the dough into 16 squares or triangles.\nBake the scones on an ungreased baking sheet for 15 minutes or until they are lightly browned on the edges.\n",
        "picture_link": "S9BV2umP8mdw4aod.hlSmQ8AlKBrjb6"
    },
    {
        "title": "Butter Crisps",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together the butter and cream cheese. Gradually add sugar and egg continue beating until blended.\nAdd flour and baking powder gradually to butter/cream cheese mix. Chill dough 1-2 hours.\nRoll out on floured board and cut in desired shapes. Bake approximately 12 minutes or until light brown at 350 degrees F (175 degrees C). Frost with desired frosting.\n",
        "picture_link": "cNLRp9Zjm/iCALcwm370I.zjgSDmXY."
    },
    {
        "title": "Creamy Guilt-Free Fudge",
        "ingredients": [
            "2/3 cup low-fat sweetened condensed milk ADVERTISEMENT",
            "1 1/2 cups semi-sweet chocolate chips ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium-sized saucepan, melt chocolate chips in sweetened condensed milk over medium-low heat. Stir in vanilla and salt.\nPour chocolate mixture into ungreased 10 inch square pan. Chill several hours until set. Cut into squares.\n",
        "picture_link": "WsDIXpoRHz25fj9v9MNhyya0dr0Tl5i"
    },
    {
        "title": "Dad's Divinity",
        "ingredients": [
            "3 cups white sugar ADVERTISEMENT",
            "3/4 cup light corn syrup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 egg whites, stiffly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook syrup, sugar, and water to soft ball stage (a small amount dropped into cold water forms a soft ball).\nPour half of this mixture over stiffly beaten egg whites. Stir.\nCook remaining sugar mixture to brittle stage (a small amount dropped into cold water turns immediately brittle).\nAdd to previous mixture and beat until candy will hold its shape. Beat again by hand to re-aerate it. Drop by spoonfuls onto waxed paper. Allow to harden as it cools. Store in refrigerator with waxed paper between layers.\n",
        "picture_link": "BdjRL/5L71aa23EsqFZ9NIaLNiXhJZm"
    },
    {
        "title": "Stained Glass Cookies",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup molasses ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "5 3/4 ounces sourball hard candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, cream butter or margarine, brown sugar and molasses until smooth. Blend in water. Stir together flour, baking soda, salt, and spices. Gradually add flour mixture to creamed mixture; blend well.\nCover and chill for 1 hour.\nCut out paper stars, bells, or other christmas motifs. Trace onto a sheet of aluminum foil.\nRoll pieces of dough into ropes about 1/4-inch wide. Outline the designs with ropes of dough. Press ends lightly together.\nSeparate candies by color. In a blender or food processor, coarsely crush candies. Fill in dough outlines with the candies.\nBake at 350 degrees F (175 degrees C) for 4 to 5 minutes or until cookie is set and candy melts. Cool on baking sheet.\n",
        "picture_link": "bRU5r.b3gCa8XG4HlVWmPTum.nQ3td2"
    },
    {
        "title": "Dee's Date and Nut Bread",
        "ingredients": [
            "1 1/2 cups hot water ADVERTISEMENT",
            "1 1/2 cups dates, pitted and chopped ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease loaf pan.\nPour the hot water over the dates and let stand until cooled.\nSift the flour and baking soda together add the sugar and salt. Stir in the cooled dates and water. Add the melted butter, beaten egg vanilla and walnuts. Mix well. Pour batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 1 hour or until a toothpick insert near the center comes out clean. Let bread cool in pan for 10 minutes. Remove bread from pan and let cool on a wire rack.\n",
        "picture_link": "VtVaH/amXL4JyQJRSS829.wdAs.sSHe"
    },
    {
        "title": "Chocolate Mexican Wedding Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup ground pecans ADVERTISEMENT",
            "1/2 cup German sweet chocolate, grated ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup German sweet chocolate, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream the butter and 1/3 cup confectioner's sugar until light and fluffy. Add the vanilla extract.\nIn a separate bowl, combine the flour, ground pecans, 1/2 cup ground chocolate, cinnamon and salt; mix well.\nGradually add the dry ingredients to the creamed mixture.\nWrap dough in plastic wrap and chill 1 to 2 hours, or until firm.\nPreheat oven to 325 degrees F (180 degrees C).\nShape the dough into 1-inch balls. Place balls 1 inch apart on an ungreased baking sheet. Bake 15 to 18 minutes, or until the cookies are firm to the touch. Cool 1 minute on the baking sheet, then transfer to a wire rack.\nFor the coating, sift 1/2 cup of the confectioner's sugar and 1/4 cup of the ground cocoa into a shallow bowl. While cookies are still warm, roll them in the coating.\n",
        "picture_link": "QOTRuZzjeVKgw2QeuzsQboyRf5FkM.G"
    },
    {
        "title": "Roasted Pork, Fennel, and Onions",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup fresh sage ADVERTISEMENT",
            "1 1/2 tablespoons freshly ground black pepper ADVERTISEMENT",
            "2 teaspoons freshly ground cumin seed ADVERTISEMENT",
            "1 (3 pound) boneless pork loin roast - trimmed, rolled, and tied ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 bulbs fennel, trimmed, tops reserved ADVERTISEMENT",
            "1 1/2 cups orange juice ADVERTISEMENT",
            "4 red onions with peel, halved ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in a skillet over medium-high heat. Add 1/2 cup sage. Cook and stir until leaves are slightly crisp, about 1 minute. Remove leaves with a slotted spoon, and drain on paper towels. Cool, wrap in paper towels, and seal in a plastic bag. Set aside. Reserve the butter.\nMix the pepper and cumin in a small bowl. Rinse roast and pat dry; rub evenly with the pepper and cumin. Tuck remaining 1/2 cup sage leaves under the strings on the smooth (fattiest) side of the roast. Set the pork, herb side up, on a rack in a roasting pan.\nSpread olive oil in the bottom of a medium baking dish. Thickly slice fennel and place in the dish. Toss to coat with the olive oil, and drizzle with 3/4 cup orange juice. Place onions in the dish cut side down.\nPlace roast on the center rack in the preheated oven. Place fennel and onions on lower rack. Bake the pork and vegetables 1 hour, or until pork reaches a minimum internal temperature of 145 degrees F (63 degrees C) and vegetables are tender. Turn fennel once during bake time. Reserving drippings, transfer meat to a platter and keep warm; let stand at least 10 minutes. Keep the vegetables warm in the baking dish.\nPlace the roasting pan with reserved drippings over high heat on the stove top, and mix in the reserved butter from Step 1, the remaining 3/4 cup orange juice, stock, and vinegar. Bring to a boil, and stir to scrape up any browned bits in the pan. Cook, stirring often, 10 minutes, or until reduced by about 1/2.\nArrange onions and fennel around the pork. Garnish with fennel tops, sprinkle with the fried sage leaves, and season with salt to serve.\n",
        "picture_link": "qrlUU90Lb9oONLnRN.3Bhha9T.Qmn7u"
    },
    {
        "title": "Cranberry Salad V",
        "ingredients": [
            "1 (3 ounce) package lemon flavored Jell-O® mix ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 (12 ounce) package fresh cranberries ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop cranberries, celery, and walnuts lightly in a food processor.\nMix gelatin, water, and sugar. Combine cranberry mixture, gelatin mixture, and pineapple (with juice) and mix thoroughly. Pour into mold and refrigerate to set.\nServe on leaf of lettuce with a dollop of mayonnaise.\n",
        "picture_link": "uEKBQUWbvWs6CcrwKujIOe7U5O/8aNO"
    },
    {
        "title": "Vegetable Swiss Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - cooked ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables, thawed ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "8 slices Swiss cheese ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl combine the chicken, mixed vegetables, soup, milk, garlic powder, salt and pepper. Mix all together. Pour a layer of the mixture into a 9x13 inch baking dish. Add a layer of Swiss cheese. Repeat layers and bake in the preheated oven for 1/2 hour or until heated through and cheese is melted and bubbly.\n",
        "picture_link": "DJbybaRKuLpasDtvpGTJwcypbVxN/R6"
    },
    {
        "title": "Chow Clusters",
        "ingredients": [
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 cups butterscotch chips ADVERTISEMENT",
            "2 (5 ounce) cans chow mein noodles ADVERTISEMENT",
            "1/2 cup cashew halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a heavy saucepan, combine chocolate and butterscotch chips. Melt, stirring constantly over low heat.\nRemove when melted and add chow mein noodles. Add cashews or peanuts. Mix quickly to coat Dip out tablespoons onto wax paper. Cool. (Can also melt chips in the microwave.)\n",
        "picture_link": "RHF.8ueFQUYOmwwHtfx1GIdrYZi2lsG"
    },
    {
        "title": "Chocolate/Peanut Butter Drop Cookies",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F. In large bowl, with mixer at medium speed, combine 1 cup flour and the next six ingredients until well mixed.\nIn small bowl, mix 3 tablespoons of flour and the remaining ingredients until well mixed (mixture will be crumbly).\nDrop chocolate dough by teaspoonfuls, 1 inch apart, onto cookie sheet. Top each with 1/2 teaspoon of peanut-butter dough. Dip a fork into flour and press gently across top of each cookie.\nBake 12 minutes or until firm. Move cookies to racks; cool.\n",
        "picture_link": "1Q6a58jj66bJeRCN9ZvU40KR8u8DUkC"
    },
    {
        "title": "Turkey Breast with Gravy",
        "ingredients": [
            "1 (6 pound) bone-in turkey breast ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "2 celery ribs, sliced ADVERTISEMENT",
            "1/4 cup butter, cut into 1 tablespoon sized pieces ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1 tablespoon lemon pepper ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "1 teaspoon rubbed sage ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (160 degrees C).\nPlace turkey breast in a shallow baking pan; coat outside of turkey with nonstick cooking spray. Tuck onion and celery in breast cavity; place butter between meat and skin. Pour chicken broth and white wine into bottom of pan.\nCombine lemon pepper, garlic powder, onion powder, sage, and paprika in a small bowl; rub seasoning mix over turkey.\nBake in preheated oven until a meat thermometer reads 175 degrees F (80 degrees C), basting every 30 minutes, 2-1/2 to 3 hours. Remove turkey and keep warm. Pour pan drippings into a cup and discard grease.\nCombine flour and water in a saucepan until smooth. Pour in pan drippings and chicken bouillon. Bring to a boil over medium heat, stirring constantly, and cook until thickened, about 2 minutes. Slice turkey and serve with gravy.\n",
        "picture_link": "ZnOBCSAfaGJgU9M0sB5lZLV1xtD2D1."
    },
    {
        "title": "Fresh Green Beans with Heaven Sauce",
        "ingredients": [
            "1 pound fresh green beans, trimmed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 teaspoon sriracha hot sauce ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add green beans, cover, and steam until tender, 2 to 6 minutes.\nMelt butter in a saucepan over medium heat; cook and stir onion and garlic for 2 minutes. Add sesame seeds; cook and stir until sesame seeds are golden brown, 3 to 5 minutes.\nMix soy sauce, mayonnaise, sriracha hot sauce, and allspice into onion mixture. Add green beans and toss to coat; season with salt and pepper.\n",
        "picture_link": "gGq7GKNj4K6Y9X1pDxPCmYGesUsDXle"
    },
    {
        "title": "Tonya's Rich and Creamy Beef Stroganoff",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3/4 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 pound beef sirloin, cut into 1-inch cubes ADVERTISEMENT",
            "1 (10.5 ounce) can condensed beef consomme with gelatin added, divided ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper, or to taste ADVERTISEMENT",
            "3 dashes hot pepper sauce (such as Tabasco®), or to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large heavy pot over medium-high heat; cook and stir onion until softened, about 5 minutes. Stir in mushrooms and continue to cook and stir until mushrooms are soft and liquid has evaporated, about 5 more minutes. Transfer onion and mushrooms to a bowl.\nCook and stir beef sirloin cubes in the same skillet over medium heat until the cubes are browned on all sides and liquid has evaporated, about 10 minutes.\nPour 2/3 of the beef consomme into the skillet; scrape up and dissolve any brown bits from the bottom of the skillet. Bring mixture to a boil; set remaining consomme aside.\nMix in garlic, ketchup, Worcestershire sauce, salt, black pepper, and hot sauce. Reduce heat to low and simmer beef mixture until tender, at least 30 minutes. Simmer longer for more tender beef.\nWhisk remaining 1/3 can beef consomme with flour in a small bowl until smooth; stir into the beef mixture, return to a boil, and simmer the meat and sauce until thickened, 2 to 3 more minutes. Stir in cooked onion and mushrooms and cook until heated through.\nRemove from heat, stir in sour cream, and serve.\n",
        "picture_link": "ay5lTo5jVze024v9q5RrUrn0AQbcjYS"
    },
    {
        "title": "Lower Fat Amish Macaroni Salad",
        "ingredients": [
            "1 (12 ounce) package elbow macaroni ADVERTISEMENT",
            "4 hard-cooked eggs, chopped ADVERTISEMENT",
            "3 stalks celery, minced ADVERTISEMENT",
            "1 (6 ounce) package frozen peas, thawed ADVERTISEMENT",
            "2 cups low fat mayonnaise (such as Hellmann's® Low Fat) ADVERTISEMENT",
            "3 tablespoons prepared yellow mustard ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons white vinegar ADVERTISEMENT",
            "3/4 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain and set aside to cool.\nStir eggs, celery, and peas together in a large bowl. Whisk low fat mayonnaise, yellow mustard, sugar, vinegar, celery seed, and salt in a separate bowl, dissolving the sugar. Pour dressing over vegetables and stir in macaroni until thoroughly coated with dressing. Cover and refrigerate at least 2 hours before serving.\n",
        "picture_link": "Jxl/9oZfIL4SQHaAZc/FPzjSKeM88gS"
    },
    {
        "title": "Healthier No Bake Cookies I",
        "ingredients": [
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/2 cup low-fat (1%) milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup crunchy peanut butter ADVERTISEMENT",
            "3 cups quick-cooking oats ADVERTISEMENT",
            "1/2 cup unsweetened coconut ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sugar, milk, butter, and cocoa in a saucepan. Bring to a boil and cook until sugar dissolves, about 1 1/2 minutes. Remove from heat and stir in peanut butter, oats, coconut, and vanilla extract. Roll dough into walnut-sized balls and place on waxed paper. Let cool until hardened.\n",
        "picture_link": "d8XPBlMBt6TYfqNz.Nj9EmavZOp.D/6"
    },
    {
        "title": "Greek Salad with Spinach & Feta Chicken Sausage",
        "ingredients": [
            "1 (12 ounce) package al fresco® Spinach & Feta Chicken Sausage ADVERTISEMENT",
            "6 cups romaine lettuce hearts, cut or torn into bite size pieces ADVERTISEMENT",
            "1/2 cucumber, skinned and cut on diagonal ADVERTISEMENT",
            "6 pitted kalamata olives ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "1/2 red onion, sliced into strips ADVERTISEMENT",
            "2 medium tomatoes, cut into wedges ADVERTISEMENT",
            "1/2 cup Greek Goddess salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grill the al fresco Spinach & Feta Chicken Sausage over a medium-high grill, 5 minutes per side.\nSlice the sausage on the diagonal into 1/4 inch thick slices.\nSet up the salad in a serving bowl or platter and arrange the grilled sausage slices over the romaine lettuce.\nTop with the cucumber, olives, feta cheese, red onions, tomatoes.\nToss with Greek Goddess Dressing. Serve immediately.\n",
        "picture_link": "lM3eWCNFmq/T6Kx5smg6y9MvAp7xosC"
    },
    {
        "title": "Ratatouille Fettuccine Alfredo",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 eggplant, diced ADVERTISEMENT",
            "1/2 cup onion, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 zucchini, peeled and diced ADVERTISEMENT",
            "1 yellow squash, diced ADVERTISEMENT",
            "1/2 cup chopped fresh mushrooms ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 tablespoon dried Italian seasoning ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (12 ounce) package dry fettuccine pasta ADVERTISEMENT",
            "1 (16 ounce) jar Alfredo sauce ADVERTISEMENT",
            "1 cup canned pumpkin puree ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 2 1/2-quart baking dish with cooking spray.\nHeat olive oil in a large skillet over medium heat; cook and stir eggplant, onion, and garlic until softened, about 8 minutes. Stir in diced tomatoes, zucchini, yellow squash, mushrooms, green bell pepper, and Italian seasoning; season with salt and black pepper. Bring the mixture to a boil and reduce heat to low; simmer until vegetables are tender, about 20 minutes.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in fettuccine, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Drain.\nMix Alfredo sauce with pumpkin in a bowl until smooth. Spread fettuccine into the prepared baking dish in an even layer, and spoon Alfredo sauce mixture over pasta. Top pasta with cooked vegetables, and sprinkle mozzarella cheese over the top.\nBake in the preheated oven until the casserole is bubbling and the cheese has melted, about 20 minutes.\n",
        "picture_link": "F1LPRbQ5HePLx55apaEnrULsqLNJaV6"
    },
    {
        "title": "Citrus Chicken Stir Fry",
        "ingredients": [
            "1 (16 ounce) package dry whole-wheat noodles ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "1/2 cup orange marmalade ADVERTISEMENT",
            "1/3 cup tamari sauce ADVERTISEMENT",
            "1 (1 inch) piece ginger root, peeled ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "3 tablespoons peanut oil ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast halves, cut into thin strips ADVERTISEMENT",
            "1 (16 ounce) bag frozen stir-fry vegetables, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil.\nStir in whole-wheat noodles and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through but is firm to the bite, 5 to 8 minutes. Drain well and set aside.\nCombine chicken stock, orange marmalade, tamari sauce, whole ginger root piece, and ground black pepper in a pot over medium-high heat.\nBring sauce to a boil and reduce heat to medium. Simmer until sauce reduces and thickens; about 20 minutes.\nRemove sauce from heat. Stir in lemon juice and set aside.\nHeat peanut oil in a large skillet over medium-high heat.\nCook and stir chicken in hot oil until golden, no longer pink in the center, and the juices run clear, 5 to 10 minutes.\nRemove chicken from skillet and set aside, leaving oil in the pan.\nCook and stir the stir-fry vegetables in the same skillet used for the chicken until vegetables are almost tender, 4 to 5 minutes.\nRemove ginger root piece from sauce and discard.\nStir chicken and sauce into vegetables and cook until heated through, 1 to 2 minutes.\nServe over whole-wheat noodles.\n",
        "picture_link": "qypbGIaAdquR0uHvbZ2vQemIsG9wcd2"
    },
    {
        "title": "Dried Cherry and Cranberry Sauce",
        "ingredients": [
            "1 1/2 cups cranberry juice cocktail ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "1 cinnamon stick, broken in half ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "6 ounces dried cherries ADVERTISEMENT",
            "1 (12 ounce) package fresh cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the cranberry juice cocktail, water, brown sugar, cinnamon stick, and allspice together in a saucepan; bring to a boil. Add the cherries to the cranberry juice mixture; cook another 2 minutes. Add the cranberries; continue cooking, stirring occasionally, until the cranberries pop, about 10 minutes. Remove from heat and chill in refrigerator 8 hours to overnight. Remove and discard cinnamon stick before serving.\n",
        "picture_link": "RxLJyNtiKVDTs3sy6YugctyniHR8L9e"
    },
    {
        "title": "Baked Apple Slices",
        "ingredients": [
            "1 Granny Smith apple - peeled, cored and sliced ADVERTISEMENT",
            "2 1/2 tablespoons water ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nSpread the apple slices into the bottom of a small baking dish. Whisk the water and cornstarch together in a small bowl; pour over the apple slices and gently stir. Sprinkle the sugar and cinnamon over the apple slices.\nCook in the preheated oven until the apples are tender, about 15 minutes.\n",
        "picture_link": "kl9FnGIsmc0ukewljTkPdhdEziar4mS"
    },
    {
        "title": "Pablito's Chicken Tacos",
        "ingredients": [
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 bunch fresh sorrel, chopped ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups masa harina ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "2 ounces butter, melted ADVERTISEMENT",
            "1/2 teaspoon vegetable oil ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup cubed skinless, boneless chicken breast meat ADVERTISEMENT",
            "1/2 bunch kale, stems removed and leaves coarsely chopped ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sour cream, sorrel, lime juice, 1 teaspoon salt, and sugar in a bowl until well combined. Refrigerate until ready to use.\nMix flour, masa harina, baking powder, and 2 teaspoons salt in the bowl of a stand mixer. Gradually pour butter and water into flour mixture while mixing at lowest speed; mix until a dough just starts to come together.\nTurn dough out onto a clean, flat surface and knead 3 to 4 times. Separate dough into 1 1/2 ounce balls, cover, and let rest for 1 hour.\nPress each dough ball in a tortilla press lined with parchment paper or plastic wrap; transfer each tortilla to a baking sheet.\nLightly coat a cast-iron pan with 1/2 teaspoon vegetable oil and heat over medium-high heat. Place a tortilla in the pan and cook until lightly golden, about 1 minute per side. Repeat with remaining tortillas.\nHeat 1/4 cup vegetable oil in a skillet over high heat. Stir in chicken; cook until browned around the edges, 4 to 6 minutes. Stir in onion, kale, 1 teaspoon salt, and pepper; reduce heat to medium-high. Cook, stirring often, until kale is wilted, 3 to 5 minutes. Remove from heat.\nSpoon chicken-kale mixture into each tortilla, top with sorrel sour cream, and serve.\n",
        "picture_link": "GgkvyDkmWUTFzIEoPAV3Hx4OVMGOO6a"
    },
    {
        "title": "Chicken Eggplant Stir-Fry",
        "ingredients": [
            "1/2 large eggplant, sliced into rounds ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves , cut into cubes ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "2 cups mushrooms, sliced ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle salt evenly over both sides of eggplant slices; set aside for 5 minutes. Cut eggplant into cubes.\nCook and stir chicken, garlic, and soy sauce together in a large skillet over medium heat until the chicken is nearly cooked through, 7 to 10 minutes.\nStir mushrooms and black pepper into the chicken mixture; continue cooking until the mushrooms brown, 2 to 3 minutes.\nHeat canola oil in a separate skillet over medium heat. Cook eggplant in hot canola oil until lightly browned; add to skillet with the chicken.\nStir spinach through the chicken and eggplant mixture; cook and stir until the spinach wilts, 2 to 3 minutes.\n",
        "picture_link": "vxPOp0/awAVaEkvi5JOU3XrNFObqL12"
    },
    {
        "title": "Chicken Pesto with Fettuccine and Spinach",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/4 pounds skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 1/2 cups Swanson® Chicken Broth ADVERTISEMENT",
            "1 (8 ounce) jar pesto sauce ADVERTISEMENT",
            "1 (7 ounce) package fresh baby spinach ADVERTISEMENT",
            "1/2 (16 ounce) box fettuccine, cooked and drained ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a 12-inch skillet over medium-high heat. Add the chicken and cook for 10 minutes or until well browned on both sides. Remove the chicken from the skillet.\nReduce the heat to medium. Add the onion and cook for 3 minutes or until tender, stirring occasionally. Stir in the broth and pesto sauce. Add the spinach. Cover and cook for 5 minutes or until the spinach is wilted.\nStir in the fettuccine. Return the chicken to the skillet. Cover and cook for 5 minutes or until the chicken is cooked through. Sprinkle with the cheese, if desired.\n",
        "picture_link": "AKX90qAcD0y2tD1IVPRWII08AaYFQZe"
    },
    {
        "title": "Portobello Stuffed Mushroom Burger",
        "ingredients": [
            "vegetable cooking spray ADVERTISEMENT",
            "4 portobello mushroom caps ADVERTISEMENT",
            "2 cups fresh spinach leaves ADVERTISEMENT",
            "1/4 cup shredded aged Cheddar cheese ADVERTISEMENT",
            "1/4 cup 1% cottage cheese ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "4 thin, multi-grain hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nSpray rounded ends of mushroom caps with vegetable spray and place oiled side down on baking sheet.\nPlace spinach in microwave-safe bowl, sprinkle with a few drops of water, and microwave on high for one minute. Chop cooked spinach; mix with Cheddar cheese, cottage cheese, garlic powder, and salt. Spread spinach mixture onto prepared mushroom caps.\nBake in preheated oven until the mushrooms are tender, about 12 minutes. Serve on hamburger buns.\n",
        "picture_link": "xRAxq63VLYBLxYeDHShzl7Cdfv2hGIG"
    },
    {
        "title": "Tiramisu Chocolate Mousse",
        "ingredients": [
            "2 tablespoons brewed espresso ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "3 1/2 ounces dark chocolate, broken into small pieces ADVERTISEMENT",
            "2 tablespoons Marsala wine or rum (optional) ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "2 tablespoons mascarpone cheese ADVERTISEMENT",
            "3/4 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine espresso and butter in the top of a double boiler over simmering water.\nPlace dark chocolate pieces in the espresso mixture; cook without stirring until chocolate starts to melt, about 3 minutes. Whisk chocolate and espresso mixture until well combined. Remove from heat and set aside.\nCombine Marsala, egg yolks, and sugar in a saucepan over medium-low heat, whisking constantly until frothy and thickened, 3 to 5 minutes. Remove from heat.\nStir mascarpone cheese into marsala mixture.\nCombine chocolate mixture with mascarpone mixture. Cool to room temperature.\nWhip heavy cream in a bowl until soft peaks form, 2 to 3 minutes.\nFold half of whipped cream into cooled chocolate mixture.\nFold second half of whipped cream into chocolate mixture. Cover with plastic wrap and chill in refrigerator for at least 2 hours.\n",
        "picture_link": "X7Bg1jQak9m1a9oMGWE5WZ7NCUXYPL6"
    },
    {
        "title": "Healthier Chuck's Favorite Mac and Cheese",
        "ingredients": [
            "8 ounces whole wheat elbow macaroni ADVERTISEMENT",
            "1 (8 ounce) package shredded reduced-fat Cheddar cheese ADVERTISEMENT",
            "12 ounces low-fat cottage cheese ADVERTISEMENT",
            "1 (8 ounce) container light sour cream ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup whole wheat bread crumbs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nStir together macaroni, shredded Cheddar cheese, cottage cheese, sour cream, Parmesan cheese, and salt and pepper in a 9x13-inch baking dish. Mix together bread crumbs and melted butter in a small bowl; sprinkle topping over macaroni mixture.\nBake until top is golden in the preheated oven, 30 to 35 minutes.\n",
        "picture_link": "ZPNvTio9IR6kCYN50eqwu37F72HyFHS"
    },
    {
        "title": "Creamy Scalloped Potatoes",
        "ingredients": [
            "1 (270 g) tub PHILADELPHIA Savory Garlic Cooking Creme Cream Cheese Product ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "3 pounds baking potatoes, peeled, very thinly sliced ADVERTISEMENT",
            "2/3 cup KRAFT 100% Grated Parmesan Cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nWhisk Cooking Creme, milk and pepper until well blended.\nLayer half each of the potatoes, Cooking Creme mixture and Parmesan in shallow 2-L casserole dish sprayed with cooking spray. Repeat layers; cover.\nBake 1 hour 15 min. or until potatoes are tender and sauce is hot and bubbly, uncovering after 45 min.\n",
        "picture_link": "h0Qw2Hm06VRWOlyS6fUViwjivyCa466"
    },
    {
        "title": "Dorothy Lynch® Style Salad Dressing",
        "ingredients": [
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon celery seeds ADVERTISEMENT",
            "1/4 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon cornstarch, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tomato soup, vegetable oil, sugar, vinegar, dry mustard, salt, celery seeds, black pepper, and garlic powder in a large jar with a lid. For thicker dressing, stir in cornstarch. Serve immediately or refrigerate overnight for best flavor.\n",
        "picture_link": ".wcECvvyTcr414pBZqZVwy4F/ZONugC"
    },
    {
        "title": "Jeri's Spicy Buffalo Wings",
        "ingredients": [
            "2 pounds chicken wings ADVERTISEMENT",
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon onion salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup hot pepper sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss chicken wings in a large bowl with apple cider vinegar, garlic salt, paprika, red pepper flakes, onion salt, and black pepper to coat; cover bowl with plastic wrap.\nMarinate chicken in refrigerator 1 to 4 hours.\nScatter flour over the chicken wings; toss to coat. Discard any remaining marinade.\nPreheat oven to 425 degrees F (220 degrees C).\nHeat shortening in a large skillet over medium-high heat; fry chicken in hot shortening until golden, 5 to 7 minutes per side.\nArrange fried chicken pieces onto a baking sheet.\nBake chicken in preheated oven until no longer pink at the bone and the juices run clear, about 20 minutes; remove chicken to a platter lined with paper towels to drain.\nMelt butter in a large skillet over medium heat. Cook garlic in melted butter until translucent, about 2 minutes.\nStir hot sauce into the butter and garlic mixture; reduce heat to low and simmer sauce 5 minutes. Transfer sauce to a large bowl.\nMove drained chicken in batches to the bowl with the sauce and turn to coat. Drizzle any remaining sauce over wings to serve.\n",
        "picture_link": "MH.1ZEliTF.PE5rrEIWfgOJ6L3Xumeq"
    },
    {
        "title": "Onion Jam",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "4 cups onion, coarsely chopped ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a heavy skillet over medium heat.\nStir sugar into vegetable oil with a wooden spoon, stirring constantly until mixture is a light caramel-color, about 10 minutes. Mixture will be very hot.\nStir onion, salt, and black pepper into sugar mixture. Onions will immediately start to caramelize. Stir frequently over medium heat until sugar has dissolved and onions are browned, about 15 minutes.\nPour red wine vinegar into onion mixture and simmer until mixture has a jam consistency, about 30 minutes. Let cool to serve.\n",
        "picture_link": "6ihNH3QGfk95QK11Z1x9z9B/JR1nVMi"
    },
    {
        "title": "Chef John's Pumpkin Bread",
        "ingredients": [
            "1/2 cup canned pumpkin puree ADVERTISEMENT",
            "1 cup warm water (100 to 110 degrees F/40 to 45 degrees C) ADVERTISEMENT",
            "1 tablespoon warm water (100 to 110 degrees F/40 to 45 degrees C) ADVERTISEMENT",
            "1/4 teaspoon active dry yeast ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 pinch pumpkin pie spice ADVERTISEMENT",
            "3 cups all-purpose flour, plus extra for dusting ADVERTISEMENT",
            "2 teaspoons cornmeal, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together pumpkin puree, 1 cup plus 1 tablespoon of warm water, yeast, salt, and pumpkin pie spice. Mix in flour with a spatula until the dough is fully mixed and all the flour is moistened. Cover bowl with a damp towel, and allow dough to rise for 12-16 hours.\nScrape dough onto floured surface with floured spatula; sprinkle dough with more flour. With your fingers, press dough out into a rough square about 1 inch thick. Fold all four sides of dough in towards center, then turn folded dough over and form into a round loaf.\nGenerously cover a sheet pan with cornmeal.\nPlace loaf on prepared sheet pan with seam sides down, dusting top and sides with flour, then place a floured towel over dough. Allow to rise until doubled in size, about 1-1/2 hours.\nPreheat oven to 425 degrees F (220 degrees C) and place a pan with 2 inches of water on the bottom rack. Just before baking, make a shallow slice (1/2 inch) across top of dough with a sharp knife.\nBake for 30 minutes in preheated oven. Turn pan around and bake for an additional 20 minutes, or until golden brown. Cool on a wire rack.\n",
        "picture_link": "FJdelr2DRepwJw3YOVhCbSYuIqG0ooy"
    },
    {
        "title": "Yummy Mango-Banana Milkshake",
        "ingredients": [
            "1/2 small mango - peeled, seeded and diced ADVERTISEMENT",
            "1 banana, cut in chunks ADVERTISEMENT",
            "1 scoop vanilla ice cream (optional) ADVERTISEMENT",
            "1 tablespoon white sugar, or to taste ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "1 pinch ground nutmeg, or to taste ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place mango, banana, and ice cream into a blender, and sprinkle with white sugar, cinnamon, and nutmeg. Pour in milk and place the lid on the blender. Blend until smooth, then pour into cups to serve.\n",
        "picture_link": "2GmUh074Q3VDr8HhwaM3UmHOcIdIenm"
    },
    {
        "title": "Shrimp Asopao",
        "ingredients": [
            "1 pound shrimp, peeled and deveined ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon adobo seasoning ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/2 green bell pepper, diced ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "1 small tomato, seeded and diced ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 1/2 cups short-grain rice ADVERTISEMENT",
            "7 cups water ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "crushed red pepper to taste ADVERTISEMENT",
            "3/4 cup frozen petite peas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the shrimp with salt, pepper, and adobo seasoning; set aside.\nHeat the olive oil in a large, deep pot over medium-high heat. Cook the green bell pepper, red bell pepper, tomato, and onion in the hot oil until the onion is soft. Mix in the garlic and tomato paste. Stir in the rice until coated. Pour in the water. Drop in the bay leaf. Bring the mixture to a boil; reduce heat to medium-low and simmer about 20 minutes. Add the seasoned shrimp and the peas. Cook until the shrimp is pink, about 5 minutes; remove from heat immediately.\n",
        "picture_link": "xSWHXjdrkduOXRVc9j3eXd60PuI7v.u"
    },
    {
        "title": "Not Your Mom's Mac and Cheese ",
        "ingredients": [
            "1 (16 ounce) package gemelli (small twisted pasta) ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 cup shredded fontina cheese ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 cup shredded white Cheddar cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/8 teaspoon paprika ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pinch chili powder ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup Italian-seasoned breadcrumbs ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the gemelli, and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Add olive oil, and toss pasta until coated; set aside.\nHeat a large skillet over medium-high heat and stir in the ground beef. Season with salt and black pepper. Cook and stir until the beef is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease. Set aside.\nPreheat an oven to 350 degrees F (175 degrees C).\nHeat 3 tablespoons butter and the flour in a large skillet over low heat. Cook and stir until the butter is melted and the flour is incorporated, then slowly whisk in the milk. Stir in the fontina cheese, sharp Cheddar cheese, white Cheddar cheese, and 1/4 cup Parmesan cheese; cook, whisking constantly, until cheese is melted and sauce is thickened, about 5 minutes. Season with paprika, nutmeg, garlic powder, cinnamon, and chili powder. Season to taste with salt and black pepper. Stir in the pasta and beef, and transfer mixture to a large baking dish.\nCombine 2 tablespoons butter, bread crumbs, and the remaining 2 tablespoons Parmesan cheese in a bowl. Sprinkle mixture over the pasta in the baking dish.\nBake in the preheated oven until bubbly, about 12 minutes, then set the oven on broil. Broil until lightly browned, about 3 more minutes.\n",
        "picture_link": "EIDrCR2HTwoTkljJ3bAdRHTFNOnrCLq"
    },
    {
        "title": "Chocolaty Peanut Butter Haystacks",
        "ingredients": [
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1/3 cup peanut butter ADVERTISEMENT",
            "1/2 cup toffee baking bits (such as Heath®) ADVERTISEMENT",
            "1 cup chow mein noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chocolate chips into a microwave-safe bowl and cook on High for 30 seconds; stir and repeat several times, just until the chips are melted. Add peanut butter, cook for 20 more seconds to warm the peanut butter, and mix thoroughly. Mix in the toffee bits and chow mein noodles; stir to coat the ingredients with the chocolate mixture.\nLine a baking sheet with parchment or waxed paper; drop the mixture onto the lined sheets by the tablespoon. Refrigerate until set.\n",
        "picture_link": "J.ksFbK/bfHBB2aAjEpiw8uuXPSQSYO"
    },
    {
        "title": "Cuban-Style Black Beans",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (15.5 ounce) can black beans, drained ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 sweet onion, chopped ADVERTISEMENT",
            "1/2 (12 ounce) can light beer ADVERTISEMENT",
            "1 tablespoon fresh chopped cilantro, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a skillet over medium heat; cook the garlic in the oil 15 seconds. Stir in the onion and green pepper; cook and stir 10 minutes. Pour in the black beans and beer; simmer until thick, about 15 minutes; garnish with cilantro.\n",
        "picture_link": "QtKJdxQ82tZXC/Wt93P8Kgps0yi8UhK"
    },
    {
        "title": "Bengali Dhal",
        "ingredients": [
            "1 cup red lentils ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup onion, thinly sliced, divided ADVERTISEMENT",
            "4 cloves garlic, coarsely chopped, divided ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "3/4 cup cherry tomatoes ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 (2 inch) whole serrano chile peppers (optional) ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 tablespoons chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash the lentils in a strainer. Combine the lentils and water in a saucepan over medium-high heat. Add half of the sliced onions and garlic, reserving the rest for later. Stir in the turmeric, bay leaf, tomatoes, and salt. Add the chiles, leaving them whole to add flavor or cut in half to add heat. When the mixture begins to boil, reduce the heat to a simmer. Cook until the lentils break apart and thicken slightly, about 20 minutes.\nMeanwhile, in a skillet, heat the vegetable oil over medium heat until the oil shimmers. Add the reserved sliced onions; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. Stir in the rest of the chopped garlic and cook, stirring constantly, until the garlic is fragrant and tender, about 2 minutes.\nPour the contents of the skillet into the cooked lentils and stir. Garnish with chopped cilantro.\n",
        "picture_link": "9AdnX7OljjqwnhwEXzpJVLtfuXtRPpi"
    },
    {
        "title": "High Altitude Meringue for Pie",
        "ingredients": [
            "1 tablespoon cornstarch ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a glass or ceramic bowl, stir together the cornstarch, sugar and salt. Mix in the water. Heat in the microwave until the mixture is thick and clear, about 2 minutes at full power. Set aside to cool slightly.\nBeat egg whites in a large glass or metal bowl until foamy. Gradually pour in the sugar mixture while continuing to whip the egg whites until thick and stiff enough to hold a peak. Cover pie filling completely with meringue, sealing to the edges. Bake as directed in the recipe, or in a preheated 450 degrees F (220 degrees C) oven until golden brown, 7 to 8 minutes.\n",
        "picture_link": "df3oCCZ9ICWSDNAE9NkTxIdyv7ZPJqq"
    },
    {
        "title": "Jennifer's Thai Curried Peanut Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "3 stalks celery, minced ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1/4 teaspoon red pepper ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "1/2 cup chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large sauce pan over medium heat. Cook the celery and onion in the butter, stirring frequently, for 5 minutes. Add the garlic and cook another 2 minutes. Stir in the flour, curry powder, and red pepper; cook and stir 1 minutes. Pour in the chicken broth and bring to a boil. Reduce heat to low and simmer 20 minutes, stirring frequently. Mix in the coconut milk and peanut butter; continue to heat while stirring until completely heated through. Remove from heat.\nPour the soup in small batches into a blender or food processor and blend until smooth. Pour into bowls and garnish with chopped peanuts to serve.\n",
        "picture_link": "Gq44JhMqYIsjOQg72JmTV9/gdJbRGdq"
    },
    {
        "title": "Grilled Gulf Shark",
        "ingredients": [
            "2 (8 ounce) shark steaks ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "sea salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the shark steaks in a shallow dish and pour milk over them to cover. Let stand for 2 hours, or refrigerate overnight.\nPrepare a grill for medium-high heat. Remove the shark steaks from the pan and pat dry. Discard leftover milk. Season the steaks with lemon juice, sea salt and pepper.\nGrill the steaks until meat is firm, about 15 minutes, turning once. Fish should appear white all the way through.\n",
        "picture_link": "8DmrFOOTqtaHtU2NTlyl3RLJLSfUgPa"
    },
    {
        "title": "Banana Mallow Pie",
        "ingredients": [
            "1 3/4 cups cold milk ADVERTISEMENT",
            "1 pkg. (4 serving size) JELL-O Vanilla Flavor Instant Pudding & Pie Filling ADVERTISEMENT",
            "2 cups JET-PUFFED Miniature Marshmallows ADVERTISEMENT",
            "1 cup thawed COOL WHIP Whipped Topping ADVERTISEMENT",
            "2 medium bananas, sliced ADVERTISEMENT",
            "1 (6 ounce) HONEY MAID Graham Pie Crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour milk into large bowl. Add pudding mix; beat with wire whisk 2 minutes. Let stand 5 minutes. Add marshmallows and whipped topping; stir gently until well blended.\nPlace banana slices in crust; cover with pudding mixture.\nRefrigerate at least 1 hour. Cut into 8 slices to serve. Store leftover pie in refrigerator.\n",
        "picture_link": "gWXbYFlORf.P/mC4iYqEE/ewDCzCF9q"
    },
    {
        "title": "Miracle Green Bean Casserole",
        "ingredients": [
            "1 (10.75 ounce) can low-fat condensed cream of broccoli soup, undiluted ADVERTISEMENT",
            "1/2 cup fat-free sour cream ADVERTISEMENT",
            "2 tablespoons creamy salad dressing, e.g. Miracle Whip ™ ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 (14.5 ounce) cans French-cut green beans, drained ADVERTISEMENT",
            "2 (14.5 ounce) cans cut green beans, drained ADVERTISEMENT",
            "2 cups Cheddar-flavored French-fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together the soup, sour cream, salad dressing, salt, and pepper in a large bowl. Gently stir in the French-cut green beans and the other green beans one can at a time. Fold in 1 cup of the fried onions. Pour the mixture into a casserole dish; cover with aluminum foil.\nBake in preheated oven 35 minutes. Remove the foil and stir the casserole. Top with the remaining cup of the fried onions and bake uncovered for an additional 5 minutes.\n",
        "picture_link": "O/VCrVEYbQHveYz7hcsO32GFA7.2huG"
    },
    {
        "title": "Classic Holiday Egg Nog",
        "ingredients": [
            "1 quart milk ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 eggs, beaten well ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the milk, sweetened condensed milk, eggs, vanilla extract, and salt in a large pitcher until well blended. Cover and refrigerate until chilled, at least 1 hour.\n",
        "picture_link": "OmFuKtEZRdowWbioo4cuU2x2W82o84O"
    },
    {
        "title": "Maille® Vinaigrette Dressing",
        "ingredients": [
            "1 tablespoon Maille® Old Style Mustard or Honey Dijon Mustard, or more to taste ADVERTISEMENT",
            "2 tablespoons balsamic vinegar, or more to taste ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil ADVERTISEMENT",
            "Splash of lemon juice ADVERTISEMENT",
            "Salt and pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix Maille(R) Old Style or Honey Dijon Mustard, balsamic vinegar, lemon juice and a pinch of salt until well blended.\nPour in oil, little by little, and mix until well blended. Add salt and pepper to taste. Serve over your favorite salad mix. Add a tasty cheese, some pecans, grapes or apple slices.\n",
        "picture_link": "jNRNqJj6CC6bxvq8/ZGL4CD4SxIblN6"
    },
    {
        "title": "All Day Venison Pot Roast",
        "ingredients": [
            "3 onions, chopped ADVERTISEMENT",
            "5 carrots, cut into 2-inch pieces ADVERTISEMENT",
            "1 cup chopped portobello mushrooms ADVERTISEMENT",
            "3 pounds venison rump roast ADVERTISEMENT",
            "2 garlic cloves, crushed ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "salt to taste (optional) ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.5 ounce) can condensed beef broth ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (1.25 ounce) envelope dry onion gravy mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange the onions, carrots, and mushrooms in the bottom of a slow cooker. Rub the venison rump roast with garlic, black pepper, and salt, then place on top of the vegetables. Mix the cream of mushroom soup, beef broth, water, and onion gravy mix in a bowl until gravy mix is dissolved; pour soup mixture over the roast.\nCook on High setting until roast is very tender, 8 to 10 hours. Slice roast before serving with gravy and vegetables.\n",
        "picture_link": "CA7csA8MH9kh5gd0HqvhyDa21uGFqGW"
    },
    {
        "title": "Scorpion Bowl",
        "ingredients": [
            "3 cups crushed ice ADVERTISEMENT",
            "2 fluid ounces gin ADVERTISEMENT",
            "1 fluid ounce dark rum ADVERTISEMENT",
            "2 fluid ounces 151 proof rum ADVERTISEMENT",
            "2 fluid ounces light rum ADVERTISEMENT",
            "2 fluid ounces vodka ADVERTISEMENT",
            "2 fluid ounces grenadine syrup ADVERTISEMENT",
            "8 fluid ounces fresh orange juice ADVERTISEMENT",
            "10 fluid ounces pineapple juice ADVERTISEMENT",
            "3 fluid ounces fresh lemon juice (optional) ADVERTISEMENT",
            "4 pineapple chunks ADVERTISEMENT",
            "8 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the crushed ice in a large pitcher and pour in the gin, dark rum, 151 proof rum, light rum, vodka, grenadine, orange juice, pineapple juice, and lemon juice. Stir well to mix, then pour into a large, decorative cocktail glass and garnish with pineapple, cherries, and straws.\n",
        "picture_link": "NyZ8D7YD6bU4i96Ez2eZKi9G81h2sQ2"
    },
    {
        "title": "Caribbean Beef Loin Steaks",
        "ingredients": [
            "1 fluid ounce coconut-flavored rum ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon white vinegar ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "4 slices onion ADVERTISEMENT",
            "6 (8 ounce) beef top sirloin steaks ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the rum, salt, pepper, cinnamon, powder, oregano, sage, vinegar, and lemon juice in a bowl; pour into a gallon-sized, resealable plastic bag. Add the onion and steaks to the marinade. Seal the bag, squeezing out as much air as possible. Allow to marinate in refrigerator 2 1/2 hours.\nHeat the olive oil in a large skillet over medium heat. Cook the steaks with the skillet covered to desired doneness, about 3 minutes per side for medium rare.\n",
        "picture_link": "U25G1hhUpu99TnWEFZCBGRYtQ02D4nO"
    },
    {
        "title": "Chocolate Chip Candy Cane Meringue Cookies",
        "ingredients": [
            "2 egg whites, room temperature ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons crushed candy canes ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 250 degrees F (120 degrees C). Line cookie sheets with parchment paper.\nBeat egg whites in a clean glass or metal bowl until foamy. Add salt and cream of tartar, and continue beating until soft peaks form. Gradually add sugar while continuing to beat to stiff peaks. When the meringue is stiff remove from the mixer. Stir in vanilla and fold in candy canes, chocolate chips and walnuts. Drop by heaping teaspoonfuls onto the prepared baking sheets. If you can't bake all of the cookies at once, store the extra in the refrigerator until the other ones are done.\nBake for 40 minutes in the preheated oven, or until dry enough to easily peel off of the cookie sheet. Cool cookies then store in an airtight tin.\n",
        "picture_link": "v/EHAmE5Lyde..cXZNnZHUuNSw02vua"
    }
]