[
    {
        "title": "French Onion Soup from Birds Eye®",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 (8 ounce) bag Birds Eye® Recipe Ready Chopped Onions ADVERTISEMENT",
            "4 cups beef broth ADVERTISEMENT",
            "1/2 teaspoon dried thyme leaves ADVERTISEMENT",
            "4 thick slices French or Italian bread, toasted ADVERTISEMENT",
            "4 slices Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in medium saucepan over medium heat and cook Recipe Ready Chopped Onions, stirring occasionally, 15 minutes or until golden brown. Add beef broth and thyme; bring to a boil over high heat. Simmer 5 minutes. Season, if desired, with salt and black pepper.\nArrange 4 oven-proof soup bowls on baking sheet and evenly fill with soup. Arrange toast in each bowl and top with cheese. Broil 1 minute or until cheese is bubbling.\n",
        "picture_link": "oRswSAtQBojrEb4b.712Pjcooc7.WlW"
    },
    {
        "title": "Peach Curd",
        "ingredients": [
            "3 fresh peaches, halved and pitted ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon rose water (optional) ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend peach halves in a blender until smooth; transfer to a large bowl.\nBeat sugar, eggs, egg yolks, lemon juice, and rose water into peach puree until incorporated.\nMelt butter in the top of a double boiler over simmering water; stir peach mixture into melted butter, stirring constantly, until curd is thickened, 5 to 10 minutes.\nSterilize jars and lids in boiling water for at least 5 minutes. Pack peach curd into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool dark area.\n",
        "picture_link": "IHnKIqwhr0xp0ydlfH.6xrm6t6c0fcm"
    },
    {
        "title": "Iced Cappuccino - Low-Carb Alternative",
        "ingredients": [
            "1 cup unsweetened, plain almond milk ADVERTISEMENT",
            "1/2 cup brewed strong coffee, cooled ADVERTISEMENT",
            "3 packets granular no-calorie sucralose sweetener (such as Splenda®) ADVERTISEMENT",
            "2 tablespoons cream cheese, softened ADVERTISEMENT",
            "4 ice cubes, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour almond milk, coffee, sugar, and cream cheese into large plastic cup; blend with an immersion blender until the cream cheese is completely blended into the liquid, about 1 minute. Pour the blended beverage into a tall glass with ice cubes.\n",
        "picture_link": "LrgwJwh1oYh0A0S45yKqoYX0eNvYAIG"
    },
    {
        "title": "Tongue Tinglin Wasabi Dressing",
        "ingredients": [
            "1 cup seasoned rice vinegar ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "2 tablespoons wasabi paste ADVERTISEMENT",
            "1 tablespoon peanut butter ADVERTISEMENT",
            "1 tablespoon light sesame oil ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon reduced-sodium soy sauce ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "3 dashes dark sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vinegar, honey, wasabi paste, peanut butter, light sesame oil, lime juice, soy sauce, black pepper, and dark sesame oil in the bowl of a stand mixer; mix until smooth, using whisk attachment.\n",
        "picture_link": "qIbmcM3TmyAbf.U5camPyUzmmSvHHMO"
    },
    {
        "title": "Mushroom Bundles",
        "ingredients": [
            "1 stick unsalted butter ADVERTISEMENT",
            "4 cups chopped mushrooms ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 (17.5 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat; cook and stir mushrooms and garlic in the melted butter for 1 minute. Pour in white wine; cook and stir mixture until all liquid has evaporated, about 5 minutes. Season with salt. Remove from heat.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nCut each puff pastry sheet into 4 equal rectangles, creating 8 total. Spoon mushroom mixture into the center of each rectangle; sprinkle with Parmesan cheese. Gather all 4 corners of a rectangle together around the filling; pinch corners and edges of puff pastry together forming a seal. Repeat with remaining rectangles. Arrange bundles on the prepared baking sheet. Lightly press bundles so the bottoms are flat.\nBake in the preheated oven until bundles are golden brown, about 15 minutes.\n",
        "picture_link": "zPO39q8X9jFbEt8CXXukR/K1Iu0O6aW"
    },
    {
        "title": "Easy Restaurant-Style Buffalo Chicken Wings",
        "ingredients": [
            "12 skinless chicken wings ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "3/4 cup hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse chicken wings in cold water; drain and pat dry with paper towels.\nMix flour, salt, pepper, and garlic powder together in a 1-gallon resealable bag; add chicken wings. Seal bag and shake to evenly coat chicken.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nRemove chicken from bag and shake off any excess coating; fry in the preheated oil until chicken is no longer pink in the center, about 7 minutes. Remove chicken with a slotted spoon and drain on a paper towel-lined plate.\nCombine hot sauce and butter in saucepan over medium heat; cook until heated through, about 5 minutes. Coat cooked chicken wings with sauce.\n",
        "picture_link": "Qe/paCpH9mhXskt4upC8req4q0bMF2W"
    },
    {
        "title": "Velveeta® Salsa Mac and Cheese",
        "ingredients": [
            "1 pound ground round ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (16 ounce) jar chunky salsa ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (7 ounce) package elbow macaroni ADVERTISEMENT",
            "12 ounces processed cheese food (such as Velveeta®), cut into 1 1/2-inch chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef and garlic in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add salsa and water; bring to a boil. Stir in macaroni; reduce heat and cover skillet. Simmer until macaroni is tender, 8 to 10 minutes. Stir cheese into mixture until melted.\n",
        "picture_link": "2KDZCfa2IBSbLchmnvt15QW01d2vN8e"
    },
    {
        "title": "Mama's Lasagna Scramble",
        "ingredients": [
            "1/2 (16 ounce) package cavatappi (corkscrew) pasta ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (6 ounce) container crumbled feta cheese ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons onion salt ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1 1/2 teaspoons dried thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBring a large pot of lightly salted water to a boil. Cook cavatappi in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 to 9 minutes. Drain and transfer to a large casserole dish.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir tomato sauce, diced tomatoes, feta cheese, black pepper, onion salt, garlic powder, basil, oregano, parsley, and thyme into ground beef. Simmer until flavors blend, 5 to 10 minutes. Pour ground beef mixture over cavatappi.\nBake in the preheated oven until bubbly, about 20 minutes. Let cool 5 minutes before serving.\n",
        "picture_link": "eDoouQM53vXlrCmJ5jkpebSzoBf6ACi"
    },
    {
        "title": "Quick and Easy Mexican Pizza",
        "ingredients": [
            "2 cups vegetable oil ADVERTISEMENT",
            "4 large flour tortillas ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat vegetable oil in a large skillet over medium-high heat until hot; fry tortillas, one at a time, until golden brown, 2 to 3 minutes per side. Transfer fried tortillas using tongs to a baking sheet.\nSpread salsa onto each fried tortilla; top with Cheddar cheese and Parmesan cheese.\nBake in the preheated oven until cheese is melted, about 8 minutes.\n",
        "picture_link": "d5MMuA95OFKPmaZYE9I0kBvNTMDswwy"
    },
    {
        "title": "Cinnamon Sweet Puffs",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 (10 ounce) cans refrigerated biscuit dough (such as Pillsbury Grands!®) ADVERTISEMENT",
            "12 large marshmallows ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray 12 muffin cups with cooking spray.\nCombine sugar and cinnamon in a bowl. Separate biscuits. Place a marshmallow in the center of each biscuit and wrap biscuit dough around marshmallow. Press dough to seal marshmallow completely. Roll dough ball in melted butter, then roll in cinnamon-sugar mixture. Arrange each dough ball in the prepared muffin cups.\nBake in the preheated oven until golden brown, about 15 minutes.\n",
        "picture_link": "s6qHgjr1i/nURVyc79T5zkhoYwD.SYm"
    },
    {
        "title": "Easiest Ever Chili",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (8 ounce) bag Birds Eye® Recipe Ready Chopped Green Peppers & Onions ADVERTISEMENT",
            "1 (15.5 ounce) can red kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried oregano (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown ground beef with Recipe Ready Chopped Green Peppers, Onions in medium saucepot.\nAdd remaining ingredients and simmer uncovered, 20 minutes.* Serve, if desired with shredded Cheddar cheese and sour cream.\n",
        "picture_link": "DOM3Q.81DqomOKwfBQku0.XdlzQcYR6"
    },
    {
        "title": "Citrus Balsamic Salmon",
        "ingredients": [
            "8 salmon fillets, 3/4-inch thick ADVERTISEMENT",
            "Ground black pepper ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 3/4 cups Swanson® Chicken Stock ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 1/2 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "1 tablespoon packed brown sugar ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "Orange slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the salmon with the black pepper. Place the salmon into a 2-quart shallow baking dish. Drizzle with the olive oil. Bake at 350 degrees F for 15 minutes or until the salmon flakes easily when tested with a fork.\nHeat the stock, vinegar, cornstarch, orange juice, brown sugar and orange zest in a 2-quart saucepan over medium-high heat to a boil. Cook and stir until the mixture boils and thickens.\nServe the salmon with the citrus sauce. Garnish with the orange slices.\n",
        "picture_link": "MEKdz2poih1IJ6XesTFcozsDL2PSMn."
    },
    {
        "title": "Spiced Cauliflower Soup",
        "ingredients": [
            "1 head cauliflower, cut into florets ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "3/4 cup heavy cream ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "ground nutmeg, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of lightly salted water to a boil. Add the cauliflower florets, and cook uncovered for 4 to 6 minutes until just tender. Drain well and set aside.\nHeat the olive oil in the saucepan over medium heat. Stir in the garlic, and cook until fragrant, about 1 minute. Add the drained cauliflower, 1/4 teaspoon nutmeg, and salt. Cook and stir 2 to 3 minutes, then pour in the chicken broth and bring to a boil over medium-high heat. Reduce heat to medium-low, cover, and simmer until the cauliflower is very tender, 15 or 20 minutes.\nPour the mixture into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the cauliflower moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the cauliflower right in the cooking pot. Stir in the cream, and cook over medium-low heat until hot. Serve with a dollop of sour cream and a sprinkle of nutmeg.\n",
        "picture_link": "/lOdPThizHDhT8IUMfnG1qzJbEpK9s2"
    },
    {
        "title": "Cheddar and Roasted Garlic Biscuits",
        "ingredients": [
            "5 cups all-purpose baking mix ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (14 ounce) can Swanson® Seasoned Chicken Broth with Roasted Garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F.\nMix baking mix, cheese and broth to form a soft dough. Drop by spoonfuls onto ungreased baking sheets, making 24.\nBake for 10 minutes or until golden. Serve hot.\n",
        "picture_link": "llBkmoxwmUUgtMQAg87soFtfrzenxDS"
    },
    {
        "title": "Daffodil Vegetable Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1/2 teaspoon anchovy paste ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 hard-cooked egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the cream cheese, mayonnaise, parsley, onion, anchovy paste, garlic powder, and pepper until creamy. Separate the egg white from the yolk; chop roughly. Stir the chopped egg white into the dip. Sprinkle the chopped yolk over the top. Chill to serve.\n",
        "picture_link": "CfNeP8WV98pPh73hhfoZZH5blAH1dGy"
    },
    {
        "title": "Telur Balado (Spicy Chile Sauce with Eggs)",
        "ingredients": [
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "6 hard-boiled eggs, shells removed ADVERTISEMENT",
            "6 red chile peppers, seeded and chopped ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "4 medium shallots ADVERTISEMENT",
            "2 tomatoes, quartered ADVERTISEMENT",
            "1 teaspoon shrimp paste ADVERTISEMENT",
            "1 1/2 tablespoons peanut oil ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon white vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 cup oil in a small saucepan over medium-high heat. Deep fry the eggs in the hot oil until they are golden brown, 5 to 7 minutes; set aside.\nCombine the chile peppers, garlic, shallots, tomatoes, and shrimp paste in a food processor; blend into a paste. Add in peanut oil. Process again until smooth.\nHeat 1 tablespoon oil in a large skillet over medium heat. Pour the chile pepper mixture into the skillet. Stir the vinegar, sugar, salt, and pepper into the mixture. Add the fried eggs to the mixture, turning to coat. Reduce heat to medium-low; simmer until fragrant, about 5 minutes.\n",
        "picture_link": "wQz3ZbdLi13jyLWcCxV7cvvZHaEhhNe"
    },
    {
        "title": "Harisseh (Middle Eastern Sweets)",
        "ingredients": [
            "1 cup semolina flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon rose water ADVERTISEMENT",
            "25 blanched almond halves for garnish ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon rose water ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together semolina, baking powder, 2 cups of sugar, and chopped almonds until evenly blended. Stir in yogurt, vegetable oil, and rose water until a soft dough forms. Cover bowl with plastic wrap, and allow to rest at room temperature for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Press the dough into a 9x9 inch square baking dish, and smooth the top. Score the top of the dough to create 25 squares, then top each square with an almond half.\nBake in preheated oven until the top has puffed and turned golden brown, about 20 minutes. The harisseh is done when the top is golden, and the center has firmed. When done, remove from the oven, and allow to cool in the pan for 20 minutes.\nWhile the harisseh is cooling, pour water and 2 cups of sugar into a saucepan. Bring to a simmer, and cook for 5 minutes. Stir in 1 teaspoon of rose water, and lemon juice, then remove from the heat.\nTo serve, cut the warm harisseh into 25 squares, and place onto a large serving platter; pour the rose water syrup over, making sure all of the pieces are moist.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar Salad",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 head green leaf lettuce, torn into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the vegetable oil, vinegar, and sugar in a small bowl. Place the lettuce in a large bowl. Drizzle the oil mixture over the lettuce and toss to coat.\n",
        "picture_link": "HKFvT5532YEKj7dwrLjRtXC53LJyHWG"
    },
    {
        "title": "Munkiboy's Cosmo-Not",
        "ingredients": [
            "1 cup crushed ice ADVERTISEMENT",
            "3 fluid ounces peach nectar ADVERTISEMENT",
            "2 fluid ounces cranberry juice cocktail ADVERTISEMENT",
            "1/2 fluid ounce grenadine syrup ADVERTISEMENT",
            "1 fluid ounce lemon flavored carbonated beverage ADVERTISEMENT",
            "1 twist lime peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a shaker with ice and pour in peach nectar, cranberry juice and grenadine. Strain into a martini glass and top with lemon soda. Garnish with a twist of lime.\n",
        "picture_link": "BIbT6qotJusMxp6TfWzhzPSwNeTv976"
    },
    {
        "title": "French Burgers",
        "ingredients": [
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup sliced green onion ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 pounds ground turkey ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 thin slice red onion ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1/2 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon dried minced onion ADVERTISEMENT",
            "1/2 teaspoon crushed bay leaf ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C).\nMix together the feta cheese, green onion, and tarragon in a small bowl; season with salt and pepper and set aside.\nForm the ground turkey into 8 even-sized patties. Top four of the patties with even portions of the cheese mixture. Top each with one of the remaining patties. Pinch the edges together to seal.\nBake the patties in the preheated oven until cooked through, 20 to 30 minutes, turning once.\nHeat the olive oil in a skillet over low heat. Cook and stir the red onion in the hot oil until browned; remove the onion and discard. Stir the flour into the oil and cook until deep brown in color. Remove the pan from the heat and add the chicken broth, red wine, parsley, minced onion, bay leaf, and thyme. Return the pan to heat and bring to a boil while stirring; season with salt and pepper. Pour the sauce over the patties to serve.\n",
        "picture_link": "d4e3C3nrn66WsXerucmGN5nkOTw6unu"
    },
    {
        "title": "Green Bean and Sweet Potato Medley",
        "ingredients": [
            "2 large sweet potatoes, peeled ADVERTISEMENT",
            "2 cups brown sugar ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 cup Holland House® Sherry Cooking Wine ADVERTISEMENT",
            "3 tablespoons butter, unsalted ADVERTISEMENT",
            "1 tablespoon onions, diced ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "3/4 teaspoon white pepper ADVERTISEMENT",
            "1 pinch thyme ADVERTISEMENT",
            "1 (16 ounce) package green beans whole, frozen ADVERTISEMENT",
            "1/2 cup Holland House® Sherry Cooking Wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F. Cut sweet potatoes into 1/4x1/4x3 inch spears. Place in 9x13 inch casserole. Add 2 cups brown sugar, lemon juice, and 1/2 cup cooking wine. Bake in oven for 25 minutes, basting several times.\nWhile potatoes cook, melt butter in saute pan. Add onions, 2 Tbsp. brown sugar, seasonings, and green beans. Saute for 2 minutes; add cooking wine and continue to saute until desired tenderness of vegetables. Remove from heat and keep warm.\nRemove sweet potatoes from any remaining basting liquid; toss with green beans and serve.\n",
        "picture_link": "pj0oRvD2AiP9zyb.LKlYV6tXDewwjUG"
    },
    {
        "title": "Orange, Mango, and Ginger Sorbet",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger, peeled and thinly sliced ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1 teaspoon lime zest ADVERTISEMENT",
            "2 cups orange juice ADVERTISEMENT",
            "1 cup mango juice ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the water, sugar, ginger, salt, and lime zest in a saucepan; bring to a boil. Reduce heat to low and simmer 5 minutes. Allow mixture to cool; strain. Stir in the orange juice, mango juice, and lemon juice. Cover and chill 3 hours.\nFill an ice cream maker with the mixture, and freeze according to the manufacturer's instructions.\n",
        "picture_link": "GKA98G/FHvqnY1yFOnGqcy0bXnIUALS"
    },
    {
        "title": "Kashmiri Garam Masala",
        "ingredients": [
            "1/4 cup black cumin seed ADVERTISEMENT",
            "2 large bay leaves, crushed ADVERTISEMENT",
            "2 tablespoons green cardamom seeds ADVERTISEMENT",
            "1/4 cup black peppercorns ADVERTISEMENT",
            "1 1/2 teaspoons whole cloves ADVERTISEMENT",
            "1 tablespoon fennel seed ADVERTISEMENT",
            "1 teaspoon chopped fresh mace ADVERTISEMENT",
            "4 cinnamon sticks, broken ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a small skillet over medium heat; add cumin, bay leaves. cardamom, peppercorns, cloves, fennel seed, mace, and cinnamon sticks and dry roast until fragrant, 6 to 10 minutes.\nAllow to cool; add nutmeg. Grind the spices into a fine powder using a spice grinder or coffee grinder. Store in an airtight container.\n",
        "picture_link": "i.BfMhrCb5.jU3PWMSRhCzuSoa9Yje."
    },
    {
        "title": "Jim C's Favorite Pimento Cheese",
        "ingredients": [
            "8 ounces extra sharp Cheddar cheese, grated ADVERTISEMENT",
            "8 ounces processed cheese food (such as Velveeta®), cubed ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 (4 ounce) jar pimentos, drained ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1 red chile pepper, seeded and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the Cheddar cheese, processed cheese, mayonnaise, pepper sauce, onion, Worcestershire sauce, pimentos, pecans, and red chile pepper in a food processor. Blend until smooth. Chill overnight for flavors to blend.\n",
        "picture_link": "lesC.A8RPg5IFC1Lr2iMpwgDBzHDZsK"
    },
    {
        "title": "Cinderella Pumpkin Bowl with Vegetables and Sausage",
        "ingredients": [
            "1 whole (10 pound) Cinderella pumpkin ADVERTISEMENT",
            "1 (16 ounce) package kielbasa sausage, sliced into 1/2 inch pieces ADVERTISEMENT",
            "3 carrots, peeled and sliced ADVERTISEMENT",
            "2 celery ribs, chopped ADVERTISEMENT",
            "1 large onion, peeled and chopped ADVERTISEMENT",
            "3 cloves garlic - minced, or amount to taste ADVERTISEMENT",
            "2 cups parsnips, peeled and cubed (optional) ADVERTISEMENT",
            "2 cups rutabagas, peeled and cubed (optional) ADVERTISEMENT",
            "2 cups cabbage, coarsely chopped (optional) ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 head broccoli, cut into florets ADVERTISEMENT",
            "2 zucchini, cut into chunks ADVERTISEMENT",
            "1 1/2 cups canned or frozen corn ADVERTISEMENT",
            "2 (13.75 ounce) cans chicken broth ADVERTISEMENT",
            "2 cups cooked white or brown rice (optional) ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "1/2 (1.25 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1/2 (1 ounce) packet dried Italian seasoning ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with foil.\nCut around the top of the pumpkin to make a lid. Use a large metal spoon to scoop out the inside membrane and seeds.\nPlace the pumpkin on the prepared baking sheet, and place in the preheated oven. Cook for 1 hour, then lower heat to 325 degrees F (165 degrees C).\nMeanwhile, place the sausage in a deep pot over medium-high heat. Cook until evenly browned, turning frequently, 10 to 12 minutes. Stir in the carrots, celery, onion, and garlic; cook and stir until translucent and tender, about 5 minutes. If desired, stir in the parsnips, rutabaga, and/or the cabbage; cook until the vegetables are almost ender, about 5 minutes. Add the red and green peppers, broccoli, zucchini, and corn. Pour in the chicken broth, add the rice, and cook 5 minutes more. Stir in the parsley, red pepper flakes, onion soup mix, and Italian seasoning. Season to taste with salt and pepper.\nKeeping the pumpkin on the baking sheet, spoon the vegetable-sausage mixture into the pumpkin, and replace the lid. Loosely cover the pumpkin with aluminum foil.\nCook the pumpkin in the preheated oven until the flesh is tender, about 4 hours. Scoop some of the pumpkin flesh away from the sides to combine with the vegetable mixture. To serve, place the pumpkin on a serving platter, and remove the lid to ladle out the contents.\n",
        "picture_link": "/A4Sm5nTMwU/LTdGfS/H.FwJgZCv2X6"
    },
    {
        "title": "Yummy Sweet Stuffing",
        "ingredients": [
            "3/4 cup dry stuffing mix ADVERTISEMENT",
            "1/2 pound maple flavored sausage ADVERTISEMENT",
            "1 (8 ounce) can jellied cranberry sauce ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare stuffing mix according to package directions.\nBrown the sausage in a skillet over medium heat; drain. Add the cranberry sauce and syrup; cook and stir until the cranberry sauce has melted. Stir in the prepared stuffing. Serve hot.\n",
        "picture_link": "yqCYBq3zijjEDBP3CMK1TaPv9WKYxmC"
    },
    {
        "title": "Adzuki Mooncake",
        "ingredients": [
            "Pastry: ADVERTISEMENT",
            "1/3 cup golden syrup ADVERTISEMENT",
            "3 tablespoons peanut oil ADVERTISEMENT",
            "1 cup cake flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "Adzuki Bean Filling: ADVERTISEMENT",
            "1 1/2 cups dry adzuki beans ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1/4 cup peanut oil ADVERTISEMENT",
            "1/4 cup white sugar, or more to taste ADVERTISEMENT",
            "2 tablespoons wheat starch ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 egg yolk, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the golden syrup together with 3 tablespoons of peanut oil in a small saucepan over low heat until the mixture becomes very warm, and the syrup is easy to stir, about 3 minutes. Meanwhile, whisk together the cake flour, baking soda, and salt in a mixing bowl. Stir in the golden syrup until a smooth dough forms. Wrap well with plastic wrap; refrigerate at least 4 hours.\nMeanwhile, combine the adzuki beans and water in a large saucepan over high heat. Bring to a boil, reduce heat to medium-low, cover, and simmer until the beans are tender, about 1 hour. Drain and allow to cool for 10 minutes. Puree the beans in a blender or food processor.\nHeat 1/4 cup of peanut oil over medium heat in the saucepan the beans were boiled in. Stir in the pureed beans along with the white sugar. Cook and stir until the bean paste clings to the stirring spoon, 10 to 20 minutes. Stir in the wheat starch. Scrape into a mixing bowl. Chill in the refrigerator until cold.\nPreheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nDivide the dough and the filling each into 8 equal portions and roll into balls. Press the dough balls between your palms to form circles large enough to envelop a filling ball. Place a ball of the filling onto the center of each pastry circle, wrap the pastry around the filling, and pinch the edges together. Roll the mooncakes in the all-purpose flour to coat; shake off excess. Place the mooncakes seam-side-down onto the prepared baking sheet and press to flatten slightly.\nMist lightly with water. Bake in the preheated oven for 8 minutes. Remove the mooncakes from the oven and reduce the oven temperature to 300 degrees F (150 degrees C).\nBrush with the beaten egg yolk, applying more of the yolk to to tops than to the sides. Return to the oven and bake until golden brown, about 15 minutes more. Cool completely before serving.\n",
        "picture_link": "tBSa9FffnyVcTmw2gAZyyEkJlbulb12"
    },
    {
        "title": "Bison Stew",
        "ingredients": [
            "2 tablespoons canola oil ADVERTISEMENT",
            "2 pounds bison meat, cut into 1-inch cubes ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 cup minced yellow onion ADVERTISEMENT",
            "1/2 cup minced celery ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "4 cups low-sodium chicken broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "1 teaspoon salt (optional) ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 whole cloves ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon ground thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons canola oil in a Dutch oven over medium-high heat; brown the bison in oil, 2 to 3 minutes per side; remove bison and set aside. Pour 1 tablespoon canola oil into the Dutch oven; cook and stir the onion and celery in the oil until soft, about 5 minutes. Add the garlic; cook and stir another 2 to 3 minutes. Sprinkle the flour over the mixture and stir to coat. Stir in the broth, water, wine, salt, pepper, cloves, tomato sauce, parsley, and thyme to the mixture; bring to a boil. Return the bison to the mixture and stir through. Reduce heat; cover and simmer until meat is fork tender, about 1 hour.\n",
        "picture_link": "T3wUjcbsmFXCrCnSitoe8uQPdHVikkS"
    },
    {
        "title": "Roasted Potato Salad with Vinaigrette",
        "ingredients": [
            "2 pounds cubed red potatoes ADVERTISEMENT",
            "10 tablespoons vegetable oil ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 banana pepper, sliced into 1/4 inch rings ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "2 large stalks celery, sliced 1/4 inch wide ADVERTISEMENT",
            "1 small red onion, thinly sliced ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C).\nToss the potatoes with 10 tablespoons of vegetable oil; sprinkle with paprika and dill. Toss until the potatoes are evenly coated with the spices and spread onto a baking sheet. Bake in the preheated oven until the potatoes are easily pierced with a fork, about 25 minutes.\nWhile the potatoes are roasting, heat the 2 tablespoons of vegetable oil in a large skillet over medium heat. Stir in the banana pepper, bell pepper, celery, and onion; cook and stir until the vegetables have softened, about 10 minutes. Toss the pepper mixture with the roasted potatoes in a bowl. Refrigerate until cold, about 1 hour.\nWhile the potatoes are cooling, whisk together the red wine vinegar, olive oil, and kosher salt. Toss the potatoes with the salad dressing just before serving.\n",
        "picture_link": "JYvOrNzdsLRrgQqVEwlYIxT3LlLtA6q"
    },
    {
        "title": "Spring Fruit Trifle",
        "ingredients": [
            "36 NILLA Wafers ADVERTISEMENT",
            "2 tablespoons orange-flavored liqueur or orange juice ADVERTISEMENT",
            "3 cups seasonal fresh fruit, such as sliced peeled kiwi, blueberries and/or sliced strawberries ADVERTISEMENT",
            "3 cups cold milk ADVERTISEMENT",
            "2 pkg. (4 serving size) JELL-O Vanilla Flavor Instant Pudding & Pie Filling ADVERTISEMENT",
            "6 (1 ounce) squares BAKER'S Premium White Baking Chocolate, melted, cooled slightly ADVERTISEMENT",
            "1 (8 ounce) tub COOL WHIP Whipped Topping, thawed, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Break wafers coarsely into 2-1/2-quart clear glass serving bowl. Sprinkle with liqueur; top with layers of fruit.\nPour milk into medium bowl. Add dry pudding mix. Beat with wire whisk 2 minutes or until well blended. Refrigerate until pudding starts to thicken. Add chocolate; stir with wire whisk until well blended. Gently stir in half of the whipped topping. Spoon over fruit; top with the remaining whipped topping.\nRefrigerate at least 30 minutes or up to 24 hours before serving. Store leftover dessert in refrigerator.\n",
        "picture_link": "mzMxvXcbdEej3J1UMfg.jLqp7T/e8qu"
    },
    {
        "title": "Tasty Blue Cheese Salad Dressing",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon dry sherry ADVERTISEMENT",
            "1/4 teaspoon garlic salt, or to taste ADVERTISEMENT",
            "4 ounces crumbled blue cheese (such as Maytag®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mayonnaise, sour cream, buttermilk, lemon juice, sherry, and garlic salt together in a bowl. Fold blue cheese through the mixture.\nCover bowl with plastic wrap and refrigerate 2 hours.\n",
        "picture_link": "dh9PC8GKBOfpTrBG35sVAPxpoxi5MYi"
    },
    {
        "title": "Sweet Potato Salmon Fish Cakes",
        "ingredients": [
            "1 large sweet potato, peeled and cut into large chunks ADVERTISEMENT",
            "1 large potato, peeled and cut into large chunks ADVERTISEMENT",
            "2 (4 ounce) salmon fillets ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "1 large carrot, diced ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 shallots, diced ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 cup dry seasoned bread crumbs ADVERTISEMENT",
            "1/2 cup vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sweet potato and potato into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain and transfer to a large bowl to cool.\nPlace salmon into a skillet and pour in milk. Bring to a simmer, cover skillet, and cook until salmon flakes easily with a fork, about 5 minutes. Remove salmon from the skillet; reserve milk in a bowl.\nHeat olive oil in the skillet over medium heat; cook and stir celery, carrot, nutmeg, red pepper flakes, salt, and pepper in the hot oil until celery and carrot are softened, about 5 minutes. Add shallots, parsley, cilantro, and garlic; cook and stir until fragrant, 3 to 5 minutes.\nPour wheat germ, egg, and reserved milk over sweet potato and potato; mash until evenly combined.\nFlake salmon with a fork; mix flaked salmon and vegetable mixture into the mashed potato mixture using your hands.\nHeat vegetable oil large saucepan or skillet over medium-high heat.\nPour bread crumbs into a large bowl.\nForm salmon mixture into patties using your hands; press each patty into bread crumbs, coating both sides.\nFry patties, working in batches, in the hot oil until crisp and golden, about 3 minutes per side.\n",
        "picture_link": "XE7W3fcPW3FX1FLSi.0B8cC2sitk0Xy"
    },
    {
        "title": "Orange Cumin Vinaigrette",
        "ingredients": [
            "1 1/2 teaspoons Dijon mustard ADVERTISEMENT",
            "1 1/2 teaspoons grated orange zest ADVERTISEMENT",
            "1 teaspoon ground cumin, or to taste ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "1 tablespoon fresh orange juice ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1/3 cup olive oil, or to taste ADVERTISEMENT",
            "1 pinch salt, or to taste ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place Dijon mustard, orange zest, cumin, red pepper flakes, orange juice, rice wine vinegar, and olive oil into a jar with a screw top. Add salt and pepper to taste.\nCover jar and shake vigorously for 2 minutes to form temporary emulsion.\n",
        "picture_link": "8XZ6O48C6Dt7heIdXXDg.s3QETGdRsm"
    },
    {
        "title": "Citrus-Herb Vinaigrette",
        "ingredients": [
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup fresh orange juice ADVERTISEMENT",
            "2 shallots, chopped ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons minced fresh ginger ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon fresh thyme ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped - or to taste ADVERTISEMENT",
            "1 teaspoon chopped fresh dill ADVERTISEMENT",
            "1 1/2 cups grapeseed oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend vinegar, orange juice, shallots, lemon juice, honey, parsley, ginger, Dijon mustard, lime juice, soy sauce, thyme, jalapeno pepper, and dill on high in a blender until smooth. Slowly pour grapeseed oil through the small opening in the blender's lid while the blender is running until fully incorporated; season with salt and black pepper.\n",
        "picture_link": "/7tvv75aNUgbFxHwlp4TfnFb2nQRnhW"
    },
    {
        "title": "Cheese Biscuit Loaf",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "4 ounces Cheddar cheese, cut into 1/4-inch cubes ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan with vegetable oil.\nWhisk flour, baking powder, salt, cayenne pepper, and black pepper together in a bowl. Stir cheese cubes into flour mixture until coated. Whisk milk, sour cream, melted butter, and egg in a separate bowl. Stir moist ingredients into flour and cheese mixture until just combined. Spread batter into prepared loaf pan.\nBake in the preheated oven until the top of the loaf is golden and a toothpick inserted into the center of the loaf comes out clean, 45 minutes to 1 hour. Let cool in pan 10 minutes before removing to finish cooling on a wire rack. Let cool 1 hour before serving.\n",
        "picture_link": "qYKvQwz9m/NZXKirG/ho6xgoxNiCTW6"
    },
    {
        "title": "Delicata Squash Burger Patties",
        "ingredients": [
            "1 delicata squash, halved lengthwise and seeded ADVERTISEMENT",
            "1 tablespoon olive oil (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "6 sun-dried tomatoes, chopped ADVERTISEMENT",
            "1 cup bread crumbs, or more if needed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 475 degrees F (245 degrees C).\nPlace squash on a baking sheet; drizzle with olive oil. Season with salt and pepper.\nBake in the preheated oven until tender, about 45 minutes. Remove and cool. Cut into cubes.\nHeat butter in a skillet over medium heat; cook and stir shallot and garlic in the melted butter until shallot is transparent, 5 to 10 minutes. Add sun-dried tomatoes; cook until softened, 2 to 3 minutes. Mash squash cubes into shallot mixture until relatively smooth. Remove from heat, transfer mixture to a bowl, and cool for 2 to 3 minutes.\nStir bread crumbs, egg, and Parmesan cheese into squash mixture. Add more bread crumbs if mixture is too sticky. Season with salt and pepper. Shape mixture into 4 patties.\nHeat vegetable oil in a large frying pan over medium-high heat; cook patties in the hot oil until browned, 4 to 5 minutes per side.\n",
        "picture_link": "43Vo8GRfQn6bprUk0UiNoqaigoyG0jS"
    },
    {
        "title": "Rhubarb Meringue Pie",
        "ingredients": [
            "3 eggs, separated ADVERTISEMENT",
            "1 (9 inch) unbaked single pie crust ADVERTISEMENT",
            "3 cups chopped rhubarb ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace egg yolks into a large bowl; place egg whites in a separate glass or metal bowl.\nFit pie crust into a 9-inch pie dish. Spread rhubarb into bottom of crust. Whisk 1 cup sugar, half-and-half, flour, and salt into egg yolks until smooth. Pour mixture over rhubarb.\nBake in the preheated oven until pie crust is browned and filling is set, 50 to 60 minutes.\nBeat egg whites until stiff using an electric mixer; gradually beat 1/4 cup sugar and cream of tartar into egg whites to make a glossy meringue. Spoon meringue over pie filling, going right to the edge of the crust and covering all the filling. Use a spoon or spatula to make decorative swirls in the meringue.\nReturn pie to oven and bake until meringue is lightly browned, 10 more minutes. Best served slightly warm.\n",
        "picture_link": "JVhljLcL0Tk2zaHEkvjmM7YpxEYZVjK"
    },
    {
        "title": "Happy Birthday Martini",
        "ingredients": [
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "1 fluid ounce pomegranate juice ADVERTISEMENT",
            "2 fluid ounces vodka (such as Tito's®) ADVERTISEMENT",
            "3 ice cubes ADVERTISEMENT",
            "2 strips lemon peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour sugar into the bottom of a martini glass; stir in lemon juice. Add pomegranate juice and vodka; stir well. Drop in ice cubes and garnish with lemon peel.\n",
        "picture_link": "Xh1Ods4TaqJvw9hQgaSdF2G.VY/d5x."
    },
    {
        "title": "Jenna's Harvest Soup",
        "ingredients": [
            "1 (4 ounce) package Idahoan® Roasted Garlic Flavored Mashed Potatoes, dry ADVERTISEMENT",
            "1 (32 ounce) carton reduced sodium chicken broth ADVERTISEMENT",
            "1 (15 ounce) can prepared mashed pumpkin ADVERTISEMENT",
            "1 pinch curry powder, or more to taste ADVERTISEMENT",
            "1 pinch sea salt, or more to taste ADVERTISEMENT",
            "1 pinch ground nutmeg, or more to taste ADVERTISEMENT",
            "1 pinch ground black pepper, or more to taste ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat chicken broth to a heavy simmer and add dry Idahoan Roasted Garlic Mashed Potatoes, pumpkin and seasonings to taste.\nSimmer on low until somewhat thick.\nFinish with cream, heat through and serve.\n",
        "picture_link": "GPdg/nVANuLKotra3dbL0R393QqPcFm"
    },
    {
        "title": "Easy Chicken Tetrazzini for a Large Family",
        "ingredients": [
            "5 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 pound angel hair pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can cream of celery soup ADVERTISEMENT",
            "1 1/4 pounds shredded sharp Cheddar cheese, divided ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1 (7 ounce) jar pimentos ADVERTISEMENT",
            "1/2 cup white cooking wine ADVERTISEMENT",
            "1 (3 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon steak sauce ADVERTISEMENT",
            "1 dash paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a pot of water to a boil. Cook chicken breasts in boiling water until no longer pink in the center and the juices run clear, 12 to 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut chicken into 1-inch pieces.\nBring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water, stirring occasionally until cooked through but firm to the bite, 4 to 5 minutes; drain.\nMelt butter in a large saucepan over medium heat. Cook and stir onion in butter until tender, about 5 minutes. Pour mushroom soup, chicken soup, and celery soup into the saucepan; stir and bring to a simmer. Add about half the Cheddar cheese; stir into the soup mixture and cook until velvety, about 5 minutes. Stir chicken, half-and-half, pimentos, wine, mushrooms, parsley, and steak sauce into the soup mix; cook until hot.\nToss angel hair pasta and soup mixture together in a large baking dish; top with remaining Cheddar cheese. Sprinkle paprika over the cheese layer.\nBake in preheated oven until the liquid is bubbling, about 45 minutes.\n",
        "picture_link": "A25p5Fk2v.AtqsW5syPNqFL8grevrhW"
    },
    {
        "title": "Whole Wheat Couscous Tabbouleh",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "3/4 cup whole wheat couscous ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups halved grape tomatoes ADVERTISEMENT",
            "1 3/4 cups chopped peeled cucumber ADVERTISEMENT",
            "1 cup chopped red onion ADVERTISEMENT",
            "1/2 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "1/2 cup chopped fresh mint ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan; stir in couscous and salt. Remove from heat, cover saucepan, and let stand until water is absorbed, about 5 minutes. Transfer couscous to a bowl and fluff with a fork.\nMix tomatoes, cucumber, onion, parsley, mint, lemon juice, olive oil, and black pepper into couscous. Serve immediately or refrigerate for 1 hour for flavors to blend.\n",
        "picture_link": "dJ78xVewsBSItx/RWCcfxFC.BxLFPnq"
    },
    {
        "title": "Light Danish Dessert",
        "ingredients": [
            "2 (8 ounce) cans refrigerated crescent dinner rolls, divided ADVERTISEMENT",
            "2 (8 ounce) packages reduced-fat cream cheese ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar, divided ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1 tablespoon skim milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 13x9-inch baking dish.\nUnroll one of the cans of crescent dough and place into prepared baking dish; press onto bottom of pan to form a crust, firmly pressing seams together to seal.\nBeat cream cheese, 3/4 cup confectioners' sugar, egg white, and vanilla extract with an electric hand mixer on medium speed in a bowl until well blended; spread onto crust. Spread cherry pie filling over the cream cheese mixture.\nPat remaining crescent dough onto a large sheet of waxed paper forming a 13x9-inch rectangle, pressing seams together to seal. Invert over pie filling to form top crust; discard waxed paper.\nBake in the preheated oven until golden brown, 30 to 35 minutes; cool at least 20 minutes.\nStream milk into remaining 3/4 cup confectioners' sugar in a bowl, while beating until well blended and thick; drizzle over warm dessert. Cut into 24 rectangles to serve. Store leftovers in refrigerator.\n",
        "picture_link": ".QIyK0IVKhRTVMDSLvj8Kkl6PDRuIji"
    },
    {
        "title": "Creamy Pesto Sauce",
        "ingredients": [
            "1 bunch fresh basil leaves ADVERTISEMENT",
            "1 cup Parmesan cheese ADVERTISEMENT",
            "2 ounces cream cheese ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 large clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add the basil leaves and cook until tender and bright green, 2 to 5 minutes. Drain basil, reserving 2 tablespoons of the basil water.\nBlend basil, 2 tablespoons basil water, Parmesan cheese, cream cheese, olive oil, butter, and garlic in a blender until smooth and creamy.\n",
        "picture_link": "Zxw8pTCYcSMWNtkpOR4KhpUcA5aYJmC"
    },
    {
        "title": "Pork Meatballs in White Wine Sauce",
        "ingredients": [
            "1/2 pound ground pork ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (3.5 fluid ounce) wine glass white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the pork, egg, Parmigiano-Reggiano cheese, onion powder, tarragon, and salt until everything is well incorporated; form into meatballs the size of a tablespoon. Spread bread crumbs into a shallow dish; roll meatballs in bread crumbs to coat.\nHeat the olive oil in a skillet over medium heat. Cook meatballs in hot oil until golden brown on all sides, 3 to 5 minutes. Add white wine half a glass at the time; cook at a simmer until the wine is reduced to a nice thick sauce, about 15 minutes.\n",
        "picture_link": "6z3w7DmArzqqu5YlQwe7Q6qr2pxR0cy"
    },
    {
        "title": "Butterfinger Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) package chocolate or yellow cake mix ADVERTISEMENT",
            "36 pieces NESTLE® BUTTERFINGER® Bites Candy, chopped, divided ADVERTISEMENT",
            "1 (12 ounce) container prepared chocolate or vanilla frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease or paper-line 24 muffin cups.\nPrepare cake mix batter according to package directions; stir in 1/2 cup Butterfinger. Spoon into prepared muffin cups.\nBake for 15 to 25 minutes or until wooden pick inserted in cupcake comes out clean. Cool completely. Frost; sprinkle with remaining Butterfinger.\n",
        "picture_link": "a.rFkZFz3/ZnahlSkMFcD4rmbZxa5r."
    },
    {
        "title": "Southern Butter Beans",
        "ingredients": [
            "1 (16 ounce) package dried lima beans ADVERTISEMENT",
            "5 slices bacon, chopped ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover lima beans with water in a large pot and soak overnight. Drain and return lima beans to the pot; cover beans with fresh water.\nHeat a large skillet over medium-high heat; cook and stir bacon until crisp, about 5 minutes. Reserve about 2 teaspoons bacon drippings and drain bacon on paper towels.\nBring lima beans, bacon, and reserved bacon drippings to a boil. Reduce heat to medium-low and simmer until beans are just tender, 40 to 60 minutes. Stir heavy cream and butter into bean mixture and cook until thickened, about 15 minutes more. Season with salt and pepper.\n",
        "picture_link": "vNgQD82Zhu7.KT9g4W5Iz2k6rINcR7C"
    },
    {
        "title": "Rote Grutze (German Berry Compote)",
        "ingredients": [
            "6 cups raspberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine berries and sugar in non-stick saucepan over medium heat; bring to a boil while stirring constantly.\nWhisk cornstarch into cold water in a small bowl until dissolved completely; stir into the berry mixture. Reduce heat to medium low and cook mixture at a simmer until it begins to thicken, about 3 minutes.\nRemove berry mixture from heat. Stir lemon juice and vanilla extract into the berry mixture; transfer to a bowl. Cover bowl with plastic wrap and refrigerate for 24 hours.\n",
        "picture_link": "0F8B8701Kml6YXZWHbANunYTs1kqLui"
    },
    {
        "title": "The BEST Margarita Mix !!!",
        "ingredients": [
            "1/2 cup tequila ADVERTISEMENT",
            "1/2 cup triple sec ADVERTISEMENT",
            "1/4 cup freshly squeezed lime juice ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "4 cups ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend tequila, triple sec, lime juice, honey, and ice in a blender until smooth.\n",
        "picture_link": "v7hjQy2dwwEyq9hwJV6Ls5mMkMwCTQ6"
    },
    {
        "title": "Mayan Mocha Powder",
        "ingredients": [
            "2/3 cup nonfat dry milk powder ADVERTISEMENT",
            "2/3 cup instant coffee granules ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground red pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix nonfat dry milk powder, instant coffee granules, sugar, cocoa powder, pumpkin pie spice, cinnamon, and ground red pepper in a bowl until thoroughly combined. Store in an airtight lidded container or a resealable plastic bag.\n",
        "picture_link": "H6bnoe6caDSZfvFNqb8cCW6Rq7X763m"
    },
    {
        "title": "Aunt Kathy's Irish Soda Bread",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "2 tablespoons caraway seeds ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a heavy pan.\nMix flour, sugar, raisins, caraway seeds, baking powder, baking soda, and salt in a large bowl. Add eggs, buttermilk, and milk to the flour mixture; stir until evenly incorporated. Transfer dough to the prepared pan.\nBake in preheated oven until when the bread is tapped on top it sounds hollow, about 75 minutes.\n",
        "picture_link": "G0P7cwjftQEIYcS0KRTofvU3JaQ6yJa"
    },
    {
        "title": "Candy Bar Squares",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 (2.1 ounce) bars chocolate-coated peanut and nougat candy, eg: Baby ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat the butter or margarine with the white and brown sugars until light and fluffy. Blend in the eggs, mixing well.\nMix in the flour, baking soda and salt to the egg mixture. Reserve 1/2 cup of the chopped candy bars for the topping. Stir the remaining candy into the flour mixture. Spread the batter into one 13x9 inch baking pan. Sprinkle the reserved candy on top.\nBake at 350 degrees F (175 degrees C) for 25 to 30 minutes or until lightly browned. Cool in pan on a wire rack then cut into squares.\n",
        "picture_link": "Y1KkvY7L2T9CAdLGc8NRpSAOxVsS4vW"
    },
    {
        "title": "Two Tone Brownies",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 (1 ounce) squares bittersweet chocolate ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup white chocolate chips ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly brush an 8 inch square tin with melted butter or oil. Line the base with baking paper, extending over two sides.\nStir 1/4 cup butter or margarine and dark chocolate in the top of a double boiler until just melted. Using a wooden spoon, beat 1/2 cup sugar, vanilla extract, and 1 egg in a medium bowl until combined. Stir in the melted chocolate mixture. Add 1/2 cup flour, stirring until just combined; don't over beat.\nStir 1/4 cup butter or margarine and white chocolate in the top of a double boiler until just melted. Using a wooden spoon, beat 1 /2 cup sugar, vanilla extract and 1 egg in a second bowl until combined. Stir in the white chocolate mixture. Add 1/2 cup flour, stirring until just combined; don't over beat.\nDrop large spoonfuls of the mixtures alternately and evenly, next to one another, in a single layer, in the tin. Gently smooth the surface, without combining the mixtures.\nBake for 35 minutes, or until firm. Allow to cool in the tin before cutting into small squares.\n",
        "picture_link": "W.FG2ZNLIl3XwKNbRSVCOvSJFXCcSJS"
    },
    {
        "title": "Deep Dish Fudge Brownies",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup cake flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "4 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350. Grease and flour one 9 inch square baking pan, tapping out excess flour.\nMelt the butter and unsweetened chocolate in the top of a double boiler and then let cool for about 15 minutes.\nSift together both flours, baking powder and salt. Set aside. In Large bowl, whisk chocolate/butter mixture to blend. Beat in sugar, then vanilla, then eggs. Fold in dry ingredients and mix well. Stir in semisweet chocolate chips. Scrape batter into prepared pan, spreading evenly.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes until set. Do not overbake. Cool in pan on a wire rack. Once cool cut into large squares.\n",
        "picture_link": "JwnlTOAPpF2Y8Tdd7mdicitET8SCyGy"
    },
    {
        "title": "Super Dooper Peanut Butter",
        "ingredients": [
            "2 tablespoons peanut butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "3 tablespoons vanilla extract ADVERTISEMENT",
            "2 eggs (optional) ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large bowl, mix together the peanut butter, butter, vanilla, and eggs (optional). In another bowl, mix together the sugar, brown sugar, flour, cocoa, and baking soda.\nPour the dry ingredients into large bowl and mix together. Fold the chocolate chips into the batter.\nDrop by teaspoon onto baking sheets. Bake for 10 minutes. Enjoy!!!\n",
        "picture_link": "YTKcO7HxYsrBnGfaYUBAfKhTQ5gCYKS"
    },
    {
        "title": "Rosettes II",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons butter (optional) ADVERTISEMENT",
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix all the ingredients, except the flour, to blend. Add the flour a little at a time, and beat until smooth.\nDeep-fry in hot oil, about 375 degrees F (190 degrees C). (Fry-Daddy works well). Heat the iron for about 10 seconds in the oil, then dip in batter. Place the iron in oil so it is just level with the top of the batter (If you put it in deeper, the batter will not come off the iron). Remove rosette from oil when lightly browned (it only takes seconds). Drain on paper towel. Sprinkle with confectioner's sugar. NOTE: If you chill the batter for a while, the rosettes come out thinner and crispier, but it isn't required.\n",
        "picture_link": "uTGyQNerw1V2PsRT5uy2Gb/rVgeGaqe"
    },
    {
        "title": "Coffee Bars",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons instant coffee granules ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup chopped almonds ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1/3 cup evaporated milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, baking powder, cardamom, and salt; set these dry ingredients aside.\nCombine milk and instant coffee in saucepan, and heat at a medium low setting. Stir until coffee dissolves, and remove from the heat.\nIn a large bowl, cream the butter or margarine with the white sugar and 1 cup confectioners' sugar. Beat in the egg, and then beat in the coffee mixture. Gradually blend in the mixture of dry ingredients, and fold in the almonds.\nSpread dough evenly in a 9 x 13 inch baking pan. Bake for 18-20 minutes at 350 degrees F (175 degrees C), or until toothpick inserted in center comes out clean. Cool in pan on wire rack.\nTo Make Frosting: Put 1 cup of the confectioners' sugar in a mixing bowl. Beat in the evaporated milk and vanilla extract. Gradually beat in remaining 2 cups of confectioners' sugar. Continue beating until of desired consistency. If consistency is too thick, add a little more milk; if it is too thin, add more powdered sugar.\nFrost the bars with the icing.\n",
        "picture_link": "dbi1dnD8DsLIt1t3q.Zps3/j9j.MoW6"
    },
    {
        "title": "Havreflarn",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "1 1/8 cups rolled oats ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "5 toasted bitter almonds, ground ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F (225 degrees C).\nMelt the butter, and pour it immediately over the oat-grain. Let the mixture cool down.\nAdd the sugar, the lightly whipped egg, and the ground bitter almond to the oat mixture. Combine the flour with the baking powder, and then stir into the dough.\nDrop by spoonfuls onto oiled cookie sheets. Since the cookies float out, just put 6 to 8 spoonfuls on each sheet. Bake the cookies in the middle of the oven for about 6 minutes. Remove and cool.\n",
        "picture_link": "T7pduIucab8PKuUbhv.mfcIdJr45Nfa"
    },
    {
        "title": "Holly Berry Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, chilled ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2/3 cup seedless raspberry jam ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup cinnamon red hot candies ADVERTISEMENT",
            "4 drops green food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl combine the flour, white sugar, ground cinnamon, baking powder and salt. Cut in the butter until the mixture resembles coarse crumbs. In a small bowl beat the egg and 1/4 cup of milk. Add this to the crumb mixture until the dough is moistened. Cover and refrigerate for at least 1 hour.\nPreheat oven to 375 degrees F (190 degrees C).\nOn a lightly floured surface roll out the dough to 1/8 inch thick. Cut with a 2 inch round cookie cutter. Place on ungreased baking sheets.\nBake at 375 degrees F (190 degrees C) for 8 to 10 minutes or until edges are lightly browned. Cool on wire racks. Once cool spread jam on half of the cookies then top each with another cookie.\nTo Make Glaze: Combine the confectioners' sugar, 2 tablespoons milk and vanilla until smooth. Spread glaze over the cookie and decorate with red cinnamon candy before the glaze is set. Let dry. Using a small new paintbrush and green food coloring, paint holly leaves on cookies.\n",
        "picture_link": "duUsBfccpH2Zh8DnQdCNOGjH4F9kFki"
    },
    {
        "title": "Mosaic Cookies",
        "ingredients": [
            "4 (1 ounce) squares semi-sweet chocolate ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/2 pound rainbow colored miniature marshmallows ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup graham cracker crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the chocolate squares and margarine together. Stir in the vanilla and the pinch salt.\nBeat the egg white and slowly add the confectioners' sugar. Blend well. Stir in the chocolate mixture, the marshmallows and the chopped nuts. Blend well. Shape mixture into a log shape and roll firmly in the graham cracker crumbs. Refrigerate. Slice log when ready to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Praline Butter Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons praline liqueur ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter; gradually add sugar, beating well at medium speed of an electric mixer. Add egg yolks, one at a time, beating after each addition. Stir in vanilla and praline liqueur.\nCombine flour, baking powder, and salt; gradually add to creamed mixture, mixing well. Shape dough into 1 inch balls; place 2 inches apart on ungreased cookie sheets.\nPress a pecan half into center of each cookie. Bake at 300 degrees F (150 degrees C) for 20 minutes or until lightly browned. Cool on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apricot Explosions",
        "ingredients": [
            "1 cup chopped walnuts ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup apricot preserves ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large mixing bowl, combine sugar, eggs, and shortening together by hand. Add flour and baking powder; mix well. Divide dough in half.\nSpread half of dough in 10 x 15 inch pan. Spread preserves over dough. Sprinkle walnuts on top and then sprinkle cinnamon on top\nGrate second half of dough on top (crumble). Press down gently. Bake for 1/2 hour at 350 degrees F (175 degrees C). Cut into squares when cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fruitcake Cookies I",
        "ingredients": [
            "1 pound candied pineapple ADVERTISEMENT",
            "16 ounces candied cherries ADVERTISEMENT",
            "3 cups dates, pitted and chopped ADVERTISEMENT",
            "6 cups chopped walnuts ADVERTISEMENT",
            "4 1/2 cups golden raisins ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "3 teaspoons baking soda ADVERTISEMENT",
            "3 tablespoons sweetened condensed milk ADVERTISEMENT",
            "1/2 cup brandy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nCut fruit into small pieces. In a large bowl, dredge fruit and nuts in 1 cup flour.\nCream together butter, brown sugar, and egg yolks. Stir together 2 cups flour, cinnamon, and nutmeg; add to the creamed mixture. In a small bowl, dissolve baking soda into sweetened condensed milk. Gradually add soda mixture and brandy to the dough. Turn mixture into the big bowl of fruit and nuts. Combine.\nBeat the egg whites to stiff peaks. Fold into the dough.\nBake in the preheated oven until cookies are lightly browned but still soft, about 20 minutes. Cool on wire racks.\n",
        "picture_link": "XzQIiqmKtMZmfI8Aaop2xHpWPKrr.26"
    },
    {
        "title": "Rosies",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup condensed tomato soup ADVERTISEMENT",
            "2 1/2 cups rolled oats ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together the flour, baking soda, baking powder, ground cinnamon, and ground cloves.\nCream together shortening and sugar. Add in the egg and beat well. Add the tomato soup and blend. Gradually mix in dry ingredients. Add the oats, raisins and pecans and mix well.\nRoll the dough into walnut sized balls and place them 1-1/2 inches apart on lightly greased cookie sheets. Flatten balls slightly. Bake 10-12 minutes until lightly colored. Cool on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pecan Lace",
        "ingredients": [
            "2/3 cup ground pecans ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nCombine all ingredients in a skillet, stirring over medium heat until blended. Keep mixture warm. (Mixture will be thin).\nDrop by teaspoonfuls about 3 inches apart on a well-greased cookie sheet. (No more than four or six cookies per sheet). Bake for five minutes then cool on the cookie sheet for one minute.\nQuickly remove each cookie with spatula and curl around handle of wooden spoon. If cookies get too brittle to curl, return to oven for a minute to soften. To keep crisp, store airtight.\n",
        "picture_link": "ap7RMEAL56CsQJHvaONvOvUXMqSSHIi"
    },
    {
        "title": "Potato Chip Cookies III",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup crushed potato chips ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream the shortening with the sugar. Add the egg and beat well. Stir in the vanilla.\nAdd the flour and baking soda and mix well. Stir in the crushed potato chips and chopped nuts. Shape cookies into balls and roll in white sugar.\nPlace cookies on an ungreased cookie sheet and flatten slightly. Bake at 350 degrees F (175 degrees C) for 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Double Chocolate Nummies",
        "ingredients": [
            "1 1/4 cups butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (190 degrees C).\nCream the together the butter or margarine, white sugar, vanilla, egg and water. Stir in the salt and the cocoa and beat well.\nCombine the flour and the baking soda. Stir the flour mixture into the creamed mixture. Mix in the chocolate chips and oatmeal. Drop tablespoon sized drops onto an ungreased cookie sheet.\nBake at 350 degrees F (190 degrees C) for 12 to 14 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Snaps",
        "ingredients": [
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup corn syrup ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate chips over heat and let cool. Combine flour, baking soda and salt. Set aside. With an electric mixer set at medium-low speed, beat butter and sugar until fluffy. Add vanilla, corn syrup and egg and continue beating until well combined. Reduce mixer speed to low and beat in melted chocolate. Add flour mixture and continue beating until well combined.\nRefrigerate until firm, about 30 minutes.\nShape dough into approximately 1 inch balls and roll in additional sugar. Put on ungreased baking sheets about 1 inch apart. Bake at 350 degrees F (175 degrees C) until edges are lightly browned, 10 to 15 minutes. Let stand on baking sheets 1 minute before removing to wire racks to cool.\n",
        "picture_link": "PfEsc/R2VdvQ.HDTC/nkyb4kp1bPo9G"
    },
    {
        "title": "Oatmeal-Walnut-Raisin Chewies",
        "ingredients": [
            "2 cups chopped walnuts ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "1 1/2 cups unsweetened nut and grain granola ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1 oven rack in the upper third of the oven and 1 rack in the lower third of the oven. Preheat oven to 375 degrees F (190 degrees C). Coat 2 large baking sheets with cooking spray. On a microwavable plate, spread the walnuts and rolled oats. Microwave on high for 2 minutes. Stir and check for toasting. Microwave for an additional 2 minutes on high and stir. The nuts and oatmeal should now be nicely toasted. Dump in a large bowl.\nIn the food processor bowl fitted with a steel blade, combine the sugars, butter, eggs and vanilla. Process until smooth and creamy, about 30 seconds. In a small bowl, combine the flour, baking soda, baking powder and salt. Spoon the flour mixture on top of the batter. Pulse 3 or 4 times to mix.\nScrape the batter into the walnut-oatmeal mixture. Add the raisins and granola. Fold the ingredients together.\nDrop the cookies onto the sheets using 2 tablespoons of dough for each cookie. Bake in the preheated oven for 12 to 15 minutes, until the tops are just beginning to brown but the middles still look a little soft. Cool on the baking sheets for a few minutes and then transfer to a rack.\n",
        "picture_link": "e9tO8BVkZU8YTVLGT3UcsA9bwy.mKYu"
    },
    {
        "title": "Filled Cookies II",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup any flavor fruit jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cream cheese in a mixing bowl, and beat til light and fluffy. Add the rest of the ingredients, except for the fruit preserves, and form into a flat disk. Chill overnight.\nRoll dough out onto a lightly floured board, and cut circles using a medium sized glass.\nIn the center of each circle, add 1/2 teaspoon of preserves; crimp edges tightly together. Natural preserves have a tendency to spill out due to the lower sugar content, but still make a great cookie.\nBake at 375 degrees F (190 degrees C) for 15 to 17 minutes.\n",
        "picture_link": "cPfrRQ.FJolqCPUftMloT6w0mVJqCVO"
    },
    {
        "title": "Crunchy Chip Cookies",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl combine the flour, baking soda, and salt. Set aside.\nIn a large bowl combine cream the butter and sugar together until light and fluffy. Beat in the egg and vanilla. Stir in the flour mixture and mix to combine. Stir in the crisp rice cereal, chocolate chips and raisins.\nDrop by level tablespoonfuls onto a lightly greased cookie sheet. Bake at 350 degrees F (175 degrees C) for 12 to 15 minutes.\n",
        "picture_link": "oMMKRMw0MdqwC68jNWjtG1CBu46g4v."
    },
    {
        "title": "Butterscotch Chocolate Cake",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 (16 ounce) jar butterscotch topping ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "3 (2.16 ounce) bars chocolate-covered crispy peanut butter candy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare and bake cake according to package directions, using a 9x13 inch pan. Cool on a wire rack for 30 minutes. Using the end of a wooden spoon handle, poke 12 holes in warm cake.\nPour butterscotch topping over cake. Allow to cool completely. Spread with whipped topping, sprinkle with candy bars. Refrigerate for at least 2 hours before serving.\n",
        "picture_link": "X/10yEVXkZHrDL289BijtifkzWVs57u"
    },
    {
        "title": "Polish Style Chocolate Cake",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1 3/4 cups milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "3 bananas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift together the flour, cocoa, baking soda and baking powder. Set aside.\nIn a large bowl, cream together the butter, shortening and sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then add the vanilla. Add the flour mixture alternately with the milk. Mix to combine.\nPour batter into a 9x13 inch pan. Bake for 30 minutes in the preheated oven, or until a toothpick inserted into the cake comes out clean. Allow to cool.\nSpread whipped topping over cooled cake and place sliced bananas on top. Store in refrigerator.\n",
        "picture_link": "JBauE1WRDeLiycFzFFvLzgSoSJ4sswy"
    },
    {
        "title": "Julia's Excellent French Onion Soup",
        "ingredients": [
            "1/2 pound bacon ADVERTISEMENT",
            "2 1/2 pounds chopped onion ADVERTISEMENT",
            "1/2 pound sweet onions ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "2 tablespoons chopped fresh thyme ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "8 cups beef stock ADVERTISEMENT",
            "1/4 cup cooking sherry ADVERTISEMENT",
            "4 slices toasted French bread ADVERTISEMENT",
            "4 slices Gruyere cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium high heat, fry the bacon for 15 minutes, or until crisp. Transfer bacon to paper towels but leave the grease in the skillet.\nReduce heat to medium, add the onions and saute in the bacon grease for about 15 minutes, or until translucent and tender. Stir in the wine and the thyme and simmer for 5 more minutes. Add the salt and ground black pepper.\nPreheat oven to broil.\nThen pour in the beef stock, bring to a boil, reduce heat to low and simmer for about 30 minutes. Crumble the bacon, reserve 4 tablespoons and add the rest to the soup.\nPlace 1 tablespoon of sherry into each of 4 individual oven-safe bowls. Lay a slice of bread into each bowl, then ladle the soup into each bowl. Top with the cheese and sprinkle with the remaining bacon.\nPlace in the oven and broil for about 3 to 5 minutes, or until the cheese is melted and bubbly. (Note: Be careful when removing the bowls as they will be hot.)\n",
        "picture_link": ".SlnixPko/LIJ2I934I2QsX253DZ62y"
    },
    {
        "title": "Chocolate Hazelnut Teacake",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "3 (1 ounce) squares bittersweet chocolate, chopped ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup ground roasted hazelnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour an 8x4 inch loaf pan.\nIn a saucepan over medium heat, melt the butter, stir in the chocolate, remove from heat and stir until the chocolate is completely melted. Add the sugar and mix well. Combine the flour, baking powder and baking soda, stir into the chocolate mixture. Blend in the sour cream. Beat in the eggs one at a time, then stir in the vanilla. Finally, fold in the ground hazelnuts. Spread the batter evenly into the prepared pan.\nBake for 45 to 50 minutes in the preheated oven, or until a toothpick inserted into the cake comes out clean. Allow cake to cool for 10 minutes in the pan before inverting onto a wire rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shoofly Pie III",
        "ingredients": [
            "1 prepared 8 inch pie crust ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "2/3 cup hot water ADVERTISEMENT",
            "5 tablespoons molasses ADVERTISEMENT",
            "1 tablespoon dark brown sugar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together flour, 2/3 cup brown sugar, and salt. Cut in butter or margarine until mixture resembles rice. Reserve 3 tablespoons of mixture for sprinkling top of pie.\nIn a separate bowl, mix together hot water, molasses, dark brown sugar, and baking soda. Stir molasses mixture into remaining crumb mixture. Pour into pastry shell. Sprinkle with reserved crumb mixture.\nBake in preheated oven for 35 to 40 minutes, until top springs back when pressed. Cool on a wire rack.\n",
        "picture_link": "cBdulbwjy3plIj2HCtsgv73yFCK6Tum"
    },
    {
        "title": "Lemon Sponge Cake II",
        "ingredients": [
            "7 egg whites ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup fructose (fruit sugar) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup fructose (fruit sugar) ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).Grease and flour a 10 inch tube pan.\nIn a large mixing bowl, combine the egg whites and salt. Whip with an electric mixer until soft peaks form. Continue mixing while gradually adding the 1/4 cup of brown sugar and fructose. Whip to stiff peaks, but not blocky.\nIn a medium bowl, combine the egg yolks, brown sugar and fructose. whip with an electric mixer until stiff and pale. Gradually mix in the lemon juice. Remove from mixer and fold sifter flour in by hand with a rubber spatula. Fold 1/3 of the egg whites into the yolk mixture until well blended, then fold the yolk mixture into the remaining egg whites. Pour batter evenly into the prepared pan.\nBake for 30 to 45 minutes in the preheated oven, until a toothpick inserted comes out clean. Allow the cake to cool for 10 minutes in the pan before inverting onto a wire rack to cool completely.\n",
        "picture_link": "fUeVCggfHc2niL4c.zE9mXrqDaCMlfq"
    },
    {
        "title": "Fifteen Bean Soup",
        "ingredients": [
            "1 (16 ounce) package dry mixed beans ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 (15 ounce) can mixed vegetables, drained ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak beans in a large bowl overnight; drain.\nIn a large pot over medium high heat, combine the beans, bacon, onion, garlic powder and mixed vegetables. Fill with water to cover and season with salt and pepper to taste.\nBring to a boil, reduce heat to low and simmer for 60 to 90 minutes, or until beans are tender.\n",
        "picture_link": "LsluRjEmX8.GHsa8hv64bpp9eIe9FgC"
    },
    {
        "title": "Pineapple Cherry Cake",
        "ingredients": [
            "1 (18.25 ounce) package cherry cake mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple, with juice ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nPour the cake mix into a large bowl. add the eggs. Drain the juice from the pineapple into a measuring cup and add water, if necessary, to make 1 1/4 cups. add the juice to the cake mix, and beat the mixture with an electric mixer until smooth, about 3 minutes. Fold in the nuts and pineapple, then spread the mixture evenly into the prepared pan.\nBake in the preheated oven for 35 to40 minutes, or until a toothpick inserted into the cake comes out clean. Allow to cool.\n",
        "picture_link": "LtjXVpa5D0jk4qTA6tWjUaBIjIDTiJ."
    },
    {
        "title": "Rosy Refrigerator Rolls",
        "ingredients": [
            "1 cup room temperature tomato juice ADVERTISEMENT",
            "1/2 cup lukewarm water (100 degrees F/38 degrees C) ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2/3 cup melted shortening ADVERTISEMENT",
            "1 cup mashed potatoes ADVERTISEMENT",
            "6 cups all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the tomato juice, water, sugar, and salt in a large bowl, stir until the sugar and salt dissolve, and sprinkle the yeast over the mixture. Let stand for 5 minutes until the yeast softens and begins to form a creamy foam.\nMix in the eggs, shortening, and mashed potatoes, and beat in the flour to make a soft dough. Knead for about 5 minutes, until the dough is smooth and elastic, and place in a greased bowl, turning once to grease the top of the dough. Cover and refrigerate the dough for at least 2 hours or overnight.\nLine baking sheets with parchment paper, and set aside.\nWorking on a lightly floured surface, divide the dough into 4 equal pieces, and cut each into 12 small pieces. Roll the pieces into balls, place the rolls 2 inches apart on the prepared baking sheets, cover with a towel, and let the rolls rise in a warm place until double, about 2 hours.\nPreheat an oven to 375 degrees F (190 degrees C).\nBake the rolls in the preheated oven for 12 to 15 minutes, until the tops are golden brown.\n",
        "picture_link": "bKzLxB92E79uQyjLhbLN4vxcQIHvz42"
    },
    {
        "title": "Kevin's Asian Baked Salmon",
        "ingredients": [
            "2 cups dried shiitake mushrooms ADVERTISEMENT",
            "1 cup oyster sauce ADVERTISEMENT",
            "1 tablespoon sherry ADVERTISEMENT",
            "2 pounds salmon fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak mushrooms in boiling water 20 minutes; remove stems. Put softened mushrooms, oyster sauce, and sherry into a bowl; stir. Let mixture sit for 10 to 20 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Line a large baking dish with foil, then lightly grease it with olive oil or nonstick cooking spray.\nPlace salmon fillets in prepared baking dish and pour mushroom mixture over the salmon.\nBake in the preheated oven until fish flakes easily, about 10 to 12 minutes. If desired, at the end of the cooking time, broil the salmon to sear the coating, about 1 to 2 minutes.\n",
        "picture_link": "04hfGjzlECF2TYWnJsOM13ErZymHAp6"
    },
    {
        "title": "Magpie's Barbeque Sauce",
        "ingredients": [
            "1 tablespoon bacon drippings ADVERTISEMENT",
            "1/3 cup minced onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "1 1/2 cups ketchup ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 cup brown sugar, firmly packed ADVERTISEMENT",
            "1 cup balsamic vinegar ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1 teaspoon bottled chipotle chile sauce ADVERTISEMENT",
            "2 tablespoons ground mustard ADVERTISEMENT",
            "1/2 teaspoon crushed dried chile pepper ADVERTISEMENT",
            "1 teaspoon fresh-ground black pepper ADVERTISEMENT",
            "1/8 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon Spanish paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the bacon drippings in a saucepan over medium heat. Cook the onion in the bacon drippings until soft, about 7 minutes. Stir in the garlic and ginger. Cook and stir another 30 seconds. Reduce heat to low.\nStir together the ketchup, Worcestershire sauce, soy sauce, brown sugar, balsamic vinegar, lemon juice, chipotle sauce, mustard, ground chile pepper, pepper, salt, cumin, coriander, and paprika in a bowl. Stir sauce into the onion mixture, and simmer for 20 minutes, stirring frequently.\n",
        "picture_link": "QLne4glA5kLdN4Et0dos99MkI4rPal6"
    },
    {
        "title": "Seedless Summer Salad",
        "ingredients": [
            "4 tomatoes, seeded and diced ADVERTISEMENT",
            "1 cucumber, seeded and chopped ADVERTISEMENT",
            "1 Granny Smith apple, cored and diced ADVERTISEMENT",
            "1 (5 ounce) can tuna, drained and flaked ADVERTISEMENT",
            "3 tablespoons prepared basil pesto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, toss together the tomatoes, cucumber, apple and tuna. Stir in the basil pesto until everything is evenly coated. Serve immediately, or chill until serving.\n",
        "picture_link": "Vs1WSCH9DgYKfC6Q/VZW6BnHCIPASXq"
    },
    {
        "title": "Honeyed Habanero and Toasted Garlic Tartar Sauce",
        "ingredients": [
            "3 tablespoons corn oil ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "2 habanero peppers, seeded and minced ADVERTISEMENT",
            "1/2 teaspoon flaked sea salt ADVERTISEMENT",
            "1 1/2 teaspoons honey ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "2 tablespoons heavy cream ADVERTISEMENT",
            "1 dill pickle, minced ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the corn oil in a skillet over medium heat. Stir in the garlic, habanero peppers, and sea salt. Cook and stir until the garlic begins to brown, about 5 minutes. Stir honey into water until dissolved, then pour into garlic mixture. Simmer until the water has almost evaporated, then scrape the mixture into a metal bowl.\nStir in cream, pickle, and mayonnaise. Place mixture into refrigerator, and chill until cold. Season to taste with salt and pepper before serving.\n",
        "picture_link": "3wlYjpvygvZwDwIKsGM9XnGW8USUbIC"
    },
    {
        "title": "Easy Wakame Brown Rice",
        "ingredients": [
            "2 1/4 cups water ADVERTISEMENT",
            "1 cup brown rice ADVERTISEMENT",
            "1 tablespoon butter (optional) ADVERTISEMENT",
            "1 teaspoon salt (optional) ADVERTISEMENT",
            "1 tablespoon dried wakame seaweed flakes ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 ripe avocado, diced ADVERTISEMENT",
            "2 teaspoons toasted sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water, brown rice, butter, and salt to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until tender, 45 to 50 minutes.\nSoak wakame in 2 cups of water for 5 minutes; drain in a mesh strainer. Scoop rice into a bowl, and gently fold in wakame, avocado, and sesame seeds. Serve warm or cold.\n",
        "picture_link": "J6ApqTaq0/lyGtfAk/qtGJo8MLq5MUG"
    },
    {
        "title": "Parsley-Pistachio Rice Salad",
        "ingredients": [
            "1/2 cup basmati rice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 teaspoon coarse grained mustard ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "2 tablespoons chopped fresh mint leaves ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1/2 red bell pepper, seeded and diced ADVERTISEMENT",
            "1/4 cup chopped pistachio nuts ADVERTISEMENT",
            "1/4 cup chopped pitted kalamata olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the rice and water in a small saucepan. Bring to a boil, then reduce the heat to low and simmer until rice has absorbed all of the water, about 20 minutes. Transfer to a bowl and set aside to cool.\nIn a separate bowl, whisk together the olive oil, lemon juice and mustard. Season with salt and pepper. Pour the dressing over the rice, and stir in the parsley, mint, tomatoes, bell pepper, pistachios and olives.\n",
        "picture_link": "TFDsz3t48cRVxpyI8QBJEG2mgRZ4sUW"
    },
    {
        "title": "Djente di Kacho (Dog's Teeth Coconut Candy)",
        "ingredients": [
            "1 whole coconut, shelled and drained ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop the coconut meat into pieces about 1/2 inch square.\nPlace water in a saucepan, and bring to a boil over medium-high heat. Stir in cinnamon and sugar until dissolved. Boil mixture until liquid reduces to a syrup consistency, then stir in coconut pieces. Add the lime juice, and turn off heat.\nPlace spoonfuls of sugared coconut mixture into small paper cups. Cool in cups until hardened.\n",
        "picture_link": "hnWsF8ar9MPebi7FhSNXHQxyV2WJQAW"
    },
    {
        "title": "Less-Butter Steak Diane",
        "ingredients": [
            "1/2 cup beef broth ADVERTISEMENT",
            "1/2 cup dry red wine ADVERTISEMENT",
            "1 1/2 cups sliced mushrooms ADVERTISEMENT",
            "1/4 cup finely chopped shallot ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "3 teaspoons fresh lemon juice ADVERTISEMENT",
            "3 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1 pinch ground black pepper, or to taste ADVERTISEMENT",
            "2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 pound trimmed beef tenderloin, slightly pounded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the beef broth and wine into a large skillet, and stir in the mushrooms, shallot, garlic, lemon juice, and Worcestershire sauce. Simmer over medium heat , stirring frequently, until the mushrooms reduce in size, about 20 minutes. Season to taste with salt and pepper.\nSkim off 2 tablespoons liquid from the mushroom mixture, and pour into a small bowl. Whisk in the flour and blend to make a smooth paste. Stir the flour mixture into the mushroom mixture. Cook and stir as sauce thickens. Repeat as desired , adding small amounts of more flour to make a thicker sauce. Stir in the parsley. Pour the sauce into a pan, and keep warm until needed.\nUsing the same skillet, melt the butter over medium heat. Place the tenderloin in the skillet, and cook over medium-high heat, turning once, until desired degree of doneness. Serve with mushroom sauce.\n",
        "picture_link": "Nn9mTkYhqmaMyo2LGtI6Z3t85oCa7Le"
    },
    {
        "title": "Strawberry-Lime Slushie",
        "ingredients": [
            "2 cups strawberry sorbet ADVERTISEMENT",
            "1 cup lime sorbet ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "1/4 cup sliced strawberries ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 cups ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place strawberry and lime sorbets, lime juice, strawberries, orange juice, and ice cubes in a blender and puree until smooth.\n",
        "picture_link": "JdvzOpS8wEOf/dFaU6cNf9biz6yw0ua"
    },
    {
        "title": "Skillet Custard with Berry Sauce",
        "ingredients": [
            "Berry Sauce: ADVERTISEMENT",
            "2 tablespoons frozen grape juice concentrate, thawed ADVERTISEMENT",
            "1 cup blackberries ADVERTISEMENT",
            "1/2 cup chopped strawberries ADVERTISEMENT",
            "1/2 cup blueberries ADVERTISEMENT",
            "Custard: ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "3 tablespoons rice flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 tablespoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make berry sauce, stir together grape juice concentrate, strawberries, blackberries, and blueberries in a saucepan over medium heat until the berries pop, and the mixture begins to bubble. Turn the heat to medium-low, and simmer until thickened, stirring occasionally, 5 to 10 minutes. Once thick, pour into a serving dish, and allow to cool 15 minutes at room temperature, or refrigerate until cold.\nWhisk together eggs, cream, milk, and sugar in a bowl until the sugar has dissolved, then whisk in the rice flour, baking powder, cinnamon, clove, and allspice.\nHeat an 8 inch nonstick skillet over medium-low heat. Add 1/2 cup of the egg mixture, and cook until firm, then fold in half and remove to a serving plate. Repeat with remaining custard mixture. Spoon the cooled berry sauce over custards to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Slippery Frog",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger vodka ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger coffee flavored liqueur ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger Irish cream liqueur ADVERTISEMENT",
            "3 fluid ounces half-and-half ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger creme de menthe ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill an 8 ounce tumbler with ice. Pour in the vodka, coffee flavored liqueur, Irish cream, and half-and-half; stir. Drizzle creme de menthe on top to garnish.\n",
        "picture_link": "vyZbYyjBy2NF0CXRV9Mp.EtgzKw2oOi"
    },
    {
        "title": "Fruity Guacamole",
        "ingredients": [
            "1 avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1 1/2 teaspoons minced red onion ADVERTISEMENT",
            "1 teaspoon minced seeded serrano chile ADVERTISEMENT",
            "12 red grapes, halved ADVERTISEMENT",
            "1/2 cup fresh diced peaches ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons pomegranate seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently mash the avocado with the onion and serrano pepper in a bowl. Mix in the grapes and peaches. Season with salt and, if desired, garnish with pomegranate seeds to serve.\n",
        "picture_link": "UZnMpQeYUOZ66T3eoy6wo7mVNmeOCJS"
    },
    {
        "title": "Movies 'Till Dawn",
        "ingredients": [
            "1 cup ice cubes ADVERTISEMENT",
            "4 fluid ounces pineapple juice ADVERTISEMENT",
            "2 fluid ounces rum ADVERTISEMENT",
            "1 fluid ounce vanilla schnapps ADVERTISEMENT",
            "1 fluid ounce triple sec ADVERTISEMENT",
            "1 lime wedge ADVERTISEMENT",
            "2 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a highball glass with ice, and pour in the pineapple juice, rum, vanilla schnapps, and triple sec. Stir to mix, and garnish with lime and maraschino cherries to serve.\n",
        "picture_link": "E884uz8VlHuY0ouyuBQVJ6zZv/FyZQW"
    },
    {
        "title": "Broiled Salmon Mignons",
        "ingredients": [
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pound skinless salmon fillet, cut into 6 - 3/4 inch strips ADVERTISEMENT",
            "coarsely ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler to 500 degrees; set the oven rack about 6 inches from the heat source. Combine the balsamic vinegar and the garlic in a small bowl; reserve.\nRoll the salmon strips, beginning on the thickest side, into 6 pinwheels. Secure with wooden skewers. Drizzle the balsamic and garlic mixture generously over each pinwheel.\nPlace salmon under hot broiler and cook for 7 minutes. Turn pinwheels over; cook until edges are brown, and fish is easily flaked with a fork, about 7 additional minutes. Sprinkle with pepper before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Potatoes with Fresh Ginger and Chilies",
        "ingredients": [
            "4 large potatoes, peeled and diced ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "2 teaspoons minced fresh ginger ADVERTISEMENT",
            "1 green chile pepper, seeded and diced ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 ripe tomatoes, peeled and chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh curry leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes in a large pot of salted water, and bring to a boil. Cook until tender but still firm, about 15 minutes. Drain, and cool.\nHeat the oil in a skillet over medium heat. Stir in the ginger and chile pepper; cook 2 minutes. Stir in the turmeric; cook 30 seconds. Combine the potatoes with the chile pepper mixture. Add salt as desired. Stir and cook 5 to 10 minutes more. Stir in the tomatoes and curry leaves; cook another 2 to 3 minutes. Serve immediately.\n",
        "picture_link": "Z1pZQ181LW/XOtrUxudwZFg9PLU9bXm"
    },
    {
        "title": "Strawberry Rosewater Ice Cream",
        "ingredients": [
            "1 1/2 cups fresh strawberries, hulled ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "1/2 pint milk ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 pint heavy cream ADVERTISEMENT",
            "1/4 cup rosewater ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the strawberries and 1/3 cup sugar in a bowl; mash together with a potato masher. Store the mixture in the refrigerator while preparing the rest of the recipe.\nStir together the egg yolks, milk, salt and 1/3 cup sugar in a saucepan over medium heat. Heat to 175 degrees F (80 degrees C), making sure the mixture does not boil; transfer to a chilled bowl and move to the refrigerator to cool, stirring occasionally. Once cooled, stir in the cream, rosewater, and strawberry mixture.\nFill an ice cream maker with the mixture, and freeze according to the manufacturer's instructions.\n",
        "picture_link": "66wI7Tnk7RcrWFPrJdUca6p9PR6zlMO"
    },
    {
        "title": "Individual Grilled Veggie Pizzas",
        "ingredients": [
            "1 large portobello mushroom, sliced ADVERTISEMENT",
            "1 small zucchini, sliced ADVERTISEMENT",
            "1/4 pound butternut squash - peeled, seeded, and thinly sliced ADVERTISEMENT",
            "1 cup bite-size broccoli florets ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 ounces refrigerated pizza crust ADVERTISEMENT",
            "1/4 cup pesto ADVERTISEMENT",
            "1/4 cup crumbled Gorgonzola or blue cheese ADVERTISEMENT",
            "1/4 cup fontina cheese, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat.\nPlace the mushrooms, zucchini, squash, broccoli, and onion in a grill pan, and brush with 2 tablespoons olive oil. Cook on preheated, covered grill until tender when pierced with a fork, about 5 minutes. Remove from grill and set aside.\nRoll out pizza dough on a floured surface to make two 8 inch circles 1/4 inch thick. Place onto pizza pans. Brush tops with remaining 1 tablespoon olive oil.\nBake on preheated, covered grill until browned, turning once, about 3 minutes each side. Remove from grill and spread with pesto. Top with cooked vegetables. Sprinkle with blue and fontina cheeses. Return to grill, cover, and cook until cheese melts, about 3 minutes.\n",
        "picture_link": "bmH8QFB6l5NHNmrqJ7.kDmvjhHPNenO"
    },
    {
        "title": "Hot Asiago Dip",
        "ingredients": [
            "1 cup nonfat cottage cheese ADVERTISEMENT",
            "1/3 cup nonfat cream cheese ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/4 cup grated Asiago cheese ADVERTISEMENT",
            "2 green onions, finely sliced ADVERTISEMENT",
            "1 fresh jalapeno pepper, seeded and minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cottage cheese and cream cheese in a blender or bowl of a food processor. Blend until smooth. Add the mustard, Asiago cheese, green onions, and jalapeno pepper, and blend until thoroughly mixed, about 30 seconds. Scoop into a 2 cup microwavable dish.\nPlace in the microwave, and cook on High until heated through, about 3 minutes. Serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apple Lattice Fruit Bake",
        "ingredients": [
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "6 Granny Smith apples - peeled, cored and sliced ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup chopped dried mixed fruit ADVERTISEMENT",
            "1 sheet frozen puff pastry, thawed ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nStir together brown sugar, water, and flour in a large bowl until smooth. Add the apples, pecans, and dried fruit; toss in the brown sugar mixture until well coated. Pour into a 9x13 inch baking dish. Cut the puff pastry into ten 1-inch strips with a pizza cutter. Lay 5 of the strips over the apples lengthwise, and cut the remaining 5 strips in half. Place the 10 smaller strips over the apples widthwise to create the lattice. Stir together the white sugar and cinnamon, and sprinkle over the lattice.\nBake in preheated oven until the apple mixture is bubbling, and the lattice is golden brown, 40 to 45 minutes.\n",
        "picture_link": "VHe867OUujd7OMqPdSMrzDSfzjRQaTi"
    },
    {
        "title": "Springerle III",
        "ingredients": [
            "4 egg whites ADVERTISEMENT",
            "4 cups sifted confectioners' sugar ADVERTISEMENT",
            "4 egg yolks, beaten ADVERTISEMENT",
            "3 1/2 cups cake flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons anise seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites. Add sifted powdered sugar and beaten egg yolks. Beat for 15 minutes (!)\nSift cake flour with baking powder and salt.\nWhen you roll them out, use just enough flour to roll easily. Roll lightly to 1/4 or 1/2 inch thickness and press design into dough with a well-floured 'Springerle' rolling pin - but don't go all the way through the dough. (The rolling pin has designs cut into it. They sell them in specialty stores.)\nButter a cookie sheet and then sprinkle it with anise seed. Cut each section apart carefully and transfer the cookies to the sheet.\nLet stand overnight to set the design. Otherwise, they sort of melt into themselves.\nPreheat oven to 350 degrees F (180 degrees C).\nBake for 15 minutes. Do not brown. Springerles are hard at first, but if you store them in a bread box they become tender.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Jumbo Raisin Spice Cookies",
        "ingredients": [
            "3 cups unbleached all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup unsalted butter ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 cups raisins ADVERTISEMENT",
            "2 cups salted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, beat butter until soft. Mix in the vanilla and sugar. Add the eggs and mix well. In a separate bowl, sift together the flour, baking powder, baking soda, salt, ginger cinnamon and nutmeg. Gradually stir into the butter mixture. Stir in raisins and peanuts. Mixture will be stiff. Take tablespoon-sized pieces of dough and roll into a ball. Place onto cookie sheets and flatten slightly to 1/2 inch thickness.\nBake for 15 to 18 minutes in the preheated oven. Let cool on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]