[
    {
        "title": "Pineapple Cranberry Salad",
        "ingredients": [
            "2 (3 ounce) packages raspberry flavored Jell-O® mix ADVERTISEMENT",
            "1 (16 ounce) can whole cranberry sauce ADVERTISEMENT",
            "1/2 teaspoon orange zest ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 (20 ounce) can pineapple tidbits, drained ADVERTISEMENT",
            "3/4 cup sliced celery ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain and reserve syrup from pineapple, add water to equal 1 cup.\nIn a saucepan over medium heat, bring the pineapple juice to a boil, add gelatin and stir until dissolved. Remove from heat, add cranberry sauce, orange peel, orange juice and lemon juice. Blend together and cool until slightly thickened.\nStir in pineapple and celery, turn into mold or 8 inch square pan. Chill until firm.\n",
        "picture_link": "QcWLx07stX.DZU50Xg5CxnnESEZV6VG"
    },
    {
        "title": "Yogurt Shrimp Fettuccine",
        "ingredients": [
            "16 ounces dry fettuccine pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 pounds medium shrimp - peeled and deveined ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "1 tablespoon minced shallots ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "2 tablespoons brandy ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "4 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente. Drain and set aside.\nHeat butter or margarine in a large skillet. Add the shrimp, salt and pepper to taste and paprika. Stir with a wooden spatula. When the shrimp become pink (it should take 2 to 3 minutes), remove them with a slotted spoon, leaving the cooking liquid in the skillet.\nAdd red and green bell peppers, shallots, garlic and salt and pepper to taste. Cook, stirring, about 3 to 4 minutes over medium high heat. Add cognac and shrimp. Cook over medium heat for 2 more minutes.\nAdd sour cream and yogurt and blend all together. Add cilantro and bring to a simmer for about 30 seconds. Do not boil or sauce will separate. Serve over cooked fettuccine.\n",
        "picture_link": "M8UfarPruth/Xht9ZeWZHiXe2sOMWFi"
    },
    {
        "title": "Asian Noodle Salad",
        "ingredients": [
            "8 ounces capellini pasta ADVERTISEMENT",
            "1/2 pound shiitake mushrooms ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in a large pot of boiling water. Meanwhile, clean, stem, and slice mushrooms. Add mushrooms and red bell pepper during last 2 minutes of cooking. Drain.\nIn a small bowl, mix together vinegar, soy sauce, oil, and ginger.\nTransfer pasta, mushrooms, and pepper to a serving bowl; toss with ginger dressing. Sprinkle with parsley before serving.\n",
        "picture_link": ".OKU9F8YzvXd54QOuyIGjl3D3UzGInm"
    },
    {
        "title": "Lettuce, Avocado and Sunflower Seed Salad",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1 1/2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 1/2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "2 heads Bibb lettuce - rinsed, dried and torn ADVERTISEMENT",
            "1/3 cup sunflower seeds ADVERTISEMENT",
            "2 avocados - peeled, pitted and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the olive oil, red wine vinegar, balsamic vinegar, garlic and mayonnaise. Season with salt and pepper to taste.\nIn a salad bowl, combine the lettuce and sunflower seeds. Toss with enough dressing to coat. Top with sliced avocado and serve.\n",
        "picture_link": "y6DvWc2YYqTB0TvcjrCmQXS/iun..l2"
    },
    {
        "title": "Special Oatmeal Cookies",
        "ingredients": [
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "2/3 cup butter, melted ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1 cup granulated artificial sweetener ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nStir together the oatmeal and margarine. Blend in the egg whites and sweetener. Stir together the flour, salt and baking powder; add to the mixture alternately with the milk and vanilla; stirring between additions. Finally, stir in the raisins and walnuts.\nDrop by teaspoonfuls 1 to 2 inches apart onto the prepared cookie sheets. Bake for 10 to 15 minutes in the preheated oven.\n",
        "picture_link": "Q2KFonHxeeiQFnej8IEVJ5Dc1ukautO"
    },
    {
        "title": "Salad Ole",
        "ingredients": [
            "2 cups tomatoes, seeded and chopped ADVERTISEMENT",
            "1 cup diced zucchini ADVERTISEMENT",
            "1 cup frozen corn kernels ADVERTISEMENT",
            "1/3 cup chopped green onions ADVERTISEMENT",
            "1 avocado - peeled, pitted and diced ADVERTISEMENT",
            "1/3 cup picante sauce ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the tomatoes, zucchini, corn, green onions, and avocado.\nWhisk together the picante sauce, oil, lemon juice, garlic salt, and cumin. toss gently with the vegetables. Chill 3-4 hours, and toss before serving.\n",
        "picture_link": "fqIvaTgJYP8ZjZGfilSpDmKm.Y66wye"
    },
    {
        "title": "Turducken",
        "ingredients": [
            "1 (3 pound) whole chicken, boned ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Creole seasoning to taste ADVERTISEMENT",
            "1 (4 pound) duck, boned ADVERTISEMENT",
            "1 (16 pound) turkey, boned ADVERTISEMENT",
            "3 cups prepared sausage and oyster dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lay the boned chicken skin-side down on a platter and season liberally with salt, pepper and Creole seasoning. Lay the boned duck skin-side down on top of the chicken and season liberally with salt, pepper and Creole seasoning. Cover and refrigerate.\nLay the boned turkey skin-side down on a flat surface. Cover with a layer of cold Sausage and Oyster Dressing and push the dressing into the leg and wing cavities so they will look as if they still have bones in them.\nLay the duck on top of the turkey skin-side down and cover it with a layer of cold dressing. Lay the chicken on top of the duck skin-side down and cover it with a layer of cold dressing.\nWith the help of an assistant, bring the edges of the turkey skin up and fasten them together with toothpicks. Use the kitchen string to lace around the toothpicks to help hold the stuffed turkey together. Carefully place the turducken, breast up in a large roasting pan.\nRoast covered for 4 hours or until the turducken is golden brown. Continue to roast uncovered for 1 hour or until a meat thermometer inserted through the thigh registers 180 degrees F. and a thermometer inserted through the stuffing registers 165 degrees F. Check the turducken every few hours to baste and remove excess liquid. There will be enough pan juices for a gallon of gravy. Carve and serve.\n",
        "picture_link": "g8rIgRpJGME6eUQiUQ9aGu6dWFCIGI."
    },
    {
        "title": "Granny's White Bread",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1/3 cup margarine ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "4 teaspoons salt ADVERTISEMENT",
            "3 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 cup dry potato flakes ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "10 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk in a large saucepan over low heat until it bubbles; stir in butter or margarine, sugar and salt, then cool until lukewarm. Add warm water and potatoes and sprinkle in yeast until it dissolves. Then stir in 6 cups of the flour and mix all together. Add the remaining 4 to 5 cups of flour and mix. Let rest 15 minutes.\nTurn dough out on a floured surface and knead softly until dough is elastic and smooth. Lightly oil a large mixing bowl; add dough and turn to coat. Cover with a damp cloth and let rise 1 hour or until dough has doubled in volume.\nPreheat oven to 400 degrees F (200 degrees C). Lightly grease two 9x5 inch loaf pans.\nPunch down dough and divide into 3 to 4 sections. Shape into loaves and let rise, covered, until volume is nearly doubled.\nBake at 400 degrees F (200 degrees C) for 30 minutes or until loaves sound hollow when tapped on the bottom.\n",
        "picture_link": "miFY9naVhhEH/TumogJMQqfbqE8amsC"
    },
    {
        "title": "Potato Salad II",
        "ingredients": [
            "3 potatoes, peeled and quartered ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "4 tablespoons creamy salad dressing (e.g. Miracle Whip) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a medium saucepan with enough water to cover. Add 2 teaspoons salt. Bring to a boil; cook until tender, about 15 minutes. Drain, and allow to cool until easily handled but still warm.\nCut potatoes into bite size pieces, and transfer to a medium mixing bowl. Add salad dressing, and gently stir until well coated. Season with salt and pepper to taste. Serve warm.\n",
        "picture_link": "DB0gkLPtJown99rVyyhpjx//Fy9jMT."
    },
    {
        "title": "Southwest Appetizer Cheesecake",
        "ingredients": [
            "2 cups crushed tortilla chips ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 1/4 cups shredded Colby cheese ADVERTISEMENT",
            "8 ounces cottage cheese ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 ounces chopped green chile peppers ADVERTISEMENT",
            "8 ounces jalapeno cheese dip ADVERTISEMENT",
            "8 ounces sour cream ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "4 ounces sour cream ADVERTISEMENT",
            "2 (2 ounce) cans sliced black olives ADVERTISEMENT",
            "2 bunches green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine crushed tortilla chips and melted butter in a small mixing bowl. Press mixture into a 9-inch springform pan to form the crust.\nIn a large mixing bowl, combine cream cheese, Colby-Jack cheese, cottage cheese, eggs and green chile peppers. Spread this mixture evenly into the crust.\nBake for 1 hour. When finished baking, remove cake from oven and let cool 5 minutes.\nCombine the jalapeno dip and 8 ounces sour cream in a small mixing bowl. Spread this mixture over the cheesecake to cover any cracks. Return to cake the oven and bake 10 minutes.\nRemove the cake from the oven and let it cool for at least 4 hours. When cooled, dollop remaining sour cream on top of the cake (in the center). Arrange the tomatoes, black olives, and green onions around the sour cream in concentric circles.\n",
        "picture_link": "ffZWV3DuEE5epvo4QmuN7lSM2NnNmfu"
    },
    {
        "title": "Pumpkin Scones",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 cups mashed, cooked pumpkin ADVERTISEMENT",
            "4 cups self-rising flour, sifted ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a mixing bowl, beat together butter, sugar, eggs and pumpkin. Stir in flour, cinnamon, nutmeg and salt by hand.\nRoll out into 1/2 inch thickness and cut into rounds. Place on tray close together and bake for 15 to 18 minutes.\n",
        "picture_link": "GmHMWuZS/PqFHx9kQtPfoo/apOEFpD."
    },
    {
        "title": "Apple Butter II",
        "ingredients": [
            "2 (16 ounce) jars applesauce ADVERTISEMENT",
            "2 1/2 cups packed brown sugar ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 2 quart casserole combine applesauce, sugar, vinegar, cloves and cinnamon. Bake uncovered for 2 1/2 hours or until mixture is very thick. Stir occasionally during baking.\nAllow to cool and place in jars or freezer containers.\n",
        "picture_link": "/MwzjIuwwrPgcCN7qWwyYunhkRpY8M."
    },
    {
        "title": "Aunt Wanda's Turkey Carcass Soup",
        "ingredients": [
            "1 carcass ADVERTISEMENT",
            "3 large carrots, chopped ADVERTISEMENT",
            "1 (15 ounce) can cut green beans, drained ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup chopped fresh spinach ADVERTISEMENT",
            "1 cup chopped cabbage ADVERTISEMENT",
            "2 cups white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pick your Thanksgiving turkey nearly clean. (Turkey salad is great for a few days, or even turkey pot pies.) We are not real concerned about the choice meat here. Dump the turkey and all of its debris, including the juices, into a large pot. Add green beans, celery, spinach, cabbage, and white rice. Pour in enough water to cover everything.\nBring soup to a boil. Reduce heat, and simmer for an hour or so. Add more water as needed.\nRemove all turkey bones and unwanted debris (i.e., skin, cartilage, etc.). There you have it. It's kind of a culinary scrapbook of your Turkey Day.\n",
        "picture_link": "vI/qa7oDd1EkoM0J9bbWW9twg.2XOmS"
    },
    {
        "title": "Apple and Feta Pan Fried Pizzas",
        "ingredients": [
            "6 1/2 ounces dry pizza crust mix ADVERTISEMENT",
            "1/2 cup hot water ADVERTISEMENT",
            "5 tablespoons olive oil ADVERTISEMENT",
            "8 ounces crumbled feta cheese ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1/2 tablespoon butter ADVERTISEMENT",
            "4 apples, cored and chopped ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine contents of the pizza dough package and 1/2 cup hot water. Stir vigorously, about 25 strokes. Set the bowl in a warm place (about 85 degrees F, or 35 degrees C) for 5 minutes. Turn dough onto floured board, divide the dough into 8 small sections. Knead the dough and shape it into rounds.\nPreheat the oven to 300 degrees F (150 degrees C).\nIn a large skillet, heat the olive oil. Add the dough and fry until the dough is lightly browned, flipping once to brown on both sides. Once cooked, place the circles on a cookie sheet. Sprinkle the feta, red onion, and thyme on top of the circles.\nBake the pizzas until the feta begins to brown, about 10 to 12 minutes.\nWhile the pizzas bake, in the previously used skillet, heat 1/2 tablespoon of butter and a few sprigs of thyme. Mix the apples into the skillet, and cook until the apples are soft and golden. Lay the apples on top of the pizzas, season with pepper, and serve.\n",
        "picture_link": "tRW0tlHzwwZeeBqBb/g2tFyjrLpyupO"
    },
    {
        "title": "Cracker Jack Cookies I",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 cups quick cooking oats ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "1 1/2 cups chopped salted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the butter, white sugar and brown sugar. Beat in the eggs one at a time, then stir in the vanilla. Sift together the flour, baking soda, baking powder and salt, stir into the creamed mixture. Gently stir in the oatmeal, coconut, rice cereal and chopped peanuts, try not to pulverize the rice cereal.\nDrop dough by teaspoonfuls onto the prepared cookie sheets. Bake for 10 to 12 minutes in the preheated oven. Remove from cookie sheets to cool on wire racks.\n",
        "picture_link": "bAwHsZndkkdu.RSXzP9i/RlazPGvATO"
    },
    {
        "title": "Oatmeal Coconut Thin Crisps",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Cover cookie sheets with foil, and generously grease the foil. These cookies will be very sticky.\nIn a medium bowl, stir together the sugar, rolled oats, and flour. Stir in the egg, melted butter, and vanilla. Stir in the coconut. The batter should be sticky and thick, but pull away from the sides of the bowl. Drop teaspoon sized amounts of dough onto the prepared cookie sheets, three inches apart, and a few inches from the sides of the pan.\nBake for 12 to 15 minutes in the preheated oven, or until golden brown. Wait until cookies are completely cooled before removing them from the baking sheet.\n",
        "picture_link": "WUFI/bvirXBroWHcWbFHJfwsq8RKcMu"
    },
    {
        "title": "Mom's Turnips",
        "ingredients": [
            "3 turnips, peeled and chopped ADVERTISEMENT",
            "1 pound bacon ADVERTISEMENT",
            "4 tablespoons rendered bacon fat ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of salted water to a boil. Add turnips; cook until tender but still firm. Drain, and transfer to a large bowl to cool.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Crumble and set aside. Reserve bacon fat.\nIn the large bowl, combine turnips, bacon, reserved bacon fat and brown sugar. Mix together and serve.\n",
        "picture_link": "yT/P2KvJT8oKWgZk5HvXDCTWfyLMSlW"
    },
    {
        "title": "Tuna And Bean Salad",
        "ingredients": [
            "1 cup frozen French-style green beans ADVERTISEMENT",
            "1 (5 ounce) can tuna, drained ADVERTISEMENT",
            "1/2 cup drained canned cannellini beans ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together green beans, tuna, cannellini beans, chopped onion, olive oil, lemon juice, garlic, and cheese. Season to taste with salt and black pepper. Cover, and chill in the refrigerator for about 2 hours.\n",
        "picture_link": "jaIDsyC2evBg4OzhdNo/zYmlciD5Kam"
    },
    {
        "title": "Original Buffalo Wings",
        "ingredients": [
            "4 pounds chicken wings ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 cups vegetable oil ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 teaspoons hot pepper sauce ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fat fryer or large heavy pot to 375 degrees F (190 degrees C).\nCut off tips, and separate each wing at the joint. Sprinkle with salt and pepper.\nPlace half of the wings in the deep fryer. When the wings are golden brown and crisp, remove them and drain well. Salt wings to taste. Add remaining wings and repeat frying process. Once wings have drained a bit, place them in a large mixing bowl.\nMelt butter or margarine in a small saucepan. Mix in hot sauce and vinegar. Pour melted sauce over the cooked wings, and mix to coat the wings with sauce.\n",
        "picture_link": "MeNtqixEoRmg2PNBrxeKbo3ZMjAPHGO"
    },
    {
        "title": "Chocolate Walnut Rum Balls",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons light corn syrup ADVERTISEMENT",
            "1/2 cup dark rum ADVERTISEMENT",
            "2 1/2 cups vanilla wafer crumbs ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate over a double boiler, stirring until smooth. Remove from the heat and whisk in 1/2 cup of sugar and the corn syrup, then the rum. In a separate bowl, stir together the vanilla wafer crumbs and walnuts. Add the chocolate mixture to the nut mixture and stir until well blended.\nPlace the remaining 1/2 cup of sugar in a shallow bowl. Roll the dough into 1 inch balls and roll the balls in the sugar to coat evenly. Cover and refrigerate at least overnight for best flavor. These can be refrigerated up to 5 days.\n",
        "picture_link": "GNvqSpZI/I.Rypyq8HLDIglc6RB4omu"
    },
    {
        "title": "Italian Meat Loaf",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 1/2 cups dry bread crumbs ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 pinch Italian seasoning, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCombine beef, bread crumbs, Parmesan cheese, eggs, Worcestershire sauce, garlic, and Italian seasoning in a large bowl. Season with salt and black pepper. Transfer mixture to a 9x5-inch loaf pan.\nBake in the preheated oven until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "DsroANmXtl/8pcOVfIqVpcIfTzh6qUK"
    },
    {
        "title": "Oven-Baked Onion Rings ",
        "ingredients": [
            "1 yellow onion - ends trimmed off, peeled, and cut crosswise into 1/2-inch slices ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "3 cups panko bread crumbs, or more if needed ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nSeparate onion slices into individual rings.\nWhisk egg whites with milk in a bowl until thoroughly combined; season egg mixture with a pinch of cayenne pepper. Place panko crumbs into a separate bowl.\nPlace onion rings into a large resealable plastic bag. Add flour, salt, and black pepper; seal bag and shake until rings are well coated with flour.\nDrop flour-coated onion rings into egg white-milk mixture, a few at a time, and toss lightly with tongs until coated. Place rings into panko crumbs and gently shake the bowl to toss the crumbs with the onion rings until rings are coated with crumbs.\nTransfer coated onion rings to a large baking sheet; spray rings lightly with cooking spray.\nBake in the preheated oven until onion rings are tender and crumbs are lightly golden brown, 12 to 15 minutes.\n",
        "picture_link": "QNgODDbrAUb/dOQ3KUCcN9YQ.s0l4Ce"
    },
    {
        "title": "Hot Dog Chili Sauce",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 (14.5 ounce) cans reduced-sodium beef broth ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes with puree ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add beef broth to ground beef; bring to a boil. Reduce heat to medium-low and simmer until liquid is slightly reduced, about 30 minutes.\nMix tomatoes with puree, chili powder, paprika, onion powder, garlic powder, salt, and cayenne pepper into ground beef mixture. Simmer, stirring occasionally, until mixture is very thick, about 1 1/2 hours.\n",
        "picture_link": "sllEzlUR1mt8nwCStr0h/V/CR4bxwvS"
    },
    {
        "title": "Chicken Paprika",
        "ingredients": [
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, 2 tablespoons paprika, salt, and pepper on a shallow plate. Dip chicken pieces in mixture to coat.\nHeat vegetable oil in a heavy skillet over medium heat. Cook and stir chicken in hot oil until browned completely, about 5 minutes. Remove chicken with a slotted spoon to a bowl, reserving oil and drippings in skillet.\nCook and stir onion and garlic in the reserved drippings until tender, about 5 minutes. Return chicken to the skillet. Pour chicken stock over the chicken mixture. Stir tomato paste into the chicken stock until integrated completely.\nBring the chicken stock to a boil, reduce heat to medium-low, place a cover on the skillet, and cook at a simmer until the chicken is cooked through, 5 to 8 minutes.\nWhisk sour cream, 1 teaspoon paprika, and cornstarch together in a small bowl; stir into the chicken mixture and cook until hot, 2 to 3 minutes.\n",
        "picture_link": "D24PEICutkybPFc/mERw7zelJTBsAW."
    },
    {
        "title": "Creamy Coconut Milk Rice Pudding",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 1/2 cups basmati rice ADVERTISEMENT",
            "3 cups coconut milk ADVERTISEMENT",
            "1 1/2 cups raw sugar ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup unsalted butter ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 (15 ounce) can sliced peaches, drained and chopped (optional) ADVERTISEMENT",
            "1 cup raisins, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid has been absorbed, about 20 minutes.\nCombine rice, coconut milk, sugar, and salt in a large saucepan; bring to a boil. Reduce heat and simmer until pudding is thick and creamy, 18 to 20 minutes. Stir milk and eggs into pudding, stirring constantly to keep pudding from sticking, at least 2 minutes.\nRemove pudding from heat and stir butter, vanilla, cinnamon, and nutmeg into pudding until thoroughly mixed. Fold peaches and raisins into pudding.\n",
        "picture_link": "4xkRJbo3CrJxziyS9amAEZgPXIQK6UW"
    },
    {
        "title": "Peas and Pancetta",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 ounces pancetta, chopped ADVERTISEMENT",
            "3 tablespoons chopped onion ADVERTISEMENT",
            "1 pound frozen peas, thawed ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh thyme leaves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a frying pan over medium heat; cook and stir pancetta and onion in the hot oil until pancetta is translucent, about 5 minutes. Stir peas, white wine, thyme, salt, and pepper into pancetta mixture; bring to boil. Reduce heat and simmer until peas are tender and liquid is slightly reduced, 3 to 5 minutes.\n",
        "picture_link": "8aDayIXA7CmU1HC3vB8hoKgeb7o5yUq"
    },
    {
        "title": "Mushroom Cream Gravy Sauce",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 shallots, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (4 ounce) package sliced button mushrooms ADVERTISEMENT",
            "1 tablespoon minced fresh rosemary ADVERTISEMENT",
            "6 tablespoons white wine, divided ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon grated Parmesan cheese, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a heavy-bottomed pan over medium heat until foamy; cook and stir shallots and garlic in the melted butter for 3 minutes. Add mushrooms and rosemary; stir to coat, 1 minute.\nPour 1/4 cup white wine into mushroom mixture; cook and stir until mushrooms are golden brown, 3 to 5 minutes. Increase heat to medium-high; add cream and 2 tablespoons white wine. Cook and stir until gravy is creamy and thick, about 5 minutes. Season with salt and pepper; sprinkle with Parmesan cheese.\n",
        "picture_link": "32uIihslEbzPJEz2sDqfQvi.cDmblJ2"
    },
    {
        "title": "Pumpkin Banana Smoothie",
        "ingredients": [
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 banana, sliced ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spoon pumpkin puree into a resealable bag and freeze, 8 hours to overnight.\nRemove pumpkin from freezer and allow to soften at room temperature, 5 to 10 minutes.\nPour milk into the blender; add pumpkin, banana, brown sugar, cinnamon, and vanilla extract. Blend until smooth, about 3 minutes.\n",
        "picture_link": "z.UCDwRWyTv7mQ.cH8Bvqz6dqPGTKrq"
    },
    {
        "title": "Butternut Squash With Cranberries and Almonds",
        "ingredients": [
            "1 1/2 cups chicken stock ADVERTISEMENT",
            "1 small butternut squash, peeled and cut into bite-size cubes ADVERTISEMENT",
            "1/2 small red onion, sliced ADVERTISEMENT",
            "3 tablespoons orange-flavored dried cranberries ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 tablespoons slivered almonds ADVERTISEMENT",
            "1 teaspoon shredded Parmesan cheese, or to taste (optional) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken stock, butternut squash, red onion, and cranberries to a boil in a saucepan, reduce heat to low, and simmer until squash is tender when pierced with a fork, about 15 minutes. Drain.\nHeat butter and olive oil together in a large skillet over medium heat. Gently stir butternut squash mixture into hot butter and oil; sprinkle with brown sugar. Gently flip vegetables when browned, about 5 minutes per side. Sprinkle with almonds, Parmesan cheese, and salt.\n",
        "picture_link": "6NwK7ziCtS2HVOF1XXbtNmqlbqqWUHW"
    },
    {
        "title": "(Gluten Free) Magic Cookie Bars",
        "ingredients": [
            "Cookie Base: ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "2 cups peanut butter ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup dark chocolate chips ADVERTISEMENT",
            "1/2 cup chopped raw pecans ADVERTISEMENT",
            "1/2 cup chopped raw almonds ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch glass baking dish with parchment paper.\nMix sugar and eggs together in a bowl until smooth; stir in peanut butter until well blended. Pour peanut butter mixture into the prepared baking dish.\nBake in the preheated oven until cookie base is partly cooked, 8 minutes.\nLayer semisweet chocolate chips, dark chocolate chips, pecans, almonds, and coconut onto the cookie base. Slowly pour sweetened condensed milk evenly over the toppings.\nBake in the preheated oven until coconut is slightly brown, about 30 minutes.\nCool completely before removing cookie bars from pan. Peel away parchment paper and cut into small squares using a sharp knife.\n",
        "picture_link": "f6.ADMMQsR/kDyoTkXjb4/OJQBfw2Bi"
    },
    {
        "title": "Simple Cottage Cheese Pancakes",
        "ingredients": [
            "1 cup cottage cheese ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon butter, or as needed ADVERTISEMENT",
            "1/4 cup blueberries, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Strain cottage cheese in a sieve fitted over a bowl, pressing down occasionally, until cottage cheese has dried out, about 1 hour.\nBeat eggs in a medium bowl; add cottage cheese, flour, melted butter, and salt. Mix until just blended.\nHeat butter in a frying pan over medium-high heat; drop large spoonfuls of batter into the melted butter. Sprinkle blueberries into batter. Cook until lightly browned, 2 to 3 minutes per side.\n",
        "picture_link": "yuhPrenkE4TeBSncQtM9PehSn9GVcAW"
    },
    {
        "title": "Sweet Cornbread Loaf",
        "ingredients": [
            "2 cups cornmeal ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 5x9-inch loaf pan.\nMix cornmeal, buttermilk, flour, sugar, vegetable oil, salt, and baking soda in a bowl until thoroughly combined. Pour batter into prepared loaf pan.\nBake in the preheated oven until top is golden brown and a toothpick inserted into the center of the loaf comes out clean or with moist crumbs, about 1 hour.\n",
        "picture_link": "3w./w.YjLW1cC1ZSIjIzO7bPVV0RnOe"
    },
    {
        "title": "Cranked Up Corn Chowder",
        "ingredients": [
            "4 ears corn, kernels cut from cob ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 cup shredded carrot ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "4 red potatoes, cut into bite-size pieces ADVERTISEMENT",
            "2 cups light cream ADVERTISEMENT",
            "1 (15 ounce) can cream-style corn ADVERTISEMENT",
            "1 teaspoon finely chopped parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "Roux: ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine corn kernels and 1 tablespoon olive oil in a baking dish; stir to coat corn kernels in oil.\nRoast corn in preheated oven for 20 minutes.\nHeat 1 tablespoon olive oil in a large pot over medium heat. Cook and stir onion, carrot, celery, and garlic in the olive oil until tender, 5 to 7 minutes. Stir chicken broth, roasted corn, potatoes, light cream, cream-style corn, parsley, salt, and pepper into the vegetable mixture; bring to a boil.\nMelt butter in a small skillet over medium-low heat; stir flour into melted butter and whisk until a paste forms and begins to thin, about 5 minutes.\nStir roux into the chowder; continue cooking until chowder is thickened, about 30 minutes.\n",
        "picture_link": "EYBIxWMxRjmEn7e.s2cvPIPZrYKce3O"
    },
    {
        "title": "Marshmallow Hot Fudge Sauce",
        "ingredients": [
            "30 large marshmallows ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 (12 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat marshmallows, milk, butter, and salt in a saucepan over low heat until marshmallows melt, stirring often, about 5 minutes. Add chocolate chips and vanilla extract; continue stirring until chocolate is melted, 5 minutes more. Serve warm.\n",
        "picture_link": "ynlBgyzuKZlOrRX0jB7SGxkEn9UbAWS"
    },
    {
        "title": "Frozen Banana Bites",
        "ingredients": [
            "1 cup peanut butter ADVERTISEMENT",
            "4 bananas, sliced into 1-inch rounds ADVERTISEMENT",
            "8 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1 tablespoon shortening ADVERTISEMENT",
            "1/3 cup toffee baking bits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover a baking sheet with waxed paper.\nSpoon a thin layer of peanut butter on top of each banana slice. Insert a toothpick through the peanut butter layer into the banana. Place banana bites onto the prepared baking sheet; freeze for 30 minutes to overnight.\nMelt chocolate and shortening in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching.\nCover another baking sheet with waxed paper.\nRemove 2 to 4 banana bites from the freezer at a time; coat each bite with chocolate mixture. Place coated banana bites on the second baking sheet; sprinkle each with toffee bits. Repeat until all the bites are coated. Return banana bites to freezer until set, at least 1 hour. Allow bites to sit in room temperature for about 15 minutes before serving.\n",
        "picture_link": "UjmqUlcism.yHi4c12Il6Z4r3x9oxFG"
    },
    {
        "title": "Raspberry-OJ-Banana Smoothie",
        "ingredients": [
            "1 1/2 cups ice cubes ADVERTISEMENT",
            "1 cup fresh raspberries ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 banana, cut into chunks ADVERTISEMENT",
            "1/2 cup vanilla fat-free yogurt ADVERTISEMENT",
            "1 teaspoon honey, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cubes, raspberries, orange juice, banana, yogurt, and honey in a blender until smooth.\n",
        "picture_link": "nqOJVSF5FKU5S9/ERd30kM0jucCzZS."
    },
    {
        "title": "Chocolate Chip Cookie Cake",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup firmly packed brown sugar ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups semi-sweet chocolate chips, divided ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10 1/2x15 1/2-inch baking pan and line with waxed paper.\nBeat 1 cup butter, brown sugar, and white sugar together in a bowl using an electric mixer until smooth and creamy; add eggs, 1 at a time, beating well after each addition until smooth. Mix 2 teaspoons vanilla extract and salt into creamed butter mixture. Gradually stir flour into creamed butter until just incorporated; fold 1 cup chocolate chips into batter. Spread batter into the prepared pan.\nBake in the preheated oven until lightly browned on the edges, 20 to 25 minutes. Remove from oven and cool completely.\nMelt remaining 1 cup chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Beat confectioners' sugar and 3/4 cup butter together in a bowl using an electric mixer until smooth; add melted chocolate and 2 teaspoons vanilla extract and mix until frosting is smooth. Spread frosting over cooled cookie cake.\n",
        "picture_link": "MqvmKg2132t51cKCM115VIPo1bO7RjC"
    },
    {
        "title": "Healthy Fish Tacos with Mango Salsa",
        "ingredients": [
            "Mango Salsa: ADVERTISEMENT",
            "1 mango - peeled, seeded, and chopped ADVERTISEMENT",
            "2 avocados - peeled, pitted, and chopped ADVERTISEMENT",
            "1 cup chopped tomato ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "1/2 cup diced red pepper ADVERTISEMENT",
            "2 tablespoons chopped fresh flat-leaf parsley ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 teaspoon cider vinegar ADVERTISEMENT",
            "1 dash hot pepper sauce, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "8 taco shells ADVERTISEMENT",
            "4 (6 ounce) mahi mahi fillets, cut into 1-inch slices ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mango, avocado, tomato, red onion, red pepper, parsley, canola oil, brown sugar, lime juice, cider vinegar, hot pepper sauce, salt, and ground black pepper together in a bowl. Refrigerate salsa for at least 1 hour.\nPreheat oven to 325 degrees F (165 degrees C).\nHeat taco shells in preheated oven until crisp, about 5 minutes.\nSeason mahi mahi with 1 teaspoon ground black pepper, paprika, and 1/2 teaspoon salt.\nHeat olive oil in a skillet over medium-high heat. Cook mahi mahi in olive oil until fish flakes easily, about 3 minutes per side.\nPlace mahi mahi slices in taco shells and top with mango salsa.\n",
        "picture_link": "E81HZk17aZw/E.vbquY8XBNeOiuSFP."
    },
    {
        "title": "Easy Slow Cooker Enchiladas",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "3/4 cup chopped green bell pepper ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (16 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "6 (6 inch) corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble turkey into a large skillet over medium heat. Stir onion, bell pepper, and garlic into the turkey. Cook and stir until turkey is completely browned, 5 to 7 minutes. Add the kidney beans, black beans, diced tomatoes, water, chili powder, cumin, salt, and pepper; bring to a boil, reduce heat to medium-low, place a cover on the skillet, and simmer for 10 minutes.\nMix Cheddar cheese and Monterey jack cheese together in a bowl.\nLayer about 3/4 cup of the turkey mixture, 1 tortilla, and 1/2 cup the cheese mixture in the bottom of a 5-quart slow cooker; repeat layers until ingredients are fully used, ending with a cheese layer.\nCook on Low until heated through, 5 to 7 hours.\n",
        "picture_link": "koOCI264jAuqSXWBLWbT85VO9Yc4bzO"
    },
    {
        "title": "Beerbecue Beef Flank Steak",
        "ingredients": [
            "1/2 cup ketchup ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1/3 cup white vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup strong beer ADVERTISEMENT",
            "1 (1 1/2-pound) trimmed beef flank steak ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour ketchup, molasses, and white vinegar in a bowl; add white sugar, 2 teaspoons black pepper, 1 teaspoon salt, cayenne pepper, cumin, allspice, and cinnamon. Whisk until sauce is smooth. Pour in beer.\nPlace flank steak into a non-reactive container; pour sauce over meat. Poke at least 100 holes per side in the flank steak using 2 forks.\nCover container with plastic wrap and marinate beef 8 to 12 hours (up to overnight).\nRemove flank steak from marinade and pat the meat dry with paper towels. Pour leftover marinade into a saucepan, place over medium heat, and bring to a boil. Reduce heat to low and simmer for 5 minutes to make a basting sauce.\nPreheat an outdoor grill for high heat and lightly oil the grate. Season flank steak with salt and black pepper.\nGrill flank steak for 2 1/2 minutes; turn meat around on grate to a 45-degree angle to make diamond grill marks; grill for 2 1/2 more minutes. Repeat on second side, turning meat 45 degrees after 2 1/2 minutes and grilling 2 1/2 more minutes.\nFlip steak to original side and paint meat with sauce. Continue to grill until sauce has glazed onto the meat, about 30 seconds. Turn meat over and brush other side with sauce. Sauce will burn if cooked too long. Repeat 1 more time, brushing and glazing sauce onto meat for about 30 seconds on each side. An instant-read meat thermometer, inserted into the thickest part of the flank steak, should read 125 degrees F (52 degrees C).\nTransfer steak to a platter and let rest 5 to 10 minutes before slicing lengthwise down the center; cut each half across the grain into slices about 3/8 inch thick. Drizzle slices with more sauce to serve.\n",
        "picture_link": ".77dm9DVSovsWEwQztbcHWnZMslMR9."
    },
    {
        "title": "Open Faced Egg Sandwiches with Arugula Salad",
        "ingredients": [
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "4 3/4-inch thick slices of crusty bread ADVERTISEMENT",
            "2 cups arugula ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1/2 teaspoon fresh lemon juice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch freshly ground black pepper ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix garlic and mayonnaise together in a small bowl. Spread mayonnaise on 1 side of the bread slices. Mix arugula with olive oil, lemon juice, salt, and black pepper in a bowl until coated; divide arugula in fourths, placing each portion atop mayonnaise side of a bread slice.\nSpray a skillet with cooking spray, place over medium-high heat, and crack eggs into skillet, one at a time. Cook on one side only until whites are firm and yolks are slightly runny, 2 to 3 minutes. Season eggs with salt and black pepper. Gently place an egg on each open-face sandwich.\n",
        "picture_link": "A/HZ7OQYXks0yLMdt79vOk/zE01o4V2"
    },
    {
        "title": "Thanksgiving Spinach Salad",
        "ingredients": [
            "3/4 cup sweetened dried cranberries, chopped ADVERTISEMENT",
            "1 McIntosh apple - peeled, cored, and diced ADVERTISEMENT",
            "1/2 small red onion, finely chopped ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (6 ounce) bag baby spinach, torn into bite-sized pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cranberries, apple, onion, lemon juice, honey, chili powder, and cinnamon together in a large bowl. Let rest for flavors to blend, about 20 minutes. Add spinach and toss to coat.\n",
        "picture_link": "bypyF2NA1FTcdL0BAMEa6QKo/Pwg9jG"
    },
    {
        "title": "Spicy Southwest Chicken Casserole",
        "ingredients": [
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup water, or as needed ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 (15 ounce) can black beans, partially drained ADVERTISEMENT",
            "1 (14 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "3/4 cup picante sauce ADVERTISEMENT",
            "1 (4 ounce) can chopped green chiles ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "4 (8 inch) flour tortillas ADVERTISEMENT",
            "1 (10.75 ounce) can condensed fiesta-style nacho cheese soup ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 cup shredded Mexican cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBring chicken breasts and water to a boil in a large skillet; cook over medium heat until chicken juices run clear and meat is no longer pink inside, about 10 minutes. Transfer chicken breasts to a large plate, reserving pan juices in skillet, and shred chicken with 2 forks.\nCook onion and red bell pepper in reserved drippings over medium heat until onion is translucent, 5 to 8 minutes. Return shredded chicken to skillet. Stir black beans, corn, picante sauce, chopped green chiles, chili powder, and cumin into chicken mixture until thoroughly combined. Bring mixture to a simmer and cook until heated through, about 5 minutes. Pour chicken mixture into prepared baking dish.\nArrange flour tortillas in a single layer over chicken mixture. Stir fiesta soup with diced tomatoes and green chiles in a bowl until thoroughly combined; spread soup mixture over tortillas. Top casserole with Mexican cheese blend.\nBake in the preheated oven until cheese topping has melted and casserole is hot, about 30 minutes. Cool 5 minutes before serving.\n",
        "picture_link": "InDNACM1gqK9kECDvxBshodEE7D1NiS"
    },
    {
        "title": "Kate's Kale Couscous ",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup whole wheat couscous ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 cup chopped kale ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1/4 cup whole salted almonds, halved ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and butter to a boil in a saucepan; remove from heat. Add couscous and stir well. Cover saucepan and let couscous sit until water is absorbed, about 5 minutes. Fluff couscous with a fork.\nHeat olive oil in a skillet over medium heat; cook and stir cannellini beans, kale, and garlic in the hot oil until kale is wilted, 5 to 10 minutes. Mix kale mixture into couscous; fold in almonds.\nSpoon couscous mixture into 4 serving bowls; top with Parmesan cheese. Season with salt and black pepper.\n",
        "picture_link": "6cK6zfK6gjBpoBM/FythlgHjQonSkZu"
    },
    {
        "title": "Easy Mango Banana Smoothie",
        "ingredients": [
            "2 mangos - peeled, seeded, and sliced ADVERTISEMENT",
            "2 bananas ADVERTISEMENT",
            "2 cups vanilla yogurt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend mangos, banana, vanilla yogurt, and milk in a blender until smooth.\n",
        "picture_link": "E7qVdkSbMWDWriaVaBhpWn4LDrN5Tru"
    },
    {
        "title": "Sweet Potato Hummus",
        "ingredients": [
            "3 sweet potatoes ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained (reserve liquid) and rinsed ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons tahini ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPoke holes all over sweet potatoes with a fork.\nRoast sweet potatoes in the preheated oven until soft, about 45 minutes; let cool. Cut sweet potatoes in half lengthwise.\nCombine garbanzo beans and olive oil in a blender and pulse several times to mash. Scoop flesh out of sweet potato peels and add to the blender; pulse to combine. Add tahini, lemon juice, lemon zest, cumin, coriander, white pepper, and sea salt to mixture; blend until smooth, adding reserved garbanzo bean liquid as needed to make a smooth, creamy hummus.\n",
        "picture_link": "bQK83ZNjUlDYZ9UaeoRE4pOrSi.q3Kq"
    },
    {
        "title": "Spinach, Potatoes, and Bacon Au Gratin",
        "ingredients": [
            "5 cups small red and yellow potatoes ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, or more to taste ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup chopped fresh spinach ADVERTISEMENT",
            "1 tablespoon diced pimento pepper ADVERTISEMENT",
            "4 slices cooked bacon, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace potatoes into a large pot, cover with water, and bring to a boil. Cook potatoes until tender and still firm, about 15 minutes; drain and set aside to cool.\nMelt butter in a saucepan over medium heat; cook and stir green onion in the hot butter until softened, 1 to 2 minutes. Whisk flour into green onion and butter; gradually stir in milk, whisking constantly, until mixture is thickened and bubbly. Stir salt and Cheddar cheese into sauce, mixing until cheese has melted.\nSlice potatoes and place about half the potatoes into the bottom of a casserole dish; sprinkle with salt and black pepper. Layer half the spinach and half the pimentos over potatoes and pour half the cheese sauce over the spinach. Repeat layers, ending with remaining cheese sauce. Cover casserole dish tightly with aluminum foil.\nBake in the preheated oven until bubbling, about 50 minutes; uncover dish and continue baking until browned on top, 5 to 10 more minutes. Sprinkle with crumbled bacon.\n",
        "picture_link": "EZS8MnV0./HItIjWv6QLjwEAmBFz/oC"
    },
    {
        "title": "English Crumpets",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons quick-rise instant yeast ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups warm water (112 to 118 degrees F/44 to 48 degrees C) ADVERTISEMENT",
            "1 1/4 cups warm milk (112 to 118 degrees F/44 to 48 degrees C) ADVERTISEMENT",
            "4 3-inch metal cookie cutters with open tops or crumpet molds ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 2 cups plus 2 tablespoons flour, yeast, sugar, and salt in a large mixing bowl. Combine water and milk in a separate bowl and quickly whisk the milk mixture into the dry ingredients until batter is thick and smooth. Cover with a towel and let rise in a warm place until spongy, about 1 hour. Stir dough to reduce sponginess.\nPlace a rack into the oven and preheat to 150 degrees F (65 degrees C).\nSpray a skillet and round metal open-top cookie cutters or crumpet molds with cooking spray. Heat skillet over medium-low heat, place the metal cutters or molds into the skillet, and let the molds heat up. Spoon batter into the molds, filling them about halfway. Let the crumpets cook until the bottoms are browned, the tops appear nearly dry, and popped bubbles appear on top, about 5 minutes.\nUse tongs to lift molds out of the pan; remove molds from the crumpets. Flip and return crumpets to skillet to cook the other sides until browned, 1 to 2 more minutes. Repeat with remaining dough. Keep cooked crumpets warm on rack in the preheated oven while you cook remaining crumpets.\n",
        "picture_link": "Dg2elDGvqAz5EkFa7TLgv4QlCvb0Cha"
    },
    {
        "title": "Mini Chocolate Chip Pumpkin Muffins",
        "ingredients": [
            "vegetable cooking spray ADVERTISEMENT",
            "1 (18.25 ounce) package spice cake mix (such as Duncan Hines® Signature) ADVERTISEMENT",
            "1 (15 ounce) can pure pumpkin (such as Libby's®) ADVERTISEMENT",
            "1/2 (12 ounce) package miniature chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Spray 12 nonstick muffin cups with cooking spray.\nMix spice cake with pumpkin in a bowl with an electric mixer until batter is thick and smooth; stir miniature chocolate chips into batter. Scoop batter into prepared muffin cups.\nBake in the preheated oven until lightly golden brown and a toothpick inserted into the center of a muffin comes out clean or with moist crumbs, about 15 minutes. Let muffins rest for about 3 minutes to set before removing from pan to finish cooling on a wire rack. Store in a covered container.\n",
        "picture_link": "RO7MM2I/i1dsdSpJd8nNkkqWSMOp8uq"
    },
    {
        "title": "Perfect Crab-Stuffed Mushrooms",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons minced green onion ADVERTISEMENT",
            "1 cup cooked crabmeat, finely chopped ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1/4 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 1/2 pounds fresh button mushrooms, stems removed ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMelt 2 tablespoons butter in a skillet; cook and stir green onion until softened, about 2 minutes. Transfer green onion to a bowl. Stir in crabmeat, bread crumbs, 1/4 cup Monterey Jack cheese, egg, lemon juice, and dill weed until well mixed.\nPour 1/2 cup melted butter in a 9x13-inch baking dish; turn mushroom caps in butter to coat. Fill mushroom caps with the crab mixture and sprinkle with remaining 1/2 cup Monterey Jack cheese. Pour white wine into baking dish.\nBake in preheated oven until cheese is melted and lightly brown, 15 to 20 minutes.\n",
        "picture_link": "DIdQBoKmTAFSrv6eINkVoxY/of93uiO"
    },
    {
        "title": "Grandma Carol's Pumpkin Roll",
        "ingredients": [
            "3 eggs, beaten ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2/3 cup pumpkin puree ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "2 teaspoons confectioners' sugar for dusting, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Butter a 12x17-inch jelly roll pan and line with parchment paper; butter the parchment paper. Generously dust a kitchen towel with confectioners' sugar.\nBeat eggs, white sugar, and pumpkin together in a bowl until creamy.\nSift flour, baking soda, cinnamon, cloves, and nutmeg together in a separate bowl; gradually stir into egg mixture. Stir to combine. Spread batter evenly into the prepared pan.\nBake in the preheated oven for exactly 10 minutes.\nImmediately turn cake onto the prepared kitchen towel. Starting at a long end, roll up pumpkin cake and towel. Let rolled cake rest for 10 minutes.\nBeat cream cheese, butter, 16-ounce package confectioners' sugar, and vanilla extract together in a bowl until smooth; fold in pecans.\nUnroll cake; spread with the filling. Roll up cake (without towel). Cut off any jagged ends. Cover and refrigerate until chilled. Cut cake in half if desired; sprinkle with confectioners' sugar before serving.\n",
        "picture_link": "pA8eYaxnRv9Z2Zp6ngr1AMzKrRbUUOu"
    },
    {
        "title": "Halloween Ghosties",
        "ingredients": [
            "1 (12 ounce) package white chocolate chips, or as needed ADVERTISEMENT",
            "24 peanut-shaped peanut butter sandwich cookies ADVERTISEMENT",
            "48 miniature chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chocolate chips into a microwave-safe bowl and heat on low in microwave for 1 minute; stir. Continue heating on low several more times, 30 seconds at a time, stirring after each time, until white chocolate is warm and smooth.\nUse 2 forks to dip cookies into white chocolate; set cookies on sheets of waxed paper. Place 2 miniature chocolate chips onto one end of each cookie for eyes; set cookies aside until coating has hardened, about 20 minutes.\n",
        "picture_link": "zeodhZwjMGAfDZ7Aps6WFNlYng9HNIm"
    },
    {
        "title": "Easy Venison Meatloaf",
        "ingredients": [
            "2 pounds ground venison ADVERTISEMENT",
            "1 (6 ounce) package dry stuffing mix (such as Stove Top®) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "2 large eggs, lightly beaten ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix venison, stuffing mix, water, onion, 1/4 cup barbeque sauce, eggs, salt, and black pepper together in a large bowl until fully incorporated. Shape venison mixture into a loaf and place in a 9x13-inch baking dish. Spread 1/4 cup barbeque sauce over the top of loaf.\nBake in the preheated oven until no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "xf6Jjo.4JAWvZQlYvpqU9hIjlDfXmaa"
    },
    {
        "title": "Grandma's Chicken Soup with Homemade Noodles",
        "ingredients": [
            "1 gallon chicken stock ADVERTISEMENT",
            "4 bone-in chicken breast halves ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 tablespoons water, or as needed ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken stock to a boil; cook chicken breasts at a boil until no longer pink in the center, 15 to 20 minutes. Remove chicken, cool, and cut meat from bone; keep chicken stock at a low simmer.\nMix flour and 1/4 teaspoon salt together using the dough hook attachment in the bowl of a stand mixer on Low; add eggs and water, 1 tablespoon at time, until dough holds together.\nSplit dough in half. Roll 1 dough half on a lightly floured surface to 1/8-inch thickness. Cut dough into noodles 2 to 3-inches long x 1/4-inch wide using a sharp knife dipped in flour or a fettuccine pasta cutter. Repeat with other dough half.\nReturn chicken to the simmering stock; add noodles. Season stock with black pepper and 1 pinch salt. Cook soup until noodles are cooked through, 15 to 25 minutes.\n",
        "picture_link": "bMTkYUUhMLdrz6NnHSrytSiEiU/r6L6"
    },
    {
        "title": "Quinoa Stuffing",
        "ingredients": [
            "4 cups vegetable stock ADVERTISEMENT",
            "2 cups quinoa ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 butternut squash - peeled, seeded, and diced ADVERTISEMENT",
            "2 small zucchinis, cut into 1-inch cubes ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 cup diced dried apricots ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "1 lime, juiced, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring vegetable stock to a boil in a saucepan, reduce heat to low, and stir in quinoa. Cover pan and simmer until quinoa absorbs the liquid, 10 to 15 minutes. Remove from heat.\nHeat olive oil in a large skillet over medium heat. Cook and stir butternut squash and zucchinis in the hot oil until slightly browned, about 10 minutes. Stir quinoa into the vegetables and gently mix green onions, apricots, cranberries, and parsley into the stuffing. Drizzle with lime juice to taste.\n",
        "picture_link": "xssiC1/nkpRnCBvmNUAFsyxWo2f9Mxu"
    },
    {
        "title": "Simply The Best Chicken Waldorf Salad",
        "ingredients": [
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "2 cooked rotisserie chicken breasts, cubed ADVERTISEMENT",
            "1 cup seedless red grapes, halved ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 Granny Smith apple, cored and cubed ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup vanilla yogurt ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nSpread chopped walnuts onto a baking sheet.\nRoast walnuts in the preheated oven until they are fragrant and browned, 3 to 5 minutes. Remove and let cool.\nLightly toss chicken with grape halves, cranberries, apple, walnuts, and onion in a salad bowl. Whisk mayonnaise, vanilla yogurt, and lemon juice in a separate bowl. Pour dressing over salad and toss again to coat.\n",
        "picture_link": "TToqdzj1MOrr5Mpd0a3Lh2lCTk9SQMS"
    },
    {
        "title": "Potato and Pepper Frittata",
        "ingredients": [
            "6 slices bacon or pancetta, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 cups chopped hot and sweet peppers ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes, or more to taste ADVERTISEMENT",
            "1 1/2 cups cubed cooked potatoes ADVERTISEMENT",
            "12 eggs, beaten ADVERTISEMENT",
            "2 ounces crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon and olive oil in a large skillet over medium heat. Cook until bacon is nearly crisp, 5 to 7 minutes. Add peppers; cook and stir over medium heat until softened, about 3 minutes. Remove from heat and drain excess grease from the pan. Season with salt, black pepper, and red pepper flakes; stir to combine.\nReturn pan to medium heat, add potatoes and stir until warmed through, about 2 minutes. Pour in eggs and slowly stir to form large, soft curds, about 5 minutes. Sprinkle feta cheese over the top and stir gently to incorporate.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace pan under the preheated broiler and cook until the top is set and feta cheese is browned, about 5 minutes.\n",
        "picture_link": "cFN0LNtL8a5zOuN0EyaaVFgR/hnNNAS"
    },
    {
        "title": "Mom's Easy Chicken Divan",
        "ingredients": [
            "2 cups cooked long-grain rice ADVERTISEMENT",
            "2 (10 ounce) packages frozen broccoli florets ADVERTISEMENT",
            "2 cups cubed cooked chicken ADVERTISEMENT",
            "2 (10.5 ounce) cans cream of chicken soup ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup soft bread crumbs ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 11x7-inch baking dish.\nSpread rice evenly in prepared baking dish. Arrange broccoli over rice and layer chicken on top. Mix cream of chicken soup, mayonnaise, lemon juice, and curry powder in a bowl; pour over chicken. Sprinkle with Cheddar cheese. Mix bread crumbs and melted butter in a small bowl; sprinkle over cheese.\nBake in preheated oven until sauce is bubbly and cheese is melted, 25 to 30 minutes.\n",
        "picture_link": "d2VZmuQ1dr6odv/.8RU1vGIr0rAtLdy"
    },
    {
        "title": "Spam™ and Napa Cabbage",
        "ingredients": [
            "1 (12 ounce) container fully cooked luncheon meat (e.g. Spam), cubed ADVERTISEMENT",
            "1 small head napa cabbage, cut into small pieces ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons soy sauce, or to taste ADVERTISEMENT",
            "1 tomato, diced (optional) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over medium heat. Add the Spam(tm) and cover; fry until browned, about 10 to 15 minutes. Turn the heat to low; add the cabbage and water. Cover and steam until the cabbage is crisp tender, about 5 to 7 minutes. Remove the lid, and stir in the soy sauce and tomato (if using). Season to taste with salt and pepper.\n",
        "picture_link": "5mQmbJkOjWVX7YV.N8TrYcCsZ4xazgq"
    },
    {
        "title": "Swirled Peanut Butter Cup Brownies",
        "ingredients": [
            "1 (19.8 ounce) package brownie mix without nuts ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (13 ounce) package miniature chocolate-covered peanut butter cups - unwrapped, chilled, and coarsely chopped ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nStir brownie mix, vegetable oil, 2 eggs, and water in a large mixing bowl until smoothly combined and gently mix the chopped peanut butter cups into the batter.\nBeat peanut butter, sugar, butter, flour, vanilla extract, and 1 egg together in a bowl with an electric mixer until thoroughly combined. Spread half the brownie batter into the bottom of the prepared baking dish and top with 1/4-cup dollops of peanut butter mixture in an even pattern. Pour remaining brownie batter between the dollops. Use a knife to lightly swirl the peanut butter mixture into the brownie batter; do not overmix.\nBake in the preheated oven until a toothpick inserted into the center of the brownies comes out with moist crumbs, 30 to 40 minutes. Cool completely before serving.\n",
        "picture_link": "9SuA76pFzt3rxqwYY2UH3bD0a6T9yQC"
    },
    {
        "title": "Delicious Pizza Sauce Recipe",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "2 leaves basil, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan. Pour crushed tomatoes into the saucepan and place over low heat. Stir basil, garlic, salt, and black pepper into the tomatoes; bring to a simmer. Add Parmesan cheese to sauce to serve.\n",
        "picture_link": "7U5Jp5RV7ng9IdNFuAhuNexQKTBwINu"
    },
    {
        "title": "Microwave Risotto",
        "ingredients": [
            "3 cups hot chicken broth ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground white or black pepper ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup minced yellow onion ADVERTISEMENT",
            "1 cup uncooked medium grain white rice ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the chicken broth, salt and pepper in a saucepan, and bring to a simmer. Keep warm over low heat.\nIn a square baking dish, or glass pie plate, heat the butter and olive oil in the microwave for 2 minutes. Add the onion to the dish, and stir to coat. Cook in the microwave for 4 more minutes. Add the uncooked rice, and stir to coat with oil. Cook for another 4 minutes.\nPour the simmering chicken broth into the rice, and stir. Cook in the microwave for 9 minutes. Stir, then microwave for another 9 minutes. If you want a creamier risotto, add 1/4 cup of warm water, and cook for another 2 minutes. Stir in the Parmesan cheese as soon as it comes out of the microwave, and serve.\n",
        "picture_link": "SrNYCe.RnS5hMGRNlDWxoSz.3oUIRxW"
    },
    {
        "title": "Jamaican Tortilla Soup",
        "ingredients": [
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "8 teaspoons chicken bouillon granules ADVERTISEMENT",
            "1 cup chopped carrot ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon chopped fresh thyme ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon chopped fresh ginger ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 cup chopped tomato ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "2 cups crispy tortilla strips ADVERTISEMENT",
            "2 limes, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor or indoor grill for medium heat. Grill chicken breasts for 6 to 8 minutes per side, or until browned and cooked through. Remove from the grill, and cut into chunks.\nIn a large pot, combine the chicken, water, bouillon and carrot. Season with allspice, thyme, cinnamon, ginger and garlic. Bring to a boil, then simmer over medium heat for about 10 minutes, or until carrots are tender. Pour in the tomato, coconut milk and hot pepper sauce. Heat through, but do not boil.\nLadle into bowls, and top with shredded mozzarella cheese and tortilla strips. Squeeze juice onto soup from lime wedges.\n",
        "picture_link": "z4U.2muR7PIgslNsjQ4fZcw0Bi/GKm2"
    },
    {
        "title": "Tan",
        "ingredients": [
            "1/3 cup balsamic vinegar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "5 Granny Smith apples - peeled, cored and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the balsamic vinegar, brown sugar and black pepper. Taste and adjust sugar and vinegar to your personal preference. Add the apples, and stir to coat.\n",
        "picture_link": "oIjN1OpwQAlvpIMxMEs1Y0S1SQyFniW"
    },
    {
        "title": "Japanese Soup with Tofu and Mushrooms",
        "ingredients": [
            "3 cups prepared dashi stock ADVERTISEMENT",
            "1/4 cup sliced shiitake mushrooms ADVERTISEMENT",
            "1 tablespoon miso paste ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/8 cup cubed soft tofu ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, bring stock to a boil; reduce heat to simmer, add mushrooms, and cook for 3 minutes. In a small bowl, mix miso paste and soy sauce together; stir into stock along with tofu. Simmer 5 minutes, and serve topped with with green onion.\n",
        "picture_link": "tbZQJdA4ltNQ5xPhGYgSOtxP4kc.I5K"
    },
    {
        "title": "The Vodka Collins",
        "ingredients": [
            "ice cubes ADVERTISEMENT",
            "2 cups prepared lemonade ADVERTISEMENT",
            "1 cup club soda ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "1 lemon ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers vodka ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a shaker half way full with ice. Pour in the lemonade, club soda and sugar. Cut the lemon in half and squeeze the juice into the shaker. Pour in the vodka, cover and shake well. Strain into two glasses that are filled half way with ice. You can add oranges and cherries for garnish and make your drink look real pretty but hey, do you really want to do all that after work? Enjoy!\n",
        "picture_link": ".cVgv7nXx2l6QeAKJxg.WzUeXId2TDK"
    },
    {
        "title": "World's Fastest Meatballs",
        "ingredients": [
            "6 cups prepared tomato sauce ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "2 teaspoons Italian herb seasoning ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground veal ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground white pepper (optional) ADVERTISEMENT",
            "1/3 cup finely grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour tomato sauce into a large stockpot and bring to a simmer over medium heat. Reduce heat to low to keep sauce warm while preparing meatballs.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source. Line a baking sheet with aluminum foil and brush lightly with oil.\nWhisk bread crumbs, milk, egg, Italian herb seasoning, olive oil, garlic powder, and red pepper flakes in a small bowl to form a thick slurry. Set aside.\nCombine beef and veal in a large bowl. Season with salt, black pepper, and white pepper; sprinkle with Parmigiano-Reggiano cheese. Pour in slurry and mix until combined.\nUse a small portion scooper to form meat mixture into about 48 meatballs. Place on the prepared baking sheet.\nBake meatballs under the preheated broiler until browned, about 4 to 5 minutes. Turn meatballs and broil until browned on both sides and no longer pink in the center, 3 to 4 additional minutes.\nTransfer meatballs to the stockpot with the simmering tomato sauce. Increase heat to medium and cook for 5 to 10 minutes, or longer if desired.\n",
        "picture_link": "t8NfGh9E3Ka.MwwHbf3qBpT1BUcGM6e"
    },
    {
        "title": "Curry Mango Chicken",
        "ingredients": [
            "Chicken: ADVERTISEMENT",
            "3 1/2 tablespoons curry powder ADVERTISEMENT",
            "2 teaspoons minced ginger ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon thyme ADVERTISEMENT",
            "10 skinless chicken thighs ADVERTISEMENT",
            "Rice: ADVERTISEMENT",
            "2 cups converted long-grain white rice, rinsed ADVERTISEMENT",
            "2 cups mango - peeled, seeded, and chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves crushed garlic ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon thyme ADVERTISEMENT",
            "10 whole allspice berries ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1/2 (14 ounce) can coconut milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the curry, ginger, garlic, red pepper flakes, salt, pepper, and thyme. Place the chicken in the bowl, and coat evenly with seasoning. Cover, and marinate for 2 hours or more.\nPreheat oven to 400 degrees F (200 degrees C).\nIn a large bowl, stir together rice, mango, onion, garlic, and ginger. Season with curry, red pepper flakes, salt, thyme, allspice berries, and brown sugar. Stir in water, broth, and lime juice. Pour into a casserole dish, and arrange the marinated chicken on top. Then pour coconut milk over the top. Cover with aluminum foil.\nBake in preheated oven for 1 hour. Remove foil, and cook 10 to 15 minutes more. Remove allspice berries before serving.\n",
        "picture_link": "N8HL/PotDS8aDbh.Wq3ygDLbk2PHiwC"
    },
    {
        "title": "Carla's Baked Bananas",
        "ingredients": [
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch salt (optional) ADVERTISEMENT",
            "7 ripe bananas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a saucepan over medium-high heat, mix together cornstarch and sugar. Gradually stir in water. Bring to a boil, stirring constantly. Remove from heat, stir in butter, lemon juice, nutmeg, and salt.\nPeel bananas, and place in a casserole dish. Drizzle sauce over bananas.\nBake in a preheated oven for 12 minutes. Serve warm.\n",
        "picture_link": "7cJU4m.vdnZnuR2OxTOuxFAAKc01Fh."
    },
    {
        "title": "BBQ Turkey",
        "ingredients": [
            "2 cups butter, divided ADVERTISEMENT",
            "1 (15 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "1/4 cup chicken soup base ADVERTISEMENT",
            "3 sweet onions, peeled and cut into wedges ADVERTISEMENT",
            "5 apples, cored and cut into wedges ADVERTISEMENT",
            "2 tablespoons minced garlic, or to taste ADVERTISEMENT",
            "1 (750 milliliter) bottle dry white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a gas grill for low heat.\nRub some of the butter all over the turkey, inside and out, then rub all over with chicken base. Cut remaining butter into cubes and toss with onions, apples, and garlic in a large bowl. Stuff the bird with this mixture and place in a disposable aluminum roasting pan. Fold the turkey skin around the neck area to cover the hole and then turn the turkey over and pour wine into the opening at the other end until the turkey is full or the bottle is empty. Set the turkey breast side up.\nPlace the roasting pan on the grill and cover loosely with aluminum foil. If you have a pop up timer or heat safe meat thermometer, insert it into the turkey breast. Close the lid.\nRoast until the temperature in the breast reads 170 degrees F (75 degrees C) and the temperature in the thickest part of the thigh reads 180 degrees C (80 degrees C), about 4 hours depending on the temperature of your grill. When the temperature is getting close, remove the aluminum foil covering the turkey and allow it to brown during the final minutes of cooking. If it starts to brown too much, just cover it back up. Allow the turkey to rest for at least 20 minutes before carving.\n",
        "picture_link": "JIii48edU320maTh6.kMKQcmR1wUTL."
    },
    {
        "title": "Peruvian Aji Sauce",
        "ingredients": [
            "1 head iceberg lettuce ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "3 fresh jalapeno peppers ADVERTISEMENT",
            "1 cup white bread cubes without crusts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the stems from your jalapenos. Using tongs, hold the peppers over a stove burner and rotate until roasted, about 1 minute. Delicious, but not necessary.\nSlam your head of lettuce down on the counter stem side down. Pull on the stem to remove the heart and discard. Rip the head of lettuce apart - don't be gentle!\nPlace lettuce and one or two of the roasted jalapenos into a blender or large food processor. Blend on low speed until jalapenos are pleasantly ground up. Add the mayonnaise, and pulse until blended in. Gradually blend in bread cubes until you get a nice thick but still pourable consistency. If it gets too thick add more mayonnaise. Taste, and blend in more peppers if desired.\nPut in a squeeze bottle and serve with your favorite dishes, like Saltado de Pollo, or simply dip your bread in it.\n",
        "picture_link": "nj2zAMCKeX6atQkOWLhtlEn15aYq7Vu"
    },
    {
        "title": "The Mighty Chicken Stuff",
        "ingredients": [
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "3 (3 ounce) packages chicken flavored ramen noodles ADVERTISEMENT",
            "1 (13 ounce) package Ranch-flavored tortilla chips ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (16 ounce) package frozen broccoli florets, thawed ADVERTISEMENT",
            "4 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nPlace chicken in a large saucepan with enough water to cover by at least 2 inches. Mix in the seasoning packets from the ramen noodles. Bring to a boil, and cook until chicken is no longer pink in the center. Remove chicken and set aside to cool. Add the ramen noodles to the boiling chicken water. Cook until tender, about 2 minutes. Drain. Chop chicken into bite sized pieces when it is cool enough to handle.\nIn a medium bowl, stir together the cream of mushroom soup, sour cream and milk. Grease a 9x13 inch baking dish, and begin layering the ingredients as follows. 1/3 of the tortilla chips, 1/2 of the noodles, 1/2 of the chicken, 1/2 of the broccoli, 1/3 of the cheese, and 1/2 of the soup mixture. Repeat layers a second time, then top with remaining tortilla chips and cheese.\nBake for 30 minutes in the preheated oven, until heated through and bubbly.\n",
        "picture_link": "xVci31azJcE8PCUuoY2PSqYaBtoU4Ce"
    },
    {
        "title": "Tiropitas",
        "ingredients": [
            "1 (16 ounce) container small curd cottage cheese ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "8 ounces feta cheese, crumbled ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "1 (16 ounce) package frozen phyllo pastry, thawed in refrigerator ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F (220 degrees C).\nIn a large bowl, mix together the cottage cheese, eggs and feta cheese until well blended. Brush melted butter onto one sheet of phyllo dough at a time, and layer them in the bottom of a 9x13 inch baking dish until you have 7 sheets. Let the sheets rest up against the sides of the dish as well. Spread the cheese mixture over the phyllo layers, then repeat the process with 7 more sheets, tucking in the sides around the edges.\nBake for about 30 minutes in the preheated oven, until golden brown and crisp. Cut into squares and serve warm.\n",
        "picture_link": "MArukttlHLUonagYFCVamNnpNzAFivy"
    },
    {
        "title": "Cinnamon-Accented French Toast",
        "ingredients": [
            "3 eggs, beaten ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon milk ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 slices bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix beaten eggs, sugar, milk, cinnamon, and salt in a large, shallow bowl. Dip bread slices into egg mixture to coat.\nHeat a skillet over medium heat. Cook bread in hot skillet until browned completely, 2 to 3 minutes per side.\n",
        "picture_link": "J8G017Ur1D9uy5uySRX3q1FFP5EiphW"
    },
    {
        "title": "Best Apple Crumble ",
        "ingredients": [
            "6 large Granny Smith apples - peeled, cored and chopped ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 cup custard powder ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/3 cup shredded coconut ADVERTISEMENT",
            "1/3 cup rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place apples in a large pot with enough water to cover, and bring to a boil. Reduce heat to low, and simmer 15 minutes, or until soft. Drain, and cool. Place in a large bowl, and toss with 2 tablespoons sugar to evenly coat.\nIn a large bowl, whip together the 1/2 cup butter and 2 tablespoons sugar until fluffy. Mix in the egg. In a separate bowl, mix 2 cups flour, baking powder, and custard powder. Mix dry ingredients into the bowl with butter and sugar. Press crust into the bottom and up the sides of a 9 inch springform pan.\nPreheat oven to 400 degrees F (200 degrees C).\nDrain apples and place into the crust. Cut together 3/4 cup sugar, 3/4 cup butter, 1 1/4 cups flour, and cinnamon. Mix in coconut and oats. Sprinkle over the apples.\nBake 1 hour in the preheated oven, until golden brown. Remove sides from pan and allow crumble to cool before serving.\n",
        "picture_link": "jSrz/uvSajkh9NWIIDL/9OObZ97FkWW"
    },
    {
        "title": "Korean Slow Cooker Pork Chops",
        "ingredients": [
            "3 cloves garlic, pressed ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 tablespoon Korean chile bean paste ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "6 pork chops ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the crock of a slow cooker, stir together the garlic, chicken broth, bean paste and soy sauce. Season the pork chops with salt and pepper, and place them in the crock. Turn to coat with sauce. Cover, and cook for 5 hours on the Low setting.\n",
        "picture_link": "lPbwB8V/oVbrFw2Aj9e8IxKDJVeZOwK"
    },
    {
        "title": "Terrific Toffee Bars",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 large egg yolk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2/3 cup milk chocolate chips ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish.\nBeat butter, brown sugar, vanilla extract, and egg yolk in a large bowl; stir in flour and salt. Press dough into prepared baking dish.\nBake in preheated oven until crust is light brown, 25 to 30 minutes.\nImmediately sprinkle chocolate chips over hot crust. Let stand until soft, about 5 minutes, and spread evenly; sprinkle with nuts. Cool pan on wire rack for 30 minutes.\n",
        "picture_link": "ko8UHVCI0RFWJg7095x0VPf182ff3Wy"
    },
    {
        "title": "Spareribs and Kraut",
        "ingredients": [
            "1 rack pork spareribs cut into 2-rib portions ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 red potatoes, quartered ADVERTISEMENT",
            "1 (16 ounce) jar sauerkraut, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (230 degrees C). Coat a 9x13 inch baking dish with cooking spray. Season the ribs with salt and pepper, and arrange them in the greased baking dish.\nRoast for 20 to 25 minutes in the preheated oven. Remove from the oven, and reduce the temperature to 350 degrees F (175 degrees C).\nSet the ribs on a plate, and drain excess grease from the baking dish. Spread the sauerkraut evenly in the bottom of the dish. Place the ribs on top with the meat side up. Tuck the potato wedges in amongst the ribs. Cover tightly with heavy aluminum foil.\nBake for 30 minutes in the preheated oven. Carefully remove the foil to avoid hot steam, and serve.\n",
        "picture_link": "UzxG6RVcKLYprZ5/Fj2d9Zm45ZiBmlK"
    },
    {
        "title": "Bacon Cheeseburger Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (13 ounce) package brownie mix ADVERTISEMENT",
            "2 (12 fluid ounce) cans vanilla frosting ADVERTISEMENT",
            "yellow food coloring ADVERTISEMENT",
            "red food coloring ADVERTISEMENT",
            "3 vanilla wafer cookies ADVERTISEMENT",
            "1 large roll of red fruit leather ADVERTISEMENT",
            "4 caramels, with stripes ADVERTISEMENT",
            "8 yellow chewy fruit-flavored candy squares ADVERTISEMENT",
            "1 (16 ounce) container chocolate frosting ADVERTISEMENT",
            "1 large roll of green fruit leather ADVERTISEMENT",
            "2 teaspoons sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven according to instructions on cake mix box; prepare mix. Grease and flour a 9 inch pan, and a shallow metal bowl at least 9 inches in diameter. Fill the 9 inch cake pan 2/3 full with cake batter; pour the remaining batter into the prepared metal bowl (this will be the top of your \"bun\"). Bake according to directions, remove from pans, and cool on a wire rack.\nGrease and flour a 9 inch pan. Prepare brownie batter, and bake according to instructions on box. Remove from pan, and cool on a wire rack. Shave off the sharp edges of the brownie, making it resemble a hamburger patty.\nPlace 1/4 cups of vanilla frosting in a heavy duty plastic sandwich bag, and color with yellow food coloring to make your mustard. Repeat a second time using the red food coloring to make your ketchup. Place remaining frosting in a bowl, and color with a mix of red and yellow food coloring until you arrive at the color of a hamburger bun.\nCut the cookies in half and wrap with pieces of red fruit leather to create your tomatoes. Unwrap the caramels, and heat in microwave for 10 to 15 seconds to slightly soften. Roll the caramels individually between sheets of waxed paper to create bacon strips. Microwave the chewy fruit-flavored candy squares, place together, and roll between sheets of waxed paper to create your cheese slice; trim into a square shape.\nTo assemble, place bottom bun on your serving dish, and spread with some of the hamburger bun frosting. Place brownie on top of this, and spread it with chocolate frosting. Decorate edges with the tomatoes, bacon, cheese, mustard, and ketchup; use the green fruit leather as lettuce. Place top bun over this and spread with the remaining hamburger bun frosting; sprinkle with sesame seeds.\n",
        "picture_link": "01821CHvKyS/gz2s1MGfNqW8TDlvOey"
    },
    {
        "title": "Cold Asparagus with Curry Dip",
        "ingredients": [
            "1 bunch fresh asparagus spears, trimmed ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of lightly salted water to a boil. Add asparagus, and cook for about 7 minutes, until bright green. Remove to a bowl of ice water to cool. Drain and set aside.\nIn a medium bowl, stir together the mayonnaise, sour cream and curry powder. Transfer to a nice serving dish, and serve with chilled asparagus.\n",
        "picture_link": "p02ZL8WgjK9LaN/ICYLES.jdD8vNUF."
    },
    {
        "title": "Pork Loin, Apples, and Sauerkraut",
        "ingredients": [
            "3 (32 ounce) packages sauerkraut, drained ADVERTISEMENT",
            "2 Granny Smith apples, sliced ADVERTISEMENT",
            "1/2 large onion, coarsely chopped ADVERTISEMENT",
            "1 tablespoon caraway seeds ADVERTISEMENT",
            "1 cup apple cider, divided ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "Rub: ADVERTISEMENT",
            "1 tablespoon Thai seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 (5 pound) boneless pork loin roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix sauerkraut, apples, onion, and caraway seeds in a large roasting pan. Stir 1/4 cup apple cider and brown sugar together in a separate bowl; pour over sauerkraut mixture.\nStir Thai seasoning, salt, garlic powder, and black pepper together in a small bowl; rub onto the top and bottom of the roast.\nMake an indentation in the center of the sauerkraut mixture and place the seasoned roast in the indentation. Pour the remaining apple cider around the roast.\nBake in the preheated oven for 1 hour; baste roast with juices. Continue baking roast, basting every 30 minutes, until cooked through, 2 1/2 to 3 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\n",
        "picture_link": "YRkc/D2NpxDodSYUjUZe.kJGN0Ek2O6"
    },
    {
        "title": "Sopapilla Cupcakes",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 (16.5 ounce) package white cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 large egg whites ADVERTISEMENT",
            "1/4 cup oil ADVERTISEMENT",
            "2 tablespoons ground cinnamon, divided ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon lemon extract ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "3 cups confectioners' sugar, or more as needed ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons milk, or as needed ADVERTISEMENT",
            "1 tablespoon honey, for drizzling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line 18 muffin cups with paper liners.\nMix cake mix, water, egg whites, oil, 1 tablespoon cinnamon, vanilla extract, and lemon extract together in the bowl of a stand mixer; mix on low for 30 seconds. Increase speed to medium and mix batter for 2 minutes. Fill muffin cups 2/3-full with batter.\nCombine white sugar and 1 tablespoon cinnamon together in a small bowl; sprinkle over batter.\nBake in the preheated oven until a toothpick inserted in a cupcake comes out clean, about 15 minutes. Cool cupcakes to room temperature.\nBeat butter in a bowl using an electric mixer until creamy and fluffy, 1 to 2 minutes. Add confectioners' sugar, 3 tablespoons honey, and 1/2 teaspoon cinnamon; beat until just combined. Mix milk, 1 tablespoon at a time, into creamed butter mixture until desired consistency of frosting is reached. Spoon frosting into a piping bag or a plastic bag with a snipped corner; pipe onto each cupcake. Drizzle honey over each frosted cupcake.\n",
        "picture_link": "NzhbpchqIGhK9KyFAYnrYPSSLr/7oSm"
    },
    {
        "title": "Corn Salad with Creamy Italian Dressing ",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon Italian seasoning ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "olive oil ADVERTISEMENT",
            "1 (16 ounce) package frozen sweet corn, thawed ADVERTISEMENT",
            "1 cup diced roasted red peppers ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "5 fresh basil leaves, thinly sliced, or more to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, vinegar, 1/4 cup olive oil, garlic, water, 1/2 teaspoon black pepper, sugar, 1/4 teaspoon salt, Italian seasoning, and a pinch cayenne pepper together in a bowl until dressing is thick and creamy. Cover dressing with plastic wrap and refrigerate, 8 hours or overnight.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Cook and stir corn in hot oil until light golden brown and toasted, about 15 minutes.\nMix corn and red pepper together in a bowl. Pour enough dressing over corn mixture to coat completely. Season with salt and black pepper.\nStir basil and a pinch cayenne pepper into corn mixture; toss.\n",
        "picture_link": "mJO10YEgSQQ8QSIlcq/P45UavOuI.Wi"
    },
    {
        "title": "Angel Hair Pasta with Lemon and Chicken (Lighter)",
        "ingredients": [
            "1 (9 ounce) package BUITONI® Refrigerated Angel Hair Pasta ADVERTISEMENT",
            "1 1/2 cups diced cooked chicken ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "2 tablespoons lemon juice, or more to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare pasta according to package directions.\nToss pasta with chicken, oil, butter, lemon juice, parsley, marjoram and garlic powder. Season with salt and ground black pepper, if desired.\n",
        "picture_link": "lG3H0V/K528Uk4JRwS9/ib7NCz8HIQm"
    },
    {
        "title": "Slow Cooker Breakfast",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (26 ounce) package frozen hash brown potatoes, thawed ADVERTISEMENT",
            "1 (16 ounce) package bulk pork sausage ADVERTISEMENT",
            "1 (16 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "12 eggs, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon ground mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray the crock of your slow cooker with cooking spray. Spread hash brown potatoes into the bottom of the crock.\nHeat a large skillet over medium-high heat. Cook and stir sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Spread sausage over the hash brown potatoes; top with Cheddar cheese.\nBeat eggs and milk together in a large bowl; add ground mustard and generously season with salt and pepper. Mix seasonings thoroughly into the egg mixture; pour over the cheese layer in the slow cooker.\nCook on Low for 6 to 8 hours.\n",
        "picture_link": "luP85ADhsDyjKT/LCiN5jco8XebHLBG"
    },
    {
        "title": "Best-Ever Buckeye Brownies!",
        "ingredients": [
            "1 (18.25 ounce) package brownie mix (such as Pillsbury®) ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 (6 ounce) package chocolate chips ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nCombine brownie mix, oil, eggs, and water together in a bowl until batter is smooth; pour into the prepared baking dish.\nBake in the preheated oven until edges of brownies begin to pull away from the sides of pan, 28 to 31 minutes. Remove dish from oven and cool brownies.\nBeat confectioners' sugar, peanut butter, and 1/2 cup butter together in a bowl until smooth and creamy; spread over cooled brownies.\nHeat chocolate chips and 6 tablespoons butter together in a saucepan over low heat, stirring occasionally, until melted, about 5 minutes; spread over peanut butter layer. Cool and cut into squares.\n",
        "picture_link": "jPj40udKBOmc.rI9TxPsGIr8ASILFd."
    },
    {
        "title": "Chef John's Lobster Mac and Cheese",
        "ingredients": [
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "2 lobster tails, split in half lengthwise and deveined ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups cold milk ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "3 drops Worcestershire sauce, or to taste ADVERTISEMENT",
            "4 ounces grated sharp white Cheddar cheese ADVERTISEMENT",
            "1 ounce grated Gruyere cheese ADVERTISEMENT",
            "1 cup elbow macaroni, or more to taste ADVERTISEMENT",
            "1/2 teaspoon fresh thyme leaves ADVERTISEMENT",
            "Crumbs: ADVERTISEMENT",
            "3 tablespoons panko bread crumbs ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Butter 2 gratin dishes.\nHeat oil in a skillet over high heat. Cook lobster tails in skillet until slightly golden and about halfway cooked-through, about 2 minutes per side. Transfer tails to a plate to rest. When cool enough to handle, remove lobster meat from shells and chop meat. Reserve shells.\nMelt 2 tablespoons butter in the same skillet over medium heat. Whisk in flour; cook and stir until a paste forms and flour taste cooks off, 1 to 2 minutes. Add cold milk to flour mixture; whisk until completely incorporated. Bring to a simmer; reduce heat to low, and stir in paprika, nutmeg, and cayenne pepper. Cook, stirring occasionally, until thick, 3 to 4 minutes. Season sauce with salt.\nStir Cheddar cheese and Gruyere cheese into milk mixture until cheese is melted. Remove from heat and stir Worcestershire sauce into cheese sauce.\nBring a large pot of water with reserved lobster tails and a pinch of salt to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Remove and discard lobster shells, drain pasta.\nStir macaroni into cheese sauce with thyme leaves. Divide macaroni mixture between the 2 prepared gratin dishes. Top macaroni with chopped lobster meat, poking meat down into macaroni mixture with a fork.\nStir bread crumbs and melted butter together in a bowl. Add Parmesan cheese and stir. Top each gratin dish with bread crumb mixture.\nBake in the preheated oven until golden and bubbly, 15 to 20 minutes.\n",
        "picture_link": "8W6n9QY4mMUvaEXHBDhWexINYUNRFuq"
    },
    {
        "title": "Upside-Down Barbeque Meatloaf ",
        "ingredients": [
            "1 3/4 pounds very cold ground beef ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/4 teaspoon chipotle chile powder ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/2 cup fine, dry breadcrumbs ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/4 cup barbeque sauce (such as SFQ®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix ground beef, salt, garlic powder, onion powder, black pepper, celery salt, chipotle chile powder, and cayenne pepper together in a bowl with your hands.\nStir breadcrumbs, egg, ketchup, mustard, and Worcestershire sauce into meat mixture until thoroughly combined; form into a loaf shape.\nSpread barbeque sauce out into the bottom of a loaf pan; place meatloaf on top of barbeque sauce and press into pan.\nBake meatloaf in the preheated oven until no longer pink in the center, about 1 hour, 15 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Drain the fat from the loaf pan and invert pan over a plate to transfer meatloaf. Let rest for 5 minutes before slicing.\n",
        "picture_link": "fcMND8cD.XzD3c/NwIcOeqiVT.WHTSe"
    },
    {
        "title": "T.G.I. Friday's® Jack Daniels® Sauce",
        "ingredients": [
            "1 head garlic ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/3 cups dark brown sugar ADVERTISEMENT",
            "1 cup pineapple juice ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1/4 cup teriyaki sauce ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "3 tablespoons minced white onion ADVERTISEMENT",
            "1 tablespoon bourbon whiskey ADVERTISEMENT",
            "1 tablespoon crushed pineapple ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nCut about 1/2-inch from the top of the garlic head. Trim the roots so the garlic sits flat. Remove some of the outer layers of papery skin from the garlic, leaving enough so that the cloves stay together. Put garlic into a small casserole dish or baking dish, drizzle olive oil over it, and cover with a lid or aluminum foil.\nRoast garlic in preheated oven until the cloves are soft, about 1 hour.\nStir brown sugar, pineapple juice, water, teriyaki sauce, and soy sauce together in a saucepan and bring to a boil; reduce heat to low and keep at simmer.\nSqueeze sides of the garlic until the pasty roasted garlic emerges. Measure 2 teaspoons roasted garlic into the saucepan and incorporate into the sauce with a whisk. Reserve remaining roasted garlic for another use.\nStir lemon juice, white onion, bourbon whiskey, pineapple, and cayenne pepper into the sauce; bring to a simmer and cook until the volume of the liquid reduces by half and is thick and syrup-like, 40 to 50 minutes.\n",
        "picture_link": "FAcmJsEcZcRJAv3z7fA0QC03BXrgTym"
    },
    {
        "title": "Rustic Italian Chicken",
        "ingredients": [
            "2 pounds boneless skinless chicken thighs ADVERTISEMENT",
            "2 large carrots, cut into 1/2-inch slices ADVERTISEMENT",
            "1 medium red bell pepper, chopped ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "4 garlic cloves, minced ADVERTISEMENT",
            "2 tablespoons Italian seasoning ADVERTISEMENT",
            "Salt and black pepper to taste ADVERTISEMENT",
            "1 (14.5 ounce) can RED GOLD® Diced Tomatoes ADVERTISEMENT",
            "1 (28 ounce) can RED GOLD® Crushed Tomatoes ADVERTISEMENT",
            "3 cups penne pasta, cooked and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray slow cooker with cooking spray. Place chicken in slow cooker and top with remaining ingredients, except pasta and garnish.\nCover and cook on LOW for 6 to 8 hours. Serve chicken over pasta and garnish with cheese and parsley.\nGarnish Options: Parmesan cheese and chopped fresh Italian parsley.\n",
        "picture_link": "oxBaeS9gg4ZpudEW6OSSozIEcKCPHsG"
    },
    {
        "title": "Leek and Potato Soup with Shrimp",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 medium leeks, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 (32 ounce) carton Swanson® Chicken Broth ADVERTISEMENT",
            "3 medium russet potatoes, peeled and cut into 1/2-inch dice ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 pound cooked shrimp, peeled, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat. Stir in chopped leeks and onions; cook slowly until softened, 5 to 7 minutes.\nStir in Swanson(R) Chicken Broth; add potatoes. Season with curry powder; add salt and pepper to taste. Bring to a boil, then reduce temperature to low. Simmer 20 minutes.\nStir in milk; add shrimp. Heat until soup just starts to simmer again.\n",
        "picture_link": "JPgWoUzcqdg/Y3S0cWVL.SVC1.kqg8a"
    },
    {
        "title": "Brown Sugar-Cinnamon Butter",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup dark brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter, brown sugar, and cinnamon together in a bowl with an electric mixer until creamy and smooth.\n",
        "picture_link": "IwXDKSG4ct.iD8HF1ZDyqLPJipdEIYq"
    },
    {
        "title": "Israeli Tomato and Cucumber Salad",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "4 English cucumbers, diced ADVERTISEMENT",
            "4 Roma (plum) tomatoes, seeded and diced ADVERTISEMENT",
            "1/2 purple onion, diced ADVERTISEMENT",
            "1 red bell pepper, seeded and diced ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "3 tablespoons chopped fresh mint ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss cucumbers, tomatoes, onion, bell pepper, garlic, parsley, and mint together in a bowl. Drizzle olive oil and lemon juice over the salad and toss to coat; season with salt and pepper.\n",
        "picture_link": "ky./gFydGcMFjlQuPvCdVDG8wUtZqlO"
    },
    {
        "title": "Kale Chips in the Microwave",
        "ingredients": [
            "1 bunch flat-leaf kale - ribs trimmed away and discarded and leaves cut into 2-inch pieces ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange kale pieces on microwave-safe plates so they do not overlap. Drizzle olive oil over the kale pieces; season with sea salt.\nCook each plateful of kale in microwave oven until crispy, 2 to 2 1/2 minutes per batch.\n",
        "picture_link": "zBi93lUaTzYBEQsm/vmDi3BnkZ5Q0au"
    },
    {
        "title": "Gluten-Free Shake and Bake Almond Chicken",
        "ingredients": [
            "1/2 cup almond meal ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken thighs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine almond meal, paprika, sea salt, and black pepper together in a resealable bag. Put each chicken thigh into bag, 1 at a time; close bag and shake until evenly coated. Place chicken in a glass baking dish.\nBake in the preheated oven until no longer pink in the center and the juices run clear, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "A/vZqYZgBRtkKmZDEyfl/ziFC484sLq"
    },
    {
        "title": "Shorecook's Cashew Brittle",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 1/2 cups salted cashews ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a baking sheet with 1 tablespoon butter.\nCombine cashews, sugar, and corn syrup in a large microwave-safe glass or ceramic bowl. Microwave on high until sugar melts and mixture is hot, about 6 1/2 minutes.\nStir 1 tablespoon butter and vanilla extract into cashew mixture. Microwave until hot, about 2 1/2 minutes more. Stir baking soda into cashew mixture until light and foamy. Spread mixture on prepared baking sheet. Cool completely and break into pieces.\n",
        "picture_link": "Rz90OhxGrmALdKvPQRf4XL4DEanftN6"
    },
    {
        "title": "Creamy Potato and Leek Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 leeks (white and pale green parts only), sliced ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "5 1/2 cups peeled and diced potatoes, or more to taste ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat. Cook and stir leeks, garlic, salt, and pepper in the hot butter until leeks are tender and lightly browned, about 15 minutes.\nStir chicken broth and cornstarch together in a bowl until cornstarch is dissolved; pour over the leek mixture. Add potatoes to the broth mixture and bring to a boil; season with onion powder and garlic powder. Reduce heat, add half-and-half to broth mixture, and simmer until potatoes are tender, about 30 minutes.\nRemove pot from heat and blend soup using a hand blender until smooth; season with salt and pepper.\n",
        "picture_link": "YlexIefiojhgp9R.Gwbd7VTEiQXarjy"
    },
    {
        "title": "No Milk, No Wheat, Banana Pancakes",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup rolled oats ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend banana, eggs, oats, and baking powder in a blender until smooth, about 45 seconds.\nSpray a griddle or skillet with cooking spray and heat over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "VsRLaY77n.O6j2fF/vNsukmUXtT2rNy"
    },
    {
        "title": "ESER's Balsamic Salad Dressing",
        "ingredients": [
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon honey, or more to taste ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/3 cup olive oil, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine balsamic vinegar, honey, mustard, garlic, oregano, salt, and black pepper in a food processor. Turn the food processor on; pour olive oil in a steady stream into balsamic vinegar mixture until salad dressing is thick and creamy.\n",
        "picture_link": "KtHJgLfP2aVRHjIPKiBSjaRRLdGlP0O"
    },
    {
        "title": "Grilled Cod with Spinach and Tomatoes",
        "ingredients": [
            "1 (4 ounce) fillet cod ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1/4 cup roughly chopped spinach, or to taste ADVERTISEMENT",
            "1/4 tomato, seeded and diced ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "1 tablespoon balsamic vinegar, or to taste ADVERTISEMENT",
            "1 slice mozzarella cheese, cut into cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat.\nPlace cod on a piece of aluminum foil and season with salt, black pepper, and garlic powder. Top cod with spinach, tomato, and onion; season again with salt and black pepper. Drizzle olive oil and balsamic vinegar over cod and top with mozzarella cheese. Fold foil over cod creating a packet, crimping the edges together making a seal.\nCook on the preheated grill until fish flakes easily with a fork, 7 to 9 minutes.\n",
        "picture_link": "uPsyqQQTfOxd0PqXDDSs1jt8qdieu4y"
    }
]