[
    {
        "title": "Scotch Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the flour, sugar, baking powder, and salt. Cut in butter by rubbing the mixture between your fingers until the mixture is fine and crumbly; stir in the raisins. In a small bowl, mix together the egg and milk; mix with dry ingredients to form a soft dough.\nOn a lightly floured surface, roll the dough out to 1/4 inch in thickness. Dip cutter into flour, and stamp out scones. You may need to re roll the dough to get 12.\nHeat dry non-stick griddle over medium heat. Cook each side of the scone until slightly raised and golden brown in color. Transfer to a wire rack to cool.\n",
        "picture_link": "at.kakmUw3qk6t43gyfdTWaSVvF7ZiG"
    },
    {
        "title": "No-Bake Peanutty Graham Treats",
        "ingredients": [
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (16 ounce) package miniature marshmallows ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 (12 ounce) box honey graham cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 9x13 inch baking pan with nonstick spray; set aside.\nMelt the peanut butter, butter, and marshmallows in a saucepan over medium heat, stirring until smooth. Stir in the honey. Remove from heat; stir in the honey graham cereal. Press the mixture evenly into the prepared pan with a greased spatula. Allow to cool; cut into squares to serve.\n",
        "picture_link": "aQnbFT6rHwT/cjqdYWEvcZ/6/DPwYMO"
    },
    {
        "title": "Bacon Wrapped Delights",
        "ingredients": [
            "12 spears white asparagus ADVERTISEMENT",
            "4 ounces enoki mushrooms ADVERTISEMENT",
            "4 ounces shiitake mushrooms, stemmed and sliced 1/4-inch thick ADVERTISEMENT",
            "24 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nBring a pot of water to a boil. Blanch the asparagus until it is barely cooked and still crisp, 2 to 4 minutes. When done, plunge the asparagus into ice water to stop the cooking. When cool, trim the asparagus to 8-inch lengths. Wrap a bundle of 6 asparagus spears with six strips of bacon, side by side, securing each slice with a toothpick. The bacon should be wrapped around twice so that there are two layers.\nTrim the enoki mushrooms, and separate into 12 pieces. Stuff each enoki piece with four pieces of shiitake. Wrap each bundle with a slice of bacon, wrapping around twice, and secure with a toothpick. Place the bundles on a wire rack placed over a baking sheet.\nRoast in preheated oven for 6 minutes, then flip the bundles over, and cook for another 4 to 6 minutes, until the bacon is brown and crisp.\nTo serve, remove all 24 toothpicks, and slice the asparagus bundles between the bacon. Drain on paper towels for a moment before serving.\n",
        "picture_link": "aRd3yPOhtwi.EYR8J1dEc3gidhnVPZa"
    },
    {
        "title": "Salvadoran Salsa (Chimol)",
        "ingredients": [
            "2 radishes, finely chopped ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "3 medium tomatoes, finely chopped ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "2 pinches salt, or to taste ADVERTISEMENT",
            "1 teaspoon red pepper flakes (optional) ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the radishes, cilantro, tomatoes, onion, salt and red pepper flakes. Stir in lemon juice. Let stand for 15 minutes before serving to blend the flavors.\n",
        "picture_link": "ZnxLBOHT6t6CBoKvAN.r9S0GDM4yzbq"
    },
    {
        "title": "Hot Dog Pie",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "4 hot dogs , cut into 1/4-inch slices ADVERTISEMENT",
            "1 (15 ounce) can vegetarian baked beans ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "2 ounces Cheddar cheese, cubed ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "4 slices processed American cheese ADVERTISEMENT",
            "1 (9 inch) deep dish pie shell ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Bake empty pie shell for 10 minutes.\nIn a large skillet over medium heat, cook ground beef until browned, stirring occasionally to crumble; drain fat. Stir in hot dogs, beans, ketchup, brown sugar, mustard, taco seasoning, and cheese cubes. Cook for 2 to 3 minutes.\nSpread beef mixture into baked pie shell. Cut American cheese slices into strips, and make a lattice on top of pie.\nBake for 5 to 10 minute, or until cheese is slightly melted.\n",
        "picture_link": "yoShqd5vJ2f2DSPgpW3S3m.cAFgnDwe"
    },
    {
        "title": "Italian Heroes",
        "ingredients": [
            "1 (14 ounce) can marinated artichoke hearts, drained ADVERTISEMENT",
            "2 cloves garlic, peeled ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "4 (6 inch) French sandwich rolls ADVERTISEMENT",
            "3/4 cup sliced roasted red peppers ADVERTISEMENT",
            "2 cups arugula leaves or spring mix ADVERTISEMENT",
            "8 ounces thinly sliced hard salami ADVERTISEMENT",
            "8 ounces thinly sliced provolone cheese ADVERTISEMENT",
            "4 pepperoncini peppers, drained and chopped (optional) ADVERTISEMENT",
            "1/2 cup sliced black olives (optional) ADVERTISEMENT",
            "1/2 red onion, thinly sliced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor or blender, combine the artichoke hearts, garlic and olive oil. Process until smooth. Season with salt and pepper to taste.\nSlice the sandwich rolls in half lengthwise, and pull out most of the soft bread from the top and bottom. Spread the artichoke paste onto each side of each roll. Place layers of red peppers, arugula, salami, provolone cheese, pepperoncini, olives and onion into the rolls. Press sandwiches together, and wrap tightly in aluminum foil.\nPlace sandwiches in the refrigerator, and place something heavy on top. It helps to place a plate on top, then place cans or any weighted containers on top. I used cottage cheese. Chill for up to 3 hours. Unwrap, cut in half and enjoy.\n",
        "picture_link": "10TVGqzmbhuTKpPVDhLursN9R3c80Bm"
    },
    {
        "title": "Italian Chips",
        "ingredients": [
            "12 wonton wrappers ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "1/2 teaspoon crumbled dried oregano ADVERTISEMENT",
            "3/4 cup freshly grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Prepare a baking sheet with cooking spray.\nArrange the wonton wrappers on the baking sheet in a single layer. Brush each wrapper with egg white; sprinkle with oregano and Parmigiano-Reggiano cheese. Cut each into two triangles using a pizza cutter.\nBake in the preheated oven until the edges are brown, 6 to 7 minutes. Transfer to a cooling rack to cool completely. Store in an airtight container up to 2 days.\n",
        "picture_link": "MQjcO1F/Q82TeAIJdSzAJxvNDvTQSiW"
    },
    {
        "title": "Raspberry Party Shots",
        "ingredients": [
            "1 (6 ounce) package raspberry flavored Jell-O® mix ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "3/4 cup ice water ADVERTISEMENT",
            "1 1/4 cups raspberry vodka ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the gelatin into the boiling water until dissolved. Pour in the ice water and vodka; mix well. Pour into shot glasses or devices specifically made for 'Party Shots.' Chill in the refrigerator for 1 to 2 hours, until set.\n",
        "picture_link": "oAcJC4iijnA72Dxi71skr3rO6RUBO7."
    },
    {
        "title": "Easy Passion Fruit Mousse",
        "ingredients": [
            "1 cup whipping cream ADVERTISEMENT",
            "1 cup sweetened condensed milk ADVERTISEMENT",
            "1/2 cup frozen passion fruit juice concentrate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the whipping cream, condensed milk, and passion fruit juice into a blender. Blend on low until light and fluffy, 30 seconds to 1 minute. Pour into a serving bowl or dessert dishes, and refrigerate at least 30 minutes before serving.\n",
        "picture_link": "v6sxxcbf3lkAOF84Ef0VBfusamUO7nK"
    },
    {
        "title": "Japanese Tofu Salad",
        "ingredients": [
            "1 (14 ounce) package firm tofu, drained ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon mirin (sweetened rice wine) ADVERTISEMENT",
            "2 teaspoons sesame oil, or to taste ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon minced fresh ginger ADVERTISEMENT",
            "1 large tomato, seeded and chopped ADVERTISEMENT",
            "1 small red onion, thinly sliced ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tofu between two plates, and weigh down with a heavy book. Allow tofu to drain for 1 hour, pouring out the expelled liquid every 20 minutes.\nWhisk together the soy sauce, mirin, sesame oil, and rice vinegar in a small bowl. Heat the oil in a small pan over medium heat, stir in the garlic and ginger, and gently cook until lightly golden; stir into the soy sauce mixture.\nCut tofu into bite-sized pieces, and toss together with the tomato, onion, and cilantro. Pour in the dressing and toss to coat. Garnish with a sprinkle of sesame seeds.\n",
        "picture_link": "xhJ7KW5TCPNRokg9zNxgWOdIfmTCqmm"
    },
    {
        "title": "Morgan's Breakfast Polenta",
        "ingredients": [
            "3 cups milk ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup dry polenta ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup sour cream (optional) ADVERTISEMENT",
            "1 tablespoon white sugar (optional) ADVERTISEMENT",
            "6 tablespoons blackberry jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium pan over high heat, bring to boil milk and water. Reduce heat to simmer liquid. Stirring constantly, pour in polenta in a thin, steady stream, breaking up any lumps that form. Stir in 2 tablespoons sugar and salt. Simmer, stirring often, until polenta is soft and creamy, about 30 minutes.\nIn a small bowl, mix sour cream and 1 tablespoon sugar.\nLadle polenta into bowls, and top with about 1 tablespoon of jam and a dollop of sweetened sour cream.\n",
        "picture_link": "CxeHBLn9.9K5w7deRcLagqAgqd3VVe."
    },
    {
        "title": "Chicken and Tomato Stew with Arugula and Cannellini",
        "ingredients": [
            "2 teaspoons lemon juice ADVERTISEMENT",
            "2 teaspoons sherry vinegar ADVERTISEMENT",
            "1 tablespoon white wine ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "2 cups dried penne pasta ADVERTISEMENT",
            "1/4 cup extra virgin olive oil, divided ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "1 tablespoon sherry vinegar ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, rinsed and drained ADVERTISEMENT",
            "1/2 cup torn fresh basil ADVERTISEMENT",
            "2 cups torn arugula leaves ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "freshly grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together 2 teaspoons of lemon juice, 2 teaspoons of sherry vinegar, 1 tablespoon of white wine, 1/8 teaspoon of red pepper flakes, and 1/8 teaspoon of salt. Add the chicken cubes, and stir to coat. Set aside to marinate for at least 20 minutes.\nBring a pot of lightly salted water to a boil. Add the pasta, and cook until tender, about 8 minutes. Drain, and set aside.\nHeat 1 tablespoon of olive oil in a Dutch oven or deep skillet over medium-high heat. Add the chicken, and cook, stirring occasionally, until browned, about 5 minutes. Remove from the pan, and set aside.\nPour in the remaining olive oil, and add the garlic. Cook and stir until fragrant. Mix in 1 cup of white wine, 1 tablespoon of sherry vinegar, tomatoes, and cannellini beans. Stir in the chicken, and reduce heat to low. Cover, and simmer for 15 minutes.\nStir in the pasta, basil, arugula, and red pepper flakes. Cover, and turn off heat. Let sit until the arugula and basil have wilted, about 5 minutes. Season with salt and pepper. Ladle into serving bowls, and top with Romano cheese to serve.\n",
        "picture_link": "vYKmpfqI9E6VZu98JFEy2KzYZCWlaQ."
    },
    {
        "title": "Krista's Toffee Delights",
        "ingredients": [
            "2 cups crushed chocolate graham snacks (such as Nabisco Teddy Grahams®) ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 (8 ounce) package toffee baking bits (such as Heath Bits 'O Brickle®) ADVERTISEMENT",
            "6 (1.4 ounce) bars chocolate covered toffee, crushed (such as Heath®) ADVERTISEMENT",
            "1 (12 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Spray a 9x13 inch baking pan with nonstick spray. Stir together crushed chocolate graham snacks and the melted butter; press evenly into the bottom of the pan.\nBake in the preheated oven for 5 minutes. Remove from oven; layer the toffee baking bits, crushed toffee candy bars, chocolate chips, and chopped pecans evenly over the crust. Pour the sweetened condensed milk evenly over the layers.\nBake in the preheated oven until set, about 20 minutes. Cool overnight before cutting.\n",
        "picture_link": "CN2XLwokPxg5uHHKvbfwJ9yTR1DS3XS"
    },
    {
        "title": "Cheesy Chicken Broccoli Bake",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves, chopped ADVERTISEMENT",
            "2 large heads broccoli, chopped ADVERTISEMENT",
            "10 baby carrots, chopped ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon ground paprika ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C), and grease a 9x12-inch baking dish.\nPour the condensed soups into a bowl and mix well. Place the chicken breast meat, broccoli, and carrots into the baking dish, mix well, and pour the soup mixture over. Sprinkle with basil, thyme, oregano, and paprika, and spread the Cheddar cheese and bread crumbs evenly over the top.\nBake in the preheated oven for 45 minutes, until the casserole is bubbling and the cheese and crumbs are lightly browned.\n",
        "picture_link": "Oz0/P9m6pG1VCL.IjaLWh95xKFxM7f6"
    },
    {
        "title": "Big Mama's Fruit Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend marshmallow creme and cream cheese until smooth. Cover and refrigerate until chilled, about 2 hours.\n",
        "picture_link": "n36waE3jgjAK1gx2MSIBA/SksCcB416"
    },
    {
        "title": "Teriyaki Chicken Cordon Bleu",
        "ingredients": [
            "4 large skinless, boneless chicken thighs ADVERTISEMENT",
            "1 cup teriyaki sauce ADVERTISEMENT",
            "1 tablespoon tomato-based chili sauce ADVERTISEMENT",
            "4 servings butter-flavored cooking spray ADVERTISEMENT",
            "4 slices deli ham ADVERTISEMENT",
            "4 (1 ounce) pieces low-fat string cheese ADVERTISEMENT",
            "4 toothpicks ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken thighs between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of 1/2-inch.\nWhisk together the teriyaki sauce and chili sauce in a bowl, and pour into a resealable plastic bag. Add the chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 18 to 24 hours.\nPreheat an oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with butter-flavored cooking spray.\nRemove the chicken from the marinade, and shake off excess. Discard the remaining marinade. Lay each chicken thigh flat, then layer a slice of ham on each thigh followed by the string cheese. Roll up each chicken thigh around the string cheese and ham, and secure each roll with a toothpick.. Repeat with the remaining chicken.\nSpray each bundle with the butter-flavored cooking spray. Pour panko flakes onto a dish, then roll the bundles into the crumbs and place on prepared baking dish. Lightly spray the bundles once more.\nBake the chicken bundles until no longer pink in the center and the juices run clear, 35 to 40 minutes. An instant-read thermometer inserted into the center of the chicken should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "ahsH2UPfa8uNXLeBBrZe5fubo6buTsC"
    },
    {
        "title": "Creamy Lemon Squares",
        "ingredients": [
            "20 Reduced Fat NILLA Wafers, finely crushed ADVERTISEMENT",
            "1/2 cup flour ADVERTISEMENT",
            "1/4 cup firmly packed brown sugar ADVERTISEMENT",
            "1/4 cup cold margarine ADVERTISEMENT",
            "1 (8 ounce) package PHILADELPHIA Neufchatel Cheese, softened ADVERTISEMENT",
            "1 cup granulated sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "3 tablespoons grated lemon peel, divided ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1/4 teaspoon CALUMET Baking Powder ADVERTISEMENT",
            "2 teaspoons powdered sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Line 8-inch square baking pan with foil, with ends of foil extending over sides of pan. Combine wafer crumbs, 1/2 cup flour and the brown sugar in bowl. Cut in margarine with pastry blender or two knives until mixture resembles coarse crumbs; press firmly onto bottom of prepared pan. Bake 15 min.\nMeanwhile, beat Neufchatel cheese and granulated sugar with electric mixer on medium speed until well blended. Add eggs and 2 Tbsp. flour; mix well. Blend in 1 Tbsp. lemon peel, the lemon juice and baking powder; pour over crust.\nBake 25 to 28 min. or until center is set. Cool completely. Cover and refrigerate at least 2 hours or overnight. Sprinkle with powdered sugar and remaining 2 Tbsp. lemon peel just before serving.\n",
        "picture_link": "0QLFSY8VD4QE..emmnUUS02CpblWHAG"
    },
    {
        "title": "Easy Japanese Steakhouse Soup",
        "ingredients": [
            "3 cups chicken stock ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "1/4 pound fresh snow peas, trimmed and halved ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "3 fresh mushrooms, sliced ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the chicken stock, water, ginger, garlic, and soy sauce to a simmer in a large pot over medium-high heat. Stir in the chicken, and return to a simmer. Reduce heat to medium-low, and continue simmering until the chicken is tender and no longer pink on the inside, about 15 minutes.\nStir in the snow peas and carrot, and simmer 5 minutes. Add the mushrooms, and continue simmering until the vegetables are tender, about 3 minutes. Stir in the green onions, and serve.\n",
        "picture_link": "cgIrntldx1AEcISFko0aqJd/bivTgfm"
    },
    {
        "title": "Chicken Sauerkraut Potato Bake",
        "ingredients": [
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 (32 ounce) jar sauerkraut, drained ADVERTISEMENT",
            "1 (2 1/2 pound) whole chicken, cut into pieces, skin removed ADVERTISEMENT",
            "1 (15 ounce) can whole new potatoes, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nHeat garlic and butter in a small skillet over medium heat. Cook and stir until garlic softens, about 2 minutes. Reserve.\nSpoon the sauerkraut into the bottom of a 9x13 inch baking dish; top with the chicken pieces. Scatter potatoes around the chicken, and sprinkle with the cooked garlic. Spoon some of the sauerkraut over the top of the chicken. Cover dish with aluminum foil.\nBake in preheated oven until the chicken cooked through, and very tender, about 1 1/2 hours.\n",
        "picture_link": "A3WsNoEeeTBpcu/sO/zASE9yfi5nMda"
    },
    {
        "title": "Chinese Sticky Rice Cake",
        "ingredients": [
            "1 (16 ounce) box sweet rice flour (mochiko) ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1/2 (18.75 ounce) can sweetened red bean paste ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C). Lightly grease a 9x13 inch baking pan.\nMix rice flour, canola oil, milk, sugar, and baking powder in a large bowl. Stir in the beaten eggs. Pour the mixture into the baking pan. Drop small spoonfuls of the red bean paste into the flour mixture about 1 to 2 inches apart, making sure that the red bean paste is covered by the flour mixture. Sprinkle with toasted sesame seeds.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 55 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "pNP54nZH7oXwJ6Or9YSSS6l6MOheoXO"
    },
    {
        "title": "Refreshing Summertime Salad",
        "ingredients": [
            "4 cups mixed baby greens ADVERTISEMENT",
            "1/2 cup diced mango ADVERTISEMENT",
            "1/2 cup cubed seeded watermelon ADVERTISEMENT",
            "1 tablespoon chopped fresh mint ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "2 tablespoons minced red onion ADVERTISEMENT",
            "1 tablespoon white balsamic vinegar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon frozen mango juice concentrate, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the baby greens, mango, watermelon, mint, feta cheese, and minced onion in a mixing bowl. Whisk the vinegar, olive oil, and mango juice concentrate together in a small bowl, and pour over the salad. Toss gently to evenly coat.\n",
        "picture_link": "FjF.ipdrsEgyXyPdeJblXtC0LC0vm3O"
    },
    {
        "title": "Kale Soup with Portuguese Sausage",
        "ingredients": [
            "1 quart beef stock ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "2 (14.5 ounce) cans white beans, rinsed and drained ADVERTISEMENT",
            "1/2 onion, unchopped ADVERTISEMENT",
            "3 cloves whole garlic cloves ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 sprigs fresh thyme ADVERTISEMENT",
            "1/2 pound Portuguese andouille sausage, sliced ADVERTISEMENT",
            "2 bunches kale, torn into small pieces ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "2 carrots, chopped, or more to taste ADVERTISEMENT",
            "1/4 teaspoon garlic salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the beef stock, chicken stock, beans, onion half, garlic cloves, salt, black pepper, and thyme in a slow cooker; cook on Low for 8 hours to overnight. Remove and discard the onion and garlic.\nSwitch slow cooker to 'Keep Warm' setting. Add the andouille sausage to the stock mixture; continue cooking until you can smell the sausage, about 1 hour. Stir the kale, celery, carrots, and garlic salt into the soup; cook until the carrots are tender, about 1 hour more.\n",
        "picture_link": "nnwNkP9eRzGdHIFSWiw0lVXJxArYUPi"
    },
    {
        "title": "Jollyrogers' Chilaquiles",
        "ingredients": [
            "1 onion, chopped ADVERTISEMENT",
            "1 (6 ounce) can sliced black olives ADVERTISEMENT",
            "1/2 cup white vinegar, divided ADVERTISEMENT",
            "1 tablespoon vegetable oil (optional) ADVERTISEMENT",
            "1/2 pound chorizo or bulk spicy pork sausage (optional) ADVERTISEMENT",
            "12 (7 inch) corn tortillas, cut into 1-inch pieces ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "3 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (7.75 ounce) can Mexican style hot tomato sauce (such as El Pato Salsa de Chile Fresco®) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 1/2 teaspoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 tablespoon taco seasoning mix (optional) ADVERTISEMENT",
            "1 (4 ounce) can diced green chiles, drained ADVERTISEMENT",
            "3/4 cup crumbled cotija or feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put chopped onion and sliced olives in separate small bowls and combine each with 1/4 cup of vinegar. Set aside to marinate. Meanwhile, heat the vegetable oil in a skillet over medium heat. Stir in the chorizo, breaking it apart into crumbles as it cooks, about 10 minutes. Remove the chorizo from the skillet and set aside.\nHeat 1/4 cup of oil in the skillet and add the tortilla pieces, cooking and stirring over medium-low heat until just beginning to get crisp and golden at the edges, about 10 minutes. Remove skillet from heat and drain the tortillas; pour 1 tablespoon of the oil into a saucepan.\nHeat the saucepan over medium-low heat until hot but not smoking. Add the flour, and cook and stir until smooth, about 1 minute. Pour in the two tomato sauces, water, browned chorizo, cocoa powder, sugar, 1 tablespoon of vinegar, oregano, and taco seasoning. Simmer the sauce about 5 minutes to blend the flavors. Stir in diced chiles and tortillas. Simmer about 10 minutes more, stirring occasionally, until tortillas have softened and the mixture is thick.\nDrain the onion and olives. Spoon a layer of tortilla mixture evenly into a 2 quart baking dish or serving dish, and follow with a layer of about 2 tablespoons marinated onion, then a layer of 2 tablespoons olives, followed by a layer of 1/4 cup Parmesan cheese. Repeat layers twice more. Serve hot.\n",
        "picture_link": "eA4FTPU0G3OvLYSeYBu4GTxG1PNnxEW"
    },
    {
        "title": "Guinean Peanut Sauce with Butternut Squash",
        "ingredients": [
            "1 butternut squash - peeled, seeded, and cut into 2-inch cubes ADVERTISEMENT",
            "1/2 cup natural peanut butter ADVERTISEMENT",
            "1 small tomato, chopped ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large yellow onion, thickly sliced lengthwise ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "salt, or to taste ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the butternut squash in a saucepan with water to cover. Bring to a boil and then simmer, covered, until the squash is tender, about 20 minutes. Drain, reserving the cooking liquid.\nCombine the peanut butter, tomato, and warm water in a bowl. The authentic way to prepare this is to squish it together by hand -- but a food processor works, too.\nHeat the olive oil in a skillet over medium-high heat. When the oil is hot, add the onion slices and cook for 2 minutes. Add the peanut butter mixture, the minced garlic, the bay leaf, black pepper, and about 1/2 teaspoon salt. Stir to combine, then bring to a boil.\nReduce the heat to low and simmer the peanut sauce, adding the reserved cooking liquid as needed, for 15 minutes. The consistency should be similar to a thick soup.\nStir in the butternut squash and simmer for an additional 15 minutes. Add the lemon juice, and taste to adjust the seasoning.\n",
        "picture_link": "J/lTzEkKEHAkV1Ji20Jocs4VeQ6ER02"
    },
    {
        "title": "Keftedes - Greek Meatballs",
        "ingredients": [
            "oil for frying ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "5 white potatoes, peeled ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1 large onion, grated ADVERTISEMENT",
            "3/4 cup dry bread crumbs ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "1/3 cup dried mint, crushed ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "zest from 1 lemon ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 1/2 tablespoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "lemon wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 325 degrees F (165 degrees C).\nPlace the lemon juice in a large bowl. Coarsely grate the potatoes into the lemon juice, stirring well to prevent browning. Stir in the ground beef, onion, bread crumbs, parsley, mint, cinnamon, lemon zest, eggs, and salt and pepper. Mix well, and shape into oblong balls about 1 inch thick and 2 inches wide.\nPlace meatballs in hot oil in batches; do not crowd. Fry until golden brown, and cooked through, about 6 to 7 minutes per batch. Serve with lemon wedges.\n",
        "picture_link": "ZsHvmUfFi.FLPMy3uPruDajDTdmp1rC"
    },
    {
        "title": "Thai-style Cucumber Salad",
        "ingredients": [
            "1/4 cup tamarind juice ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon chopped peanuts ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 1/2 teaspoons brown sugar ADVERTISEMENT",
            "1 teaspoon fish sauce ADVERTISEMENT",
            "3/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon toasted Asian sesame oil ADVERTISEMENT",
            "3/4 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 cucumber, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the tamarind juice, cilantro, peanuts, rice vinegar, brown sugar, fish sauce, red pepper flakes, sesame oil, and ginger in a large bowl. Stir in the cucumber. Cover and refrigerate for 10 minutes before serving.\n",
        "picture_link": "37yEYDjH7Ws.Bp3lXwZQ07iswjcF5J2"
    },
    {
        "title": "Schnitzel with a Twist",
        "ingredients": [
            "4 pork chops ADVERTISEMENT",
            "1 sleeve buttery crackers (such as Keebler Club® crackers), crushed ADVERTISEMENT",
            "1/2 teaspoon Greek seasoning (such as Cavender's®) ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pork chops between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the pork with the smooth side of a meat mallet to a thickness of 1/2-inch.\nCombine crackers, Greek seasoning, and pepper in a large mixing bowl. Place the flour in a shallow bowl. Dredge the pork chops in the flour, then dip them into the egg. Toss the pork chops one at a time in the cracker mixture to coat.\nMelt the butter in a large skillet over medium heat. Fry the pork chops in the butter until golden brown, reducing heat to medium-low if the pork browns too quickly, 10 to 15 minutes. Flip the pork chops, continue cooking until the pork is no longer pink in the center, 10 to 15 more minutes. Serve with lemon wedges.\n",
        "picture_link": "jFKpewN1nqPE6.hboHhx1nJEl.aLJUy"
    },
    {
        "title": "Pink Brain Shooter",
        "ingredients": [
            "1 brain-shaped gelatin mold ADVERTISEMENT",
            "4 (3 ounce) packages peach flavored Jell-O® mix ADVERTISEMENT",
            "3 cups boiling water ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 1/2 cups peach schnapps ADVERTISEMENT",
            "4 drops blue food coloring ADVERTISEMENT",
            "2 drops red food coloring ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly oil a brain-shaped gelatin mold.\nStir the peach gelatin mix with boiling water in a bowl to dissolve the gelatin. Allow to cool to room temperature, about 20 minutes. Mix in the evaporated milk and peach schnapps; pour into the prepared mold. Refrigerate until set, 4 to 6 hours.\nTo decorate, dip the mold in very warm water (don't let the water enter the top of the mold) to loosen; invert the mold on a serving platter and lift to leave the brain in place. Mix blue and red food coloring in a small bowl with 2 teaspoons of water. Use a small clean paintbrush to paint the coloring into the grooves of the brain. Return the brain to the refrigerator until the food coloring sets. Serve cold.\n",
        "picture_link": "oxSq0hYhyeOLPOL/Gp4U/15EjWCsxe2"
    },
    {
        "title": "California Potato Salad",
        "ingredients": [
            "4 potatoes, peeled and cubed ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup shaved fresh Parmesan cheese ADVERTISEMENT",
            "1/2 cup herb seasoned croutons ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 tablespoons rice vinegar, or to taste ADVERTISEMENT",
            "3 tablespoons mayonnaise, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a large pot and cover with salted water. Bring to a boil; reduce heat to medium-low, cover, and simmer until tender, about 15 minutes. Drain and allow to steam dry for a minute or two. Allow to cool.\nPlace the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water and cool the eggs under cold running water in the sink. Peel once cold. Dice the eggs.\nIn a salad bowl, lightly toss the potatoes, eggs, artichoke hearts, garlic, Parmesan cheese, croutons, Dijon mustard, rice vinegar, and mayonnaise until all ingredients are coated with dressing.\n",
        "picture_link": "AYeLpIqev3R4/kXhViudmUsOL3FYZvq"
    },
    {
        "title": "Easy Chicken Stew with Apple",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, cut into cubes ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon caraway seeds ADVERTISEMENT",
            "1 cup chopped red onion ADVERTISEMENT",
            "1 large clove garlic, minced ADVERTISEMENT",
            "1 stalk celery, sliced ADVERTISEMENT",
            "4 potatoes, cut into cubes ADVERTISEMENT",
            "4 carrots, sliced 1/4-inch thick ADVERTISEMENT",
            "2 parsnips, sliced 1/4-inch thick ADVERTISEMENT",
            "3 Macintosh apples - peeled, cored and chopped ADVERTISEMENT",
            "3 cups chicken stock, or more if needed ADVERTISEMENT",
            "2 cups apple cider ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium heat; cook the chicken in the hot oil until it has begun to brown. Add the bay leaves, salt, thyme, black pepper, caraway seeds, red onion, garlic, celery, potatoes, carrots, parsnips, apples, chicken stock, apple cider, and cider vinegar to the pot. There should be enough liquid to just cover the vegetables. If not, add more chicken stock to cover the vegetables.\nBring the mixture to a simmer and cook, stirring occasionally, until the carrots are tender, about 30 minutes. Remove the bay leaves and garnish with the parsley to serve.\n",
        "picture_link": "XbRone15wogYgkg5OhLdO7ddkOSo/KC"
    },
    {
        "title": "Chex®icago Party Mix",
        "ingredients": [
            "3 cups Corn Chex® cereal ADVERTISEMENT",
            "3 cups Wheat Chex® cereal ADVERTISEMENT",
            "2 cups Chocolate Chex® cereal ADVERTISEMENT",
            "2 cups bite-size square cheese crackers ADVERTISEMENT",
            "3 cups cheese popcorn ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/3 cup light brown sugar or molasses ADVERTISEMENT",
            "1/3 cup light corn syrup ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cereals, 1 cup of the cheese crackers and 2 cups of the popcorn in large, microwavable bowl. Set aside.\nPlace butter, brown sugar, corn syrup and salt in 2-cup microwavable measuring cup. Microwave on High 1 minute 30 seconds. Stir; microwave on High until bubbling. Remove from microwave; stir in baking soda. Mixture will foam up, but keep mixing until baking soda is dissolved. Pour over the cereal mixture; stir until fully coated.\nMicrowave on High 4 to 5 minutes, stirring after every minute. Spread on waxed paper-lined baking sheet. Let cool for about 5 minutes to let caramel fully harden. Stir in remaining 1 cup cheese crackers and 1 cup popcorn.\n",
        "picture_link": "MIG8134DLiV4Yqv3AZjW5/HHUFvfiey"
    },
    {
        "title": "Broccoli and Artichoke Bake",
        "ingredients": [
            "2 heads broccoli, cut into florets ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tomato, thinly sliced ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add the broccoli florets, and cook uncovered for a few minutes until the broccoli is just tender. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Drain well, place into a large mixing bowl, and set aside.\nMeanwhile, melt the butter in a skillet over medium-high heat. Stir in the mushrooms and green onions, and cook until the mushrooms have softened and released their liquid, about 3 minutes. Scrape the mushrooms into the mixing bowl along with the broccoli, then add the artichoke hearts, sour cream, mayonnaise, and Parmesan cheese. Gently fold together until evenly mixed and spread into a 9x13 inch baking dish. Arrange the sliced tomatoes over the broccoli, then sprinkle with the bread crumbs.\nBake in the preheated oven until the casserole is hot and the bread crumbs have turned golden brown, about 25 minutes.\n",
        "picture_link": "2TD1s6wE.eadHp6SQLpiQDqIaB2kVhO"
    },
    {
        "title": "Black Bean Hummus with Tahini",
        "ingredients": [
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1/4 cup tahini paste ADVERTISEMENT",
            "1/4 cup plain yogurt ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon olive oil, for drizzling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the black beans, tahini, yogurt, garlic, lemon juice, 1 tablespoon olive oil, and salt in the bowl of a blender or food processor; blend until smooth. Chill 1 hour before serving. Drizzle with 1 teaspoon olive oil to garnish.\n",
        "picture_link": "7/oAQGWHKJ.pLcHRWQVEJEMYgwyJvby"
    },
    {
        "title": "Jumbutt Skillet Scramble",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 (4 ounce) links sweet Italian sausage (casings removed) ADVERTISEMENT",
            "3 large russet potatoes, peeled and sliced ADVERTISEMENT",
            "2 green bell peppers, sliced ADVERTISEMENT",
            "2 red bell peppers, sliced ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat, and cook and stir the sausage until browned and crumbly, about 5 minutes. Remove from skillet, drain off the excess fat, and set aside.\nPlace the potatoes, green peppers, and red peppers into the skillet, and cook, stirring occasionally, until the potatoes are browned and the peppers are softened, about 15 minutes. Return the sausage to the skillet, and pour the eggs over the top. Cook and stir 3 to 5 minutes until the eggs are set, and serve.\n",
        "picture_link": "7gz0m1PsAl.tlbwlo0PV4m4eHR1Tmae"
    },
    {
        "title": "Mawmenye (Lentils and Beef Stew)",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/4 pounds lean beef stew meat, cut into 1-inch cubes ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup dry lentils ADVERTISEMENT",
            "4 cups beef broth ADVERTISEMENT",
            "1 cup diced turnip ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "2/3 cup chopped dried figs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium-high heat. Season the beef with salt and pepper, then cook in the pot until browned on the outside. Pour in the chicken broth, and simmer over medium heat for about 45 minutes, until the beef is tender. Remove the beef from the liquid, and set aside.\nPour the beef broth into the pot, and add the lentils. Bring to a boil, then simmer over low heat for 15 minutes.\nSeason the turnips with cinnamon, nutmeg, salt and basil, and add them to the pot. Return the beef to the pot, and stir in the raisins and figs. Simmer for 10 minutes to blend the flavors before serving.\n",
        "picture_link": "ndgjsAmdFfk1uelsGfqAwQoeQY79XGG"
    },
    {
        "title": "WV's Finest Boneless Ribs",
        "ingredients": [
            "2 pounds boneless beef short ribs ADVERTISEMENT",
            "1 (12 ounce) bottle chili sauce ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "1/3 cup finely chopped onion ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 tablespoon yellow mustard ADVERTISEMENT",
            "1 tablespoon honey mustard ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons steak sauce ADVERTISEMENT",
            "1/4 teaspoon celery seed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place ribs in a baking dish, and bake 1 hour, or to a minimum internal temperature of 160 degrees F.\nIn a saucepan over medium heat, mix the chili sauce, liquid smoke flavoring, onion, garlic, yellow mustard, honey mustard, Worcestershire sauce, steak sauce, and celery seed. Season with salt and pepper. Simmer 30 minutes, stirring occasionally.\nPreheat an outdoor grill for high heat.\nLightly oil the grill grate. Place ribs on grill. Constantly coat ribs with the sauce, and cook 15 minutes, or until nicely browned.\n",
        "picture_link": "GBr.V8PXMl8QbxL20Lg3g4i.xbhfYoa"
    },
    {
        "title": "Double Ranch Fries",
        "ingredients": [
            "3 large potatoes, scrubbed ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (1 ounce) package dry Ranch-style dressing mix ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "1 quart oil for frying, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer to 365 degrees F (185 degrees C).\nCut potatoes into wedges or fries, and soak in a bowl with milk. Stir together the ranch dressing mix and garlic salt; place on a plate or in a bag. Drain potatoes, and roll in the seasonings to coat.\nPlace potatoes into the deep-fryer in batches so they are not too crowded. Fry for 5 minutes, or until golden brown. Drain on paper towels, and season with leftover seasoning mixture.\n",
        "picture_link": "8LOqYAFN1f9BJItLjdrOcJOStwEI.zG"
    },
    {
        "title": "Lisa's Best Baked Clams",
        "ingredients": [
            "6 large clams in shells ADVERTISEMENT",
            "12 unsalted soda crackers, crushed ADVERTISEMENT",
            "3 tablespoons garlic powder ADVERTISEMENT",
            "2 tablespoons parsley ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon lemon juice (optional) ADVERTISEMENT",
            "1 dash hot pepper sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of water to a boil. Add clams, and boil until all of the clams are open, about 5 minutes. Drain, and remove the empty half of the shell from each one. Place the full halves onto a baking sheet.\nPreheat the oven to 350 degrees F (175 degrees C). Place the crackers, garlic powder, and parsley into a large resealable bag. Crush until fine, and mash to mix. Melt butter in a skillet over medium heat. Add the cracker crumb mixture, and cook until golden brown, stirring constantly. Spoon onto the clams in the shells.\nBake for 10 to 15 minutes in the preheated oven, until browned and topping is crispy. Serve with lemon and hot pepper sauce.\n",
        "picture_link": "H7psVmDpvTyO0uecPcq3rETp6Utrv3q"
    },
    {
        "title": "Chicken with Red Pepper Cream Sauce",
        "ingredients": [
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "2 cups mushrooms, chopped ADVERTISEMENT",
            "2 cloves garlic, diced ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - diced ADVERTISEMENT",
            "1/2 pound turkey bacon ADVERTISEMENT",
            "1 cup frozen peas, thawed ADVERTISEMENT",
            "1 (12 ounce) jar roasted red peppers packed in oil, undrained ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup fat-free evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon olive oil in a skillet over medium heat, and saute the onion, mushrooms, and garlic until onions are tender. Remove from skillet and set aside.\nHeat remaining olive oil in the skillet over medium heat, and cook the chicken and turkey bacon until chicken juices run clear and bacon is browned and crisp. Return the onion mixture to the skillet, mix in the peas, and reduce heat to low. Simmer, stirring occasionally, while preparing the red pepper and sour cream sauce.\nIn a small saucepan over medium heat, heat the roasted red peppers and oil until heated through.\nIn a bowl, mix the sour cream and evaporated milk. Heat in the microwave on High for 1 minute, or until heated through.\nIn a blender or food processor, blend the red peppers and the sour cream mixture until smooth. Pour over the chicken mixture in the skillet.\n",
        "picture_link": "915aN.34ux1si89RhUciO9erslE9NAu"
    },
    {
        "title": "Coconut Loaf",
        "ingredients": [
            "1 cup coconut ADVERTISEMENT",
            "1 cup castor sugar or superfine sugar ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the coconut, sugar, and self-rising flour. Stir in the milk, just until everything is moistened. Spoon into a greased 8x4 inch loaf pan.\nBake for 45 minutes in the preheated oven, until a toothpick inserted into the crown of the loaf comes out clean.\n",
        "picture_link": "YLhI8rzv5eWui0FLEWuqs/YDTjyyXdi"
    },
    {
        "title": "Peanut Mallow Bars",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/3 cup butter or margarine, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "4 cups miniature marshmallows ADVERTISEMENT",
            "2 cups peanut butter chips ADVERTISEMENT",
            "2/3 cup light corn syrup ADVERTISEMENT",
            "1/4 cup butter or margarine ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "2 cups salted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, mix together the cake mix, water, butter, and egg until well blended. Spread into the bottom of the prepared pan.\nBake for 20 minutes in the preheated oven, or until a toothpick inserted into the center comes out clean. Remove from the oven, and sprinkle the marshmallows over the top. Return to the oven for about 2 minutes, just to melt the marshmallows together. Remove from the oven, and place pan on a wire rack to cool.\nIn a saucepan, combine the peanut butter chips, corn syrup, and butter. Stir over medium-low heat until melted and well blended. Remove from the heat, and stir in the vanilla, rice cereal and peanuts. Spread in an even layer over the marshmallows. Allow the bars to cool completely before cutting into squares.\n",
        "picture_link": "Q2uArZb9OZWH9nwXyvBzGJt8M0G2RkO"
    },
    {
        "title": "Quick and Easy Indian-Style Okra",
        "ingredients": [
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/4 teaspoon mustard seed ADVERTISEMENT",
            "1 pinch asafoetida powder ADVERTISEMENT",
            "1 medium onion, thinly sliced ADVERTISEMENT",
            "1 clove garlic, peeled and sliced ADVERTISEMENT",
            "1/4 teaspoon cumin seed ADVERTISEMENT",
            "1/8 teaspoon ground turmeric ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "1 (16 ounce) package frozen sliced okra ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon amchoor ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a medium skillet over medium heat, and cook mustard seed until it begins to crackle. Mix in asafoetida. Reduce heat to low, and mix in onion, garlic, cumin seed, and turmeric. Cook and stir until onion is tender, about 5 minutes.\nStir tomato and okra into the mixture. Gradually mix in chili powder, amchoor, and salt. Cook and stir about 10 minutes, until okra is tender but firm.\n",
        "picture_link": "IT.nG8AtxO43mEtW1J5iWfHZq3nv5jS"
    },
    {
        "title": "Hot Ponderosas!",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "5 1/2 tablespoons minced garlic ADVERTISEMENT",
            "2 1/2 tablespoons crumbled blue cheese ADVERTISEMENT",
            "3 1/2 tablespoons herbes de Provence ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "1 thin baguette, cut into thick slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the grill for high heat.\nMelt the butter in a saucepan over medium heat, and mix in the garlic, blue cheese, herbes de Provence, red pepper, sea salt, black pepper, and Worcestershire sauce.\nDunk each baguette slice in the butter mixture to thoroughly coat. Place slices in a bowl, and toss with any remaining butter mixture.\nPlace the baguette slices on the prepared grill, and toast 1 minute on both sides, or to desired doneness.\n",
        "picture_link": "Ado78ANak/6NamU8iZwSTitG.scuqA6"
    },
    {
        "title": "Summer Sandwich",
        "ingredients": [
            "1 (1 pound) loaf ciabatta bread ADVERTISEMENT",
            "3/4 cup pesto ADVERTISEMENT",
            "8 ounces fontina cheese, sliced ADVERTISEMENT",
            "2 ripe tomatoes, sliced ADVERTISEMENT",
            "4 leaves butter lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat broiler.\nSlice ciabatta bread in half lengthwise. Spread pesto on the cut side of each half. Top bottom half with slices of fontina cheese, and then place slices of tomato on top of cheese. Broil until cheese melts, and remove from broiler.\nPlace lettuce over tomatoes, and then position top half of bread on top of everything. Slice into 8 or 10 small sandwiches, and serve.\n",
        "picture_link": "HnGAT./Hhy31EW6fNa9LFo.DhB1exSK"
    },
    {
        "title": "Gingered Acorn Squash",
        "ingredients": [
            "2 medium acorn squash, halved and seeded ADVERTISEMENT",
            "4 tablespoons fresh orange juice ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nArrange squash halves cut side up in a shallow baking dish. Place one tablespoon of orange juice into each cavity. Sprinkle each one with ginger and nutmeg. Cover the dish with aluminum foil.\nBake for 60 to 90 minutes in the preheated oven, or until the squash is tender. Baking time will depend on the size of the squash. Remove from the oven, discard aluminum foil, and let the squash rest for 5 minutes before serving to let the juices settle.\n",
        "picture_link": "n5IlLQ6fbUxGH2oEabrdcblsAEHuTM."
    },
    {
        "title": "First Class Bleu Cheese Salad",
        "ingredients": [
            "1 hard-cooked egg, sieved or finely chopped ADVERTISEMENT",
            "8 romaine lettuce leaves, torn into bite size pieces ADVERTISEMENT",
            "1/2 cup blue cheese dressing ADVERTISEMENT",
            "1/4 cup toasted sliced almonds ADVERTISEMENT",
            "1/4 cup crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, toss together the egg, romaine lettuce, blue cheese dressing, toasted almonds, and crumbled blue cheese. Divide between two serving plates.\n",
        "picture_link": "OJBt09WEBfLhikEw9z/WAMFg3rmS0SS"
    },
    {
        "title": "Valencian Savory Empanadas",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "2 small tomatoes - peeled, seeded and chopped ADVERTISEMENT",
            "4 ounces diced cooked ham ADVERTISEMENT",
            "2 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (10 ounce) can refrigerated pizza crust dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium-high heat. Add the onions, and saute until tender. Pour in the tomatoes, and cook for a minute, then stir in the ham and heat through. Remove from the heat, and mix in the eggs and parsley. Allow to cool for at least 5 minutes.\nPreheat the oven to 425 degrees F (220 degrees C). Unroll the can of pizza dough on a clean surface, and stretch or roll into a 14x10 inch rectangle. Cut into twelve 3 inch squares.\nPlace equal amounts of the filling into the centers of the squares. Brush the edges lightly with water. Fold in halves to form a triangle, pressing the edges to seal. Place on a greased cookie sheet and prick with a fork.\nBake for 8 to 10 minutes in the preheated oven, until golden brown. Let stand 5 minutes before serving.\n",
        "picture_link": "tGkYdL7Ulm5yRnMUsDq2uuc052UXArK"
    },
    {
        "title": "Quick Chops",
        "ingredients": [
            "1 cup orange juice ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 boneless center-cut pork loin chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking dish.\nIn a bowl, mix the orange juice, Dijon mustard, and brown sugar. Place the pork chops in the prepared baking dish, and pour orange juice mixture over chops.\nBake 20 minutes in the preheated oven, to a minimum internal temperature of 145 degrees F (63 degrees C).\nPour the remaining marinade liquid into a skillet, and cook over medium-high heat until reduced by about 1/2. Pour over the cooked chops to serve.\n",
        "picture_link": ".KgFyCImyK56HVw/VpNwffSHFMLkDFG"
    },
    {
        "title": "Creamy Cucumber Brussels Sprouts",
        "ingredients": [
            "3/4 pound Brussels sprouts, trimmed ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 medium cucumbers, cut into 1/2 inch chunks ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 teaspoons chicken bouillon ADVERTISEMENT",
            "1/8 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace Brussels sprouts in a pot with enough lightly salted water to cover. Bring to a boil, and cook 5 minutes, or until tender.\nMelt the butter in a skillet over medium heat. Place cucumbers in the skillet, and cook 5 minutes, until tender. Set aside cucumbers, and mix the flour into the butter to form a roux. Mix in the milk, bouillon, and pepper, and cook 2 minutes, stirring constantly, until thickened.\nIn a baking dish, mix the Brussels sprouts and cucumbers. Drizzle with the butter sauce, and gently toss to coat.\nCover, and bake 20 minutes in the preheated oven.\n",
        "picture_link": "bwk3k5uy009mOlEBfD/Hy18o1S11y5C"
    },
    {
        "title": "Easy Seafood Alfredo",
        "ingredients": [
            "16 ounces uncooked black squid ink pasta ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 cup fat-free half-and-half ADVERTISEMENT",
            "6 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 slice fat-free American cheese, torn into pieces ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 (8 ounce) packages imitation crabmeat, flaked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta, cook for 8 to 10 minutes, until al dente, and drain.\nMelt the butter in a skillet over medium heat, and cook the garlic 1 minute. Pour in the chicken broth and half-and-half. Cook and stir until heated through.\nMix the Parmesan cheese and American cheese into the skillet. Cook and stir until American cheese is melted. Season the mixture with basil, parsley, and pepper. Mix in the imitation crabmeat, and continue cooking until heated through. Serve over the cooked pasta.\n",
        "picture_link": "gRJFc54GbxIXivdJaOrWnyvqkQtaWo2"
    },
    {
        "title": "Porridge",
        "ingredients": [
            "1 cup rolled oats ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1/2 cup cold milk (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine the oats, water, salt, sugar, bananas and cinnamon. Bring to a boil, then reduce heat to low, and simmer until the liquid has been absorbed, stirring frequently. Pour into bowls, and top each with a splash of cold milk.\n",
        "picture_link": "YJdjQiNFL4cdB2hwhaFrh1Vyfuxeq3C"
    },
    {
        "title": "Tomato Basil Chicken",
        "ingredients": [
            "2 cups olive oil for frying ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 pint grape tomatoes, sliced ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "1 cup chopped fresh basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup balsamic vinegar, or to taste ADVERTISEMENT",
            "1/4 cup olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 cups olive oil in a skillet over medium heat. Place the eggs and bread crumbs in 2 separate bowls. Dip chicken in the eggs then in the bread crumbs to coat. Place chicken in the skillet, and fry until golden brown and juices run clear. Drain on paper towels.\nIn a bowl, mix the tomatoes, onion, and basil. Season with salt and pepper, and drizzle with balsamic vinegar and olive oil. Spoon over the fried chicken to serve.\n",
        "picture_link": "Udcq806qBPWIZsEHN9cGnzcGeRw7WOy"
    },
    {
        "title": "Cheese Bourekas",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch onion powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch black pepper ADVERTISEMENT",
            "1 (17.5 ounce) package frozen puff pastry ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nBeat 1 egg in a medium bowl, and mix in the cheese. Season with parsley, garlic powder, onion powder, salt, and pepper.\nOn a lightly floured surface, cut each sheet of puff pastry into 6 equal squares to give 12 squares in total. Beat the remaining egg with water in small bowl. Brush edges of each square lightly with egg wash. Place a heaping tablespoon of the cheese mixture in the center of each square. Fold pastry over the filling, and seal edges with a fork. Transfer to the prepared baking sheet, brush with remaining egg wash and sprinkle with sesame seeds.\nBake in the preheated oven 30 minutes, or until golden brown. Serve immediately.\n",
        "picture_link": "erfRZAoihP3rLFTiReCeJqWiwk9HNhW"
    },
    {
        "title": "Honey Mustard Easy Franks",
        "ingredients": [
            "8 beef frankfurters ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "1/4 cup yellow mustard ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of water to a boil. Add frankfurters and cook for 4 to 5 minutes or until heated through; drain.\nHeat butter in a large heavy skillet over medium heat. Saute onion until translucent. Stir in ketchup, mustard and honey. Stir in frankfurters.\n",
        "picture_link": "pSGdqDlL8TrdJeMZqBYJg9mnLMKN7cG"
    },
    {
        "title": "Grilled Chicken and Sun-Dried Tomato Subs",
        "ingredients": [
            "6 boneless, skinless chicken breast halves ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 (8 ounce) jar sun-dried tomatoes, packed in oil - drained, oil reserved ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives, drained ADVERTISEMENT",
            "6 hoagie rolls, split lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium high heat, and lightly oil grate. Lightly pound chicken to flatten. Trim excess fat from edges. Brush lightly with olive oil, then season both sides of chicken with salt, pepper, garlic powder, onion powder, oregano and red pepper to taste; set aside\nIn a medium bowl, combine the sun-dried tomatoes, olives, and about 2 1/2 tablespoons oil from the tomatoes. Season with salt and pepper to taste; set aside\nPlace chicken on preheated grill, and cook for 10 to 12 minutes, turning in different directions while cooking to get cross-hatch grill marks. Place cooked chicken on rolls, and top each with a heaping tablespoon of tomato mixture.\n",
        "picture_link": "0JRDkrKboVdPg9jmUxLuPA7r/gjO096"
    },
    {
        "title": "Green Papaya Salad",
        "ingredients": [
            "3 cloves garlic, peeled ADVERTISEMENT",
            "3 fresh green chile peppers ADVERTISEMENT",
            "6 green beans, cut into 1 inch pieces ADVERTISEMENT",
            "1 large unripe papaya, peeled and cut into thin strips ADVERTISEMENT",
            "1 tomato, halved and seeded ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "2 tablespoons finely chopped unsalted, dry-roasted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender or food processor, coarsely chop the garlic, chile peppers, and green beans. Mix in the papaya, and process into small chunks. Mix in the tomato, fish sauce, lime juice, and sugar. Process the mixture until soft and slightly chunky. Transfer to a medium bowl. Stir in the peanuts. Cover, and refrigerate until serving.\n",
        "picture_link": "WtI6oEb1ti.ZJT1GRq9ugkD6nqMeAWi"
    },
    {
        "title": "Pineapple Pizzas",
        "ingredients": [
            "1/2 pound ground Italian sausage ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1 cup crushed pineapple, drained ADVERTISEMENT",
            "4 English muffins, split ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking sheet.\nPlace ground Italian sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Remove from heat.\nDrain sausage, and mix in garlic salt, oregano and crushed pineapple.\nArrange English muffin halves in a single layer on the prepared baking sheet. Spread with tomato paste. Layer with the Italian sausage mixture. Top with mozzarella cheese.\nBake in the preheated oven 10 to 15 minutes, or until cheese is melted and lightly browned.\n",
        "picture_link": "5ohZIIkly28Joj0E3YnTLPuZhPKbRqC"
    },
    {
        "title": "Watermelon Rind Preserves",
        "ingredients": [
            "4 pounds chopped watermelon rind ADVERTISEMENT",
            "1 gallon water ADVERTISEMENT",
            "1/2 cup salt ADVERTISEMENT",
            "9 cups white sugar ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "4 teaspoons crushed cinnamon stick ADVERTISEMENT",
            "4 teaspoons ground cloves ADVERTISEMENT",
            "4 lemons - rinsed, sliced and seeded ADVERTISEMENT",
            "1 dash red food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel off the green part of the watermelon rind, and slice into 2 inch pieces. Soak the rind in a solution of 1 gallon water and 1/2 cup salt overnight.\nRemove rind from the salt water, and place in a stockpot with clean water to cover. Bring to a boil over medium-high heat, and cook for about 30 minutes, or until the rind is tender. Drain.\nIn a large pot, combine the sugar, 8 cups water, and sliced lemons. Tie the cinnamon and cloves into a cheesecloth bag, and place in the pot. Bring the syrup to a boil, and boil for 5 minutes. Add the rinds, and cook until transparent. Remove spice bag. Stir in red food coloring, if using. Ladle preserves into hot sterile jars, and process to seal.\n",
        "picture_link": "rxl1y2ZzNgWXRMzRCQYDsbeCL7TbaUC"
    },
    {
        "title": "Catfish Etouffee",
        "ingredients": [
            "1 cup enriched white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "4 tablespoons brown roux ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1 pound tomatoes, coarsely chopped ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 pounds catfish fillets, cut into 1 inch pieces ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "red pepper flakes (to taste) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine rice and water in a small saucepan. Bring to a boil, reduce heat to low, and simmer for 15 to 20 minutes, or until done.\nIn a large saucepan, warm roux over medium heat. Stir in onion, green bell pepper, and garlic; cook for about 5 minutes, or until soft. Stir in broth and tomatoes. Season with lemon juice, Worcestershire sauce, bay leaf, black pepper, thyme, and salt. Reduce heat to low, cover, and simmer for 30 minutes.\nStir in catfish and parsley. Simmer, partially covered, for 10 minutes, or until fish flakes easily with a fork.\nStir in 2 cups cooked white rice, and season with red pepper flakes. Serve.\n",
        "picture_link": "b5j9YcnitNPDz78.2E/rN2UCkp4K/LO"
    },
    {
        "title": "Sawmill Gravy",
        "ingredients": [
            "1 pound ground pork sausage ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sausage in a large, deep skillet. Cook over medium heat until evenly brown. Drain on paper towels, reserving 2 tablespoons fat in skillet. Stir in flour, salt, and pepper. Cook, stirring constantly, until flour is brown. Add chopped green onion, and cook until tender. Gradually stir in milk, and cook until thickened. Add more milk if necessary to achieve preferred consistency. Serve with sausage.\n",
        "picture_link": "8Y0f1Jp8kzk41nkc4kz37dWYBmHThEq"
    },
    {
        "title": "Raspberry Summer Pudding (English Style)",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "3 cups fresh raspberries ADVERTISEMENT",
            "6 slices white bread ADVERTISEMENT",
            "1 cup whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, combine the sugar, water, and raspberries. Cook, stirring carefully so as not to damage the berries, until the mixture is hot, and the sugar is dissolved. Set aside to cool slightly.\nLine a 1 quart bowl with 5 slices of bread. Pour the raspberry mixture over the bread, and place the last slice of bread on top. Cover the bowl loosely with plastic wrap. Place a weight on top of the bowl (canned goods work well), and refrigerate overnight.\nThe next day, remove plastic wrap, and invert onto a plate. Serve chilled, with whipped cream on the side.\n",
        "picture_link": "U3uI/knf1g1ELNwzRiLyekYCB4GEr0."
    },
    {
        "title": "Chocolate Buttermilk Bread",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "5 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees F). Grease only the bottom of a 9x5 inch loaf pan.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the buttermilk. Combine the flour, 1/2 cup cocoa, baking powder, baking soda and salt; stir into the buttermilk mixture until moistened. Mix in 1/3 cup pecans. Pour into the prepared pan.\nBake for 55 to 65 minutes in the preheated oven, until a wooden pick inserted near the center comes out clean. Cool in the pan for 15 minutes before removing to a wire rack to cool completely.\nCombine the margarine, 1/4 cup cocoa, and milk in a saucepan over medium heat. Cook, stirring, until melted and smooth. Remove from heat, and mix in the vanilla and confectioners' sugar. Stir in the remaining 1/2 cup pecans. Spread on top of the cooled loaf.\n",
        "picture_link": "8jhQ11hsp3jY2MIl3Aduj67b948ajK."
    },
    {
        "title": "Belgian Salad",
        "ingredients": [
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (15 ounce) can green beans, drained ADVERTISEMENT",
            "1 (15 ounce) can baby peas ADVERTISEMENT",
            "1 (15 ounce) can white corn, drained ADVERTISEMENT",
            "1 (2 ounce) jar pimentos, drained ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium-high heat, bring oil, vinegar, and sugar to a boil. Reduce to a simmer, and stir until sugar is completely dissolved. Refrigerate 1 hour.\nIn a medium bowl, mix together the green beans, peas, corn, pimentos, celery, and onion. Pour in dressing, and toss to coat. Cover and refrigerate 8 hours, or overnight. Season with salt and pepper, and serve chilled.\n",
        "picture_link": "XWDJAabuKsCk4EmSoyYuCu5H5gbARKO"
    },
    {
        "title": "Hot Mexican Dip",
        "ingredients": [
            "1 (15 ounce) can chili without beans ADVERTISEMENT",
            "1 (8 ounce) jar salsa ADVERTISEMENT",
            "1 (8 ounce) jar taco sauce ADVERTISEMENT",
            "2 chopped green chile peppers ADVERTISEMENT",
            "crushed red pepper to taste ADVERTISEMENT",
            "2 pounds processed cheese, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker set for low heat, place chili without beans, salsa, taco sauce, green chile peppers, crushed red pepper and processed cheese. Stirring occasionally, heat until processed cheese is melted and all ingredients are well blended.\n",
        "picture_link": "z/eCOsq4KeM..W.cY8UPYpy.3lpX5UC"
    },
    {
        "title": "Tofu a la Bourguignonne",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 yellow onion, thinly sliced ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1 clove garlic, peeled and minced ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 cup Burgundy wine ADVERTISEMENT",
            "1 dash soy sauce ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 dash dried thyme ADVERTISEMENT",
            "2 (8 ounce) containers firm tofu, drained and cut into 1/2 inch strips ADVERTISEMENT",
            "1 tomato, seeded and coarsely chopped ADVERTISEMENT",
            "1/4 cup sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium heat, and saute onion, shallot, and garlic until lightly browned.\nStir in tomato paste. Pour in the wine, and stir, scraping up browned bits from the bottom of the skillet. Bring to a boil, and cook about 1 minute. Mix in soy sauce, bay leaf, and thyme. Reduce heat to low, and place tofu, tomato, and mushrooms into the mixture. Cover, and simmer 15 to 20 minutes, until sauce is thickened.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bacon Wrapped Dates",
        "ingredients": [
            "1 (8 ounce) package pitted dates ADVERTISEMENT",
            "10 ounces Cheddar cheese, cubed ADVERTISEMENT",
            "1 pound sliced bacon, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the broiler.\nSlice open dates, and stuff each with a cube of Cheddar cheese. Wrap each date with a quarter of a bacon slice, and secure bacon with toothpicks.\nArrange wrapped dates on a medium baking sheet, and broil 15 minutes in the preheated oven, turning once, until bacon is evenly browned.\n",
        "picture_link": "s4GVCbweO2bA7wA0UILm01ioJrrMssK"
    },
    {
        "title": "Christmas Walnut Toffee",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon corn syrup ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 1/2 cups chopped walnuts, divided ADVERTISEMENT",
            "1 (6 ounce) package chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 9 inch square baking dish, and set aside. Melt butter in a large saucepan over medium heat. Stir in the sugar and corn syrup until smooth; add the water and stir. Heat to 290 degrees F (145 degrees C) using a candy thermometer.\nWhen the temperature has been reached, stir in 1 cup of the walnuts, and cook for 3 more minutes, stirring constantly. Pour into the prepared pan, and allow to cool. When the toffee is cooled, remove from the pan, and place onto waxed paper. Melt chocolate chips in a metal bowl over a pan of simmering water, or in the microwave, stirring frequently until smooth.\nSpread half of the melted chocolate onto one side of the toffee slab, and sprinkle with half of the remaining nuts. Allow to cool until set, then repeat with the other side. Break into bite size pieces when set.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Choctaw Catfish",
        "ingredients": [
            "4 (4 ounce) fillets catfish ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "1 cup yellow cornmeal ADVERTISEMENT",
            "1/2 tablespoon onion salt ADVERTISEMENT",
            "1 tablespoon steak seasoning ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, place catfish fillets in buttermilk. Cover, and marinate in the refrigerator 45 minutes.\nIn a resealable plastic bag, mix cornmeal, onion salt, and steak seasoning. One at a time, drain catfish fillets and place in the bag to coat with the cornmeal mixture.\nHeat oil in a large, heavy skillet over medium heat. Fry each fillet 7-10 minutes per side, or until exterior is lightly browned and flesh is easily flaked with a fork. Drain on paper towels.\n",
        "picture_link": "qWVxXBvZ.XwBFa8ovrK/NeGQWMmyTZW"
    },
    {
        "title": "California Casserole",
        "ingredients": [
            "2 cups chicken stock ADVERTISEMENT",
            "3/4 cup uncooked long grain rice ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "2 (4 ounce) cans diced green chiles ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "4 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease 1 1/2 quart casserole dish.\nBring chicken stock to a boil in a saucepan over medium heat. Add rice, reduce heat to low, and cook until the liquid is absorbed, about 20 minutes. In a medium bowl, mix together the sour cream, green chilies, green onion, salt and pepper. Set aside.\nSpread half of the rice into the bottom of the prepared pan. Spread with half of the sour cream mixture, and then half of the cheese. Repeat layers ending with cheese on top.\nBake uncovered for 45 to 50 minutes in the preheated oven, or until the cheese is melted and bubbly. Let stand for 5 minutes before serving.\n",
        "picture_link": "/LRqCisU23VxKtF9yNsA9bOvbFC43PG"
    },
    {
        "title": "Raspberry and White Chocolate Roll",
        "ingredients": [
            "4 egg whites ADVERTISEMENT",
            "3/4 cup superfine sugar ADVERTISEMENT",
            "4 (1 ounce) squares white chocolate, chopped ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1 cup fresh raspberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 10x12 inch baking pan with parchment paper.\nIn a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add sugar, continuing to beat until stiff peaks form. Spread batter into prepared pan.\nBake in preheated oven for 10 minutes, or until lightly browned. Carefully turn onto a sheet of parchment paper that has been sprinkled with superfine sugar. Remove paper from bottom. Set aside.\nMelt white chocolate, and set aside to cool to room temperature. In a medium bowl, beat cream cheese and sour cream until smooth. Blend in melted white chocolate. Spread over meringue sheet, leaving 1/2 inch border. Sprinkle evenly with raspberries. Carefully roll up the meringue from a short end, using the paper as a guide. Wrap securely in the paper and plastic wrap, and chill until firm. Cut into slices to serve.\n",
        "picture_link": "6WJjvNEadclNRlbaMd7swRBPDDkUdLi"
    },
    {
        "title": "Chicken Catch a Cola",
        "ingredients": [
            "1/3 cup seasoned dry bread crumbs ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup cola-flavored carbonated beverage ADVERTISEMENT",
            "3 ounces thinly sliced fully cooked ham ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1/2 cup cooking sherry ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the bread crumbs, paprika, salt, and pepper in a plastic bag. Place chicken breasts in the bag, and shake to coat.\nMelt butter in a large skillet over medium heat. Add chicken breasts, and cook for 4 minutes on each side, or until brown. Remove chicken to a plate, and keep warm. Pour the cola into the skillet, and stir to remove any browned chicken bits from the pan. Add ham, mushrooms, sherry, and balsamic vinegar. Reduce heat to medium-low, and simmer, uncovered, until the liquid has reduced by 1/2.\nStir sour cream into the skillet, and return chicken breasts to the pan. Cover, and simmer for 5 more minutes, or until chicken is no longer pink, or the internal temperature is 170 degrees F (75 degrees C). Remove chicken to serving plates, and spoon sauce over.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peanut Cilantro Dip",
        "ingredients": [
            "1/2 cup chunky peanut butter ADVERTISEMENT",
            "1/2 cup peanut oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "10 sprigs fresh cilantro leaves, finely chopped ADVERTISEMENT",
            "2 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, thoroughly blend peanut butter, peanut oil, red wine vinegar, soy sauce, and lemon juice. Mix in garlic, cilantro, red pepper flakes, and ginger. Process until smooth. Cover, and refrigerate until serving.\n",
        "picture_link": "NdUxOn0502qhXbf8eZ8xhcl/vuz0iAi"
    },
    {
        "title": "Grilled Eggplant and Feta Farfalle",
        "ingredients": [
            "1 eggplant, cut into 3/4 inch slices ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "1 (16 ounce) package farfalle pasta ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "2 carrots, peeled and diced ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "3/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1/8 teaspoon dried mint ADVERTISEMENT",
            "1 pinch dried dill weed ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "8 ounces feta cheese, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium high heat, and lightly oil grate. Rub eggplant with olive oil, and sprinkle with salt and pepper. Grill until each side has golden brown grill marks and is fragrant. Let cool, then cut into cubes. Set aside.\nPreheat oven to 325 degrees F (165 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nHeat 1 tablespoon olive oil in a large pot over medium heat. Saute bell pepper, carrot, onion, and garlic until the onions are translucent. Stir in eggplant, and saute until it is tender. Add the diced tomatoes. Season with oregano, basil, marjoram, mint, dill, celery salt, crushed red pepper, cinnamon, salt and black pepper. Mix in Parmesan cheese. In a large bowl, combine pasta with vegetable mixture. Spoon into a 9x13 inch baking dish. Sprinkle top with feta cheese.\nCover, and bake in preheated oven for 15 minutes. Remove cover and continue baking for 10 minutes.\n",
        "picture_link": "blfcSvTwWwEHzJYZvFjQ1k9a7BsbtPS"
    },
    {
        "title": "Donna's 123 Sausage Balls",
        "ingredients": [
            "1 pound bulk pork sausage ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "3 cups all-purpose biscuit baking mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nStir the sausage, Cheddar cheese, and baking mix together in a mixing bowl until evenly combined; roll into 1 inch balls and place onto an ungreased baking sheet.\nBake in the preheated oven until the pork is no longer pink in the center and the balls are golden brown, 15 to 20 minutes.\n",
        "picture_link": "RolJKakZ6RQVvOwc5vlMbfZInPUp8gW"
    },
    {
        "title": "Basic Sauteed Kale",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 pound kale, ribs removed, coarsely chopped (see Tip) ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon extra-virgin olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper ADVERTISEMENT",
            "2 teaspoons sherry vinegar or red-wine vinegar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon oil in a Dutch oven over medium heat. Add kale and cook, tossing with two large spoons, until bright green, about 1 minute. Add water, reduce heat to medium-low, cover and cook, stirring occasionally, until the kale is tender, 12 to 15 minutes. Push kale to one side, add the remaining 1 teaspoon oil to the empty side and cook garlic and crushed red pepper in it until fragrant, 30 seconds to 1 minute. Remove from the heat. Stir in vinegar to taste and salt.\n",
        "picture_link": "8Zgbnx22GJJt3HVZSb5E03piLZdl462"
    },
    {
        "title": "Old-Fashioned Macaroni, Tomato, and Cheese Bake",
        "ingredients": [
            "3 cups elbow macaroni ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 (14.5 ounce) can petite diced tomatoes in juice ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1 (4 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon brown mustard ADVERTISEMENT",
            "2 dashes hot sauce (such as Tabasco®) ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon paprika, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Prepare an 8 quart baking dish with cooking spray.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink. Pour into the prepared baking dish and add the butter, Cheddar cheese, and diced tomatoes; stir.\nCombine the eggs, milk, cream cheese, Parmesan cheese, brown mustard, hot sauce, parsley, nutmeg, pepper, and salt in a food processor; pulse until smooth; pour over the macaroni. Sprinkle paprika over everything.\nBake in the preheated oven until the middle is set, 45 to 50 minutes.\n",
        "picture_link": "ooj8pFfvlbHCrxK8RXP4gy2Znsvw7i6"
    },
    {
        "title": "Best Baconless Broccoli Salad",
        "ingredients": [
            "6 cups chopped fresh broccoli ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "3/4 cup dried cranberries ADVERTISEMENT",
            "1/2 cup pumpkin seeds ADVERTISEMENT",
            "2 tablespoons flax seeds ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons raspberry vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make the salad by tossing together the broccoli, onion, cranberries, pumpkin seeds, and flax seeds in a large bowl.\nWhisk together the mayonnaise, vinegar, and white sugar; pour over the salad. Toss to evenly coat. Chill at least 30 minutes. Sprinkle with pecans before serving.\n",
        "picture_link": "nG9NCS75cikPuosDivhGYGhc/tFBJJq"
    },
    {
        "title": "Marzipan Christmas Kringle (Juleskringle)",
        "ingredients": [
            "1/2 cup warm milk ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 (8 ounce) can almond paste ADVERTISEMENT",
            "1/2 cup crushed sliced almonds ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the milk and sugar. Sprinkle the yeast over the top and let stand for 10 minutes to dissolve. Stir in cream.\nIn a separate bowl, stir together the flour, sugar, salt and cardamom. Cut in the butter using a pastry blender or pinching with your fingers until it is a course mealy texture. Stir in the yeast mixture until well blended. Pat into a ball, flatten slightly, then wrap in plastic wrap. Refrigerate for 12 to 24 hours.\nTo make the filling, mix the almond paste, almonds, sugar, cinnamon and almond extract using an electric mixer until evenly blended. It may be crumbly.\nRoll the chilled dough out into a 2 inch wide and 24 inch long rectangle. Spread the filling to within 2 inches of the sides and roll up into a tube. Cover your work surface with sugar, and roll the tube of dough in the sugar to coat thoroughly. Roll and stretch the dough out to form a long rope about 40 inches long. Place on a parchment lined baking sheet and shape into a pretzel shape.\nBrush the top of the pretzel with egg white and sprinkle with almonds. Cover loosely with a towel and let rise for 45 minutes.\nPreheat the oven to 375 degrees F (190 degrees C). Bake the kringle in the preheated oven until golden brown, 25 to 30 minutes. Cut into slices to serve.\n",
        "picture_link": "Y3XV8ZWJGwFx88.pO2KWa0qCM0kcbpe"
    },
    {
        "title": "Gluten Free Chocolate Cupcakes",
        "ingredients": [
            "1 1/2 cups white rice flour ADVERTISEMENT",
            "3/4 cup millet flour ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon xanthan gum ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2/3 cup sour cream ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 12 cup muffin pans or line with paper baking cups.\nIn a medium bowl, stir together the rice flour, millet flour, cocoa, salt, baking soda, baking powder and xanathan gum. In a separate large bowl, beat the eggs, sugar, sour cream, milk and vanilla. Stir in the dry ingredients until smooth. Spoon the batter into the prepared cups, dividing evenly.\nBake in the preheated oven until the tops spring back when lightly pressed, 20 to 25 minutes. Cool in the pan set over a wire rack. When cool, arrange the cupcakes on a serving platter.\n",
        "picture_link": "q43fQgfO7t695m/qS9NU0aj.WVhgyNW"
    },
    {
        "title": "Wilted Arugula and Portobello Mushrooms",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes, or to taste ADVERTISEMENT",
            "1 portobello mushroom cap, chopped ADVERTISEMENT",
            "1/4 cup dry sherry ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "4 cups arugula leaves ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Add onion and garlic and cook until soft, about 5 minutes. Stir in red pepper flakes and chopped mushrooms and cook until mushrooms are coated with oil and begin to soften.\nPour in sherry and chicken broth. Simmer until liquid is reduced by half. Add arugula and cook until wilted, about one minute. Season with black pepper. Serve immediately.\n",
        "picture_link": "V1gv8sFcmlY.ZEB2Bh0jGXpCFAq7TPK"
    },
    {
        "title": "Beef Tenderloin Steaks Topped with Horseradish and Dijon Mustard",
        "ingredients": [
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 1/2 teaspoons horseradish ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/4 teaspoon dried tarragon leaves ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "2 (8 ounce) beef tenderloin steaks ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together Dijon, horseradish, basil, thyme, tarragon, and pepper. Spread mixture evenly over top and sides of the steaks. Wrap individually with plastic wrap, and allow to marinate in the refrigerator overnight.\nPreheat oven to 400 degrees F (200 degrees C). Spray a small, glass baking dish with cooking spray.\nUnwrap steaks and sprinkle with salt to taste. Place into baking dish, and roast in preheated oven to desired degree of doneness (30 minutes for medium-rare, 60 minutes for well done).\n",
        "picture_link": "1zcCivW5ABgDswjW7YCT.Qazv0u0UtW"
    },
    {
        "title": "Steph's Bourbon Balls",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "2 1/2 cups vanilla wafer crumbs ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "3 tablespoons light corn syrup ADVERTISEMENT",
            "1/4 cup bourbon whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the sugar in a shallow bowl, and set aside. Combine the vanilla wafer crumbs, confectioners' sugar, and pecans in a bowl, and mix well.\nPlace the chocolate chips in a microwave-safe bowl, and microwave on High for 1 to 2 minutes to melt the chips. Stir the melted chips until smooth, and beat in the corn syrup and whiskey. Scrape the chocolate mixture into the crumb mixture, and stir well to mix.\nForm the dough into 1-inch balls, and roll each ball in sugar. Place the finished bourbon balls on a cooling rack to finish setting up.\n",
        "picture_link": "2TluW/g6SkNvj0RPRRkQ0pFeXha3R02"
    },
    {
        "title": "Whiskey Paralyzer",
        "ingredients": [
            "1 cup ice cubes ADVERTISEMENT",
            "1 fluid ounce Canadian whiskey, such as Crown Royal™ ADVERTISEMENT",
            "1 fluid ounce Kahlua or other coffee flavored liqueur ADVERTISEMENT",
            "1/2 cup root beer ADVERTISEMENT",
            "2 fluid ounces milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a highball glass with ice. Pour in the Canadian whiskey, coffee liqueur and root beer. Slowly pour in the milk so it does not curdle. Stir gently and enjoy immediately.\n",
        "picture_link": "lX93ewhNex1FqS9CAK9xCCJ4CVlj7L2"
    },
    {
        "title": "Green Tea Mousse Cheesecake",
        "ingredients": [
            "1 (4.8 ounce) package graham crackers, crushed ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons unsalted butter, melted ADVERTISEMENT",
            "2 tablespoons green tea powder (matcha) ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "2 tablespoons unflavored gelatin ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "2 cups whipping cream ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, at room temperature ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the graham cracker crumbs with 2 tablespoons of sugar in a mixing bowl. Drizzle in the melted butter and mix until evenly moistened. Press into the bottom of a 9-inch springform pan lined with waxed paper; set aside.\nStir the tea powder into the warm water; set aside. Sprinkle the gelatin over the cold water; set aside.\nWhip the cream to stiff peaks; set aside. Beat the cream cheese, 1/2 cup sugar, vanilla, and honey in a clean mixing bowl. Beat in the eggs one at a time until evenly blended. Cook the gelatin mixture in the microwave until melted, about 45 seconds. Beat the gelatin and tea into the cream cheese mixture, then fold in the whipped cream until smooth. Pour into the springform pan. Refrigerate 7 hours to overnight before unmolding and serving.\n",
        "picture_link": "OOyDu8LslVTF8Wzeur9au9r..cip6dS"
    },
    {
        "title": "Breaded SPAM® Steaks",
        "ingredients": [
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1 (12 ounce) can fully cooked luncheon meat (such as SPAM®), cut into 1/4 inch slices ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 cups Italian seasoned bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nGently press the luncheon meat slices into the flour to coat and shake off the excess flour. Dip into the beaten egg, then press into bread crumbs. Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Place the breaded luncheon meat slices onto a plate while breading the rest; do not stack.\nDeep fry the luncheon meat a few slices at a time until hot and golden brown, 3 to 5 minutes. Drain on a paper towel lined plate before serving.\n",
        "picture_link": "pJA/nh6tIF9cVzeY0n00nyCUJewi4/."
    },
    {
        "title": "Barb-a-fu",
        "ingredients": [
            "3 tablespoons cornmeal ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes, or to taste ADVERTISEMENT",
            "1 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1/4 teaspoon chili powder, or to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (12 ounce) package extra-firm tofu, cut into 1/4-inch thick slices ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "3/4 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch glass baking dish with cooking spray.\nCombine cornmeal, flour, red pepper flakes, garlic powder, chili powder, salt, and pepper in a resealable plastic bag; shake to mix. Gently shake tofu slices with cornmeal mixture to coat, then shake off excess, and place into prepared baking dish.\nBake tofu in preheated oven for 10 minutes, then turn the pieces over and continue to cook for an additional 10 minutes. Meanwhile, heat olive oil in a saucepan over medium heat. Add minced onion and cook until softened and translucent, about 3 minutes. Stir in soy sauce and barbeque sauce. Bring to a simmer, then turn heat to low and keep warm until the tofu is ready.\nWhen tofu has finished baking, pour the hot barbeque sauce overtop, then return to the oven and bake for an additional 5 minutes.\n",
        "picture_link": "OMpMBuPq87l8aH0jx76BdjtyOwIS7Re"
    },
    {
        "title": "Ham Bagels With Honey Mustard Cream Cheese",
        "ingredients": [
            "1/2 cup whipped cream cheese ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "4 bagels, split ADVERTISEMENT",
            "8 slices deli-style ham ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the cream cheese, mustard, and honey in a small bowl.\nSpread cream cheese mixture over cut sides of 4 bagel halves. Top evenly with ham. Sandwich with the remaining bagel halves.\n",
        "picture_link": "hLAAj8OmkRvwP0hPpR3tYt9FJX0wYzO"
    },
    {
        "title": "Black Pepper Goat Curry",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup fresh curry leaves ADVERTISEMENT",
            "2 tablespoons whole black peppercorns ADVERTISEMENT",
            "2 tablespoons ground coriander ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 onions, thinly sliced ADVERTISEMENT",
            "2 inch piece ginger, minced ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons cayenne pepper, or amount to taste ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1/2 cup tomato paste ADVERTISEMENT",
            "1 pound goat stew meat, cut into 1-inch cubes ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 teaspoon of oil in a saucepan over medium heat. Stir in the chopped onion, and cook until the onion turns translucent and the edges begin to brown, about 7 minutes. Scrape the onion into the container of a blender, and set aside.\nReturn the saucepan to the stove, and stir in the curry leaves and peppercorns. Cook and stir until the curry leaves wilt and turn almost dry, about 5 minutes. Stir in the coriander, and cook 1 minute more. Scrape the curry leaves into the blender, and pour in 1/2 cup of water. Blend until the mixture has turned into a coarse paste.\nHeat 3 tablespoons of oil in the saucepan over medium heat. Stir in the sliced onions, and cook until the onions have softened and turned translucent, about 5 minutes. Stir in the ginger and garlic, continue cooking until the garlic softens and mellows, about 3 minutes more. Stir in the cayenne pepper, salt, and turmeric; continue cooking 2 minutes.\nMix in the tomato paste, goat meat, pureed peppercorn sauce, and the remaining 1/2 cup of water. Bring to a simmer, then reduce heat to medium-low, cover, and simmer until the meat is tender, about 30 minutes.\n",
        "picture_link": "fATrVz.BtQukOf8cbKUXGyzmFPuiNhu"
    },
    {
        "title": "123 Green Tea Ice Cream",
        "ingredients": [
            "1 cup vanilla ice cream ADVERTISEMENT",
            "1 teaspoon green tea powder (matcha) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly pound the ice cream on a wooden cutting board; transfer to bowl and add matcha; mix well. Refreeze or eat immediately.\n",
        "picture_link": "AK39Cq.t0ptOtB9UwbX6TXyihRVHsXC"
    },
    {
        "title": "Vegan Borscht",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 stalks celery, chopped (optional) ADVERTISEMENT",
            "2 carrots, finely chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "3 beets, including greens, diced ADVERTISEMENT",
            "1 (16 ounce) can whole peeled tomatoes ADVERTISEMENT",
            "1/2 cup canned peeled and diced tomatoes ADVERTISEMENT",
            "2 potatoes, quartered ADVERTISEMENT",
            "1 cup shredded Swiss chard ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 tablespoons dried dill weed ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package silken tofu ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon of olive oil in a skillet over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Set aside. Heat the remaining 3 tablespoons of olive oil in a large pot over medium-high heat. Stir in the celery, carrots, bell pepper, beets including the greens, whole tomatoes, diced tomatoes, potatoes, Swiss chard, and the onion mixture. Cook and stir until the chard begins to wilt, 4 to 8 minutes. Stir in the vegetable broth, water, dill weed, and salt and pepper. Bring to a boil, and reduce heat to low. Simmer for 1 hour.\nStrain half the beets from the broth and place in a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the beets moving before leaving it on to puree. Add the tofu, and continue pureeing until smooth. Stir the tofu mixture back into the pot. Simmer until the mixture is reduced by a third, about another hour. Serve chilled or warm.\n",
        "picture_link": "ilTFCq1a0hvhFTcEespx8Zf7oN3XG9S"
    },
    {
        "title": "Louisiana Beef Stew",
        "ingredients": [
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "3 pounds chuck roast, cut into 2-inch pieces ADVERTISEMENT",
            "2 tablespoons bacon drippings ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "3 medium onions, chopped ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "6 carrots, chopped ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "4 cups cooked rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, salt, celery salt, garlic salt, black pepper, and ground ginger in a small bowl. Sprinkle the mixture evenly on to the beef.\nHeat a large heavy-bottomed pot on medium-high heat. Add the bacon drippings. Brown the beef in the pot, stirring as necessary. Drain excess fat.\nAdd the diced tomatoes, onions, vinegar, molasses, and water to the pot and bring to a boil. Cover and simmer for 2 hours.\nAdd the carrots and raisins and simmer for an additional 30 minutes, or until the carrots are tender. Serve with steamed rice.\n",
        "picture_link": ".EZGKr/V9OZCIubYXeP8hFflAK7OXIK"
    },
    {
        "title": "Orange Blossom Trifle",
        "ingredients": [
            "1/4 cup orange juice ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup cold butter, cubed ADVERTISEMENT",
            "1 cup whipping cream, whipped to soft peaks ADVERTISEMENT",
            "1 (10 inch) angel food cake, cut in cubes ADVERTISEMENT",
            "2 (15 ounce) cans Mandarin oranges, drained and patted dry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together orange juice, eggs, and sugar in a small saucepan. Place over low heat, and stir constantly until the sugar has dissolved, and the mixture is very thick. Once thick, strain mixture into a large bowl, and stir in butter cubes until melted. Cover and refrigerate until cold, about 2 hours.\nFold whipped cream into cold egg mixture until smooth. Recover and refrigerate for 3 hours.\nTo assemble, place half of the cubed angel food cake into the bottom of a trifle bowl. Spoon on half of the whipped cream mixture, and sprinkle with half of the Mandarin oranges. Create a second layer with the remaining angel food cake, whipped cream mixture, and Mandarin oranges. Refrigerate until ready to serve.\n",
        "picture_link": "/57QxP4393Wpw2w9nceK1sloMpG7i1e"
    },
    {
        "title": "Hawaiian Chicken Wings",
        "ingredients": [
            "4 cups canola oil for deep frying ADVERTISEMENT",
            "3 pounds chicken wings, tips removed and wings cut in half at joint ADVERTISEMENT",
            "1 tablespoon garlic salt ADVERTISEMENT",
            "1 cup cornstarch ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1/4 cup pineapple juice ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "2 green onions, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Heat oil in deep-fryer to 375 degrees F (190 degrees C). Line a baking sheet with aluminum foil, and spray with nonstick cooking spray.\nToss chicken wings with garlic salt, and set aside for 10 minutes. Place cornstarch in a large plastic bag; toss the wings, a few at a time until coated. Shake off excess cornstarch, then dip into beaten egg. Shake wings in cornstarch again, then fry until golden brown in deep fryer. Drain on a paper towel-lined plate.\nStir together vinegar, pineapple juice, ketchup, honey, and soy sauce in a saucepan over medium-high heat. Once the sauce comes to a simmer, place the chicken wings in a bowl, pour all but 1/2 cup of the sauce overtop, and toss to coat. Reserve remaining sauce to for basting.\nPlace chicken wings on prepared baking sheet. Bake in preheated oven for 30 minutes, then baste with remaining sauce, turn, and bake for an additional 20 minutes.\nTo serve, place wings on serving platter, and sprinkle with sesame seeds and green onions.\n",
        "picture_link": "qKPSvX9F6RoWDngbIDyP8m27FHCMC/2"
    },
    {
        "title": "Orange-Chicken Rice Bowl",
        "ingredients": [
            "2 tablespoons Asian-style toasted sesame salad dressing ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into 1 1/2 inch pieces ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 tablespoons Asian-style toasted sesame salad dressing ADVERTISEMENT",
            "1 red bell pepper, cut into 1 inch chunks ADVERTISEMENT",
            "1 zucchini, cut into 1 inch chunks ADVERTISEMENT",
            "2 cups broccoli florets ADVERTISEMENT",
            "2 green onions, cut into 1/2-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium heat, and place 2 tablespoons of sesame salad dressing in the skillet. Add the chicken, and cook and stir until no longer pink in the middle and beginning to brown, 5 to 7 minutes. Stir in the orange juice and 2 more tablespoons of sesame dressing, and bring to a boil.\nStir in the red bell pepper, zucchini, broccoli, and green onions, and cook and stir until the vegetables are tender and the broccoli is bright green in color, 5 to 8 minutes.\n",
        "picture_link": "CmIAXeYJ4bm74P3BhO4w41SmWDx9HYW"
    },
    {
        "title": "Creamy Limoncello",
        "ingredients": [
            "8 lemons, zested ADVERTISEMENT",
            "3 cups vodka ADVERTISEMENT",
            "2 quarts 2% reduced fat milk ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lemon zest and vodka in an airtight container. Cover and place in a cool, dark space, shaking the container to redistribute the lemon zest once a day for 5 days.\nPour milk and sugar into a large pot and bringing to a low boil, stirring often, until the sugar has dissolved. Remove from heat and allow milk mixture to cool to room temperature. Slowly strain vodka mixture into the milk using a sieve. Discard the lemon zest. Pour limoncello into a capped bottle and place in the freezer to chill for 1 hour. Serve cold.\n",
        "picture_link": "J6mN7BDMzsMlAbx9D1CpHKCzZNUj/0W"
    },
    {
        "title": "Beef Brisket with Chipotle Tomatillo Sauce",
        "ingredients": [
            "2 (11 ounce) cans whole tomatillos, drained ADVERTISEMENT",
            "1 (7 ounce) can chipotle peppers in adobo sauce ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 (3 pound) beef brisket ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomatillos, chipotle peppers, tomato sauce, water, salt, and brown sugar in the work bowl of a food processor, and blend until smooth. Set the mixture aside.\nHeat the olive oil in a pressure cooker with the lid off over medium heat, and cook and stir the onion and garlic until the onions are translucent, about 3 minutes. Drop the brisket into the pressure cooker, and sear it on both sides. Pour the tomatillo mixture over the brisket, bring to a boil, and place the lid on the cooker. When the pressure comes up, set the heat so the cooker develops medium pressure, and cook for 1 hour and 15 minutes.\nAllow the cooker to release pressure on its own (without using the quick-release), and remove the brisket. Serve hot, with tomatillo sauce on the side.\n",
        "picture_link": "8PNn1vRc6zuaowdix48R5wVk..JsEuO"
    },
    {
        "title": "Barbeque Beef Bake",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 cups baking mix (such as Bisquick ®) ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nCook the ground beef and onion together in a large skillet over medium heat until the beef is completely browned; stir the barbeque sauce and Cheddar cheese into the ground beef. Pour the mixture into a 9x13-inch dish.\nWhisk the baking mix, eggs, and milk together in a bowl; pour over the beef mixture.\nBake in the preheated oven until the crust is golden brown and cooked throughout, about 25 minutes.\n",
        "picture_link": "1fVKJeI3urKYRfV5ur8ikEUqyHdPXvq"
    },
    {
        "title": "Sell Your Soul to the Devil Eggs",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon white pepper ADVERTISEMENT",
            "2 tablespoons yellow mustard ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 tablespoon creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "paprika for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs in a saucepan in a single layer with enough water to cover by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water. Peel once cold.\nDry the eggs thoroughly with paper towels, and slice them in half lengthwise. Remove the yolks, and place in a bowl. Mash the yolks with a fork, and stir in the sugar, salt, onion powder, garlic powder, and white pepper. Add the mustard, mayonnaise, salad dressing, and vinegar, one at a time, stirring to incorporate each ingredient before adding the next.\nMound a heaping teaspoonful of the yolk mixture into the cavity of each egg half, and sprinkle with paprika.\n",
        "picture_link": "LZ7faTBL7MNttzoMWcCbaHIrDdeGK6q"
    },
    {
        "title": "Tangy Mustard",
        "ingredients": [
            "1/2 cup yellow mustard seeds ADVERTISEMENT",
            "1/2 cup brown mustard seeds ADVERTISEMENT",
            "1 tablespoon Oriental mustard seeds ADVERTISEMENT",
            "1 1/2 cups apple cider vinegar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "3 half pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the yellow mustard seeds, brown mustard seeds, and Oriental mustard seeds in a bowl. Pour the vinegar over the seeds and stir. Cover and store in refrigerator for 24 hours. If the seeds absorb all the vinegar too quickly, add more as needed or add a little water.\nBlend the soaked mustard seeds, garlic, honey, salt, and thyme in a blender until it is to your desired consistency, depending on how grainy you like your mustard.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the mustard into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings. Refrigerate at least 2 weeks before using.\n",
        "picture_link": "gGFs6KpkUpcTOWWn31nHTmgej/mXUV."
    },
    {
        "title": "All-Around Spice Rub",
        "ingredients": [
            "3/4 cup paprika ADVERTISEMENT",
            "1/4 cup fresh-ground pepper blend ADVERTISEMENT",
            "1/4 cup dark brown sugar ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "2 tablespoons onion powder ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "2 teaspoons cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the paprika, pepper, brown sugar, chili powder, onion powder, sea salt, and cayenne pepper together in a container with a lid. Store in a cool, dark place between uses.\n",
        "picture_link": "wCfs9quoq1T/l5K5tXnqhLcccpIcu7G"
    }
]