[
    {
        "title": "Strawberry Angel Food Dessert",
        "ingredients": [
            "1 (10 inch) angel food cake ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 quart fresh strawberries, sliced ADVERTISEMENT",
            "1 (18 ounce) jar strawberry glaze ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble the cake into a 9x13 inch dish.\nBeat the cream cheese and sugar in a medium bowl until light and fluffy. Fold in whipped topping. Mash the cake down with your hands and spread the cream cheese mixture over the cake.\nIn a bowl, combine strawberries and glaze until strawberries are evenly coated. Spread over cream cheese layer. Chill until serving.\n",
        "picture_link": "RwHO2pXT.mOtjQ6Ob7GNED6fFmPeLCO"
    },
    {
        "title": "Pineapple Chicken Tenders",
        "ingredients": [
            "1 cup pineapple juice ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup light soy sauce ADVERTISEMENT",
            "2 pounds chicken breast tenderloins or strips ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan over medium heat, mix pineapple juice, brown sugar, and soy sauce. Remove from heat just before the mixture comes to a boil.\nPlace chicken tenders in a medium bowl. Cover with the pineapple marinade, and refrigerate for at least 30 minutes.\nPreheat grill for medium heat. Thread chicken lengthwise onto wooden skewers.\nLightly oil the grill grate. Grill chicken tenders 5 minutes per side, or until juices run clear. They cook quickly, so watch them closely.\n",
        "picture_link": "TAomc86sYykRVund32B6/cs1zUb6Uli"
    },
    {
        "title": "Easy Quiche",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3/4 cup biscuit baking mix ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (10 ounce) package chopped frozen broccoli, thawed and drained ADVERTISEMENT",
            "1 cup cubed cooked ham ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 10 inch quiche dish.\nIn a large bowl, beat together milk, eggs, baking mix, butter and parmesan cheese. Batter will be lumpy. Stir in broccoli, ham and Cheddar cheese. Pour into prepared quiche dish.\nBake in preheated oven for 50 minutes, until eggs are set and top is golden brown.\n",
        "picture_link": "1qqn8yHcfb7wOpr6IZnXS/KN4hOXbZ."
    },
    {
        "title": "Best Ever Blueberry Cobbler",
        "ingredients": [
            "3 cups fresh blueberries ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn an 8 inch square baking dish, mix blueberries, 3 tablespoons sugar, and orange juice. Set aside. In a small bowl, thoroughly mix flour, baking powder, and salt. Set aside.\nIn a medium bowl, cream butter and 1/2 cup sugar until light and fluffy. Beat in egg and vanilla extract. Gradually add flour mixture, stirring just until ingredients are combined. Drop batter by rounded tablespoons over blueberry mixture. Try to cover as much of filling as possible.\nBake in preheated oven for 35 to 40 minutes, until topping is golden brown and filling is bubbling.\n",
        "picture_link": "L3cGTjsREh1kE3HIU1uaTtDEMjMnVNu"
    },
    {
        "title": "Grilled Asparagus",
        "ingredients": [
            "1 pound fresh asparagus spears, trimmed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nLightly coat the asparagus spears with olive oil. Season with salt and pepper to taste.\nGrill over high heat for 2 to 3 minutes, or to desired tenderness.\n",
        "picture_link": "rhb4H9N5KGUWnIKucKAqC9o3ksRpyXK"
    },
    {
        "title": "Beef Bulgogi",
        "ingredients": [
            "1 pound flank steak, thinly sliced ADVERTISEMENT",
            "5 tablespoons soy sauce ADVERTISEMENT",
            "2 1/2 tablespoons white sugar ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beef in a shallow dish. Combine soy sauce, sugar, green onion, garlic, sesame seeds, sesame oil, and ground black pepper in a small bowl. Pour over beef. Cover and refrigerate for at least 1 hour or overnight.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nQuickly grill beef on hot grill until slightly charred and cooked through, 1 to 2 minutes per side.\n",
        "picture_link": ".AIBUiDcMhMlJ.MRSY.NMXsCDR2Ehk6"
    },
    {
        "title": "Cranberry Hootycreeks",
        "ingredients": [
            "5/8 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup white chocolate chips ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer the ingredients in a 1 quart or 1 liter jar, in the order listed.\nAttach a tag with the following instructions: Cranberry Hootycreeks 1. Preheat oven to 350 degrees F (175 degrees C). Grease a cookie sheet or line with parchment paper. 2. In a medium bowl, beat together 1/2 cup softened butter, 1 egg and 1 teaspoon of vanilla until fluffy. Add the entire jar of ingredients, and mix together by hand until well blended. Drop by heaping spoonfuls onto the prepared baking sheets. 3. Bake for 8 to 10 minutes, or until edges start to brown. Cool on baking sheets, or remove to cool on wire racks.\n",
        "picture_link": "Jppn2/hhmIffKLai3L0LVpvmOg7GzMm"
    },
    {
        "title": "Chicken Tetrazzini IV",
        "ingredients": [
            "1 (8 ounce) package spaghetti, broken into pieces ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "2 tablespoons sherry ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "2 cups chopped cooked chicken ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nBring a large pot of lightly salted water to a boil. Add spaghetti, and cook for 8 to 10 minutes, or until al dente; drain.\nMeanwhile, in a large saucepan, melt butter over low heat. Stir in flour, salt, and pepper. Cook, stirring, until smooth. Remove from heat, and gradually stir in chicken broth and cream.\nReturn to heat, and bring to a low boil for 1 minute, stirring constantly. Add sherry, then stir in cooked spaghetti, mushrooms, and chicken. Pour mixture into the prepared baking dish, and top with Parmesan cheese.\nBake 30 minutes in the preheated oven, until bubbly and lightly browned.\n",
        "picture_link": "62Bs0zYSrZC1WqRRuBMy9IqAkPt6hPa"
    },
    {
        "title": "Supreme Strawberry Topping",
        "ingredients": [
            "1 pint fresh strawberries ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash strawberries and remove stems; cut large berries in half or roughly chop them.\nCombine strawberries, sugar, and vanilla in a saucepan. Cook over medium-high heat, stirring occasionally. The mixture will sizzle for a while, but then juice will begin to form. Continue stirring; mash a few strawberries with a wooden spoon or heat-proof spatula to help produce the syrup. Cook until sauce thickens, about 15 minutes.\nRemove from heat. In a blender, puree about 1/3 of the sauce, then mix back into remaining topping. Store in refrigerator.\n",
        "picture_link": "/ZNpopR39D9b7ofZ1vOdmcaEDXWWn0m"
    },
    {
        "title": "Dad's Leftover Turkey Pot Pie",
        "ingredients": [
            "2 cups frozen peas and carrots ADVERTISEMENT",
            "2 cups frozen green beans ADVERTISEMENT",
            "1 cup sliced celery ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "2/3 cup chopped onion ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1 3/4 cups chicken broth ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "4 cups cubed cooked turkey meat - light and dark meat mixed ADVERTISEMENT",
            "4 (9 inch) unbaked pie crusts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nPlace the peas and carrots, green beans, and celery into a saucepan; cover with water, bring to a boil, and simmer over medium-low heat until the celery is tender, about 8 minutes. Drain the vegetables in a colander set in the sink, and set aside.\nMelt the butter in a saucepan over medium heat, and cook the onion until translucent, about 5 minutes. Stir in 2/3 cup of flour, salt, black pepper, celery seed, onion powder, and Italian seasoning; slowly whisk in the chicken broth and milk until the mixture comes to a simmer and thickens. Remove from heat; stir the cooked vegetables and turkey meat into the filling until well combined.\nFit 2 pie crusts into the bottom of 2 9-inch pie dishes. Spoon half the filling into each pie crust, then top each pie with another crust. Pinch and roll the top and bottom crusts together at the edge of each pie to seal, and cut several small slits into the top of the pies with a sharp knife to release steam.\nBake in the preheated oven until the crusts are golden brown and the filling is bubbly, 30 to 35 minutes. If the crusts are browning too quickly, cover the pies with aluminum foil after about 15 minutes. Cool for 10 minutes before serving.\n",
        "picture_link": "i61w/jM/pIjObnx2zBSiwxfrvwhfZBK"
    },
    {
        "title": "Slow Cooker Baby Back Ribs",
        "ingredients": [
            "3 pounds baby back ribs, trimmed ADVERTISEMENT",
            "salt and ground black pepper, to taste ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (18 ounce) bottle barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season ribs with salt and pepper.\nPour water into slow cooker. Layer the ribs into the slow cooker. Top the ribs with onion and garlic.\nCook on High for 4 hours (or Low for 8 hours).\nPreheat oven to 375 degrees F (190 degrees C).\nTransfer ribs to a baking sheet. Discard onion and garlic. Coat ribs with barbeque sauce.\nBake in preheated oven until the sauce caramelizes and sticks to the meat, 10 to 15 minutes.\n",
        "picture_link": "pBfBTgIgcjNEu0IqZzlgO.g8kIg8YwW"
    },
    {
        "title": "Oatmeal Chocolate Chip Cookies I",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nIn a large bowl cream shortening, brown sugar and granulated sugar. Add eggs and mix thoroughly.\nCombine the baking soda, salt and flour and stir into creamed mixture\nAdd oatmeal and chocolate chips and stir until well blended.\nDrop by teaspoonfuls onto greased cookie sheet. Bake for 15 minutes.\n",
        "picture_link": "GQf8KJleu3qFAKON3YsD12fw3PUenZG"
    },
    {
        "title": "Broccoli, Rice, Cheese, and Chicken Casserole",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 cups uncooked instant rice ADVERTISEMENT",
            "2 (10 ounce) cans chunk chicken, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (16 ounce) package frozen chopped broccoli ADVERTISEMENT",
            "1 small white onion, chopped ADVERTISEMENT",
            "1 pound processed cheese food ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium saucepan, bring the water to a boil. Mix in the instant rice, cover, and remove from heat. Let stand 5 minutes.\nIn a 9x13 inch baking dish, mix the prepared rice, chicken, cream of mushroom soup, cream of chicken soup, butter, milk, broccoli, onion, and processed cheese.\nBake in the preheated oven for 30 to 35 minutes, or until cheese is melted. Stir halfway through cooking to help cheese melt evenly.\n",
        "picture_link": "JJc/aCgcL0iT89GKIiy1pZ1KjmYHIri"
    },
    {
        "title": "Old-Fashioned Pancakes",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together flour, baking powder, salt, and sugar in a large bowl.\nWhisk in melted butter, egg, and milk until combined. Let batter rest for 5 minutes.\nPreheat a large skillet over medium-high heat. Spray with cooking spray. Pour batter into the hot skillet, about 1/4 cup of batter for each pancake. Cook for 2 to 3 minutes, until bubbles appear on the sides and center of each pancake. Flip and cook until golden, about 1 to 2 minutes.\n",
        "picture_link": "/Gku2W10lounVh4jD02f3wGKdheEjYO"
    },
    {
        "title": "Tangy Honey Glazed Ham",
        "ingredients": [
            "1 (10 pound) fully-cooked, bone-in ham ADVERTISEMENT",
            "1 1/4 cups packed dark brown sugar ADVERTISEMENT",
            "1/3 cup pineapple juice ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1/3 large orange, juiced and zested ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Place ham in a roasting pan.\nIn a small saucepan, combine brown sugar, pineapple juice, honey, orange juice, orange zest, Dijon mustard, and ground cloves. Bring to a boil, reduce heat, and simmer for 5 to 10 minutes. Set aside.\nBake ham in preheated oven uncovered for 2 hours. Remove ham from oven, and brush with glaze. Bake for an additional 30 to 45 minutes, brushing ham with glaze every 10 minutes.\n",
        "picture_link": "Sv4mOZn50fjRtmUSuhjgQLn2acH4016"
    },
    {
        "title": "Egg Noodles",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the flour and salt. Add the beaten egg, milk, and butter. Knead dough until smooth, about 5 minutes. Let rest in a covered bowl for 10 minutes.\nOn a floured surface, roll out to 1/8 or 1/4 inch thickness. Cut into desired lengths and shapes.\nAllow to air dry before cooking.\nTo cook fresh pasta, in a large pot with boiling salted water cook until al dente.\n",
        "picture_link": "gvaoWgzSX0afAg1k4UGnaAhKpS9sWKy"
    },
    {
        "title": "Winter Fruit Salad with Lemon Poppyseed Dressing",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "2 teaspoons diced onion ADVERTISEMENT",
            "1 teaspoon Dijon-style prepared mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon poppy seeds ADVERTISEMENT",
            "1 head romaine lettuce, torn into bite-size pieces ADVERTISEMENT",
            "4 ounces shredded Swiss cheese ADVERTISEMENT",
            "1 cup cashews ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "1 apple - peeled, cored and diced ADVERTISEMENT",
            "1 pear - peeled, cored and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender or food processor, combine sugar, lemon juice, onion, mustard, and salt. Process until well blended. With machine still running, add oil in a slow, steady stream until mixture is thick and smooth. Add poppy seeds, and process just a few seconds more to mix.\nIn a large serving bowl, toss together the romaine lettuce, shredded Swiss cheese, cashews, dried cranberries, apple, and pear. Pour dressing over salad just before serving, and toss to coat.\n",
        "picture_link": "tiaJd612S8BFgAN9CQ4bM/TAcrqg3BK"
    },
    {
        "title": "Urban Legend Chocolate Chip Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 cups rolled oats ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "4 ounces milk chocolate, grated ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Measure oats into a blender or food processor, and then blend to a fine powder. Set aside.\nIn a large bowl, cream together butter and sugars. Beat in the eggs one at a time, then stir in the vanilla. In a separate bowl, mix together flour, oats, salt, baking powder, and baking soda. Stir dry ingredients into creamed butter and sugar. Add chocolate chips, grated chocolate, and nuts.\nDrop by rounded teaspoons onto ungreased cookie sheets. Bake for 6 to 8 minutes in the preheated oven.\n",
        "picture_link": "HHihmEtKphvrJ7V9BhZo7cWLL7T2lBG"
    },
    {
        "title": "Perfect Sesame Chicken",
        "ingredients": [
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "2 tablespoons low-sodium soy sauce ADVERTISEMENT",
            "1 tablespoon dry sherry ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 dash sesame oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast meat - cubed ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "2 tablespoons dark soy sauce ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 teaspoon chile paste ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 quart olive oil for frying ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour, 2 tablespoons cornstarch, baking soda, and baking powder into a bowl. Pour in low-sodium soy sauce, sherry, 2 tablespoons water, vegetable oil, and a dash of sesame oil; stir until smooth. Stir in chicken until coated with the batter, then cover, and refrigerate for 20 minutes.\nMeanwhile, bring chicken broth, sugar, vinegar, dark soy sauce, sesame oil, chile paste, and garlic to a boil in a saucepan over high heat. Dissolve 1/4 cup cornstarch into 1/2 cup of water, and stir into boiling sauce. Simmer until the sauce thickens and turns clear, about 2 minutes. Reduce heat to low, and keep sauce warm.\nHeat olive oil in a deep fryer or large saucepan to a temperature of 375 degrees F (190 degrees C).\nDrop in the battered chicken pieces, a few at a time, and fry until they turn golden brown and float to the top of the oil, 3 to 4 minutes. Drain on a paper towel lined plate. To serve, place fried chicken pieces onto a serving platter, and pour the hot sauce overtop. Sprinkle with toasted sesame seeds to garnish.\n",
        "picture_link": "DBwy7Rx6Fr3ldJx/2nKlAqRnOIHQz/a"
    },
    {
        "title": "Grilled Shrimp Scampi",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "crushed red pepper flakes to taste (optional) ADVERTISEMENT",
            "1 1/2 pounds medium shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, non-reactive bowl, stir together the olive oil, lemon juice, parsley, garlic, and black pepper. Season with crushed red pepper, if desired. Add shrimp, and toss to coat. Marinate in the refrigerator for 30 minutes.\nPreheat grill for high heat. Thread shrimp onto skewers, piercing once near the tail and once near the head. Discard any remaining marinade.\nLightly oil grill grate. Grill for 2 to 3 minutes per side, or until opaque.\n",
        "picture_link": "B42TgY2KWyFQonJ0X30.kjR32wIsZEO"
    },
    {
        "title": "The Best Potato Salad",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "10 red potatoes ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup ranch dressing ADVERTISEMENT",
            "1/3 cup dill pickle relish ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon paprika ADVERTISEMENT",
            "1/8 teaspoon celery seed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup pepperoncini (optional) ADVERTISEMENT",
            "1/4 cup sliced black olives (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water; cool the eggs under cold running water in the sink. Peel and chop the cooled eggs.\nPlace the potatoes into a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, 15 to 20 minutes. Drain and refrigerate until cold. Peel and cube once cold.\nStir together the mayonnaise, ranch dressing, relish, mustard, salt, pepper, paprika, and celery seed in a mixing bowl. Add the eggs, potatoes, onion, pepperoncini, and olives; stir until evenly mixed. Cover and refrigerate at least 2 hours before serving.\n",
        "picture_link": "JwOBHfxkYYw.vwnn3WCHekolufgWJSe"
    },
    {
        "title": "Baked Zucchini Chips",
        "ingredients": [
            "2 medium zucchini, cut into 1/4-inch slices ADVERTISEMENT",
            "1/2 cup seasoned dry bread crumbs ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 475 degrees F (245 degrees C).\nIn one small bowl, stir together the bread crumbs, pepper and Parmesan cheese. Place the egg whites in a separate bowl. Dip zucchini slices into the egg whites, then coat the breadcrumb mixture. Place on a greased baking sheet.\nBake for 5 minutes in the preheated oven, then turn over and bake for another 5 to 10 minutes, until browned and crispy.\n",
        "picture_link": "wvvWcsJflCL8Ud4DOzTa/b2Jq6n0kEy"
    },
    {
        "title": "Quick and Easy Mexican Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch ground cumin ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nHeat a greased skillet to medium. Rub chicken pieces with garlic, salt, pepper and cumin to taste; place in hot skillet. Cook until brown on both sides and no longer pink, 10 to 15 minutes.\nTransfer chicken to 9x13-inch baking dish or casserole dish, top with salsa and cheese, and bake in preheated oven until cheese is bubbly and starts to brown, 15 to 20 minutes.\n",
        "picture_link": "ClELtUMYPpfl7ofZ6KMPLfohFsD.m/C"
    },
    {
        "title": "Vegan Black Bean Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 pinch black pepper ADVERTISEMENT",
            "4 cups vegetable broth ADVERTISEMENT",
            "4 (15 ounce) cans black beans ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn ADVERTISEMENT",
            "1 (14.5 ounce) can crushed tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium-high heat. Saute onion, celery, carrots and garlic for 5 minutes. Season with chili powder, cumin, and black pepper; cook for 1 minute. Stir in vegetable broth, 2 cans of beans, and corn. Bring to a boil.\nMeanwhile, in a food processor or blender, process remaining 2 cans beans and tomatoes until smooth. Stir into boiling soup mixture, reduce heat to medium, and simmer for 15 minutes.\n",
        "picture_link": "r8eYmQc4lT28Cy6RsrH1uOleuJF5TJa"
    },
    {
        "title": "Hot Pizza Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup pizza sauce ADVERTISEMENT",
            "2 tablespoons chopped green bell pepper ADVERTISEMENT",
            "2 ounces pepperoni sausage, chopped ADVERTISEMENT",
            "2 tablespoons sliced black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together the cream cheese, oregano, parsley, and basil.\nSpread mixture in the bottom of a 9 inch pie plate, or a shallow microwave-safe dish. Sprinkle 1/2 cup of the mozzarella cheese and 1/2 cup of the Parmesan cheese on top of the cream cheese mixture. Spread the pizza sauce over all. Sprinkle with remaining cheese, then top with green pepper, pepperoni and olive slices. Cover, and microwave for 5 minutes. Serve hot.\n",
        "picture_link": "KSnjdyw4HFUnh4OGBF9iLuQKncmgncC"
    },
    {
        "title": "Ranch Burgers",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "3/4 cup crushed saltine crackers ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the grill for high heat.\nIn a bowl, mix the ground beef, ranch dressing mix, egg, crushed crackers, and onion. Form into hamburger patties.\nLightly oil the grill grate. Place patties on the grill, and cook 5 minutes per side, or until well done.\n",
        "picture_link": "x1ltxd8XHALxEm4hbBMMcV4N/5R9ZL."
    },
    {
        "title": "Avocado Feta Salsa",
        "ingredients": [
            "2 plum tomatoes, chopped ADVERTISEMENT",
            "1 ripe avocado - peeled, pitted and chopped ADVERTISEMENT",
            "1/4 cup finely chopped red onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon snipped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon red or white wine vinegar ADVERTISEMENT",
            "4 ounces crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, gently stir together tomatoes, avocados, onion, and garlic. Mix in parsley and oregano. Gently stir in olive oil and vinegar. Then stir in feta. Cover, and chill for 2 to 6 hours.\n",
        "picture_link": "Kt/J2tSeNwISODIuW9ZNRXIXCmtxu2u"
    },
    {
        "title": "Marbled Pumpkin Cheesecake",
        "ingredients": [
            "1 1/2 cups crushed gingersnap cookies ADVERTISEMENT",
            "1/2 cup finely chopped pecans ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup white sugar, divided ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup canned pumpkin ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, mix together the crushed gingersnap cookies, pecans, and butter. Press into the bottom, and about 1 inch up the sides of a 9 inch springform pan. Bake crust 10 minutes in the preheated oven. Set aside to cool.\nIn a medium bowl, mix together the cream cheese, 1/2 cup sugar, and vanilla just until smooth. Mix in eggs one at a time, blending well after each. Set aside 1 cup of the mixture. Blend 1/4 cup sugar, pumpkin, cinnamon, and nutmeg into the remaining mixture.\nSpread the pumpkin flavored batter into the crust, and drop the plain batter by spoonfuls onto the top. Swirl with a knife to create a marbled effect.\nBake 55 minutes in the preheated oven, or until filling is set. Run a knife around the edge of the pan. Allow to cool before removing pan rim. Chill for at least 4 hours before serving.\n",
        "picture_link": "rn2e/SL7rjQ3xvTc0QJMINBI1rFSso2"
    },
    {
        "title": "Aunt Anne's Coffee Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3/4 cup milk, or as needed ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Make the streusel topping: In a medium bowl, combine 1/4 cup flour, 2/3 cup sugar and 1 teaspoon cinnamon. Cut in butter until mixture resembles coarse crumbs. Set aside.\nIn a large bowl, combine 2 cups flour, 3/4 cup sugar, baking powder and salt. Cut in butter until mixture resembles coarse crumbs. Crack an egg into a measuring cup and then fill add milk to make 1 cup. Stir in vanilla. Pour into crumb mixture and mix just until moistened. Spread into prepared pan. Sprinkle top with streusel.\nBake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "w3.CNwxt0WIWLP6067lSix40Fl18DmW"
    },
    {
        "title": "Spaghetti Sauce with Ground Beef",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 small green bell pepper, diced ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (16 ounce) can tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ground beef, onion, garlic, and green pepper in a large saucepan. Cook and stir until meat is brown and vegetables are tender. Drain grease.\nStir diced tomatoes, tomato sauce, and tomato paste into the pan. Season with oregano, basil, salt, and pepper. Simmer spaghetti sauce for 1 hour, stirring occasionally.\n",
        "picture_link": "91M1yr89TL1xfLdvrNV7jLbRV/qY0My"
    },
    {
        "title": "Candied Sweet Potatoes",
        "ingredients": [
            "4 pounds sweet potatoes, quartered ADVERTISEMENT",
            "1 1/4 cups margarine ADVERTISEMENT",
            "1 1/4 cups brown sugar ADVERTISEMENT",
            "3 cups miniature marshmallows, divided ADVERTISEMENT",
            "ground cinnamon to taste ADVERTISEMENT",
            "ground nutmeg to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13 inch baking dish.\nBring a large pot of water to a boil. Add potatoes and boil until slightly underdone, about 15 minutes. Drain, cool and peel.\nIn a large saucepan over medium heat, combine margarine, brown sugar, 2 cups marshmallows, cinnamon and nutmeg. Cook, stirring occasionally, until marshmallows are melted.\nStir potatoes into marshmallow sauce. While stirring mash about half of the potatoes, and break the others into bite-sized chunks. Transfer to prepared dish.\nBake in preheated oven for 15 minutes. Remove from oven and cover top evenly with remaining marshmallows. Return to oven and bake until marshmallows are golden brown.\n",
        "picture_link": "059Ro.j0MDlZELTGFfO/KeDL53V2CNi"
    },
    {
        "title": "Pat's Baked Beans",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (16 ounce) can pinto beans ADVERTISEMENT",
            "1 (16 ounce) can great Northern beans, drained ADVERTISEMENT",
            "1 (16 ounce) can baked beans ADVERTISEMENT",
            "1 (16 ounce) can red kidney beans, drained ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon yellow mustard ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, reserving 2 tablespoons of drippings, crumble and set aside in a large bowl. Cook the onion and garlic in the reserved drippings until onion is tender; drain excess grease and transfer to the bowl with the bacon.\nTo the bacon and onions add pinto beans, northern beans, baked beans, kidney beans and garbanzo beans. Stir in ketchup, molasses, brown sugar, Worcestershire sauce, mustard and black pepper. Mix well and transfer to a 9x12 inch casserole dish.\nCover and bake in preheated oven for 1 hour.\n",
        "picture_link": "eAB816iN0XVCJA1FMoJz3bfIhOwovsK"
    },
    {
        "title": "Uglies",
        "ingredients": [
            "1 pound ground beef chuck ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 1/2 cups barbeque sauce ADVERTISEMENT",
            "1 (10 ounce) package refrigerated biscuit dough ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease 8 muffin cups.\nIn a large skillet or frying pan, cook ground chuck with onion and garlic powder until evenly brown; drain off the grease. Stir in the barbeque sauce and simmer for another 3 minutes.\nRoll out each biscuit on a floured surface so that each biscuit is 6 inches across. Put the biscuit in the muffin tin and fold up sides to create a cup shape. Fill each biscuit fill almost to the top with the meat mixture; top with cheddar cheese.\nBake in preheated oven until biscuits are baked, cheese is melted and tops are golden brown, about 15 minutes.\n",
        "picture_link": "vuRSgBkKJEIocP3ZOV/yBbitPplcXIK"
    },
    {
        "title": "Cake Mix Cookies IV",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together cake mix, eggs and oil in a large bowl.\nMake little balls with the dough and set on ungreased cookie sheets.\nBake at 350 degrees F (175 degrees C) for 4 - 10 minutes.\n",
        "picture_link": "8harrQsN/vT.PEYh3JRLpFZYzbqVzI6"
    },
    {
        "title": "Chocolate Mint Candies Cookies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 (4.5 ounce) packages chocolate covered thin mints ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, cook the sugar, butter and water, stirring occasionally until melted. Remove from heat, stir in the chocolate chips until melted and set aside to cool for 10 minutes.\nPour the chocolate mixture into a large bowl, and beat in the eggs, one at a time. Combine the flour, baking soda and salt, stir into the chocolate mixture. Cover and refrigerate dough for at least 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Roll cookie dough into walnut sized balls and place 2 inches apart onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven, be careful not to overbake. When cookies come out of the oven, Press one mint wafer into the top of each cookie and let sit for 1 minute. When the mint is softened, swirl with the back of a spoon or toothpick to make a pattern with the green filling of the mint wafer. For smaller cookies, break mints in half.\n",
        "picture_link": "Ck6UADazhiSMQVuAstdhzk/joMnqaPy"
    },
    {
        "title": "Lana's Sweet and Sour Meatballs",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons granulated sugar ADVERTISEMENT",
            "1 (20 ounce) can pineapple chunks, drained with juice reserved ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon seasoning salt ADVERTISEMENT",
            "1 large carrot, diced ADVERTISEMENT",
            "1 large green bell pepper, cut into 1/2 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a large, shallow baking sheet.\nIn a large bowl, thoroughly mix the ground beef, eggs, bread crumbs and onion. Sprinkle with ginger, seasoning salt, pepper, Worcestershire sauce and sugar. Shape into one inch balls.\nPlace meatballs in a single layer on prepared baking sheet. Bake in preheated oven for 10 to 15 minutes; set aside.\nTo make the sauce, mix enough water with the reserved pineapple juice to make 1 cup. In a large pot over medium heat, combine the juice mixture, 1/3 cup water, vinegar, soy sauce, and brown sugar. Stir in cornstarch, ginger and seasoning salt, until smooth. Cover and cook until thickened.\nStir pineapple chunks, carrot, green pepper and meatballs into the sauce. Gently stir to coat the meatballs with the sauce. Simmer, uncovered, for about 20 minutes, or until meatballs are thoroughly cooked.\n",
        "picture_link": "mIMQsmMKCmZNen3epf2obmvq5mzah0u"
    },
    {
        "title": "Chocolate Chip Pumpkin Bread",
        "ingredients": [
            "3 cups white sugar ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon ground nutmeg ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 1 pound size coffee cans, or three 9x5 inch loaf pans.\nIn a large bowl, combine sugar, pumpkin, oil, water, and eggs. Beat until smooth. Blend in flour, cinnamon, nutmeg, baking soda, and salt. Fold in chocolate chips and nuts. Fill cans 1/2 to 3/4 full.\nBake for 1 hour, or until an inserted knife comes out clean. Cool on wire racks before removing from cans or pans.\n",
        "picture_link": "hyyMLFIhEcDLJ/VeO/1m6CYvFhP5SUu"
    },
    {
        "title": "Oven Fried Parmesan Chicken",
        "ingredients": [
            "1 clove crushed garlic ADVERTISEMENT",
            "1/4 pound butter, melted ADVERTISEMENT",
            "1 cup dried bread crumbs ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 (4 pound) chicken, cut into pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a shallow glass dish or bowl, combine the crushed garlic with the melted butter or margarine. In another small bowl mix together the bread crumbs, cheese, parsley, salt and pepper. Dip chicken pieces into garlic butter, then into crumb mixture to coat.\nPlace coated chicken pieces into a lightly greased 9x13 inch baking dish. Drizzle with remaining garlic butter and bake uncovered in the preheated oven for 1 to 1 1/4 hours, or until chicken is cooked through and juices run clear.\n",
        "picture_link": "I4lMkeui5MQ1RAxRCaYGHssyf6RcmGW"
    },
    {
        "title": "Easy Beef Stroganoff",
        "ingredients": [
            "1 (12 ounce) package egg noodles, cooked and drained ADVERTISEMENT",
            "6 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Cook egg noodles in boiling water until done, about 8 minutes. Drain.\nMeanwhile, prepare the sauce. In a large skillet, cook mushrooms and onions in 2 tablespoons of butter over medium heat until soft; remove from pan.\nUsing the same pan, melt remaining butter. Cook ground beef in melted butter until browned. Mix in flour. Stir in beef broth, and cook until slightly thickened. Add mushroom and onion mixture; stir in sour cream. Season to taste with salt and pepper. Continue cooking until sauce is hot, but not boiling. Serve sauce over egg noodles.\n",
        "picture_link": "or/Z5hlrwvQibU2HM30HjM3ZWEjm9gG"
    },
    {
        "title": "Vegan Chocolate Cake",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x5 inch loaf pan.\nSift together the flour, sugar, cocoa, baking soda and salt. Add the oil, vanilla, vinegar and water. Mix together until smooth.\nPour into prepared pan and bake at 350 degrees F (175 degrees C) for 45 minutes. Remove from oven and allow to cool.\n",
        "picture_link": "edHzTsILMffgMWY08Nrc2fBtJ5wDoZm"
    },
    {
        "title": "Meatloaf with Fried Onions and Ranch Seasoning",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "3/4 cup herb-seasoned dry bread stuffing mix ADVERTISEMENT",
            "1/2 (1 ounce) package dry Ranch-style dressing mix ADVERTISEMENT",
            "1 (6 ounce) can French-fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine meat, eggs, ketchup, stuffing mix, ranch dressing mix and fried onions.\nShape into loaf and fit into 9 x 5 inch loaf pan.\nBake, covered loosely with foil, at 350 degrees F (175 degrees C) for 50 to 60 minutes, or until meat is thoroughly cooked.\n",
        "picture_link": "ID7rz/oPPkC9CptOj1/J5Jv.80X4TK."
    },
    {
        "title": "Marinade for Steak I",
        "ingredients": [
            "1 cup vegetable oil ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon freshly ground black pepper ADVERTISEMENT",
            "2 tablespoons Dijon-style prepared mustard ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the oil, soy sauce, vinegar, lemon juice, Worcestershire sauce, ground black pepper, mustard, onion, and garlic. Mix together well, and use to marinate your favorite meat.\n",
        "picture_link": "l.wWMD9EloDKxehYfmF0rCaL0vltEQ."
    },
    {
        "title": "Cioppino",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 1/2 cups white wine ADVERTISEMENT",
            "1 1/2 pounds large shrimp - peeled and deveined ADVERTISEMENT",
            "1 1/2 pounds bay scallops ADVERTISEMENT",
            "18 small clams ADVERTISEMENT",
            "18 mussels, cleaned and debearded ADVERTISEMENT",
            "1 1/2 cups crabmeat ADVERTISEMENT",
            "1 1/2 pounds cod fillets, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Over medium-low heat melt butter in a large stockpot, add onions, garlic and parsley. Cook slowly, stirring occasionally until onions are soft.\nAdd tomatoes to the pot (break them into chunks as you add them). Add chicken broth, bay leaves, basil, thyme, oregano, water and wine. Mix well. Cover and simmer 30 minutes.\nStir in the shrimp, scallops, clams, mussels and crabmeat. Stir in fish, if desired. Bring to boil. Lower heat, cover and simmer 5 to 7 minutes until clams open. Ladle soup into bowls and serve with warm, crusty bread!\n",
        "picture_link": "LCykmyyQWshCPR7N6t6M1GBGcLl.yPi"
    },
    {
        "title": "Sweet and Sour Sauce I",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1/3 cup white vinegar ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the sugar, vinegar, water, soy sauce, ketchup and cornstarch in a medium saucepan, and bring to a boil. Stir continuously until the mixture has thickened.\n",
        "picture_link": "Vaob1RXIRbbTiI7IZJ9LRL3vks2ijE6"
    },
    {
        "title": "Pasta Primavera with Italian Turkey Sausage",
        "ingredients": [
            "1 (16 ounce) package uncooked farfalle pasta ADVERTISEMENT",
            "1 pound hot Italian turkey sausage, cut into 1/2 inch slices ADVERTISEMENT",
            "1/2 cup olive oil, divided ADVERTISEMENT",
            "4 cloves garlic, diced ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "2 small zucchini, chopped ADVERTISEMENT",
            "2 small yellow squash, chopped ADVERTISEMENT",
            "6 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "20 leaves fresh basil ADVERTISEMENT",
            "2 teaspoons chicken bouillon granules ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Place farfalle in pot and cook 8 to 10 minutes, until al dente; drain.\nPlace sausage in a large skillet over medium heat and cook until evenly brown; set aside. Heat 1/4 cup oil in skillet. Stir in garlic and onion, and cook until tender. Mix in zucchini, squash, tomatoes, bell pepper and basil. Dissolve bouillon in the mixture. Season with red pepper. Stir in remaining oil. Continue cooking 10 minutes.\nMix pasta, sausage and cheese into skillet. Continue cooking 5 minutes, or until heated through.\n",
        "picture_link": "IGJ01wPGSK8NrE82c6yWjgkJJ/MogKS"
    },
    {
        "title": "Red Garlic Mashed Potatoes",
        "ingredients": [
            "8 red potatoes, cubed ADVERTISEMENT",
            "2 teaspoons crushed garlic ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup half-and-half cream ADVERTISEMENT",
            "1/4 teaspoon steak seasoning ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a large pot, and fill with enough water to cover. Add 1 teaspoon of the crushed garlic to the water for flavor. Bring to a boil, and cook for about 10 minutes, or until easily pierced with a fork.\nDrain the potatoes, and add the butter. Mash until the butter is melted. Mix in the half-and-half, steak seasoning, garlic powder, sugar, and remaining garlic. Mix potatoes with an electric mixer until smooth.\n",
        "picture_link": "5vzudZmrHXkgTnj9/k0NUYEdDStURDm"
    },
    {
        "title": "White Almond Wedding Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour an 11x13 inch cake pan.\nStir together the white cake mix, flour, sugar, and salt in a large bowl until well mixed. Pour in the water, sour cream, vegetable oil, almond and vanilla extracts, and egg whites, and beat with an electric mix on low until all the ingredients are mixed and moistened but some lumps still remain, 4 minutes.\nPour the batter into the prepared cake pan, and bake in the preheated oven until the top is a light golden brown and a toothpick inserted into the center of the cake comes out clean, about 25 minutes. Allow to cool before frosting.\n",
        "picture_link": "89HFRDbwIlmZlEHkEQF6YAYslLi.QU2"
    },
    {
        "title": "Luscious Spinach Artichoke Dip",
        "ingredients": [
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "1/2 (10 ounce) package frozen chopped spinach, thawed ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup cream cheese ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "1/4 teaspoon minced garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a small baking dish, mix together artichoke hearts, spinach, sour cream, mayonnaise, cream cheese, Romano cheese, and garlic. Cover dish.\nBake until heated through and bubbly, about 25 minutes.\n",
        "picture_link": "KBuSSvDWluEK63LO.zVjSUc9FAwvRLa"
    },
    {
        "title": "Cheese and Bacon Potato Rounds",
        "ingredients": [
            "4 baking potatoes, cut into 1/2 inch slices ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "8 slices bacon - cooked and crumbled ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBrush both side of potato slices with butter; place them on an ungreased cookie sheet. Bake in the preheated 400 degrees F (200 degrees C) oven for 30 to 40 minutes or until lightly browned on both sides, turning once.\nWhen potatoes are ready, top with bacon, cheese, and green onion; continue baking until the cheese has melted\n",
        "picture_link": "0jyDB2eB./uNmwmYq8DhrsO00.TQ6pK"
    },
    {
        "title": "Chicken Asparagus Roll-Ups",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "3 tablespoons Dijon mustard ADVERTISEMENT",
            "1 lemon, juiced and zested ADVERTISEMENT",
            "2 teaspoons dried tarragon ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "16 spears fresh asparagus, trimmed ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 slices provolone cheese ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 475 degrees F (245 degrees C). Grease a baking dish. In a bowl, mix together the mayonnaise, Dijon mustard, lemon juice, lemon zest, tarragon, salt, and pepper until the mixture is well combined. Set aside.\nCook asparagus in the microwave on High until bright green and just tender, 1 to 1 1/2 minutes. Set the asparagus spears aside. Place a chicken breast between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken breast with the smooth side of a meat mallet to a thickness of about 1/4 inch. Repeat with the rest of the chicken breasts.\nPlace 1 slice of provolone on each chicken breast, and top the cheese with 4 asparagus spears per breast. Roll the chicken breasts around the asparagus and cheese, making a tidy package, and place, seam sides down, in the prepared baking dish. With a pastry brush, apply a coating of the mayonnaise mixture to each chicken breast, and sprinkle each with panko crumbs, pressing the crumbs into the chicken to make a coating.\nBake in the preheated oven until the crumbs are browned and the chicken juices run clear, about 25 minutes.\n",
        "picture_link": "94Yv2aqluVFfPC52muMt7X4VPCxoXlC"
    },
    {
        "title": "Kathy's Delicious Whole Slow Cooker Chicken",
        "ingredients": [
            "1 (3 pound) whole chicken, skin removed ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons balsamic vinegar ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove skin from chicken, and empty inner cavity of contents within. Pat chicken dry with a paper towel, and place inside the slow cooker.\nIn a bowl, stir together the chicken broth, soy sauce, olive oil, honey, Worcestershire sauce, balsamic vinegar, lemon juice, sesame oil, and minced garlic. Pour mixture over chicken, and cover.\nCook chicken on low setting for 8 hours, or 4 hours on high setting.\n",
        "picture_link": "zOsWS.AzMLygvAz1BYH23xeYtV.75I."
    },
    {
        "title": "Awesome Roast Beef",
        "ingredients": [
            "3 pounds rump roast ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.5 ounce) can condensed beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rump roast in a slow cooker. Pour in condensed cream of mushroom soup and condensed beef broth. Cook on LOW for about 8 hours.\n",
        "picture_link": "MUzL19891ROKUqCbfdkACbKKooW6prW"
    },
    {
        "title": "Easy and Delicious Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (8 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker, combine the chicken breasts and Italian-style dressing.\nCover, and cook on Low for 6 to 8 hours.\nDrain off the juices, and shred the chicken meat. In a medium bowl, mix the soup, broth, cream cheese, basil, thyme, salt, and pepper. Pour over the chicken in the slow cooker. Continue cooking on Low for 1 hour.\n",
        "picture_link": "6o56Uc6wTlpTQTh4w0eh68qlR5l4Q66"
    },
    {
        "title": "Blueberry Crumb Bars",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 teaspoon salt (optional) ADVERTISEMENT",
            "1 pinch ground cinnamon (optional) ADVERTISEMENT",
            "4 cups fresh blueberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 teaspoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, stir together 1 cup sugar, 3 cups flour, and baking powder. Mix in salt and cinnamon, if desired. Use a fork or pastry cutter to blend in the shortening and egg. Dough will be crumbly. Pat half of dough into the prepared pan.\nIn another bowl, stir together the sugar and cornstarch. Gently mix in the blueberries. Sprinkle the blueberry mixture evenly over the crust. Crumble remaining dough over the berry layer.\nBake in preheated oven for 45 minutes, or until top is slightly brown. Cool completely before cutting into squares.\n",
        "picture_link": "HqPSO9QoNkC2KOPfwacy.vANsK65ugy"
    },
    {
        "title": "Cake Mixes from Scratch and Variations",
        "ingredients": [
            "2 1/3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For a Yellow Cake: Sift together flour, baking powder, salt, and sugar. Cut in shortening until fine crumbs are formed. Add eggs, milk, and vanilla. Beat at low speed for 1 minute, then high for 2 minutes, scraping the bowl frequently.\nPour batter into greased and floured 9x13 inch pan. Bake in preheated 350 degree F oven (175 degrees C) for 25 to 30 minutes.\nVariation for a White Cake: Prepare as for the basic cake except use 3 egg whites for the 2 whole eggs. Whites may be beaten separately and added for a lighter cake.\nVariation for a Chocolate Cake: Add 1/4 cup cocoa powder to the basic cake mix prior to adding the milk.\nVariation for a Spice Cake: Add 1 teaspoon cinnamon, 1/4 teaspoon ground cloves, and 1/4 teaspoon ground allspice to the basic cake mix.\nVariation for a Pineapple Upside Down Cake: Melt 1/2 cup butter in the bottom of a 9x13 pan. Add 2/3 cup brown sugar, stirring into the butter. Arrange pineapple slices in the pan. Top with the basic (yellow cake) mix recipe. Bake 30 to 35 minutes, cool 5 minutes, and invert to serve.\n",
        "picture_link": "hp7OA4zjsK5Wj7ltOynGzztaj3T6Tei"
    },
    {
        "title": "Spicy Vegan Potato Curry",
        "ingredients": [
            "4 potatoes, peeled and cubed ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "4 teaspoons curry powder ADVERTISEMENT",
            "4 teaspoons garam masala ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, peeled and minced ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans (chickpeas), rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can peas, drained ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until just tender, about 15 minutes. Drain and allow to steam dry for a minute or two.\nMeanwhile, heat the vegetable oil in a large skillet over medium heat. Stir in the onion and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Season with cumin, cayenne pepper, curry powder, garam masala, ginger, and salt; cook for 2 minutes more. Add the tomatoes, garbanzo beans, peas, and potatoes. Pour in the coconut milk, and bring to a simmer. Simmer 5 to 10 minutes before serving.\n",
        "picture_link": "qUKRzVcRQJTdM4.lj6tHn/x09Afb4K6"
    },
    {
        "title": "White Chocolate Chip Oatmeal Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "2 cups white chocolate chips ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease cookie sheets.\nIn a medium bowl, cream together the butter, brown sugar and white sugar until smooth. Stir in the egg and vanilla. Sift together the flour, baking powder, baking soda and salt, stir into the creamed mixture. Finally, stir in the rolled oats, white chocolate chips and pecans. Drop by tablespoons onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "jeW.1d5zv1MWLrwnR1K0mXrI8hclrru"
    },
    {
        "title": "Lentils and Rice with Fried Onions (Mujadarrah)",
        "ingredients": [
            "6 tablespoons olive oil ADVERTISEMENT",
            "1 large white onion, sliced into rings ADVERTISEMENT",
            "1 1/3 cups uncooked green lentils ADVERTISEMENT",
            "3/4 cup uncooked long-grain white rice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup plain yogurt or sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium heat. Stir in the onions, and cook about 10 minutes, until browned. Remove from heat, and set aside.\nPlace lentils in a medium saucepan with enough lightly salted water to cover. Bring to a boil, reduce heat, and simmer about 15 minutes.\nStir rice and enough water to cover into the saucepan with the lentils. Season with salt and pepper. Cover saucepan, and continue to simmer 15 to 20 minutes, until rice and lentils are tender.\nMix half the onions into the lentil mixture. Top with yogurt or sour cream and remaining onions to serve.\n",
        "picture_link": "oBSVYOxOGj6RzLWWmrW1pPENXJq6kb2"
    },
    {
        "title": "Grilled Lemon Herb Pork Chops",
        "ingredients": [
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "6 (4 ounce) boneless pork loin chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable bag, combine lemon juice, oil, garlic, salt, oregano, and pepper. Place chops in bag, seal, and refrigerate 2 hours or overnight. Turn bag frequently to distribute marinade.\nPreheat an outdoor grill for high heat. Remove chops from bag, and transfer remaining marinade to a saucepan. Bring marinade to a boil, remove from heat, and set aside.\nLightly oil the grill grate. Grill pork chops for 5 to 7 minutes per side, basting frequently with boiled marinade, until done.\n",
        "picture_link": "1QH6DCkQUe65jxlZPZSZsOs4FYTCLQi"
    },
    {
        "title": "Best of the Best Blueberry Muffins",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour, divided ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 pint fresh blueberries - rinsed, drained and patted dry ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Position rack in the middle of oven. Preheat oven to 375 degrees F (190 degrees C). Spray the top of a muffin pan with non-stick coating, and line with paper liners.\nIn a large bowl, cream together the butter, 1 1/4 cups sugar and salt until light and fluffy. Beat in the eggs one at a time. Mix together 1 3/4 cup of the flour and baking powder. Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated. Crush 1/4 of the blueberries, and stir into the batter. Mix the rest of the whole blueberries with the remaining 1/4 cup of the flour, and fold into the batter. Scoop into muffin cups. Sprinkle tops lightly with sugar.\nBake in preheated oven for 30 minutes, or until golden brown, and tops spring back when lightly tapped.\n",
        "picture_link": "JaozJhoa41ralQ6o9av80ZOLrtklw3y"
    },
    {
        "title": "Bacon for the Family or a Crowd",
        "ingredients": [
            "1 pound thick sliced bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil. Arrange bacon on baking sheet in a single layer with the edges touching or slightly overlapping.\nBake in preheated oven to desired degree of doneness, 10 to 15 minutes. Remove bacon from the baking sheet with tongs or a fork, and drain on a paper towel-lined plate.\n",
        "picture_link": "xbF1oLRiStUt9FsdoRhHi27P8vjSBp2"
    },
    {
        "title": "Cinnamon Raisin Bread I",
        "ingredients": [
            "1 1/2 cups milk ADVERTISEMENT",
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "8 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm the milk in a small saucepan until it bubbles, then remove from heat. Let cool until lukewarm.\nDissolve yeast in warm water, and set aside until yeast is frothy. Mix in eggs, sugar, butter or margarine, salt, and raisins. Stir in cooled milk. Add the flour gradually to make a stiff dough.\nKnead dough on a lightly floured surface for a few minutes. Place in a large, greased, mixing bowl, and turn to grease the surface of the dough. Cover with a damp cloth. Allow to rise until doubled.\nRoll out on a lightly floured surface into a large rectangle 1/2 inch thick. Moisten dough with 2 tablespoons milk. Mix together 3/4 cup sugar and 2 tablespoons cinnamon, and sprinkle mixture on top of the moistened dough. Roll up tightly; the roll should be about 3 inches in diameter. Cut into thirds, and tuck under ends. Place loaves into well greased 9 x 5 inch pans. Lightly grease tops of loaves. Let rise again for 1 hour.\nBake at 350 degrees F (175 degrees C) for 45 minutes, or until loaves are lightly browned and sound hollow when knocked. Remove loaves from pans, and brush with melted butter or margarine. Let cool before slicing.\n",
        "picture_link": "D1HIzIHVXdXHOyxS7TL2COEpcwuCLpS"
    },
    {
        "title": "Caramels",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup corn syrup ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 1/4 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 12x15 inch pan.\nIn a medium-size pot, combine sugar, brown sugar, corn syrup, evaporated milk, whipping cream, and butter. Monitor the heat of the mixture with a candy thermometer while stirring. When the thermometer reaches 250 degrees F (120 degrees C) remove the pot from the heat.\nStir in vanilla. Transfer mixture to the prepared pan and let the mixture cool completely. When cooled cut the Carmel into small squares and wrap them in wax paper for storage.\n",
        "picture_link": "qPgLNbOXHT5cGlABGRs4BuSd9NKzTCO"
    },
    {
        "title": "Chicken Stir-Fry",
        "ingredients": [
            "2 cups white rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2/3 cup soy sauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, thinly sliced ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 green bell pepper, cut into matchsticks ADVERTISEMENT",
            "1 (8 ounce) can sliced water chestnuts, drained ADVERTISEMENT",
            "1 head broccoli, broken into florets ADVERTISEMENT",
            "1 cup sliced carrots ADVERTISEMENT",
            "1 onion, cut into large chunks ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 20 to 25 minutes.\nCombine soy sauce, brown sugar, and corn starch in a small bowl; stir until smooth. Mix ginger, garlic, and red pepper into sauce; coat chicken with marinade and refrigerate for at least 15 minutes.\nHeat 1 tablespoon sesame oil in a large skillet over medium-high heat. Cook and stir bell pepper, water chestnuts, broccoli, carrots, and onion until just tender, about 5 minutes. Remove vegetables from skillet and keep warm.\nRemove chicken from marinade, reserving liquid. Heat 1 tablespoon sesame oil in skillet over medium-high heat. Cook and stir chicken until slightly pink on the inside, about 2 minutes per side; return vegetables and reserved marinade to skillet. Bring to a boil; cook and stir until chicken is no longer pink in the middle and vegetables are tender, 5 to 7 minutes. Serve over rice.\n",
        "picture_link": "zeR.JfFWq8hyxNEFe2uiZpDHgzOAGmi"
    },
    {
        "title": "Barbecue Beef Cups",
        "ingredients": [
            "3/4 pound lean ground beef ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "1 (12 ounce) package refrigerated biscuit dough ADVERTISEMENT",
            "1/3 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease the cups of a muffin pan.\nIn a large heavy skillet over medium heat, cook beef until evenly brown. Drain excess fat. Stir in barbeque sauce and dried onion. Simmer for a few minutes over low heat.\nFlatten each biscuit, and press into cups of the prepared muffin pan. Make sure the dough comes to the top of the pan. Spoon a portion of the meat mixture into each dough cup.\nBake in preheated oven for 12 minutes. Sprinkle with cheese, and bake for 3 more minutes.\n",
        "picture_link": "gL/lrrfrLJoaKGsKHtzhnVKsVPAln4S"
    },
    {
        "title": "Rolled Buttercream Fondant",
        "ingredients": [
            "1 cup light corn syrup ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon clear vanilla extract ADVERTISEMENT",
            "2 pounds confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the shortening and corn syrup. Mix in the salt and vanilla flavoring, then gradually mix in the confectioners' sugar until it is a stiff dough. If you are using a stand mixer, use the dough hook attachment. Otherwise, knead by hand. If the dough is sticky, knead in more confectioners' sugar until it is smooth. Store in an airtight container at room temperature or in the refrigerator.\nTo use, roll out on a clean surface that has been dusted with confectioners' sugar until it is 1/8 inch thick or thinner if you can. Drape over frosted and chilled cakes and smooth the sides down, or cut into strips to make bows and other decorations.\n",
        "picture_link": "oOWDI07GQU62.yXYNHNH4DZIApFwNmK"
    },
    {
        "title": "Grandma's Chicken Chardon",
        "ingredients": [
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons garlic powder, divided ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 pound sliced fresh mushrooms ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a shallow bowl, beat the egg with salt, pepper and 1 teaspoon garlic powder. In a separate dish, mix bread crumbs with 1 teaspoon of garlic powder and Parmesan cheese. Set aside.\nMix together the melted butter and lemon juice. Pour about 2/3 of the butter mixture into the bottom of a 9x13 inch baking dish. Tilt pan to coat the bottom. Spread mushrooms in an even layer in the bottom of the dish. Dip each chicken breast into the egg mixture, then into the bread crumb mixture. Place on top of the mushrooms. Drizzle remaining butter over the chicken, and sprinkle with parsley.\nBake uncovered for 45 minutes in the preheated oven, until chicken is golden brown and juices run clear.\n",
        "picture_link": "z2iO9LOZuPC/8VzqT3c0M4quMCmtuy2"
    },
    {
        "title": "Fried Cabbage with Bacon, Onion, and Garlic",
        "ingredients": [
            "6 slices bacon, chopped ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 large head cabbage, cored and sliced ADVERTISEMENT",
            "1 tablespoon salt, or to taste ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large stockpot and cook over medium-high heat until crispy, about 10 minutes. Add the onion and garlic; cook and stir until the onion caramelizes; about 10 minutes. Immediately stir in the cabbage and continue to cook and stir another 10 minutes. Season with salt, pepper, onion powder, garlic powder, and paprika. Reduce heat to low, cover, and simmer, stirring occasionally, about 30 minutes more.\n",
        "picture_link": "2ZW9/0ZC6Z2GNWJ8P3Jkpf3lR2Hor7u"
    },
    {
        "title": "Magic Cookie Bars from EAGLE BRAND®",
        "ingredients": [
            "1/2 cup butter or margarine, melted ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk ADVERTISEMENT",
            "2 cups semisweet chocolate morsels ADVERTISEMENT",
            "1 1/3 cups flaked coconut ADVERTISEMENT",
            "1 cup chopped nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F (325 degrees for glass dish). Coat 13x9-inch baking pan with no-stick cooking spray.\nCombine graham cracker crumbs and butter. Press into bottom of prepared pan. Pour sweetened condensed milk evenly over crumb mixture. Layer evenly with chocolate chips, coconut and nuts. Press down firmly with a fork.\nBake 25 minutes or until lightly browned. Cool. Cut into bars or diamonds. Store covered at room temperature.\n",
        "picture_link": "0urM6jZOBRb0PRZsQ.WZxyI96IapTTK"
    },
    {
        "title": "Chicken and Corn Chili",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (11 ounce) can Mexican-style corn ADVERTISEMENT",
            "1 (15 ounce) can pinto beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken and salsa in the slow cooker the night before you want to eat this chili. Season with garlic powder, cumin, chili powder, salt, and pepper. Cook 6 to 8 hours on Low setting.\nAbout 3 to 4 hours before you want to eat, shred the chicken with 2 forks. Return the meat to the pot, and continue cooking.\nStir the corn and the pinto beans into the slow cooker. Simmer until ready to serve.\n",
        "picture_link": "3No/cgi5oJL85FtrrDI.UR5NmGnG6A2"
    },
    {
        "title": "Spinach and Orzo Salad",
        "ingredients": [
            "1 (16 ounce) package uncooked orzo pasta ADVERTISEMENT",
            "1 (10 ounce) package baby spinach leaves, finely chopped ADVERTISEMENT",
            "1/2 pound crumbled feta cheese ADVERTISEMENT",
            "1/2 red onion, finely chopped ADVERTISEMENT",
            "3/4 cup pine nuts ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add orzo and cook for 8 to 10 minutes or until al dente; drain and rinse with cold water. Transfer to a large bowl and stir in spinach, feta, onion, pine nuts, basil and white pepper. Toss with olive oil and balsamic vinegar. Refrigerate and serve cold.\n",
        "picture_link": "cWdNmEV3luE8ItZNQKAZAcj8znbH6UO"
    },
    {
        "title": "Garlic Shrimp Linguine",
        "ingredients": [
            "1 pound uncooked linguine ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3 tablespoons white wine ADVERTISEMENT",
            "2 teaspoons grated Parmesan cheese ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "1 pound medium shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a medium saucepan, melt butter over medium low heat; add wine, cheese, garlic, parsley and salt and pepper to taste. Simmer over low heat for 3 to 5 minutes, stirring frequently.\nIncrease heat to medium high and add shrimp to saucepan; cook for about 3 to 4 minutes or until shrimp begins to turn pink. Do not overcook.\nDivide pasta into portions and spoon sauce on top; garnish with Parmesan cheese and fresh parsley, if desired.\n",
        "picture_link": "Lzv0B8fEhVD9wWELR9o5of.N7fSBJAm"
    },
    {
        "title": "Potato Salmon Patties",
        "ingredients": [
            "1 (14.75 ounce) can salmon, drained and flaked ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup garlic and herb seasoned dry bread crumbs ADVERTISEMENT",
            "1/4 cup dry potato flakes ADVERTISEMENT",
            "1 medium onion, minced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "1/4 teaspoon celery salt ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix salmon, eggs, garlic and herb seasoned dry bread crumbs, dry potato flakes, onion, garlic, dill weed, celery salt, salt, and pepper. Form the mixture into 2 inch balls, and flatten into patties about 1/2 inch thick.\nHeat olive oil in a medium skillet over medium heat. In batches, cook patties about 5 minutes on each side, until lightly browned.\n",
        "picture_link": "Kns3.HkeUEFep.po5B1v/pLvzXbf5l2"
    },
    {
        "title": "Honey Wheat Bread I",
        "ingredients": [
            "1 (.25 ounce) package rapid rise yeast ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup melted shortening ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast and sugar in 1/2 cup warm water.\nCombine milk, 1/4 cup water, shortening, honey, salt and wheat flour in food processor or bowl. Mix in yeast mixture, and let rest 15 minutes. Add bread flour, and process until dough forms a ball. Knead dough by processing an additional 80 seconds in food processor, or mix and knead by hand 10 minutes. Place the dough in a buttered bowl, and turn to coat. Cover the bowl with plastic wrap. Let dough rise for 45 minutes, or until almost doubled.\nPunch down, and divide dough in half. Roll out each half, and pound out the bubbles. Form into loaves, and place in buttered 9x5 inch bread pans. Butter the tops of the dough, and cover loosely with plastic wrap. Let rise in a warm area until doubled; second rise should take about 30 minutes.\nPlace a small pan of water on the bottom shelf of the oven. Preheat oven to 375 degrees F (190 degrees C).\nBake for 25 to 35 minutes, or until tops are dark golden brown. Butter crusts while warm. Slice when cool.\n",
        "picture_link": "hHIho5EqtMf1VX1PazKbcN4V.VVgBCy"
    },
    {
        "title": "Fajita Marinade I",
        "ingredients": [
            "1/4 cup lime juice ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable plastic bag, mix together the lime juice, water, olive oil, garlic, soy sauce, salt, and liquid smoke flavoring. Stir in cayenne and black pepper.\nPlace desired meat in the marinade, and refrigerate at least 2 hours, or overnight. Cook as desired.\n",
        "picture_link": "fNpB9ZtvgZf0mT1EsSEkjUESh8XciD2"
    },
    {
        "title": "Out of this World Turkey Brine",
        "ingredients": [
            "2 gallons water ADVERTISEMENT",
            "1 1/2 cups canning salt ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food-grade large bucket or container large enough to hold your turkey, mix together the water, salt, garlic, pepper, Worcestershire sauce and brown sugar. Store in a refrigerator, and soak turkey for 2 days before smoking or roasting.\n",
        "picture_link": "xNeddSrgaqsC6wIoCDJTTrFdm3Icizi"
    },
    {
        "title": "Pizza Pinwheels",
        "ingredients": [
            "1 (8 ounce) can refrigerated crescent roll dough ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "24 slices pepperoni ADVERTISEMENT",
            "1 (14 ounce) can pizza sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nOn a large baking sheet, pinch the 8 crescent roll dough triangles into 4 rectangles. Layer each rectangle with 6 slices of pepperoni and even amounts of mozzarella cheese. Roll tightly lengthwise and slice each into 4 or more pieces.\nBake in the preheated oven until golden brown, about 12 minutes. Serve with pizza sauce for dipping.\n",
        "picture_link": "u8EdwnbqhlFJkKqmSWQh/YFdTAFRsvW"
    },
    {
        "title": "Hamburger Potato Casserole",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "3 cups peeled and thinly sliced potatoes ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "freshly ground pepper, to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium skillet over medium heat, brown the ground beef; drain fat.\nIn a medium mixing bowl, combine cream of mushroom soup, onion, milk, salt and pepper to taste.\nAlternately layer the potatoes, soup mixture and meat in a 11x7 inch (2 quart) baking dish. Bake in the preheated oven for 1 to 1 1/2 hours, or until potatoes are tender. Top with Cheddar cheese, and continue baking until cheese is melted.\n",
        "picture_link": "9GViK8EFSJxZ8hOd0A7T2VV9f./nOYG"
    },
    {
        "title": "Fruit Pizza I",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the butter and 3/4 cup sugar until smooth. Mix in egg. combine the flour, cream of tartar, baking soda and salt; stir into the creamed mixture until just blended. Press dough into an ungreased pizza pan.\nBake in preheated oven for 8 to 10 minutes, or until lightly browned. Cool.\nIn a large bowl, beat cream cheese with 1/2 cup sugar and vanilla until light. Spread on cooled crust.\nArrange desired fruit on top of filling, and chill.\n",
        "picture_link": "C9fgk7LBgXrEE4RcAok9sHXyTlUGB.u"
    },
    {
        "title": "Antipasto Squares",
        "ingredients": [
            "2 (10 ounce) cans refrigerated crescent dinner rolls ADVERTISEMENT",
            "1/4 pound thinly sliced boiled ham ADVERTISEMENT",
            "1/4 pound thinly sliced provolone cheese ADVERTISEMENT",
            "1/4 pound thinly sliced Swiss cheese ADVERTISEMENT",
            "1/4 pound thinly sliced Genoa salami ADVERTISEMENT",
            "1/4 pound thinly sliced pepperoni sausage ADVERTISEMENT",
            "1 (12 ounce) jar roasted red peppers, drained, cut into thin strips ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 C).\nUnroll one package of crescent roll dough, and cover the bottom of a 9x13 inch pan. Layer the ham, provolone cheese, Swiss cheese, salami, pepperoni, and red peppers, on top of the dough.\nIn a bowl, beat the eggs lightly, and stir in the parmesan cheese and black pepper. Pour 3/4 of this mixture over the peppers. Unroll the second package of dough, and place over the top of the peppers. Brush with the remaining egg mixture. Cover with aluminum foil.\nBake for 25 minutes in the preheated oven. Remove foil, and bake another 10 to 20 minutes, or until dough is fluffy and golden brown. Cut into squares. Serve warm, or at room temperature.\n",
        "picture_link": "4wLNwX0KVtH9qKkRkYTBcdb4YG.DMy2"
    },
    {
        "title": "Oregon Salmon Patties",
        "ingredients": [
            "1 (14.75 ounce) can salmon ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "2/3 cup cracker crumbs ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "3 tablespoons shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain the salmon, reserving 3/4 cup of the liquid. Flake the meat. Melt butter in a large skillet over medium- high heat. Add onion, and cook until tender.\nIn a medium bowl, combine the onions with the reserved salmon liquid, 1/3 of the cracker crumbs, eggs, parsley, mustard and salmon. Mix until well blended, then shape into six patties. Coat patties in remaining cracker crumbs.\nMelt shortening in a large skillet over medium heat. Cook patties until browned, then carefully turn and brown on the other side.\n",
        "picture_link": "S9jTPjSLUNNzloKMu4iAoDWY2UUztAS"
    },
    {
        "title": "Pork Tenderloin with Dijon Marsala Sauce",
        "ingredients": [
            "2 pork tenderloins ADVERTISEMENT",
            "4 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 shallots, minced ADVERTISEMENT",
            "1 cup Marsala wine ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat pork tenderloins generously with mustard. Oil a 9x13 inch baking dish.\nHeat oil in a large skillet over medium-high heat. Arrange tenderloins in pan, and brown the meat. Turn to brown evenly. Transfer meat to prepared baking dish.\nBake in preheated oven for 20 minutes. Turn, and continue cooking for 20 minutes, or until desired doneness.\nMeanwhile, melt butter over medium heat in the same pan used to cook the pork. Cook shallots in butter until soft. Stir in Marsala, mustard, and cream, and cook until volume of liquid is reduced by half.\nSlice pork, and place on a serving dish. Spoon sauce over meat, and serve.\n",
        "picture_link": "w9Lzx8C7gNFm7OeIJd75Q9mYdz6KMOy"
    },
    {
        "title": "Home Style Macaroni and Cheese",
        "ingredients": [
            "7 ounces macaroni ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBring a large pot of lightly salted water to a boil. Add macaroni pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a 3 quart saucepan over medium heat, melt butter and stir in flour. Cook for about 1 minute, until smooth and bubbly; stirring occasionally. Mix in milk, cream cheese, salt, pepper, and Dijon mustard. Continue cooking until sauce is thickened. Add cooked macaroni and Cheddar cheese.\nPour into 2 quart casserole dish. In small bowl mix together bread crumbs, butter and parsley; spread over macaroni and cheese. Bake for 15 to 20 minutes or until golden brown and heated through.\n",
        "picture_link": "NjraxeIuOQRh.TWnU.ZSZUZnyzTjW2O"
    },
    {
        "title": "Greek Penne and Chicken",
        "ingredients": [
            "1 (16 ounce) package penne pasta ADVERTISEMENT",
            "1 1/2 tablespoons butter ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts in water ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot with boiling salted water cook penne pasta until al dente. Drain.\nMeanwhile, in a large skillet over medium-high heat melt butter, add onion and garlic and cook for 2 minutes. Add chopped chicken and continue cooking, stirring occasionally until golden brown, about 5 to 6 minutes.\nReduce heat to medium- low. Drain and chop artichoke hearts and add them, chopped tomato, feta cheese, fresh parsley, lemon juice, dried oregano, and drained penne pasta to the large skillet. Cook until heated through, about 2 to 3 minutes.\nSeason with salt and ground black pepper. Serve warm.\n",
        "picture_link": "JWajRYMVOaeOAXtHe8xClfj1WLmKuBG"
    },
    {
        "title": "Shrimp Fettuccine Alfredo",
        "ingredients": [
            "1 pound fettuccini pasta ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 pound cooked shrimp - peeled and deveined ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "6 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet, cook and stir shrimp and garlic in the butter for about one minute. Pour in half and half; stir. Sprinkle Parmesan cheese in one tablespoon at a time, stirring constantly. After all Parmesan is added, mix in parsley and salt. Stir frequently making sure it does not boil. Sauce will take a while to thicken.\nWhen sauce has thickened, combine with cooked pasta noodles; serve hot.\n",
        "picture_link": "TKRmtPKFuxq9z4z39B3hyZc7W4F9YVC"
    },
    {
        "title": "Simple Garlic Shrimp",
        "ingredients": [
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 pound shrimp, peeled and deveined ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "6 cloves garlic, finely minced ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon caper brine ADVERTISEMENT",
            "1 1/2 teaspoons cold butter ADVERTISEMENT",
            "1/3 cup chopped Italian flat leaf parsley, divided ADVERTISEMENT",
            "1 1/2 tablespoons cold butter ADVERTISEMENT",
            "water, as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a heavy skillet over high heat until it just begins to smoke. Place shrimp in an even layer on the bottom of the pan and cook for 1 minute without stirring.\nSeason shrimp with salt; cook and stir until shrimp begin to turn pink, about 1 minute.\nStir in garlic and red pepper flakes; cook and stir 1 minute. Stir in lemon juice, caper brine, 1 1/2 teaspoon cold butter, and half the parsley.\nCook until butter has melted, about 1 minute, then turn heat to low and stir in 1 1/2 tablespoon cold butter. Cook and stir until all butter has melted to form a thick sauce and shrimp are pink and opaque, about 2 to 3 minutes.\nRemove shrimp with a slotted spoon and transfer to a bowl; continue to cook butter sauce, adding water 1 teaspoon at a time if too thick, about 2 minutes. Season with salt to taste.\nServe shrimp topped with the pan sauce. Garnish with remaining flat-leaf parsley.\n",
        "picture_link": "1GDpCY9gD4tXftIN5KTEVN4k32UXFI."
    },
    {
        "title": "Whole Wheat Blueberry Pancakes",
        "ingredients": [
            "1 1/4 cups whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup milk, plus more if necessary ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon artificial sweetener ADVERTISEMENT",
            "1/2 cup blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together flour and baking powder, set aside. Beat together the egg, milk, salt and artificial sweetener in a bowl. Stir in flour until just moistened, add blueberries, and stir to incorporate.\nPreheat a heavy-bottomed skillet over medium heat, and spray with cooking spray. Pour approximately 1/4 cup of the batter into the pan for each pancake. Cook until bubbly, about 1 1/2 minutes. Turn, and continue cooking until golden brown.\n",
        "picture_link": "0Khqyio32mPiYWjfYt.snyoDrwhN7ne"
    },
    {
        "title": "Slow Cooker Cranberry Pork",
        "ingredients": [
            "1 (16 ounce) can cranberry sauce ADVERTISEMENT",
            "1/3 cup French salad dressing ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 (3 pound) boneless pork loin roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the cranberry sauce, salad dressing, and onion. Place pork in a slow cooker, and cover with the sauce mixture.\nCover, and cook on High for 4 hours, or on Low for 8 hours. Pork is done when the internal temperature has reached 145 degrees F (63 degrees C).\n",
        "picture_link": "PULM6F9JshtqFRgJidnr.yCTt7.4oLK"
    },
    {
        "title": "Creamy Chicken Lasagna",
        "ingredients": [
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "6 uncooked lasagna noodles ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1/4 cup hot water ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 (26 ounce) jar spaghetti sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles for 8 to 10 minutes, or until al dente. Drain, rinse with cold water, and set aside.\nMeanwhile, place the chicken in a saucepan with enough water to cover, and bring to a boil. Cook for 20 minutes, or until no longer pink and juices run clear. Remove from saucepan, and shred.\nPreheat oven to 350 degrees F (175 degrees C). Dissolve the bouillon cube in hot water. In a large bowl, mix the chicken with the bouillon, cream cheese, and 1 cup mozzarella cheese.\nSpread 1/3 of spaghetti sauce in the bottom of a 9x13 inch baking dish. Cover with the chicken mixture, and top with 3 lasagna noodles; repeat. Top with remaining sauce, and sprinkle with remaining mozzarella cheese.\nBake for 45 minutes in the preheated oven.\n",
        "picture_link": "0YMASDaxHTrbAcqk56mDzpfvrbtVaJW"
    },
    {
        "title": "Kay's Spaghetti and Lasagna Sauce",
        "ingredients": [
            "1 (28 ounce) can stewed tomatoes ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "2 yellow onions, chopped ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "5 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the stewed tomatoes and crushed tomatoes in a blender. In a stock pot or large kettle, brown the ground beef with the onions, peppers, garlic. Pour in tomatoes, and reduce heat. Add sugar, basil and oregano, and simmer about 40 minutes. Season with salt and pepper before serving.\n",
        "picture_link": "rXkg4HYwJ5mrEXAFG0sEFHK9euy2uKG"
    },
    {
        "title": "Sour Cream Coffee Cake III",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, cream together 1 cup butter and white sugar until light and fluffy. Beat in the eggs one at a time, then stir in the sour cream and vanilla. Mix in 2 cups flour, baking powder, and salt. Spread 1/2 of batter in the prepared pan.\nPrepare the filling: In a medium bowl mix 1/3 cup flour, brown sugar, 2 tablespoons melted butter, and cinnamon. Sprinkle cake batter with 1/2 the filling. Spread second half of batter over the filling, and top with remaining filling.\nBake 35 to 40 minutes in the preheated oven, or until a toothpick inserted near the center comes out clean.\n",
        "picture_link": "5wofUDPNqlI0YivVoxpVCAiyTDw/g0K"
    },
    {
        "title": "Corn Dogs",
        "ingredients": [
            "1 cup yellow cornmeal ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "2 (16 ounce) packages beef frankfurters ADVERTISEMENT",
            "16 wooden skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine cornmeal, flour, salt, pepper, sugar and baking powder. Stir in eggs and milk.\nPreheat oil in a deep saucepan over medium heat. Insert wooden skewers into frankfurters. Roll frankfurters in batter until well coated.\nFry 2 or 3 corn dogs at a time until lightly browned, about 3 minutes. Drain on paper towels.\n",
        "picture_link": "2vx.tQRuJqR/I4IRufDzbMlLhhkwrSS"
    },
    {
        "title": "Andrea's Pasta Fagioli",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, quartered then halved ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (29 ounce) can tomato sauce ADVERTISEMENT",
            "5 1/2 cups water ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans ADVERTISEMENT",
            "1 (15 ounce) can navy beans ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1 pound ditalini pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, cook onion in olive oil until translucent. Stir in garlic and cook until tender. Reduce heat, and stir in tomato sauce, water, parsley, basil, oregano, salt, cannelini beans, navy beans and Parmesan. Simmer 1 hour.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Stir into soup.\n",
        "picture_link": "oUlvwkIGlxQZomJiCB3dgYM/wSehzfy"
    },
    {
        "title": "Feta Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "6 ounces tomato basil feta cheese, crumbled ADVERTISEMENT",
            "1/4 cup Italian-style dry bread crumbs, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nPlace chicken breasts between 2 pieces of waxed paper. Gently pound chicken with flat side of meat mallet or rolling pin until about 1/4 inch thick; remove wax paper. Place 1 ounce of feta cheese in the center of each chicken breast, and fold in half.\nSpread 2 tablespoons bread crumbs in the bottom of the prepared baking dish. Arrange chicken in the dish, and top with remaining bread crumbs.\nBake 25 to 30 minutes in the preheated oven, or until chicken is no longer pink and juices run clear.\n",
        "picture_link": "o/1wrXSZyuBtTr2YEd9QPeCdZPLXlHy"
    },
    {
        "title": "Easy Chicken Tetrazzini",
        "ingredients": [
            "1 pound cooked and drained spaghetti ADVERTISEMENT",
            "5 chicken breasts, cooked and cubed ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put cooked spaghetti into 9x13-inch baking dish. Place chicken on top of spaghetti.\nIn medium saucepan heat together soup, water, butter, and bouillon. Bring to a boil and then pour over the pasta and chicken. Put shredded cheese (to taste) on top and press down a bit.\nBake at 350 degrees F (175 degrees C) for 25 minutes.\n",
        "picture_link": "qiyD60bFhcb0hxdu3Q5sA2bLJE/Oz9C"
    },
    {
        "title": "German Potato Pancakes",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "6 medium potatoes, peeled and shredded ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat together eggs, flour, baking powder, salt, and pepper. Mix in potatoes and onion.\nHeat oil in a large skillet over medium heat. In batches, drop heaping tablespoonfuls of the potato mixture into the skillet. Press to flatten. Cook about 3 minutes on each side, until browned and crisp. Drain on paper towels.\n",
        "picture_link": "lCoWeJqYBe/Gp87JXpl.vdUcfBWHoV."
    },
    {
        "title": "Easy Alfredo Sauce I",
        "ingredients": [
            "1 pint heavy whipping cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 cups grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan combine whipping cream, butter or margarine, and grated Parmesan cheese. Cook over medium low heat until smooth. Remove from heat. Sauce will thicken upon standing.\n",
        "picture_link": "WeFUrKu1fAwvLXl0oex19d3gX2oNz6y"
    },
    {
        "title": "Beefy Baked Ravioli",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 (25 ounce) package frozen cheese ravioli ADVERTISEMENT",
            "1 (14 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (230 degrees C).\nCrumble the ground beef into a large skillet over medium-high heat. Cook and stir until no longer pink. Drain grease, then stir in the spaghetti sauce and tomatoes.\nSpread 1/3 of the sauce in the bottom of an 11x7 inch baking dish. Arrange 1/2 of the ravioli over the sauce. Sprinkle 1/2 of the mozzarella cheese and 1/2 of the Monterey Jack cheese over the ravioli. Repeat layers, ending with the last of the sauce on top. Cover with aluminum foil.\nBake for 30 minutes in the preheated oven. Sprinkle Parmesan cheese over the top before serving.\n",
        "picture_link": "dTYxism3WfNo9ozz2S3X3Olizhpu0Wm"
    },
    {
        "title": "Garden Veggie Pizza Squares",
        "ingredients": [
            "1 (8 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (1 ounce) package Ranch-style dressing mix ADVERTISEMENT",
            "2 carrots, finely chopped ADVERTISEMENT",
            "1/2 cup chopped red bell peppers ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup fresh broccoli, chopped ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nRoll out crescent rolls onto a large non-stick baking sheet. Stretch and flatten to form a single rectangular shape on the baking sheet. Bake 11 to 13 minutes in the preheated oven, or until golden brown. Allow to cool.\nPlace cream cheese in a medium bowl. Mix cream cheese with 1/2 of the ranch dressing mix. Adjust the amount of dressing mix to taste. Spread the mixture over the cooled crust. Arrange carrots, red bell pepper, broccoli and green onions on top. Chill in the refrigerator approximately 1 hour. Cut into bite-size squares to serve.\n",
        "picture_link": "9qvHF6Pna9sdHBzvSpmsqv9IoDts//u"
    },
    {
        "title": "Chicken Wild Rice Soup I",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 finely chopped onion ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 cup sliced carrots ADVERTISEMENT",
            "1/2 pound fresh sliced mushrooms ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "2 cups cooked wild rice ADVERTISEMENT",
            "1 pound boneless skinless chicken breasts, cooked and cubed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup slivered almonds ADVERTISEMENT",
            "3 tablespoons dry sherry ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium heat. Stir in the onion, celery and carrots and saute for 5 minutes. Add the mushrooms and saute for 2 more minutes. Then add the flour and stir well. Gradually pour in the chicken broth, stirring constantly, until all has been added. Bring just to a boil, reduce heat to low and let simmer.\nNext, add the rice, chicken, salt, curry powder, mustard powder, parsley, ground black pepper, almonds and sherry. Allow to heat through, then pour in the half-and-half. Let simmer for 1 to 2 hours. (Note: Do not boil or your roux will break.)\n",
        "picture_link": "osdGJ.7i3jZifq3r0BoAMhdy33jOfdS"
    }
]