[
    {
        "title": "Jimmy Dean Sausage Breakfast Pizza",
        "ingredients": [
            "2 (16 ounce) packages Regular Flavor Jimmy Dean Pork Sausage, cooked, crumbled and drained ADVERTISEMENT",
            "2 (8.5 ounce) cans refrigerated crescent rolls ADVERTISEMENT",
            "2 cups frozen hash brown potato cubes, thawed ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "6 eggs, lightly beaten ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons black pepper ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/3 cup diced green bell pepper (optional) ADVERTISEMENT",
            "1/3 cup diced red bell pepper (optional) ADVERTISEMENT",
            "1/3 cup diced yellow bell pepper (optional) ADVERTISEMENT",
            "1/2 cup thinly sliced green onions (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 F. Separate crescent rolls into sixteen triangles. Place in two ungreased 12 inch rimmed pizza pans with points toward the center. In each pan, press rolls together, seal perforations and form a circle 1 inch larger in diameter than bottom of pan. Turn edges under to make a slight rim.\nSprinkle cooked sausage evenly over each crust. Top with potatoes; add peppers and/or green onions, if desired. Sprinkle with Cheddar cheese. Combine eggs, milk, salt and pepper in small bowl: stir well. Pour half of the egg mixture evenly over each pizza. Sprinkle with Parmesan.\nBake for 15-20 minutes or until eggs are set and crusts are golden.\n",
        "picture_link": "eWFXj78zEqNz8u4LPyqyhxGNiiysFFi"
    },
    {
        "title": "Graham Cracker Crunch Topping",
        "ingredients": [
            "2 graham crackers, crumbled ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a small baking pan.\nIn a small bowl, mix together crumbled graham crackers, brown sugar and cinnamon. Combine melted butter and vanilla, then stir in. Spread evenly in prepared pan. Sprinkle white sugar and salt over the top.\nBake in preheated oven for 15 minutes, or until lightly browned.\n",
        "picture_link": "3lkwBUefx/NJUKHqp5XvmWtAd97N1rS"
    },
    {
        "title": "Kikuchan's Potato-Crab Salad",
        "ingredients": [
            "6 small russet potatoes ADVERTISEMENT",
            "3 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 (6 ounce) can lump crabmeat, drained ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/2 carrot, grated ADVERTISEMENT",
            "1/2 cup mayonnaise, or to taste ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large saucepan with enough water to cover. Bring to a boil, and cook over medium-high heat for 30 minutes, or until tender. Drain, peel and dice while still hot. This is what will make the salad fluffy. Cover and refrigerate until cold.\nIn a large serving bowl, toss together the potatoes, eggs, crabmeat, black olives and carrot. Sprinkle with sugar, and stir in enough mayonnaise to moisten. Season with salt and pepper to taste. Chill until ready to serve.\n",
        "picture_link": "prDKhueoRKOwoY643tlcZW9.2bjTs5u"
    },
    {
        "title": "Wild Rice with Rosemary and Cashew Stuffing",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1/2 cup onion, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh mushrooms ADVERTISEMENT",
            "1 cup chopped cashews ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "1 3/4 cups chicken stock ADVERTISEMENT",
            "1 cup long grain and wild rice mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat. Saute onions until tender and translucent. Stir in mushrooms, and saute until soft. Add rosemary, and cook for 1 minute. Stir in cashews, and cook for 1 minute. Transfer to a medium saucepan.\nPour in chicken stock, and stir in rice. Cover, and bring to a boil. Reduce heat, and simmer until water is absorbed. Remove from heat, and let stand for 5 minutes. Stuff into the cavity of a small roasting chicken.\n",
        "picture_link": "Fk1/jYpCVO1c6jb0lmM9AphQbwIhMry"
    },
    {
        "title": "Tangy Hawaiian Chicken",
        "ingredients": [
            "1 (8 ounce) can pineapple tidbits with juice ADVERTISEMENT",
            "1 cup soy sauce ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 tablespoons barbeque sauce ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "4 boneless, skinless chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1/2 cup finely chopped celery ADVERTISEMENT",
            "2 1/2 cups uncooked white rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a glass or plastic dish with a lid, combine the pineapple with its juice, soy sauce, onion powder, sugar, lemon juice, barbeque sauce, and curry powder. Taste, and adjust seasonings if desired. Place the chicken into the mixture, cover, and refrigerate for 1 to 2 hours.\nPreheat an outdoor grill for medium-high heat. Place chicken breasts onto the grate, and grill until the meat is no longer pink inside. Brush occasionally with the pineapple sauce. Chicken should take about 7 to 10 minutes on each side.\nPut the four cups water into a medium saucepan over medium-high heat. Add onions, celery, and rice. Bring to a boil, and reduce heat to medium-low. Simmer until rice is tender, about 20 minutes. In a separate pan, heat the marinade over medium heat until boiling. Simmer for about 5 or 10 minutes, then remove from heat, and set aside.\nServe the chicken on a bed of rice with the sauce covering it, or to the side.\n",
        "picture_link": "CIloSSteudANP7r/bX1xcj/Vr2Tdabq"
    },
    {
        "title": "Pineapple Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter, chilled ADVERTISEMENT",
            "3/4 cup coconut milk ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 orange, zested ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl, mix flour, baking powder, and salt. Cut in chilled butter until the mixture resembles coarse crumbs.\nIn a small bowl, mix coconut milk, honey, and egg. Stir into the flour mixture. Fold in pineapple and orange zest. Divide the mixture into 12 rounded pieces, and arrange in a single layer on a medium ungreased baking sheet.\nBake 15 to 20 minutes in the preheated oven, until golden brown.\n",
        "picture_link": "JgeTNnbUPmR3Hxcs92KYyTdalBSwXO2"
    },
    {
        "title": "Colorado Mexican Pizza",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 medium tomatoes, chopped ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 (30 ounce) can refried beans ADVERTISEMENT",
            "14 (12 inch) flour tortillas ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 1/4 pounds shredded Colby cheese ADVERTISEMENT",
            "1 1/2 pounds shredded Monterey Jack cheese ADVERTISEMENT",
            "2 red bell peppers, seeded and thinly sliced ADVERTISEMENT",
            "4 green bell peppers, seeded and thinly sliced ADVERTISEMENT",
            "1 (7 ounce) can diced green chilies, drained ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "1 1/2 cups shredded cooked chicken meat ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 (16 ounce) jar picante sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Butter a 10x15 inch jellyroll pan.\nCook the ground beef in a large heavy skillet over medium heat until evenly browned. Drain off excess grease, and add onion and 2 tomatoes. Continue cooking until onions are tender. Season with salt, pepper, chili powder, and cumin. Stir in refried beans, and cook until heated through.\nLay 6 of the tortillas onto the prepared pan with the edges going well over the sides. Spread all of the bean mixture onto the tortillas. Spread half of the sour cream over the bean layer. Sprinkle with approximately 1/3 of the Colby cheese, and 1/3 of the Monterey Jack cheese. Scatter 1 tablespoon of the green chilies, 1/3 of the green pepper strips, and 1/3 of the red pepper strips followed by 1/3 of the remaining chopped tomato.\nMake a layer of only 4 tortillas over the toppings, and spread with remaining sour cream. Top with shredded chicken, then a second 1/3 of both cheeses, red and green bell peppers, chilies, and tomatoes. Arrange the final layer using remaining 4 tortillas as a base, cheeses, peppers, tomatoes, chilies, and ending with shredded cheese on the top. Fold the overhanging edges inward, and secure with toothpicks. Brush exposed tortilla surfaces with melted butter.\nBake for 35 to 45 minutes in the preheated oven, or until heated through, and cheese is melted and bubbly. Remove toothpicks, and let stand for at least 5 minutes before slicing. Spoon picante sauce over according to individual tastes.\n",
        "picture_link": "HNXs4trqmAxDYhDCvo9qTgogVswQojO"
    },
    {
        "title": "BBQ Rib-Eye - You Won't Believe It!",
        "ingredients": [
            "2 (10 ounce) marbled beef rib-eye steaks ADVERTISEMENT",
            "2 teaspoons garlic powder, or to taste ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 (12 fluid ounce) cans cola-flavored carbonated beverage ADVERTISEMENT",
            "2 cups barbeque sauce ADVERTISEMENT",
            "8 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Score steaks on both sides in a diamond pattern using a sharp knife. Punch the fatty areas with the tip of the knife. Sprinkle a thin coating of garlic powder over both sides of the steaks, then sprinkle with salt and pepper. Rub to get the seasoning into all of the scores.\nPlace steaks in a shallow dish, and pour the cola over them. Cover, and marinate in the refrigerator for 4 hours, turning steaks over every hour or so. During the last hour, coat the steaks with a thin layer of barbeque sauce.\nPreheat an outdoor grill for high heat.\nLightly oil the grilling surface. Place steaks on the grill over high heat, and cook until almost burnt on each side, about 4 minutes per side. Reduce the grill's heat to medium-low, or move steaks to a cooler part, and place the bacon strips on top of them. Cover, and slow cook for 10 minutes per side.\nSpread a thin layer of barbeque sauce over the steaks during the last few minutes of cooking, and allow it to cook until dry for a glazed effect.\n",
        "picture_link": "1Ndx5C8PUfRMjDc7TMereGdkeIL73fW"
    },
    {
        "title": "Frosting Made Easy",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour milk into a saucepan, and bring to just a simmer. Be careful, if it starts to boil, it will quickly boil over.\nMeanwhile, combine the shortening, margarine and sugar in a large bowl, and beat with an electric mixer until light. When the milk is heated, gradually drizzle in the hot milk, while continuing to whip until light and fluffy.\n",
        "picture_link": "cqYOAEDWsPO.WF7hCW68RRT6rAb6vwK"
    },
    {
        "title": "Gourmet Raspberry Chicken",
        "ingredients": [
            "2 (10.5 ounce) cans chicken broth ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 cup frozen cranberry raspberry juice concentrate ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 (12 ounce) package frozen raspberries, divided ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon dried tarragon (optional) ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the chicken broth and garlic in a saucepan over medium-high heat. Bring to a boil, and cook until reduced by 1/2, at least 15 minutes. Stir in the cranberry raspberry concentrate, white wine, and 2/3 of the package of raspberries. Return to a boil, and boil until there is about 1/2 cup of sauce remaining, about 30 minutes. Strain the sauce, and return it to the pan. Mix together the cornstarch and cold water; stir into the sauce. Cook over medium heat until glossy and slightly thickened.\nPlace the flour and tarragon in a small paper sack. Shake to mix. Place chicken breasts in the bag, and coat completely.\nHeat the olive oil in a skillet over medium heat. Add chicken, and cook until no longer pink, and the juices run clear. . Drain off excess oil, and pour the raspberry sauce into the pan. It will boil up, and then settle. Turn the chicken to coat evenly with the sauce. Sprinkle the remaining raspberries into the pan and cook until thawed.\n",
        "picture_link": "XSlFQrmc8fzF8DdVGYDgezdnr6Bs.5i"
    },
    {
        "title": "Berry Almond Bars",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup vanilla baking chips ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup any flavor of berry jam ADVERTISEMENT",
            "1 cup vanilla baking chips ADVERTISEMENT",
            "1/4 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x9 inch square baking pan. In a saucepan over medium heat, melt butter. Remove from heat and add 1 cup vanilla chips, but do not stir.\nIn a large bowl, beat eggs until foamy. Gradually mix in the sugar. Stir together the softened chips and butter, and blend into the egg mixture along with the almond extract. Combine the flour and salt; stir into the batter until just mixed. Spread half of the batter into the prepared pan.\nBake for 15 to 20 minutes in the preheated oven, or until golden brown. In a small saucepan, over low heat, warm the jam to make it more liquid. Spread the jam over the warm crust. Stir the remaining cup of vanilla chips into the batter, then drop the rest of the batter by teaspoonfuls over the jam. Sprinkle with almonds.\nBake for an additional 30 to 35 minutes in the preheated oven, or until a toothpick inserted into the center, comes out clean. Cool in pan on a wire rack before cutting into bars.\n",
        "picture_link": "DbfkXpteRQ3yPIMvdMzQBG8pUZughV6"
    },
    {
        "title": "Budget Berry Jam",
        "ingredients": [
            "4 cups green tomato pulp ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "2 (3 ounce) packages fruit flavored Jell-O® mix, any flavor ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium-high heat combine tomato pulp and sugar; bring to a boil. Reduce heat and simmer for 20 minutes, stirring occasionally.\nRemove from the heat and stir in the gelatin mix. Stir until the gelatin is completely dissolved. Pour into hot sterilized jars and seal. When jars are cool put them in the freezer.\n",
        "picture_link": "7lrUcB7Y2Q/ft4LU4hrg4iFkVMseXTS"
    },
    {
        "title": "Gingerbread Waffles",
        "ingredients": [
            "1 tablespoon butter, softened ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "1/4 cup liquid egg substitute ADVERTISEMENT",
            "1/2 cup Kamut® flour ADVERTISEMENT",
            "1/2 cup whole wheat pastry flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "3/4 cup boiling water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix the butter, molasses and egg substitute with an electric mixer until smooth. In a separate bowl, stir together the Kamut flour, whole wheat flour, baking powder, baking soda, salt, ginger, cinnamon and cloves. Stir the dry ingredients into the molasses mixture alternating with the water, beginning and ending with the flour, stir just until blended.\nPreheat the waffle iron, and coat with cooking spray. Spoon the desired amount of batter onto the hot iron, and cook until steam stops coming out, and waffles don't stick to the iron. Continue with remaining batter.\n",
        "picture_link": ".lBlB2i5uFtxdKJ4GfGhVWSP14aVY.2"
    },
    {
        "title": "Beefburger Parcels",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 pound fresh mushrooms, finely chopped ADVERTISEMENT",
            "1 (17.25 ounce) package frozen puff pastry ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup red grape juice ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon cornstarch, mixed with equal parts water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat, and lightly oil grate. Preheat oven to 400 degrees F (200 degrees C).\nIn a large bowl, combine ground beef, 1 chopped onion, garlic, and 1 tablespoon olive oil. Season with Worcestershire sauce, Italian seasoning, salt, and pepper. Add egg, and mix well. Shape into 4 thick patties, not too large in diameter. Cook burgers on grill until brown.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Saute 1 chopped onion, and chopped mushrooms until brown and caramelized.\nCut puff pastry into 4 squares, and roll pieces large enough to wrap burgers. Divide mushroom mixture into the center of each pastry, then top with burgers. Wrap pastry around burgers, and seal edges. Place parcels seam side down on a baking sheet. Brush with beaten egg.\nBake in preheated oven for 25 to 30 minutes, or until pastry is puffed and golden brown. Serve with Red Grape Sauce.\nMeanwhile, make Red Grape Sauce: In a saucepan over medium heat, combine grape juice, Worcestershire sauce, and bouillon. Mix the cornstarch with water, and stir into sauce. Bring slowly to a boil, stirring constantly, until thickened.\n",
        "picture_link": "Z4tsnvNO6fAzp64sSU0v558LSh0e3ua"
    },
    {
        "title": "Herbed Pork Chops",
        "ingredients": [
            "6 pork chops ADVERTISEMENT",
            "1 1/2 teaspoons garlic salt ADVERTISEMENT",
            "1 teaspoon dried rosemary leaves, crushed ADVERTISEMENT",
            "1/2 teaspoon dried basil leaves, crushed ADVERTISEMENT",
            "1 orange, thinly sliced ADVERTISEMENT",
            "1 lemon, thinly sliced ADVERTISEMENT",
            "1/2 cup coffee flavored liqueur ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "2 teaspoons chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim excess fat from chops. Heat skillet over medium heat, and rub a piece of fat over the bottom of the pan. Cook chops, turning occasionally, until browned on both sides (4 to 6 minutes).\nSeason chops with garlic salt, rosemary, and basil. Arrange slices of orange and lemon over meat, and pour coffee liqueur and 1/4 cup water over all. Cover, and simmer for 30 minutes, or until meat is tender.\nBlend cornstarch with remaining 1/4 cup water, and stir into pan liquid; cook until thick. Sprinkle with green onions, and serve.\n",
        "picture_link": "FB38FjUQ8N3cTDYgX5ADUSn76/DDvL6"
    },
    {
        "title": "Roasted Vegetables and Puff Pastry",
        "ingredients": [
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 green chile pepper, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1 (4 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "1/2 (17.5 ounce) package frozen puff pastry (1 sheet), thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly oil a shallow baking dish or pie dish.\nPlace onion, peppers, and garlic in prepared pan. Season with freshly ground pepper, and sprinkle a little olive oil over them. Roast in preheated oven for about 10 minutes, or until you think the vegetable are done.\nWhen the vegetables are tender, remove from oven. Spread tomatoes evenly over the vegetables, and sprinkle with feta cheese. Roll out the puff pastry, and place over vegetables.\nBake for 20 minutes, or until pastry is golden brown. Remove from oven, place a tray over the dish, and then flip it upside down so that you have a puff pastry base with the vegetables on top. Serve immediately while the puff pastry is still crisp.\n",
        "picture_link": "ZH5tOHd75NEKAs0Ub7AvUkRatjcrg3a"
    },
    {
        "title": "Sukiyaki Beef",
        "ingredients": [
            "1 tablespoon peanut oil ADVERTISEMENT",
            "1 pound beef round steak, sliced diagonally into 3 inch pieces ADVERTISEMENT",
            "1/2 cup beef stock ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3/4 cup onion, diced ADVERTISEMENT",
            "3/4 cup celery, diced ADVERTISEMENT",
            "1/4 pound mushrooms, chopped ADVERTISEMENT",
            "1/4 pound fresh spinach, rinsed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a wok or large heavy skillet over medium-high heat. Add beef, and cook until evenly brown. Stir in beef stock, soy sauce and butter. Push meat to the side, and toss in onion, celery and mushrooms. Cook, stirring, for about 4 minutes. Add spinach, and cook for 2 more minutes.\n",
        "picture_link": "S3Hvbc94UENe0tf7lSoQJ3plTguVKAm"
    },
    {
        "title": "Mustard Green Beans",
        "ingredients": [
            "3/4 pound fresh green beans, trimmed and snapped ADVERTISEMENT",
            "1 tablespoon honey mustard ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large saucepan of water to boil, and cook beans uncovered until tender but crisp, 3 to 4 minutes. Remove from heat, drain, and immerse in a medium bowl filled with enough ice water to cover.\nIn a small bowl, mix honey mustard, vinegar, olive oil, and chives. Season with salt and pepper.\nDrain ice water, and pour the honey mustard mixture over the beans. Stir to coat.\n",
        "picture_link": "wX9hFnoicRvr62FH0OTjsiqTpi5cRXi"
    },
    {
        "title": "Russian Tomato Salad",
        "ingredients": [
            "2 sweet onions, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "3 green bell peppers, chopped ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 tablespoon chopped fresh dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, toss together sweet onions, tomatoes, and green bell peppers.\nBlend sour cream and dill in a small bowl. Lightly toss into the salad mixture. Cover, and chill in the refrigerator until serving.\n",
        "picture_link": "tx8t8GKf8UW8uEy/hjZGi4z.5Ym5xtu"
    },
    {
        "title": "Grape Sherbet",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "4 cups grape juice ADVERTISEMENT",
            "3 lemons, juiced ADVERTISEMENT",
            "whole milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a gallon ice cream freezer container, mix together the sweetened condensed milk, cream, white sugar, grape juice, and lemon juice. Pour in enough whole milk to fill the container to the fill line.\nFollow the manufacturer's instructions to freeze the ice cream.\n",
        "picture_link": "rfwLw17wuW6G55UjV5BsxhivbsAs7Cm"
    },
    {
        "title": "Argentinean Potato Salad",
        "ingredients": [
            "4 russet potatoes - peeled, boiled, and cubed ADVERTISEMENT",
            "3 hard cooked eggs, chopped ADVERTISEMENT",
            "1 (10 ounce) can mixed vegetables ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon ground mustard ADVERTISEMENT",
            "1/2 tablespoon fresh lemon juice ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "5 tablespoons chopped pimiento-stuffed olives ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook peeled potatoes until tender but still firm, about 15 minutes. Drain, cool, and cube.\nPlace eggs in a saucepan, and cover with cold water. Bring to a boil, and immediately remove from heat. Cover pan, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water and allow to cool. Peel and chop the eggs, and toss together with the potatoes and vegetables in a large mixing or serving bowl.\nIn a separate bowl, combine the mayonnaise, 1/2 teaspoon black pepper, ground mustard, lemon juice, dill weed, and green olives. Stir to blend. Pour dressing over the potato mixture, season with salt and pepper, and toss to coat. Cover, and refrigerate for 1 hour, or overnight.\n",
        "picture_link": "5RQrSQvT38nMqMEhO98y9RVi/zxK/dq"
    },
    {
        "title": "Italian Cheesecake Cookies",
        "ingredients": [
            "1 pound ricotta cheese ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, melted and cooled ADVERTISEMENT",
            "1/2 pint sour cream ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 cup cherry pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together the ricotta and cream cheese. Add sugar and continue beating until smooth. Add lemon juice, vanilla, flour, and cornstarch, beating well after each addition. Beat in eggs, one at a time. Gradually beat in melted butter. Blend in sour cream, continue beating all ingredients until well blended.\nPour into ungreased 9 x 13 inch pan. Bake at 320 degrees F (160 degrees C) for 1 hr. Turn off oven and leave inside for 2 hours.\nCut into squares. Top each with strawberry, blueberry, or cherry pie filling. Note: Bars can be frozen.\n",
        "picture_link": "tSC.eX1Baz7mohCRGQFWTdc7U3vLxJm"
    },
    {
        "title": "Walnut Biscotti",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon anise extract ADVERTISEMENT",
            "1 teaspoon black walnut extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "4 1/2 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together flour and baking powder and set aside.\nBeat together eggs and sugar in a large bowl until well blended. Stir in butter, extracts, black walnut flavoring and the walnuts. Gradually stir flour mixture into creamed mixture blending well.\nDivide dough on a floured surface into 8 equal portions. Roll each portion into a 14 inch rope.\nPlace four ropes about 2 inches apart on greased cookie sheet. Bake in a 325 degree F (165 degree C) oven for approximately 20 minutes, until bottoms are pale gold in color.\nLet cool about 2 minutes on the baking sheet then cut each rope on a diagonal into slices 1/2 to 3/4 inch thick. Lay slices close together on sides and bake at 375 degrees F (190 degrees C) until lightly toasted (approximately 15 minutes). Cool on baking sheet. Store airtight.\n",
        "picture_link": "/sUWFv0rZp80yWZ6glowfwq6BSWuT.O"
    },
    {
        "title": "Sweet Potato Balls",
        "ingredients": [
            "40 ounces canned sweet potatoes ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 pinch salt (optional) ADVERTISEMENT",
            "3 cups crushed cornflakes cereal ADVERTISEMENT",
            "3/4 cup real maple syrup ADVERTISEMENT",
            "10 large marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain sweet potatoes and put into large mixing bowl. Mash the potatoes with butter or margarine. Salt to taste.\nHand pat mixture into 3 inch diameter balls. Roll in crushed corn flakes and put into 9 x 12 inch greased baking dish. Pour maple syrup evenly over all balls.\nBake at 325 degrees F (165 degrees C) for 40 minutes. The last fifteen minutes put a marshmallow over each ball.\n",
        "picture_link": "dnABUYvy7zMdRRSIs4MTkMCusivZ8xG"
    },
    {
        "title": "Non-Edible Cinnamon Dough",
        "ingredients": [
            "3/4 cup applesauce ADVERTISEMENT",
            "4 ounces ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the applesauce and cinnamon to form a stiff dough. Roll dough to 1/4 inch thick. Cut with cookie cutters and make a hole for ribbon. Carefully place cookies on a rack to dry. Let air dry for several days, turning occasionally.\n",
        "picture_link": "R.e5.tn.p5mB2JWsQk4iTsNAaIhv6vG"
    },
    {
        "title": "Boiled Custard I",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill the lower pan of a double boiler 1/3 full of water, and bring to a low boil. Pour milk into upper pot, and place over boiling water. Heat until small bubbles form around the edges of the milk. Stir in sugar, and continue stirring until it dissolves.\nIn a small bowl, beat the eggs until light yellow. Remove about 1/2 cup hot milk, and gradually stir it into the eggs. Slowly mix the egg mixture into the milk in the pan.\nMix together cornstarch and water; slowly stir into custard. Bring custard to a boil, and remove from heat. Stir in vanilla. Serve warm or chilled.\n",
        "picture_link": "CgBRA5Em2JYBDdMeosmOrq22PTIsreG"
    },
    {
        "title": "Thumbprint Cookies II",
        "ingredients": [
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup finely chopped pecans ADVERTISEMENT",
            "1/3 cup apricot preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease 2 baking sheets or line them with parchment paper.\nSeparate the egg, reserving the egg white. Mix the butter and brown sugar; beat in the egg yolk. Stir in the vanilla. Mix in the flour and salt, stirring until well blended.\nLightly beat the egg white.\nShape the dough into balls. Roll in beaten egg white, then nuts. Place the cookies on the baking sheets about 2 inches apart. Bake in the preheated oven for 5 minutes.\nRemove cookies from oven. With thumb, dent each cookie. Put jelly or preserves in each thumbprint. Bake for another 8 minutes.\n",
        "picture_link": "eH7..rovCpVfpYVU3pWVPnjaoca3QPC"
    },
    {
        "title": "Beet Surprise Cake",
        "ingredients": [
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 cup beets, boiled and grated ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/4 cups melted butter ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 tablespoons cream ADVERTISEMENT",
            "3 ounces cream cheese ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pound confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease one 9x13 inch pan. Preheat oven to 350 degrees F (175 degrees C). Sprinkle lemon juice over beets, set aside.\nCombine flour, 1 teaspoon salt, soda, white sugar, cocoa, melted butter, eggs, honey, milk, and 2 teaspoons vanilla in a large mixing bowl. Stir in beets. Beat 2 minutes at medium speed of mixer. Pour into prepared pan.\nBake at 350 degrees F (175 degrees C) about 40 minutes. Cool and frost.\nTo make frosting: combine cream and cream cheese, 1 teaspoon vanilla, and pinch of salt. Add confectioners' sugar, beat until fluffy. Spread on cake. Add nuts if desired.\n",
        "picture_link": "OIZAjvmHQG3xb7sfK2eZAWq31kiVsu2"
    },
    {
        "title": "Last Night's Chicken",
        "ingredients": [
            "1 (3 pound) whole chicken ADVERTISEMENT",
            "3 dashes garlic powder ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup orange-flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken in a lightly greased 9x13 inch baking dish. Season with garlic powder, salt and pepper and garnish with onion slices. Place 1/8 cup of butter or margarine on top of the chicken and bake in the preheated oven for 45 minutes.\nRaise oven temperature to 375 degrees F (190 degrees C); Place remaining 1/8 cup butter or margarine on top of the chicken and bake for 30 minutes.\nPour orange-flavored beverage all over chicken, bake for 5 more minutes, and serve.\n",
        "picture_link": "DCaEAa6tnHrYiAmTH4ECJdekH/zzSFu"
    },
    {
        "title": "Three Pepper Pilaf",
        "ingredients": [
            "4 skinless chicken thighs ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "4 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "12 ounces uncooked white rice ADVERTISEMENT",
            "3 tomatoes, sliced ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "1 yellow bell pepper, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, boil chicken pieces in chicken stock, adding onion and garlic to stock before boiling. When chicken is cooked through, remove from stock and set aside. Add turmeric and stir in, then set stock aside.\nIn a large skillet, heat oil. Add mushrooms and saute for 1 minute. Add rice, stir for 2 minutes, then add stock. Let all simmer gently for 20 minutes. In the meantime, skin and slice tomatoes and add to pilaf mixture. Cut cooked chicken into bite size pieces and add to the skillet, along with the red, green and yellow bell peppers. Stir all together and simmer over low heat, stirring, until all liquid is absorbed and rice is separate and fluffy.\n",
        "picture_link": "Wrb.X84ZhApxrLpzjCN0WjmV6M2Y4L2"
    },
    {
        "title": "Screwdriver Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "3/4 cup orange juice ADVERTISEMENT",
            "1/2 cup vodka ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "3 tablespoons orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour Bundt pan.\nIn a large bowl, combine cake mix, pudding mix, 3/4 cup orange juice, vodka, oil and eggs. Beat until smooth, and pour into Bundt pan.\nBake at 350 degrees F (175 degrees C) for 45 minutes, or until toothpick inserted into middle of cake comes out clean. Cool 10 minutes in pan, then turn out onto wire rack. Glaze with orange glaze.\nOrange glaze: In a medium bowl, mix confectioners sugar with 3 tablespoons orange juice.\n",
        "picture_link": "Qt8B/X3o5YTUiYJbV1fH7cIKRRVak5q"
    },
    {
        "title": "Fresh Coconut Cake",
        "ingredients": [
            "Fresh Coconut Cake: ADVERTISEMENT",
            "2 cups coconut, drained and meat grated ADVERTISEMENT",
            "1 cup milk, or as needed ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs, room temperature ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Coconut Frosting: ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup butter, room temperature ADVERTISEMENT",
            "2 cups grated fresh coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch round baking pans. Reserve coconut juice and add enough milk to make 1 cup; set aside.\nIn a small bowl, sift together flour, baking powder, and salt. Set aside.\nBeat the butter, shortening, and 2 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg. Pour in the flour mixture alternately with the coconut-milk mixture, mixing until just incorporated. Fold in 2 cups grated coconut, mixing just enough to evenly combine. Pour the batter into prepared pans.\nBake in the preheated oven until the cake is golden and a tester inserted in the center comes out clean, 30 to 35 minutes. Cool completely on wire racks.\nTo Make Icing: In a saucepan, combine 1/4 cup water, 1 cup sugar, cream of tartar, and pinch of salt. Bring to a boil, stirring occasionally. Stop stirring once mixture is boiling. Cook until sugar syrup reaches soft ball stage on a candy thermometer (240 degrees F or 115 degrees C). If you don't have a thermometer, drop a little sugar syrup into a cup of cold water; when the syrup is ready, it will form a soft ball that holds its shape.\nWhile syrup is boiling, whip egg whites at medium-high speed until stiff but not dry. Carefully pour the hot syrup down the side of the bowl, beating constantly at high speed. Keep beating until mixture is cool to the touch.\nDrop butter, a tablespoon at a time, into egg white mixture, beating constantly. The mixture will deflate as butter is added; just keep mixing. When all of the butter is incorporated, frosting will fluff up again. Blend in vanilla.\nSpread buttercream between, around and on top of each layer. Sprinkle grated coconut on top of each frosted layer.\n",
        "picture_link": "9M.DQQvwD/qBOlPoDJyNZugrGqvM6JS"
    },
    {
        "title": "Banana Oat and Bran Cookies",
        "ingredients": [
            "2 ripe bananas, mashed ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup wheat bran ADVERTISEMENT",
            "1/4 cup rolled oats ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup low-fat plain yogurt ADVERTISEMENT",
            "1/8 cup real maple syrup ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat mashed bannanas, egg whites, brown sugar, maple syrup, yogurt, and cinnamon.\nCombine the remaining dry ingredients: flour, oats, wheat bran, salt and baking powder in a separate bowl. Use an electric mixer to combine dry ingredients with wet mixture.\nAdd in raisins, chopped prunes, and/ or nuts.\nRoll cookies into balls, place on a cookie sheet coated with cooking spray. Bake for 8-12 minutes until cookies are firm and dry.\n",
        "picture_link": "TeQc1ShgDyq8KY5aPEkmPcvzFLul.KO"
    },
    {
        "title": "Lemon Snowdrops",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup sifted confectioners' sugar ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "3 drops yellow food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degree C).\nCream 1 cup butter or margarine and 1/2 cup sifted confectioners' sugar. Add 2 cups flour, lemon extract, and 1/4 teaspoon salt; mix well.\nPlace about 1 inch apart on ungreased baking sheet. Bake 8 to 10 minutes or until lightly browned. Cool. Put together with filling. Roll in confectioners' sugar.\nTo Make Filling: Mix 1/2 cup sugar, 2 Tablespoons cornstarch, and dash of salt. Add 1/2 cup water, 2 Tablespoons butter or margarine, 2 teaspoons grated lemon rind, 3 Tablespoons lemon juice, and 3 drops of yellow food coloring. Bring to rolling boil, stirring constantly; boil and stir 1 minutes. Cool. Frost flat side of one cookie and put together with another cookie, sandwich-like. Roll in confectioners' sugar.\n",
        "picture_link": "M9zVq3cnzukCYYrNDHhd3j8IRcI6dWO"
    },
    {
        "title": "Cookie Pralines",
        "ingredients": [
            "1 cup packed dark brown sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C). Grease a baking sheet or line it with parchment paper.\nWhisk sugar, flour, and salt; set aside.\nIn separate bowl, beat egg white until stiff. Fold sugar mixture into stiffened egg white. Add pecans and vanilla. Stir gently.\nDrop by teaspoonfuls onto prepared baking sheet. Bake in preheated oven until browned, 25 to 30 minutes. Cool 5 minutes on baking sheet, then remove to wire rack to cool completely.\n",
        "picture_link": "/LvuadVG2f4RHLUK5zWxCxY9EWEJZHa"
    },
    {
        "title": "Lemon Drops",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBeat butter and shortening with an electric mixer on high for 30 seconds. Add sugar and lemon peel; beat until combined. Beat in milk.\nBeat in as much flour as you can, stir in remaining flour. Drop dough by rounded teaspoons 2 inches apart onto ungreased cookie sheets.\nBake for about 10 minutes or till edges are lightly browned. Cool on wire racks. Frost with Lemon Cream Cheese Frosting. Store, covered, in the refrigerator.\n",
        "picture_link": "CAGAAfzikUx2ZDqJLvirfpGzhfaxKA6"
    },
    {
        "title": "Three Cranberry Relish",
        "ingredients": [
            "1 pound cranberries ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen cranberry juice concentrate ADVERTISEMENT",
            "1 1/2 cups sweetened-dried cranberries ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine all ingredients in a 3 quart sauce pan and cook over medium heat until cranberries pop. Serve warm or cold. As it the relish sits it thickens up.\n",
        "picture_link": "HCAwEuev7G0y0lnqMsytP6wJvE4dio6"
    },
    {
        "title": "Coconut Meringues",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup shredded coconut ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nIn small bowl with mixer at high speed, beat egg whites and cream of tartar until soft peaks form. Beating at high speed, gradually sprinkle in sugar, 2 Tablespoons at a time, beating until sugar is completely dissolved. (Whites should stand in stiff glossy peaks.) With rubber spatula, fold in coconut and extract until mixed.\nDrop mixture by rounded teaspoonfuls onto large cookie sheet, about 1 inch apart.\nBake 1 hour or until dry. Remove to rack to cool.\n",
        "picture_link": "y3ejFyHbhME6slRUNyRzF.AGs/APS6."
    },
    {
        "title": "Apricot Almond Rugalach",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup unsalted butter, chilled ADVERTISEMENT",
            "4 ounces cream cheese, cold ADVERTISEMENT",
            "3/4 cup apricot jam ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup toasted and chopped almonds ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup chopped almonds ADVERTISEMENT",
            "1/3 cup sifted confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Pastry: Place the flour in a bowl. Cut the butter into the flour and blend until the mixture resembles coarse crumbs. Cut the cream cheese into small cubes and rub into the flour-butter mixture. Knead until the dough forms a ball. Cut dough in half, wrap each half in plastic wrap and refrigerate.\nTo Make Filling: Stir the apricot jam until it is spreadable. In a bowl combine the sugar with the chopped nuts and grated lemon peel.\nTo Assemble: On a lightly floured surface roll out each half of dough. The larger and thinner the circle the crisper the cookies will be. Each circle should be at least 9 inches in diameter. Spread each circle with jam and sprinkle with the almond mixture.\nCut each circle into twelve wedges. Roll each wedge up tightly from the outside edges. Turn edges slightly to form a crescent. Place crescents on a parchment lined baking sheet about 1 inch apart. Repeat until all cookies are shaped.\nPreheat oven to 350 degrees F (175 degrees C).\nBeat egg and brush cookies with beaten egg. Sprinkle with nuts. Bake cookies for 20 to 25 minutes or until golden brown. Let cookies cool on wire wracks then dust with sifted confectioners' sugar.\n",
        "picture_link": "V5Poxa3QjS0pQzaLOguY52zAa7xyvm2"
    },
    {
        "title": "Our Favorite Chocolate Cake",
        "ingredients": [
            "8 tablespoons shortening ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon instant coffee granules ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "5 cups confectioners' sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 13x9 inch cake pan.\nCream together the shortening and the white sugar. Add the melted chocolate and eggs, mix well.\nSift the flour with baking soda and salt. Add alternately with 1 cup milk to shortening mixture. Mix in 1 teaspoon vanilla. Pour batter into prepared pan.\nBake at 350 degrees F (175 degrees C) for 25 to 30 minutes or until a toothpick stuck into the center of the cake comes out clean. Once cool frost with Coffee Frosting.\nTo Make Frosting: Mix together instant or leftover coffee, 1/4 cup milk or cream, cocoa powder, butter, 1 1/2 teaspoons vanilla extract, and confectioners' sugar until of spreading consistency.\n",
        "picture_link": "qLTVgpyd.KA6s0T4eRDFZUqVYGQbM7a"
    },
    {
        "title": "Guava Cake",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup guava pulp ADVERTISEMENT",
            "1/2 cup guava nectar ADVERTISEMENT",
            "3 cups cake flour ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 1/4 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 13x9 inch pan.\nSift together flour, nutmeg, soda, cinnamon, and cloves.\nIn another bowl, mix together guava pulp and juice.\nIn another bowl, cream together butter and sugar. Add eggs, one at a time. Add flour mixture and guava mixture alternately to creamed mixture. Pour batter into prepared pan.\nBake at 350 degrees F (175 degrees C) for 30-35 minutes.\n",
        "picture_link": "RRd8YGSHEzSwp6Z6QwIPTWNJUTcIq0e"
    },
    {
        "title": "Cheese Biscuits II",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2/3 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "2 tablespoons chopped pimento peppers ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a large mixing bowl, combine the flour, sugar, baking powder, salt, and cream of tartar. Cut in the shortening with a pastry blender. Add the grated cheese, green bell pepper, and pimento; mix with a fork. Stir in milk and mix well.\nTurn the dough out onto a floured surface and knead 5 times. Roll out to a rectangular shape and cut into squares using a knife or pizza cutter. Place onto an ungreased baking sheet.\nBake for 15 minutes, or until browned.\n",
        "picture_link": "B4/jS0drihZbM/5I9N.I1.RTERuQVH."
    },
    {
        "title": "Pear-a-dise Muffins",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup canned pears, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Butter 15 muffin cups, or line with paper liner cups.\nMix together flours, soda, baking powder, salt, cinnamon, and nutmeg. Stir pears lightly into dry ingredients.\nIn a large bowl, combine yogurt, oil, honey, and egg. Mix in flour mixture until just combined. Spoon into muffin cups.\nBake for 20 to 25 minutes, or until done.\n",
        "picture_link": "hqoRyxx8i7OvWBlCj0sJvJ5zWvU266G"
    },
    {
        "title": "Chocolate Crinkles IV",
        "ingredients": [
            "1/2 cup vegetable oil ADVERTISEMENT",
            "4 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl beat eggs and sugar until light. Stir in the oil, vanilla, melted chocolate. Sift together the flour, baking powder and salt; stir into the chocolate mixture. Finally, stir in the chocolate chips. Refrigerate dough until firm. This will take anywhere from an hour in the freezer or overnight in the refrigerator.\nPreheat oven to 350 degrees F (175 degrees C). Shape dough into 1 inch balls. Roll them in confectioners' sugar until heavily coated. Place 2 inches apart on cookie sheets and bake for 11 to 13 minutes in the preheated oven. Cookies should be firm to touch.\n",
        "picture_link": "0Sw9ybLmIU5uFlGsfAHFsMyRLvFiYwG"
    },
    {
        "title": "Fourteen K Carrot Cake",
        "ingredients": [
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 (4.5 ounce) jars carrot baby food ADVERTISEMENT",
            "1/2 cup crushed pineapple, drained ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch cake pan.\nMix together the flour, baking powder, baking soda, salt, ground cinnamon. Stir in the white sugar. Add the oil and the eggs and mix well. Stir in the carrots, pineapple, chopped nuts, and the coconut. Pour batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 40 minutes or until a toothpick inserted in the center comes out clean.\n",
        "picture_link": "992yYk07/fpwECqGN95eS0fbCb2Y7i6"
    },
    {
        "title": "Floating Brownie",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/4 cups strong brewed coffee, boiling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together 3/4 cup sugar and butter. Add the milk and vanilla and mix. Sift together the flour, salt, baking powder, and 3 tablespoons cocoa, and add to the mixture.\nSpread into a greased 9 x 9 inch pan. The batter will be thick.\nCombine 1/2 cup white sugar, 1/2 cup brown sugar, and 1/4 cup cocoa. Sprinkle this over the batter.\nFinally, pour 1 1/4 cups boiling double strength coffee or water evenly over all. Bake at 350 degrees F (175 degrees C) to 375 degrees F (190 degrees C) for 30 minutes. Serves 6 to 8.\n",
        "picture_link": "XR6yxn86WN7CX0U8yq63k2csNpNtcX2"
    },
    {
        "title": "Mam's Black Cake",
        "ingredients": [
            "2 cups buttermilk ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup fresh blackberries ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 8 inch round cake layer pans.\nDissolve the baking soda in the buttermilk.\nCombine the sugar, 3 1/2 cups of the flour, ground nutmeg, ground cloves, ground cinnamon and the butter. Stir in the buttermilk mixture.\nToss the blackberries and raisins with the remaining 1/2 cup of flour to coat. Mix in the blackberries and the raisins into the batter and stir until evenly distributed. Pour batter into the prepared pans.\nBake at 350 degrees F (175 degrees C) for 25 to 35 minutes or until a toothpick inserted near the center of the cakes comes out clean.\n",
        "picture_link": "QtQVd/t240KztI.MavWM8R8b58EfOAm"
    },
    {
        "title": "Lemonade Frosting",
        "ingredients": [
            "2 cups heavy whipping cream ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 fluid ounces frozen pink lemonade concentrate, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large glass, metal , or ceramic bowl beat whipping cream, sugar, and pink lemonade until fluffy and peaks form. Use immediately.\n",
        "picture_link": "7s7zMvbaugn7FVZp15EndqXiS.7dn5W"
    },
    {
        "title": "Onion Bread I",
        "ingredients": [
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "3/4 cup warm water ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 1/2 teaspoons salt ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "6 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm the milk in a small saucepan until it bubbles, then remove from heat. Let cool until lukewarm. In a large bowl, stir together yeast, warm water, and 1 teaspoon sugar. Set aside to proof.\nAdd milk, 2 2/3 tablespoons sugar, salt, butter or margarine, flour, and soup mix to the yeast in the bowl. Combine until dough forms, and then turn out on a lightly floured surface. Knead until dough is elastic. Oil a large bowl. Place the dough in the bowl, and turn several times to coat. Cover the bowl with a damp cloth, and set aside in a warm place to rise for 30 minutes.\nDivide dough in half. Shape into loaves, and place into two greased 8 1/2 x 4 1/2 inch bread pans. Set aside to rise for 30 minutes.\nBake at 375 degrees F (190 degrees C) for 40 minutes. Loaf will sound hollow when done.\n",
        "picture_link": "KTiHxtcsO9KFAAKgffgDyzgXTVsFm7y"
    },
    {
        "title": "Brunch Cream Cheese Muffins",
        "ingredients": [
            "1/2 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "1/8 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Oil bottoms only of medium muffin tins.\nMix together cream cheese, 1/4 cup white sugar, lemon peel, vanilla, and 1 egg with an electric mixer. Set filling aside.\nIn a large bowl, mix together flour, 1/3 cup white sugar, baking powder, and salt until well blended. Beat remaining egg, and stir in milk and oil; pour into flour mixture, and stir until moistened. Fill muffin cups about 1/2 full. Spoon 1 teaspoon filling onto batter. Top with batter to 3/4 full.\nBake 30 to 35 minutes. Don't brown these; muffins should be light in color. Roll while still hot in sifted confectioners' sugar.\n",
        "picture_link": "6JkIbPA6h1sMjJbmPh/BPRFJGq35WpG"
    },
    {
        "title": "Passover Brownies",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "6 tablespoons matzo meal ADVERTISEMENT",
            "1 cup cocoa powder ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate, melted ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1/8 teaspoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8 inch baking pan.\nIn a medium-size mixing bowl, blend eggs, sugar, and butter. Mix in matzo meal, cocoa powder and walnuts (if desired). Transfer batter to prepared baking pan.\nBake at 350 degrees F (175 degrees C) for 30 minutes.\nIn a small mixing bowl, blend chocolate, butter or margarine and water. Spread over cooled brownies.\n",
        "picture_link": "4naVw8fMJ1uoXXbEJZ2F0uX4B0/4kAO"
    },
    {
        "title": "Chicken Gravy Enchilada Casserole",
        "ingredients": [
            "4 cups diced skinless, boneless chicken breast meat ADVERTISEMENT",
            "4 cups chicken gravy ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 (7 ounce) can diced green chiles ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "12 (6 inch) corn tortillas ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet combine chicken, gravy, water, onion, celery, chile peppers, garlic salt, salt and pepper. Stir together to mix. Cover skillet and simmer over low heat for 1 to 2 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a 11x14 inch baking dish layer 6 tortillas, then 1/2 of the chicken mixture, then 1/2 of the cheese. Repeat layers. Bake in the preheated oven for 30 to 40 minutes or until cheese is melted and bubbly.\n",
        "picture_link": "3.Tha.my/CroBm1Bm4albZaTHqo9YV6"
    },
    {
        "title": "Richest Ever Chocolate Pound Cake",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup hot water ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Separate the eggs and beat the egg whites until stiff, and set aside. In a large bowl, cream the butter with the sugar. Melt the chocolate in the hot water. Beat in the egg yolks, then the melted chocolate, buttermilk, and vanilla.\nIn a bowl, stir together the flour, baking soda, and salt. Beat into the chocolate mixture. Stir in about 1/3 of the egg whites to lighten the batter and then fold in the rest gently but thoroughly.\nTurn the batter into a greased and floured tube pan. Bake in a preheated 350 degrees F (175 degrees C) oven for 1 hour, or until the cake tests done with a toothpick. Let cool on a rack. Makes 16 servings.\n",
        "picture_link": "1x4xqUxZPiwAAF36njwwxuODFD2onwm"
    },
    {
        "title": "Mrs. Kurtz's Banana Bread",
        "ingredients": [
            "1/4 cup margarine, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups mashed bananas ADVERTISEMENT",
            "1/4 cup sour milk ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter or margarine, sugar, and salt. Mix in egg. Stir in bananas and milk. Stir in flour and baking soda with a few swift strokes; do not overbeat. Spread batter into a greased and floured 9 x 5 inch loaf pan.\nBake at 325 degrees F (165 degrees C) for 45 to 60 minutes, or until a tester inserted in the center comes out clean.\n",
        "picture_link": "cbggLyHHc5JI5VguFitKzRgsOkDgUm2"
    },
    {
        "title": "Seven Grain Bread I",
        "ingredients": [
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "2 1/4 cups bread flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 tablespoons nonfat dry milk powder ADVERTISEMENT",
            "1 1/2 tablespoons margarine ADVERTISEMENT",
            "1 1/3 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3/4 cup seven grain cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the bread machine pan in the order suggested by the manufacturer.\nSelect the Medium Dark Crust setting, and press Start.\n",
        "picture_link": "bCFMH.LGPz8gBmaBjaUQ5m682Lt8JI2"
    },
    {
        "title": "Tomato Pesto Batter Bread",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 cup warm water (110 degrees F) ADVERTISEMENT",
            "1 cup coarsely chopped fresh basil ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mixing bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.\nPlace the basil leaves and the olive oil in a blender or food processor and puree until smooth.\nIn a large mixing bowl, combine the flour with the salt. Add the yeast mixture, basil mixture and sun-dried tomatoes; beat together until well combined, about 3 minutes. Cover bowl with a damp cloth and let rise in a warm place until doubled in volume, about 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nLightly grease a 2 quart casserole dish or 5x9 inch loaf pan. Gently remix the batter with about 20 strokes of a wooden spoon and pour into the prepared pan. Let rise in a warm place until doubled in volume, about 30 minutes.\nBake at 375 degrees F (190 degrees C) for 40 to 45 minutes, or until the bottom of the loaf sounds hallow when tapped. Remove loaf from pan, place on a wire rack to cool and brush with melted butter.\n",
        "picture_link": "5yvfpf2apu5yKpLWZis27Qn7B0.4DOK"
    },
    {
        "title": "Mango Cake",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup mango puree ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9 x 5 inch loaf pan.\nCream butter or margarine and sugar till light and fluffy. Add eggs and beat well. Mix together flour and baking soda; blend into creamed mixture. Fold in buttermilk, vanilla, mango puree, and chopped nuts. Pour batter into prepared pan.\nBake for 40 to 50 minutes, or until done.\n",
        "picture_link": "u1rruoy.EfKFcw0vYirbEUFajrkzpl6"
    },
    {
        "title": "Chocolate Bar Pie II",
        "ingredients": [
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "6 (1.45 ounce) bars milk chocolate with almonds, coarsely chopped ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chopped chocolate bars, marshmallows, milk, and salt in the top of a double boiler. Heat and stir until mixture is melted and smooth. Remove from heat and allow to cool, stirring occasionally.\nIn a medium bowl, beat cream until soft peaks form. Fold cream into cooled chocolate mixture. Pour mixture into graham cracker crust. Chill before serving. This pie is also delicious frozen.\n",
        "picture_link": "7lmt4NynLiwedtz3EROquChsB0khxCm"
    },
    {
        "title": "Grilled Pineapple Chicken Sandwiches",
        "ingredients": [
            "4 slices canned pineapple ADVERTISEMENT",
            "1 tablespoon honey mustard ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "2 sandwich rolls, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grill or broil the chicken breasts and pineapple slices, brushing occasionally with honey mustard. Cook the chicken breasts until no longer pink in the center and the juices run clear. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Serve the chicken on sandwich rolls, topped with pineapple slices and red bell pepper rings.\n",
        "picture_link": "rSh0F/eW7Cx3t8r.0Pw1XTBEm8eUgS2"
    },
    {
        "title": "Christmas Fudge",
        "ingredients": [
            "3 cups white sugar ADVERTISEMENT",
            "2/3 cup heavy cream ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "1 (11 ounce) package white chocolate chips ADVERTISEMENT",
            "red food coloring, as desired ADVERTISEMENT",
            "green food coloring, as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13 inch pan.\nIn a medium saucepan combine sugar, cream and butter. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface.\nStir in marshmallow creme and white chocolate chips; mix well. Reserve 2 separate 1/2 cups of mixture and set aside.\nTo one of the reserved 1/2 cups mixture add red food coloring until desired shade of red is achieved. To the other 1/2 cup of mixture add green food coloring until desired shade of green is achieved.\nPour white mixture into prepared pan. Pour dots of both the red and green mixtures across the top. Using a toothpick or knife, swirl colors throughout the white.\nChill for 2 hours and cut into 2 inch squares.\n",
        "picture_link": "09Un.TxP8KiSEQdT.AsoDGaRAVqJATq"
    },
    {
        "title": "Hot and Sour Shrimp Soup",
        "ingredients": [
            "4 ounces thin egg noodles ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 large tomato, cut into wedges ADVERTISEMENT",
            "1 cup fresh pineapple chunks ADVERTISEMENT",
            "1 stalk celery, sliced ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 tablespoons fresh lime juice ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper ADVERTISEMENT",
            "1/2 cup bean sprouts ADVERTISEMENT",
            "1 green onion, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMeanwhile, in a large saucepan, heat oil over medium heat. Cook mushrooms and garlic in oil until soft (do not brown). Stir in tomato, pineapple, celery and sugar and cook until tomatoes begin to soften. Stir in chicken broth and water; bring to a boil. Reduce heat and stir in lime juice and soy sauce; simmer 5 minutes. Stir in shrimp and red pepper and simmer 3 minutes more, until shrimp are pink. Stir in bean sprouts, onion and reserved noodles. Heat through and serve.\n",
        "picture_link": "IyuspEKRNXrrftvwlaLpy3xO2KwUinS"
    },
    {
        "title": "Chewy Oatmeal Cherry Toffee Crisps",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "1 cup dried cherries ADVERTISEMENT",
            "1 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "1 cup toffee baking bits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the flour and baking soda; set aside. In a large bowl, cream together the butter, brown sugar and white sugar until smooth. Beat in the egg and vanilla. Gradually stir in the sifted mixture, then mix in the oats, cherries, chocolate chips and toffee bits until evenly distributed. Divide the dough in to 3 portions and form them into logs, about 2 inches in diameter. wrap in waxed paper and refrigerate or freeze until firm.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets or line them with parchment paper. Slice dough logs into 3/4 inch thick slices. Place the cookies 2 inches apart onto the prepared cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "Qx9ATmJlLQRnOefM4Xf2232pOEtBVzO"
    },
    {
        "title": "Chickpea and Tomato Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained and rinsed ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 cube chicken bouillon, crumbled ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, cook garlic in oil 1 minute. Stir in tomatoes and cook 2 minutes. Stir in garbanzo beans, water, bouillon cube, rosemary, salt and pepper. Simmer, covered, 10 minutes.\n",
        "picture_link": "Uq/n5iZ1v0G0Yvv5hbpaZKuU/X5N4VG"
    },
    {
        "title": "Vinegar Pickled Carrots",
        "ingredients": [
            "1 cup distilled white vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "8 large carrots, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, mix distilled white vinegar, white sugar, salt, pepper and water. Bring the mixture to a boil. Remove from heat and allow to cool slightly.\nPlace the carrots in sterile containers. Cover with the vinegar solution. Seal the containers, refrigerate and marinate carrots 12 hours or overnight before serving.\n",
        "picture_link": "GkY9dlsNEsdOzPwFU/jv/qe719Sm3va"
    },
    {
        "title": "Raw Candy",
        "ingredients": [
            "1 cup raisins ADVERTISEMENT",
            "1 cup walnuts ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor combine raisins and walnuts. Process until they form a sticky ball.\nCoat hands with oil and roll mixture into balls the size of large marbles, then coat with sliced almonds.\nCover and refrigerate for up to 3 days.\n",
        "picture_link": "kedbT6JkRE2iKTlIYFOG5VSTpYM6q76"
    },
    {
        "title": "Honeydew Blueberry Soup",
        "ingredients": [
            "1 honeydew melon ADVERTISEMENT",
            "1 pint blueberries ADVERTISEMENT",
            "6 oatmeal cookies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the melon from the rind and into chunks. Puree until smooth in a food processor or blender. Pour into a large bowl and stir blueberries into pureed melon. Chill until quite cold.\nTo serve, ladle soup into individual bowls and crumble an oatmeal cookie over each serving.\n",
        "picture_link": "dZzoRlqu37F1D6WH8Z1yNoi5pJ6vstW"
    },
    {
        "title": "Apple Fritters II",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 1/2 teaspoons grated lemon zest ADVERTISEMENT",
            "2 large apples ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix flour, salt and sugar. Pour in milk, a little at a time, stirring to make a smooth batter. Beat in eggs and lemon zest.\nCore and peel apples, then cut in wedges. Cut each wedge crosswise into thin slices. Toss apples in batter to coat.\nIn a large skillet over medium heat, heat oil and butter. Drop fritter mixture by spoonfuls into pan and cook, turning once, until golden brown. Plate and sprinkle with sugar. Serve warm.\n",
        "picture_link": "HyZgHCH.ouFGui1GHwEJ3bSyAMbYl5i"
    },
    {
        "title": "Toads in the Hole II",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "8 links pork sausage ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nSpread oil in the bottom of a 9 inch square baking dish. Sift flour into a medium bowl, then beat in eggs. Gradually stir in milk, water, salt and pepper. Beat well.\nPlace sausages in baking dish and pour batter mixture over all. Bake in the preheated oven for 25 to 30 minutes, or until golden and risen.\n",
        "picture_link": "HitnzCERLqLr2pWdaDuiOTJnaNeMYYS"
    },
    {
        "title": "Pumpkin Butter IV",
        "ingredients": [
            "1 (29 ounce) can solid pack pumpkin puree ADVERTISEMENT",
            "1 tablespoon pumpkin pie spice ADVERTISEMENT",
            "1 (2 ounce) package dry pectin ADVERTISEMENT",
            "4 1/2 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix solid pack pumpkin puree, pumpkin pie spice and dry pectin in a medium saucepan over high heat. Bring to a boil. Mix in sugar all at once. Stirring constantly, return to a full boil and boil 1 minute. Remove from heat. Transfer immediately to sterile containers. Seal and chill in the refrigerator until serving.\n",
        "picture_link": "ojO6c4Ge6DkodaKe2L390fymbYrCkju"
    },
    {
        "title": "Angela's Oriental Chicken Noodle Soup",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 (3 ounce) package chicken flavored ramen noodles ADVERTISEMENT",
            "2 cups chopped cooked chicken breast ADVERTISEMENT",
            "2 leaves bok choy, sliced ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, bring water to a boil. Break up block of noodles and stir into pot, reserving seasoning packet. Stir in chicken, bok choy and carrot. Bring to a boil again, then reduce heat and simmer 3 minutes. Stir in contents of seasoning packet and sesame oil.\n",
        "picture_link": "ZernARq4tHRPsv/pzatPtY4x2.rJhcq"
    },
    {
        "title": "Rhubarb Torte",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "3 1/2 cups chopped rhubarb ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C.)\nIn a large bowl, combine 1 cup flour, margarine and confectioners' sugar. Mix together until it forms a ball. Press into the bottom and sides of a 9 inch square pan. Bake in the preheated oven for 20 minutes, or until golden brown.\nIn a saucepan, combine 1 1/2 cup sugar, 3 tablespoons flour, yolks and milk. Stir together, then add chopped rhubarb. Cook, stirring constantly, until thickened. Pour into hot crust.\nIn a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add 1/4 cup sugar, continuing to beat until stiff peaks form. Spread meringue over rhubarb filling, covering completely.\nBake in the preheated oven for 10 to 15 minutes, or until golden brown.\n",
        "picture_link": "gsd1UKKRCVCxdtNLTNAZy8qWuPf3PNm"
    },
    {
        "title": "Mari's Chicken and Pasta",
        "ingredients": [
            "12 ounces fettuccini pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 cup frozen green peas ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 1/2 cups chopped fresh tomato ADVERTISEMENT",
            "2 green onions, minced ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add fettuccini pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a skillet over medium heat saute chicken and garlic in oil until brown and cooked thoroughly. Add chicken broth, white wine, peas, and parsley; bring to a boil. Reduce heat and simmer for 15 minutes.\nRemove from heat and add tomatoes, onions and cayenne pepper. Toss sauce with cooked pasta. Serve topped with Romano cheese and more sauce.\n",
        "picture_link": "ZCViHa7JvP3Ht4BY7f3.5GnR/aBGZJS"
    },
    {
        "title": "Yummy Spinach Dip",
        "ingredients": [
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1 (1 ounce) package dry vegetable dip mix ADVERTISEMENT",
            "1 (8 ounce) can water chestnuts, drained and chopped ADVERTISEMENT",
            "2 teaspoons prepared Dijon-style mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together chopped spinach, sour cream, mayonnaise, green onions, dry vegetable dip mix, water chestnuts and prepared Dijon-style mustard. Chill in the refrigerator 8 hours, or overnight, before serving.\n",
        "picture_link": "K9uKAwteNxWU0z9yUG9KECLqAmPLHT."
    },
    {
        "title": "Spicy Bagel Bites",
        "ingredients": [
            "1/4 teaspoon grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1/8 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 plain bagels, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a small bowl, mix the Parmesan cheese, chili powder, oregano, cumin, garlic powder, onion powder, salt and pepper.\nPlace the bagel slices on a medium cookie sheet and sprinkle with the seasoning mixture.\nBake in the preheated oven 5 minutes, or until slightly crisp and lightly browned.\n",
        "picture_link": ".iFGjkGAOXO2B.ec.KHjsfsNp.eW8R2"
    },
    {
        "title": "Kalamata Caviar",
        "ingredients": [
            "8 ounces whole, pitted kalamata olives ADVERTISEMENT",
            "1 (4 ounce) package feta cheese ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "4 cloves garlic, peeled ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, blend kalamata olives, feta cheese, pecans, garlic and olive oil. Adjust amount of olive oil as needed to attain a pesto-like consistency.\n",
        "picture_link": "JXg8s61nhd61xCxF66yqvMKuFgv7xum"
    },
    {
        "title": "Green Beans With a Twist",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "2 (14.5 ounce) cans green beans, drained ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "1 dash black pepper ADVERTISEMENT",
            "1 dash garlic powder ADVERTISEMENT",
            "1 dash onion powder ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place egg in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.\nIn a large bowl combine eggs, green beans, mayonnaise, lemon juice, Worcestershire sauce, horseradish, pepper, garlic powder, onion powder and parsley.\nServe chilled.\n",
        "picture_link": "N7x4Jf17VTQzdEVEuEOGUNYMSBABWcW"
    },
    {
        "title": "Mexican Corn Chowder",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 1/2 cups fresh corn kernels ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "2 boneless chicken breast halves, cooked and cubed ADVERTISEMENT",
            "2 teaspoons chopped green chile pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, melt butter. Cook celery, onion and carrot in butter until onion begins to soften. Stir in garlic, oregano, salt and pepper and cook 2 minutes more. Stir in corn, chicken broth, cooked chicken and chile pepper and let simmer until heated through. Stir in milk and heat gently just before serving.\n",
        "picture_link": "la.iem4o9qV0BElIytzHJiZnMqUtLv6"
    },
    {
        "title": "Cheesy Vegetables and Noodles",
        "ingredients": [
            "1 (8 ounce) package rigatoni pasta ADVERTISEMENT",
            "1 (10 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "2 cups cubed processed cheese ADVERTISEMENT",
            "1/2 teaspoon soy sauce ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nCook frozen vegetables according to package directions.\nIn a small saucepan combine processed cheese, soy sauce and garlic salt. Stir over medium heat until cheese is melted.\nCombine pasta, vegetables and cheese sauce.\n",
        "picture_link": "r3DJBBrBb5l.RHZqpdR8581KkDSv8Hy"
    },
    {
        "title": "Karen's Spring Mix Salad",
        "ingredients": [
            "1 (10 ounce) package mixed salad greens ADVERTISEMENT",
            "1 ripe avocado - peeled, pitted and chopped ADVERTISEMENT",
            "1 ripe tomato, chopped ADVERTISEMENT",
            "1 (6 ounce) can black olives, drained ADVERTISEMENT",
            "6 Greek pepperoncini peppers ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 teaspoons white vinegar ADVERTISEMENT",
            "2 teaspoons garlic salt ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "3 ounces grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the mixed greens, avocado, tomato, olives and pepperoncini peppers. Set aside.\nIn a small bowl, whisk together the oil, vinegar, garlic salt, oregano and basil. Pour over the salad mixture and toss to coat. Sprinkle with parmesan and serve.\n",
        "picture_link": "FrdDMTmEzhdOkM3gWrdDc5oPQERWDMW"
    },
    {
        "title": "Apple Butter Bread",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 cups apple butter ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 8x4x2-inch loaf pan.\nMix flour, baking soda, baking powder, salt, nutmeg, and cloves in a bowl.\nBeat the butter and sugar with an electric mixer in a separate large bowl until smooth. Add the egg and apple butter; continue beating until smooth. Mix in the flour mixture until just incorporated. Fold in the raisins and walnuts; mixing just enough to evenly combine. Pour into prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 40 to 50 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "XbRGKErbFQ5z3oTQt27kHaor04anLDG"
    },
    {
        "title": "Really Simple Rice",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup long-grain white rice ADVERTISEMENT",
            "1/2 small onion, finely diced ADVERTISEMENT",
            "2 cups low-sodium chicken broth ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a non-stick saucepan over medium-high heat nearly to smoking. Cook and stir rice in the hot oil quickly to toast the rice, 2 to 3 minutes. Stir the onion into the rice; cook and stir 1 minute more. Pour chicken broth over the rice mixture, season with garlic salt, and bring to a boil; reduce heat to low, place a cover on the saucepan, and cook until the broth is absorbed and the rice is tender, about 20 minutes. Remove from heat and allow to rest 5 minutes before lifting the lid.\n",
        "picture_link": "LDfD1j0kQQggLc1iqEmT9zOvCfAyUEi"
    },
    {
        "title": "Grandpa's Oyster Stew",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "2 shallots, minced ADVERTISEMENT",
            "1/2 cup dry sherry or dry white wine ADVERTISEMENT",
            "24 freshly shucked oysters, oyster liquor reserved ADVERTISEMENT",
            "1 1/2 cups whole milk ADVERTISEMENT",
            "1 1/2 cups heavy cream ADVERTISEMENT",
            "2 tablespoons chopped fresh flat-leaf parsley ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "1 pinch sweet paprika ADVERTISEMENT",
            "1 cup oyster crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir butter and garlic in stockpot over medium heat until butter begins to brown. Remove garlic and discard.\nStir shallots into browned butter. Cook and stir until translucent, 5 to 7 minutes.\nPour sherry over shallots in the stockpot and bring to a boil while scraping any browned bits off of the bottom of the pot. Simmer until liquid is reduced by half, 3 to 5 minutes.\nPour reserved oyster liquor, milk, and cream into the stockpot; bring mixture to a simmer. Reduce heat to medium-low and stir in oysters; cook until oyster edges begin to ruffle, about 3 minutes. Remove from heat.\nStir in parsley; season with sea salt to taste. Ladle into bowls and garnish with sweet paprika and oyster crackers.\n",
        "picture_link": "spKMxu0Qxnnq0U2V0u8ogl1S3av8LNe"
    },
    {
        "title": "Big D's Mushroom and Cheese-Stuffed Venison Loaf",
        "ingredients": [
            "2 pounds ground venison ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (6 ounce) box dry instant stuffing mix ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1/4 cup spicy tomato-vegetable juice cocktail (such as V8®) (optional) ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard ADVERTISEMENT",
            "10 ounces fresh morel mushrooms ADVERTISEMENT",
            "8 slices sharp Cheddar cheese ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1/2 cup barbeque sauce (such as Sweet Baby Ray's®) ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese (optional) ADVERTISEMENT",
            "1 pinch salt and ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground venison, onion, stuffing mix, eggs, Worcestershire sauce, ketchup, vegetable juice cocktail, and yellow mustard in a large bowl with your hands until thoroughly combined.\nPlace half the venison mixture into a 9x11-inch casserole dish; pat the meat mixture into an even layer.\nSpread morel mushrooms over meat; top with Cheddar cheese slices.\nSpread remaining half of venison mixture over cheese slices; pat down to form an even layer and press the edges together to seal in the mushrooms and cheese.\nArrange bacon slices over the meatloaf; spread barbeque sauce evenly over the loaf. Sprinkle with Parmesan cheese.\nBake in the preheated oven until the meatloaf is browned and an instant-read meat thermometer inserted into the thickest part of the loaf reads 160 degrees F (70 degrees C), about 1 hour and 15 minutes.\nDrain excess grease and allow loaf to stand for 5 minutes before serving.\n",
        "picture_link": "9CoAr5mvLt50r6CZmPtPeLtjRmHi5S6"
    },
    {
        "title": "Maple Pecan Granola",
        "ingredients": [
            "4 cups old-fashioned oats ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup ground flax seed ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/3 cup canola oil ADVERTISEMENT",
            "2/3 cup pure maple syrup ADVERTISEMENT",
            "1 teaspoon maple flavoring ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 300 degrees F (150 degrees C).\nLine a baking sheet with parchment paper.\nMix oats, pecans, walnuts, flax seed, and cinnamon in a large bowl.\nStir canola oil, maple syrup, maple flavoring, and salt together in a small bowl; pour over the oat mixture and stir to coat evenly.\nSpread the resulting mixture evenly onto the prepared baking sheet.\nBake in the preheated oven until lightly browned, about 40 minutes.\nSet granola aside to cool completely before breaking into chunks. Store in an air-tight container.\n",
        "picture_link": "Tuoq0iSJ2Q7OAW7XT656GOo3tdSL04m"
    },
    {
        "title": "Chocolate Tapioca Pudding",
        "ingredients": [
            "3 cups milk ADVERTISEMENT",
            "3 tablespoons quick-cooking tapioca ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup chopped chocolate ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder (optional) ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Milk the milk, tapioca, egg, and sugar together in a saucepan until the sugar has dissolved; allow to stand for 5 minutes.\nWhisk in the chocolate and cocoa powder.\nPlace over medium heat, bring to a boil, whisking constantly, and let boil for 2 minutes.\nRemove from heat and whisk in the vanilla extract. Allow to cool for 20 minutes. Serve warm or chilled.\n",
        "picture_link": "Sl/iHrFQ4CJV4pDBkK.1aPBeIHatYli"
    },
    {
        "title": "American Breakfast Casserole",
        "ingredients": [
            "1 (1 pound) package bacon, diced ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "6 eggs, lightly beaten ADVERTISEMENT",
            "4 cups frozen Southern-style hash brown potatoes, thawed ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups small curd cottage cheese ADVERTISEMENT",
            "1 1/4 cups shredded Swiss cheese ADVERTISEMENT",
            "1 cup chopped green bell pepper, or to taste (optional) ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook and stir bacon and onion in a skillet over medium heat until the bacon is crisp, 10 to 15 minutes. Drain grease, reserving the drippings.\nGrease a 9x13-inch baking dish with the reserved bacon grease.\nCombine the cooked bacon and onion, eggs, hash brown potatoes, Cheddar cheese, cottage cheese, Swiss cheese, bell pepper, and green chilies in the prepared baking dish; stir to combine.\nBake in preheated oven until the eggs are set firm, 35 to 40 minutes.\nLet casserole cool 10 minutes before cutting to serve.\n",
        "picture_link": "lS8fugIDDCt..bSDNsdSZA2xOVDoimG"
    },
    {
        "title": "Peach and Blackberry Cobbler",
        "ingredients": [
            "4 cups peeled and sliced fresh peaches ADVERTISEMENT",
            "1 cup fresh blackberries ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix peaches, blackberries, 1/4 cup sugar, cinnamon, and lemon juice in a bowl.\nPour butter into a 9x13-inch glass baking dish and evenly coat the bottom and sides. Whisk flour, 1 cup sugar, baking powder, and salt in a bowl; mix in milk, stirring just to moisten dry ingredients. Pour batter into prepared baking dish and distribute fruit mixture evenly over the batter.\nBake in the preheated oven until cobbler is golden brown, about 45 minutes.\n",
        "picture_link": "5lInrdBw/vS.2WO4D0KKEdfAHgw4vbe"
    },
    {
        "title": "Mystery Ingredient Wild Blueberry Pie",
        "ingredients": [
            "1 recipe pastry for a double-crust 9-inch pie, divided ADVERTISEMENT",
            "5 cups fresh blueberries (preferably wild) ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or more to taste ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1/4 cup butter, cut into small pieces ADVERTISEMENT",
            "1 tablespoon milk (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Press 1 pie crust pastry into the bottom and sides of a 9-inch pie pan.\nStir blueberries, sugar, flour, and cinnamon together in a large bowl. Add almond extract; stir to coat. Pour blueberry mixture into the prepared pie crust. Dot the blueberry mixture with butter pieces. Top with second pie crust, crimping the two crusts together. Brush top crust with milk. Make a few incisions with a knife into the top crust to allow steam to escape during baking. Wrap the edges of the pie with aluminum foil to avoid burning.\nBake in the preheated oven for 25 minutes. Remove foil, and continue baking until blueberry filling is bubbling and crust is browned, 20 to 25 more minutes. Cool before serving.\n",
        "picture_link": "CgtG3ver/cg1WOFe5.3INBZNEqVU07q"
    },
    {
        "title": "Scott's Pico de Gallo",
        "ingredients": [
            "3 large tomatoes, diced ADVERTISEMENT",
            "1 white onion, diced ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "6 limes, juiced ADVERTISEMENT",
            "1 tablespoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss tomatoes, white onion, and cilantro together in a large bowl. Pour lime juice over tomato mixture; mix to coat. Season with salt. Chill completely before serving.\n",
        "picture_link": "XUG0dlWM43QyM3yJWmHm1IQqKuhLItC"
    },
    {
        "title": "Cheesy Chorizo Frittata",
        "ingredients": [
            "1/4 pound chorizo, crumbled ADVERTISEMENT",
            "1 (6 ounce) package baby spinach leaves ADVERTISEMENT",
            "2 cups cherry tomatoes, halved ADVERTISEMENT",
            "4 green onions, sliced ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 1/2 cups KRAFT Shredded Pepper Jack Cheese with a TOUCH OF PHILADELPHIA, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Cook chorizo in large ovenproof skillet on medium-high heat until done, stirring frequently. Remove chorizo from skillet, reserving drippings in skillet. Set chorizo aside. Add spinach to skillet; cook 2 min. or just until wilted, stirring frequently. Stir in tomatoes and onions. Remove from heat.\nWhisk eggs and milk in medium bowl until blended; stir in 1 cup cheese. Add to ingredients in skillet; stir just until blended. Top with remaining cheese.\nBake 25 min. or until knife inserted in center comes out clean.\n",
        "picture_link": "hcAwgfdrgyYk80LDIAF9QUApkgBtJY."
    },
    {
        "title": "No Mayo Easy Pasta Salad",
        "ingredients": [
            "1 (12 ounce) package rotini pasta ADVERTISEMENT",
            "1 (12 ounce) package tri-color rotini pasta ADVERTISEMENT",
            "6 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1 cucumber, chopped ADVERTISEMENT",
            "1/2 cup chopped purple onion ADVERTISEMENT",
            "1 (16 ounce) bottle ranch dressing ADVERTISEMENT",
            "1 (16 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook the rotini and tri-color rotini at a boil until tender yet firm to the bite, about 8 minutes; drain. Rinse the pasta with cold water until cool; drain.\nCombine pasta, tomatoes, cucumber, and purple onion in a large bowl.\nStir ranch dressing and Italian-style salad dressing together in a separate bowl; spread over the pasta mixture and stir to coat.\n",
        "picture_link": "X9mdzkfQSt.zCyN3xCaRrgIWKlI4.ee"
    },
    {
        "title": "Nichole's Chicken Cauliflower Soup",
        "ingredients": [
            "5 medium red potatoes, cubed ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "3 carrots, peeled and diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 garlic cloves, minced ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "2 cups skim milk ADVERTISEMENT",
            "1 head cauliflower, cut into small florets ADVERTISEMENT",
            "2 cooked chicken breasts, shredded ADVERTISEMENT",
            "1 cup grated, reduced fat Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease a baking sheet.\nPlace potatoes on prepared baking sheet. Bake potatoes in the preheated oven until tender, about 30 minutes.\nHeat olive oil in a large soup pot over medium heat. Stir celery, carrots, onion, and garlic into the hot olive oil; season with salt and pepper. Cook and stir until vegetables soften, about 10 minutes.\nStir chicken broth and milk into vegetable mixture; bring to a boil. Add cauliflower to vegetables and chicken broth mixture. Reduce heat to medium and cook until cauliflower is tender, about 10 minutes.\nStir potatoes, chicken, and Parmesan cheese into vegetables and broth; simmer until chicken is heated and cheese is melted, 20 minutes.\n",
        "picture_link": "wqbIhwjaWUvGA/cHygjazqk/Buo6CR6"
    },
    {
        "title": "Maple Cinnamon Ham Glaze",
        "ingredients": [
            "1/4 cup packed dark brown sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir brown sugar and cinnamon together in a bowl until well combined. Pour in maple syrup and stir until smooth.\n",
        "picture_link": "qHI.GuO/krlog88QWNeTYCfDY86sa5G"
    },
    {
        "title": "Sweetest Southern Sweet Potato Pie",
        "ingredients": [
            "2 sweet potatoes ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup evaporated milk ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/4 cup dark corn syrup ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon apple pie spice ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 (9 inch) unbaked deep dish pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place sweet potatoes in an aluminum foil-lined baking dish.\nBake in preheated oven until potatoes are easily pierced with a fork and skin loosens, 30 to 45 minutes. Allow potatoes to cool.\nPeel potatoes and mash with a potato masher in a large bowl. Beat sugar, evaporated milk, butter, corn syrup, eggs, flour, vanilla extract, apple pie spice, and salt into mashed sweet potatoes with an electric mixer until fluffy, about 5 minutes. Pour sweet potato batter into pie crust. Excess batter can be reserved for another use.\nBake in preheated oven until pie is set and crust is browned, 45 to 50 minutes.\n",
        "picture_link": "OEEpAP9PHTMt2Ds.QUeyDjOPMF2v7ya"
    },
    {
        "title": "Chicken Broccoli Salad",
        "ingredients": [
            "8 cups broccoli florets ADVERTISEMENT",
            "3 cooked skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup crumbled cooked bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine broccoli, chicken, walnuts, and green onions in a large bowl.\nWhisk mayonnaise, vinegar, and sugar together in a bowl until well blended.\nPour mayonnaise dressing over broccoli mixture; toss to coat.\nCover and refrigerate until chilled, if desired. Sprinkle with crumbled bacon to serve.\n",
        "picture_link": "7sdzVNpANiAsFTzW/syjFuJOvr23Doe"
    },
    {
        "title": "Curried Cottage Fries",
        "ingredients": [
            "6 potatoes, cut into wedges ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons shredded Parmesan cheese ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking sheet.\nPlace potatoes, vegetable oil, Parmesan cheese, curry powder, paprika, salt, and garlic powder in a resealable plastic bag; shake to coat. Spread seasoned potatoes over prepared baking sheet.\nBake in preheated oven until tender, about 20 minutes.\n",
        "picture_link": "6.4QPmOsY4y1BVjU4l9batYOoc98N4S"
    },
    {
        "title": "Bacon Jam",
        "ingredients": [
            "2 pounds bacon, cut into 1-inch pieces ADVERTISEMENT",
            "1/2 cup bacon drippings ADVERTISEMENT",
            "2 large yellow onions, cut into very thin slivers ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup bourbon whiskey ADVERTISEMENT",
            "1 cup brewed coffee ADVERTISEMENT",
            "1/2 cup sherry vinegar ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir bacon in a large saucepan over medium-high heat until bacon starts to brown, about 10 minutes; drain grease, retaining 1/4 of the drippings. Stir onions into bacon and drippings; cook and stir until soft, about 10 minutes. Stir in brown sugar; cook until onions are sticky and browned, about 5 more minutes. Mix in garlic, cayenne pepper, cinnamon, and nutmeg. Cook and stir until garlic is soft, about 5 minutes.\nMix in bourbon whiskey, coffee, sherry vinegar, and maple syrup. Bring to a boil, reduce heat to low, and cook until the bacon jam is thickened but not completely dry, stirring occasionally to prevent burning, about 35 minutes. Mix in ketchup and cook 5 more minutes.\nRemove from heat, let the bacon jam cool, and pulse in a food processor to a slightly chunky, spreadable consistency. Bacon jam will store in the refrigerator, covered, up to 2 weeks.\n",
        "picture_link": "suc0VWqEGMcp0QpqLjO4uidkgPo0Xu2"
    },
    {
        "title": "Baked Bacon Jalapeno Wraps",
        "ingredients": [
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "12 fresh jalapeno peppers, halved lengthwise and seeded ADVERTISEMENT",
            "6 slices bacon, cut into halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nSpread cream cheese into jalapeno pepper halves; wrap each with a piece of bacon. Secure the bacon with toothpicks to prevent unraveling while baking. Arrange wrapped jalapeno peppers onto a baking sheet with cream cheese side facing down.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nBake in preheated oven for 10 minutes, turn, and continue cooking until the bacon is completely browned, about 10 minutes more.\nTransfer jalapeno wraps to preheated grill; cook until the bacon is crisp, 2 to 3 minutes per side.\n",
        "picture_link": "jcONUks1Lu/5Nt52TWJkGyxfCfJSx2K"
    },
    {
        "title": "The Arnold Palmer",
        "ingredients": [
            "5 fluid ounces prepared lemonade ADVERTISEMENT",
            "5 fluid ounces prepared iced tea ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lemonade and iced tea in a highball or tall glass. Add ice and stir until chilled.\n",
        "picture_link": "M6d1e0AsGdm2XrogwmRZLAbszI1cTDm"
    },
    {
        "title": "Favorite Pie Crust",
        "ingredients": [
            "5 cups all-purpose flour ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 pound lard ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "5 tablespoons cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure flour, sugar, salt, and baking powder into large bowl. Mix thoroughly and cut in lard until dough is the size of tiny peas.\nBreak egg into 8 ounce measuring cup. Beat with a fork, then pour in vinegar. Add enough cold water to reach the top (you will have a total of 1 cup liquid). Pour over flour mixture a little at a time, tossing and stirring with a fork until all liquid is absorbed.\nShape dough into a ball, then divide into four equal portions. Wrap tightly. Can be stored in refrigerator up to 2 weeks, or freezer up to 6 months. Each portion will make 1 double crust pie.\n",
        "picture_link": "2eIegEUh6EdjjxI09gplSYaGYsVqCpe"
    }
]