[
    {
        "title": "Chocolate Raspberry Coffee Cooler",
        "ingredients": [
            "1 cup brewed coffee, slightly cooled ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "1 cup frozen raspberries ADVERTISEMENT",
            "1/2 cup almond milk ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon coconut sugar, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine coffee, ice, raspberries, almond milk, cocoa powder, and coconut sugar in a blender; blend until frothy.\n",
        "picture_link": "reVKo5FMFdF8wKY.lbd4ALMIq8zSH3S"
    },
    {
        "title": "Golden Potato Gnocchi",
        "ingredients": [
            "5 medium russet potatoes ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "6 tablespoons unsalted butter, divided ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "3 cloves garlic, thinly sliced ADVERTISEMENT",
            "4 tablespoons seasonal pesto such as arugula ADVERTISEMENT",
            "1 cup seasonal vegetables (wild mushrooms, sweet peas, broccoli florets, bell peppers), steamed, roasted or grilled ADVERTISEMENT",
            "4 fried or poached eggs, or more depending on servings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil russet potatoes until tender (about 35 minutes): start with cold water, bring to a boil, and then reduce heat to maintain boil for 30-35 minutes. Cool and then peel.\nMill potatoes in food mill while mixing in flour, salt, and egg. Ingredients can also be mixed together on a pastry board or in a bowl.\nKnead gently for about 4 minutes until ball is dry to touch. It may be sticky; apply additional flour to the dough as needed.\nRoll ropes out at 3/4\" to 1\" thickness. Chop into 1-inch rectangles.\nBring a pot of salted water to a boil. Boil gnocchi in 3-4 batches and cook until they float (1-2 minutes).\nOnce floating, remove with a slotted spoon and shock them in a bath of ice water.\nSautee shallots and garlic in 1 tablespoon of butter in a pan until translucent. Remove with a slotted spoon and reserve.\nSaute the gnocchi in the pan with remaining butter until they're golden brown.\nStir in reserved shallots, garlic, pesto and seasoned cooked seasonal vegetables.\nPortion into 4-6 bowls and top with a fried egg. Lightly season with salt and pepper.\n",
        "picture_link": "j98YGb587SdDKuVcNcyk8jJquJeA3JG"
    },
    {
        "title": "Mexican Squoodles with Creamy Fire-Roasted Green Chile Sauce",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 onion, cut into noodle shapes ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "4 Mexican squash, cut into noodle shapes ADVERTISEMENT",
            "1 (11 ounce) can Mexican-style corn (such as Green Giant® Mexicorn®), drained ADVERTISEMENT",
            "4 ounces Neufchatel cheese, softened ADVERTISEMENT",
            "1 (4 ounce) can fire-roasted diced green chile peppers ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat. Add onion and garlic; cook and stir until onion is translucent, about 5 minutes. Stir in squash and corn; cook, stirring frequently, until squash is softened, about 5 minutes. Transfer to individual serving plates.\nCombine Neufchatel cheese, chile peppers, and milk in a blender; blend until sauce is smooth.\nHeat sauce in a saucepan over medium heat until warmed through, 2 to 4 minutes; pour over squash mixture.\n",
        "picture_link": "8Fy3l1h2CU9NebC3K0/fWBNTiMqVU0i"
    },
    {
        "title": "Spicy Old Bay® Skinny Fries",
        "ingredients": [
            "nonfat cooking spray ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 1/2 tablespoons seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon hot sauce ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "2 large russet potatoes ADVERTISEMENT",
            "1 tablespoon malt vinegar, or to taste ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line 2 baking sheets with aluminum foil; spray with cooking spray.\nMix oil, seafood seasoning, onion powder, hot sauce, and garlic powder together in a bowl.\nCut potatoes into spirals using a spiralizer fitted with a large shredder blade; snip long spirals into smaller lengths.\nPlace potatoes into a large bowl; drizzle with oil mixture. Toss until potatoes are evenly coated.\nSpread coated potatoes in a single layer onto the baking sheets, leaving 1/4-inch of space between potato spirals.\nBake in the preheated oven until bottom of potatoes are browned, 8 to 9 minutes. Flip potatoes with a spatula. Bake until potatoes are browned and crisp on top, about 6 minutes.\nSprinkle malt vinegar and sea salt over potatoes.\n",
        "picture_link": "qcG.gYMEWMXvwPXxLBMhT.bn5MS5W8."
    },
    {
        "title": "The Perfect Egyptian Rice with Vermicelli",
        "ingredients": [
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup 1/2-inch long vermicelli ADVERTISEMENT",
            "1 cup Egyptian rice (short-grain rice) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a saucepan over medium heat. Add vermicelli; cook, stirring constantly, until golden brown, 3 to 5 minutes. Remove from heat. Pour in rice and salt; stir until coated with oil.\nReduce heat to low. Cook the rice mixture, stirring constantly, until rice turns pasty white, 3 to 5 minutes.\nBring water to a boil in a saucepan.\nStir water into the rice mixture. Cover; cook until most of the water is absorbed, 10 to 15 minutes. Turn off heat; let sit until remaining water is absorbed, about 5 minutes. Fluff rice with a fork.\n",
        "picture_link": "ysMaK7AxwOVpdwU4OochahJlVGCqSFu"
    },
    {
        "title": "Monkey Milk",
        "ingredients": [
            "1 large banana ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine banana, milk, sugar, and vanilla extract in a blender; blend until smooth. Pour into 2 glasses; garnish with cinnamon.\n",
        "picture_link": "4Iynz3GpHOvhTCCqfl4hR4BWv4S9WSa"
    },
    {
        "title": "Spiralized Brown Butter Sage Sweet Potato",
        "ingredients": [
            "1 large sweet potato, peeled and halved crosswise ADVERTISEMENT",
            "1 tablespoon olive oil, or more as needed ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "9 fresh sage leaves ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut sweet potato into spaghetti-like ribbons with a spiralizer.\nHeat olive oil in a large nonstick skillet over medium heat. Add sweet potato ribbons; cook, stirring often and adding more oil to prevent sticking, until starting to soften, 6 to 7 minutes. Transfer to a plate.\nHeat butter in the same skillet until melted and foaming, about 1 minute. Add sage leaves; swirl until butter is a rich caramel color and leaves are crisp and dark green, 2 to 3 minutes. Remove sage leaves from the butter. Add sweet potato; stir to coat well.\nSeason sweet potato with salt and garnish with crisp sage leaves.\n",
        "picture_link": "q81MLz7FXsXRqkXckjYQSkk8E1IT/I6"
    },
    {
        "title": "Zavioli with Spinach and Ricotta",
        "ingredients": [
            "1 1/4 cups ricotta cheese ADVERTISEMENT",
            "1 cup chopped spinach ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup basil leaves, torn ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil, or more to taste ADVERTISEMENT",
            "1/2 clove garlic (optional) ADVERTISEMENT",
            "2 tablespoons pine nuts ADVERTISEMENT",
            "1 extra large zucchini ADVERTISEMENT",
            "9 toothpicks, soaked in water ADVERTISEMENT",
            "1/4 cup pasta sauce ADVERTISEMENT",
            "2 tablespoons grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ricotta cheese, spinach, egg, and pepper together in a bowl.\nGrind basil, oil, and garlic together into a chunky paste using a mortar and pestle. Add pine nuts to the pesto; grind to the size of small peddles.\nSlice zucchini lengthwise into strips using a mandoline.\nArrange 2 zucchini strips in the shape of a cross. Spoon some of the ricotta cheese mixture in the middle of the cross. Top with a dollop of pesto. Fold ends into the center to create a parcel, starting from the bottom end and moving clockwise. Secure with a toothpick. Repeat with remaining zucchini strips, ricotta cheese mixture, and pesto.\nSpread some of the pasta sauce in the bottom of a shallow baking dish. Arrange zucchini parcels on top, spacing them 1/2 inch apart. Spoon a bit of pasta sauce on top of each parcel. Sprinkle Parmiggiano-Reggiano cheese on top.\nBake in the preheated oven until sauce and zucchini begin to brown, about 20 minutes.\n",
        "picture_link": "/as23OqyFre7Dbs2bsgIH0I.vNKdooS"
    },
    {
        "title": "Superfood Blueberry Muffins",
        "ingredients": [
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1/2 cup oats ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup applesauce ADVERTISEMENT",
            "6 ounces Greek yogurt ADVERTISEMENT",
            "1/4 cup skim milk ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons skim milk, or as needed (optional) ADVERTISEMENT",
            "1 cup blueberries, or more to taste ADVERTISEMENT",
            "2/3 cup coarsely chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease muffin cups or line with paper muffin liners.\nCombine flour, oats, brown sugar, baking powder, and salt in a large bowl; stir in applesauce, yogurt, 1/4 cup skim milk, vegetable oil, and egg. If the dough us a bit too dry, add extra milk 1 tablespoon at a time. Batter should be about the consistency of a thick oatmeal.\nFold blueberries and walnuts into the batter. Spoon into prepared muffin cups until almost full.\nBake in preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes.\n",
        "picture_link": "bOm3Dk2vK9hk/QJxQRttdR.xLGK4D0G"
    },
    {
        "title": "Wild Blackberry Muffins ",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup blackberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a muffin tin with paper liners.\nMix milk, egg, and olive oil together in a bowl. Add flour, sugar, and baking powder; mix well. Fold blackberries into the batter.\nSpoon batter into the muffin tin, filling each cup 1/2 way.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes.\n",
        "picture_link": "ocKxFtDgnmlMoubmgUyCkTeqkKHdJYK"
    },
    {
        "title": "Crouton Eggplant Parmesan",
        "ingredients": [
            "2 cups garlic-flavored croutons ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 Japanese eggplant, cut into 1/2-inch slices ADVERTISEMENT",
            "1 1/2 cups pasta sauce ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup Parmesan cheese ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line an oven-safe baking pan with aluminum foil or wax paper.\nPlace croutons into a food processor; blend until coarsely ground, about 30 seconds. Transfer to a plate.\nMix egg, salt, and pepper together in a bowl; dip eggplant slices into the egg mixture until coated. Transfer to crouton crumbs plate; coat eggplant in croutons. Placed breaded eggplant into prepared pan.\nBake in the preheated oven until breading is golden brown on both sides, 10 to 15 minutes per side.\nMix pasta sauce and garlic powder together in a bowl. Pour half of the sauce mixture into an oven-safe baking pan; top with half the Parmesan cheese.\nPlace baked eggplant onto Parmesan cheese layer; cover with mozzarella cheese. Pour remaining pasta sauce over mozzarella layer; top with remaining Parmesan cheese.\nBake in the preheated oven until Parmesan cheese is a light golden brown, about 25 minutes.\n",
        "picture_link": "W2xzMspNW5ngPErELQEXTmFvcnmBzg."
    },
    {
        "title": "Prickly Pear Jelly ",
        "ingredients": [
            "27 prickly pears (cactus fruit) ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 (1.75 ounce) package fruit pectin (such as Sure-Jell®) ADVERTISEMENT",
            "4 1/2 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Simmer 3 pint-size jars in a large pot of water until ready for use. Wash lids and rings in warm soapy water.\nSlice ends off each prickly pear. Make 1 long vertical slit down each one. Use the slit to hold the skin and peel off. Discard peel.\nPlace peeled pears in a blender; puree in batches until liquefied. Press puree through a fine-mesh sieve set over a bowl. Discard pulp and seeds.\nMeasure out 3 cups prickly pear juice, lemon juice, and pectin into a large pot. Bring to a boil, stirring constantly. Add sugar and return to a boil, stirring constantly. Let cook, about 3 minutes. Remove from heat.\nPour prickly pear mixture into hot jars, filling to within 1/4 inch of the top. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the stockpot, and process for 15 minutes.\nRemove the jars from the pot and place onto a cloth-covered or wood surface, several inches apart, and let cool, at least 24 hours.\n",
        "picture_link": "iTXwcNQkjEuLAH.otEj.PbpsBRxv/vO"
    },
    {
        "title": "Shami Kebab",
        "ingredients": [
            "1 1/4 cups yellow lentils ADVERTISEMENT",
            "4 1/4 cups water ADVERTISEMENT",
            "1 pound ground chicken ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "4 green chile peppers, finely chopped, or more to taste ADVERTISEMENT",
            "2 tablespoons ginger-garlic paste ADVERTISEMENT",
            "1 tablespoon garam masala ADVERTISEMENT",
            "1 tablespoon salt, or more to taste ADVERTISEMENT",
            "1/2 bunch cilantro, chopped ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lentils in a container. Pour in enough water to cover and let soak, at least 30 minutes. Drain.\nCombine drained lentils, 4 1/4 cups water, ground chicken, onion, green chile peppers, ginger-garlic paste, garam masala, and salt in a large pot. Bring to a boil; reduce heat and let simmer until water has been mostly absorbed and lentils are soft, 20 to 25 minutes.\nPlace the lentil mixture in a food processor and pulse until smooth. Stir in cilantro.\nShape mixture into patties and dip into beaten eggs.\nHeat oil in a large skillet over medium heat. Pan-fry patties in batches until golden brown, about 3 minutes per side.\n",
        "picture_link": "ikXRSrOxjCeWkLx0KofGjRUvKaksxqO"
    },
    {
        "title": "Bacon-Wrapped Stuffing Balls",
        "ingredients": [
            "1 teaspoon olive oil (optional) ADVERTISEMENT",
            "1/2 cup chopped red bell pepper (optional) ADVERTISEMENT",
            "1/2 cup chopped celery (optional) ADVERTISEMENT",
            "1/2 cup chopped onion (optional) ADVERTISEMENT",
            "2 cups stuffing mix (such as Kraft® Stove Top®) ADVERTISEMENT",
            "1/2 (8 ounce) package softened cream cheese, cut into chunks ADVERTISEMENT",
            "1/4 cup softened butter, cut into chunks ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2/3 cup very hot water ADVERTISEMENT",
            "2/3 cup bread crumbs, or as needed ADVERTISEMENT",
            "6 slices bacon, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Add red bell pepper, celery, and onion; cook and stir until softened, 5 to 10 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nCombine stuffing mix, cream cheese, butter, and beaten egg in a large bowl; add hot water and mix well until incorporated. Let sit until liquid is absorbed, about 10 minutes. Stir in red bell pepper mixture. Shape into 1-inch balls.\nPlace bread crumbs in a shallow dish. Roll balls in bread crumbs; arrange them on a baking sheet. Flatten slightly into patties. Wrap patties in bacon.\nBake in the preheated oven until bottoms are browned and crisp, about 10 minutes. Flip and continue baking until crisp on top, about 10 minutes more.\n",
        "picture_link": "q96dgIycczKbfGSgbDnUuW/LfBr5sVO"
    },
    {
        "title": "Cantaloupe Cayenne Sorbet",
        "ingredients": [
            "1 1/2 pounds cantaloupe chunks ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons vodka ADVERTISEMENT",
            "1 1/2 tablespoons seasoned rice wine vinegar ADVERTISEMENT",
            "2 teaspoons fresh lime juice ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place melon in bowl of a blender. Add sugar, vodka, rice vinegar, lime juice, and cayenne pepper.\nBlend on highest speed to completely liquefy, 1 or 2 minutes. Pour into ice cream maker and proceed according to manufacturer's instructions. Smooth out surface and cover with plastic wrap. Freeze until firm, at least 5 hours.\n",
        "picture_link": "2lJV8j/e7x6NdFWdM8o6meQaUgi1HyG"
    },
    {
        "title": "Sweet and Spicy Turkey Rub",
        "ingredients": [
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "2 tablespoons red pepper flakes ADVERTISEMENT",
            "2 tablespoons onion powder ADVERTISEMENT",
            "1 1/2 tablespoons salt ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine brown sugar, garlic powder, red pepper flakes, onion powder, salt, and cumin together in a bowl; stir until well mixed.\n",
        "picture_link": "0szjY5B0GXQ3JgfZwx9MqDnimxKjCS6"
    },
    {
        "title": "Tilapia with Green Tomato Tapenade ",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1/4 large onion, diced ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "2 green tomatoes, diced ADVERTISEMENT",
            "1 tablespoon capers ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 pounds tilapia fillets ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 teaspoon olive oil in a skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Stir in diced tomatoes, green tomatoes, capers, basil, salt, and pepper. Cook, stirring occasionally, until flavors combine, about 5 minutes.\nSeason tilapia fillets with salt and pepper.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Add tilapia fillets; cook until flesh flakes easily with a fork, about 3 minutes per side. Transfer to a serving platter.\nPour lemon juice into the skillet; swirl to pick up browned bits off the bottom of the skillet, 30 seconds to 1 minute. Pour over fillets.\nSpoon tomato mixture over fillets before serving.\n",
        "picture_link": "KMwUxFHSvubU1VGpmLfSBcxTdNhQ5mq"
    },
    {
        "title": "Minestrone Soup from Libby's",
        "ingredients": [
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 shallot, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 clove garlic, sliced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 1/2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1 (14 ounce) can plum tomatoes, crushed ADVERTISEMENT",
            "2 (15 ounce) cans cannellini beans, drained ADVERTISEMENT",
            "4 (4 ounce) Libby's® Sliced Carrots Vegetable Cups ADVERTISEMENT",
            "2 (4 ounce) Libby's® Sweet Peas Vegetable Cups ADVERTISEMENT",
            "2 (4 ounce) Libby's® Cut Green Beans Vegetable Cups ADVERTISEMENT",
            "2 (4 ounce) Libby's® Whole Kernel Sweet Corn Vegetable Cups ADVERTISEMENT",
            "3 tablespoons chopped fresh thyme leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in large soup pot over medium heat. Add onions, shallots and celery and cook for 3 minutes.\nAdd beans and cook for additional 2 minutes. Then add plum tomatoes with juice and cook for 1 minute. Then add chicken broth.\nDrain carrots, sweet peas, green beans and corn, and add to broth.\nSeason soup with thyme, salt and pepper and bring to boil. Reduce heat to low and simmer for 30 minutes. Serve with grated parmesan, if desired.\n",
        "picture_link": ".Ny.0EApHEMOBK3hAHMQEgKraBGDnAS"
    },
    {
        "title": "Coquito \u0096 Coconut Eggnog",
        "ingredients": [
            "2 (12 ounce) cans GOYA® Evaporated Milk ADVERTISEMENT",
            "1 (15 ounce) can Coco GOYA® Cream of Coconut ADVERTISEMENT",
            "1 (13.5 ounce) can GOYA® Coconut Milk ADVERTISEMENT",
            "1/2 cup GOYA® Sweetened Condensed Milk ADVERTISEMENT",
            "1/2 cup white rum (optional) ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, plus more for garnish, if desired ADVERTISEMENT",
            "Cinnamon sticks (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In bowl of blender, add evaporated milk, cream of coconut, coconut milk, sweetened condensed milk, rum (if using), vanilla extract and ground cinnamon. Blend on high until mixture is well combined, 1-2 minutes.\nPour coconut mixture into glass bottles; cover. Transfer to refrigerator. Chill until cold.\nTo serve, stir or shake bottle well to combine. Pour coquito into small serving glasses. Garnish with ground cinnamon and cinnamon sticks, if desired.\n",
        "picture_link": "AIi3.lp8qVRMxSbu/EfvXWIfQW6CpGq"
    },
    {
        "title": "Spanish Garlic Shrimp on Skewers",
        "ingredients": [
            "2 tablespoons GOYA® Extra Virgin Olive Oil ADVERTISEMENT",
            "1 teaspoon GOYA® Adobo with Pepper ADVERTISEMENT",
            "1 teaspoon GOYA® Minced Garlic ADVERTISEMENT",
            "1/4 teaspoon GOYA® Crushed Red Pepper ADVERTISEMENT",
            "1 pound jumbo shrimp, peeled and deveined ADVERTISEMENT",
            "1 large green and/or red bell pepper, cut into 1-inch pieces ADVERTISEMENT",
            "1 lemon, cut into 8 slices ADVERTISEMENT",
            "4 skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In zip-top plastic bag, or plastic container with a lid, mix together oil, Adobo, garlic and pepper flakes. Add shrimp, tossing to combine; transfer to refrigerator. Chill shrimp at least 15 minutes, or up to 30 minutes.\nRemove shrimp from marinade; reserve any remaining liquid. Alternately thread peppers, shrimp and lemons on skewers, so that each skewer starts and ends with peppers and contains 4 shrimp pieces. Using pastry brush, brush reserved marinade onto shrimp and vegetables.\nPrepare grill to medium-high heat, or heat a heavy-bottomed grill pan over medium-high heat. Place shrimp on hot surface and cook until shrimp turn pink and opaque, flipping once, 3 - 5 minutes.\n",
        "picture_link": "LyRJg.JMJbTgv.H9DvmX0Qq.Kyw21pK"
    },
    {
        "title": "Whole Wheat Oatmeal Strawberry Blueberry Muffins",
        "ingredients": [
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup oats ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups diced strawberries ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease muffin cups or line with paper muffin liners.\nMix flour, oats, sugar, baking powder, baking soda, and salt together in a bowl. Combine milk, vegetable oil, egg, and vanilla extract in a separate bowl.\nStir milk mixture into flour mixture until batter is combined. Fold in strawberries and blueberries. Spoon batter into prepared muffin pan until full.\nBake in preheated oven until a toothpick inserted into the center comes out clean, 18 to 22 minutes.\n",
        "picture_link": "Oo84XORbHIKfeks9R7ikuNsDgNpXnwK"
    },
    {
        "title": "Spicy Lentil Quinoa Curry",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "1 cup chopped mushrooms ADVERTISEMENT",
            "1/2 cup chopped carrots ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 cups vegetable broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup dry green lentils ADVERTISEMENT",
            "1/2 cup quinoa ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1 tablespoon ground red chile pepper ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon garam masala (Indian spice blend) ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1 dash ground black pepper, or to taste ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat. Add onion; cook and stir until translucent, about 3 minutes. Mix in mushrooms, carrots, and garlic; cook until flavors combine, about 2 minutes.\nStir vegetable broth, water, lentils, quinoa, tomato paste, curry powder, chili powder, cumin, ginger, cayenne pepper, garam masala, turmeric, salt, and pepper into the saucepan. Reduce heat to medium-low and cover; let simmer until vegetables are cooked through, about 40 minutes.\nStir butter and cream into the saucepan. Replace the lid and cook until the lentils are tender, about 5 minutes.\n",
        "picture_link": "Ucrt2kF35bk4cUG1iaWzzs.WGlGmnIi"
    },
    {
        "title": "Mika's Kabocha Cake (Pumpkin Cake)",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup mashed pumpkin ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup cashews, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch cake pan with cooking spray.\nMix flour, baking powder, and salt together in a bowl. Stir in mashed pumpkin. Mix in honey, milk, oil, and egg until batter is smooth.\nPour batter into the greased cake pan. Gently press cashews into the batter for decoration.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Let cool in the pan, 5 to 10 minutes.\n",
        "picture_link": "fkol9k.l2ERjPQ/3WwVgFMSOsOzVK8S"
    },
    {
        "title": "Tender Juicy Skirt Steak  (Churrasco)",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons balsamic vinegar, or to taste ADVERTISEMENT",
            "2 tablespoons grill seasoning ADVERTISEMENT",
            "2 tablespoons chopped fresh oregano ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound skirt steak ADVERTISEMENT",
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "1/4 cup water, or as needed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (8 ounce) can mushrooms, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk garlic, balsamic vinegar, grill seasoning, oregano, salt, and pepper together in a large bowl. Add steak and toss to evenly coat. Cover bowl with plastic wrap and marinate in the refrigerator, 8 hours to overnight.\nHeat olive oil in a skillet over medium-high heat until sizzling; add meat. Cook uncovered until liquids have drained from the steak, 3 to 5 minutes. Reduce heat to medium; cover.\nCook steak for 15 minutes; uncover and flip. Add water to the skillet as needed to keep steak moist. Continue cooking until slightly firm, hot, and lightly pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Transfer meat to serving plate; reserve liquid in the skillet.\nPlace onion in the skillet with reserved liquids; cook and stir until softened, about 5 minutes. Reduce heat to low; add mushrooms. Cook and stir until mushrooms are warmed through, about 5 minutes. Pour onion mixture over steak.\n",
        "picture_link": "clMmKF0eyGQzRsDfx.T2Wv4LZ352A76"
    },
    {
        "title": "Mexican Chicken and Corn Salad",
        "ingredients": [
            "1 boneless, skinless chicken breast half ADVERTISEMENT",
            "Kosher salt, to taste ADVERTISEMENT",
            "Freshly ground black pepper, to taste (optional) ADVERTISEMENT",
            "Smoky paprika (optional) ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 cherry tomatoes, quartered ADVERTISEMENT",
            "1 cup chopped lettuce ADVERTISEMENT",
            "1/4 cup cooked black beans, rinsed and drained ADVERTISEMENT",
            "1 (4 ounce) Libby's® Sweet Corn Vegetable Cup ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "Bacon bits (optional) ADVERTISEMENT",
            "1 cup tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken breast with salt, freshly ground black pepper and smoky paprika (optional).\nHeat a grill pan and add 1 tablespoon olive oil. Add chicken breast and cook 6 minutes on each side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from grill pan and allow chicken to cool.\nPlace tomatoes, chopped lettuce, beans, and Libby's corn into bowl.\nIn separate small bowl whisk together lime juice, olive oil, salt and pepper.\nPlace cooled chicken breast onto cutting board and cut into 1-inch pieces.\nPour dressing over veggies and lettuce and toss. Add chopped chicken to salad. Sprinkle cheese and bacon bits (optional) over salad.\nServe salad with tortilla chips or add them into salad.\n",
        "picture_link": "eERqhzNg.wbgEkQfJT.kOS0NbkBajWq"
    },
    {
        "title": "Chewy Pecan Pie Bars",
        "ingredients": [
            "1/4 cup butter, melted ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups chopped pecans ADVERTISEMENT",
            "1 teaspoon confectioners' sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Pour melted butter into a 9x13-inch baking pan.\nBeat brown sugar, eggs, flour, vanilla extract, baking soda, and salt together in a bowl until smooth; stir in pecans. Spread the sugar mixture over the butter in the baking pan.\nBake in the preheated oven until set and golden, 30 to 35 minutes. Remove from oven; dust with confectioners' sugar. Cool until easily touched, about 10 minutes; cut into bars.\n",
        "picture_link": "zOJXkAUnpe9xGOm5Yt.HTfGcYJJDduO"
    },
    {
        "title": "Apple and Sausage Stuffed Acorn Squash",
        "ingredients": [
            "2 acorn squash, halved and seeded ADVERTISEMENT",
            "2 large Gala apples, cubed ADVERTISEMENT",
            "1 cup pork sausage (such as Jimmy Dean®) ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1/8 teaspoon poultry seasoning ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1/8 teaspoon celery seed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place acorn squash cut side down on a baking sheet.\nBake in the preheated oven until soft and browned, about 30 minutes.\nMix apples, sausage, onion, raisins, poultry seasoning, ginger, cloves, celery seed, salt, and pepper together in a bowl. Spoon sausage mixture into the hollow of the acorn squash; place on the baking sheet.\nBake in the preheated oven until sausage is cooked through and apples are soft, about 30 minutes.\n",
        "picture_link": "GZiLIbtcidto78UpimW4xDSCeODYjxC"
    },
    {
        "title": "Easy Brazilian Black Bean Stew",
        "ingredients": [
            "2 strips bacon, diced ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1/2 cup minced green bell pepper ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro (optional) ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 (15 ounce) cans black beans, drained ADVERTISEMENT",
            "1/2 cup chicken broth, or more as needed ADVERTISEMENT",
            "1 teaspoon vinegar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 dash hot sauce to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon in a pot over medium heat until almost crisp, 3 to 5 minutes. Add onion and green pepper to the bacon; cook and stir until onion is translucent, about 5 minutes. Mix in cilantro, garlic, and bay leaf; cook and stir until flavors combine, 1 to 2 minutes.\nStir beans, chicken broth, vinegar, salt, pepper, and hot sauce into the onion mixture; cover and let simmer until the flavors combine, 10 to 15 minutes. Add more chicken broth if you would like the beans to be more soupy.\n",
        "picture_link": "yAvREMZkDxhFTJtNstUxFLv6RlJFrJW"
    },
    {
        "title": "Brazilian Chicken Stroganoff",
        "ingredients": [
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "3 cups mushrooms, sliced ADVERTISEMENT",
            "2 cloves garlic cloves, crushed ADVERTISEMENT",
            "2 skinless, boneless chicken breasts, thinly sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes, blended ADVERTISEMENT",
            "1 (7.6 ounce) can table cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a skillet over medium-low heat. Place onions to the skillet; cook and stir until the onions are soft, 5 to 7 minutes. Add mushrooms and garlic; cook and stir until mushrooms are soft, 7 to 10 minutes. Pour the mushroom mixture into a bowl.\nHeat 1 tablespoon olive oil in the skillet over medium-high heat. Place chicken in the skillet; cook until the chicken is golden brown and no longer pink in the center, 7 to 10 minutes per side. Stir the mushroom mixture in with the chicken and season with salt and pepper. Add tomatoes; cook and stir until tomato juice begins to simmer, 5 to 7 minutes. Stir in table cream; simmer until flavors are combined, 1 to 3 minutes.\n",
        "picture_link": "47CbsmRS/ecky0jK5j/EGBTMyOGdBMC"
    },
    {
        "title": "Classic Pudding Pops",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "1 (3.5 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat milk, evaporated milk, instant pudding, and sugar in a bowl until thoroughly combined. Pour into ice pop molds and freeze until firm, about 3 hours.\n",
        "picture_link": "vSHaC945CMY1DYA2pWJe7UpOHsBSOIO"
    },
    {
        "title": "Deep-Fried Lasagna Pieces",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground Italian sausage ADVERTISEMENT",
            "1 (8 ounce) package manicotti shells ADVERTISEMENT",
            "1 (24 ounce) carton cottage cheese, drained ADVERTISEMENT",
            "2 (16 ounce) jars pizza sauce, divided ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 cups bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium heat. Add beef and Italian sausage; cook and stir until browned, about 8 minutes. Drain excess grease. Let cool slightly.\nBring a large pot of lightly salted water to a boil. Cook manicotti shells in the boiling water, stirring occasionally until tender yet firm to the bite, about 7 minutes. Drain.\nMix cooled beef and sausage, cottage cheese, 1 jar pizza sauce, and mozzarella cheese together in a large bowl. Stuff shells generously with mixture.\nArrange stuffed shells on a baking sheet and freeze until firm, 15 to 20 minutes. Cut each shell into 2 or 3 lasagna pieces.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nPlace flour in a bowl. Beat eggs in another bowl. Pour bread crumbs onto a shallow plate.\nDredge stuffed lasagna pieces in flour. Dip in beaten eggs. Roll in bread crumbs until coated.\nFry 4 breaded lasagna pieces at a time in the hot oil until golden brown, 3 to 5 minutes. Repeat with remaining pieces.\nPour remaining jar of pizza sauce into a bowl for dipping.\n",
        "picture_link": "tUi7ByY6uX5F7VOxgysv9XvSWHi03ae"
    },
    {
        "title": "Easy Alice Springs Chicken",
        "ingredients": [
            "2 skinless, boneless chicken breasts ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 slices hickory-smoked thick-cut bacon ADVERTISEMENT",
            "1 1/2 cups shredded mild Cheddar cheese ADVERTISEMENT",
            "2 limes, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken breasts in a baking dish. Season with salt and pepper.\nBake chicken in the preheated oven until it is just slightly pink in the center, about 25 minutes. Remove from the oven.\nPlace bacon in a large skillet and cook over medium heat, turning occasionally, until most of the fat has rendered, about 5 minutes. Drain bacon slices on paper towels. Wrap around chicken breasts.\nReturn chicken to the oven and continue baking until an instant-read thermometer inserted into the center reads 165 degrees F (74 degrees C) and bacon is crispy, about 15 minutes more. Sprinkle Cheddar cheese on top; bake until melted, 2 to 5 minutes. Serve with limes.\n",
        "picture_link": "88lJl.tmM11TCuuVBBoWlrK1ufnd1Q."
    },
    {
        "title": "Tuna Panini Melt ",
        "ingredients": [
            "1 (5 ounce) can solid white albacore tuna in water (such as Bumble Bee®) ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1 dill pickle, chopped ADVERTISEMENT",
            "4 slices sourdough bread ADVERTISEMENT",
            "2 slices American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tuna, mayonnaise, balsamic vinegar, onion, and dill pickle together in a bowl.\nSpread tuna mixture over 2 slices of bread. Top with American cheese and remaining 2 slices of bread.\nCook in a panini press until bread is crispy and cheese is melted, 3 to 4 minutes.\n",
        "picture_link": "mnkwfr2AcvB5IAVbugZJBeg4J5Yu6a6"
    },
    {
        "title": "Old-Fashioned Gingerbread",
        "ingredients": [
            "PAM® Baking Spray ADVERTISEMENT",
            "2 3/4 cups Ultragrain® All Purpose Flour ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup firmly packed brown sugar ADVERTISEMENT",
            "2/3 cup Pure Wesson® Vegetable Oil ADVERTISEMENT",
            "2 large eggs, beaten ADVERTISEMENT",
            "3/4 cup molasses ADVERTISEMENT",
            "1 cup lowfat buttermilk ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Spray 13x9-inch baking dish with baking spray. Combine flour, ginger, cinnamon, baking soda and salt in medium bowl; set aside.\nCombine sugar, oil and eggs in large bowl; mix well. Gradually pour molasses into sugar mixture; stir until well blended. Alternately add flour mixture and buttermilk to sugar mixture; beat well. Spread batter evenly in prepared baking dish.\nBake 30 to 35 minutes or until wooden pick inserted in center comes out clean. Cool 10 minutes before serving. Cut into 12 pieces. Dust with confectioners' sugar and garnish with Reddi-wip.\n",
        "picture_link": "Th9bm.Narpfcg6OHaKTZr4uCCDmbJCy"
    },
    {
        "title": "Quick Meatball Stroganoff",
        "ingredients": [
            "8 ounces broad egg white noodles (such as No Yolks®) ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "15 frozen beef meatballs, or more to taste ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add noodles and cook, stirring occasionally, until tender yet firm to the bite, 10 to 12 minutes. Drain.\nHeat oil in a large skillet over medium-high heat. Add onion and garlic; cook and stir until onion is almost soft, about 3 minutes. Reduce heat to medium and pour in cream of mushroom soup, milk, and Worcestershire sauce; stir until blended.\nStir meatballs into the skillet. Reduce heat to low and simmer, covered, until tender, 35 to 40 minutes. Stir in sour cream, salt, and pepper. Cook until flavors combine, about 2 minutes.\nServe meatballs over noodles.\n",
        "picture_link": "pNi8EEcKllwQxpSmhPDCfSZjFr8hZ.y"
    },
    {
        "title": "Chef John's Salami Bread",
        "ingredients": [
            "1 (14 ounce) package prepared unbaked pizza dough ADVERTISEMENT",
            "8 slices salami, or more to form 2 rows ADVERTISEMENT",
            "1/4 cup tomato sauce, or other crushed tomato product ADVERTISEMENT",
            "1/2 cup freshly grated Parmigiano-Reggiano cheese, or more to cover ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "2 teaspoons olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Generously flour a work surface. Flatten out dough to form a rough rectangle. Flour top surface and roll out to a 1/4- to 1/2-inch thickness.\nLeaving an inch or so of the long edge uncovered, arrange salami slices in a single row without overlapping them. Create 2 single-layer rows, leaving a wider uncovered edge on the other side. Spread tomato sauce over salami. Generously cover with grated cheese, parsley, and oregano. Brush edges of dough with water.\nBegin rolling from the long edge closest to the salami. Roll fairly tightly without pressing or stretching dough too much to allow it room to rise, pinching in the ends as you go. Finish with seam side down. Carefully transfer roll to a rimmed baking sheet lined with a silicon mat. Cover with a dry towel and allow to rise until doubled, 60 to 90 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nLightly brush top and sides of loaf with olive oil. Cut 1-inch deep slits diagonally across the top of the loaf, about 2 inches apart. Dust with grated Parmesan cheese.\nBake in preheated oven on center rack until nicely browned and cooked through, 25 to 30 minutes. Transfer loaf to a cooling rack. Cool completely before slicing.\n",
        "picture_link": "gnFhVdTqwfpAmvmySCfOhWojy8VQ9LK"
    },
    {
        "title": "Brazilian Garlic Sauce (Molho de Alho)",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a large saucepan over medium heat. Add garlic; cook and stir until the garlic is a light brown, about 2 minutes. Mix in flour; cook and stir until the garlic mixture is a light blonde color, 2 to 3 minutes. Stir in milk a little at a time until combined, 1 to 2 minutes. Add mayonnaise, salt, pepper, and oregano; cook and stir until sauce is smooth and evenly warmed, about 5 minutes.\n",
        "picture_link": "tM8CV1GZUZ8C4KL7u4177w5UnGO7Gt2"
    },
    {
        "title": "Chocolate Pudding Popsicles®",
        "ingredients": [
            "3/4 cup milk chocolate chips ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 avocado ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chocolate chips, milk, cocoa powder, sugar, cinnamon, and vanilla extract in a saucepan over low heat; stir until all ingredients are melted and combined, about 5 minutes.\nPlace avocado and banana in blender; blend until smooth. Add chocolate mixture into the puree; blend until the mixture is the consistency of pudding, about 5 minutes. Pour the pudding into ice pop molds, and place into freezer until firm, about 3 hours.\n",
        "picture_link": "xgvRHmh8qgREDg2HFe3kxDlmdGVdcBO"
    },
    {
        "title": "Andie's Quick 'n Easy Sneaky Sloppy Joes",
        "ingredients": [
            "1 cup lentils ADVERTISEMENT",
            "2 onions, diced ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 large green bell pepper, diced ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "3/4 cup barbeque sauce ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lentils in a small pot and cover with 2 cups hot water. Bring to a boil; reduce heat and simmer until lentils are tender, about 15 minutes. Drain.\nHeat a large nonstick skillet over medium heat. Add onions; cook and stir until softened, 3 to 5 minutes. Add ground beef and green bell pepper; cook and stir until browned, about 8 minutes.\nStir drained lentils, ketchup, barbeque sauce, Worcestershire sauce, and minced garlic into the skillet. Reduce heat to low and simmer until flavors combine and mixture thickens to desired consistency, 15 to 20 minutes.\n",
        "picture_link": "g6TuGhGMBOoNj6kX.n.HtQw9rH1veT2"
    },
    {
        "title": "Succulent Sausage Squash Salad",
        "ingredients": [
            "1 small butternut squash - peeled, seeded, and cut into 1/2-inch cubes ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 ounces ground breakfast sausage ADVERTISEMENT",
            "2 large apples, diced into 1/2-inch cubes ADVERTISEMENT",
            "1 teaspoon fresh thyme leaves ADVERTISEMENT",
            "1/4 teaspoon ground sage ADVERTISEMENT",
            "1/4 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a rimmed baking sheet with parchment paper.\nPlace butternut squash into a large bowl; toss with olive oil and salt until thoroughly coated. Spread squash in a single layer on prepared baking sheet.\nRoast in preheated oven until tender, about 30 minutes.\nCook sausage over high heat in a skillet until well-browned, about 7 minutes. Crumble cooked sausage into large serving bowl.\nCook apple, thyme, sage, and nutmeg over high heat in the hot skillet with the sausage grease. Stir to thoroughly brown all sides, 3 to 4 minutes. Remove with a slotted spoon and add to bowl with crumbled sausage.\nCombine balsamic vinegar and maple syrup in a small saucepan. Place over high heat. When mixture comes to a boil, reduce heat to medium-low and simmer until it begins to thicken and smells strongly acidic, about 10 minutes. Remove from heat.\nCombine roasted squash with the apple and sausage. Mix thoroughly.\nTo serve, spoon salad into individual dishes and drizzle with balsamic maple reduction. Serve with a glass of ice cold milk.\n",
        "picture_link": "WYNO1bGgetQrOPgODVc066.He6diCjG"
    },
    {
        "title": "Strawberry Banana Smoothie from Reddi-wip®",
        "ingredients": [
            "1/2 cup chopped fresh strawberries ADVERTISEMENT",
            "1/4 medium banana, peeled and halved ADVERTISEMENT",
            "1/4 cup vanilla nonfat yogurt with low-calorie sweetener ADVERTISEMENT",
            "1/2 cup crushed ice ADVERTISEMENT",
            "Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place strawberries, banana and yogurt in blender container. Pulse until fruit is well blended, scraping sides of container, if necessary.\nAdd ice; pulse until ice is well blended.\nPour into glass and top with one serving (2 tablespoons) Reddi-wip. Serve immediately.\n",
        "picture_link": "xK3PR4eQKiyCA0F4BrfNnTXqDhJtM.e"
    },
    {
        "title": "Bellini Slushie",
        "ingredients": [
            "6 cups frozen peach chunks ADVERTISEMENT",
            "1 cup peach schnapps ADVERTISEMENT",
            "1 (750 milliliter) bottle Champagne, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine peach chunks and peach schnapps in a blender; blend until smooth.\nFill 8 champagne flutes halfway with blended peach mixture. Fill flutes to the top with Champagne.\n",
        "picture_link": "EFHn9K6.iFs1AHuc1TeG.2tgJGLAOIi"
    },
    {
        "title": "Authentic Thai Basil Chicken (Very Easy and Fast)",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "3 cloves garlic, sliced ADVERTISEMENT",
            "1 large skinless, boneless chicken breast, cut into 1-inch pieces ADVERTISEMENT",
            "1/4 cup oyster sauce ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "2 small chile peppers, sliced (optional) ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/2 cup fresh basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a wok or large skillet over medium heat. Add onion and garlic; cook and stir until fragrant, about 30 seconds. Add chicken; cook and stir until no longer pink, about 5 minutes. Stir in oyster sauce, soy sauce, and sugar. Stir in chile peppers. Pour in water. Cook until slightly thickened, 3 to 5 minutes. Stir in basil before serving.\n",
        "picture_link": "PHEZcIYxldvlax0DkjYe48N.kxCr0vK"
    },
    {
        "title": "Buttery, Savory Scrambled Egg Nachos",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "2 tablespoons milk, or to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch chili powder, or to taste ADVERTISEMENT",
            "1/4 cup shredded Mexican cheese blend, or to taste ADVERTISEMENT",
            "1/2 (10 ounce) bag tortilla chips, or to taste ADVERTISEMENT",
            "1/4 cup salsa, or to taste ADVERTISEMENT",
            "1/4 cup guacamole, or to taste ADVERTISEMENT",
            "1/4 cup sour cream, or to taste ADVERTISEMENT",
            "2 tablespoons sliced black olives, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs and milk together in a bowl.\nMelt butter in a large skillet over medium heat. Pour in eggs; cook and stir until eggs are set but still soft, about 3 minutes. Season with garlic powder and chili powder. Stir in Mexican cheese blend until melted, about 1 minute.\nPlace tortilla chips on a large plate. Spoon eggs on top. Garnish with salsa, guacamole, sour cream, and black olives.\n",
        "picture_link": "Kk4UE7t8yFbOkCzpkOEO/fbfgdK9EMe"
    },
    {
        "title": "Refreshing Watermelon Margarita",
        "ingredients": [
            "1/2 watermelon, cubed ADVERTISEMENT",
            "3/4 cup tequila ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place watermelon in a blender; blend until smooth. Pour through a fine mesh strainer to remove seeds and pulp.\nPour watermelon juice into ice cube tray; place in freezer until frozen, about 3 hours.\nPlace 4 cups of frozen watermelon cubes, tequila, lime juice, and sugar into a blender; pulse until smooth.\n",
        "picture_link": "S0E74n9Be1KXsYEwKsL3Kq7DPuzcuJq"
    },
    {
        "title": "Mango Pineapple Ice Pops",
        "ingredients": [
            "2 cups Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "1 1/2 cups pineapple juice ADVERTISEMENT",
            "1 1/2 cups frozen unsweetened mango chunks ADVERTISEMENT",
            "1 cup frozen unsweetened pineapple chunks ADVERTISEMENT",
            "2 tablespoons granulated sugar ADVERTISEMENT",
            "3/4 teaspoon coconut extract ADVERTISEMENT",
            "10 wooden craft sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place Reddi-wip, juice, mango, pineapple, sugar and coconut extract in blender container. Blend mixture until smooth.\nPour mixture into popsicle molds. Cover; insert sticks. Freeze at least 8 hours or overnight. Remove from molds. Serve immediately.\n",
        "picture_link": "eYsLJgYsaxQsfNTPKyFw/PpZNEwPyiO"
    },
    {
        "title": "Turkey Chorizo Burger",
        "ingredients": [
            "1 pound lean ground turkey ADVERTISEMENT",
            "4 links Mexican chorizo sausage, casings removed ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon chipotle chile flakes ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "2 tablespoons buttery spread ADVERTISEMENT",
            "4 slices pepperjack cheese ADVERTISEMENT",
            "4 hamburger buns ADVERTISEMENT",
            "1/4 cup mayonnaise, divided ADVERTISEMENT",
            "2 cups spring mix lettuce, divided ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ground turkey, chorizo, garlic, onion powder, chipotle flakes, and black pepper in a large bowl; mix with your hands until well-blended. Shape into 4 loosely-packed patties.\nHeat a griddle or large skillet over medium heat until hot; grease with buttery spread. Place patties on the griddle; cook until browned, about 3 minutes. Reduce heat to medium-low; continue cooking for about 5 minutes. Flip patties and cook until browned on the second side, about 6 minutes.\nTop each patty with a slice of pepperjack cheese. Cook until cheese is melted, about 1 minute more.\nToast hamburger buns in a toaster oven. Spread 1 1/2 teaspoon mayonnaise over each half. Place cooked patties over bottom buns. Top each patty with 1/2 cup spring mix lettuce. Sprinkle lime juice over lettuce. Cover with top buns.\n",
        "picture_link": "IgZiFdmqQOe1oRHzq3gYK9P6Qt6t4f2"
    },
    {
        "title": "Kahlua® Brownies",
        "ingredients": [
            "1 (10.25 ounce) package brownie mix ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 tablespoons coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "2 tablespoons instant coffee granules ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease an 8-inch square pan.\nCombine brownie mix, egg, vegetable oil, coffee-flavored liqueur, instant coffee, and water in a large bowl; mix with a wooden spoon until batter is evenly moistened.\nPour batter into the prepared pan.\nBake in the preheated oven until edges are set and a toothpick inserted in the center comes out with a few moist crumbs attached, about 20 minutes. Let cool for 20 to 30 minutes before cutting.\n",
        "picture_link": "OEMtnMYdEGuOXDCNvRwhLOHO.wJTeKK"
    },
    {
        "title": "Indian Fry Bread",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup cold water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, baking powder, and salt in a bowl. Stir in cold water and vegetable oil until dough comes together into a ball.\nSet dough on a floured surface. Pinch off ten pieces the size of golf balls, roll into balls, and flatten each into a round. Make a small hole in the center of each round.\nFill a deep skillet with oil to 3/4 inch; heat over medium-high heat. Add dough rounds in batches and fry until golden brown, about 20 seconds per side. Drain on paper towels.\n",
        "picture_link": "jk6h97YekQ8ZQRWe413yT0ZRajPoL2K"
    },
    {
        "title": "Baked Turkey Croquettes",
        "ingredients": [
            "1/2 cup panko bread crumbs ADVERTISEMENT",
            "1 teaspoon melted butter ADVERTISEMENT",
            "1 cup mashed potatoes ADVERTISEMENT",
            "1 cup prepared stuffing ADVERTISEMENT",
            "1 cup chopped cooked turkey ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper.\nStir panko bread crumbs and melted butter together in a shallow bowl; set aside to moisten.\nStir mashed potatoes, stuffing, and turkey together in a bowl. Roll about 1 1/2 tablespoons turkey mixture into a ball or log shapes; dip into beaten egg, roll in panko bread crumb mixture, and place on prepared baking sheet. Repeat with remaining turkey mixture.\nBake in the preheated oven until golden and crisp, about 15 minutes.\n",
        "picture_link": "p7ocG/ITSSRrIOkVTq/qGgf3mD/xv3O"
    },
    {
        "title": "Hummus and Tapenade Sandwich Spread",
        "ingredients": [
            "1/4 cup pitted Kalamata olives, drained ADVERTISEMENT",
            "2 tablespoons pitted green olives ADVERTISEMENT",
            "1 (8 ounce) container hummus ADVERTISEMENT",
            "1 tablespoon tahini ADVERTISEMENT",
            "1 teaspoon minced fresh Italian parsley ADVERTISEMENT",
            "1 teaspoon minced fresh rosemary ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place Kalamata olives and green olives in a food processor; pulse until minced.\nCombine minced olives, hummus, tahini, parsley, rosemary, coriander, garlic powder, onion powder, and pepper together in a bowl until thoroughly combined; cover and refrigerate, at least 2 hour or preferably overnight.\n",
        "picture_link": "WtB0TaGot0p3aHFpGV0Rxh0Xem8tqXm"
    },
    {
        "title": "Meatloaf Grilled Cheese Sandwich",
        "ingredients": [
            "1 slice leftover meatloaf ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "2 slices bread ADVERTISEMENT",
            "1 teaspoon ketchup, or to taste ADVERTISEMENT",
            "3 slices Cheddar cheese ADVERTISEMENT",
            "1/2 teaspoon prepared yellow mustard, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place meatloaf on a microwave-safe plate; cook in the microwave on High, 30 seconds at a time, until heated through.\nMelt margarine in a non-stick skillet over medium heat. Place both bread slices in skillet over melted margarine. Build sandwich on bread slice in this order: ketchup, 1 slice Cheddar cheese, warm meatloaf slice, and mustard. Flip second slice of bread over onto sandwich; cook until bottom of sandwich is lightly browned, about 2 minutes.\nFlip sandwich with a spatula and place 1 slice Cheddar cheese on top; continue cooking until cheese melts slightly, about 1 minute. Flip sandwich over and lay remaining slice of cheese on top; cook until cheese on the bottom of sandwich is melted and crisp, about 2 minutes. Turn sandwich over; cook until cheese is melted and crisp, about 2 minutes.\n",
        "picture_link": "cEDDIKFPN/nAnqV4uS/gcXi9v/.CqB2"
    },
    {
        "title": "Crispy Chicken Croquettes with Garlic Butter Sauce",
        "ingredients": [
            "1 tablespoon LAND O LAKES® Butter ADVERTISEMENT",
            "1/4 cup finely chopped onion ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "3/4 cup chicken broth, divided ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 cups finely chopped cooked chicken ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "1/4 teaspoon hot pepper paste ADVERTISEMENT",
            "1 cup cracker crumbs ADVERTISEMENT",
            "Canola oil for frying ADVERTISEMENT",
            "Garlic Butter Sauce: ADVERTISEMENT",
            "1/3 cup LAND O LAKES® Butter ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 pinch fresh thyme ADVERTISEMENT",
            "1 pinch fresh oregano ADVERTISEMENT",
            "1 pinch fresh basil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large heavy saucepan over low heat. Add onion and cook until tender. Stir in flour; cook and stir until smooth, about 1 minute. Reduce heat if mixture browns too quickly.\nGradually add 1/2 cup of chicken broth and cook over medium heat stirring constantly until thickened and bubbly. Stir in dry mustard, salt, and chopped chicken; whisk in egg yolks.\nCook over medium heat stirring constantly for 4 to 5 minutes. Remove from heat. Refrigerate 3 to 4 hours or preferably overnight.\nCombine remaining 1/4 cup chicken broth and hot pepper paste; stir into chilled chicken mixture.\nShape chicken mixture into patties (an ice cream scoop will give you consistent size patties). Dredge patties in cracker crumbs.\nPour 1/2 inch oil into skillet. Heat to 375 degrees F (190 degrees C) over medium-high heat. When oil is hot, fry the croquettes until golden brown; do not turn the croquettes until they are well browned on the first side, 4 to 5 minutes. Turn and cook the other side, 4 to 5 minutes. Fry in batches, as needed. Drain on paper towels.\nMelt 1/3 cup butter in a skillet over medium high heat. Add garlic and cook for 30 seconds to 1 minute, stirring constantly to prevent it from burning. Stir in flour and whisk continuously for 1 minute.\nPour in the milk and herbs and continue to cook, whisking constantly, until sauce begins to thicken, about 1 minute. Ladle sauce over croquettes on serving plates.\n",
        "picture_link": "fEPevL0.L6rLRHeRfCd3hSrX1A5h6Oi"
    },
    {
        "title": "Nectarine Upside-Down Cake",
        "ingredients": [
            "Topping: ADVERTISEMENT",
            "3 tablespoons butter, at room temperature ADVERTISEMENT",
            "1/4 cup brown sugar (such as muscovado) ADVERTISEMENT",
            "4 fresh nectarines, sliced into bite-size pieces ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "11 tablespoons unsalted butter, at room temperature ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 340 degrees F (170 degrees C). Place butter in a 9-inch round cake pan and melt in the oven as it preheats.\nRemove pan from oven and sprinkle brown sugar evenly over melted butter. Arrange nectarine pieces on the brown sugar layer.\nGently whisk flour, baking powder, and salt together in a bowl. Beat unsalted butter and white sugar together in a separate bowl until creamy and smooth; add eggs, 1 at a time, beating well after each addition. Beat vanilla extract into the creamed butter mixture. Add flour mixture to creamed butter mixture; beat on low speed just until batter is combined, about 1 minute. Spread batter over nectarine layer.\nIncrease oven temperature to 350 degrees F (180 degrees C).\nBake in the preheated oven until cake is golden brown and a toothpick inserted in the center comes out clean, 35 to 40 minutes. Cool cake in pan on a wire rack for 15 minutes. Run a knife around edge of pan and invert cake onto a serving plate. Serve warm or at room temperature.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caramelized Nectarine",
        "ingredients": [
            "1 nectarine ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons plain yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut nectarine all the way around and twist open. Remove pit. Sprinkle sugar on the cut side of each nectarine half.\nPlace nectarine, cut-side down, onto a griddle or in a skillet over medium heat; cook for 1 1/2 minutes. Transfer nectarines to a plate, cut-side up, and top each with plain yogurt.\n",
        "picture_link": "zGdCEOsGfd6.T7Ulu1P4kbJhm2MxGca"
    },
    {
        "title": "Eggplant Napoleon ",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1 1/2 cups Italian-seasoned bread crumbs ADVERTISEMENT",
            "2 eggplants, peeled and sliced into 1/3-inch rounds ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "15 leaves fresh basil, or as needed ADVERTISEMENT",
            "6 large Roma tomatoes, sliced 1/8-inch thick ADVERTISEMENT",
            "2 (6 ounce) balls fresh mozzarella cheese, sliced 1/8-inch thick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk eggs together in a deep container. Pour bread crumbs in another deep container.\nDip each slice of eggplant into the eggs, covering both sides, and press into the bread crumbs until evenly coated.\nSpray a nonstick skillet with cooking spray and heat over medium heat. Arrange a layer of eggplant slices in the skillet; cook until crispy, 2 to 4 minutes. Spray tops with cooking spray and flip; continue cooking until second side is browned and eggplant is tender, 2 to 4 minutes more. Transfer to a plate. Repeat with remaining slices.\nPreheat oven to 275 degrees F (135 degrees C).\nArrange a layer of eggplant slices in the bottom of a 9x13-inch baking dish. Top each slice with a basil leaf, 1 tomato slice, and 1 slice of mozzarella cheese. Place another eggplant slice on top. Cover with remaining tomato and mozzarella cheese slices.\nBake in the preheated oven until cheese is softened, but not melted, about 5 minutes.\n",
        "picture_link": "5KiFuCNInc2c.CwgTd4UNSy3u/M9Yhi"
    },
    {
        "title": "Vegan Rose Meringues",
        "ingredients": [
            "3/4 cup aquafaba (chickpea water) ADVERTISEMENT",
            "1 teaspoon rose water ADVERTISEMENT",
            "1/4 teaspoon lemon juice, or more to taste ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C). Line 2 baking sheets with parchment paper.\nCombine aquafaba, rose water, lemon juice, and cream of tartar in a large bowl. Beat with an electric mixer until fluffy, 10 to 30 minutes. Increase speed to high and beat, gradually adding confectioners' sugar, until meringue holds stiff peaks, about 10 minutes. Scoop meringue into a piping bag fitted with a round tip.\nPipe small mounds of meringue onto prepared baking sheets.\nBake in the preheated oven, rotating sheets halfway through, until meringues are dry and firm, 1 1/2 to 2 hours. Turn off oven; keep meringues inside until cooled.\n",
        "picture_link": "ZjsvRm0gIvp3bTf7yp4Z4mQAfHvfEUm"
    },
    {
        "title": "Denver Turkey Chili Verde",
        "ingredients": [
            "1 1/2 pounds fresh tomatillos, husks removed, halved ADVERTISEMENT",
            "2 poblano peppers, seeded and halved ADVERTISEMENT",
            "2 jalapeno peppers, seeded, if desired ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large yellow onion, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 (16 ounce) package JENNIE-O® Ground Turkey ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "4 cups low-sodium chicken broth ADVERTISEMENT",
            "1 cup chopped fresh cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tomatillos, poblano peppers, and jalapenos cut side down on a baking sheet. Broil 3 inches from heat source for 3 to 5 minutes or until skins are charred.\nPlace peppers in plastic zip-top bag and seal. Let stand 10 minutes. Remove and discard skins. Place tomatillos and peppers in food processor and process until smooth. Stir in salt.\nHeat oil over medium-high heat in a large Dutch oven. Add turkey and cook as specified on the package. Always cook to well done, 165 degrees F as measured by a meat thermometer.\nAdd onion and garlic and cook 5 minutes or until tender. Add cumin and coriander. Stir in tomatillo mixture and broth. Bring mixture to a boil. Reduce heat to medium-low and simmer 20 minutes. Stir in cilantro leaves.\n",
        "picture_link": "k/uWGzqR5dFkQrB4SLevEHpRW9VyWHe"
    },
    {
        "title": "Eggless Brownies",
        "ingredients": [
            "1/2 cup chopped almonds (optional) ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 (18.25 ounce) package brownie mix with fudge packet included ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1/3 cup cold water ADVERTISEMENT",
            "1/4 cup plain nonfat yogurt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spread almonds in an 8-inch square baking pan.\nToast almonds in the preheating oven until golden brown, 3 to 5 minutes. Transfer to a bowl and let cool.\nCombine brownie mix, fudge packet, and oil in a large bowl.\nWhisk water, yogurt, and vanilla extract together in a glass measuring cup using a fork. Pour over brownie mix in the bowl; stir until batter is well-blended, 40 to 50 strokes.\nLine the baking pan with aluminum foil, leaving an overhang on each side. Spray aluminum foil with cooking spray. Pour batter into the pan. Spread almonds on top.\nBake brownies in the preheated oven until a toothpick inserted 1 inch from the edge comes out clean, 30 to 40 minutes.\nLet brownies stand until cooled, at least 15 minutes, before lifting out of the pan and cutting into squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roti Canai/Paratha (Indian Pancake)",
        "ingredients": [
            "3/4 cup warm water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "4 3/4 cups all-purpose flour ADVERTISEMENT",
            "3 1/2 tablespoons clarified butter (ghee) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "2 tablespoons ghee (clarified butter), divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix warm water, salt, and sugar together in a bowl. Put flour in a large mixing bowl; work in 3 1/2 tablespoons ghee using your fingertips.\nBeat egg and 1 teaspoon water together in a bowl; add to flour mixture. Gradually mix warm water mixture into flour mixture while kneading until dough becomes soft and pliable. Form dough into balls and let rest in a well-oiled bowl, 2 to 3 hours.\nWorking on a flat greased surface, take a dough ball and flatten it using the heel of your palm to make a paper-thin circle. Spread 1 teaspoon ghee inside it. Fold the edges together to make roti into a square. Repeat with remaining dough.\nHeat about 1 tablespoon ghee on griddle or in a skillet over medium heat; cook roti until browned, 1 to 3 minutes per side.\n",
        "picture_link": "NJrhrZ4/78764ADaJzn8Deki7O47jue"
    },
    {
        "title": "Pineapple and Mango Skewers with Coconut Dip",
        "ingredients": [
            "1/2 cup unsalted raw cashews ADVERTISEMENT",
            "3/4 cup coconut milk ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "1 fresh pineapple, peeled and cut into cubes ADVERTISEMENT",
            "1 fresh mango, peeled and cut into cubes ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak cashews in a bowl of water for 1 to 2 hours; drain.\nBlend soaked cashews, coconut milk, honey, and coconut oil in a blender until dip is smooth. Transfer dip to a bowl, cover, and refrigerate.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Spread flaked coconut onto a baking sheet.\nBroil coconut in the preheated oven, watching the whole time, until coconut is toasted, 10 seconds to 1 minute. Remove baking sheet from oven and cool coconut.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate. Thread pineapple and mango onto skewers.\nPlace skewers onto the preheated grill; cook, turning once, about 1 minute per side.\nSprinkle toasted coconut over dip and serve alongside skewers.\n",
        "picture_link": "C6XwvxhH9E3EG2QEyPmJTeFel5P9ssG"
    },
    {
        "title": "Horsey Beef Pretzel Bites",
        "ingredients": [
            "24 Original Snack Factory® Pretzel Crisps® ADVERTISEMENT",
            "8 ounces thinly sliced deli roast beef, cut or torn into bite-size pieces ADVERTISEMENT",
            "8 ounces sliced smoked mozzarella cheese, cut into 24 pieces ADVERTISEMENT",
            "1/4 cup thinly sliced red onion ADVERTISEMENT",
            "2 tablespoons prepared horseradish ADVERTISEMENT",
            "1 tablespoon chopped fresh chives (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange Pretzel Crisps(R) onto a large tray. Top with roast beef and a piece of mozzarella cheese. Add a slice or 2 of red onion. Put a dollop (about 1/4 teaspoon) of horseradish on the onion. Garnish with chives.\n",
        "picture_link": "c7yb/T4YK5c1tGR0zSSbZuwoT0UNpBS"
    },
    {
        "title": "Moroccan Eggplant Dip",
        "ingredients": [
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cayenne ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 pounds eggplant, unpeeled, cut into chunks ADVERTISEMENT",
            "1 red bell pepper, seeded and cut into chunks ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tomato sauce, red wine vinegar, cumin, salt, sugar, and cayenne together in a small bowl.\nHeat olive oil in a large skillet over medium-low heat. Add garlic; cook and stir until golden, about 2 minutes. Add eggplant and red bell pepper; pour in tomato sauce mixture. Simmer, covered, until eggplant and red bell pepper soften, about 20 minutes. Remove from heat and let cool, about 10 minutes.\nTransfer eggplant mixture to a food processor; pulse until it reaches the desired consistency. Sprinkle cilantro over dip.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cinnamon Sugar Pecan Dip",
        "ingredients": [
            "1 (8 ounce) container brown sugar and cinnamon cream cheese ADVERTISEMENT",
            "8 ounces vanilla Greek yogurt ADVERTISEMENT",
            "4 ounces fat-free frozen whipped topping, thawed ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 (7.2 ounce) package Snack Factory® Original Pretzel Crisps® ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine the cream cheese and yogurt. Mix until well blended and smooth.\nGently fold in the whipped topping and nuts until combined.\nChill 30 minutes. Sprinkle top with nuts and cinnamon and serve.\n",
        "picture_link": "5F8bULpLdCq8ArMtYYVK0pdLmNdJNsm"
    },
    {
        "title": "Dylan's Salmon Jerky",
        "ingredients": [
            "1 cup soy sauce ADVERTISEMENT",
            "6 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon rock salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "4 pounds salmon fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix soy sauce, brown sugar, rock salt, and black pepper together in a saucepan; bring to a boil and cook until sugar and salt are dissolved, 2 to 3 minutes. Remove saucepan from heat and cool marinade.\nCut salmon into strips, with or without the skin. Pour marinade into a shallow bowl and lay salmon strips into the shallow bowl. Refrigerate for 45 minutes.\nPreheat oven to 185 degrees F (85 degrees C). Line a baking sheet with aluminum foil and place a wire rack on top. Lay salmon strips on the wire rack, discarding extra marinade.\nPlace the sheet of salmon in the oven until dehydrated, about 8 hours.\n",
        "picture_link": "7.gGxMTocTdV0HTWtliOcPFDa77pqgS"
    },
    {
        "title": "One-Pot Clambake",
        "ingredients": [
            "2 1/2 pounds small (about 2-inch diameter) Red Bliss potatoes ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon coriander seeds ADVERTISEMENT",
            "1 teaspoon fennel seeds ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon black peppercorns ADVERTISEMENT",
            "1 (750 milliliter) bottle dry white wine, such as Sauvignon Blanc ADVERTISEMENT",
            "1 (1 pound) cooked chorizo sausage (preferably Spanish), cut into 8 pieces ADVERTISEMENT",
            "4 (1 1/2) pounds lobsters ADVERTISEMENT",
            "48 littleneck clams, scrubbed ADVERTISEMENT",
            "4 ears fresh corn, husked and halved crosswise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1 gallon of water into a lobster pot or stockpot large enough to hold all ingredients. Add potatoes and salt and bring to a boil. Cook, covered, 10 minutes (potatoes will be slightly softened but not cooked through).\nPut coriander, fennel, thyme, and peppercorns in a large piece of cheesecloth. Gather edges together and tie with kitchen string to make a pouch.\nAdd spice pouch, wine, chorizo, and lobsters to pot with potatoes. Boil, covered, 5 minutes. Add clams and corn and cook, covered, until lobsters are cooked and clams have opened, about 5 minutes (discard any unopened clams).\nCut each lobster in half using a heavy knife and kitchen shears. Serve each person half a lobster, 6 clams, half an ear of corn, 2 potatoes, and a piece of chorizo.\n",
        "picture_link": "9NwaycXImGToEI7HuCv8xFMGgdf5EQW"
    },
    {
        "title": "Cranberry Orange Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 orange, zested ADVERTISEMENT",
            "6 tablespoons unsalted butter, chilled ADVERTISEMENT",
            "2/3 cup Original Unsweetened Almond Breeze Almondmilk ADVERTISEMENT",
            "1 orange, juiced ADVERTISEMENT",
            "1 cup fresh or frozen cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F.\nIn a bowl, whisk together flour, sugar, baking powder, salt and orange zest. Cut butter into small cubes and cut into mixture until coarse and crumbly. Stir in Almond Breeze Almondmilk and orange juice, then fold in the cranberries.\nOn a floured surface, knead dough until it just comes together. Pat into a 1-inch round, cut into 8 wedges and place on a baking sheet. Brush tops with Almond Breeze Almondmilk, sprinkle with sugar and bake until golden brown for 12-15 minutes.\n",
        "picture_link": "CVrOiC6ujyzDqaOd7cxk50L8BqoPSrW"
    },
    {
        "title": "Jalapeno and Canadian Bacon Breakfast Quesadillas",
        "ingredients": [
            "3 tablespoons unsalted butter, divided ADVERTISEMENT",
            "2 jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "3 slices Jones Dairy Farm Canadian Bacon, chopped ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "2 tablespoons whole milk ADVERTISEMENT",
            "1 teaspoon extra virgin olive oil ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1 cup shredded Mexican blend cheese, divided ADVERTISEMENT",
            "2 ounces cream cheese, softened ADVERTISEMENT",
            "2 flour tortillas ADVERTISEMENT",
            "2 green onions, sliced ADVERTISEMENT",
            "Sour cream (optional) ADVERTISEMENT",
            "Salsa (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In non-stick omelet pan, melt 1 tablespoon butter over medium heat.\nAdd peppers and cook for 2-3 minutes, tossing frequently. Add Canadian Bacon and cook for another 1-2 minutes, tossing frequently. Remove to paper-towel lined plate.\nIn medium mixing bowl, whisk together eggs and milk, beating until frothy.\nWipe out omelet pan, add 1 tablespoon butter and extra virgin olive oil to pan and heat over medium low heat.\nOnce butter is melted, pour in eggs. Sprinkle sea salt over eggs and let sit for about 3 minutes, adjusting temperature as necessary to ensure a low, slow cook without burning the bottom. Once sides are set but middle is still wet, sprinkle 1/3 cup cheese, peppers and Canadian Bacon over eggs. Cook for 1 minute, then loosen edges with silicone spatula and flip eggs. Aim for mostly one large piece of egg, any cracks will slightly repair when other side cooks. Cook until bottom is set, 2-3 minutes, then slide onto plate and set aside.\nSpread cream cheese over tortillas.\nPlace cast iron skillet over medium heat and add 1/2 tablespoon butter. Once melted, place prepared tortilla in pan, cream cheese side up. Sprinkle 1/3 cup cheese over entire surface and place half of the eggs over one half of tortilla. Sprinkle half of green onions over eggs. Cook over medium to medium-low heat until cheese is melted, then fold in half.\nRemove to cutting board and let sit for 1-2 minutes before slicing. Repeat with other tortilla and remaining eggs. Serve with sour cream and salsa.\n",
        "picture_link": "24zCtgVJLyr1mMy5IsA8c5pWAMME1Xq"
    },
    {
        "title": "\"PJ Special\" Grilled Cheese",
        "ingredients": [
            "1 cup shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "4 teaspoons horseradish mustard (such as Silver Spring® Beer'n Brat®) ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "2 teaspoons softened butter, or to taste ADVERTISEMENT",
            "2 slices whole grain bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix Cheddar cheese, horseradish mustard, garlic, salt, pepper, and cayenne pepper together in a bowl.\nSpread 1 teaspoon butter on one side of a slice of bread. Flip; spread Cheddar cheese mixture evenly over unbuttered side. Top with the other slice of bread. Spread 1 teaspoon butter on top.\nPreheat a griddle over medium-high heat. Place sandwich on the griddle and press down with a spatula to flatten slightly. Cook until browned, 2 to 3 minutes. Flip and continue cooking until second side is browned, 2 to 3 minutes more.\n",
        "picture_link": "gKoYqcrYqVZ.oq2sFZOZxCfExqgPnhm"
    },
    {
        "title": "Black Lentil Veggie Soup",
        "ingredients": [
            "1 1/2 cups black lentils ADVERTISEMENT",
            "2 quarts vegetable broth ADVERTISEMENT",
            "3 cups diced tomatoes ADVERTISEMENT",
            "10 carrots, peeled and diced ADVERTISEMENT",
            "1 onion, cut into 1/2-inch dice ADVERTISEMENT",
            "2 small turnips, peeled and diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "2 tablespoons minced ginger ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place black lentils in a microwave-safe bowl and cover with 4 cups water. Microwave until softened, about 5 minutes. Stir and add more water if needed. Microwave for 5 minutes more. Drain and rinse.\nCombine vegetable broth, tomatoes, carrots, onion, turnips, green bell pepper, butter, ginger, garlic, coriander, cumin, and salt in a large slow cooker. Stir in lentils.\nCook on High until carrots are tender, 4 to 6 hours.\n",
        "picture_link": "QKFBAzOcZ2QQuptRVmv1BN2havLLoEm"
    },
    {
        "title": "Pico Spinach Artichoke Dip",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (8 ounce) package light cream cheese, softened ADVERTISEMENT",
            "1 (3 ounce) package light cream cheese, softened ADVERTISEMENT",
            "1/2 cup light mayonnaise ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "12 ounces pico de gallo ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup grated Romano cheese ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch baking dish with cooking spray.\nMix both packages of cream cheese and mayonnaise together in a bowl until smooth. Fold in artichoke hearts, pico de gallo, spinach, Parmesan cheese, Romano cheese, and garlic.\nSpread cream cheese mixture in the prepared baking dish. Cover with aluminum foil.\nBake in the preheated oven until hot and bubbly, about 20 minutes.\n",
        "picture_link": "0iaTPSTOljVy3e.kUuUooTNvFVPKl22"
    },
    {
        "title": "Cheesy Cauliflower Pizza Crust ",
        "ingredients": [
            "1 head cauliflower, broken into florets ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup finely shredded mozzarella cheese ADVERTISEMENT",
            "1/2 teaspoon oregano ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nPlace cauliflower florets in a food processor; pulse until chopped into grains the size of rice.\nFill a large pot with about 1 inch of water; bring to a boil. Add cauliflower \"rice\"; cook until softened, 4 to 5 minutes. Drain in a fine sieve and cool until running water.\nPour cauliflower onto a clean dish towel; roll up and twist edges. Wring out as much water as possible.\nTransfer cauliflower to a large bowl. Add egg, mozzarella cheese, oregano, and salt; mix well. Spread on the lined baking sheet to about 1/2-inch thickness.\nBake in the preheated oven until firm to the touch and light golden brown in color, about 35 minutes.\n",
        "picture_link": "QZSoKeV8PoThg/qH70XY6BlMpKwD/b."
    },
    {
        "title": "Pumpkin Coffee Cake with a Brown Sugar Glaze",
        "ingredients": [
            "1 teaspoon butter ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1 (18 ounce) package yellow cake mix ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan with 1 teaspoon butter.\nMix pumpkin puree, eggs, water, 1 tablespoon vanilla extract, and pumpkin pie spice together in a large bowl. Stir in yellow cake mix and baking soda until just combined. Pour batter into the prepared baking pan.\nMix 1/2 cup brown sugar, flour, and melted butter in a small bowl until crumbly; sprinkle over the batter with your fingers.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 25 to 30 minutes.\nCombine 1/2 cup brown sugar, heavy cream, white sugar, and 1 teaspoon vanilla extract in a saucepan; bring to a simmer over medium heat. Remove from heat and stir until brown sugar and white sugar are dissolved and glaze is smooth.\nPoke holes all over the top of the cake with a toothpick. Pour glaze evenly over cake.\n",
        "picture_link": "VPUvZlVv1wMvELQEZ4x11.iW3RrmHn2"
    },
    {
        "title": "Mexican-Style Shrimp Cocktail",
        "ingredients": [
            "1 cup clam juice ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "1 1/4 cups peeled, seeded, diced ripe tomatoes ADVERTISEMENT",
            "1 cup diced English cucumber ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "1/2 cup finely diced red onion ADVERTISEMENT",
            "2 tablespoons seeded and diced jalapeno peppers ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "2 tablespoons freshly chopped cilantro, plus more for garnish ADVERTISEMENT",
            "Mexican-style hot sauce, to taste ADVERTISEMENT",
            "1 large Hass avocado, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place clam juice and oregano in a saucepan; bring to a boil over medium-high heat. Add shrimp and stir just until shrimp turn pink and are not quite cooked through, about 2 minutes. Transfer shrimp to a bowl with a slotted spoon. Reserve liquid. Let shrimp cool to room temperature.\nPlace chopped tomatoes, cucumbers, celery, red onion, and jalapenos is a mixing bowl. Add ketchup, cooking liquid from the shrimp, lime juice, cilantro, and hot sauce. Gently mix until ingredients are well blended.\nChop shrimp into bite-size pieces, leaving a few whole for garnishes. Stir chopped pieces into the vegetable mixture. Wrap mixing bowl with plastic wrap. Place reserved shrimp in a bowl; wrap with plastic wrap. Refrigerate shrimp cocktail and reserved shrimp until thoroughly chilled, 2 to 3 hours.\nIf mixture seems a bit thick, add a little tomato juice or pickle juice. Stir in avocado cubes. Serve, if possible, in clear glass bowls. Top with reserved whole shrimp and some cilantro leaves.\n",
        "picture_link": "HGZX7LUtY2fi9DDUWBrZh7HKqrOcbsC"
    },
    {
        "title": "Vegetarian Quinoa Frittatas",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "1 1/4 cups shredded zucchini ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "3/4 cup drained and rinsed black beans ADVERTISEMENT",
            "6 tablespoons shredded Parmesan cheese, divided ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, quinoa, and olive oil in a saucepan; bring to a boil. Stir rosemary into the quinoa mixture. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water is absorbed, 15 to 20 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Grease 6 muffin cups.\nMix quinoa mixture, zucchini, mozzarella cheese, black beans, 1/4 cup Parmesan cheese, eggs, egg whites, and white pepper together in a large bowl. Spoon mixture into each muffin cup and top with remaining Parmesan cheese.\nBake in the preheated oven until set in the middle and edges are golden brown, 25 to 30 minutes. Cool for 5 minutes in the muffin cups.\n",
        "picture_link": "nhX.v640u1f6td2uUzv.FYwLaFKYht6"
    },
    {
        "title": "Seattle-Style Turkey Lettuce Wraps",
        "ingredients": [
            "1 (16 ounce) package JENNIE-O® Lean Ground Turkey ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon fresh grated ginger ADVERTISEMENT",
            "2 tablespoons HOUSE OF TSANG® ginger-flavored soy sauce ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh mint leaves ADVERTISEMENT",
            "1 head butter lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook turkey as specified on the package. Always cook to well done, 165 degrees F as measured by a meat thermometer.\nAdd garlic, ginger, soy sauce, brown sugar, green onions and red bell pepper. Cook 7 minutes or until garlic is soft.\nStir in mint leaves. Immediately transfer meat to a shallow dish and chill 1 hour.\nRemove core from head of lettuce; separate, wash and dry leaves.\nSpoon chilled turkey mixture in lettuce cups.\n",
        "picture_link": "i4iRLRF/n7n6lN1Lwlg47s5aI1RPNzO"
    },
    {
        "title": "Pumpkin Pie Mug Cake",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1/4 cup dark brown sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup canned pumpkin puree ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crack egg into a microwave-safe mug. Whisk in brown sugar. Add flour, pumpkin puree, white sugar, vanilla extract, cinnamon, ginger, nutmeg, and salt; whisk until well blended.\nCook in the microwave on high until puffed and golden, about 1 minute 15 seconds.\n",
        "picture_link": "4aYZYbX67a4WS.zByuGwWp/epexbRo2"
    },
    {
        "title": "Buche de Noel (Yule Log)",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "1/3 cup all-purpose flour, sifted ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 teaspoon fine salt ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "3/4 cup confectioners' sugar, divided ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Whipped Cream Filling: ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "3 tablespoons confectioners' sugar ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "Chocolate Ganache: ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "8 ounces dark chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch jelly roll pan with 1 teaspoon butter and line with parchment paper. Grease parchment paper with 1 teaspoon butter.\nWhisk flour, cocoa powder, and salt together in a small bowl.\nCombine egg yolks, 1/4 cup confectioners' sugar, and vanilla extract in a bowl; beat with an electric mixer on medium-high speed until pale yellow, 3 to 4 minutes.\nClean the beaters of the electric mixer. Beat egg whites in a bowl on medium-high speed until foamy, 1 to 2 minutes. Gradually add 1/2 cup confectioners' sugar and beat until stiff peaks form, 2 to 3 minutes more.\nFold egg yolk mixture gently into the egg whites. Fold flour mixture in gradually until batter is smooth.\nPour batter into the prepared jelly roll pan and spread evenly with an offset spatula.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 8 to 10 minutes. Let cool, about 30 minutes.\nCombine 1 cup heavy cream, 3 tablespoons confectioners' sugar, and sour cream in a bowl; blend with an electric mixer on medium-high speed until stiff, 1 to 2 minutes.\nTurn the jelly roll pan so the shorter side faces you. Spread whipped cream over the cake, leaving a 2-inch border at the top. Roll up cake toward the uncovered border, letting the parchment paper fall away as you roll. Place roll seam-side down on a serving platter.\nPlace 1/2 cup heavy cream in a small saucepan over medium-low heat until warmed through, 3 to 5 minutes. Remove from heat and stir in chocolate chips. Let stand until chocolate softens, about 3 minutes. Stir with a spatula or wooden spoon until ganache is smooth and creamy.\nDrizzle chocolate ganache over rolled cake. Let stand until set, about 5 minutes. Run a fork through the ganache to create a tree bark effect.\n",
        "picture_link": "O/gW95ari0PM67mQ7ni/SSKjitzuF3S"
    },
    {
        "title": "Guatemalan Chilaquilas ",
        "ingredients": [
            "1 large tomato, quartered ADVERTISEMENT",
            "1 red onion, quartered ADVERTISEMENT",
            "1 (12 ounce) package queso fresco, cut into chunks ADVERTISEMENT",
            "12 thick corn tortillas ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "5 tablespoons canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomato and red onion in a food processor; blend, slowly adding queso fresco, until a paste forms.\nFold corn tortillas in half and fill them with the tomato and red onion paste.\nBeat egg whites in a bowl with an electric mixer until foamy. Add egg yolks one by one, mixing thoroughly until blended into the egg whites.\nHeat 2 to 3 tablespoons oil in a large skillet over medium heat. Dip 1 filled tortilla into the egg mixture to coat both sides, letting excess drip back into the bowl. Cook until golden brown, about 2 minutes per side. Repeat with remaining oil and filled tortillas.\n",
        "picture_link": "FJqmhwmB6jgfiOLceJWvBNsfHOh8z4O"
    },
    {
        "title": "Butternut Squash Coconut Curry",
        "ingredients": [
            "2 cups diced butternut squash ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon mustard seeds ADVERTISEMENT",
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1 (15 ounce) can coconut milk ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine squash, water, olive oil, salt, mustard seeds, cumin seeds, cayenne pepper, and turmeric in a saucepan; bring to a boil. Reduce heat and simmer, stirring occasionally, until squash is tender, 10 to 15 minutes.\nStir coconut milk and beans into the squash mixture; simmer until flavors blend, about 10 minutes. Serve curry with cilantro on top.\n",
        "picture_link": "YqUKgMmSv0R2/rQU4Re.WpZqdC4U8pC"
    },
    {
        "title": "Italian Sausage Stuffing",
        "ingredients": [
            "1 (19 ounce) package Johnsonville® Italian Mild Sausage Links, casings removed ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "3 medium garlic cloves, minced ADVERTISEMENT",
            "12 cups unseasoned cubed bread stuffing ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 tablespoon minced fresh basil ADVERTISEMENT",
            "1 teaspoon rubbed sage ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 medium eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F.\nIn large skillet, cook sausage over medium heat until no longer pink; drain.\nRemove sausage from skillet; set aside. In the same skillet, melt butter.\nAdd the celery, onion, green pepper, and garlic; saute until tender, about 5 minutes\nIn a very large bowl, combine the sausage, celery mixture, cubed stuffing, cheese, olives, and seasonings.\nAdd chicken broth and eggs; toss to combine.\nSpoon into a buttered 3-qt baking dish. Cover and bake for 1 hour.\nUncover; bake 10 minutes longer or until lightly browned and a meat thermometer inserted into the center reads 160 degrees F.\n",
        "picture_link": "4BPNqY7e/jIJu7nD.KbCSdM2OhcTdPu"
    },
    {
        "title": "Oatmeal Almond Butter Bites",
        "ingredients": [
            "2 1/2 cups rolled oats ADVERTISEMENT",
            "1 cup almond butter ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup chia seeds ADVERTISEMENT",
            "1/4 cup ground flax seeds ADVERTISEMENT",
            "1/4 cup finely shredded unsweetened coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oats, almond butter, chocolate chips, honey, chia seeds, ground flax seeds, and coconut in a stand mixer fitted with the paddle attachment. Beat together, gradually increasing speed, until mixture no longer sticks to the center of the paddle.\nShape mixture into 1-inch balls with your hands. Place on a baking sheet lined with parchment paper.\nFreeze balls until firm, about 30 minutes. Transfer to an airtight container and store in the refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Applesauce Pumpkin Spice Bread ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 1/2 cups unbleached all-purpose flour ADVERTISEMENT",
            "3 tablespoons ground cinnamon ADVERTISEMENT",
            "1 1/2 tablespoons ground nutmeg ADVERTISEMENT",
            "2 teaspoons ground cloves ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "2 cups dark brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup unsweetened applesauce ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "1 (15 ounce) can solid-pack pumpkin ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 loaf pans with cooking spray.\nMix flour, cinnamon, nutmeg, cloves, ginger, baking soda, salt, and baking powder together in a large bowl.\nCombine brown sugar, white sugar, applesauce, and eggs in a large bowl. Add pumpkin and mix well. Add flour mixture alternately with water, mixing well between additions. Divide between the prepared loaf pans.\nBake loaves in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 65 minutes. Cool in pans for 10 minutes. Invert onto a wire rack to cool completely.\n",
        "picture_link": "qx53zP/gOBrv7HZu13wYm3DCTwK1HKa"
    },
    {
        "title": "Bacon and Blue Cheese Potato Pancakes",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "2 pounds potatoes, cubed ADVERTISEMENT",
            "1/3 cup crumbled blue cheese ADVERTISEMENT",
            "1/4 cup 1% low-fat milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 green onions, thinly sliced ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until browned and crisp, about 10 minutes. Drain on paper towels; chop into smaller pieces.\nPlace potatoes in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 10 minutes. Drain and return to the pot; mash slightly.\nStir bacon, blue cheese, milk, egg, green onions, salt, and pepper into the pot; mash mixture with a potato masher to desired consistency. Cool slightly, about 5 minutes.\nPour bread crumbs into a shallow bowl. Shape the potato mixture into twelve 1/2-inch thick cakes; dredge in bread crumbs.\nHeat olive oil and butter in a large nonstick skillet over medium heat. Add 4 potato cakes; cook until browned, about 2 minutes per side. Repeat with remaining potato cakes. Cover and keep warm.\n",
        "picture_link": "h8PO8iZKmLMaLGfsPtcwmDZeK1LrI9u"
    },
    {
        "title": "Pumpkin Oatmeal Cookies for Two",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1/4 cup pumpkin puree ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet with cooking spray.\nMix oats, pumpkin puree, sugar, egg white, baking powder, baking soda, and cinnamon together in a bowl. Divide into 2 portions on the greased baking sheet.\nBake in the preheated oven until golden brown, about 10 minutes.\n",
        "picture_link": "tSQruSvjl.1Y/z8jZ.S7X3x7rsMf.2m"
    },
    {
        "title": "Creamy Taco Dip",
        "ingredients": [
            "2 cups plain Greek yogurt ADVERTISEMENT",
            "1 (1.25 ounce) package McCormick® Taco Seasoning Mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix 2 cups plain Greek yogurt with 1 package McCormick(R) Taco Seasoning Mix until well blended. Refrigerate until cool, serve and enjoy.\n",
        "picture_link": "0BV3czfLGyH8g45QKy6hVhKRk23sbly"
    },
    {
        "title": "Sloppy Boats",
        "ingredients": [
            "4 (6-inch) crusty sandwich rolls, unsplit ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (15 ounce) can sloppy joe sauce ADVERTISEMENT",
            "1 cup Borden® Mild Cheddar Shreds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCut a hole at the top of each sandwich roll and hollow out the bread leaving about a 1/2 inch shell (discard the extra bread or save for another use). Place rolls on a rimmed baking sheet.\nLightly oil a skillet and place over medium to medium-high heat. Cook ground beef and stir to crumble. Cook until no longer pink, about 10 minutes. Use a paper towel to sop up any grease, if necessary.\nPour sloppy joe sauce over the beef and continue cooking until heated through, about 5 minutes.\nEvenly spoon beef mixture into each sandwich roll and top with shredded Cheddar cheese.\nBake in preheated oven until cheese is melted, about 10 minutes.\n",
        "picture_link": "M0mcXs4YAARo2QAOjNd8vUmed.2xh8K"
    },
    {
        "title": "Steak and Egg Hash",
        "ingredients": [
            "1 beef sirloin steak, sliced ADVERTISEMENT",
            "1 pound potatoes, cut into small pieces ADVERTISEMENT",
            "Salt and ground black pepper to taste ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "4 Eggland's Best Eggs, large ADVERTISEMENT",
            "1 cup cherry tomatoes, halved ADVERTISEMENT",
            "Dried Italian seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the steak in the cast iron skillet over medium heat, flipping half way through until entirely cooked through. Remove to a plate and reserve the drippings in the skillet.\nAdd the potatoes to the skillet and season with salt and pepper.\nCook, stirring occasionally, until tender, (8 to 12 minutes).\nAdd the onion and cook until lightly browned and the potatoes are cooked through, (3 to 5 minutes).\nCut steak into pieces and return to skillet, reduce the heat to low.\nMake 4 shallow wells in the potato mixture and crack an egg into each one.\nScatter the tomatoes throughout the skillet and cover; cooking until the egg whites are set but the yolks are still runny ( 6 to 12 minutes)\nSeason the eggs with salt and pepper, sprinkle with Italian Seasoning, and enjoy!\n",
        "picture_link": "r8CUwcHHbbI9a8Lt0SzimSh3s03b4ui"
    },
    {
        "title": "Dijonnaise™ Potatoes",
        "ingredients": [
            "6 potatoes, thinly sliced ADVERTISEMENT",
            "1 large onion, cut into matchstick-size pieces ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup milk, or more as needed ADVERTISEMENT",
            "1/4 cup Dijon-mayonnaise blend (such as Hellman's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine potatoes and onion in a microwave-safe bowl. Sprinkle garlic powder over mixture and add water. Cover bowl and heat in microwave on high until potatoes are tender, 8 to 10 minutes.\nCombine butter and flour in a saucepan over medium heat; cook, stirring constantly, until butter is melted, 2 to 3 minutes. Slowly add milk and cook, stirring constantly, until mixture is the consistency of gravy, 2 to 3 minutes. Reduce heat; stir in Dijon-mayonnaise blend and mix well. Remove from heat and cover.\nDrain water from potatoes and pour gravy mixture over potatoes; stir to coat. Cover bowl and microwave on medium until flavors combine, 3 to 5 minutes. Let stand for 5 minutes before serving.\n",
        "picture_link": "DNt9A3wBY1xisdBbzgFHsdO4K6FqVpS"
    },
    {
        "title": "Honduran Baleadas",
        "ingredients": [
            "Tortillas: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "2 cups refried beans, warmed ADVERTISEMENT",
            "1 avocado, sliced ADVERTISEMENT",
            "1/2 cup crumbled queso fresco (fresh white cheese) ADVERTISEMENT",
            "1/4 cup crema fresca (fresh cream) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, water, vegetable oil, egg, and salt in a large bowl; knead until dough is smooth and no longer sticky.\nForm the dough into 8 golf ball-sized balls. Cover and let rest, about 20 minutes.\nStretch each ball of dough into a thick tortilla.\nHeat a large skillet over medium-high heat. Cook each tortilla until browned and lightly puffed, about 1 minute per side.\nLayer refried beans, avocado, and queso fresco over tortillas. Drizzle crema on top; fold tortillas in half over filling.\n",
        "picture_link": "iZc.Dn99.ZVo6DkDwmfiU4Fa/CTsV.O"
    },
    {
        "title": "Tunisian Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup couscous ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "2 zucchini, chopped ADVERTISEMENT",
            "1 potato, chopped ADVERTISEMENT",
            "20 green beans, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "2 tablespoons tomato puree ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon red chile powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a pot over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Mix in couscous; cook and stir until browned, about 5 minutes.\nStir in water, zucchini, potato, green beans, carrots, tomato puree, coriander, chile powder, cumin, and salt; bring to a boil. Simmer until tender, about 20 minutes. Stir in milk.\n",
        "picture_link": "MFATM7NHQ8H5/8le7Ch10yCXZbMpX7m"
    },
    {
        "title": "Slow Cooker Cactus Chili",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 (28 ounce) cans diced tomatoes ADVERTISEMENT",
            "2 (15.25 ounce) cans black beans, drained ADVERTISEMENT",
            "2 (15.25 ounce) cans yellow corn, drained ADVERTISEMENT",
            "1 (30 ounce) jar diced nopales (cactus) ADVERTISEMENT",
            "1 (8 ounce) can tomato paste ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 chipotle pepper, chopped ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ground beef and onion in a large skillet over medium heat; cook and stir until beef is browned, about 5 minutes.\nTransfer beef and onion to a slow cooker. Stir in diced tomatoes, black beans, corn, nopales, tomato paste, chili powder, sugar, chipotle pepper, garlic powder, cumin, salt, and pepper.\nCook on Low until flavors combine, about 4 hours.\n",
        "picture_link": "OZxdjE2pMwkXy8m7ixlsEl0POr.civG"
    },
    {
        "title": "Grandma's Armenian Rice Pilaf",
        "ingredients": [
            "1 1/2 cups long-grain white rice ADVERTISEMENT",
            "3 1/2 cups chicken broth ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup crushed Italian vermicelli (very thin noodles) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak rice in a bowl of water for 10 minutes. Drain.\nBring chicken broth to a boil in a large saucepan.\nMelt butter in a skillet over medium heat. Add vermicelli; cook and stir until brown, 2 to 3 minutes. Add rice; cook and stir until combined, about 1 minute. Pour into boiling broth. Reduce heat to low and simmer, covered, until rice is tender, about 20 minutes.\nSeason rice with salt and pepper; fluff with a fork.\n",
        "picture_link": "VsAN7TfDjI5UXcadaffGZesQzIqyf2O"
    },
    {
        "title": "10-Minute Rice Cakes",
        "ingredients": [
            "1/2 cup cooked white rice ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon chopped fresh basil (optional) ADVERTISEMENT",
            "1 teaspoon milk ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 teaspoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix rice, egg, basil, milk, salt, and pepper together in a bowl.\nMelt butter in a skillet over medium heat. Pour rice mixture into the skillet in 2 equal portions. Cook until browned on the bottom, about 3 minutes. Flip and continue cooking until second side is browned, about 2 minutes more.\n",
        "picture_link": "Px5Yblnvo1i.wJcuXa7dlnvl0rE/CBG"
    },
    {
        "title": "Big Ray's Paleo Roasted Cauliflower",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 teaspoons dried dill weed ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 large head cauliflower, cut into florets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Grease a 2-quart glass casserole dish with cooking spray.\nMix olive oil, dill, garlic, lemon juice, cumin, salt, and pepper together in a bowl. Add cauliflower; mix until coated. Spread in the prepared dish.\nRoast in the preheated oven, turning halfway through, until tender, about 25 minutes. Transfer to a platter; spoon any juices left in the dish on top.\n",
        "picture_link": "n50nzn7ZnzBy9kwlRv9FehWIgFPPA0K"
    },
    {
        "title": "Open-Faced Tuna Melt Sandwich",
        "ingredients": [
            "2 (3 ounce) pouches white albacore tuna, drained ADVERTISEMENT",
            "3 tablespoons Primal Kitchen™ Avocado Oil Mayonnaise, plus more for spreading ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons finely chopped red onion, or more to taste ADVERTISEMENT",
            "2 teaspoons capers, drained ADVERTISEMENT",
            "2 tablespoons chopped cornichons ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/4 teaspoon fresh or dried thyme leaves ADVERTISEMENT",
            "Sea salt and freshly ground black pepper to taste ADVERTISEMENT",
            "3 slices whole wheat or whole grain bread ADVERTISEMENT",
            "6 thin slices tomato ADVERTISEMENT",
            "3 large slices Gruyere, white Cheddar, or provolone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set the oven to broil and move the rack to the highest position.\nIn a medium bowl, combine tuna, mayonnaise, mustard, red onion, capers, cornichons, lemon juice, thyme, salt, and pepper and stir thoroughly until combined. Leave the tuna in slightly large chunks, if possible.\nArrange bread on a baking sheet and spread mayonnaise on each slice. Divide tuna salad evenly among slices, then top each with 2 slices of tomato and 1 slice of cheese.\nBroil tuna melts until cheese is golden brown and bubbling, 3 to 4 minutes. Serve warm.\n",
        "picture_link": "zc3mgelKs44708vT9pzm26967AuFEU6"
    },
    {
        "title": "Paleo Toasted Maple Pecans",
        "ingredients": [
            "3/4 cup pecan halves ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "3 tablespoons pure maple syrup, or more to taste ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over medium heat; add pecans and lower heat to medium-low. Cook, stirring constantly, until pecans are lightly crisp and turn a darker brown, about 5 minutes. Remove skillet from stove and slightly cool pecans.\nMix butter into warm pecans and toss to coat. Turn heat to medium; add maple syrup and stir pecans with a heat-proof or wooden spoon until syrup begins to bubble, 1 to 2 minutes. Turn heat down to low and continue stirring pecans until syrup begins to caramelize onto the pecans, about 5 minutes more. Remove skillet from heat, sprinkle salt over pecans, and stir.\n",
        "picture_link": "1JGoG4C3GY25Xdha.i6mhkjb2Dje8pi"
    },
    {
        "title": "Root Beer Float Cookies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon root beer concentrate ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup white chocolate chips, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 baking sheets.\nBeat butter, brown sugar, and white sugar together in a bowl with an electric mixer until creamy; beat in pudding mix. Add eggs and root beer concentrate; stir in flour and baking soda. Fold chocolate chips into the dough.\nDrop spoonfuls of dough 2 inches apart on the baking sheets.\nBake in the preheated oven until golden, 8 to 10 minutes.\n",
        "picture_link": "m65XsR6OcN/Y3Tc/rBF7Z4StbM1jbmG"
    },
    {
        "title": "Gingerbread Overnight Oats",
        "ingredients": [
            "1/2 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 tablespoons chopped pecans ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "1 teaspoon gingerbread spice (see recipe below) ADVERTISEMENT",
            "1 tablespoon raisins (optional) ADVERTISEMENT",
            "Gingerbread Spice: ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "2 tablespoons ground ginger ADVERTISEMENT",
            "2 tablespoons ground allspice ADVERTISEMENT",
            "1 tablespoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon ground cloves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add Quaker(R) Oats to your container of choice, pour in milk, add in raisins and pecans.\nSweeten by topping with brown sugar and gingerbread spice before refrigerating overnight.\nRise, shine, and enjoy!\n",
        "picture_link": "29E/2aaEtaiUP9/kQEzYnJoK4eh6c32"
    },
    {
        "title": "Almond Joy® Cookies",
        "ingredients": [
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "1 ripe banana ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "5 cups chocolate chips ADVERTISEMENT",
            "2 cups sweetened flaked coconut ADVERTISEMENT",
            "2 cups chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets.\nCombine flour, baking soda, and salt in a bowl.\nBeat white sugar, brown sugar, and banana together in a separate bowl until smooth and creamy; beat in eggs, 1 at a time, until well mixed. Stir in vanilla extract.\nStir banana mixture into flour mixture until batter is well mixed; fold in chocolate chips, coconut, and almonds. Drop batter by rounded spoonfuls onto the prepared baking sheets.\nBake in the preheated oven until edges of cookies are beginning to crisp, 8 to 10 minutes. Cool cookies on baking sheet for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "qTFWeTTOSCleD1ixwTR9khHpiouScDq"
    }
]