[
    {
        "title": "Chicken and Waffles",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 tablespoons cayenne pepper ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup cornstarch ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 quart peanut oil for frying ADVERTISEMENT",
            "8 chicken tenders ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "2 teaspoons prepared horseradish ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "12 slices bacon ADVERTISEMENT",
            "8 thin slices Cheddar cheese ADVERTISEMENT",
            "8 plain frozen waffles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the eggs, cream, cayenne pepper, 1 tablespoon salt, and black pepper in a large bowl. In a paper bag, shake together the flour, cornstarch, and 1 tablespoon salt.\nDip the chicken into the beaten egg mixture, then place into the flour mixture and shake to coat. Place the breaded chicken onto a wire rack; do not stack. Let the chicken rest for 20 minutes to allow the coating to set.\nHeat about 3 inches of oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). In small batches, fry chicken 5 to 8 minutes until golden brown. Remove chicken, and drain on paper towels. Set aside or keep warm in a a low oven.\nCombine the mayonnaise, maple syrup, horseradish, and mustard powder in a medium bowl. Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate.\nTo assemble the sandwiches: Place 4 waffles on a cookie sheet, top each waffle with 2 chicken tenders, 3 slices of bacon, and 2 slices of Cheddar. Broil the sandwich for a 3 to 5 minutes until the cheese melts. Spread 3 tablespoons of the maple mayonnaise on the remaining 4 waffles and place on top of the sandwich.\n",
        "picture_link": "fB9BbGu/u9D6M.nscMVOwS2j4HZZS5."
    },
    {
        "title": "Venison Tenderloin Bites",
        "ingredients": [
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 cups Italian dry bread crumbs ADVERTISEMENT",
            "1/4 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 pound venison tenderloin, cut into 1 inch cubes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "5 cups arugula ADVERTISEMENT",
            "1 lemon, cut into quarters ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source. Line a baking sheet with aluminum foil.\nWarm the olive oil and garlic in a small saucepan over low heat for 5 minutes to infuse the flavor of the garlic into the olive oil. Place the bread crumbs into a mixing bowl, and pour the oil mixture overtop. Stir the parsley, and Parmesan cheese into the bread crumb mixture until evenly blended. Press the venison cubes into the bread crumb mixture to coat, and place onto the prepared baking sheet. Make sure the venison pieces are not touching.\nBroil in the oven until the bread crumbs are golden, and the venison has turned from red to pink in the center, or to your desired degree of doneness, about 6 minutes. Turn the cubes occasionally as they cook.\nDivide the arugula onto 4 dinner plates, and top with the broiled venison. Squeeze a quarter of a lemon over each plate to serve.\n",
        "picture_link": "LWE1PFLshPazgOSOTaf9o4l6wDTUrFa"
    },
    {
        "title": "Easy Mediterranean Fish",
        "ingredients": [
            "4 (6 ounce) fillets halibut ADVERTISEMENT",
            "1 tablespoon Greek seasoning (such as Cavender's®) ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (5 ounce) jar pitted kalamata olives ADVERTISEMENT",
            "1/4 cup capers ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nPlace halibut fillets on a large sheet of aluminum foil and season with Greek seasoning. Combine tomato, onion, olives, capers, olive oil, lemon juice, salt, and pepper in a bowl. Spoon tomato mixture over the halibut. Carefully seal all the edges of the foil to create a large packet. Place the packet on a baking sheet.\nBake in the preheated oven until the fish flakes easily with a fork, 30 to 40 minutes.\n",
        "picture_link": "nyg2S.oa5qJRajeU3zsFJogqMfFMKlO"
    },
    {
        "title": "Becca's Chicken-Fried Pork Chops",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons ground paprika ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 (16 ounce) package saltine crackers, crushed ADVERTISEMENT",
            "1/2 cup dry potato flakes ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "4 (3/4 inch) thick pork chops ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 cups vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow bowl, mix 1 1/2 cup of flour, paprika, and garlic powder. In a second shallow bowl, whisk together the eggs and milk until thoroughly blended. In a third bowl, combine the crushed cracker crumbs, potato flakes, and 1/2 cup of flour.\nWith a fork, prick the pork chops thoroughly to tenderize the meat. Season the chops with salt and pepper.\nGently press the pork chops into the flour to coat, and shake off the excess flour. Dip into the beaten egg mixture, then press each chop into the cracker crumb mixture. Gently toss between your hands so any crumbs that haven't stuck can fall away\nHeat the oil in a large, deep skillet over medium heat, and gently place the pork chops into the hot oil. Fry the chops until the meat is no longer pink in the center and the crust is crisp and golden brown, about 5 minutes per side. Remove the chops from the pan, and drain the excess oil on paper towels.\n",
        "picture_link": "m3v2DITGA3YUuuDK.SmBC4D3L/o9ek."
    },
    {
        "title": "Old-Fashioned Italian Zucchini Fritters",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "3 zucchinis, shredded ADVERTISEMENT",
            "1 zucchini, diced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the eggs in a mixing bowl with a wire whisk until smooth. Stir in the shredded and diced zucchini, then season with salt, pepper, Parmesan cheese, and basil. Add the flour a little at a time, stirring between additions until no dry lumps remain.\nHeat the oil in a large skillet to 375 degrees F (190 degrees C).\nDrop the batter into the hot oil by the spoonful a few at a time making sure not to overcrowd the oil. Cook until the fritters are golden brown on each side, about 4 minutes. Drain on a paper towel-lined plate before serving.\n",
        "picture_link": "Ur/XQHbAqwgeHsdV91T4LHjYEyOYMAy"
    },
    {
        "title": "Roasted Curried Chicken with Couscous",
        "ingredients": [
            "2 tablespoons smoked paprika ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "7 1/2 teaspoons curry powder ADVERTISEMENT",
            "4 1/2 teaspoons onion powder ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon rubbed sage ADVERTISEMENT",
            "1 pinch ground ginger (optional) ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (2 1/2 pound) whole chicken, rinsed and patted dry ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 1/4 cups dry couscous ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "2 teaspoons smoked paprika ADVERTISEMENT",
            "1/2 teaspoon rubbed sage ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nStir together 2 tablespoons of smoked paprika, chili powder, 7 1/2 teaspoons curry powder, 4 1/2 teaspoons onion powder, salt, 1 teaspoon garlic powder, black pepper, 1/4 teaspoon sage, and ginger in a small bowl. Pour in 2 tablespoons lemon juice, 1/2 cup chicken broth, and vegetable oil; stir to form a paste.\nRub a little of the paste on the inside cavity of the chicken, then massage the remaining paste all over the chicken, placing it under the skin where you can. Truss the chicken if desired, and place onto a roasting pan.\nRoast in preheated oven until the chicken is no longer pink and the juices run clear, about 90 minutes. If using a meat thermometer, be sure the chicken has reached at least 165 degrees F (75 degrees C) in the thickest part of the thigh.\nWhile the chicken is roasting, bring 1 cup chicken broth, water, 2 tablespoons lemon juice, and butter to a boil in a large saucepan. Stir together the couscous 1 tablespoon curry powder, 2 teaspoons onion powder, 2 teaspoons paprika, 1/2 teaspoon sage, 1/4 teaspoon garlic powder, and the bay leaf in a large bowl. Stir the couscous into the boiling liquid, and cook for 3 minutes. Turn the heat off and cover. Keep the couscous warm until the chicken is ready.\n",
        "picture_link": "IW9gQznxYLk.KpMrD.hQpI8RAYDRX.."
    },
    {
        "title": "Chicken with Green Peppers in Black Bean Sauce",
        "ingredients": [
            "2 tablespoons toasted sesame oil ADVERTISEMENT",
            "4 cloves garlic cloves, peeled and sliced ADVERTISEMENT",
            "6 tablespoons black bean sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 pound skinless, boneless chicken breast half - cut into cubes ADVERTISEMENT",
            "1 cube chicken bouillon dissolved in ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "1 large onion, peeled and sliced ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "2 green bell pepper, diced ADVERTISEMENT",
            "1 1/2 tablespoons dark soy sauce ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "4 teaspoons cornstarch dissolved in ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "4 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a wok over a medium heat until hot, add the toasted sesame oil and heat for about 30 seconds. Stir in garlic and black bean sauce, and season with salt. Add chicken to the wok; cook, stirring frequently, until chicken is cooked through. Pour in dissolved chicken bouillon, cover, and cook for 6 minutes.\nStir in onion, green onions, and bell pepper, and season with soy sauce and black pepper. Cover, and cook for 8 minutes. Stir in cornstarch mixture, and stir until sauce thickens. Stir in cilantro, and serve.\n",
        "picture_link": "ovztDR48VtPtZtQ7tyzGGhnxi/OQLf."
    },
    {
        "title": "Spooky Calzone Snake",
        "ingredients": [
            "Dough: ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt ADVERTISEMENT",
            "3 cups all-purpose flour, divided ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "1 (4 ounce) package sliced pepperoni ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 cup sliced black olives (optional) ADVERTISEMENT",
            "1/2 green bell pepper, cut into strips (optional) ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms (optional) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve the sugar in the warm water in the bowl of a stand mixer fitted with a dough hook. Sprinkle the yeast over the water, and let stand for 5 minutes until the yeast softens and begins to form a creamy foam. Stir in the oil, salt, and 2 cups of flour, and mix on Low until the mixture forms a wet dough. With the machine running, add 1 cup of flour, 1/4 cup at a time, and knead until the dough pulls away from the sides of the bowl into a ball. Knead for 3 to 5 more minutes, until the dough is smooth and elastic.\nLightly oil a large bowl, then place the dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 1 hour.\nCombine the ricotta, mozzarella, and Parmesan cheeses, pepperoni, parsley, Italian seasoning, olives, green pepper, and mushrooms in a large bowl, and set aside.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nPunch down the dough, and roll it out into a long, flat strip about 9 inches wide by 30 inches long. Spoon the filling mixture down the center of the dough strip, leaving about 1 inch on all sides for sealing. Pull edges of the dough together; pinch to seal and form a long, filled roll. Place the roll, seam side down, onto the parchment paper in a snakey \"S\" shape, and tuck the ends underneath to seal. Beat the egg in a bowl with 1 tablespoon of water, and brush the egg wash over the calzone.\nBake in the preheated oven for 30 to 35 minutes, until the calzone is golden brown. Let cool for 5 minutes before cutting into individual slices.\n",
        "picture_link": "yl2rdHcdvv0bQWZwdndszOGMBNA3qXq"
    },
    {
        "title": "Farfalle Festival",
        "ingredients": [
            "10 ounces farfalle (bow tie) pasta ADVERTISEMENT",
            "4 slices bacon, diced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons diced red onion ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "1/4 cup diced Roma tomatoes ADVERTISEMENT",
            "1 cooked chicken breast, thinly sliced ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons heavy cream ADVERTISEMENT",
            "2 tablespoons grated Asiago cheese ADVERTISEMENT",
            "1/3 cup Alfredo sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the bow tie pasta and return to a boil. Cook, uncovered, stirring occasionally, until the pasta is cooked through but still firm to the bite, about 12 minutes. Drain.\nMeanwhile, cook the bacon in a skillet over medium heat until nearly crisp, about 5 minutes. Remove the bacon and wipe out the skillet with a paper towel.\nMelt the butter in the same skillet over medium heat. Return the bacon to the skillet, and stir in the red onion, garlic, Roma tomatoes, chicken, black pepper, garlic salt, and salt. Cook and stir until the bacon is crisp and onions are translucent. Stir in the cream and Asiago cheese, and cook until the liquid is reduced by half, about 3 minutes.\nStir in the Alfredo sauce and the cooked pasta. Remove from heat, and allow to cool slightly before serving.\n",
        "picture_link": "Z32ZOCjuimvy2d9IL/TYoNejlrOCs2m"
    },
    {
        "title": "Banana-Dulce de Leche Pie (Banana-Caramel Pie)",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "4 bananas ADVERTISEMENT",
            "1 1/2 cups whipping cream ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make dulce de leche, place the unopened can of sweetened condensed milk in a saucepan, and add enough water to cover half-way up the can. Place the saucepan over medium-high heat and bring to a boil. Cook for 3 hours, adding more water as necessary. Remove from heat and cool.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine the graham cracker crumbs with the butter in a mixing bowl until evenly blended. Press the crumb mixture evenly into a 9 inch pie plate.\nBake pie crust in preheated oven until lightly browned, 10-15 minutes. Remove from oven, and cool on a wire rack.\nOpen the can of dulce de leche, and pour half, or about 3/4 cup, over the pie crust. Slice the bananas and arrange half in a layer over the dulce de leche filling. Pour the remaining dulce de leche over the bananas. Top with remaining banana slices.\nPour the whipping cream into a mixing bowl, and beat until soft peaks form. Add the sugar and vanilla extract; continue beating until stiff peaks form. Spoon the whipped cream over the bananas. Chill at least 1 hour before serving.\n",
        "picture_link": "21u8FebFRd1QFwTR0LwmkwLtgDEnA4u"
    },
    {
        "title": "Drunk Deer Chili",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 pound ground venison ADVERTISEMENT",
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "1 pound cubed pork stew meat ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 fresh jalapeno pepper, seeded and minced ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "2 (14 ounce) cans stewed tomatoes, with juice ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "4 cubes beef bouillon, crumbled ADVERTISEMENT",
            "1/4 cup Kentucky bourbon ADVERTISEMENT",
            "2 (12 fluid ounce) cans pilsner-style beer ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat. Cook the venison, beef, and pork in the melted butter until completely browned. Add the onion and jalapeno; cook until tender. Season with chili powder, cayenne pepper, and cumin.\nStir in the stewed tomatoes, tomato sauce, garlic and beef bouillon. Pour the bourbon, beer, and water into the mixture and stir. Bring the chili to a boil; cover and reduce heat to medium-low; simmer about 1 hour, stirring frequently.\n",
        "picture_link": "yVjuPVk6IuRxK2sLFmJgCPWxDLnJ1Ee"
    },
    {
        "title": "Basil and Pesto Hummus",
        "ingredients": [
            "1 (16 ounce) garbanzo beans (chickpeas), drained and rinsed ADVERTISEMENT",
            "1/2 cup basil leaves ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon soy sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the garbanzo beans, basil, and garlic in a food processor; pulse several times. Use a spatula to push mixture from sides of processor bowl. Pulse the mixture again while drizzling in the olive oil. Add the vinegar and soy sauce; pulse until combined. Season with salt and pepper.\n",
        "picture_link": "6Gax1zbw.3V8uQRSONDok2.6pdHnvyW"
    },
    {
        "title": "Spicy Chili French Fries",
        "ingredients": [
            "4 large russet potatoes, peeled and cut into 1/4 inch thick fries ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup tomato-vegetable juice cocktail ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 teaspoons dried onion granules ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease a large baking sheet.\nFill a large bowl with cold water, add the potatoes, and allow to soak for 10 minutes.\nWhisk together the oil, vegetable juice cocktail, chili powder, ground cumin, onion granules, garlic powder, cayenne pepper, sugar, and salt in a large bowl. Drain the potatoes, and pat dry with paper towels. Toss the potatoes with the oil and spice mixture; stir until evenly coated. Arrange fries in a single layer on the prepared baking sheet.\nBake fries in preheated oven for 20 minutes. Turn and continue to bake until browned and crispy, about 20 additional minutes.\n",
        "picture_link": "HjxLEpw8SGiCItJ9tSPR0SwfsbYDETK"
    },
    {
        "title": "Deep Dark Old Recipe Bran Muffins",
        "ingredients": [
            "2 1/2 cups wheat bran ADVERTISEMENT",
            "1 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "2 1/2 tablespoons vegetable shortening, melted ADVERTISEMENT",
            "1/2 cup chopped raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease 18 muffin cups, or line with paper muffin liners. Whisk the bran, flour, salt, and baking soda in a mixing bowl; set aside.\nBeat the eggs in a mixing bowl. Whisk in the buttermilk, sugar, molasses, and melted shortening until smooth. Stir in the bran mixture along with the raisins until no dry lumps remain. Pour into the prepared muffin tins, filling them no more than 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "kTM1BA5Q3FtQPwA3fQL0dQECJxTBcyO"
    },
    {
        "title": "Easy Chicken and Biscuits",
        "ingredients": [
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Celery Soup or Campbell's® Condensed 98% Fat Free Cream of Celery Soup ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Potato Soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 teaspoon dried thyme leaves, crushed ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups cooked cut-up vegetables* ADVERTISEMENT",
            "2 cups cubed cooked chicken ADVERTISEMENT",
            "1 (7 ounce) can refrigerated buttermilk biscuits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix soups, milk, thyme, black pepper, vegetables and chicken in 3-quart shallow baking dish.\nBake at 400 degrees F for 15 minutes. Stir.\nCut each biscuit into quarters.\nArrange cut biscuits over chicken mixture. Bake 15 minutes or until biscuits are golden.\n",
        "picture_link": "TcHtonn6jafuqmkUp3Se9Dk73Nk8NPy"
    },
    {
        "title": "Garlic-Cilantro Scrambled Eggs",
        "ingredients": [
            "4 large eggs ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 1/2 teaspoons freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together eggs, sour cream, milk, and garlic until smooth; add cilantro and season to taste with salt and pepper.\nMelt butter in a nonstick skillet over medium heat. Pour in egg mixture and cook to desired degree of doneness, stirring constantly. Sprinkle with Parmesan cheese to serve.\n",
        "picture_link": "48d2EpNFomJ4soe1UXzKJDil3Cdt2Ca"
    },
    {
        "title": "Spicy Roasted Edamame",
        "ingredients": [
            "1 1/4 cups frozen shelled edamame (green soybeans), thawed ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/8 teaspoon paprika ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace the thawed edamame into a mixing bowl, drizzle with the olive oil, then sprinkle with chili powder, basil, onion powder, cumin, paprika, and pepper. Toss until the edamame are evenly coated with the oil and spices. Spread into a 9x13 inch glass baking dish in a single layer.\nBake uncovered in the preheated oven until the beans begin to brown, 12 to 15 minutes. Stir once halfway through cooking.\n",
        "picture_link": "yTiywDMl7ulY0NBpP8XOJrNE6Hkqzme"
    },
    {
        "title": "Coffee Roasted Beef Chuck",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 pounds beef chuck roast ADVERTISEMENT",
            "2 large yellow onions, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "freshly ground pepper, to taste ADVERTISEMENT",
            "6 cups brewed coffee ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, heat the butter and oil over medium/high heat. Place the roast in the pot and sear it on all sides until well browned. Remove the roast and set aside.\nIn the same pot, saute the onions for 5 minutes, scraping loose the brown roast bits on the bottom of the pot. Add the garlic and pepper and saute for 1 minute. Return the meat to the pot and pour in the coffee and add the mushrooms.\nOver high heat, bring to a boil. Reduce heat to low and simmer for 5 hours, turning the meat over halfway through the cooking time. A slow cooker may be used for cooking the roast, if desired.\nTo make the gravy: When the roast is done, remove it from the pot. Take 1/2 cup of the coffee sauce mixture from the pot and stir in the cornstarch to make a slurry. Mix well. Return the slurry to the pot, stirring until the sauce thickens slightly. Stir in the sour cream then salt to taste.\n",
        "picture_link": "kY/a.RIyKxnwrEgLTJJorwFYZnIWcJO"
    },
    {
        "title": "Slow Cooker Au Jus Pot Roast",
        "ingredients": [
            "1 (4 pound) boneless beef chuck roast ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce, or to taste ADVERTISEMENT",
            "1 tablespoon Montreal-style steak seasoning ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "1 cup hot strong black coffee ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 teaspoon dried oregano, or to taste ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub chuck roast with 1 tablespoon Worcestershire sauce and sprinkle on all sides with steak seasoning.\nHeat olive oil in a large skillet over medium-high heat. Sear the roast in the hot oil until browned, about 5 minutes per side. Transfer roast to a slow cooker.\nDissolve beef bouillon cube in the coffee and pour the mixture over the roast. Pour tomato sauce over meat and season with oregano; drizzle meat with 2 teaspoons Worcestershire sauce.\nSet cooker to Low and cook until meat is tender, 8 to 10 hours.\n",
        "picture_link": "c7DAd3/DsTk8sLop/dq1YBzHTJxb6tO"
    },
    {
        "title": "Clemons Family Bean Dip",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (11 ounce) can condensed cheese soup ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1 (16 ounce) jar picante sauce ADVERTISEMENT",
            "1 (12 ounce) jar sliced jalapeno peppers ADVERTISEMENT",
            "1/2 pound processed cheese food, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground beef in a large, deep skillet. Cook over medium high heat until evenly brown.\nDrain beef and place in a large, heavy saucepan with condensed cheese soup, refried beans, picante sauce, jalapeno peppers and processed cheese food. Cook on high until boiling, then reduce heat to low. Stirring constantly, cook until mixture is melted and bubbly.\n",
        "picture_link": "SPEnFdcs4oIu/7KTNZSf8p9dxId1adu"
    },
    {
        "title": "Grilled Balsamic and Soy Marinated Flank Steak",
        "ingredients": [
            "1/2 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon rosemary ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 pounds flank steak ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk onion, garlic, olive oil, balsamic vinegar, soy sauce, Dijon mustard, rosemary, salt, and pepper together in a mixing bowl.\nPut the flank steak in a large resealable plastic bag. Pour marinade into the bag and coat steak with the marinade. Squeeze excess air from the bag and seal. Marinate in the refrigerator at least 30 minutes, up to 2 days.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove the flank steak from the marinade and shake to remove excess liquid. Reserve marinade.\nCook steak until firm, hot in the center, and just turning from pink to grey, 6 to 8 minutes per side, brushing occasionally with reserved marinade. An instant-read thermometer inserted into the center should read 150 degrees F (65 degrees C). Remove steak to a cutting board and rest meat 5 minutes before slicing thinly across the grain.\n",
        "picture_link": "2q8ZXnc1i04uT2jQZmXpCR2DD5Ko4pC"
    },
    {
        "title": "Peanut Butter Heaven",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, cream together the butter, white sugar and brown sugar. Beat in the eggs, one at a time, then stir in the 3/4 cup peanut butter. Combine the oats, flour and baking soda; stir into the creamed mixture until well blended. Press the dough evenly into the prepared pan.\nBake for 15 to 20 minutes in the preheated oven, until firm. In the microwave or over a double boiler, melt chocolate chips and 1/2 cup peanut butter together, stirring frequently until smooth. Spread over cooled bars and allow to set up before cutting into squares.\n",
        "picture_link": "HRCac0vl4IWvnrpfrdpwk7mpt3uXQSW"
    },
    {
        "title": "Mari's Clam Lovers Chowder",
        "ingredients": [
            "8 (6.5 ounce) cans minced clams, drained with juice reserved ADVERTISEMENT",
            "4 ounces bacon, chopped ADVERTISEMENT",
            "2 cups finely chopped onion ADVERTISEMENT",
            "1 1/2 cups diced carrots ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "2 tablespoons minced parsley ADVERTISEMENT",
            "5 cups peeled and cubed potatoes ADVERTISEMENT",
            "1 1/2 cups butter ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 quarts heavy cream ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stockpot, saute bacon until almost crisp. Drain fat. Add clam juice, onion, carrots, water, celery, and parsley. Bring to a boil, reduce heat and simmer 20 minutes.\nAdd potatoes and simmer 20 more minutes. At the time you add potatoes start cream sauce.\nIn a Dutch oven melt butter and add flour; blend until smooth. Slowly pour in cream, stirring constantly. DO NOT BOIL! When smooth, transfer to the stockpot.\nStir in clams, salt, pepper, sugar and red wine vinegar. Simmer, never let boil, until smooth and slightly thickened, about 30 to 45 minutes.\n",
        "picture_link": "PQ0eOvomig4WSRRCzbWKwqrm6uS4jrO"
    },
    {
        "title": "Cheese Filling",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, room temperature ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together cream cheese and sugar. Beat in egg and vanilla. Refrigerate before using to fill pastries prior to baking them.\n",
        "picture_link": "/IFJefBNsJYiBPD2KqMVM6QGnF.HJlC"
    },
    {
        "title": "Marie's Homemade Mac and Cheese",
        "ingredients": [
            "2 pounds uncooked elbow macaroni ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed Cheddar cheese soup ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 3/4 cups milk ADVERTISEMENT",
            "2 pounds Cheddar cheese, shredded, divided ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain.\nIn a 9x13 inch baking dish combine soup, eggs, milk, half of the cheese, cooked macaroni, salt and pepper. Mix well and then top with remaining cheese.\nCover and bake 45 minutes in the preheated oven. Remove cover and bake for another 10 to 15 minutes, until top is lightly browned.\n",
        "picture_link": "TwQO6J5JznHbXAw4iuYietUf2Uf3hIu"
    },
    {
        "title": "Pork Chops in Mushroom Gravy",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 bone-in pork chops ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (6 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 (10.75 ounce) can golden mushroom soup (such as Campbell's®) ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon olive oil in a large skillet over medium heat. Sprinkle pork chops with garlic salt and black pepper. Fry pork chops in the hot oil until browned, 5 to 8 minutes per side. Transfer chops to a plate.\nHeat 1 tablespoon olive oil in skillet; cook and stir mushrooms in the hot oil until soft, 5 to 8 minutes. Scrape up and dissolve any browned bits of food into mushrooms as you stir. Pour golden mushroom soup and water into skillet and stir into mushrooms.\nPlace pork chops and accumulated juices into mushroom sauce, spooning sauce over chops. Simmer until meat is no longer pink inside and juices run clear, occasionally spooning more sauce over chops as they cook, 10 to 15 minutes.\n",
        "picture_link": "eVyUmO.7UOdRSM7rU3n6VzqG4dWSv4C"
    },
    {
        "title": "Chef John's Pumpkin Scones",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 tablespoons cold, unsalted butter, cut into pieces ADVERTISEMENT",
            "1/2 cup pumpkin puree ADVERTISEMENT",
            "1/3 cup buttermilk ADVERTISEMENT",
            "1/3 cup toasted pine nuts ADVERTISEMENT",
            "2 tablespoons all-purpose flour, or more as needed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon milk ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees. Line a baking sheet with parchment paper or a silicone baking mat.\nWhisk together 1 3/4 cup flour, 1/4 cup sugar, baking powder, baking soda, and salt in a large bowl until combined. Mix butter into flour mixture using a pastry cutter until the mixture resembles coarse crumbs.\nMake a well in the center of the flour-butter mixture. Stir in pumpkin puree, buttermilk, and pine nuts until just combined.\nSprinkle a work surface with 2 tablespoons flour. Turn out dough onto the floured work surface. Shape into a rectangle about 1 inch thick. Fold the rectangle in thirds, sprinkle with more flour as needed, and flatten to about 1 inch thick. Repeat 2 more times. Cut final rectangle into 6 equally-sized squares. Cut each square into triangles and transfer the scones to the prepared baking sheet.\nWhisk egg and milk together in a small bowl. Lightly brush the top of each scone with egg wash. Sprinkle 1 teaspoon sugar over scones.\nBake in the preheated oven until golden brown, 15 to 20 minutes. Transfer to a wire rack to cool completely.\n",
        "picture_link": "7MzV.qZHeVgptMNIbAP7mx8P1hITbau"
    },
    {
        "title": "Hard Boiled Eggs in the Oven",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPut 1 egg in each of 12 muffin cups.\nBake in preheated oven for 30 minutes.\nPlunge baked eggs in a large bowl filled with ice water until cooled completely, about 10 minutes.\n",
        "picture_link": "tToWAjUo2lKRdJBIX5dMNNhq/jAm2va"
    },
    {
        "title": "Portuguese Kale Soup",
        "ingredients": [
            "1/2 pound dried white pea beans ADVERTISEMENT",
            "1/2 pound chorizo sausage, thinly sliced ADVERTISEMENT",
            "1 pound beef soup bones ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 medium head cabbage, chopped ADVERTISEMENT",
            "2 bunches kale - rinsed, dried and chopped ADVERTISEMENT",
            "5 potatoes, peeled and cubed ADVERTISEMENT",
            "1 quart hot water or as needed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak beans in twice their volume of water 8 hours or overnight.\nIn a large pot, place drained beans, chorizo, soup bones and 1 quart water (or more as needed to cover). Cook over medium heat until beans are just beginning to be tender, 1 hour.\nStir in cabbage, kale, potatoes and enough hot water to cover. Cook until potatoes are tender, 20 minutes. Season with salt and pepper.\n",
        "picture_link": "FNEtE.poI0i..YZ8rc8irHr2KyY6cUq"
    },
    {
        "title": "Southwestern Cauliflower and Ham Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "3 1/2 cups cauliflower florets ADVERTISEMENT",
            "1 cup chopped cooked ham ADVERTISEMENT",
            "1 1/2 cups shredded Pepper Jack cheese ADVERTISEMENT",
            "1/4 cup potato flakes ADVERTISEMENT",
            "5 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, cook onion in oil until just beginning to brown. Pour in broth and bring to a boil. Stir in cauliflower, bring to a boil again and cook until cauliflower is tender, 2 to 5 minutes.\nRemove half of cauliflower mixture and puree in a blender or food processor until smooth. Return to pot with ham and cheese and cook until cheese is melted. Stir in potato flakes and heat through. Serve topped with cilantro.\n",
        "picture_link": "ekaTQSl9uMM3K5pFg25xwcv6R3AMECW"
    },
    {
        "title": "Sweet Teriyaki Beef Skewers",
        "ingredients": [
            "1 1/2 cups light brown sugar ADVERTISEMENT",
            "1 cup soy sauce ADVERTISEMENT",
            "1/2 cup pineapple juice (optional) ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 large garlic cloves, chopped ADVERTISEMENT",
            "4 pounds boneless round steak, cut into 1/4-inch slices ADVERTISEMENT",
            "bamboo skewers, soaked in water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk brown sugar, soy sauce, pineapple juice, water, vegetable oil, and garlic together in a large bowl; drop beef slices into the mixture and stir to coat. Cover bowl with plastic wrap.\nMarinate beef in refrigerator for 24 hours.\nRemove beef from the marinade, shaking to remove any excess liquid. Discard marinade.\nThread beef slices in a zig-zag onto the skewers.\nPreheat grill for medium heat and lightly oil the grate.\nCook skewers on preheated grill until the beef is cooked through, about 3 minutes per side.\n",
        "picture_link": "QG.SXhHhtiAWvUxvm6e2pWDRHqg4aRi"
    },
    {
        "title": "OREO Ultimate Turtles® Cheesecake",
        "ingredients": [
            "24 OREO Cookies, finely crushed ADVERTISEMENT",
            "6 tablespoons butter or margarine, melted ADVERTISEMENT",
            "1 (14 ounce) package caramels ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 ounces semi-sweet baking chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 325 degrees F.\nMix cookie crumbs and butter; press onto bottom and 2 inches up side of 9-inch springform pan.\nMicrowave caramels and milk in a microwaveable bowl on high for 3 minutes or until caramels are completely melted and mixture is well blended, stirring after each minute. Stir in nuts; pour half into crust. Refrigerate 10 minutes. Refrigerate remaining caramel mixture for later use.\nBeat cream cheese, sugar and vanilla with mixer until blended. Add eggs, 1 at a time, mixing on low speed after each just until blended. Pour over caramel layer in crust.\nBake 1 hour 5 minutes to 1 hour 10 minutes or until center is almost set. Run knife around rim of pan to loosen cake; cool before removing rim. Refrigerate 4 hours.\nMicrowave reserved caramel mixture 1 minute; stir. Pour over cheesecake. Melt chocolate; drizzle over cheesecake.\n",
        "picture_link": "IMTD4aViQ44cPpfLXuxx8.TOtoPxiPq"
    },
    {
        "title": "Apple Sheet Cake",
        "ingredients": [
            "PASTRY: ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "APPLE FILLING: ADVERTISEMENT",
            "3 pounds apples - peeled, cored and sliced ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "FROSTING: ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). In a large bowl, combine 3 cups flour, baking powder and salt. Cut in shortening to the consistency of coarse crumbs. Stir in 1 cup cold milk slowly until completely blended. Separate dough into two balls. Roll out one ball of dough to fit a 15 x 10 inch pan with some dough extending over the edge of the pan.\nIn a large bowl, combine sliced apples, sugar, cinnamon and 2 tablespoons flour. Place filling in an even layer over prepared crust. Thinly slice 1/2 cup butter and evenly distribute over the apples. Roll out the remaining dough and place over the apple filling. Seal edges and prick the top all over with a fork.\nBake in the preheated oven for 30 minutes. Cool 5 minutes before frosting.\nTo make the frosting: In a small bowl, combine confectioners' sugar, 3 tablespoons milk, 1/3 cup butter and vanilla extract. Beat until smooth and creamy.\n",
        "picture_link": "2T4ew45LKCT.Oyra5SnKh09ZEbQIbRK"
    },
    {
        "title": "Dos Queso Dip",
        "ingredients": [
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "2 cups shredded Pepper Jack cheese ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 teaspoon dried, crushed Mexican oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, blend sour cream and cream cheese until smooth. Mix in taco seasoning mix. Stir in salsa, Mexican oregano, salt and pepper.\nTransfer to a 9x13 inch baking dish. Top with Pepper Jack cheese. Bake in the preheated oven 10 minutes, or until cheese is melted.\n",
        "picture_link": "6uQkgrBiOM9DP7CBFWX/juDymPqSQJm"
    },
    {
        "title": "Crispy Marshmallow Balls",
        "ingredients": [
            "4 cups crispy rice cereal ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 cup margarine ADVERTISEMENT",
            "30 individually wrapped caramels, unwrapped ADVERTISEMENT",
            "1 (16 ounce) package large marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line trays with waxed paper. Pour rice cereal into a shallow dish or bowl.\nIn a double boiler, combine condensed milk, margarine and caramels. Cook, stirring, over simmering water, until melted and smooth.\nUsing tongs or two forks, dip marshmallows one at a time into caramel mixture, then roll in rice cereal. Place on waxed paper until set.\n",
        "picture_link": "2MnldDoZ4a7VCWjSYE4PhYSot.o3ugS"
    },
    {
        "title": "Macaroni and Tuna Fish Salad",
        "ingredients": [
            "1 (16 ounce) package macaroni ADVERTISEMENT",
            "2 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "3 tablespoons mayonnaise, or to taste ADVERTISEMENT",
            "1 onion, finely chopped (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch dried oregano, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain and cool under running water.\nMix both cans of tuna into the cooled pasta. Add the mayonnaise. Stir in onion, salt, pepper, garlic powder, and oregano.\n",
        "picture_link": "CebgwyraSvreSt6.hTMW5ICUHmG0cQu"
    },
    {
        "title": "Creamy Apple Cinnamon Raisin Oatmeal",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 teaspoons brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1 cup uncooked rolled oats ADVERTISEMENT",
            "2 tablespoons raisins ADVERTISEMENT",
            "1 apple - peeled, cored and cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, combine water, brown sugar, cinnamon, and syrup. Heat mixture to a boil.\nWhen water is at a boil, reduce heat and add in oats. Cook for about 5 minutes, or until all water is soaked by the oats. Remove from heat, stir in apples and raisins and serve.\n",
        "picture_link": "JWop6ac3KIBim86.McsKUvQ7RaMAZfO"
    },
    {
        "title": "Barbara Bush's Chocolate Chips",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 teaspoons hot water ADVERTISEMENT",
            "1 1/8 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter, brown sugar, granulated sugar, and egg until light and fluffy, about 3 minutes. Beat in hot water and vanilla. Gradually beat in flour, baking soda, and salt, until well blended and smooth. Stir in chocolate chips.\nDrop dough by well-rounded teaspoons onto greased cookie sheets. Bake at 375 degrees F (190 degrees C) for 10 minute, or until golden. Cool cookie sheet on a wire rack for 1 minutes, then remove cookies to a rack to cool completely.\n",
        "picture_link": "DAbrMn0rHnhgJXtgKFagSPPFMIPBzlC"
    },
    {
        "title": "Quick and Easy Fruit Dip",
        "ingredients": [
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons frozen orange juice concentrate, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium size serving bowl, mix together marshmallow creme, cream cheese, and orange juice. Refrigerate and serve chilled.\n",
        "picture_link": "bxcCBEVBKb/dvCYGtie6Iwx9IhRm92q"
    },
    {
        "title": "Mashed Potato, Rutabaga, and Parsnip Casserole with Caramelized Onions",
        "ingredients": [
            "7 cups low-sodium chicken broth ADVERTISEMENT",
            "3 pounds baking potatoes, peeled and cubed ADVERTISEMENT",
            "1 1/2 pounds rutabagas, peeled and cubed ADVERTISEMENT",
            "1 1/4 pounds parsnips, peeled and cubed ADVERTISEMENT",
            "8 cloves garlic ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "3 onions, thinly sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, potatoes, rutabagas, parsnips, garlic, bay leaf, and thyme in a large pot. Bring to a boil. Reduce heat, and cover partially. Simmer until vegetables are very tender, about 30 minutes. Drain.\nTransfer vegetables to large bowl. Add 1/2 cup butter or margarine . Use an electric mixer, beat mixture until mashed but still chunky. Season with salt and pepper. Transfer mashed vegetables to a buttered 13 x 9 x 2 inch baking dish.\nMelt remaining 1/4 cup butter or margarine in a heavy large skillet over medium-high heat. Add sliced onions. Saute until beginning to brown, about 5 minutes. Reduce heat to medium-low. Saute until onions are tender and golden brown, about 15 minutes. Season with salt and pepper. Spread onions evenly over mashed vegetables. Casserole can be prepared up to 1 day ahead. Cover and refrigerate.\nPreheat oven to 375 degrees F (190 degrees C). Bake, uncovered, for 25 minutes, or until heated through and top begins to crisp.\n",
        "picture_link": "FuG04ElZjtT73oS3M4ip.Kj1W6ekyJa"
    },
    {
        "title": "Lima and Navy Bean and Ham Soup",
        "ingredients": [
            "3 (3.5 ounce) links Italian sausage, casings removed ADVERTISEMENT",
            "1 large meaty ham bone or 4 smoked ham hocks ADVERTISEMENT",
            "16 ounces dry lima beans ADVERTISEMENT",
            "1 (16 ounce) package dried navy beans ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "4 carrots, sliced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon salt (optional) ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "3 tablespoons chicken bouillon powder ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large soup pot, brown the Italian sausage; drain off fat. Add ham bone (or ham hocks), lima beans, navy beans, tomatoes, tomato paste, onion, celery, carrots, garlic, parsley, bay leaves, chives, basil, green onion, thyme, mustard, cayenne pepper, salt, ground black pepper, Worcestershire sauce and chicken base or bouillon.\nAdd the can of beer and water to cover all. Bring mixture to a boil, then reduce heat and simmer until beans are tender, about 4 or 5 hours, and the ham has been released from the bone. Refrigerate overnight to let the fat to come to the surface of the soup.\nWhen ready to serve, skim fat, remove ham bone (or hocks), pick off remaining ham from bone and put into soup. Discard bones and bay leaves. Heat soup until warm. Serve and enjoy!\n",
        "picture_link": "NgTMrsVg9ifNrD6soV8r0GXFYXwipEC"
    },
    {
        "title": "Frosted Maple Cookies",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 teaspoon maple flavored extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon maple flavored extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour and baking soda, set aside.\nMix together the brown sugar, 1 teaspoon maple extract, vanilla, 3/4 cup butter and egg. Stir in the flour mixture. The dough will be very sticky.\nDrop onto greased cookie sheet. Bake for 10-12 minutes at 350 degrees F (175 degrees C). Let rest for one minute before removing from cookie sheet. Frost when cool.\nTo Make Frosting: Combine 2 cups confectioners' sugar, 2 tablespoons butter, 2 tablespoons milk, and 1 teaspoon maple extract. Spread over cooled cookies.\n",
        "picture_link": "hO1uWF1PASk7XqMgVnj7nwoTh4rMlVm"
    },
    {
        "title": "Special Occasion Stuffed Crown Pork Roast",
        "ingredients": [
            "7 pounds crown pork roast ADVERTISEMENT",
            "2 cups chopped cranberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "8 cups white bread cubes ADVERTISEMENT",
            "2 apple - peeled, cored, and chopped ADVERTISEMENT",
            "1/2 cup apple juice ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSeason pork roast with salt and pepper to taste, then place on a rack in an open roasting pan, rib ends down.\nBake at 375 degrees F (190 degrees C) for 2 hours. Roast will be only partially cooked.\nMeanwhile, in a medium bowl, combine cranberries and sugar and mix well; set aside. Melt butter or margarine in a large skillet over medium heat. Add onions and celery and saute until tender, about 10 minutes. Add cranberry mixture, 2 teaspoons salt, 1/4 teaspoon ground black pepper, bread cubes, apples, apple juice, egg and poultry seasoning. Toss well.\nAfter the two hours, remove roast from oven. Turn rib ends up and fill cavity with cranberry/apple stuffing. Insert meat thermometer between two ribs in the thickest part of the meat, making sure that end of thermometer does not touch any bone.\nReturn stuffed roast to oven and continue roasting at 375 degrees F (190 degrees C) for about 1 1/2 hours, or until internal temperature of meat reaches 175 degrees F (80 degrees C). (Note: If stuffing becomes too brown, cover it with aluminum foil.)\nTo Serve: Place roast on warm platter and let stand for 15 minutes for easier carving. Slice between ribs to carve, and serve with stuffing.\n",
        "picture_link": "5KS/LMx8Ps7zu7tG5KvWUhWdIV4tjs."
    },
    {
        "title": "Mocha Walnut Cookies",
        "ingredients": [
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 tablespoons instant coffee powder ADVERTISEMENT",
            "2 teaspoons boiling water ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt over hot (not boiling) water 1/2 cup of the chocolate morsels. Stir until smooth. Cool to room temperature.\nIn small cup, dissolve the instant coffee in the 2 teaspoons boiling water. Set aside.\nIn small bowl, combine flour, baking soda, and salt. Set aside.\nIn large bowl, combine butter, sugars, and coffee. Beat until creamy. Add egg and melted morsels. Mix well. Gradually add flour mixture. Stir in remaining 1-1/2 cups chocolate morsels and walnuts. Form into walnut-sized balls and place on ungreased cookie sheets.\nBake at 350 degrees F (175 degrees C) for 10-12 minutes. Allow to stand 2-3 minutes before removing from cookie sheets.\n",
        "picture_link": "/LvzH8UvfAKPYMMpj8lsYgeWeJ.hlZ."
    },
    {
        "title": "Peanut Butter Cookies I",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together the butter, sugar and honey. Stir in the egg and peanut butter. Combine the flour and baking powder, mix into the peanut butter mixture. Shape dough into 1 1/2 inch balls. Place 3 inches apart on cookie sheets. Dip a fork into flour and press deeply across top of each cookie in a criss cross pattern.\nBake for 15 minutes in the preheated oven, until cookies are lightly browned. Cool on wire racks. Store in tightly covered container.\n",
        "picture_link": "70mEM/Yl6gE9Oxq83kWw/8mo0kOYi/K"
    },
    {
        "title": "Corn Souffle",
        "ingredients": [
            "2 (15.25 ounce) cans whole kernel corn ADVERTISEMENT",
            "2 (15 ounce) cans creamed corn ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the corn, creamed corn, sugar, flour, milk and eggs. Mix well. Pour the mixture into a souffle dish.\nBake at 350 degrees F (175 degrees C) for 1 to 1 1/2 hours.\n",
        "picture_link": "DNWw0SnE3vSIswQLi/kgLyXzAW9R4lW"
    },
    {
        "title": "Malaysian Barbecue Chicken Wings",
        "ingredients": [
            "12 chicken wings ADVERTISEMENT",
            "4 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons dark soy sauce ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "2 tablespoons oyster sauce ADVERTISEMENT",
            "1/2 tablespoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow glass bowl combine the soy sauce, dark soy sauce, sesame oil, oyster sauce, garlic powder, onion powder, ground black pepper and dried basil. Mix together. Add chicken wings, cover and refrigerate overnight. Stir together again the next day.\nLightly oil grill and preheat to high heat.\nRemove wings from marinade and discard remaining marinade. Grill chicken wings over preheated grill for 8 to 12 minutes each side, or until cooked through and juices run clear.\n",
        "picture_link": "0vhwfudR/hbpcJNoODuiUk6CjXaBpUS"
    },
    {
        "title": "Hillary Clinton's Chocolate Chip Cookies",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C). Brush baking sheets lightly with vegetable oil.\nCombine flour, salt and baking soda on waxed paper.\nBeat together shortening, sugars and vanilla in large bowl with electric mixer until creamy. Add eggs and beat until light and fluffy.\nGradually beat in flour mixture. Stir in rolled oats and then chocolate chips.\nDrop batter by rounded teaspoonsfuls onto baking sheets. Bake for 8-10 minutes or till golden. Cool cookies on sheets for 2 minutes. Remove to wire racks to cool completely.\n",
        "picture_link": "yvZbPDOS1ISF1qH6sqYgorFJZHYuqO6"
    },
    {
        "title": "Special K Cookies",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 1/3 cups peanut butter ADVERTISEMENT",
            "1 cup white corn syrup ADVERTISEMENT",
            "4 cups high protein crisp rice and wheat cereal ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend syrup, sugar, vanilla and salt in a 2 quart microwave-safe dish. Cook on high 4 minutes, or until mixture boils and sugar dissolves.\nStir in peanut butter, then add the cereal.\nDrop by teaspoonfuls onto waxed paper. Let cool before storing.\n",
        "picture_link": "beIz8s2OSD0q3p9/X2htiINCUBtQZ.C"
    },
    {
        "title": "Easy Cheesy Chicken II",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "3 cups crushed cheese flavored butter crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nLightly grease a 9x13 inch baking dish. Roll the chicken breasts in melted butter or margarine, then in the crushed cracker crumbs. Bake in the preheated oven for 50 to 60 minutes.\n",
        "picture_link": "wfGvI6n81t..yH/pynP9IZLqw.NRvQO"
    },
    {
        "title": "Okra, Chicken and Rice Casserole",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup uncooked brown rice ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 tablespoon ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 (16 ounce) package frozen okra, thawed and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a 9x13 inch baking dish combine the soup, water, rice, okra, paprika and ground black pepper. Place the chicken on top of the rice mixture. Sprinkle with additional paprika and ground black pepper.\nCover and bake in the preheated oven for 45 minutes or until the chicken is cooked through and the juices run clear. (For creamier rice, increase the water amount to 1 1/3 cups).\n",
        "picture_link": "QT0QOP2QGkD5bVIHjcyMJvVeX0/6p0e"
    },
    {
        "title": "Minestrone Soup II",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/3 pound ground beef ADVERTISEMENT",
            "1 cup minced celery ADVERTISEMENT",
            "1 cup cubed carrots ADVERTISEMENT",
            "2 cups tomato puree ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "1 (10.5 ounce) can condensed French onion soup ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1/4 cup red wine ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup chopped zucchini ADVERTISEMENT",
            "2 cups spinach, rinsed and sliced ADVERTISEMENT",
            "1 cup uncooked spinach pasta ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stock pot, cook bacon and drain off fat. Add onion, garlic, and beef. When onions are translucent, add celery, carrot, pureed tomatoes, whole tomatoes, broth, condensed soup, water, wine, oregano, basil, salt and pepper. Cook for 15 minutes.\nStir in zucchini, spinach, pasta, garbanzo beans and parsley. Cook for 15 minutes and serve with fresh Parmesan cheese.\n",
        "picture_link": "ppFo4H1o9LEJSStIOrFCWlDds7BTkr."
    },
    {
        "title": "Sweet and Sour Zucchini Salad",
        "ingredients": [
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1/2 cup white wine vinegar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2/3 cup cider vinegar ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "7 small zucchinis, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, soak onion soup mix in wine vinegar. Let stand 5 minutes.\nCombine the onion soup mixture with the sugar, salt, pepper, oil, cider vinegar, bell pepper, celery and zucchini. Chill 4 to 6 hours, stirring occasionally. Drain off any extra liquid before serving.\n",
        "picture_link": "gYQj4xCnj9FZ/fgijOa8CLh.J5N4jOe"
    },
    {
        "title": "My Grandma's Cool Cucumber Salad",
        "ingredients": [
            "3 cucumbers ADVERTISEMENT",
            "1 onion, cut into very thin slices ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups fat free sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel cucumbers, but leave a little on for color and slice by hand as thin as possible. Dry slices with paper towels.\nPlace dried cucumber slices in a large bowl with onion slices. Generously season with salt and pepper. Toss well and let sit 10 minuets, drain any excess liquids.\nToss cucumbers and onions in with enough sour cream to coat. Refrigerate until well chilled. Stir, and season with salt and pepper to taste if needed.\n",
        "picture_link": "ys.KD3AlveF7IL9.bcKwEJw8jdBZeEO"
    },
    {
        "title": "Caramel Corn I",
        "ingredients": [
            "5 tablespoons vegetable oil ADVERTISEMENT",
            "2 1/2 cups unpopped popcorn ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup peanuts ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nAdd 1 tablespoon of the oil to a 4 quart saucepan, and heat over high heat. When oil is hot, add 1/2 cup of popping corn. Keep pan moving constantly. When corn stops popping, remove from heat. Place popped corn in oven to keep warm. Repeat until all corn has been popped. Set aside.\nMelt margarine or butter in a medium saucepan, and then stir in brown sugar, syrup, and salt. Bring to a rolling boil, stirring constantly; boil without stirring for 5 minutes. Remove from heat.\nStir baking soda, vanilla, peanuts, pecans, and almonds into brown sugar mixture. Quickly pour nut mixture over warm popcorn, and toss until well coated. Spread on greased cookie sheets.\nBake for 45 minutes, stirring well every 15 minutes. Cool on aluminum foil, and store in an air-tight container.\n",
        "picture_link": "In7/eEVuErrgmFkAMvEWshF8yWml/8m"
    },
    {
        "title": "Amazing Sugar Cookies",
        "ingredients": [
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix flour, baking soda, and baking powder in a small bowl.\nBeat butter and 1 1/2 cups sugar with an electric mixer in a large bowl until smooth; stir in egg and vanilla extract. Gradually blend flour mixture into butter mixture. Roll dough into walnut-sized balls and toss in 1/4 cup sugar; place 2 inches apart onto ungreased baking sheets.\nBake in preheated oven until golden, 8 to 9 minutes. Let stand on cookie sheet 2 minutes before removing to wire racks to cool.\n",
        "picture_link": "/n4q5dXS5YoWxMQb2goRFHPopgkbsZK"
    },
    {
        "title": "Cinnamon Stove Top Granola",
        "ingredients": [
            "1 1/4 tablespoons olive oil ADVERTISEMENT",
            "5 cups rolled oats ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup blanched slivered almonds (optional) ADVERTISEMENT",
            "1/2 cup dried cherries (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large stockpot over medium heat. Combine the oats and cinnamon and add them to the pot. Cook and stir until lightly toasted, stirring constantly, 3 to 4 minutes. Pour the oats out onto a large baking sheet and add the butter to the pot. When the butter has melted, stir in the honey, molasses and brown sugar. When the mixture starts to simmer, return the oats to the pot and continue to cook and stir until coated and hot.\nRemove from the heat and stir in the almonds and cherries. Pour onto a large cookie sheet and allow to cool. The granola will harden as it cools. When cool, transfer to an airtight container and store at room temperature.\n",
        "picture_link": "7saZV.KixVF8EMf2QzSR0aa5z8DuMQ6"
    },
    {
        "title": "Authentic Saag Paneer",
        "ingredients": [
            "2 bunches spinach, roughly chopped ADVERTISEMENT",
            "1 bunch fenugreek leaves, roughly chopped ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "1/2 pound paneer, cubed ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "2 teaspoons garam masala ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large saucepan of water to a boil. Cook spinach and fenugreek in the boiling water until wilted, about 3 minutes. Drain well and transfer to a food processor. Puree until finely chopped, about 5 pulses.\nHeat 1 tablespoon canola oil in a large skillet over medium heat. Fry paneer cubes, stirring constantly, until browned on all sides, about 5 minutes. Set aside.\nHeat 2 tablespoons canola oil in the skillet and fry the cumin seeds until lightly toasted and aromatic, about 3 minutes. Add onion; cook and stir until onion begins to soften, 4 to 5 minutes. Stir in ginger, garlic, tomato, garam masala, turmeric, and cayenne pepper; cook and stir until tomatoes break down and onions are translucent, about 10 minutes.\nStir in spinach and fenugreek, cream, paneer cubes, and salt to taste. Cover and cook for 15 minutes, stirring occasionally.\n",
        "picture_link": "4EL0KZUvD1m2X7vnt1WF68AZ5hEVMFe"
    },
    {
        "title": "Curried Cauliflower Soup",
        "ingredients": [
            "1 head cauliflower, cut into florets ADVERTISEMENT",
            "1 onion, cut into chunks ADVERTISEMENT",
            "3 cloves garlic, halved ADVERTISEMENT",
            "5 cups vegetable stock ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 tablespoon curry paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place the cauliflower, onion, and garlic on a baking sheet, and bake in preheated oven until golden brown, about 30 minutes.\nBring vegetable stock, coconut milk, and curry paste to a boil in a large saucepan over high heat. Add the roasted vegetables, then reduce heat to medium-low, cover, and simmer for 15 minutes. Carefully puree the soup in a blender until it has reached your desired consistency, serve, and enjoy!\n",
        "picture_link": "PdIomys7vtVaL8wPWVBUjZAnVpEJAhK"
    },
    {
        "title": "Cabbage-Carrot Casserole",
        "ingredients": [
            "2 cubes chicken bouillon ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 pounds cabbage, sliced into thin strips ADVERTISEMENT",
            "2 large carrots, grated ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 ounces shredded Cheddar cheese, or more to taste ADVERTISEMENT",
            "1/4 teaspoon paprika, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nDissolve bouillon cubes in water in a large pot over medium-high heat. Cook cabbage and carrots in the seasoned water until tender, 20 to 30 minutes. Drain, reserving 1/2 cup of the cooking liquid. Transfer cabbage and carrots to an 8x11-inch casserole dish.\nMelt butter in a saucepan over medium heat. Stir flour into melted butter until hot, about 1 minutes. Pour reserved cooking liquid and milk into the flour mixture; stir until smooth. Add cheese to milk mixture; cook and stir until cheese is melted and the mixture is smooth and thick. Pour cheese sauce over cabbage and carrots; stir to coat. Season with paprika.\nBake in preheated oven until hot and bubbly, 20 to 30 minutes.\n",
        "picture_link": "uPGpQ1he8Y4BrtLr1as7RHVfJzcOjPi"
    },
    {
        "title": "Family Banana Nut Bread Recipe",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 eggs, well-beaten ADVERTISEMENT",
            "2 ripe bananas, mashed ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\nBeat together the cream cheese, sugar, butter, eggs, and banana in a large bowl until very smooth. Stir in the flour, baking powder, baking soda, and walnuts until just combined. Pour the batter into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour and 15 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "HrFrNPGLfKGFYZ6AIOpamBcnVuHzRXm"
    },
    {
        "title": "Creamy Baked Ziti",
        "ingredients": [
            "4 cups ziti pasta, uncooked ADVERTISEMENT",
            "1 (26 ounce) jar marinara sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "6 ounces PHILADELPHIA Cream Cheese, cubed ADVERTISEMENT",
            "3/4 cup BREAKSTONE'S or KNUDSEN Sour Cream ADVERTISEMENT",
            "1 (8 ounce) package KRAFT Shredded Mozzarella Cheese with a TOUCH OF PHILADELPHIA ADVERTISEMENT",
            "1/3 cup KRAFT Grated Parmesan Cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F.\nCook pasta in large saucepan as directed on package, omitting salt. Remove from pan; drain. Meanwhile, add marinara sauce, tomatoes and cream cheese to same pan; cook on medium heat 5 min. or until cream cheese is melted and mixture is well blended, stirring frequently. Return pasta to pan; mix well.\nLayer half the pasta mixture in 13x9-inch baking dish; cover with layers of sour cream, 1 cup mozzarella and remaining pasta mixture. Top with remaining mozzarella and Parmesan.\nBake 20 min. or until heated through.\n",
        "picture_link": "bV97B2SOsKkgVecTtS3GEWQOnJx6RbG"
    },
    {
        "title": "Pizza Crust II",
        "ingredients": [
            "4 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "11 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "6 tablespoons margarine ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup grated Parmigiano Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast and sugar in 1 1/2 cups warm water. Let stand 5 to 6 minutes, until mixture is foamy.\nIn a large bowl, mix together half the flour, remaining water, garlic powder, salt, oregano, and margarine. Add yeast mixture, and stir to combine. Work in remaining flour 1/2 cup at a time until a soft dough forms.\nTransfer dough to a lightly floured surface, and knead for 10 minutes. Put dough in large plastic bag, and place in refrigerator. Let rise until tripled in bulk.\nFor a round pizza, break off about 2 cups of the dough. Grease a 15 inch round pan, and sprinkle lightly with corn meal. Roll out the dough to fit the pan, stretching it to fit. Brush crust with olive oil, and sprinkle with cheese. Add desired toppings.\nBake at 450 degrees F (230 degrees C) for 18 to 20 minutes.\n",
        "picture_link": "x/JcgK4G7M6QtRGpZ5q2ZfoIGpp3lh6"
    },
    {
        "title": "Tomato Soup Cake I",
        "ingredients": [
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 1/2 cups self-rising flour ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the tomato soup and the soda in a bowl, and let it stand.\nCream sugar, egg, butter, salt, cinnamon, and cloves. Mix in tomato soup and soda mixture, and then flour. Stir in the raisins, and pour the batter in a greased baking dish.\nBake at 325 degrees F (165 degrees C) for 1 hour, or until done. Cool the cake, and top with cream cheese icing.\n",
        "picture_link": "BVmCp0BJqhRYbAxmlnL.6CqeXr2n6fi"
    },
    {
        "title": "Roti Bread from India",
        "ingredients": [
            "2 cups durum wheat flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the flour, salt, water and oil, until the mixture pulls away from the sides. Turn the dough out onto a well floured surface. Knead until smooth and pliable, about 10 minutes.\nPreheat an unoiled skillet or tava to medium high heat. Divide dough into 12 equal parts, form into rounds and cover with a damp cloth. Flatten the balls with the palm of your hand, then use a rolling pin to roll out each piece into a 6 to 8 inch diameter round.\nCook the roti for 1 minute before turning over, then turn again after another minute. The roti should have some darker brown spots when finished. Best served warm.\n",
        "picture_link": "BgDAUPIhVbS3priD8vEv6GeBra5BSEq"
    },
    {
        "title": "Lemon Gold Cake",
        "ingredients": [
            "2 1/2 cups sifted cake flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "1 1/8 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line two 9 inch round pans with parchment paper. Preheat oven to 350 degrees F (175 degrees C).\nMeasure sifted flour, baking powder, and salt; sift together three times.\nCream butter or margarine and lemon rind together. Gradually add sugar, creaming until light and fluffy. Add egg yolks one at a time, beating thoroughly after each addition. Add sifted ingredients alternately with milk to the creamed mixture, a small amount at a time; beat after each addition until smooth.\nBake for 25 to 30 minutes. Cool on wire racks.\n",
        "picture_link": "5zfK0K6xfJWLaTqE4SE5x4cVgf4yysG"
    },
    {
        "title": "Sun Dried Tomato and Asiago Cheese Bread",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons instant powdered milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups bread flour ADVERTISEMENT",
            "1/2 cup amaranth flour ADVERTISEMENT",
            "2 tablespoons chopped sun-dried tomatoes ADVERTISEMENT",
            "1/4 cup grated Asiago cheese ADVERTISEMENT",
            "1 teaspoon dried basil (optional) ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients into bread machine in order given.\nBake according to bread machine directions for regular bake.\n",
        "picture_link": "rG7/zYwOuFzUc9/ozzqR847Jzgjnif2"
    },
    {
        "title": "Very Berry Cheesecake",
        "ingredients": [
            "40 vanilla wafers, crushed ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup cottage cheese, creamed ADVERTISEMENT",
            "1/4 cup cherry brandy ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 1/2 cups fresh blackberries ADVERTISEMENT",
            "1 tablespoon cherry brandy ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together vanilla wafer crumbs and butter. Press the mixture into the bottom and 1 3/4 inch up the sides of an 8 inch springform pan. Set aside.\nIn a large bowl, stir together cream cheese, 3/4 cup sugar, flour, and vanilla. Beat with an electric mixer on low speed until smooth. Set aside. Place cottage cheese in a blender or food processor. Blend until smooth. Stir into cream cheese mixture. Stir in the 1/4 cup cherry brandy. Beat in eggs on low speed just till combined. You do not want do incorporate too much air into the batter.\nPreheat the oven to 375 degrees F (190 degrees C). Pour half of the cheese mixture into the crust-lined pan. Spread 1 cup of the fruit on top. Top with remaining cheese mixture and 1/2 cup of the fruit. Place in a shallow baking pan in the preheated oven.\nBake for 40 to 45 minutes or till center appears nearly set when shaken. Cool on a wire rack for 15 minutes. Loosen sides. Cool completely on wire rack. Cover and chill for at least 4 hours, or until ready to serve.\nFor topping, in a medium bowl combine remaining 2 cups fruit, 1 tablespoon cherry brandy, and 1 tablespoon sugar. Cover and chill for up to 2 hours. To serve, cut cheesecake into wedges. Top each serving with fruit topping.\n",
        "picture_link": "KfHcWBcEms80ILR6mCoYa/6/HjMKyVe"
    },
    {
        "title": "Nell's Cabbage Salad",
        "ingredients": [
            "1 medium head cabbage, shredded ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "2 (3 ounce) packages chicken flavored ramen noodles ADVERTISEMENT",
            "4 ounces slivered almonds, toasted ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the cabbage, green onions, noodles and almonds.\nPrepare the dressing by whisking together the oil, sugar, vinegar and seasoning packets. Pour over cabbage mixture and mix well to coat. Refrigerate until chilled and serve.\n",
        "picture_link": "oPLhM3sNryiHP9dGsMaPGmxRrPREQpS"
    },
    {
        "title": "Potato and Vegetable Frittata",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup diced green bell pepper ADVERTISEMENT",
            "1 zucchini, halved lengthwise and cut in 1/4 inch slices ADVERTISEMENT",
            "2 cups cooked and diced potatoes ADVERTISEMENT",
            "1 cup chopped fresh tomato ADVERTISEMENT",
            "2 tablespoons black olives ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/2 small tomato, sliced ADVERTISEMENT",
            "1/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the broiler on your oven.\nIn a frying pan with an ovenproof handle heat the oil and saute onion, garlic and green bell pepper over a low heat. Saute until vegetables are just tender but not browned. Add the zucchini and continue cooking, stirring occasionally, until crisp-tender. Add the potatoes, stir well to combine, and continue cooking, stirring frequently, until the potatoes are heated through and starting to stick to the pan.\nThen add the tomatoes and black olives, stirring well to combine with the other ingredients, and cook just until the tomatoes have begun giving up their juice.\nBeat the eggs with the salt, pepper, oregano, and cayenne. When all the vegetables are cooked, pour the eggs over them\nArrange the tomato slices over the top of the eggs, and sprinkle the mozzarella and Parmesan cheeses over the tomato slices. Cook gently over low heat until the eggs are almost set (they'll be firm around the edges and a bit runny in the middle).\nSlip the pan under the broiler for a minute or two, until the eggs are fully set and the cheese has melted and begun to brown. Cut into wedges and serve.\n",
        "picture_link": "hZxcCBf7Qrg2n.Yn5aTeNvg0GcYJAcq"
    },
    {
        "title": "Sour Cream Coffee Cake II",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 8x12 inch pan.\nIn a large bowl, cream together 1 cup of the white sugar with 1 cup butter. Add the eggs and beat well. Mix in the flour, baking soda, baking powder, and sour cream, stir until just combined.\nPour 1/2 of the batter into the prepared pan then sprinkle with 3/4 of the filling. Pour the remaining cake batter on top and sprinkle top with the remaining filling. Bake at 350 degrees F (175 degrees C) for 40 minutes.\nTo Make Filling: Combine chopped nuts, ground cinnamon, and 3/4 cup white sugar and mix well.\n",
        "picture_link": "zkVC12z8nkuMBe9WbsSo/9I.iBsSAGy"
    },
    {
        "title": "Cranberry Wheat Bread",
        "ingredients": [
            "1 1/4 cups water ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "2 cups bread flour ADVERTISEMENT",
            "1 1/4 cups whole wheat flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "1 cup sweetened dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients (except cranberries) in the pan of the bread machine in the order recommended by the manufacturer. Select Sweet Bread cycle; press Start.\nIf your machine has a Fruit setting, add the cranberries at the signal, or about 5 minutes before the kneading cycle has finished.\n",
        "picture_link": "7Vl5FS2eLTGWoc2qpW2tc9nbAkllzTO"
    },
    {
        "title": "Breakfast Bread",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "2/3 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "7 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the milk in a small saucepan until it bubbles, then remove from heat. Add the butter, salt and sugar and stir until melted; let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine milk mixture with the yeast mixture. Mix in the egg and 3 cups of flour. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until dough reaches the pan tops, about 30 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven for 45 to 50 minutes, or until bottom of the loaves sound hollow when tapped. Place on wire racks to cool.\n",
        "picture_link": "5lRWPY2L2km28RwR1KhT4icKZHWJPnK"
    },
    {
        "title": "Thirty Day Friendship Cake",
        "ingredients": [
            "2 cups Friendship Fruit Starter ADVERTISEMENT",
            "1 (15 ounce) can sliced peaches with juice ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "1 (15 ounce) can pineapple chunks with juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 (10 ounce) jars maraschino cherries ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "2 (18.25 ounce) packages yellow cake mix ADVERTISEMENT",
            "2 (3.4 ounce) packages instant vanilla pudding mix ADVERTISEMENT",
            "1 1/3 cups vegetable oil ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "2 cups golden raisins ADVERTISEMENT",
            "2 cups chopped walnuts ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Day One: In a large glass jar or bowl, combine 2 cups of the starter with 1 can of the sliced peaches and their juice (each slice chopped into 4 pieces). Add 2 1/2 cups of the white sugar and stir once every day for 10 days. When not stirring mixture, keep it covered with a paper towel, foil, or a loose lid. Let sit at room temperature. Don't refrigerate it or cover it airtight. A pan of water underneath the jar or bowl will keep the ants out.\nDay Ten: Add 1 can of chunk pineapple and it's juice. Cut each chunk of pineapple in half. Stir in 1/2 cup of white sugar. Stir once everyday for 10 days. The color should change, and the mixture should foam when stirred.\nDay Twenty: Slice each cherry in half, and stir in. Add 2 1/2 cups of the white sugar. Stir once every day for the final 10 days. The cherries will give the juice back its pinkish color.\nDay Thirty: Drain fruit and reserve it and the liquid. The fruit will be used in the cake. Pour the liquid into 3 glass or ceramic pint jars. One for you to start your next cake, and two for friends. Cake must be started within 3 days after receiving the starter, or you should freeze the starter to use at a later date. Do not use plastic or metal containers to store liquid!\nPreheat oven to 325 degrees F (165 degrees C). Grease and flour two 9x13 inch baking pans.\nIt's best to mix the two cakes separately. Combine 1 box of the cake mix, 1 box of the instant vanilla pudding, 2/3 cup of the vegetable oil, and 4 of the eggs. Stir, then add 1/2 of the drained reserved fruit from the starter. Stir, then add 1 cup of the golden raisins, 1 cup of the chopped nuts and 1 cup of the coconut. Stir until all ingredients are combined. The batter will be stiff. Pour batter into the prepared cake pan. Repeat for cake number two.\nBake cakes at 325 degrees F (165 degrees C) for 55 to 65 minutes.\n",
        "picture_link": "cB/n6pW0rnE.9IGH4vAIMXYCBihxtzm"
    },
    {
        "title": "Traci's Chicken Noodle Casserole",
        "ingredients": [
            "4 boneless chicken breast halves, cooked and cubed ADVERTISEMENT",
            "2 cups elbow macaroni ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 cups condensed cream of celery soup ADVERTISEMENT",
            "1 cup cubed processed cheese ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 9x13 inch baking dish combine the chicken, macaroni, milk, soup, cheese, onions and salt and pepper to taste. Mix all together, cover dish and let sit in refrigerator overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nBake at 350 degrees F (175 degrees C) for 1 hour.\n",
        "picture_link": "Z1YbkN/gG0VMGhCVBRivPC6mE9/8p4y"
    },
    {
        "title": "Craving Cookies",
        "ingredients": [
            "1/2 cup mashed banana ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the mashed banana and peanut butter until well blended. Stir in the brown sugar, white sugar and vanilla until smooth. Combine the flour and baking powder; add to the peanut butter mixture and mix well. Finally, fold in the chocolate chips. Cover and chill dough for at least 1 hour.\nPreheat the oven to 375 degrees F (190 degrees C). Line cookie sheets with parchment paper. Roll dough into walnut sized balls and place 2 inches apart onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "aynBEhTvlM4nq4tGX0TQCa9nncW82G6"
    },
    {
        "title": "Dulce de Leche",
        "ingredients": [
            "1 gallon milk ADVERTISEMENT",
            "1 vanilla bean ADVERTISEMENT",
            "4 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, bring milk to a boil over medium-high heat. Remove from heat and strain through cheesecloth. Return to pan.\nCut vanilla bean in half and pour the seeds in the milk. Stir in the sugar and replace the pan on medium-high heat, stirring constantly until the sugar is dissolved. Just as the milk mixture begins to boil, stir in the baking soda. Reduce the heat to medium, stirring constantly until mixture thickens. When a wooden spoon drawn through the mixture leaves the bottom of the pan visible, and the mixture is light brown in color, remove the pan from the heat.\nPlace the pan in an ice bath and stir constantly until dulce de leche is cold. Store in airtight container in refrigerator. Pour into sterile jars, and store in the refrigerator.\n",
        "picture_link": ".6dxUWVRCvFAZpTr3orqQ.3tGPyvmD."
    },
    {
        "title": "Danish Pastry Apple Bars II",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2/3 cup cold water ADVERTISEMENT",
            "1 cup cornflakes cereal ADVERTISEMENT",
            "10 apples - peeled, cored and sliced ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, combine flour and salt. Cut in the butter until the mixture resembles coarse crumbs. In a cup, beat egg yolk, stir the cold water into the yolk. Gradually stir the egg mixture into the flour mixture until dough can be packed into a ball. On a clean dry surface, roll out 1/2 of the dough large enough to cover the bottom and sides of a 9x13 inch pan. Lay the dough in the pan.\nPlace the cornflakes over the dough in the pan. Arrange apple slices over the top of the corn flake layer. Sprinkle the sugar and cinnamon over the apples. Roll out the second half of the dough to cover the entire pan. Lay over the filling and pinch the edges of the two crusts together. Beat the egg white until foamy, and brush onto the top crust.\nBake for 45 to 50 minutes in the preheated oven, until golden brown. Drizzle with glaze while still warm.\nTo make the glaze: In a small bowl, beat the confectioners' sugar with the milk and almond extract until smooth.\n",
        "picture_link": "Wzwsdi24Vv6bFGaEVa9B3WOoP.inNwq"
    },
    {
        "title": "Cranberry Orange Breakfast Bread",
        "ingredients": [
            "1 1/8 cups orange juice ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1 tablespoon dry milk powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1 cup sweetened dried cranberries ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select cycle; press Start. If your machine has a Fruit setting, add the cranberries and nuts at the signal, or about 5 minutes before the kneading cycle has finished.\n",
        "picture_link": "kqpackB9S821/gWS67XQsUbTuZaSDke"
    },
    {
        "title": "Double Cheese Casserole",
        "ingredients": [
            "1 (12 ounce) package uncooked egg noodles ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "4 ounces cream cheese ADVERTISEMENT",
            "12 ounces cottage cheese ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook egg noodles according to package directions.\nWhile noodles are cooking, brown the ground beef and onion in a large skillet over medium high heat. Reduce heat to low, add the tomato sauce, stir well, and let simmer for 1 minute. Add the cream cheese and cottage cheese, stirring together until well blended. Then stir in the egg noodles and sour cream until all ingredients are well mixed. Pour into a 2 quart casserole dish.\nBake at 350 degrees F (175 degrees C) for 30 minutes. Season with salt and pepper to taste.\n",
        "picture_link": "oPEi0NXGMPVghMRrBz9r3kbsSTkn/0m"
    },
    {
        "title": "Frog Eyed Salad",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups pineapple juice ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 (16 ounce) package acini di pepe pasta ADVERTISEMENT",
            "2 (20 ounce) cans pineapple chunks ADVERTISEMENT",
            "2 (11 ounce) cans mandarin oranges, drained ADVERTISEMENT",
            "3/4 cup maraschino cherries, chopped ADVERTISEMENT",
            "1 (16 ounce) package miniature marshmallows ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large saucepan over low heat, combine sugar, egg yolks, flour, pineapple juice and lemon juice. Stir and cook until thickened. Remove from heat.\nWhile sauce is cooking, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and rinse with cold water.\nIn large bowl, combine cooked mixture with pasta and toss to coat thoroughly. Refrigerate 8 hours or overnight.\nToss pasta with pineapple, mandarin oranges, maraschino cherries, marshmallows and whipped topping. Refrigerate until serving.\n",
        "picture_link": "A9lGntJfnVbkJUTmWGcyevLTQzL4D9G"
    },
    {
        "title": "Bourbon Street New York Strip Steak",
        "ingredients": [
            "2 (6 ounce) boneless New York strip steaks ADVERTISEMENT",
            "3 cups bourbon whiskey ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently tenderize steaks with a meat mallet. With a sharp knife, lightly score the meat on one side diagonally. Place steaks in a casserole dish, scored side up, and pour bourbon over them. Rub the brown sugar evenly over each steak. Marinate in refrigerator for 1 to 3 hours.\nPreheat grill to high heat, and lightly oil grate.\nPlace the steaks on the hot grill, with the sugar side down. Let cook until sugar has caramelized, 3 to 5 minutes, then flip steaks, and finish cooking to desired doneness.\n",
        "picture_link": "y.sVg7ngikk1Rt.WX54E0Z8UHvsibm6"
    },
    {
        "title": "Ronnetta's Spaghetti Sauce",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1/2 cup grated onion ADVERTISEMENT",
            "1 packet dry spaghetti sauce mix ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the beef, garlic, and onion in a large pot over medium-high heat until the beef has browned; stirring often to break up the meat. Stir in the sauce mix, tomato sauce, and tomato paste. Reduce heat to low, and simmer for about 30 minutes, adding water to thin if needed. Season to taste with salt and pepper.\n",
        "picture_link": "gEwSdxhcgWvv9rBzuU5AwKcpNCor9fO"
    },
    {
        "title": "Flea Terminator Dog Treats",
        "ingredients": [
            "3 cubes beef bouillon ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 cup cornmeal ADVERTISEMENT",
            "2/3 cup brewers' yeast ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Dissolve beef bouillon cubes in boiling water, and set aside. Grease cookie sheets.\nIn a large bowl, stir together the whole wheat flour, corn meal, brewers yeast, and garlic powder. Add the yolks, then gradually pour in the bouillon water while stirring. Mix thoroughly to form a firm dough. On a floured surface, roll the dough out to 1/4 inch thickness. Cut into desired shapes using cookie cutters. Place cookies one inch apart onto cookie sheets.\nBake for 20 minutes in the preheated oven, then turn the oven off, and leave the cookies inside for at least 3 hours or overnight to harden. Store in an airtight container at room temperature.\n",
        "picture_link": "wVDRFaeajeWAwmT5hdX9V3Ynra.Bk92"
    },
    {
        "title": "Herbed and Spiced Roasted Beef Tenderloin",
        "ingredients": [
            "2 tablespoons fresh rosemary ADVERTISEMENT",
            "2 tablespoons fresh thyme leaves ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "1 large shallot, peeled and quartered ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1 tablespoon coarse salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 (2 pound) beef tenderloin roasts, trimmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, combine rosemary, thyme, bay leaves, garlic, shallot, orange zest, salt, pepper, nutmeg, and cloves. Run machine while adding oil; process until smooth. Spread mixture evenly over all sides of tenderloins. Place beef in a large glass baking dish. Cover with foil, and refrigerate for at least 6 hours.\nPreheat oven to 400 degrees F (200 degrees C). Place tenderloins on a rack in a large roasting pan.\nRoast beef in preheated oven until meat thermometer registers 140 degrees when inserted into center of beef, about 35 minutes. Remove from oven, and cover loosely with foil; let stand for 10 minutes. Slice beef, and serve.\n",
        "picture_link": "V3zGRbaVFQZX6A.XPiSNJZupKitupcK"
    },
    {
        "title": "Galaktoboureko",
        "ingredients": [
            "6 cups whole milk ADVERTISEMENT",
            "1 cup semolina flour ADVERTISEMENT",
            "3 1/2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "12 sheets phyllo dough ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour milk into a large saucepan, and bring to a boil over medium heat. In a medium bowl, whisk together the semolina, cornstarch, 1 cup sugar and salt so there are no cornstarch clumps. When milk comes to a boil, gradually add the semolina mixture, stirring constantly with a wooden spoon. Cook, stirring constantly until the mixture thickens and comes to a full boil. Remove from heat, and set aside. Keep warm.\nIn a large bowl, beat eggs with an electric mixer at high speed. Add 1/2 cup of sugar, and whip until thick and pale, about 10 minutes. Stir in vanilla.\nFold the whipped eggs into the hot semolina mixture. Partially cover the pan, and set aside to cool.\nPreheat the oven to 350 degrees F (175 degrees C).\nButter a 9x13 inch baking dish, and layer 7 sheets of phyllo into the pan, brushing each one with butter as you lay it in. Pour the custard into the pan over the phyllo, and cover with the remaining 5 sheets of phyllo, brushing each sheet with butter as you lay it down.\nBake for 40 to 45 minutes in the preheated oven, until the top crust is crisp and the custard filling has set. In a small saucepan, stir together the remaining cup of sugar and water. Bring to a boil. When the Galaktoboureko comes out of the oven, spoon the hot sugar syrup over the top, particularly the edges. Cool completely before cutting and serving. Store in the refrigerator.\n",
        "picture_link": "OkPUMK5Gj5nx9QfNsML.rPePVepLZAK"
    },
    {
        "title": "Classic Veal Marsala",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound veal medallions ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 large shallot, minced ADVERTISEMENT",
            "1 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 cup dry Marsala ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 cups low-sodium chicken broth ADVERTISEMENT",
            "1 cup low-sodium beef broth ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 250 degrees F (120 degrees C).\nHeat 1 tablespoon olive oil in a skillet over medium-high heat. Lightly coat the veal medallions in flour, and season with salt and pepper. Cook in the heated skillet about 5 minutes, to an internal temperature of 160 degrees F (70 degrees C). Remove from the skillet, place in a baking dish covered with foil, and keep warm in the preheated oven until ready to serve.\nHeat the remaining olive oil in the skillet over medium low heat, and saute the shallot and mushrooms, scraping up any browned bits, until shallots are tender. Increase heat to medium high, and stir in the Marsala and garlic. Cook and stir until thickened. Mix the chicken broth and beef broth into the skillet, and continue to cook and stir until reduced to about 1/4 cup. Remove from heat, and whisk in the butter until melted. Serve over the veal.\n",
        "picture_link": "KQB/rjemS6GEVjIZ0NZbB3J1jwLqzhe"
    },
    {
        "title": "Decadent Challah Bread",
        "ingredients": [
            "1/3 cup honey ADVERTISEMENT",
            "1 1/4 cups warm water ADVERTISEMENT",
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2/3 cup olive oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "5 cups unbleached flour, plus more if needed ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve the honey in the water in a large mixing bowl, and stir in the yeast. Set the mixture aside until the yeast forms a creamy layer on top, about 15 minutes. Stir in the salt, 2/3 cup of olive oil, and beaten eggs. Add the flour 1 cup at a time until the dough is slightly tacky, but not sticky wet.\nTurn it out onto a floured surface, and knead until smooth and elastic, about 10 minutes. Lightly oil a bowl, place the dough in the bowl, turn the dough over a few times to oil the surface, then let rise until doubled in a warm, draft-free place, about 90 minutes.\nTo make the loaves, punch down the dough, and cut it into 2 equal-sized pieces. Cut the first piece into 4 equal parts. Set the second piece aside under a cloth to prevent drying out while you braid the first loaf.\nTo braid the first 4-strand loaf, roll the 4 pieces of dough into thin ropes about the width of your thumb, and about 14 inches long. Make the tops and bottoms of each rope thinner than the middle area. Pinch the tops of the 4 ropes together, and fan the 4 ropes out so they don't touch.\nTo make an \"under-2, over-1 braid,\" take the left-most rope, and move it to the right to cross underneath the next 2 ropes, then move it left to cross back over the strand immediately to its left. Take the far right strand, and move it to the left and cross it under the two strands to its left (they are already crossed from the previous braid); then move it right to cross back over the strand immediately to its right. Repeat until the 4 strands are braided together all the way to the end, and pinch the ends tightly together. Repeat the steps to braid the second loaf, and let the braided loaves rise for 1 hour.\nPreheat an oven to 350 degrees F (175 degrees C), and line baking sheets with parchment paper.\nMake a glaze by whisking together the milk, 2 tablespoons of olive oil, the egg white, and the sugar in a bowl. Brush the braided loaves with the glaze, to make a shiny crust, and bake the loaves on the prepared baking sheets in the preheated oven until they are light golden brown, about 30 minutes.\n",
        "picture_link": "B1vHizDNbK8ovfmy2foPJUgjWeJPKma"
    },
    {
        "title": "Croque-Monsieur",
        "ingredients": [
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "4 tablespoons butter or margarine, softened ADVERTISEMENT",
            "6 slices white bread ADVERTISEMENT",
            "6 slices Swiss cheese ADVERTISEMENT",
            "12 slices thinly sliced deli ham ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Use 2 tablespoons of the butter to spread over one side of each slice of bread. On three of the slices, spread a layer of Dijon mustard over the butter, and top each with 4 slices of ham. On the other three, spread mayonnaise, and top each one with 2 slices of Swiss cheese. Press ham and cheese sides of sandwiches together.\nIn a flat bottomed dish, whisk together the flour, baking powder, salt, eggs, and water until blended. Set aside.\nHeat remaining butter and vegetable oil in a large skillet over medium heat. Dip both sides of each sandwich in the egg mixture, and fry in the oil and butter until browned, flipping to brown on each side.\n",
        "picture_link": "abbUWM0QMRAZ3qfcnSXuzsSxHwPusoi"
    },
    {
        "title": "Orange Coconut Salmon",
        "ingredients": [
            "4 (4 ounce) fillets salmon ADVERTISEMENT",
            "2 cups orange juice ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (7 ounce) package flaked coconut ADVERTISEMENT",
            "4 tablespoons orange marmalade ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place salmon fillets in a medium bowl with orange juice. Cover, and marinate in the refrigerator 8 hours, or overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nCoat salmon fillets with egg. Dip fillets in coconut, and arrange in a single layer on a medium baking sheet. Bake 15 minutes in the preheated oven, until coconut is golden brown and fish is easily flaked with a fork.\nIn a small saucepan over medium heat, blend orange marmalade and Dijon mustard. Heat until warm, and serve as a dipping sauce for the salmon.\n",
        "picture_link": "eMHezZGnlHoMNeGaumcytIzZ/rojx.e"
    },
    {
        "title": "Calabacitas Con Queso - Zucchini with Cheese",
        "ingredients": [
            "1 1/2 pounds zucchini, cut into bite sized pieces ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn ADVERTISEMENT",
            "1 medium onion, sliced ADVERTISEMENT",
            "1 medium green bell pepper, coarsely chopped ADVERTISEMENT",
            "1 medium tomato, coarsely chopped ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 1/2 pounds Monterey Jack cheese, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan with a lid, combine zucchini, corn, onion, green pepper, tomato, and vegetable oil. Cover, and cook over medium heat until tender.\nGently stir in the sugar; add cheese on top, but do not stir. Cover, and continue cooking until cheese is melted. Stir, and add remaining cheese; cover, and continue cooking until melted. Serve warm.\n",
        "picture_link": "tlyo61z8HLHNus3AfXDegQXR3yHB8XK"
    },
    {
        "title": "Smoked Turkey Tortilla Wraps",
        "ingredients": [
            "10 whole wheat flour tortillas ADVERTISEMENT",
            "10 slices smoked turkey, cut into thin strips ADVERTISEMENT",
            "1 avocado - peeled, pitted and sliced ADVERTISEMENT",
            "1/2 cup sour cream, for topping ADVERTISEMENT",
            "1/2 cup Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat flour tortillas in a large skillet over medium heat until slightly browned. Divide turkey strips, avocado, sour cream, and cheese among the warmed tortillas. Fold in half and serve.\n",
        "picture_link": "uQ3k7dktNGzKGjw5dohXPph02k0/vke"
    },
    {
        "title": "Creamy Asparagus Pasta",
        "ingredients": [
            "1 pound fresh asparagus, trimmed and cut into 2 inch pieces ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pint light cream ADVERTISEMENT",
            "1 pound linguine pasta ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Boil asparagus for 3 to 4 minutes; drain.\nIn a large saucepan melt butter over medium heat. Saute garlic and asparagus for 3 to 4 minutes. Stir in the cream and simmer for 10 minutes.\nMeanwhile, bring a large pot of water to a boil. Add linguine and cook for 8 to 10 minutes or until al dente; drain and transfer to a serving dish.\nStir lemon juice into asparagus mixture; pour mixture over pasta.\n",
        "picture_link": "TdU0SFYUigmC4vqE.CJZxaHL2CltHFm"
    },
    {
        "title": "Italian Wheat Rolls",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1/3 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "4 cups bread flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine olive oil, white sugar and salt. Add boiling water and stir to dissolve sugar; let cool to lukewarm.\nIn a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nWhen sugar and water mixture has cooled, add yeast mixture, eggs, whole wheat flour and 2 cups bread flour. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\nDivide the dough into twenty four equal size pieces and form into rounds. Place the rounds on lightly greased baking sheets. Cover the rolls with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until golden brown, about 15 to 20 minutes.\n",
        "picture_link": "GNCfClIfzvJy5zMfDhC9/RUksk/.AM."
    },
    {
        "title": "Chocolate Almond Pudding",
        "ingredients": [
            "1/2 cup sugar ADVERTISEMENT",
            "1/3 cup baking cocoa ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, stir together the sugar, cocoa and cornstarch. Gradually whisk in milk and egg. Stirring constantly, bring to a boil over medium heat, and cook until thickened. Remove from heat, and quickly stir in the vanilla and almond extracts. Garnish as desired, and serve warm.\n",
        "picture_link": "atH1XYy4Wrdyhp3vzBkYm8D1/cHqusy"
    },
    {
        "title": "Chicken and Spinach Ravioli",
        "ingredients": [
            "4 eggs, beaten ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "3 3/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 pound ground chicken ADVERTISEMENT",
            "3/4 cup chopped fresh spinach ADVERTISEMENT",
            "2 tablespoons finely chopped onion ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "3 tablespoons freshly grated Asiago cheese ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) jar marinara sauce ADVERTISEMENT",
            "1/4 cup freshly grated Asiago cheese for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the eggs, water, 2 cups flour, and salt. Gradually mix in the remaining flour until smooth. Divide dough into 2 parts. Cover, and set aside in the refrigerator 20 minutes.\nIn a skillet over medium heat, cook the ground chicken until evenly brown; drain.\nIn a food processor, mix the chicken, spinach, and onion. Transfer to a bowl, and mix with butter, 3 tablespoons Asiago cheese, salt, garlic powder, nutmeg, and pepper.\nOn a lightly floured surface, roll out each part of the dough to 1/8 inch thickness. Cut into 2 inch squares. Place about 1 teaspoon of the chicken mixture in the center of 1/2 the squares, and top with remaining squares. Seal the edges of the squares with a moistened fork to form the ravioli.\nBring a large pot of lightly salted water to a boil, and cook the ravioli in small batches for about 8 minutes, or until al dente. Drain, and rinse under cold water.\nPlace the marinara sauce in a saucepan, and cook until heated through. Serve ravioli topped with marinara sauce and remaining Asiago cheese.\n",
        "picture_link": "RmBUm30HUDc1S0sEwg3xM6rn1jE/3wm"
    },
    {
        "title": "Ann's Neptune's Delight",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups heavy cream, divided ADVERTISEMENT",
            "2 ounces freshly grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons dry sherry ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "2 cups cooked crabmeat ADVERTISEMENT",
            "1 cup peeled cooked shrimp ADVERTISEMENT",
            "1 1/2 cups garlic-flavored croutons ADVERTISEMENT",
            "1/4 cup fresh parsley ADVERTISEMENT",
            "4 tablespoons melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large saucepan over medium heat, melt 3 tablespoons of butter. Remove from heat and whisk in flour. Pour in 1/2 cup of heavy cream and whisk well, return to heat.\nAdd cheese and stir until creamy. Remove from heat and pour in remaining cream. Stir in sherry, paprika, crabmeat, and shrimp. Spoon mixture into 6 large individual ramekins.\nIn a food processor or blender, blend together croutons and parsley. Top each filled ramekin with crouton mixture. Drizzle melted butter over the top.\nBake in preheated oven for 20 minutes or until top is browned and bubbly.\n",
        "picture_link": ".b/utq33/8vQpq71hy2SxJjxngU5jrO"
    },
    {
        "title": "Texas Beef Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound lean beef stew meat ADVERTISEMENT",
            "1 tablespoon seasoning salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1/2 green bell pepper, finely chopped ADVERTISEMENT",
            "2 1/2 cups beef broth ADVERTISEMENT",
            "1 (15 ounce) can mixed vegetables ADVERTISEMENT",
            "1 (11.5 fl oz) can spicy vegetable juice cocktail ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large heavy skillet. Season the stew meat with seasoning salt and pepper. Cook meat in the oil along with onion and bell pepper until browned. Transfer to a slow cooker, and stir in the beef broth.\nCook on Low for 6 to 8 hours, or until meat is tender. During the last 30 minutes, stir in the mixed vegetables and vegetable juice cocktail.\n",
        "picture_link": "qB/l7RIxFFnhDjV9xe9z4qRUkj/cGoi"
    },
    {
        "title": "Barbequed Hamburgers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup uncooked rolled oats ADVERTISEMENT",
            "2/3 cup evaporated milk ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "4 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "4 teaspoons granulated sugar ADVERTISEMENT",
            "2/3 cup ketchup ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix the ground beef, oats, milk, 2 tablespoons minced onion, salt, and pepper. Let stand for a few minutes until milk is absorbed, and shape into 8 patties.\nIn a small bowl, thoroughly mix the Worcestershire sauce, vinegar, sugar, ketchup, and 1/4 cup chopped onion; set aside.\nHeat the oil in a medium skillet over medium heat, and fry the patties until brown on both sides. Pour the sauce in with the patties, and reduce heat. Continue cooking about 15 minutes.\n",
        "picture_link": "Q.IGoZmkjMtJpwt43EEhraeaOpPRGdO"
    },
    {
        "title": "Philly Cheesesteak Casserole",
        "ingredients": [
            "1 (16 ounce) package bow tie pasta ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can milk ADVERTISEMENT",
            "1 (4 ounce) can sliced mushrooms ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "3 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "3 tablespoons butter or margarine, melted ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Lightly grease a 9x13 inch baking dish. Bring a large pot of lightly salted water to a boil Add pasta, and cook until al dente, about 8 minutes; drain, and set aside in a large bowl.\nHeat vegetable oil in a skillet over medium heat. Saute onions until they begin to soften. Add ground beef, and cook, stirring, until evenly browned. Drain off grease, and pour into the bowl with the pasta. Stir in the condensed soup, then measure the milk using the soup can. Add mushrooms, and thyme until well blended. Mix in 3 cups of the cheese, and season with salt and pepper. Spread into baking dish.\nIn a small bowl, mix together the bread crumbs and melted butter. Mix in remaining 1 cup cheese. Sprinkle the mixture evenly over the top of the baking dish.\nBake for 30 to 35 minutes in the preheated oven, or until topping is crispy and golden.\n",
        "picture_link": "Qc1hge4OvC3Stz70xNqIer0PyaJaqPi"
    }
]