[
    {
        "title": "Kima",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 cup frozen peas ADVERTISEMENT",
            "1 tablespoon Masala curry powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1 dash ground black pepper ADVERTISEMENT",
            "1/4 cup flaked coconut, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat. stir in onion and garlic; cook until onion is translucent, 3 to 5 minutes.\nStir beef into onion mixture; cook until crumbly and no longer pink, 5 to 10 minutes. Drain excess fat from beef mixture.\nStir tomatoes, peas, curry powder, salt, paprika, chili powder, and black pepper into beef mixture; cook until thickened, about 20 minutes. Garnish with coconut.\n",
        "picture_link": "yoaMMTqzzaHsBILn4Uu/FMUZcGxdNxq"
    },
    {
        "title": "Great-Grandma Cathy's Date Loaf Candy",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup chopped dates ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sugar, milk, and butter together in a saucepan; bring to a boil without stirring once the boiling begins. Heat until a small amount of syrup dropped into cold water forms a rigid ball or until the mixture reaches 250 degrees F (120 degrees C), about 20 minutes. Immediately remove saucepan from heat and stir dates, pecans, and vanilla into the milk mixture.\nThoroughly wet a piece of cheesecloth and lay out onto a flat work surface. Pour the candy mixture into the middle of the cloth and roll the cloth around it to shape into a log.\nRefrigerate until hard, 8 hours to overnight. Remove log from cloth and slice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Grilled Spicy Shrimp",
        "ingredients": [
            "1 pound peeled and deveined shrimp ADVERTISEMENT",
            "1/4 cup Sriracha chile sauce ADVERTISEMENT",
            "1 teaspoon smoked paprika ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nPut shrimp in a large bowl; add chile sauce, paprika, garlic powder, onion powder, chili powder, and cumin and toss to coat.\nPlace shrimp onto the preheated grill using large tongs and cook until they are bright pink on the outside and the meat is no longer transparent in the center, 3 to 4 minutes.\n",
        "picture_link": "yhg0a0W/mn3Coa4TIt96Kf95EAm6f1i"
    },
    {
        "title": "Easy Polish Noodles",
        "ingredients": [
            "1 (49.5 fluid ounce) can chicken broth ADVERTISEMENT",
            "1/2 cup water, or as desired ADVERTISEMENT",
            "1 tablespoon chicken soup base, or more to taste ADVERTISEMENT",
            "1 (16 ounce) package kluski noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, water, and chicken base in a 6-quart saucepan and bring to a boil. Add kluski noodles, reduce heat, and simmer until liquid is completely absorbed, 30 to 40 minutes.\n",
        "picture_link": "4oYw0dHoFMFxlLMApR1B7ZV08bA2uqK"
    },
    {
        "title": "Baked Italian Egg, Zucchini, and Scallion Frittata",
        "ingredients": [
            "2 tablespoons coconut oil, melted ADVERTISEMENT",
            "1 cup shredded zucchini ADVERTISEMENT",
            "1 small yellow onion, or to taste, grated ADVERTISEMENT",
            "6 large eggs ADVERTISEMENT",
            "1/2 cup almond flour ADVERTISEMENT",
            "2 green onions, thinly sliced, or to taste ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "3/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking dish with coconut oil.\nDrain zucchini and onion in a colander until no longer wet, about 10 minutes.\nBeat eggs, almond flour, green onions, garlic, onion powder, basil, sea salt, and black pepper together in a large mixing bowl until smooth; stir zucchini and onion into the egg. Pour the egg mixture into the prepared baking dish.\nBake in preheated oven until set in the center, 35 to 40 minutes.\n",
        "picture_link": "7XannhQ9sKIR5h/2GAldcfkS4ka3WNm"
    },
    {
        "title": "Chef John's Sandy Beans ",
        "ingredients": [
            "Crumbs: ADVERTISEMENT",
            "1/4 cup garlic olive oil ADVERTISEMENT",
            "3/4 cup bread crumbs, or more to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "Beans: ADVERTISEMENT",
            "1 (15.5 ounce) can white beans, drained and rinsed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon white wine vinegar ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup freshly chopped parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat garlic olive oil, bread crumbs, and 2 tablespoons Parmesan cheese in a nonstick skillet over medium heat. Cook and stir until mixture resembles wet sand and is fragrant, 2 to 5 minutes. Stir in remaining Parmesan cheese; cook and stir until golden brown and crunchy, about 1 minute more. Transfer bread crumbs to a plate.\nReturn skillet to heat; cook and stir white beans, olive oil, vinegar, cayenne pepper, and salt in hot skillet until beans are heated through, about 5 minutes. Stir parsley and breadcrumbs to taste into beans; toss to coat.\n",
        "picture_link": "cv/3Bo6C27Nv2.e4x2n7V5LxWYtUDDm"
    },
    {
        "title": "Avocado Slaw",
        "ingredients": [
            "3 cups shredded red cabbage ADVERTISEMENT",
            "3 cups shredded green cabbage ADVERTISEMENT",
            "2 avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "3 tablespoons chopped red onion ADVERTISEMENT",
            "3 tablespoons chopped cilantro leaves ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix red cabbage, green cabbage, avocado, sesame seeds, red onion, cilantro, and lime juice together in a bowl.\n",
        "picture_link": "Ner9qEhctGm988k/hgzGb4pzDuAXegq"
    },
    {
        "title": "Iced Pumpkin Spice Cake",
        "ingredients": [
            "PAM® Coconut Oil No-Stick Cooking Spray ADVERTISEMENT",
            "3 cups Ultragrain® All Purpose Flour ADVERTISEMENT",
            "4 teaspoons pumpkin pie spice ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 cup Parkay® Original-stick, softened ADVERTISEMENT",
            "2 cups firmly packed brown sugar ADVERTISEMENT",
            "1 cup Egg Beaters® Original ADVERTISEMENT",
            "1 (15 ounce) can solid-pack pumpkin ADVERTISEMENT",
            "1 1/2 cups golden raisins ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 cup chopped pecans or walnuts ADVERTISEMENT",
            "Reddi-wip® Fat Free Dairy Whipped Topping (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Spray 13x9-inch baking pan with cooking spray. Combine flour, pumpkin pie spice and baking powder in medium bowl; set aside.\nMix together Parkay and sugar in large bowl on medium-high speed of electric mixer until creamy. Add Egg Beaters; mix until blended. Turn mixer to low; add pumpkin. Gradually blend in flour mixture. Stir in raisins by hand. Pour into prepared pan.\nBake 40 to 45 minutes or until wooden pick inserted in center comes out clean. Cool completely in pan on wire rack.\nBlend confectioners sugar and water; drizzle over cake. Sprinkle nuts evenly over top. Cut into 12 servings. Top with Reddi-wip just before serving, if desired.\n",
        "picture_link": "StCiPb3nsMKwjKoJfyg6xnsdiBkahTC"
    },
    {
        "title": "Chef John's Gremolata",
        "ingredients": [
            "2 tablespoons minced fresh parsley ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon freshly grated lemon zest ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 pinch salt and freshly ground black pepper to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir parsley, olive oil, lemon zest, garlic, salt, and pepper together in a small bowl until well-combined.\n",
        "picture_link": "JFtG0GABgHd/knrrKpFh8mDKdtwgZzy"
    },
    {
        "title": "Stars and Stripes Grand Finale Cake",
        "ingredients": [
            "2 pints fresh strawberries, hulled and sliced ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 (.25 ounce) envelope plain unflavored gelatin ADVERTISEMENT",
            "2 pints fresh blueberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 (.25 ounce) envelope plain unflavored gelatin ADVERTISEMENT",
            "2 (10.75 ounce) loaves angel food cake, sliced 1 inch thick ADVERTISEMENT",
            "2 (8 ounce) tubs frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix half of the strawberries, 1/2 cup of sugar, and 1 envelope of gelatin in a bowl. Set aside at room temperature to allow the juices to develop and the sugar and gelatin to dissolve, about 15 minutes. Heat in the microwave for 2 minutes on full power, or until gelatin has dissolved. Stir to blend in the gelatin and then mix in the remaining strawberries.\nIn a separate bowl, mash 1 cup of the blue berries with the back of a fork. Stir in 1/2 cup of sugar, and 1 envelope of gelatin. Set aside at room temperature to allow the juices to develop and the sugar and gelatin to dissolve. Heat in the microwave for about 2 minutes to melt the gelatin, then stir to blend. Mix in the remaining blueberries.\nCover the bottom and sides of a springform or a tall, removable bottom tube pan tightly with aluminum foil to keep the juices from seeping out.\nPour all of the strawberry mixture into the bottom of the cake pan, cover completely with slices of angel food cake, tearing or cutting pieces to fit in a tight layer. Spread 1 container of whipped topping over the first cake layer. Make a second layer of angel food cake, like the first, and pour the blueberry mixture evenly over the top. Arrange the angel food cake in a third layer on top of the blueberries, spread the remaining container of whipped topping on top. Finish the dessert with a final layer of angel food cake.\nThe layered cake will be higher than the edges of your pan. Carefully lay a large piece of aluminum foil over the cake and place a baking sheet on top. Invert the cake, press the cake firmly onto the baking sheet. Weigh down the mold, using pie weights or bags of dry beans or rice; refrigerate 8 hours, or overnight.\nSoak a kitchen towel in very hot water, wring out excess water, and wrap the towel around the cake pan; let stand for 1 minute. Remove the towel. Holding the pan and plate together, shake the cake back and forth to release it from the sides of the pan. Open the springform ring carefully, or pull back the sides of the tube pan. Do not force the cake to release. If it continues to stick, repeat the procedure with the hot towel.\n",
        "picture_link": "JuXam3TpmT82USvdTrAKU46jsZHWn5y"
    },
    {
        "title": "Quick 'n Easy Grape Salad with Concord Dressing",
        "ingredients": [
            "1 cup fresh lemon juice ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 1/4 pounds seedless red grapes, halved ADVERTISEMENT",
            "2 cups Concord grape juice ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1/3 cup fresh lemon juice ADVERTISEMENT",
            "5 tablespoons mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together 1 cup of lemon juice, 1/4 cup of honey, lemon zest, and parsley in a bowl until the honey has dissolved. Add the halved grapes, toss to coat, and set aside.\nWhisk together grape juice, 3 tablespoons of honey, and 1/3 cup of lemon juice until the honey has dissolved. Whisk in the mayonnaise until smooth. Pour this dressing over the grapes, toss to coat, and serve.\n",
        "picture_link": "jwBghllfacxl915zGeLLcEkiHjfZr9G"
    },
    {
        "title": "Grandma's Cranberry Sauce",
        "ingredients": [
            "1 (12 ounce) bag cranberries ADVERTISEMENT",
            "2 navel oranges - washed thoroughly, unpeeled, cut into quarters ADVERTISEMENT",
            "3 apples - peeled, cored and halved ADVERTISEMENT",
            "1 cup pecans ADVERTISEMENT",
            "1 cup white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cranberries, oranges, apples, pecans, and sugar in the bowl of a food processor. Process until all ingredients are evenly ground, 2-3 minutes. Pour mixture into a bowl, cover, and refrigerate at least 2 days before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Citrus-Tarragon Chicken Salad",
        "ingredients": [
            "5 cups chopped cooked chicken breast meat ADVERTISEMENT",
            "1 celery stalk, chopped ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "2 tablespoons fresh tarragon, chopped ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "2 teaspoons orange zest ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the chicken, celery, green onions, and tarragon together in a large bowl. Stir in the lemon juice, lemon zest, orange zest, and mayonnaise. Season to taste with salt and pepper. Refrigerate at least 30 minutes before serving.\n",
        "picture_link": "3Fo2FZOUc6iJxG1K/vq.CuweFPjoFim"
    },
    {
        "title": "Chocolate Hazelnut Spread",
        "ingredients": [
            "1 1/2 cups hazelnuts ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons vegetable oil, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLine a baking sheet with aluminum foil. Spread hazelnuts on the sheet in an even layer. Bake until skins have split and nuts are fragrant, 10 to 15 minutes; rub with a damp towel and blow the skins away. If they cooled off when you removed the skins, go ahead and warm them in the oven again. This will help them to release more oil.\nCombine the nuts and chocolate chips in the bowl of a food processor. Add the honey and process into a smooth paste, adding more oil if needed. Spoon into a container and store at room temperature.\n",
        "picture_link": "Y7WGVfYa/4oz315YCLck8ZP7UgMNXKG"
    },
    {
        "title": "Creamy French-American Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 onions, halved and thinly sliced ADVERTISEMENT",
            "1 pint heavy cream ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "salt and pepper, to taste ADVERTISEMENT",
            "3 slices French bread ADVERTISEMENT",
            "3 slices provolone cheese ADVERTISEMENT",
            "3 slices Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to broiler setting.\nMelt butter in a saucepan over medium heat. Add onions and cook until softened, 5 to 8 minutes. Stir in the heavy cream and beef broth. Bring to a boil, then reduce heat to low and simmer, loosely covered, for 20 minutes. Season with salt and pepper, to taste.\nTop each slice of bread with one slice of provolone and one slice of Swiss cheese; place on a cookie sheet. Broil on top oven rack until the cheese browns and the edges of the bread are crispy, 3 to 5 minutes.\nTo serve, ladle soup into 3 bowls and top with one slice of the cheese-topped bread.\n",
        "picture_link": "0daRbzrQrYmukpINnQT7eANPNhxHeNu"
    },
    {
        "title": "Rubber Soul",
        "ingredients": [
            "5 cubes ice ADVERTISEMENT",
            "1 fluid ounce pear vodka ADVERTISEMENT",
            "4 fluid ounces cranberry juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ice cubes into a rocks glass. Pour in vodka and cranberry juice. Stir and serve.\n",
        "picture_link": "si..4X1gcpYxAFMDdC4ZWS1EbB2oqFq"
    },
    {
        "title": "Granny's Challah Stuffing",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (1 pound) loaf challah bread, sliced ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a skillet, and cook and stir the chopped onion until translucent, about 10 minutes. Set the onion aside to cool.\nPreheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch glass baking dish.\nFill a bowl with warm water, and soak the challah, one slice at a time. Gently squeeze out the excess water, and place the challah in a large bowl. Mix in the cooked onion, carrots, and celery, and gently mix in the eggs. Season with salt and pepper.\nSpread stuffing in the prepared baking dish, cover with aluminum foil and bake in the preheated oven until cooked through and set, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Granny's Veggie Spread",
        "ingredients": [
            "1 (.25 ounce) envelope unflavored gelatin ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "1 (16 ounce) jar mayonnaise ADVERTISEMENT",
            "1 cucumber, peeled and finely chopped ADVERTISEMENT",
            "1 green bell pepper, seeded and finely chopped ADVERTISEMENT",
            "1 tomato - peeled, seeded and finely chopped ADVERTISEMENT",
            "1 carrot, finely chopped ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle the gelatin over the cold water in a bowl; let stand until softened, about 1 minute. Stir in the mayonnaise until smooth. Stir in the cucumber, green bell pepper, tomato, carrot, and onion. Cover and chill in the refrigerator for 1 hour before serving.\n",
        "picture_link": "IoEO1n3DT8OHUwpy4UNSZbwHfR/OstS"
    },
    {
        "title": "Speedy Raspberry Dressing",
        "ingredients": [
            "1/2 cup fresh raspberries ADVERTISEMENT",
            "1 cup extra virgin olive oil ADVERTISEMENT",
            "2 tablespoons balsamic vinegar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the raspberries, olive oil, and balsamic vinegar in a blender. Cover, and blend until smooth, about 1 minute. Refrigerate until ready to use. Stir or shake before using.\n",
        "picture_link": "Wd7nxrtXWY6DY1pWxIkZ4B0sfNm4o1O"
    },
    {
        "title": "Drunken Roasted Salsa",
        "ingredients": [
            "1/2 green bell pepper ADVERTISEMENT",
            "1/2 red bell pepper ADVERTISEMENT",
            "2 fresh jalapeno peppers ADVERTISEMENT",
            "2 serrano peppers ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3/4 large white onion, cut into large chunks ADVERTISEMENT",
            "1/2 large fresh tomato, chopped ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1/4 cup cilantro leaves ADVERTISEMENT",
            "1 (12 ounce) can canned diced tomatoes with their juice ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 fluid ounces Mexican beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to broil. Line a baking sheet with foil.\nHalve the green bell pepper, red bell pepper, jalapeno peppers, and serrano peppers lengthwise and discard stems and seeds. Place on baking sheet and brush the peppers with olive oil. Roast peppers under the broiler until the skin blackens and blisters, 3 to 5 minutes. Place peppers in a bowl and cover with plastic wrap; allow the peppers to steam until the skins loosen, about 10 minutes. Peel skin off the peppers and discard.\nCombine the green bell pepper, red bell pepper, jalapenos, serrano, onion, tomato, garlic, cilantro, diced tomato with juice, lime juice, salt, black pepper, and beer in a blender. Blend to desired consistency. Transfer to a bowl and allow to cool in the refrigerator for 30 minutes before serving.\n",
        "picture_link": ".4jHiQbEIEpd/tJFQqbqGVnqt6ydpFS"
    },
    {
        "title": "Calamari and Rice",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "6 squid, cleaned and cut into 1/2 inch rings ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 1/2 cups converted long-grain white rice ADVERTISEMENT",
            "3 1/3 cups water ADVERTISEMENT",
            "2 1/2 teaspoons canned tomato paste ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Add the garlic; cook and stir until fragrant, about 1 minute. Add the squid and continue to cook and stir until toasted. Pour in the white wine, stirring to release any bits of food from the bottom of the pan. Simmer for about 10 minutes over medium heat to reduce the liquid.\nAdd the rice, water and tomato paste to the saucepan and bring to a boil. Reduce heat to low, cover and simmer for about 20 minutes, until rice is tender and the water has been absorbed, adding water if needed. Remove from the heat and season with salt and pepper before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Red, White and Blue Potato Salad",
        "ingredients": [
            "1 pound medium purple potatoes, scrubbed ADVERTISEMENT",
            "2 bunches red radishes, trimmed and diced ADVERTISEMENT",
            "1/2 white onion, diced ADVERTISEMENT",
            "1/2 cup crumbled blue cheese ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil; add potatoes and cook until tender, about 15 minutes. Drain, cool and dice the potatoes.\nCombine the potatoes, radishes, onion, blue cheese and mayonnaise in a large bowl; mix until the mayonnaise evenly coats the ingredients.\n",
        "picture_link": "PL2P0cih8BmHTsUN8Kg02aNWsaIZt8e"
    },
    {
        "title": "Carl's Wing Sauce",
        "ingredients": [
            "6 finely crushed gingersnaps ADVERTISEMENT",
            "1 tablespoon apple cider vinegar ADVERTISEMENT",
            "2 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 cups hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the crushed gingersnaps, vinegar, mustard, honey, and hot sauce in a bowl until smooth.\n",
        "picture_link": "5ALtXHCCl4WQepgAivJScww.LkU8iaq"
    },
    {
        "title": "Grilled Chicken and Artichoke Soup",
        "ingredients": [
            "1 ounce dried porcini mushrooms ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "1/2 cup sun-dried tomatoes (not packed in oil), snipped into small pieces ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "2 cloves cloves garlic, minced ADVERTISEMENT",
            "1 red onion, minced ADVERTISEMENT",
            "2 (13.75 ounce) cans artichoke bottoms, drained and chopped ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the dried mushrooms into the boiling water and set aside until softened, about 20 minutes. Once softened, squeeze excess water from mushrooms and finely chop. Reserve the mushroom-flavored water.\nPreheat an outdoor grill for medium-high heat and lightly oil grate.\nSeason chicken breasts with salt and pepper. Grill chicken breasts until no longer pink in the center, about 6 minutes per side. Once cooked, set aside.\nPour chicken broth into a large pot, and bring to a boil over high heat. Stir in sun-dried tomatoes, tomato paste, and reserved mushroom liquid. Reduce heat to medium-low, and simmer for 15 minutes.\nMeanwhile, heat the olive oil in a large skillet over medium heat. Stir in garlic and onion, and cook until the onion has softened and turned translucent, about 5 minutes. Stir in the chopped mushrooms, artichokes, pepper, parsley, lemon juice, and white wine. Bring to a boil over high heat, then reduce heat and simmer 10 minutes; add to the simmering chicken broth.\nSlice the grilled chicken breasts into strips and stir into the simmering soup. Sprinkle with Parmesan cheese before serving.\n",
        "picture_link": "KoXXD6IQowQFFu4fRSf6JChMow74pVy"
    },
    {
        "title": "Tropical Ice Cream",
        "ingredients": [
            "2 cups heavy cream ADVERTISEMENT",
            "1 1/3 cups 2% low-fat milk ADVERTISEMENT",
            "2/3 cup pineapple and orange juice blend ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1/3 cup flaked sweetened coconut ADVERTISEMENT",
            "1/3 cup walnut pieces ADVERTISEMENT",
            "1 large banana, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together cream, milk, pineapple-orange juice, and sugar until the sugar has dissolved. Pour into an ice cream maker and freeze according to manufacturer's instructions.\nFive minutes before the ice cream is done, add the coconut and walnut pieces. Two minutes before the ice cream is done, add the sliced banana.\n",
        "picture_link": "ylsku5Zclf95FwQrhCA0oTw3BL16.xu"
    },
    {
        "title": "Basil Mushrooms in Cream Sauce",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "6 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "3 tablespoons rum ADVERTISEMENT",
            "2 tablespoons cooking sherry ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 1/4 cups sour cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter with the olive oil in a skillet over medium heat. Cook the mushrooms and basil in the mixture until the mushrooms are warm. Pour the rum and sherry over the mushrooms and continue to cook until the mushrooms soften. Stir in the lemon juice, sour cream, and Parmesan cheese; simmer until heated through. Season with salt to serve.\n",
        "picture_link": "kOvU1CkaJ/oaieko7QHINvMaUjouEhe"
    },
    {
        "title": "Pete's Tailgate Turkey Marinade",
        "ingredients": [
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon crab boil seasoning ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 cup beer ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons Creole seasoning ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the container of a blender, combine the Worcestershire sauce, crab boil, orange juice, honey, olive oil, beer, salt, Creole seasoning, and garlic. Cover and puree until smooth. Make sure there are no large pieces of garlic to clog the syringe. Store in a sealed container or plastic bag overnight in the refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "S'mores Cookies",
        "ingredients": [
            "1 (18 ounce) package refrigerated sugar cookie dough ADVERTISEMENT",
            "1 cup marshmallow creme ADVERTISEMENT",
            "1 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "4 graham crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet.\nPlace cookie dough slices about 1 1/2 inch apart on prepared baking sheet.\nBake in preheated oven until cookies are light gold, about 15 minutes. Remove from oven and cool on a rack.\nWhen the cookies are cool, spread tops with marshmallow creme. Sprinkle evenly with chocolate chips and graham cracker crumbs.\n",
        "picture_link": "63c83u9jcfPZbXeVUsDMKZZEI0DbOqO"
    },
    {
        "title": "Special Spuds",
        "ingredients": [
            "2 pounds potatoes, cubed ADVERTISEMENT",
            "2 tablespoons dried minced onion ADVERTISEMENT",
            "2 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1/4 teaspoon fresh-ground black pepper ADVERTISEMENT",
            "2 1/2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace the potatoes, minced onion, parsley, garlic powder, seasoned salt, pepper, and olive oil in a large bowl; toss together until potatoes are evenly coated. Spread potatoes in an even layer on a baking sheet lined with aluminum foil.\nBake for 20 minutes in the preheated oven; flip the potatoes and continue to bake until tender, 20 to 25 minutes.\n",
        "picture_link": "PG/9Kkf1Ld2tE8IXAgynb4Z4/pVF8p2"
    },
    {
        "title": "Eggnog Pie with Rum",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 1/2 (.25 ounce) packages unflavored gelatin ADVERTISEMENT",
            "1/4 cup dark rum ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 1/3 cups scalded milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "3/4 cup heavy cream, chilled ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 cup heavy cream, chilled ADVERTISEMENT",
            "3 tablespoons confectioners' sugar ADVERTISEMENT",
            "2 tablespoons rum, or to taste (optional) ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch ground nutmeg, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle gelatin over 1/4 cup dark rum to soften for about 10 minutes.\nBeat egg yolks and sugar with an electric mixer until the egg mixture falls like ribbon off the beaters, 3 to 5 minutes. Continue mixing on medium-high speed, and pour in scalded milk in a thin stream, mixing constantly.\nTransfer mixture into a saucepan. Cook over medium-low heat, stirring constantly, until the custard coats a spoon, about 20 minutes. Do not allow to boil. Take the pan off the heat, and transfer to a bowl. Stir in softened gelatin mixture and vanilla, stirring until gelatin is completely melted. Chill custard over a bowl of ice until room temperature. Stir occasionally; do not let the custard set up.\nBeat egg whites with a pinch of salt until stiff but not dry; set aside. Whip 3/4 cup heavy cream until medium-stiff peaks form. Gently fold whipped cream into the whipped egg whites. Fold in custard. Spread filling into prepared pie crust. Chill for 45 minutes in the refrigerator, or until filling is set.\nCombine 1 cup chilled whipping cream, confectioner's sugar, 2 to 3 tablespoons rum, nutmeg, and cinnamon. Whip until soft peaks form. Spread over the top of the chilled pie, mounding in an attractive fashion. Dust the top of the pie with additional nutmeg.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Great Start Crab Dip/Spread",
        "ingredients": [
            "1 cup fat free sour cream ADVERTISEMENT",
            "1 cup lowfat cream cheese ADVERTISEMENT",
            "2 teaspoons lemon pepper ADVERTISEMENT",
            "1 1/2 teaspoons ground white pepper ADVERTISEMENT",
            "4 drops hot pepper sauce ADVERTISEMENT",
            "2 (6 ounce) cans crab meat, drained ADVERTISEMENT",
            "1 cup fat free Catalina salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium sized bowl mix the sour cream, cream cheese, lemon pepper, white pepper (optional), hot sauce, and two cans flaked, undrained crabmeat.\nAdd to taste (approximately 1 cup) your choice of nonfat salad dressing (Catalina, French or Russian) to make the dip a pinkish color. Mix well. Let the dip chill for 4 to 8 hours. This dip is especially tasty the next day!\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Honey Drops",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon ground mace ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease baking sheets.\nIn a medium bowl, cream butter and sugar until light and fluffy. Gradually blend in the egg yolk, orange zest, and honey. Sift together the flour, baking powder, salt, and mace; stir into the creamed mixture.\nDrop cookie dough by teaspoonfuls about 2 inches apart onto the prepared cookie sheet. Flatten cookies with a fork dipped in flour. Brush lightly with egg white. Bake for 10 to 14 minutes in the preheated oven. Cool on wire racks after removing from oven.\n",
        "picture_link": "DsaStNXrY/PAaPlCDyNk1/jIhIGqXpu"
    },
    {
        "title": "Scallops a la Peking House",
        "ingredients": [
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "4 tablespoons peanut oil ADVERTISEMENT",
            "2 green onions, minced ADVERTISEMENT",
            "1 1/2 pounds scallops ADVERTISEMENT",
            "1 cup clam juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/3 (8 ounce) can sliced water chestnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve cornstarch in 1/4 cup dry white wine. Set aside.\nIn a large skillet, heat peanut oil on medium-high heat until almost smoking. Remove the skillet from heat and add green onions. Return the skillet to heat and cook, stirring constantly, until the scallions are soft.\nAdd the scallops to the skillet. Cook the scallops for 1 minute, stirring constantly.\nAdd clam juice or broth to the skillet. Continue stirring. Add salt and red pepper or hot sauce to taste. Stir in ginger and water chestnuts.\nStir in the mixture of dissolved cornstarch and white wine. Turn the heat to high, and cook the mixture until it boils and thickens.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Black Bottom Pie I",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 3/4 cups milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 1/3 cups semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup rum ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve gelatin in cold water, and set aside.\nIn a small saucepan, mix cornstarch, 3/4 cup sugar, milk, and egg yolks. Cook, stirring, until bubbly and thick. Remove from heat, and add vanilla. Divide mixture in half. Add chocolate chips to one half, and stir until melted and smooth. Pour into pastry shell. Chill.\nStir gelatin mixture into the other half of the hot egg yolk mixture. Stir in rum. Chill until slightly thick.\nBeat egg whites until soft peaks form. Gradually add remaining 1/2 cup sugar, and beat to stiff peaks. Fold into partially set gelatin/rum mixture. Chill until mix will mound, then spoon into pie shell on top of chocolate layer. Chill overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ziti With Olives and Sun-Dried Tomatoes",
        "ingredients": [
            "1 (16 ounce) package ziti pasta ADVERTISEMENT",
            "1/3 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "1/3 cup black Greek olives, pitted and sliced ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 anchovy fillets, diced ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in a large pot of boiling salted water until al dente.\nMeanwhile, place sun-dried tomatoes, olives, parsley, olive oil, anchovy fillets, and garlic in a large serving bowl.\nDrain pasta. Transfer to serving bowl, and toss with the sauce. Serve.\n",
        "picture_link": "SwKluCeXknoW1MX7KpV/O53KXWEjUXu"
    },
    {
        "title": "Crispy Golden Macaroons",
        "ingredients": [
            "2/3 cup low-fat sweetened condensed milk ADVERTISEMENT",
            "1 cup cornflakes cereal ADVERTISEMENT",
            "1 cup crisp rice cereal ADVERTISEMENT",
            "3/4 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F ( 190 degrees C ). Lightly grease a cookie sheet.\nIn a medium bowl, stir together the flaked corn cereal, crisp rice cereal, and the flaked coconut. Stir in the sweetened condensed milk until thoroughly combined.\nDrop dough from a tablespoon onto the prepared cookie sheet. Cookies should be about 2 inches apart. Bake for 8 to 10 minutes, until golden brown. Cool on the cookie sheet for 1 minute before removing to wire racks to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Marmalade Chews",
        "ingredients": [
            "1/3 cup shortening ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/4 cup orange marmalade ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream the shortening with the brown sugar and white sugar. Beat in the egg and vanilla. Sift together the flour, baking powder, baking soda, salt, cinnamon, ginger and nutmeg; stir into the creamed mixture. Then stir in the rolled oats, marmalade and raisins.\nDrop by rounded teaspoonfuls onto the prepared cookie sheets. Bake for 10 to 12 minutes in the preheated oven. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Golden Bread Shrimp Roll",
        "ingredients": [
            "10 shelled and deveined shrimp ADVERTISEMENT",
            "5 slices white bread, cut in half ADVERTISEMENT",
            "1/2 onion, thinly sliced ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "6 leaves lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium size bowl combine the shrimp, onion, curry powder, and salt and pepper. Marinate for 30 minutes.\nLay the flattened the white bread on a level surface. Place one marinated shrimp and some onion onto the bread. Roll the bread so that the shrimp and onion are held in the middle of the bread with the tail sticking out of one end. Seal the edges of the roll closed with the beaten egg. Continue this process with each shrimp.\nPour enough vegetable oil in a large skillet to cover the shrimp rolls. Heat the oil over a medium heat. Oil is ready for frying when bubbles begin to rise. Place a few shrimp rolls in the oil at a time. Fry until the bread turns a golden brown color. Drain on a paper towel and serve on a plate of lettuce.\n",
        "picture_link": "N4Bwwyo.elEfxzqm2mHQfXgTslOIpfa"
    },
    {
        "title": "Norwegian Pfeffernerse",
        "ingredients": [
            "1 pound unsalted butter ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "3 teaspoons bakers' ammonia ADVERTISEMENT",
            "1 cup finely chopped almonds ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream the butter and sugar. Stir in the powdered ammonia and chopped almonds. Knead in the flour. Roll dough into 1 inch balls and freeze for 1 hour.\npreheat oven to 300 degrees F (150 degrees C). Take cookies out of the freezer and bake for 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cracker Pie I",
        "ingredients": [
            "12 soda crackers ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "12 dates, pitted and chopped ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease one 9 inch pie pan.\nCrush crackers into fine crumbs and set aside.\nBeat the egg whites until stiff peaks form. Gradually beat in the white sugar. Fold in the cracker crumbs. Then gently fold in the chopped dates and chopped nuts. Stir in almond extract. Spread mixture into the prepared pie pan.\nBake at 325 degrees F (165 degrees C) for 20 minutes. Turn off oven heat and let pie stand in oven for 10 minutes. When ready to serve top with whipped cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sylvia's Shrimp Supper",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "3/4 cup thinly sliced red onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3/4 cup thinly sliced celery ADVERTISEMENT",
            "1/2 cup thinly sliced carrots ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "3 tablespoons chopped fresh oregano ADVERTISEMENT",
            "2 (4 ounce) cans small shrimp, drained ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan melt margarine over medium heat. Add onion, garlic, celery, and carrot. Stir and cook over medium heat until onion is slightly translucent (carrot and celery will remain crunchy).\nStir in milk and bring mixture to a gentle boil.\nRemove one cup milk from the mixture. Stir flour into the one cup of milk, continue stirring until the flour has dissolved and there are no lumps. Return the milk and flour mixture to the saucepan. Stir in the parsley, oregano, and salt and pepper to taste. Cook until mixture thickens. Stir in the shrimp and heat through.\n",
        "picture_link": "b0nUJ9tpaDTxHqjMfUkeW9UlMyfi5/i"
    },
    {
        "title": "Pasta Salad with Tuna and Broccoli",
        "ingredients": [
            "1 head broccoli, separated into florets ADVERTISEMENT",
            "1 pound penne pasta ADVERTISEMENT",
            "1 pound fresh tuna steaks ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "4 medium tomatoes, quartered ADVERTISEMENT",
            "1 pound mozzarella cheese, diced ADVERTISEMENT",
            "8 large black olives, sliced ADVERTISEMENT",
            "1/2 cup walnut pieces, toasted ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "4 anchovy fillets, rinsed ADVERTISEMENT",
            "3/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put a large pot of salted water on to boil; use this water to blanch the broccoli and cook the pasta. Blanch broccoli in boiling water. When it is al dente, transfer broccoli to a bowl of ice water. Drain thoroughly.\nCook penne in salted, boiling water until al dente. Drain. Rinse under cold running water until completely cooled, and then drain completely.\nMeanwhile, place tuna in a skillet with water, white wine, and lemon juice. Cover, and cook until done. Break fish into chunks.\nCombine broccoli, penne, fish, tomatoes, cheese, olives, walnuts, garlic, and parsley in a large serving bowl.\nHeat olive oil in small pan over low heat. Cut anchovy fillets into small pieces, add to the olive oil, and mash with a fork until they dissolve. Do not let oil get too hot. Pour oil-anchovy mixture over salad. Toss, and serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pfefferneuse (Peppernuts)",
        "ingredients": [
            "1 cup dark corn syrup ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "7 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ground allspice ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the margarine and sugar. Add corn syrup, egg and honey; mix well. Sift together the flour, salt, cinnamon, allspice, cloves, and baking soda; stir into the sugar mixture alternately with the buttermilk. Knead dough, which should be very stiff, by hand for 15 to 30 minutes. Divide dough into 2 pieces, flatten slightly, wrap in plastic, and refrigerate 3 hours or overnight.\nPreheat oven to 350 degrees F ( 175 degrees C ). Roll out dough to 1/4 inch thickness and cut into 1 inch squares. Place on an unprepared cookie sheet and bake for 15 to 25 minutes in the preheated oven, or until dry inside.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Soft Molasses Cookies IV",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup unsulfured molasses ADVERTISEMENT",
            "4 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon instant coffee granules ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "4 tablespoons raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a couple of cookie sheets.\nIn a large bowl, cream together the sugar and lard. Gradually mix in the egg, and molasses. Sift together the flour, baking soda, ginger, dry mustard, instant coffee, and cloves; stir this into the creamed mixture alternately with the milk.\nDrop cookie dough by heaping teaspoonfuls onto the prepared cookie sheets. Press a raisin or maraschino cherry into the center of each one. Bake for 15 minutes in the preheated oven. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "d7yWpvkfaKW9PJ8XNc9g6XW4p.oEV7."
    },
    {
        "title": "Steak and Kidney Pie I",
        "ingredients": [
            "1 pound beef tenderloin ADVERTISEMENT",
            "1 pound beef kidney ADVERTISEMENT",
            "1 cup all-purpose flour for rolling ADVERTISEMENT",
            "4 cups water to cover ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 to taste salt and pepper to taste ADVERTISEMENT",
            "1 (17.5 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut meat into 1 inch cubes, and roll in seasoned flour. Place meat in a saucepan, and add enough water to cover. Cook until meat is tender, about 3 hours. Remove the meat, leaving the liquid in the pan.\nThicken gravy with 1 tablespoon flour, and season with salt and pepper to taste. Return meat to the pan. Spoon into a pie dish. Allow to cool.\nTake a small portion of the pastry, and roll into 1 inch wide strips. Moisten the edges of the pie dish, and press pastry around the rim. Roll out the rest of the pastry to size of the dish. Moisten the strip pastry, and cover with pastry.\nBake at 450 degrees F (230 degrees C) for 15 to 20 minutes, or until nicely browned.\n",
        "picture_link": "wfaNjKmEUH.Xjyktucj/nefEXeqwoOm"
    },
    {
        "title": "Cipate Pie",
        "ingredients": [
            "2 pounds boneless chicken ADVERTISEMENT",
            "2 pounds flank steak ADVERTISEMENT",
            "2 pounds pork tenderloin ADVERTISEMENT",
            "1/4 pound salt pork, sliced ADVERTISEMENT",
            "4 onions, chopped ADVERTISEMENT",
            "1/4 pound sliced ham ADVERTISEMENT",
            "2 cups peeled and cubed potatoes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut chicken, beef, and pork into 1 inch cubes, and place in a large bowl. Stir in onions. Cover, and refrigerate overnight.\nArrange salt pork evenly in the bottom of a 3 quart casserole dish with a cover. Layer with 1/3 of the meat mixture and 1/3 of the potatoes; season with salt and pepper. Roll out half of the pastry a little bit thicker than for a normal pie and arrange on the potato layer, cutting a small hole in the middle. Repeat with 2 more layers of meat and potatoes seasoned with salt and pepper. Cover with remaining pastry, and cut a small hole in the middle of that layer too. Slowly add enough chicken stock through the hole until liquid appears. Cover dish.\nBake at 400 degrees F (205 degrees C) for 45 minutes, or until liquid simmers. Reduce temperature to 250 degrees F (120 degrees C). Bake for 5 to 6 hours more, or until top crust is a rich golden brown.\n",
        "picture_link": "GTL.VStdMMdCHls26yRuMU4X96voMwW"
    },
    {
        "title": "Moka Fudge Pie",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "1 teaspoon instant coffee granules ADVERTISEMENT",
            "1 tablespoon boiling water ADVERTISEMENT",
            "8 ounces semisweet chocolate ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "1 tablespoon whipping cream ADVERTISEMENT",
            "1/4 cup butter, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve coffee in boiling water.\nMelt chocolate in a bowl over hot water. Blend in coffee solution. Stir in egg yolks, cream, and butter. Mix until smooth. Spoon mixture into baked pie shell, and chill before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Three-Bean Vegetarian Chili",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 onion, cut into small dice ADVERTISEMENT",
            "1 red bell pepper, cut into small dice ADVERTISEMENT",
            "1 green bell pepper, cut into small dice ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1/2 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "1 (15.5 ounce) can black beans ADVERTISEMENT",
            "1 (15.5 ounce) can kidney beans ADVERTISEMENT",
            "1 (15.5 ounce) can chickpeas ADVERTISEMENT",
            "Sour cream, shredded Cheddar cheese, fresh cilantro leaves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a heavy 6-quart pot over medium heat. Cook onion, bell peppers, jalapeno, garlic, and salt, stirring occasionally, until tender, about 10 minutes. Stir in chili powder, cumin, oregano, tomato paste, tomatoes, and water and simmer over medium-low heat, stirring occasionally, until thickened, about 20 minutes.\nDrain beans, reserving liquid, and rinse under cold water. Add beans and 3/4 cup reserved liquid to chili and simmer, stirring occasionally, until heated through, 5 to 7 minutes.\nTop each serving with sour cream, cheese, and cilantro (if using).\n",
        "picture_link": "HI4aoEriHC0qykQlb3dzYxzd6A4uahO"
    },
    {
        "title": "Egg Curry",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 teaspoon garlic paste ADVERTISEMENT",
            "1/2 teaspoon ginger paste ADVERTISEMENT",
            "1 tablespoon ground coriander ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon chile powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup tomato puree ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "4 hard-boiled eggs, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Add onion; cook and stir until browned, about 5 minutes. Stir in garlic and ginger paste. Mix in coriander, cumin, turmeric, chile powder, and black pepper; cook until fragrant, about 1 minute. Add tomato puree; cook until curry thickens, about 4 minutes.\nPour water into the pot; bring sauce to a boil. Stir in vinegar and salt. Slip eggs into the pot; cook until flavors combine, about 5 minutes.\n",
        "picture_link": "lPHUIuNHpm/4phSCiVg49xoUPnKhbly"
    },
    {
        "title": "Barbie's Blueberry Zucchini Bread with Oatmeal and Walnuts",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/4 cups vegetable oil ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 cups shredded zucchini ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup old-fashioned oats ADVERTISEMENT",
            "1/2 cup unsweetened shredded coconut ADVERTISEMENT",
            "1 pint fresh blueberries ADVERTISEMENT",
            "1/2 cup walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 2 standard loaf pans or 4 mini loaf pans with cooking spray.\nBeat sugar, oil, eggs, and vanilla extract in a large bowl until smooth. Fold in zucchini.\nSift flour, cinnamon, salt, and baking soda together in another bowl. Stir in oats and coconut. Add flour mixture to zucchini mixture; mix slowly until combined. Fold blueberries and walnuts into the batter.\nDivide batter among prepared loaf pans.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 50 minutes. Cool for 20 minutes before serving.\n",
        "picture_link": "EZH5WJ79p3RL1E0bqWq6HBLR.YyRr3q"
    },
    {
        "title": "Easy Asian Cole Slaw",
        "ingredients": [
            "1 (2 pound) Savoy cabbage ADVERTISEMENT",
            "1/2 small red onion, thinly sliced ADVERTISEMENT",
            "1 carrot, grated ADVERTISEMENT",
            "1 red bell pepper, cut into thin strips ADVERTISEMENT",
            "4 green onions, thinly sliced ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup low-sodium soy sauce ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove and discard any coarse outer cabbage leaves. Peel off large leaves just until they are difficult to remove. Cut out and discard thick veins and stems. Stack leaves and thinly slice crosswise. Quarter remaining whole cabbage. Cut out and discard core, and thinly slice quarters crosswise.\nTransfer cabbage to a large bowl with red onion, carrot, pepper, green onions, and parsley. Sprinkle with salt and toss.\nWhisk together vinegar, oil, soy sauce, and honey in a small bowl. Drizzle over cabbage mixture and toss. Press mixture down and chill, covered, 1 to 2 hours. Season with more salt, if needed.\n",
        "picture_link": "d3e9JAKpV70DIvevGqMm4yW72TBHrcG"
    },
    {
        "title": "Honey-Ginger Kale Salad",
        "ingredients": [
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1 1/2 tablespoons fresh orange juice ADVERTISEMENT",
            "1 1/2 teaspoons low-sodium soy sauce ADVERTISEMENT",
            "1 1/2 teaspoons honey ADVERTISEMENT",
            "1 1/2 teaspoons grated fresh ginger ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 (10 ounce) bunches lacinato kale, stems removed, leaves thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together vinegar, juice, soy sauce, honey, and ginger in a small bowl. Add oil slowly, whisking constantly until incorporated.\nPut kale in a large bowl. Drizzle with dressing, and mix well. Using your hands, massage kale until softened, wilted, and reduced in volume by about half.\n",
        "picture_link": "wfxASekBk8pplHe3TD7Y..rXVHaE.wu"
    },
    {
        "title": "Turkey and Quinoa Meatballs",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 cups chopped celery ADVERTISEMENT",
            "1/2 large onion, chopped ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 1/3 cups tomato ketchup ADVERTISEMENT",
            "1/3 cup balsamic vinegar ADVERTISEMENT",
            "1/3 cup low-sodium soy sauce ADVERTISEMENT",
            "1 1/2 pounds ground turkey ADVERTISEMENT",
            "1 1/2 cups cooked quinoa ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nHeat oil in a large skillet over medium heat. Add celery, onion, and garlic; cook, stirring occasionally, until softened but not browned, 5 to 7 minutes. Remove from heat.\nMix ketchup, balsamic vinegar, and soy sauce together in a small bowl.\nCombine turkey, quinoa, eggs, parsley, sage, black pepper, and salt in a large bowl. Add celery mixture and 1/3 cup of the ketchup mixture; mix until well-combined.\nSpread 1/3 cup of the ketchup mixture on the bottom of two 9-inch square baking dishes. Form turkey mixture into meatballs with damp hands. Pour remaining 1/3 cup of the ketchup mixture over the meatballs.\nBake in the preheated oven until meatballs are no longer pink in the center and ketchup mixture is thickened, 15 to 20 minutes.\n",
        "picture_link": "Jw99H7M57VV3K2MYFAuM1JsJGglOKD."
    },
    {
        "title": "Clean Banana Oat Cookies",
        "ingredients": [
            "2 bananas, mashed ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup oats ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nMix mashed bananas, milk, egg, honey, and vanilla extract together in a bowl. Stir in oats, cinnamon, baking powder, and salt.\nSpoon batter into mounds on the baking sheet, spacing them a few inches apart.\nBake in the preheated oven until top looks dry and edges are golden, about 15 minutes.\n",
        "picture_link": "ry6BgEUQ3k/YSNCsgxMG/voCNFjwyMy"
    },
    {
        "title": "Hot Wing Stroganoff",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "5 skinless, boneless chicken breasts, thinly sliced ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup hot pepper sauce (such as Frank's® RedHot) ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons heavy whipping cream, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium heat. Add chicken breasts; cook until no longer pink, 2 to 3 minutes per side. Stir in mayonnaise, milk, hot pepper sauce, mustard, and ranch dressing mix. Bring to a simmer; cook, stirring occasionally, until flavors combine, 10 to 15 minutes.\nStir sour cream and Parmesan cheese into the saucepan; bring to a simmer. Stir in heavy cream until sauce thickens to the consistency of gravy. Remove from heat; let stand before serving, about 5 minutes.\n",
        "picture_link": "leeJQka9KNLv2RetA2K4tBISTPyKp9q"
    },
    {
        "title": "Authentic Swedish Pancakes",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon butter, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs in a bowl with an electric mixer until thick and lemon-colored, 3 to 5 minutes. Stir in milk.\nSift flour, sugar, and salt together in a bowl. Add to egg mixture; mix until batter is smooth.\nGrease a griddle with butter; heat over medium heat. Drop tablespoonfuls of batter on the griddle; spread to make thin pancakes. Cook until light brown on bottom, 1 to 2 minutes. Flip and continue cooking until second side is light brown, 1 to 2 minutes more. Repeat with remaining batter.\n",
        "picture_link": "842pTegYJgbTxUJl2DXldXAcKod2v5O"
    },
    {
        "title": "3-Ingredient-Tastes-Just-Like-Sangria",
        "ingredients": [
            "6 ice cubes ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 cup ginger ale ADVERTISEMENT",
            "1/2 lime, cut into 4 wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 3 ice cubes in each cocktail glass. Divide red wine and ginger ale between the glasses. Squeeze juice from 1 lime wedge into each glass; add rind. Add second lime wedge. Stir and serve.\n",
        "picture_link": "RBvJmm.W77cRflhi.i8NBHRE0SG5lXK"
    },
    {
        "title": "Cheesy Spinach Ramen Frittata",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "2 (5 ounce) packages fresh baby spinach ADVERTISEMENT",
            "3 tablespoons water, divided ADVERTISEMENT",
            "2 (3 ounce) packages ramen noodles (flavor packets discarded) ADVERTISEMENT",
            "7 large eggs ADVERTISEMENT",
            "3/4 cup garlic-and-herb spreadable cheese (such as Alouette®) ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nHeat oil in a 10-inch ovenproof skillet (with lid) over medium heat. Cook green onions, stirring occasionally, until softened, about 2 minutes. Add 1 package spinach and 2 tablespoons water and cook, covered, until wilted, about 1 minute. Stir spinach with tongs, then add remaining package spinach and remaining tablespoon water. Cook, covered, stirring once or twice, until tender, about 2 minutes. Remove skillet from heat.\nMeanwhile, bring a saucepan of salted water to a boil. Break each ramen noodle block into 4 pieces and cook, stirring occasionally, until just tender, about 3 minutes. Drain noodles in a colander and rinse under cold water. Toss noodles with spinach mixture in skillet and spread mixture evenly over bottom of pan.\nBlend eggs, spreadable cheese, and salt in a blender until smooth. Pour egg mixture evenly over spinach mixture. Stir spinach mixture gently with a fork to allow egg mixture to flow underneath. Sprinkle top with Parmesan cheese.\nTransfer skillet to oven and bake until puffed slightly and a toothpick inserted in center comes out clean, about 35 minutes. Cut into 4 wedges and serve from skillet.\n",
        "picture_link": "XJJGRPuuJAkgOd4Oc6qHxh4nc6c/XMq"
    },
    {
        "title": "Spicy Garden Slaw",
        "ingredients": [
            "1 (14 ounce) package coleslaw mix ADVERTISEMENT",
            "1 cup very thinly sliced Archer Farms™ Sugar Snap Peas ADVERTISEMENT",
            "1/2 cup thinly sliced radishes ADVERTISEMENT",
            "3 green onions, thinly sliced ADVERTISEMENT",
            "3/4 cup Market Pantry™ Cashews Halves and Pieces ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1 tablespoon sriracha sauce ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss salad ingredients in large bowl. Whisk dressing ingredients in small bowl. Stir into salad. Serve immediately or refrigerate until ready to serve.\n",
        "picture_link": "DVaTeE4S7gGGpOzLi50nQVL2nJzKnfC"
    },
    {
        "title": "Barilla® Super Green Pasta",
        "ingredients": [
            "1 (6.3 ounce) jar Barilla® Traditional Basil Pesto ADVERTISEMENT",
            "1 (16 ounce) package Barilla® Farfalle ADVERTISEMENT",
            "1 ripe avocado, halved, pitted and peeled ADVERTISEMENT",
            "5 cups assorted baby greens such as baby kale, arugula, or spinach ADVERTISEMENT",
            "Fresh basil leaves, torn (optional) ADVERTISEMENT",
            "Shaved Parmesan cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the bowl of a food processor add the Traditional Basil Pesto and avocado; mix to combine; set aside.\nIn a large pot bring 4 to 6 quarts of water to a rolling boil; add salt to taste and the Farfalle; stir gently.\nCook pasta according to package directions; remove from heat and drain well, reserving 1/2 cup pasta cooking water.\nReturn pasta to pot; stir in the baby greens and Traditional Basil Pesto mixture; add pasta water as needed to reach desired consistency.\nServe topped with fresh basil leaves and Parmesan, if desired.\n",
        "picture_link": "5iASkdGArDHlIsJlfIKsZLu418M35ES"
    },
    {
        "title": "Low-Carb Cream of Broccoli Soup",
        "ingredients": [
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon minced onion flakes ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "1 (10 ounce) can chicken chunks, or more to taste ADVERTISEMENT",
            "3 heads broccoli, broken into florets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, cream cheese, Cheddar cheese, butter, and onion flakes in a large pot over medium heat; cook and stir until smooth, 3 to 5 minutes. Add heavy cream and chicken; bring to a gentle simmer.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add broccoli, cover, and steam until tender, 4 to 5 minutes. Transfer to a colander to drain excess moisture.\nPour chicken broth mixture into a slow cooker; add broccoli.\nCook on Low until flavors combine, about 4 hours.\n",
        "picture_link": "b04MyCTReGHqVq5keUankR9mcsMJ8xC"
    },
    {
        "title": "Cauliflower Mac-N-Cheese",
        "ingredients": [
            "1 1/2 cups elbow macaroni ADVERTISEMENT",
            "1/2 cup cauliflower florets ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 minutes. Drain.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, 5 to 6 minutes. Place cauliflower in a blender or food processor; blend until smooth.\nCoat a large saucepan with non-stick cooking spray; place over medium heat. Add oil and flour; cook, stirring constantly, until a thick paste forms, 1 to 2 minutes. Add milk; cook and stir until mixture thickens, 3 to 4 minutes.\nMix cauliflower, Cheddar cheese, cream cheese, salt, and pepper into milk mixture; stir until sauce is smooth. Fold macaroni into sauce.\n",
        "picture_link": "MYY8ukYGCdKpsJkUrLLjdpWKB2BhMpG"
    },
    {
        "title": "Teriyaki Pork Chops",
        "ingredients": [
            "3/4 cup teriyaki sauce ADVERTISEMENT",
            "2 1/4 teaspoons garlic salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "3 pork chops ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine teriyaki sauce, garlic salt, and black pepper in a bowl.\nPlace pork chops on a deep plate. Pour 3/4 of the teriyaki mixture on top. Flip pork chops to coat second side. Let marinate in the refrigerator, about 30 minutes.\nHeat oil in large skillet over medium heat; add pork chops, discarding marinade. Cover and cook until pork chops are browned, about 15 minutes. Flip and continue cooking until pork chops are cooked through, about 10 minutes. Uncover and pour in remaining 1/4 of the teriyaki mixture. Cover and simmer until flavors combine, about 5 minutes.\n",
        "picture_link": "NmGCru7bqF2ZfHtK/YuW8BSRFVQltEW"
    },
    {
        "title": "Blueberry Vinaigrette Dressing",
        "ingredients": [
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oil, blueberries, white vinegar, balsamic vinegar, and honey together in a food processor; blend until smooth.\n",
        "picture_link": "wcU8F1sABFMJW.8I/X7dYkPkJS8dy8O"
    },
    {
        "title": "Polynesian Chicken Fafa",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 1/2 cups uncooked long grain white rice ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into 1 inch pieces ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1/3 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, deep skillet over medium-high heat, melt the butter. Stir in the onion and garlic, and cook 2 minutes. Mix in the coconut milk, water, rice, and chicken, and bring to a boil. Reduce heat to low, cover, and simmer 20 minutes, until rice is tender and chicken juices run clear.\nStir the spinach into the skillet, and cook just until heated through. Sprinkle with coconut, and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tangy Chicken II",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon onion salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 whole chicken, cut up ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\nIn a saucepan over low heat, mix the butter, lemon juice, cider vinegar, garlic salt, onion salt, and pepper. Cook and stir until butter is melted.\nArrange chicken pieces in the prepared baking dish. Pour the butter mixture over the chicken.\nBake 20 minutes in the preheated oven. Turn chicken pieces, and continue baking 30 minutes, or until chicken juices run clear.\n",
        "picture_link": "NgNahqou/lbMzlKMT6/vNeTERgxvs4G"
    },
    {
        "title": "Roasted Barbecued Turkey Legs",
        "ingredients": [
            "4 smoked turkey legs ADVERTISEMENT",
            "4 cups hot water ADVERTISEMENT",
            "2 teaspoons chicken bouillon granules ADVERTISEMENT",
            "2 cups barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the turkey legs into a 4 quart pressure cooker over medium-high heat. Pour in just enough water to cover them. Sprinkle chicken bouillon granules over the water, and stir to dissolve a little. Place the lid on the cooker, and bring up to full pressure. Cook for about 5 minutes.\nWhile the turkey is cooking, preheat your oven's broiler. After the time is up on the turkey, remove from the heat. Run cold water over the top of the cooker to help release the pressure, and open the lid. Place the turkey legs on a broiling pan or roasting pan.\nBroil the turkey legs for 10 to 15 minutes, until the skin is brown and crispy. Brush the legs with barbeque sauce towards the end of cooking. Serve with remaining sauce on the side.\n",
        "picture_link": "wGBCWQ8cpmMii/2bZkhNNjorqC/GCOW"
    },
    {
        "title": "Portuguese Toast",
        "ingredients": [
            "2 (6 inch) French sandwich rolls, or Portuguese pops ADVERTISEMENT",
            "3 tablespoons butter, room temperature ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium heat. Split the rolls in half lengthwise, and spread butter on the insides of the bread, reserving any leftover butter.\nPlace the rolls butter side down in the pan, and place a saucer or plate on top of the rolls to act as a press. Apply just a little pressure so the bread is not flattened. Cook until golden. Pay attention, they can cook very fast. Spread any remaining butter onto the rolls as soon as they are done.\n",
        "picture_link": "Waei3bnI8iCjLqDxBEgSrt2I8mVrAiq"
    },
    {
        "title": "Creamed Pearl Onions with Peanuts",
        "ingredients": [
            "1/4 cup butter, divided ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 dash paprika ADVERTISEMENT",
            "1 dash ground black pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "4 cups pearl onions ADVERTISEMENT",
            "1/2 cup coarsely chopped dry roasted peanuts ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a saucepan over medium heat, melt 2 tablespoons butter, and stir in the flour, salt, paprika, and pepper until smooth. Gradually blend the milk into the saucepan until thickened. Place the onions and nuts in a medium casserole dish. Pour the sauce over the onions and nuts, and toss to coat.\nIn a separate saucepan, melt the remaining butter, and toss with the bread crumbs to coat. Sprinkle over the casserole.\nBake 20 minutes in the preheated oven, until bubbly and lightly browned.\n",
        "picture_link": "IXruy4oYdpdtkmeqhZciaOrz2qpKan."
    },
    {
        "title": "Mussels Vinaigrette",
        "ingredients": [
            "24 fresh mussels, scrubbed and debearded ADVERTISEMENT",
            "1 small green bell pepper, seeded and diced ADVERTISEMENT",
            "1 small red bell pepper, seeded and diced ADVERTISEMENT",
            "1 small yellow bell peppers, seeded and diced ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 hard-cooked egg, chopped ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring one inch of water to a boil in a large pot. Add mussels, cover, and steam for 3 to 5 minutes, until they are all open. Drain. Remove one side of each shell, and arrange the open shelled mussels on a serving platter. Discard any mussels that do not open.\nIn a medium bowl, mix together the red, yellow, and green bell peppers, olive oil, wine vinegar, parsley, egg, salt, and pepper. Spoon over the mussels on the shells. Refrigerate until serving.\n",
        "picture_link": "pUVVPVD80RUoY0mHjXGf4t3T4b26e5S"
    },
    {
        "title": "Marinated Salmon 'Smoothly'",
        "ingredients": [
            "6 lemons, juiced ADVERTISEMENT",
            "1 1/2 cups soy sauce ADVERTISEMENT",
            "1 1/2 cups white wine ADVERTISEMENT",
            "4 teaspoons prepared mustard ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 (4 ounce) fillets salmon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the lemon juice, soy sauce, white wine, mustard, and honey. Season with salt and pepper.\nPlace each salmon fillet on a large piece of aluminum foil. Fold the foil around the salmon on all sides, forming a basket shape. Pour equal amounts of the marinade mixture over each salmon fillet. Tightly seal the foil packets. Allow salmon fillets to marinate at least 1 hour in the refrigerator.\nPreheat the grill for high heat.\nPlace foil packets on the grill, and cook 10 to 15 minutes, until salmon is easily flaked with a fork.\n",
        "picture_link": "8vW9JRriuN4mfMUm8/nujtfOcKi.F6m"
    },
    {
        "title": "Spicy Asian Cellophane Noodle Salad",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 large onion, sliced ADVERTISEMENT",
            "1 large zucchini, julienned ADVERTISEMENT",
            "1 (14 ounce) package tofu, drained and cubed ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "7 Thai chiles, chopped ADVERTISEMENT",
            "3 tablespoons fish sauce ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "2/3 teaspoon sugar ADVERTISEMENT",
            "1/3 teaspoon salt ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "8 ounces cellophane noodles ADVERTISEMENT",
            "1/2 head lettuce, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan with enough cold water to cover, and bring a boil. Remove from heat, cover, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel, and chop.\nHeat the oil in a skillet over medium heat, and cook the onion and zucchini until tender. Mix in the tofu, and continue to cook and stir until browned on all sides.\nWith a mortar and pestle, grind the garlic and Thai chiles into a fine paste. Mix with the fish sauce, lime juice, sugar, and salt.\nBring 1 quart water to boil in a pot. Turn off heat, and soak the cellophane noodles in the hot water 1 minute, or until soft.\nIn a large bowl, toss together the eggs, tofu mixture, garlic and chile paste, noodles, and lettuce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dilly Cream Cheese in Pastry",
        "ingredients": [
            "1 (10 ounce) can refrigerated crescent roll dough ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 tablespoon prepared horseradish, or to taste ADVERTISEMENT",
            "1 teaspoon dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet.\nOn a lightly floured surface, unroll the crescent roll dough into a rectangle, and press all of the seams together to make a single sheet. Spread horseradish over the top of the block of cream cheese, then sprinkle with enough dried dill to cover. Place the block of cream cheese dill side down in the center of the sheet of dough. Sprinkle the other side with enough dill to cover. Wrap the dough around the cheese like a present, and seal any openings. Place on the prepared baking sheet.\nBake for about 20 minutes in the preheated oven, or until the pastry is golden brown. Serve warm.\n",
        "picture_link": "oBDF/Fzkbsl4G36qB7uFISmBFWo0tsO"
    },
    {
        "title": "Squambo",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "2 cups brown rice ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3/4 cup finely chopped carrots ADVERTISEMENT",
            "1 cup chopped red bell pepper ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "2 cups chopped fresh tomato ADVERTISEMENT",
            "3 cups beef stock ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 3 cups of water to a boil in a large saucepan. Stir in 2 cups of rice. Cover, reduce heat, and simmer for 45 minutes or until rice is tender.\nHeat oil in another large saucepan over medium-high heat. Fry the onion and garlic until onions are translucent. Stir in the carrots, red and green peppers, and basil; cook for about 5 more minutes. Add the tomato, beef stock and allspice. Mix together the cornstarch and 1/4 cup water; pour into the saucepan. Season with salt to taste. Cover, reduce heat to low, and simmer for 20 minutes.\nServe the stew over rice, and sprinkle Cheddar cheese over the top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simple Chopped Liver",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pound chicken livers, rinsed and trimmed ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel and chop once cold.\nMeanwhile, heat the canola oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and golden brown, 5 to 10 minutes more. Place onion on a plate and set aside. Stir chicken livers into the same skillet. Cook until no longer pink in the center and the juices run clear. Place chicken livers on the same plate as the onions and allow to cool completely.\nPlace chicken livers and onion in a food processor. Process until desired texture is achieved. Place liver mixture into a bowl and season with salt and sugar. Stir in the chopped eggs. Chill before serving.\n",
        "picture_link": "NG74ciTa56hikmhSd8BsgE1z9LZeZkW"
    },
    {
        "title": "Delicious O.J. Punch",
        "ingredients": [
            "1 (12 fluid ounce) can frozen orange juice concentrate, thawed ADVERTISEMENT",
            "1 1/2 cups bourbon whiskey ADVERTISEMENT",
            "1 (2 liter) bottle chilled lemon-lime soda ADVERTISEMENT",
            "1 tray ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a punch bowl or other large container, combine the orange juice concentrate, whiskey and lemon-lime soda. Stir until mixed, then throw in some ice before serving.\n",
        "picture_link": "qWMguUjJ990BCK8izVdu3YPwdowhhsq"
    },
    {
        "title": "Robin's Spicy Ribs",
        "ingredients": [
            "2 pounds pork spareribs, cut into serving size pieces ADVERTISEMENT",
            "2 lemons, juiced ADVERTISEMENT",
            "1 (16 ounce) jar picante sauce ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons prepared mustard ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 fresh jalapeno peppers, chopped ADVERTISEMENT",
            "1 cup chopped red onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "2 tablespoons crushed red pepper flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ribs in large pot with enough water to cover, and bring to a boil. Stir in the lemon juice. Cook the ribs 1 hour, until meat is tender. Drain, and place in large resealable plastic bags.\nIn a medium saucepan over medium heat, mix the picante sauce, brown sugar, barbeque sauce, garlic, mustard, Worcestershire sauce, jalapeno peppers, and onion. Season with salt and pepper. Bring to a boil, reduce heat to low, and simmer 30 minutes, stirring occasionally, until thickened. Pour over the ribs in the plastic bags. Seal bags, and marinate ribs 8 hours, or overnight, in the refrigerator.\nPreheat the grill for high heat.\nLightly oil the grill grate. Place ribs on the grill, and discard remaining marinade. Season ribs with red pepper flakes, and cook 10 to 20 minutes, turning once, until browned and crisp.\n",
        "picture_link": "NEnb.97Bo7uUAN20BZDHfacAGn6ByIi"
    },
    {
        "title": "Tom's Crunchy Salad",
        "ingredients": [
            "2 red bell pepper, seeded and diced ADVERTISEMENT",
            "2 green bell peppers, seeded and diced ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "1 cup bean sprouts ADVERTISEMENT",
            "1/2 white onion, diced (optional) ADVERTISEMENT",
            "1/2 cup Italian salad dressing, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a serving bowl, toss together the red bell pepper, green bell pepper, tomatoes, celery, bean sprouts and onion. Stir in the Italian dressing just before serving. This salad can also be stored in a resealable bag in the refrigerator until you are ready to serve it.\n",
        "picture_link": "nnRVU4FXrK023PClQ7uzPkoOX3HMf3y"
    },
    {
        "title": "Silverbeet Salad",
        "ingredients": [
            "1 cup uncooked rotini ADVERTISEMENT",
            "1/2 bunch Swiss chard (silverbeet), stems removed and thinly sliced ADVERTISEMENT",
            "1 red bell pepper, seeded and chopped ADVERTISEMENT",
            "1/4 cup vinaigrette salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of water to a boil. Add the rotini pasta, and cook for 8 minutes, or until tender. Drain, and rinse under cold water to cool.\nIn a medium bowl, toss together the rotini, Swiss chard, and bell pepper. Pour in dressing sparingly until you reach your desired amount.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cold Melon Salsa",
        "ingredients": [
            "3 tomatoes, seeded and finely diced ADVERTISEMENT",
            "1/2 honeydew melon, peeled and finely diced ADVERTISEMENT",
            "1 cantaloupe, peeled and finely diced ADVERTISEMENT",
            "1 cup minced red onion ADVERTISEMENT",
            "1/2 jalapeno pepper, minced ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "3 tablespoons fresh orange juice ADVERTISEMENT",
            "1/2 cup finely chopped almonds ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large serving bowl, stir together the tomatoes, honeydew melon, cantaloupe, red onion, jalapeno and cilantro. Stir in the orange juice, almonds, salt and lime juice. Refrigerate for at least 4 hours before serving for best flavor.\n",
        "picture_link": "a8i0pZIThB9BsuvT6s.gaX6Bbu8haNq"
    },
    {
        "title": "Kickin' Portobello Dressing",
        "ingredients": [
            "1 (1 pound) loaf French bread, cubed ADVERTISEMENT",
            "1 (8 ounce) loaf Italian bread, cubed ADVERTISEMENT",
            "1 pound sliced bacon, diced ADVERTISEMENT",
            "3 sweet onions, chopped ADVERTISEMENT",
            "2 1/4 cups chicken stock ADVERTISEMENT",
            "12 ounces portobello mushroom caps, chopped ADVERTISEMENT",
            "4 stalks celery with leaves, chopped ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "2 teaspoons dried sage ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 cup butter, melted (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 250 degrees F (120 degrees C). Spread the bread cubes out in a single layer on rimmed baking sheets. Toast in the oven for 20 minutes, or until dry. Cool, and transfer to a large bowl.\nFry the bacon pieces in a large skillet over medium heat until crisp. Remove from the pan to drain on paper towels. Add onions to the pan with the bacon grease: cook and stir over medium heat until starting to turn deep brown, about 15 minutes.\nPour in 1/4 cup of the chicken stock, stirring to remove any bits that are stuck to the bottom of the skillet. Add the celery and mushrooms and season with sage, rosemary, salt and pepper. Drizzle this over the bread cubes, and toss to coat.\nPour the rest of the chicken broth over the bread and add the bacon, cranberries, raisins and golden raisins. The stuffing can be made up to this point up to 3 days in advance.\nPreheat the oven to 350 degrees F (175 degrees C). Whisk the salt and pepper in with the eggs and stir into the bread cubes. Transfer to a disposable roasting pan, or a large baking dish. Drizzle melted butter over the top and cover with aluminum foil. If stuffing a turkey, mix in the eggs and melted butter; stuff in to the cavity right before roasting.\nBake for 30 minutes in the preheated oven, then remove the aluminum foil and continue to bake for an additional 10 to 15 minutes, until the top is browned.\n",
        "picture_link": "2ZoU7D1JO9pFbrDieY6MHwz25Gh9Zt6"
    },
    {
        "title": "LavaTini",
        "ingredients": [
            "1 fluid ounce raspberry flavored liqueur ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "4 fluid ounces currant or raspberry flavored vodka ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shot glass, stir together the raspberry liqueur and honey. Pour vodka into a shaker with the ice, and shake until cold and frothy. Strain into a martini glass and spoon in the honey mixture.\n",
        "picture_link": "YasyEWkOw3RFpL3J3/XvtKmrALgNni2"
    },
    {
        "title": "Bub Bub's Hearty Mush",
        "ingredients": [
            "2 cups uncooked long grain white rice ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 (16 ounce) package kielbasa sausage, sliced ADVERTISEMENT",
            "1 tablespoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 (29 ounce) cans mixed vegetables, drained ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium pot, bring the rice and water to a boil. Reduce heat to low, cover, and simmer 25 minutes.\nCut the kielbasa slices in half, and place in a large skillet over medium heat. Cook 5 minutes, until heated through, and season with cayenne pepper, garlic salt, seasoned salt, salt, and pepper. Mix in the vegetables and butter. Cover, and continue cooking about 10 minutes. Serve over the cooked rice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ed's Secret Pea and Mushroom Salad",
        "ingredients": [
            "2 (15 ounce) cans peas, drained ADVERTISEMENT",
            "1 (6 ounce) jar mushroom pieces, drained ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce (e.g. Tabasco™), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a serving bowl, stir together the drained peas and mushrooms. Season to taste with hot pepper sauce.\n",
        "picture_link": "eAchhaZsgyyOi0nk.vo20YtuvnrYNcy"
    },
    {
        "title": "Chinese Braised Zucchini",
        "ingredients": [
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 small yellow onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon Chinese black bean sauce ADVERTISEMENT",
            "2 Thai chile peppers, seeded and chopped ADVERTISEMENT",
            "4 zucchinis, cut into 1/2-inch slices ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the sesame oil in a wok or large skillet over medium-high heat. Stir fry the onion and garlic in the hot oil until the onion begins to soften, about 2 minutes. Stir in the black bean sauce and chile peppers, and continue stir frying about 30 seconds to coat the onions with the black bean sauce.\nStir in the zucchini, ginger, soy sauce, and water. Cover, reduce the heat to medium-low, and cook for 15 minutes until the zucchini is soft, stirring occasionally.\n",
        "picture_link": "6vfrHAEjJz5dEyAAK5YkLJMgQKGujTq"
    },
    {
        "title": "Pawpaw (Papaya) And Mango Punch",
        "ingredients": [
            "1 cup sliced mango ADVERTISEMENT",
            "1 cup diced, peeled papaya ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1/4 cup white sugar, or to taste ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the mango and papaya into a blender. Cover, and puree until smooth; add the orange juice, lime juice, sugar, orange zest, and water. Blend well. Serve over crushed ice.\n",
        "picture_link": "maKHwQuF9Nl3Hu1MJ84rGCoNnvE8MW2"
    },
    {
        "title": "Prissy's Garlic Bread",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 loaves Italian bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whip the butter, olive oil, celery salt, poultry seasoning, cumin, onion powder, and garlic powder together until light and fluffy. Cover; refrigerate at least 4 hours. Allow the mixture to return to room temperature before using.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nOpen the loaves of Italian bread with your fingers (do not use a knife) by pulling edges and ripping the bread into two equal portions (top and bottom). Spread the garlic butter evenly over the torn sides of the bread and place buttered-side-up onto a baking sheet.\nBroil in the preheated oven until golden brown and crunchy on top, 4 to 5 minutes. Serve hot.\n",
        "picture_link": "eVDb8UClk8xqU4eGq2H3cwMcVRjC5eK"
    },
    {
        "title": "Cheese-Filled Green Plantains",
        "ingredients": [
            "5 whole green plantains, unpeeled ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 cups queso fresco, cut into 1/2 inch cubes ADVERTISEMENT",
            "4 cups vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the whole plantains with enough water to cover to a boil; reduce heat to medium-low, cover, and simmer until the plantains are tender and the skins have cracked, about 45 minutes. Drain and set aside until cool enough to handle.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nPeel the plantains and mash with the salt and pepper until no lumps remain. Roll the mashed plantain into 3 tablespoon size balls around a cube of cheese. Cook the plantain balls in the hot oil in batches until they are golden brown and float to the surface, about 5 minutes. Move the plantain balls around as they cook to ensure they brown evenly. Drain the cooked plantain balls on a paper towel-lined plate to cool slightly.\n",
        "picture_link": "LJ1cO9WVilUyr3T9SqFXDNFjgcXskeq"
    },
    {
        "title": "Fancy Pimento Cheese",
        "ingredients": [
            "20 ounces sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup minced fresh chives ADVERTISEMENT",
            "1/2 cup minced roasted red pepper ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1/4 cup dill pickle juice ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon hot pepper sauce (such as Cholula®) ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using the smallest holes of a box grater, grate half the Cheddar cheese. Grate the remaining Cheddar cheese on the next larger size holes.\nStir together the Cheddar cheese, chives, roasted red pepper, cream cheese, pickle juice, mayonnaise, hot pepper sauce, and black pepper in a bowl until evenly combined.\n",
        "picture_link": "BYWJphWftIhO.ORWsGW5xusyzfrW3hC"
    },
    {
        "title": "Puffing Crab",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "1 cup hot milk ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "1/2 cup mayonnaise (such as Hellman's®) ADVERTISEMENT",
            "1 pound fresh crabmeat ADVERTISEMENT",
            "salt and pepper, to taste ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon Old Bay® seasoning (optional) ADVERTISEMENT",
            "3 egg whites, stiffly beaten ADVERTISEMENT",
            "1 dash paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Butter a 1-1/2 quart baking dish.\nMelt butter in a saucepan over medium heat. Gradually whisk in flour and cook about 5 minutes (reduce heat if mixture begins to brown). Slowly whisk in the hot milk and heat until mixture reaches a low boil, stirring constantly. Remove from heat and allow to cool at least 5 minutes (otherwise eggs will cook when added to the mixture).\nStir the beaten egg yolks into the cooled sauce. Blend in the mayonnaise. Add the crabmeat and season with salt, pepper, cayenne, and Old Bay(R) seasoning if using. Gently fold in the beaten egg whites. Pour into prepared baking dish. Dust with paprika.\nBake until browned and puffy, about 20 minutes. Serve immediately.\n",
        "picture_link": "oqv/bU6SpIBBNP0EV6RkRDFyt15.Gou"
    },
    {
        "title": "German Plum Rolls (Zwetschgenschnecken)",
        "ingredients": [
            "1 cup chopped almonds ADVERTISEMENT",
            "1 1/3 cups cream cheese ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "5/8 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup baking powder ADVERTISEMENT",
            "7/8 cup plum butter ADVERTISEMENT",
            "1 3/4 pounds plums, pitted and diced ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 10-inch springform pan.\nPlace a skillet over medium-high heat. Toast the almonds in the hot skillet until they turn brown; set aside to cool.\nCombine the cream cheese, milk, oil, salt, sugar, and cinnamon in a bowl. Mix in the flour and baking powder; knead together until smooth. Place the dough on a lightly floured surface, and roll the dough into a 20-inch square. Spread the plum butter, plums, and toasted almonds over the dough. Roll the dough up tightly like a jelly roll. Cut into 12 even slices. Arrange rolls in prepared pan. Brush butter over top of the rolls.\nBake in preheated oven until golden brown, 40 to 55 minutes.\n",
        "picture_link": "of4zwcJ4UJBYJspUi7c3Ksp6NxSdieC"
    },
    {
        "title": "Dead Bones (L'Ossa Morte)",
        "ingredients": [
            "1 pound confectioners' sugar ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "2 1/2 teaspoons ground cloves ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the sugar, flour, baking powder, and cloves. Make a well in the sugar mixture, and pour the eggs into the well. Work the eggs into the mixture, first with a fork, then with your hands, until you have a smooth dough.\nLine a baking sheet with foil. Roll dough into 1 inch balls and place on the prepared baking sheet, 2 inches apart. Flatten each cookie with the bottom of a glass. Cover with a clean dish towel and let rest overnight. Cookies will spread.\nPreheat an oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until golden, about 15 minutes. Remove cookies from pan immediately as they come out of the oven or they will stick. Cool completely on a wire rack.\n",
        "picture_link": "cV96N.U2INjwU8aQnkWGM/qZq2U2f9q"
    },
    {
        "title": "Fireball Mushrooms",
        "ingredients": [
            "1/4 cup margarine ADVERTISEMENT",
            "1/2 bunch celery, diced ADVERTISEMENT",
            "3 large onions, diced ADVERTISEMENT",
            "1 1/2 tablespoons minced garlic ADVERTISEMENT",
            "2 (6.5 ounce) cans chopped clams, drained ADVERTISEMENT",
            "1/2 pound salad shrimp, chopped ADVERTISEMENT",
            "2 teaspoons chicken bouillon granules ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon white pepper ADVERTISEMENT",
            "2 cups croutons ADVERTISEMENT",
            "1/4 cup seasoned bread crumbs ADVERTISEMENT",
            "1/2 pound cooked lump crabmeat ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "16 large fresh white mushrooms, cleaned and stems removed ADVERTISEMENT",
            "1 cup shredded Italian blend cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/4 cup margarine in a large skillet, and cook and stir the celery, onion, and garlic over medium heat for about 5 minutes, until onion is translucent. Stir in the chopped clams and salad shrimp, and cook and stir about 3 more minutes, until the mixture is hot. Drain most of the liquid from the skillet, leaving about 1 tablespoon.\nSprinkle in the chicken bouillon granules, cayenne pepper, and white pepper, and stir. Gently stir in the croutons, bread crumbs, and crab meat.\nPreheat an oven to 400 degrees F (200 degrees C).\nMelt 1/4 cup of margarine in the bottom of a 9x13 inch baking dish, and pour in the white wine. Mound about 1/3 cup of filling into each mushroom cap, and place them into the baking dish. Sprinkle the Italian blend cheese over the mushroom caps.\nBake in the preheated oven for about 20 minutes, until the cheese is bubbling and starting to brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy, Low-Sugar Pear Butter",
        "ingredients": [
            "4 pounds pears, quartered and cores removed ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup granular sucrolose sweetener (such as Splenda®) ADVERTISEMENT",
            "2 teaspoons grated orange zest ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 (.25 ounce) envelope unflavored gelatin powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pears into a large pot, and fill with enough water to cover. Bring to a boil, then cook over medium heat until fruit is soft, about 30 minutes. Drain and transfer the pears to a blender. Puree the pears and return them to the pot.\nStir the sugar, sweetener, orange zest, nutmeg and orange juice into the pot and bring to a boil. Cook, stirring frequently until slightly thickened, about 15 minutes. Remove from the heat and stir in the gelatin until completely dissolved. Ladle into hot sterile jars and seal with lids and rings, or fill freezer containers and freeze if you prefer.\n",
        "picture_link": "VIk.HV51QO.z6yzAnMkcgRpLMaz4b6G"
    },
    {
        "title": "Mom's Irish Ziti",
        "ingredients": [
            "3 cups rigatoni ADVERTISEMENT",
            "1/2 pound bulk sweet Italian sausage ADVERTISEMENT",
            "1/2 pound ground lamb ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "4 1/2 cups tomato sauce ADVERTISEMENT",
            "1/2 pound provolone cheese, sliced ADVERTISEMENT",
            "2 teaspoons Italian seasoning ADVERTISEMENT",
            "1 pinch crushed red pepper, or to taste ADVERTISEMENT",
            "1/2 pound mozzarella cheese, sliced ADVERTISEMENT",
            "1/2 cup grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Prepare a 1 1/2-quart baking dish with cooking spray.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the rigatoni and return to a boil. Stirring occasionally, boil until the pasta cooked is still firm to the bite, about 13 minutes. Drain well in a colander set in the sink; pour into the prepared baking dish.\nPlace a skillet over medium heat; crumble the sausage and lamb into the hot skillet. Breaking the meat into small pieces with a wooden spoon, cook and stir the mixture until completely browned, 7 to 10 minutes. Stir in the garlic and cook another 2 to 3 minutes. Drain the fat from the skillet.\nPour about half of the tomato sauce over the pasta, then layer with the provolone slices and the meat mixture. Season with the Italian seasoning and crushed red pepper; top with the mozzarella cheese and the remaining tomato sauce. Sprinkle the Parmigiano-Reggiano cheese over the top of the dish.\nBake in the preheated oven until hot and bubbly, 25 to 35 minutes.\n",
        "picture_link": "scTd5.qdJ41SD3Luye/akVe6ViLI0Oe"
    },
    {
        "title": "Vegan Cream 'Cheese' Frosting",
        "ingredients": [
            "1/2 cup vegan cream cheese substitute (such as Tofutti™) ADVERTISEMENT",
            "1/2 cup soy margarine ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup soy flour ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the cream cheese and margarine together with the vanilla extract in a mixing bowl with an electric hand mixer until light. Beat in the soy flour, followed by the confectioners' sugar until light and fluffy. Refrigerate at least 20 minutes before using.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Totenbeinli (Swiss Hazelnut 'Legs')",
        "ingredients": [
            "1/4 cup softened butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 teaspoon grated lemon zest ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "9 ounces hazelnuts, coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nCream together butter and sugar until light and fluffy. Beat in the eggs one at a time, mixing well after each addition, then stir in the orange juice, lemon zest, and cinnamon. Fold in the flour and hazelnuts, mixing just enough to evenly combine. Form into 1/2 inch by 3 inch sticks, and place onto a baking sheet 1 inch apart.\nBake in preheated oven until brown around the edges, about 15 minutes. Cool completely on a wire rack before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shrimp-Stuffed Eggplant Rolls",
        "ingredients": [
            "3 small eggplants ADVERTISEMENT",
            "3/4 cup seasoned bread crumbs ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon minced onion ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 tablespoons garlic flavored olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 1/2 tablespoons minced garlic ADVERTISEMENT",
            "15 peeled and deveined jumbo shrimp ADVERTISEMENT",
            "3/4 pound chopped raw shrimp ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch onion powder ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/2 cup shredded low-fat mozzarella cheese ADVERTISEMENT",
            "1/2 cup seasoned bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nPeel 2 of the eggplants and cut lengthwise into 1/4-inch-thick slices. Dice the remaining eggplant and any scraps; soak the diced eggplant in lightly-salted, cold water. Sprinkle the eggplant slices with salt and set aside as you prepare the remaining ingredients.\nPour 3/4 cup of seasoned breadcrumbs into a bowl; set aside. Stir together the flour, 1/2 teaspoon minced garlic, 1/2 teaspoon minced onion, 1/2 teaspoon garlic powder, 1/2 teaspoon onion powder, and 1/2 teaspoon basil in a bowl; set aside. Beat the egg with 2 tablespoons of water in a separate bowl. Rinse the salt off of the eggplant slices and wipe off excess water. Coat the eggplant slices in the flour mixture, dip into the egg, and press into the bread crumbs. Place the eggplant slices onto the prepared baking sheet.\nBake in the preheated oven until the eggplant slices are golden brown and tender, about 10 minutes. Turn once as they cook to brown both sides; set aside and allow to cool until you can easily handle.\nMeanwhile, heat the olive oil in a large skillet over medium heat. Stir in 1 chopped onion and 1 1/2 tablespoons minced garlic; cook and stir until the onion is soft and translucent, about 5 minutes. Add the whole jumbo shrimp and cook until pink and no longer translucent in the center, about 5 minutes. Remove the shrimp and set aside. Stir the diced shrimp into the skillet and cook until no longer translucent. Season with 1 pinch garlic powder, 1 pinch onion powder, 1 teaspoon basil, red pepper flakes, and the white wine. Drain the water from the diced eggplant and squeeze out the excess water. Stir the eggplant into the shrimp mixture and bring to a boil. Reduce heat to medium, cover, and cook until the eggplant is soft, about 10 minutes; stir in the mozzarella cheese and 1/2 cup of bread crumbs until the cheese has melted.\nTo assemble, place one jumbo shrimp onto the center of each eggplant slice. Spoon about 2 tablespoons of the stuffing over each jumbo shrimp. Fold the ends of the eggplant over the stuffing and secure with toothpicks. Place the eggplant rolls onto the baking sheet.\nBake in the preheated oven until the eggplant rolls are hot in the center, about 5 minutes. Remove the toothpicks before serving.\n",
        "picture_link": "Y88BAoOUVghc8zFlPbM/dhWYttiw6ZS"
    },
    {
        "title": "Garlic Pork Kabobs",
        "ingredients": [
            "1 3/4 cups Swanson® Chicken Stock ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon packed brown sugar ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "2 teaspoons vinegar ADVERTISEMENT",
            "1 pound boneless pork loin, cut into 1-inch cubes ADVERTISEMENT",
            "12 medium mushrooms ADVERTISEMENT",
            "1 large red onion, cut into 12 wedges ADVERTISEMENT",
            "4 cherry tomatoes ADVERTISEMENT",
            "4 cups hot cooked regular long-grain white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the stock, cornstarch, brown sugar, ketchup and vinegar in a 1-quart saucepan until the mixture is smooth. Cook and stir over medium-high heat until the mixture boils and thickens. Remove the saucepan from the heat.\nThread alternately the pork, mushrooms and onion onto 4 skewers.\nLightly oil the grill rack and heat the grill to medium. Grill the kabobs for 20 minutes or until the pork is cooked through, turning and brushing often with the stock mixture. Place 1 tomato onto the end of each skewer.\nHeat the remaining stock mixture over medium heat to a boil. Serve with the kabobs and rice.\n",
        "picture_link": "iTtpZc.Px3V9nytyIHgW7xnt.dJb8li"
    },
    {
        "title": "Jamaican Turkey Sandwich",
        "ingredients": [
            "Pulled Turkey: ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/3 cup chopped green onion ADVERTISEMENT",
            "1 (2 pound) skinless, boneless turkey breast, cut into 8 ounce chunks ADVERTISEMENT",
            "1/2 cup juice from canned pineapple ADVERTISEMENT",
            "1/4 cup sweet chile sauce ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 tablespoon beef bouillon granules ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "6 canned pineapple rings ADVERTISEMENT",
            "Coleslaw Topping: ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cups chopped cabbage ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "6 Kaiser rolls, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle the celery and green onions into the bottom of a slow cooker; place the turkey chunks on top. Combine the pineapple juice, sweet chile sauce, vinegar, water, beef bouillon, and garlic powder; pour over the turkey. Place the pineapple rings on the turkey chunks.\nCook on Low until the turkey pulls apart easily, 6 to 7 hours.\nMeanwhile, make the coleslaw by stirring the mayonnaise, lemon juice, parsley, and onion together in a mixing bowl. Add the cabbage and Cheddar cheese; season to taste with salt and pepper. Cover, and refrigerate while the turkey cooks.\nOnce the turkey is tender, shred using two forks. Pile some of the shredded turkey and a pineapple ring onto a Kaiser roll; top with coleslaw to serve.\n",
        "picture_link": "/rsmWBiCIEgV5vOBw.WLAPNa7SDGBGq"
    }
]