[
    {
        "title": "Vegetarian Beef Shepherd's Pie",
        "ingredients": [
            "4 large potatoes, peeled and cut into large chunks ADVERTISEMENT",
            "4 cloves garlic, peeled ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "2 small onions, chopped ADVERTISEMENT",
            "1 pound vegetarian beef crumbles (such as Boca®) ADVERTISEMENT",
            "1 (10 ounce) can sliced mushrooms, drained (optional) ADVERTISEMENT",
            "1 cup frozen peas ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 (15 ounce) can creamed corn ADVERTISEMENT",
            "1 pinch paprika (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace potato chunks and garlic cloves in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 15 minutes. Drain. Mash using a potato masher. Stir in Cheddar cheese, salt, and pepper until evenly mixed.\nHeat oil in a large skillet over medium heat. Add onions; cook and stir until tender, about 5 minutes. Stir in vegetarian beef crumbles, mushrooms, and peas; cook until heated through, about 5 minutes. Stir in Worcestershire sauce and pepper.\nPour onion and beef crumble mixture into a deep 9-inch casserole. Spread creamed corn on top. Spread mashed potato mixture carefully over the creamed corn. Sprinkle paprika over mashed potatoes.\nBake in the preheated oven until bubbling around the sides and hot in the center, 30 to 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sarah's Vegetarian Shepherd's Pie",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "2 (4 ounce) packages 4-cheese instant mashed potato mix ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 1/2 cups sliced carrots ADVERTISEMENT",
            "1 (14.5 ounce) can petite diced tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained ADVERTISEMENT",
            "1 (15 ounce) can peas, drained ADVERTISEMENT",
            "1 (14.5 ounce) can cut green beans, drained ADVERTISEMENT",
            "1 (11 ounce) can corn niblets, drained ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1 1/2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 (6 ounce) can French-fried onions (such as French's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring water to a boil in a large saucepan. Remove from heat; pour in mashed potato mix. Stir thoroughly with a fork to moisten all potatoes.\nHeat oil in a large skillet over medium-high heat. Cook and stir onion and carrots until onion is translucent and carrots are tender, about 5 minutes. Stir in diced tomatoes, tomato paste, garlic, basil, oregano, salt, and pepper. Add kidney beans, peas, green beans, corn niblets, and mushrooms; stir until heated through, about 5 minutes.\nPour tomato-bean mixture into a 9x13-inch casserole dish. Sprinkle Cheddar cheese evenly on top. Spread mashed potatoes carefully over cheese until completely covered.\nBake in the preheated oven until bubbling on the sides, about 30 minutes. Sprinkle French-fried onions on top. Continue baking until top is golden brown, about 10 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gigot D'Agneau au Four (Roast Lamb with Beans)",
        "ingredients": [
            "1 (3 pound) leg of lamb ADVERTISEMENT",
            "6 cloves garlic, peeled ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 (14 ounce) cans cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace leg of lamb in a large baking dish. Prick in 6 places with a sharp knife; insert garlic cloves into the slits. Brush butter over lamb. Season with salt and pepper.\nRoast in the preheated oven, basting regularly with juices, for 25 minutes. Arrange cannellini beans around the lamb, mixing to coat with juices. Continue roasting until beans are warmed through and the internal temperature of the lamb reaches 160 degrees F (71 degrees C) for medium, about 15 minutes more.\nLet lamb rest for 10 minutes before slicing. Garnish with chopped parsley and serve beans on the side.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peach Cosmos",
        "ingredients": [
            "ice cubes ADVERTISEMENT",
            "2 fluid ounces peach-flavored vodka ADVERTISEMENT",
            "1 fluid ounce cranberry juice ADVERTISEMENT",
            "1/2 fluid ounce orange liqueur, such as Triple Sec ADVERTISEMENT",
            "1 wedge fresh lime ADVERTISEMENT",
            "1 twist lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice. Add peach vodka, cranberry juice, orange liqueur, and a squeeze of lime juice. Cover and shake vigorously until completely chilled, about 1 minute.\nStrain into a chilled wine glass. Garnish with lemon twist.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Canard a l'Orange Super Facile (Super Easy Duck a l'Orange)",
        "ingredients": [
            "6 duck legs ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "2 oranges, zested and juiced ADVERTISEMENT",
            "7 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season duck legs with salt and pepper.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Add duck legs; cook until skin starts to brown, about 4 minutes per side. Transfer to a large plate.\nHeat remaining 1 tablespoon olive oil in the same skillet over medium heat. Add onion; cook and stir until tender, about 5 minutes. Stir in cornstarch until dissolved. Return duck legs to the skillet. Pour in orange juice and water. Simmer, covered, until duck legs are very tender, about 40 minutes.\nUncover skillet and simmer until sauce thickens, about 10 minutes. Pour sauce into a bowl and stir in zest of 1 orange.\nPlace duck legs on serving plates. Spoon sauce on top. Garnish with remaining orange zest.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Prosciutto-Wrapped Chicken with Figs and Goat Cheese",
        "ingredients": [
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "2 shallots, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "3/4 cup soft goat cheese ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese ADVERTISEMENT",
            "6 figs, chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "12 large, thin slices prosciutto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spread 1 tablespoon olive oil on a baking sheet.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir shallots until translucent, about 3 minutes. Stir garlic, thyme, salt, and pepper into shallots; cook and stir until fragrant, about 2 minutes. Transfer shallot mixture to a bowl; stir in goat cheese, mozzarella cheese, cream cheese, figs, and basil until well combined.\nPound each chicken breast on a work surface until thin. Spoon about 1/4 cup goat cheese mixture onto the middle of each piece of chicken. Roll chicken around the filling and wrap 2 pieces prosciutto around each chicken roll, covering the opening with 1 layer of prosciutto. Place chicken rolls onto the prepared baking sheet, seam-side down.\nBake in the preheated oven for 20 minutes; turn chicken and continue baking until chicken is no longer pink in the center and prosciutto is crisp, about 20 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Let chicken stand for 5 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blueberry Lychee Goodness ",
        "ingredients": [
            "Simple Syrup: ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (11 ounce) can lychees, drained and rinsed ADVERTISEMENT",
            "10 fresh blueberries ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "1/3 cup blueberry vodka (such as Stoli®) ADVERTISEMENT",
            "1/4 cup fresh sweet and sour mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a small saucepan. Stir in sugar until it dissolves into a syrup. Remove from heat; let cool completely, about 15 minutes.\nPour lychees into a blender; puree until smooth.\nCombine 1/4 cup lychee puree and blueberries in a cocktail shaker; mash with a cocktail muddler. Add 1/4 cup syrup, ice, blueberry vodka, and sweet and sour mix. Cover and shake until the outside of the shaker has frosted. Strain into two cocktail glasses.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lychee Muffins",
        "ingredients": [
            "1 cup cake flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 (11 ounce) can lychees, drained ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a muffin tin with paper liners.\nMix cake flour and baking powder together in a large bowl.\nStrain lychees into a bowl, reserving canning liquid. Pat lychees dry with a paper towel; cut into small pieces. Add 3/4 of the pieces to the flour mixture; toss lightly.\nWhisk sugar and egg together in a bowl until sugar is dissolved, about 1 minute. Stir in 5 tablespoons of the reserved canning liquid, butter, and vanilla extract. Add flour mixture; stir batter until just moistened.\nSpoon batter into the prepared muffin tin, filling each liner 3/4 full. Scatter remaining lychee pieces on top.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bulldog Margarita",
        "ingredients": [
            "ice ADVERTISEMENT",
            "1 cup tequila ADVERTISEMENT",
            "1 (8 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "1/2 cup triple sec ADVERTISEMENT",
            "2 (12 ounce) bottles Mexican beer (such as Corona®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a blender 3/4 of the way with ice. Pour in tequila, limeade concentrate, and triple sec. Blend until ice breaks down to a slushy consistency.\nPour mixture into a 24-ounce margarita glass. Invert beer bottles into the mixture so that they lean against the rim of the glass.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lychee Butter Cake",
        "ingredients": [
            "3/4 cup unsalted butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs, at room temperature ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "3 1/2 tablespoons lychee syrup (from canned lychees) ADVERTISEMENT",
            "1/2 teaspoon rose water ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup drained and halved canned lychees, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line an 8-inch square pan with parchment paper.\nBeat butter and sugar in a bowl with an electric mixer until pale and fluffy, about 3 minutes. Add whole eggs and egg yolk one at a time, beating well after each addition. Mix in lychee syrup and rose water until thoroughly combined, 2 to 3 minutes.\nWhisk flour, baking powder, and salt together in a bowl. Add half of the flour mixture to the butter mixture. Beat until flour is thoroughly mixed in before adding second half. Beat until batter is smooth, about 30 seconds. Gently fold in half of the lychees.\nPour batter into the prepared pan. Spread remaining lychees evenly on top of the batter.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 40 to 45 minutes. If edges brown too quickly, cover pan with aluminum foil. Place pan on a cooling rack to cool cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apple Bacon Wraps",
        "ingredients": [
            "6 slices bacon, cut in half ADVERTISEMENT",
            "4 (10 inch) flour tortillas ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "8 slices deli ham ADVERTISEMENT",
            "1 Granny Smith apple, cut into thin bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels.\nPlace a tortilla on a work surface and drizzle 1 tablespoon honey down the middle of the tortilla; top with 3 bacon pieces. Layer 2 tablespoons Cheddar cheese over bacon and top with 2 slices ham and 1/4 of the sliced apples. Roll tortilla around filling. Repeat to create 3 more wraps.\n",
        "picture_link": "pKr.QAOPTa4yG0ln3M0v9I7QMwbehQ2"
    },
    {
        "title": "Dirty Chips",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1 (8 ounce) package pepperoncini-flavored kettle-cooked potato chips ADVERTISEMENT",
            "6 ounces cheese curds, chopped ADVERTISEMENT",
            "2 tablespoons chopped pepperoncini peppers ADVERTISEMENT",
            "1/4 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon slices in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on paper towels; chop into smaller pieces.\nPreheat oven to 425 degrees F (220 degrees C).\nArrange potato chips in a single layer on a rimmed baking sheet. Sprinkle bacon and cheese curds evenly on top.\nBake in the preheated oven until cheese curds start to melt and chips start to brown around the edges, about 4 minutes. Top with pepperoncini peppers and black pepper. Let cool. Transfer to a serving bowl.\n",
        "picture_link": "GXIEmD8dJEV0T6Lssonf/ZctEx9xWxG"
    },
    {
        "title": "Grilled Leg of Lamb Steaks",
        "ingredients": [
            "4 bone-in lamb steaks ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "4 large cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lamb steaks in a single layer in a shallow dish. Cover with olive oil, garlic, rosemary, salt, and pepper. Flip steaks to coat both sides. Let sit until steaks absorb flavors, about 30 minutes.\nPreheat an outdoor grill for high heat and lightly oil the grate. Cook steaks until browned on the outside and slightly pink in the center, about 5 minutes per side for medium. An instant-read thermometer inserted into the center should read at least 140 degrees F (60 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Steak Rolls ",
        "ingredients": [
            "1 (24 ounce) package sandwich steaks, thawed ADVERTISEMENT",
            "2 cups Italian seasoned bread crumbs ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 toothpicks ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 (1 ounce) package French onion soup mix ADVERTISEMENT",
            "2 fluid ounces water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound sandwich steaks to even thickness using a meat mallet.\nMix bread crumbs, egg, garlic powder, salt, and pepper together in a bowl. Spread over steaks in an even layer. Roll steaks into tight spirals and secure with toothpicks.\nHeat oil in a large skillet over medium heat. Cook steak rolls until browned, 1 to 2 minutes per side. Sprinkle onion soup mix into the skillet. Fill the empty package with water and pour into the skillet twice. Cover skillet; bring to a boil. Reduce heat to low and simmer, covered, until flavors combine, 45 to 60 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Zesty Stuffed Chicken",
        "ingredients": [
            "1 1/2 pounds cooked cocktail shrimp ADVERTISEMENT",
            "1 (8 ounce) package shredded pepper Jack cheese ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "1 tablespoon Creole seasoning ADVERTISEMENT",
            "6 skin-on, boneless chicken thighs ADVERTISEMENT",
            "6 slices thick-cut bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nMix shrimp, pepper Jack cheese, yellow bell pepper, and green onion together in a bowl. Stir in Creole seasoning.\nPlace chicken thighs skin-side up on a cutting board. Pound with a meat mallet until somewhat flattened. Flip.\nPack an even amount of the shrimp mixture over each chicken thigh. Roll up chicken; wrap tightly with bacon slices. Transfer rolls to a large baking pan.\nBake in the preheated oven until juices run clear from chicken and bacon is crisp, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grandma Edythe's Sour Cream Potato Salad",
        "ingredients": [
            "4 potatoes ADVERTISEMENT",
            "1/2 cup diced dill pickles ADVERTISEMENT",
            "1/4 cup finely chopped green onions ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "3 tablespoons dill pickle juice (optional) ADVERTISEMENT",
            "5 hard-boiled eggs, peeled and chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 25 minutes. Drain. Cool until easily handled, about 10 minutes. Peel and cut into bite-size pieces.\nCombine potatoes, pickles, and chopped onions in a large bowl.\nMix mayonnaise, sour cream, and pickle juice together in a small mixing bowl. Pour over potatoes. Gently toss until potatoes are coated with dressing. Add chopped eggs; gently mix. Season with salt and pepper.\nRefrigerate 8 hours or overnight for best flavor.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blue Cheese and Sour Cream Potato Salad ",
        "ingredients": [
            "5 large potatoes, quartered, or to taste ADVERTISEMENT",
            "4 hard-boiled eggs, diced ADVERTISEMENT",
            "4 green onions, sliced ADVERTISEMENT",
            "1 (12 ounce) container blue cheese dressing (such as Marie's®) ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and let cool, about 15 minutes.\nCut potatoes into chunks; transfer to a large bowl. Stir in hard-boiled eggs and green onions.\nMix blue cheese dressing, sour cream, salt, and pepper together in a bowl. Pour over potato mixture; stir gently until blended. Chill until flavors combine, about 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Oreo® Donuts",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "5 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "4 ounces vegan margarine (such as Earth Balance®) ADVERTISEMENT",
            "4 ounces shortening ADVERTISEMENT",
            "2 tablespoons coconut milk ADVERTISEMENT",
            "1/4 cup crushed chocolate sandwich cookies (such as Oreo®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a doughnut pan with cooking spray.\nMix flour, sugar, cocoa powder, baking soda, and salt together in a bowl. Stir in water, vegetable oil, and vanilla extract until batter is smooth. Pour batter into the doughnut pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 10 to 12 minutes. Invert onto a wire rack and let cool, about 10 minutes.\nCombine confectioners' sugar, vegan margarine, shortening, and coconut milk in a large bowl; beat with an electric mixer until frosting is fluffy and smooth.\nSpread frosting over donuts; sprinkle cookie crumbs on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ultimate Butter Pound Cake",
        "ingredients": [
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons packed light brown sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x5-inch loaf pan with parchment paper, leaving an overhang over 2 sides.\nCombine butter, white sugar, brown sugar, vanilla extract, baking powder, and salt in a large bowl; beat with an electric mixer until fluffy. Beat in flour. Beat in eggs one at a time, scraping the bowl after each addition. Pour batter into a 9x5-inch loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.\nLift cake out of the loaf pan using the overhanging parchment paper. Place on a wire rack and cool completely before slicing, about 30 minutes.\n",
        "picture_link": "xthiKqcGNWc/dKPsiBlGFSh.fG4CDqi"
    },
    {
        "title": "Cookie Dough Cheesecake",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "2 cups finely crushed graham cracker crumbs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup salted butter, melted ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "Cheesecake Filling: ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "Cookie Dough: ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup salted butter, melted ADVERTISEMENT",
            "6 tablespoons packed brown sugar ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3/4 cup mini chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking dish with parchment paper.\nMix graham cracker crumbs, 1/2 cup white sugar, 1/2 cup melted butter, cinnamon, and 1/4 teaspoon salt together in a bowl until well combined and slightly sticky. Transfer mixture to the prepared baking dish and firmly press into the bottom.\nBake in the preheated oven until crust is lightly browned, about 10 minutes. Set aside to cool.\nReduce oven temperature to 325 degrees F (165 degrees C).\nBeat cream cheese and 1 cup white sugar together in a bowl using an electric mixer on medium-low speed until creamy and smooth. Reduce mixer speed to low; add sour cream, lemon juice, and 1 teaspoon vanilla extract. Beat in 3 eggs, 1 at a time, blending well after each addition. Pour cream cheese mixture over crust.\nBake in the oven until edges are set and middle is still slightly soft, 30 to 35 minutes.\nMix 1 cup plus 2 tablespoons flour, baking soda, and 1/2 teaspoon salt together in a bowl. Beat 1/2 cup melted butter, brown sugar, 6 tablespoons white sugar, and 1/2 teaspoon vanilla extract together in a large bowl using an electric mixer until creamy. Beat 1 egg into creamed butter mixture until incorporated; gradually beat into flour mixture until cookie dough is creamy. Fold chocolate chips into cookie dough.\nDot cookie dough onto cheesecake; return to the oven and bake until cookie dough is set, 5 to 10 minutes. Cool cheesecake to room temperature, about 1 hour. Cover and refrigerate until chilled, 3 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cheesecake De Dulce De Leche",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "2 cups crushed digestive biscuits ADVERTISEMENT",
            "1/4 cup finely chopped walnuts ADVERTISEMENT",
            "3 1/2 tablespoons melted butter ADVERTISEMENT",
            "Cheesecake: ADVERTISEMENT",
            "7 ounces double cream ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 (11.5 ounce) jar dulce de leche ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 tablespoons dulce de leche, or as desired ADVERTISEMENT",
            "1 tablespoon chopped walnuts, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch springform pan.\nCombine digestive biscuits, 1/4 cup chopped walnuts, and melted butter in a bowl; mix well. Press biscuit mixture into the bottom of the prepared springform pan using the back of a spoon.\nBake in the preheated oven until crust is set, about 5 minutes. Set aside to cool.\nBeat double cream in a bowl using an electric mixer until soft peaks form. Combine cream cheese and sugar together in a separate bowl until well mixed; add 11.5-ounce jar dulce de leche and eggs, 1 at a time and mixing well after each addition. Avoid over-mixing the cream cheese mixture. Fold double cream mixture into cream cheese mixture until well combined; spoon over the cooled crust.\nBake in the oven for 1 hour 15 minutes. Do not open the oven door while baking. Cool at room temperature for 30 minutes; refrigerate until chilled, at least 3 hours to overnight.\nDecorate cheesecake with 2 tablespoons dulce de leche and 1 tablespoon chopped walnuts.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cold Chicken Pasta Salad",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "1 1/2 tablespoons lemon juice ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 tablespoons grated onion ADVERTISEMENT",
            "1 1/2 teaspoons seasoned salt ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 (8 ounce) package vermicelli pasta, broken into 2-inch pieces ADVERTISEMENT",
            "1 (14 ounce) can plain artichoke hearts, quartered ADVERTISEMENT",
            "1 pint cherry tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, red wine vinegar, lemon juice, sugar, grated onion, seasoned salt, and basil together in a bowl to make dressing. Transfer to the refrigerator.\nCombine water and chicken bouillon cubes in a saucepan. Heat over medium heat, stirring until bouillon cubes are dissolved, about 5 minutes. Add chicken breasts and onion; simmer until chicken is no longer pink in the center, about 45 minutes.\nTransfer chicken to a cutting board using a slotted spoon. Reserve broth in the saucepan. Cool chicken until easily handled, 5 to 10 minutes. Chop coarsely.\nPour several cups of water into the reserved broth in the saucepan; bring to a boil. Stir in vermicelli and cook until tender, about 6 minutes. Drain.\nMix dressing, chicken, and vermicelli together in a bowl. Add artichoke hearts and toss to combine. Refrigerate until flavors combine, 2 to 6 hours. Mix in tomatoes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baseball Cookies with Royal Icing",
        "ingredients": [
            "Cookies: ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup unsalted butter, at room temperature ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Royal Icing: ADVERTISEMENT",
            "1 tablespoon white vinegar, or as needed ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "3 tablespoons meringue powder ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "2 teaspoons clear vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir flour and baking powder together in a bowl.\nBeat butter and white sugar together in the bowl of a stand mixer using the paddle attachment until light and fluffy, about 3 minutes. Add egg and vanilla extract; beat 1 minute more. Slowly add flour mixture and blend until dough begins to pull away from the sides of the bowl.\nTurn dough onto a piece of parchment paper. Knead dough a few times using your hands and form into 2 discs. Wrap each dough disc in plastic wrap and refrigerate for 2 hours.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with a silicone mat.\nRemove 1 disc of dough from the refrigerator. Place dough on a lightly floured work surface; top with a piece of parchment paper. Roll out dough to about 1/3-inch thickness. Cut dough with round cookie cutters and transfer to the prepared baking sheet.\nPlace baking sheet with cookies on it in the freezer or refrigerator for 3 to 5 minutes.\nBake in the preheated oven until cookies are just barely beginning to turn golden brown, 8 to 10 minutes. Cool cookies on the baking sheet for 1 minute; transfer to a wire rack to cool completely. Repeat with second disc of dough.\nWipe down all equipment for making the icing with vinegar, including spatulas, measuring cups, and bowls.\nCombine confectioners' sugar and meringue powder in the bowl of a stand mixer using the paddle attachment.\nMix water, corn syrup, and clear vanilla extract together in a separate bowl. Pour water mixture into sugar mixture and beat on medium speed until stiff peaks form in the icing, 4 to 5 minutes.\nDecorate cooled cookies with icing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ecuadorian Seco de Pollo",
        "ingredients": [
            "6 chicken thighs ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon oregano ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "1 tomato, quartered ADVERTISEMENT",
            "1 red onion, quartered ADVERTISEMENT",
            "1 bunch cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken thighs with garlic, black pepper, cumin, and oregano.\nHeat oil in a deep saucepan over medium-high heat; cook seasoned chicken until browned on both sides, about 5 minutes.\nCombine beer, tomato, red onion, and cilantro in a blender; blend until a smooth sauce forms. Pour sauce over chicken and reduce heat to low; simmer until chicken is very tender, 45 minutes to 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken Thigh Roll-Ups",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "12 skinless, boneless chicken thighs ADVERTISEMENT",
            "6 slices provolone cheese, halved ADVERTISEMENT",
            "12 stalks fresh asparagus, trimmed and halved ADVERTISEMENT",
            "12 thin slices prosciutto ADVERTISEMENT",
            "1 tablespoon dried Italian herbs, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking pan with cooking spray.\nWrap half a piece of provolone cheese around 2 asparagus halves. Wrap 1 chicken thigh around the cheese. Wrap 1 slice of prosciutto around the chicken thigh. Transfer to the prepared pan. Repeat with remaining provolone cheese, asparagus halves, chicken thighs, and prosciutto. Sprinkle Italian herbs on top.\nBake in the preheated oven until an instant-read thermometer inserted into the chicken reads at least 165 degrees F (74 degrees C), about 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar Cookie Cups with Coconut Buttercream Frosting",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (16.5 ounce) package refrigerated sugar cookie dough ADVERTISEMENT",
            "1 tablespoon all-purpose flour, or as needed ADVERTISEMENT",
            "3/4 cup unsalted butter, at room temperature ADVERTISEMENT",
            "3 cups confectioners' sugar, sifted ADVERTISEMENT",
            "3 tablespoons canned coconut milk, or more as needed ADVERTISEMENT",
            "1 teaspoon coconut extract ADVERTISEMENT",
            "1/4 cup colored sugar (optional) ADVERTISEMENT",
            "1/4 cup candy sprinkles (optional) ADVERTISEMENT",
            "1/4 cup shredded coconut (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a mini muffin tin with cooking spray.\nScoop up 2 teaspoons of cookie dough and roll into a ball. Place the ball in the prepared tin. Repeat with remaining cookie dough.\nDip the bottom of a shot glass in flour and use to press each ball of dough into a cup shape; the top of each cup should be about 1/4 inch below the rim of the tin.\nBake in the preheated oven until golden, about 10 minutes. Press again with the shot glass to reinforce the cup shape. Continue baking cookie cups until very lightly browned, about 1 minute more. Cool in the tin for 5 minutes. Transfer carefully to a wire rack to cool completely.\nBeat butter in a bowl with an electric mixer until fluffy. Beat in confectioners' sugar, 1 cup at a time, until well blended. Add coconut milk and coconut extract; beat at high speed until frosting is light and fluffy. Add 1 tablespoon coconut milk if frosting is too thick.\nSpoon or pipe frosting into each cookie cup. Decorate with colored sugar, candy sprinkles, and shredded coconut.\n",
        "picture_link": "Dv58zR3y8IUsaYO2oyfuZYZtI7ByvXm"
    },
    {
        "title": "Bunny Pretzels",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1/4 cup baking soda ADVERTISEMENT",
            "1 (11 ounce) package refrigerated French bread dough (such as Pillsbury®) ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 tablespoon coarse sea salt ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet with cooking spray.\nMix 4 cups water and baking soda together in a large saucepan; bring to a boil. Pour into a shallow dish.\nFlatten bread dough on a floured work surface; cut into 3 pieces, each about 6 inches long. Slice each piece into 4 long strips. Break a 1-inch piece off each strip; roll into a ball for the tail. Roll the remainder of each strip into a log about 9 inches long.\nWrap 1 log around the tail to make the body; twist twice to make the head and ears. Repeat with remaining 11 strips.\nSubmerge \"bunnies,\" 2 at a time, into the water-baking soda mixture for 30 seconds. Transfer to the prepared baking sheet. Adjust ears if they became untwisted.\nWhisk egg yolk and 1 tablespoon water together in a small bowl. Brush over bunnies. Sprinkle salt on top.\nBake in the preheated oven until warmed through, about 5 minutes. Move around with a spatula to ensure they don't stick. Continue baking until golden brown, about 10 minutes. Transfer to cooling racks. Brush with melted butter while still warm.\n",
        "picture_link": "2aMUkuevG5a8zXrQQfLR36FWqfwIvOO"
    },
    {
        "title": "Quick and Easy Strawberry Cream Cheese Frosting",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 (3 ounce) package strawberry-flavored gelatin (such as Jell-O®) ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cream cheese, confectioners' sugar, butter, gelatin, milk, and vanilla extract in a bowl using an electric mixer on low speed. Continue to mix, pausing to scrap sides down as needed, until frosting is evenly mixed and fluffy.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Plant-Based Stuffed Green Pepper",
        "ingredients": [
            "6 tomatoes - peeled, seeded, and chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "2 teaspoons salt, divided ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, divided ADVERTISEMENT",
            "1 1/2 cups cooked brown rice ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "4 green bell peppers, tops and seeds removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomatoes, onion, celery, water, tomato sauce, 1 teaspoon salt, and 1/4 teaspoon black pepper in a large saucepan; bring to a boil. Reduce heat and simmer until onion is tender, 10 to 15 minutes.\nCombine remaining 1 teaspoon salt, 1/4 teaspoon black pepper, brown rice, and basil in a bowl. Fill green bell peppers with rice mixture. Carefully place peppers in the tomato sauce mixture, spooning some sauce over tops of peppers.\nCover saucepan and simmer until peppers are tender, 40 to 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baked Halva",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups semolina flour ADVERTISEMENT",
            "1 cup finely chopped almonds ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "3 eggs, beaten well ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 lemon, zested, or more to taste ADVERTISEMENT",
            "Syrup: ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "3 whole cloves ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch cake pan.\nSift flour, baking powder, and salt together in a bowl. Mix in semolina and almonds.\nCombine 1 cup sugar and butter in a large bowl; beat with an electric mixer until light and fluffy. Beat in eggs. Add flour mixture alternately with milk, beating batter briefly between each addition. Stir in lemon zest.\nPour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.\nCombine water, 3 cups sugar, cloves, and cinnamon in a saucepan; bring to a boil, stirring until sugar dissolves into a syrup. Pour syrup over cake as soon as it comes out of the oven. Let cake cool, about 30 minutes. Cut into squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken Agrodolce",
        "ingredients": [
            "4 large skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, peeled ADVERTISEMENT",
            "1 teaspoon chopped fresh ginger ADVERTISEMENT",
            "4 bay leaves ADVERTISEMENT",
            "1/3 cup dry white wine ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "2 tablespoons toasted pine nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat chicken with flour.\nHeat olive oil in a skillet over medium-high heat; cook chicken with garlic, ginger, and bay leaves until chicken is browned, about 5 minutes per side.\nMix wine, vinegar, and honey together in a saucepan over medium heat; cook and stir until sauce is reduced by half, about 5 minutes. Add orange juice, lemon juice, salt, black pepper, and cayenne pepper and continue cooking until sauce is reduced by 2/3, about 10 minutes. Strain reduction sauce.\nPour strained reduction sauce over chicken; add pine nuts and simmer over medium heat until chicken is no longer pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easter Carrot Cheese Log",
        "ingredients": [
            "1 (2.25 ounce) can sliced black olives, rinsed and drained ADVERTISEMENT",
            "2 ounces pimento-stuffed green olives, rinsed and drained ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, at room temperature ADVERTISEMENT",
            "4 ounces finely shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 teaspoons mild taco seasoning mix ADVERTISEMENT",
            "10 sprigs fresh parsley, stems cut to 2 inches long ADVERTISEMENT",
            "2 ounces shredded sharp Cheddar cheese, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop black olives and green olives in a food processor or a food chopper.\nMix cream cheese, 4 ounces Cheddar cheese, chopped olives, and taco seasoning together in a bowl using an electric mixer on low speed. Increase speed to medium and mix until well combined.\nTransfer cheese mixture to a flat serving plate. Shape cheese mixture into a 2-inch-thick carrot shape using a silicone bowl scraper. Press 2 ounces Cheddar cheese over the entire \"carrot\". Insert parsley sprigs into the top of the \"carrot\". Remove excess cheese from the plate using a damp napkin. Cover with plastic wrap and refrigerate for at least 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tahini Dressing",
        "ingredients": [
            "2/3 cup low-fat plain yogurt ADVERTISEMENT",
            "1/2 cup tahini ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup warm water, or more as needed ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "1/4 cup finely chopped parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine yogurt, tahini, lemon juice, water, garlic, and salt in a food processor; puree until smooth and creamy. Add more water if dressing is too thick. Add parsley; pulse for 10 seconds to distribute evenly. Transfer dressing to an airtight container.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Strawberry Cream Cheese Frosting ",
        "ingredients": [
            "1 pint fresh strawberries, sliced ADVERTISEMENT",
            "1 (8 ounce) package cream cheese (such as Philadelphia®), softened ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups confectioners' sugar, sifted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree strawberries in a blender or food processor until smooth.\nCombine cream cheese and butter in a large bowl; beat with an electric mixer until creamy and smooth. Blend in vanilla extract. Gradually beat in confectioners' sugar until smooth. Fold in strawberry puree until frosting is desired flavor and consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Cinnamon Waffles",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "6 tablespoons coconut oil, melted ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "3 tablespoons baking powder ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions.\nMix flour, water, coconut oil, sugar, apple cider vinegar, baking powder, cinnamon, and salt together in a bowl until batter is smooth.\nLadle batter into the waffle iron and cook according to manufacturer's instructions until crisp, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Indoor Chicken Burgers on Biscuits",
        "ingredients": [
            "Chicken Burgers: ADVERTISEMENT",
            "1 pound ground chicken ADVERTISEMENT",
            "3/4 cup bread crumbs ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup sliced onions ADVERTISEMENT",
            "Biscuits: ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons chopped fresh chives (optional) ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1 cup low-fat milk ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ground chicken, bread crumbs, egg, Worcestershire sauce, parsley, garlic powder, and kosher salt in a bowl using your hands; shape into 5 patties about 3 inches across and 1 inch thick.\nHeat oil in a skillet over medium heat. Cook patties in the hot oil until browned, about 5 minutes. Flip patties and add onions to the skillet. Cook until patties are browned on the second side and onions are tender, about 5 minutes. An instant-read thermometer inserted into the patties should read at least 165 degrees F (74 degrees C).\nPreheat oven to 425 degrees F (220 degrees C).\nMix flour, baking soda, white sugar, and salt together in a bowl; fold in chives. Cut shortening into flour mixture until crumbly. Gradually pour milk into mixture while stirring with a wooden spoon until dough starts to pull away from the sides of the bowl.\nTurn dough onto a floured surface and knead for 2 minutes; flatten into 1 inch thickness. Use a round cookie cutter or juice glass to cut into individual biscuits, pushing straight down and pulling straight up to maintain fluffiness while baking. Arrange biscuits on a baking sheet.\nBake in the preheated oven until lightly browned, about 13 minutes.\nSlice biscuits open and place a burger on the bottom half of each biscuit; top with onion and mozzarella cheese. Place top half of the biscuit on top of the mozzarella cheese to create a sandwich.\n",
        "picture_link": "eXOcWzPpxHJzXtDQiSNJC/hNIv.Uyly"
    },
    {
        "title": "Fresh Strawberry Shortcake Cupcakes",
        "ingredients": [
            "Cupcakes: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 (8 ounce) container strawberry-flavored cream cheese ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 tablespoons heavy whipping cream ADVERTISEMENT",
            "1 teaspoon strawberry jam ADVERTISEMENT",
            "8 strawberries ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 (7 ounce) can whipped cream ADVERTISEMENT",
            "10 strawberries, sliced crosswise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line two 12-cup muffin tins with paper liners.\nWhisk flour, baking powder, and salt together in a bowl.\nCombine butter and 1 cup sugar in a bowl; beat with an electric mixer until creamy. Beat in eggs one at a time. Mix in vanilla extract. Add the flour mixture alternately with milk, beating batter very briefly after each addition.\nPour batter evenly into the lined cups.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes. Cool in the tins for 5 minutes. Transfer to a wire rack to cool completely.\nCombine cream cheese, 1/3 cup sugar, heavy cream, and strawberry jam in a bowl; beat with an electric mixer until creamy.\nSlice off the sides of 8 strawberries to remove seeds. Mash strawberries in a small bowl with a fork. Beat into the cream cheese mixture until fully incorporated.\nCut a small hole in the center of each cooled cupcake; scoop out about 1/2 inch of cake. Fill each gap with a spoonful of the cream cheese frosting.\nTop each cupcake with a swirl of whipped cream. Place 1 strawberry slice in the center of each cupcake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Jeffrey's Eggs in a Basket",
        "ingredients": [
            "6 slices bread ADVERTISEMENT",
            "1/4 cup butter, at room temperature ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut a 2-inch hole in each slice of bread. Reserve rounds. Butter both sides of each slice.\nHeat a nonstick skillet over medium heat. Place 3 slices of buttered bread in the skillet. Crack 1 egg into each hole. Cook until bottom of eggs begin to set and turn opaque, 2 to 3 minutes. Flip; cook until eggs are set and bread is golden brown, about 1 minute more. Repeat with remaining bread and eggs.\nServe with bread rounds for dipping into egg yolks.\n",
        "picture_link": "ECfknifyg7JXUoG2eymqamLuBRLjnhq"
    },
    {
        "title": "Whipped Strawberry Cream Cheese Frosting",
        "ingredients": [
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 (4 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/4 cup strawberry puree ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chill a large glass or metal bowl and the beaters from an electric mixer for 30 minutes.\nBeat heavy cream in the chilled bowl with the electric mixer until stiff peaks form, about 5 minutes.\nBeat cream cheese in a separate bowl until creamy, 1 to 2 minutes. Add butter; mix until well blended, 1 or 2 minutes. Stir in strawberry puree and vanilla extract. Add confectioners' sugar and mix until well blended.\nFold the whipped cream into the cream cheese mixture; lift and fold gently until whipped cream is evenly incorporated.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Aunt Judi's Easter Pineapple Raisin Sauce",
        "ingredients": [
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "1/2 teaspoon mustard ADVERTISEMENT",
            "1 1/2 cups hot water ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk brown sugar and flour together in a saucepan; add vinegar and mustard and whisk until smooth and free of lumps. Mix water, pineapple, and raisins into brown sugar mixture and simmer over medium heat, stirring often, until thickened, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Millionaire's Shortbread Bars (Vegan + Gluten-Free)",
        "ingredients": [
            "Shortbread Layer: ADVERTISEMENT",
            "1 1/2 cups blanched almond flour ADVERTISEMENT",
            "1/4 cup grapeseed oil ADVERTISEMENT",
            "3 tablespoons agave nectar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Caramel Layer: ADVERTISEMENT",
            "11 dates, pitted ADVERTISEMENT",
            "1/4 cup almond butter ADVERTISEMENT",
            "1/4 cup hot water ADVERTISEMENT",
            "Chocolate Layer: ADVERTISEMENT",
            "1/2 cup coconut oil, melted ADVERTISEMENT",
            "6 1/2 tablespoons raw cacao powder ADVERTISEMENT",
            "2 tablespoons agave nectar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a loaf pan with parchment paper.\nMix almond flour, grapeseed oil, 3 tablespoons agave nectar, vanilla extract, and salt together in a bowl; press into the prepared loaf pan.\nBake in the preheated oven until crust is lightly browned, about 20 minutes. Cool completely.\nPlace dates in a food processor and process until a paste forms. Add almond butter and hot water and process until very smooth. Spread date mixture evenly over the cooled crust; refrigerate.\nWhisk coconut oil, cacao powder, and 2 tablespoons agave nectar together in a bowl until smooth; pour over date layer. Refrigerate until chocolate layer is set, 8 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "The Best Vegan Carrot Soup Ever",
        "ingredients": [
            "1/4 cup vegan butter, cubed ADVERTISEMENT",
            "3 cups vegetable broth ADVERTISEMENT",
            "1 large potato, peeled and cubed ADVERTISEMENT",
            "2 1/2 cups peeled and sliced carrots ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1/2 cup coconut cream ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegan butter in a Dutch oven over medium heat until melted. Add vegetable broth, potato, carrots, onion, celery, and ginger; cover and cook, stirring occasionally, until potato is tender, about 30 minutes. Uncover soup and let cool, about 15 minutes.\nPuree soup in batches in a food processor or high-speed blender until smooth.\nReturn soup to the Dutch oven; stir in coconut cream. Season with curry powder, salt, and pepper. Cook over low heat until soup is heated through, about 10 minutes.\n",
        "picture_link": "bGiLqpA/uMfoTNCoeQri.WzgVuRb1lG"
    },
    {
        "title": "Carrot Cornucopia Cake ",
        "ingredients": [
            "3 1/4 cups cake flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground mace ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (8.5 ounce) can crushed pineapple, undrained ADVERTISEMENT",
            "2 cups coarsely shredded carrots ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "1/2 cup golden raisins (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch tube pan.\nMix cake flour, baking powder, cinnamon, baking soda, allspice, mace, and salt together in a large bowl.\nCombine sugar, vegetable oil, eggs, and vanilla extract in a large bowl; beat well. Beat in pineapple and carrots. Mix in flour mixture until well blended. Fold pecans and golden raisins into the batter.\nPour batter into the prepared baking pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 1 hour to 1 hour 10 minutes. Cool in the pan for 10 minutes. Invert onto a large plate. Let cool completely, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spicy Center-Cut Pork Chops ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 (15.25 ounce) cans mixed fruit with pineapple in light syrup ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 tablespoons Szechuan sauce, or more to taste ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 cups bread crumbs ADVERTISEMENT",
            "1/4 cup Szechuan seasoning (optional) ADVERTISEMENT",
            "4 (1-inch thick) boneless center-cut pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a large baking dish with cooking spray.\nCombine canned fruit and onion in a food processor; blend until almost pureed. Mix in Szechuan sauce and sugar. Pour into a shallow bowl.\nMix bread crumbs and Szechuan seasoning together in a shallow dish.\nDredge pork chops in fruit mixture; coat with bread crumbs. Transfer to the baking dish.\nBake in the preheated oven until golden brown, about 35 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lemon Poppy Seed Scones (Gluten Free, Dairy Free, and Vegan)",
        "ingredients": [
            "9 tablespoons water ADVERTISEMENT",
            "3 tablespoons ground flax seeds ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "3 tablespoons coconut oil, melted ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup oat flour ADVERTISEMENT",
            "1/3 cup white rice flour ADVERTISEMENT",
            "1/4 cup brown rice flour ADVERTISEMENT",
            "2 tablespoons coconut flour ADVERTISEMENT",
            "1 tablespoon poppy seeds ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon xanthan gum ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nWhisk water and ground flax seeds together in a small bowl. Let stand until thickened, about 5 minutes. Mix in maple syrup, coconut oil, lemon zest, lemon juice, and vanilla extract.\nMix oat flour, white rice flour, brown rice flour, coconut flour, poppy seeds, baking soda, baking powder, xanthan gum, and salt together in a large bowl. Add maple syrup mixture; mix with a spatula until dough comes together in a ball.\nTransfer ball of dough to a large sheet of waxed paper; press into a circle about 1 inch thick. Cut into 8 wedges. Pull wedges apart and carefully transfer to the prepared baking sheet.\nBake in the preheated oven until golden brown, 15 to 17 minutes. Cool on a wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Norwegian Butter Sauce (Sandefjordsmor)",
        "ingredients": [
            "2 lemons, juiced ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "5 tablespoons cold, unsalted butter, cut into cubes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "cayenne pepper, to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh Italian parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lemon juice in saucepan over medium heat; simmer until lemon juice reduces to less than a tablespoon and almost disappears, 4 or 5 minutes, being careful not to let it burn. Quickly add cream; whisk to combine. Continue to cook until cream reduces and is thick enough to coat the back of a spoon, 5 or 6 minutes. Reduce heat to low.\nWhisk in 2 or 3 pieces of cold butter, stirring until butter melts before adding more. Add 2 or 3 more butter cubes. (If cream mixture cools too quickly, the sauce may break.) Continue adding butter a few pieces at a time until all butter is emulsified into the cream, 8 to 10 minutes. Add salt, cayenne pepper, and 2 generous tablespoons chopped parsley. Whisk until well blended. Keep sauce warm until ready to use.\n",
        "picture_link": "9nSGBCUPUEFiAh4JKwWDpV5zCheZuhW"
    },
    {
        "title": "Scrumptious Wheat Pound Cake",
        "ingredients": [
            "butter-flavored cooking spray ADVERTISEMENT",
            "3 cups granular sucralose sweetener (such as Splenda®) ADVERTISEMENT",
            "2 cups non-dairy margarine ADVERTISEMENT",
            "6 eggs, at room temperature ADVERTISEMENT",
            "4 cups whole wheat pastry flour, divided ADVERTISEMENT",
            "1 cup liquid non-dairy creamer ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated goat milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup honey (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a fluted tube pan (such as Bundt(R)) with cooking spray.\nCombine sweetener and margarine in a bowl; beat with an electric mixer until smooth and creamy. Beat in eggs one a time, scraping down the bowl after each addition. Beat in 2 cups flour and creamer. Add goat milk and vanilla extract; beat well.\nMix remaining 2 cups flour with baking powder and salt in a bowl. Add to the sweetener mixture; mix well until smooth. Pour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.\nCool in the pan for 20 minutes per inverting onto a cake dish. Drizzle honey on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "The Best Moist Lotus Cookie Butter Banana Bread Recipe Ever",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "6 ripe bananas, mashed ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 1/2 cups cake flour ADVERTISEMENT",
            "3 tablespoons cake flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup European cookie spread (such as Biscoff®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan with cooking spray.\nCombine sugar and butter in a large bowl; beat with an electric mixer until creamy. Beat in bananas and eggs.\nMix 1 1/2 cup plus 3 tablespoons cake flour, baking soda, and salt together in a bowl. Mix into the banana mixture. Stir in vanilla extract. Pour half of the batter into the prepared pan.\nHeat cookie spread in the microwave until softened, about 20 seconds. Spread over the batter in the pan. Cover with remaining banana batter; swirl decoratively with a knife.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 50 to 60 minutes. Cool in the pan for 5 minutes. Invert onto a wire rack. Cool for 10 to 15 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cookie Butter and Pear Spice Cake",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "1 (15.25 ounce) package spiced cake mix (such as Betty Crocker®) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3/4 cup sweetened condensed milk ADVERTISEMENT",
            "1/4 cup cookie butter ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon pumpkin pie spice ADVERTISEMENT",
            "Pear Filling: ADVERTISEMENT",
            "2 Bartlett pears - peeled, cored, and sliced, divided ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 tablespoon cinnamon whiskey (such as Fireball®) (optional) ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "3/4 cup cookie butter ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 10-inch springform pan with cooking spray.\nCombine spice cake mix, 1 cup water, eggs, and vegetable oil in a large bowl; beat with an electric mixer on low speed until moistened, about 30 seconds. Add sweetened condensed milk, 1/4 cup cookie butter, 1 tablespoon vanilla extract, and pumpkin pie spice. Increase speed to medium and beat until batter is smooth, about 2 minutes.\nArrange slices from 1 pear on the bottom of the prepared pan. Pour batter on top.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 40 minutes. Allow to cool completely, about 30 minutes.\nMelt 1 tablespoon butter in a large skillet over medium-high heat. Stir in remaining pear slices, 1/3 cup water, 1/4 cup honey, and cinnamon whiskey. Cook until pears are soft and the water has evaporated, 8 to 10 minutes. Remove from heat and let cool.\nCombine cream cheese, heavy cream, confectioners' sugar, 3/4 cup cookie butter, 1/2 cup butter, 2 teaspoons honey, and 1 teaspoon vanilla extract in the bowl of a stand mixer fitted with the paddle attachment; beat until frosting is slightly stiff, 10 to 20 minutes.\nRemove sides of the springform pan to release cake. Slice into three even layers; transfer middle and top layer to a flat work surface. Invert bottom layer and peel off base so pear slices are facing upward. Cover with middle cake layer; arrange pear and honey mixture evenly on top. Add top cake layer.\nSpread frosting over the top and sides of the cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Eggs and Savory French Toast with Cheese and Asparagus ",
        "ingredients": [
            "1 tablespoon unsalted butter, divided ADVERTISEMENT",
            "6 (1 inch thick) slices stale French bread ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "3 eggs, divided ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 stalk asparagus, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 1-quart baking dish with 1 teaspoon butter.\nArrange bread slices in a single layer in the baking dish.\nWhisk milk, 1 egg, nutmeg, salt, and pepper together in a bowl. Pour over bread slices. Sprinkle Parmesan cheese on top. Let stand until milk mixture is absorbed, 15 to 30 minutes. Dot remaining 2 teaspoons butter over Parmesan cheese.\nToss asparagus with olive oil in a bowl. Spread on a baking sheet. Season with salt and pepper.\nBake bread slices in the preheated oven until puffed up, about 10 minutes. Place asparagus in the oven. Continue baking bread slices until golden brown, about 10 minutes more.\nFill a large saucepan with 2 to 3 inches of water and bring to a boil. Reduce the heat to medium-low to bring water to a gentle simmer.\nCrack 1 egg into a small bowl then gently slip egg into the simmering water, holding the bowl just above the surface of water. Repeat with the remaining egg. Cook eggs until the whites are firm and the yolks have thickened but still runny, 2 1/2 to 3 minutes. Remove the eggs from the water with a slotted spoon.\nDivide bread between 2 plates. Top each portion with a poached egg. Season with salt and pepper. Serve asparagus on the side.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Super Moist Raspberry Lemon Cake",
        "ingredients": [
            "1 (15.25 ounce) package white cake mix (such as Pillsbury® Moist Supreme Classic White Cake Mix) ADVERTISEMENT",
            "1 (10 ounce) jar raspberry preserves ADVERTISEMENT",
            "1 (8 ounce) carton sour cream ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (16 ounce) container lemon frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 8-inch baking dishes.\nMix cake mix, raspberry preserves, sour cream, milk, eggs, and vegetable oil together in a large bowl until batter is well mixed; pour into the prepared baking dishes.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 45 minutes. Cool cakes completely, at least 1 hour.\nSpread lemon frosting over each cooled cake.\n",
        "picture_link": "z1i.6N1oQ3PRa0rdbncUaaXqLWfJqN."
    },
    {
        "title": "Chinese Fish Congee",
        "ingredients": [
            "3 quarts water ADVERTISEMENT",
            "1 1/2 cups medium-grain rice ADVERTISEMENT",
            "5 ounces white fish, cut into small chunks ADVERTISEMENT",
            "1 (3 inch) piece fresh ginger root, thinly sliced ADVERTISEMENT",
            "1 spring onion, sliced ADVERTISEMENT",
            "2 teaspoons chicken bouillon granules ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and rice in a large pot over high heat. Bring to a boil; simmer for 5 minutes. Reduce heat to medium-low and simmer until rice is tender, about 30 minutes.\nCombine fish, ginger, spring onion, chicken bouillon granules, and pepper in a bowl. Let marinate for 15 minutes.\nStir fish mixture into the pot. Simmer gently until rice is very soft and fish is falling apart, about 20 minutes. Season with parsley and salt.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cranberry Orange Pancakes ",
        "ingredients": [
            "1 cup sorghum flour ADVERTISEMENT",
            "1/2 cup unsweetened almond milk ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "2 teaspoons stevia sweetener (such as Truvia®) ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "1/8 pinch ground nutmeg ADVERTISEMENT",
            "1 cup frozen cranberries, thawed ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sorghum flour, almond milk, egg white, orange juice, stevia sweetener, orange zest, and nutmeg together in a bowl. Fold cranberries gently into the batter.\nSpray a large skillet with cooking spray; heat over medium-high heat. Reduce heat to medium; pour 1/4 cup batter into the skillet. Cook until bubbles start to form and bottom is lightly browned, 2 to 3 minutes. Flip and cook for 2 to 3 minutes more. Transfer to a cooling rack. Repeat with remaining batter.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Choy Sum with Oyster Sauce",
        "ingredients": [
            "1 tablespoon vegetable oil, divided ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 pound choy sum ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "3 tablespoons water, divided, or as needed ADVERTISEMENT",
            "1 tablespoon oyster sauce ADVERTISEMENT",
            "1 teaspoon Shaoxing wine ADVERTISEMENT",
            "1/2 teaspoon soy sauce ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "1/8 teaspoon monosodium glutamate (MSG) ADVERTISEMENT",
            "1 teaspoon cornstarch, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large saucepan of water, 1 teaspoon vegetable oil, 1 pinch salt, and 1 pinch sugar to a boil. Add choy sum and cook for 30 seconds. Drain, pressing gently to squeeze out excess water. Place choy sum on a serving dish.\nHeat remaining 2 teaspoons oil in a wok or skillet over high heat. Cook and stir garlic until fragrant, about 30 seconds. Add 2 tablespoons water, oyster sauce, Shaoxing wine, soy sauce, 1/4 teaspoon sugar, and monosodium glutamate; bring to a boil.\nMix remaining 1 tablespoon water and cornstarch together in a small bowl. Pour into the wok; cook and stir until sauce thickens, about 1 minute. Pour sauce over the choy sum.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Lettuce Wraps",
        "ingredients": [
            "Dipping Sauce: ADVERTISEMENT",
            "1/3 cup vegetarian hoisin sauce ADVERTISEMENT",
            "1 teaspoon water, or more to taste ADVERTISEMENT",
            "1/2 teaspoon sambal oelek (chile paste), or more to taste ADVERTISEMENT",
            "Seasoning Sauce: ADVERTISEMENT",
            "1 tablespoon vegetarian oyster sauce ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1/2 teaspoon sambal oelek (chile paste) (optional) ADVERTISEMENT",
            "1/2 teaspoon mushroom seasoning ADVERTISEMENT",
            "1/4 teaspoon sesame oil ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "Wraps: ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 slices ginger ADVERTISEMENT",
            "5 ounces fried tofu, diced ADVERTISEMENT",
            "4 ounces jicama, peeled and diced ADVERTISEMENT",
            "3 fresh shiitake mushrooms, diced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "8 large butterhead lettuce leaves ADVERTISEMENT",
            "1 tablespoon toasted sesame seeds, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix hoisin sauce, 1 teaspoon water, and 1/2 teaspoon sambal oelek together to make dipping sauce.\nMix oyster sauce, 1 tablespoon water, 1/2 teaspoon sambal oelek, mushroom seasoning, sesame oil, sugar, and 1/4 teaspoon salt together in a bowl to make seasoning sauce.\nHeat oil in a large skillet over medium heat. Cook and stir ginger until fragrant, about 30 seconds. Add tofu, jicama, shiitake mushrooms, 1/4 teaspoon salt, and pepper; cook and stir until mushrooms are golden brown, about 5 minutes. Add red bell pepper and seasoning sauce; cook and stir until heated through, about 1 minute. Remove from heat.\nPlace 1 to 2 tablespoons of tofu mixture in the center of each lettuce leaf. Sprinkle sesame seeds on top. Add 1 teaspoon dipping sauce; roll up lettuce to enclose tofu mixture. Repeat with remaining tofu mixture and lettuce leaves. Serve remaining dipping sauce alongside.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Classic Rice Pudding",
        "ingredients": [
            "1/2 cup uncooked long-grain white rice ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1 large egg yolk ADVERTISEMENT",
            "1 tablespoon cold butter ADVERTISEMENT",
            "2 tablespoons dried cherries, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rice, salt, and water into a saucepan. Bring to a boil over medium-high heat. Reduce heat to low, cover, and cook until tender, about 20 minutes. Remove from heat; sprinkle with sugar and pour in milk. Stir with a whisk until until the thin layer of cooked-on starch at the bottom of the pan is cleared and incorporated into the mixture, 2 or 3 minutes.\nPlace pan over medium heat, stirring frequently, until it reaches your desired of level of doneness and creaminess, 8 to 10 minutes. The longer it cooks, the thicker and stickier it will be. Remove from heat. Add vanilla and cinnamon. Very quickly whisk in the egg yolk (to prevent it from cooking). Whisk for about 1 more minute. Add butter and dried cherries; stir thoroughly.\nTransfer warm pudding to serving dishes. Cool to room temperature. Cover and refrigerate until thoroughly chilled, 3 to 4 hours.\n",
        "picture_link": "7BN3PCe5rzULZR56ja.SUJM7P5MuEh2"
    },
    {
        "title": "Homemade Banana Split Ice Cream",
        "ingredients": [
            "1 pint heavy whipping cream ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 banana, mashed ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 (5 ounce) jar maraschino cherries, chopped ADVERTISEMENT",
            "1 tablespoon strawberry jam, or to taste ADVERTISEMENT",
            "1 tablespoon chocolate syrup, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine heavy cream, sugar, and salt in a saucepan. Heat over medium heat until steaming, 3 to 4 minutes.\nWhisk egg yolks in a bowl. Whisk in 1 cup of the hot cream. Pour egg and cream mixture back into the saucepan; cook and stir until mixture coats the back of a spoon, about 4 minutes. Mix in banana and vanilla extract.\nTransfer mixture to the refrigerator; chill until very cold, at least 2 hours.\nFreeze cold mixture in an ice cream maker according to manufacturer's instructions. Transfer to a freezer-safe container; fold in maraschino cherries, strawberry jam, and chocolate syrup.\nFreeze ice cream until firm, about 4 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Banana Split Pancakes ",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 ripe bananas ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 ounces semisweet chocolate chips ADVERTISEMENT",
            "2 cups sliced fresh strawberries ADVERTISEMENT",
            "1 (7 ounce) can whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, brown sugar, baking powder, and salt together in a large bowl.\nMash bananas in a large bowl using a fork. Add milk, egg, oil, and vanilla extract; mix well.\nStir banana mixture and chocolate chips into the flour mixture until batter is blended but still slightly lumpy.\nHeat a lightly oiled griddle over medium heat. Drop 1/4 cup batter onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\nTop pancakes with strawberries and whipped cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Twice-Cooked Chile Pork",
        "ingredients": [
            "11 ounces skin-on, boneless pork belly ADVERTISEMENT",
            "1 (3/4 inch thick) slice fresh ginger, lightly smashed ADVERTISEMENT",
            "1/4 teaspoon Sichuan peppercorns ADVERTISEMENT",
            "1 1/2 tablespoons chile bean sauce (toban djan) ADVERTISEMENT",
            "2 teaspoons sweet bean paste ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped into 3/4-inch pieces ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork belly into a pot and cover with water. Add ginger and Sichuan peppercorns. Bring to a simmer over medium-high heat; reduce heat to medium-low. Cover and cook until some of the fat has rendered out, about 20 minutes.\nRemove the pork from the pot and cool to room temperature, about 15 minutes. Drain. Cut the pork into thin slices, about 1/8 inch thick. Return pork slices to pot. Stir in chile bean paste, sweet bean paste, and sugar. Cover and cook over medium heat until the pork is tender, 15 to 20 minutes.\nHeat 1/2 teaspoon oil in a wok over medium heat. Cook and stir green bell pepper and salt until starting to soften, 3 to 5 minutes. Transfer to a dish.\nHeat remaining 2 1/2 tablespoons oil in a wok over medium-high heat. Cook and stir pork until pieces begin to shrink and brown, 3 to 5 minutes. Return green bell pepper to the wok. Cook and stir until fragrant, about 2 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baked Cauliflower Fries",
        "ingredients": [
            "2 (2.5 pound) heads cauliflower ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "4 ounces shredded Cheddar cheese ADVERTISEMENT",
            "1 ounce finely grated Parmigiano-Reggiano cheese, plus more for topping ADVERTISEMENT",
            "4 cloves peeled garlic, crushed fine ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1 tablespoon olive oil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut cauliflower into medium-sized florets and process in batches in a food processor. For each batch, pulse until pieces break down and continue processing until texture resembles rice grains. Transfer to a large pot. Sprinkle with kosher salt. Cook over medium-high heat, stirring, until mixture is wet and soft, about 30 minutes. Reduce heat if it begins to brown. Remove from heat and allow cauliflower to cool.\nTransfer cauliflower in batches to a clean cotton towel. Bring up sides, twist towel, and squeeze out as much liquid as you can. For this recipe, you should have about 3 1/2 cups cooked, squeezed-dry cauliflower.\nPreheat oven to 350 degrees F (175 degrees C). Line a large rectangular baking dish with parchment paper, allowing ends to extend up over the sides for easy lifting. Lightly brush parchment with olive oil.\nCrack eggs into a large mixing bowl. Add crushed garlic, oregano, pepper, and cayenne pepper; whisk together. Transfer cauliflower to mixing bowl. Add shredded Cheddar cheese and grated Parmigiano-Reggiano. Mix thoroughly. Transfer to prepared baking dish. Tamp down and smooth out evenly.\nBake in preheated oven until deeply golden brown, about 1 hour. Allow to cool to room temperature. Cover and refrigerate until thoroughly chilled, 3 or 4 hours.\nPreheat oven to 400 degrees F. Line a baking sheet with a silicone mat; lightly oil the mat.\nLift cauliflower out of pan. Slice in half lengthwise; slice each half crosswise into thin \"fries,\" about 1 inch wide. Arrange fries on the mat so they do not touch; brush lightly with olive oil. Sprinkle with a dusting of grated Parmigiano-Reggiano cheese.\nBake in preheated oven until deeply browned, about 20 to 25 minutes. Allow to cool slightly before serving.\n",
        "picture_link": "I5DhjNuZFKkrnfpXVh6RH2NADR7n78e"
    },
    {
        "title": "Spicy Ma Po Tofu",
        "ingredients": [
            "1 (16 ounce) package soft tofu, cut into 1/3-inch cubes ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon water, or as needed ADVERTISEMENT",
            "6 1/2 tablespoons vegetable oil ADVERTISEMENT",
            "2 spring onions, roughly chopped ADVERTISEMENT",
            "1 (3/4 inch thick) slice fresh ginger, chopped ADVERTISEMENT",
            "2 teaspoons Sichuan peppercorns ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "5 ounces ground pork ADVERTISEMENT",
            "1 tablespoon doubanjiang (spicy broad bean paste) ADVERTISEMENT",
            "2 teaspoons rice wine ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tofu in a bowl and cover with boiling water. Let sit for 1 minute; drain.\nMix water and cornstarch together in a bowl to make a runny paste.\nHeat oil in a wok or large skillet over medium heat. Cook and stir spring onions, ginger, peppercorns, and garlic until fragrant, about 1 minute. Stir in ground pork, doubanjiang paste, rice wine, and soy sauce; cook, stirring frequently, until pork is browned, about 5 minutes.\nStir drained tofu into the wok or skillet. Cook and stir until coated with sauce, about 2 minutes. Season with salt. Pour in cornstarch paste and mix well until sauce thickens, about 1 minute.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Middle Eastern-Style Burek ",
        "ingredients": [
            "3 cups olive oil, or as needed, divided ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1/2 teaspoon baharat (Middle Eastern spice mix) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup finely chopped parsley ADVERTISEMENT",
            "1 (16 ounce) package egg roll wrappers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon olive oil in a large skillet. Cook and stir ground beef until browned, about 5 minutes. Add onion, baharat, salt, and pepper; cook and stir until onion is translucent, about 5 minutes. Remove from heat; stir in parsley. Drain juices and let cool, 10 to 15 minutes.\nLay 1 egg roll wrapper at a 45-degree angle on a flat work surface; place 3 tablespoons of the beef mixture in the center. Fold bottom corner over beef mixture and roll up halfway. Fold in both sides. Moisten edges of the top corner and roll up, pressing down top corner to seal. Repeat with remaining wrappers and beef mixture.\nHeat oil in a large pot over medium heat. Cook rolls in batches until light brown, about 2 minutes per side. Drain on paper towels.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Banana Split Milkshake ",
        "ingredients": [
            "6 scoops vanilla ice cream, divided ADVERTISEMENT",
            "2 tablespoons strawberry syrup, or to taste ADVERTISEMENT",
            "4 fresh strawberries, hulled (optional) ADVERTISEMENT",
            "2 bananas ADVERTISEMENT",
            "2 tablespoons chocolate syrup, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 3 scoops of vanilla ice cream into a blender; blend until smooth. Add strawberry syrup; blend until evenly distributed, about 1 minute. Add strawberries; blend for 1 minute. Pour mixture into a bowl.\nPlace remaining 3 scoops of vanilla ice cream into a blender; blend until smooth. Add chocolate syrup; blend until evenly distributed, about 1 minute. Add bananas; blend for 30 seconds. Pour strawberry mixture back into the blender; blend together, about 30 seconds.\nDivide mixture evenly among 3 glasses.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Authentic Sweet and Sour Pork",
        "ingredients": [
            "8 ounces pork loin ADVERTISEMENT",
            "1 teaspoon rice wine ADVERTISEMENT",
            "2/3 teaspoon salt, divided ADVERTISEMENT",
            "1 pinch monosodium glutamate (MSG) ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "1/4 cup cornstarch, divided ADVERTISEMENT",
            "2 1/2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "2/3 teaspoon soy sauce ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/4 cups vegetable oil for frying ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (3/4 inch thick) slice ginger, minced ADVERTISEMENT",
            "4 spring onions, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound pork to 1/3-inch thickness using a meat mallet. Slice into 1 1/2-inch strips.\nCombine pork strips, rice wine, 1/3 teaspoon salt, and monosodium glutamate in a bowl. Marinate in the refrigerator for 30 minutes.\nMix remaining 1/3 teaspoon salt, chicken stock, 1 tablespoon cornstarch, sugar, vinegar, and soy sauce in a bowl to make sauce.\nBeat eggs with remaining 3 tablespoons cornstarch in a bowl until smooth. Add pork strips; stir to coat.\nHeat oil in a wok or large saucepan to 280 degrees F (140 degrees C). Add pork strips one at a time to the hot oil. Cook until lightly golden, about 2 minutes. Transfer to a paper towel-lined plate with a slotted spoon.\nHeat oil to 340 degrees F (170 degrees C). Return pork to the hot oil. Cook until golden brown, about 2 minutes. Transfer to a serving plate with the slotted spoon.\nDrain all but 2 tablespoons oil from the wok. Cook and stir garlic and ginger in the hot oil until fragrant, about 30 seconds. Add sauce and spring onions; cook and stir until sauce begins to thicken, 4 to 5 minutes. Pour sauce over the pork on the serving plate.\n",
        "picture_link": "diHlNKL5Nnc4LG8VHMScBVWFQo8Dusq"
    },
    {
        "title": "Almond Burfi",
        "ingredients": [
            "1 cup whole almonds ADVERTISEMENT",
            "very warm water to cover ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 teaspoon ground cardamom, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place almonds in a bowl and cover with water; soak for 30 minutes. Drain water and peel almonds.\nBlend peeled almonds in a food processor or blender until a paste forms; gradually add milk while continuing to blend. Add sugar and blend until smooth.\nHeat butter in a skillet over medium heat; add almond mixture. Cook, stirring constantly, until mixture thickens and starts to pull away from the sides of the skillet, 10 to 15 minutes. Remove skillet from heat and add cardamom; stir for 1 to 2 minutes.\nButter a baking dish. Pour almond mixture into dish and spread into a 1/4-inch-thick rectangle. Cool for 15 to 20 minutes. Cut into squares or diamond shapes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simple Onigiri (Japanese Rice Balls)",
        "ingredients": [
            "2 cups uncooked short-grain white rice ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons soy sauce (optional) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 (1 ounce) package nori seaweed sheets (optional) ADVERTISEMENT",
            "1 (7 ounce) can tuna, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash rice in a sieve until the water runs clear.\nCombine rice, 2 1/2 cups water, sesame seeds, and 1 teaspoon salt in a large nonstick pot over medium heat; bring to a boil. Cover and cook until water is absorbed and rice is soft and sticky, about 15 minutes. Stir in soy sauce.\nMix 1 cup water and 1 tablespoon salt in a small bowl until salt is dissolved.\nPlace a 12-inch piece of plastic wrap in a small teacup, molding the plastic to fit the cup and letting the ends hang over the edges. Moisten plastic wrap with some of the salted water.\nPlace a 2x5-inch strip of nori seaweed halfway into the cup. Scoop some rice into the cup, leaving a 1/2-inch gap at the top. Make a small indent in the rice with a spoon; add a spoonful of tuna. Cover tuna with a spoonful of rice and fold over the exposed end of the seaweed strip.\nGather the ends of the plastic wrap tightly and remove the rice ball from the cup. Shape and compress the ball tightly with your hands. Transfer to a large plate. Repeat with remaining nori seaweed, rice, and tuna. Refrigerate onigiri until firm, 8 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Delicious Vegetarian Bolognese",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 cups finely chopped mushrooms ADVERTISEMENT",
            "1 cup finely chopped leek ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "coarsely ground black pepper to taste ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "3/4 cup creme fraiche ADVERTISEMENT",
            "2 carrots, grated ADVERTISEMENT",
            "1/2 cup red lentils ADVERTISEMENT",
            "3 tablespoons vegetable broth (such as Knorr® Touch of Taste) ADVERTISEMENT",
            "1/2 teaspoon sambal oelek (chile paste) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat. Add mushrooms, leek, salt, red pepper flakes, and pepper; cook and stir until mushrooms are soft, 5 to 10 minutes.\nStir crushed tomatoes, creme fraiche, carrots, red lentils, vegetable broth, and sambal oelek into the saucepan. Bring to a gentle simmer. Cover and cook, stirring occasionally, until flavors combine, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coconut Pecan-Crusted Zucchini Chips with a Spicy Avocado Marinara Sauce",
        "ingredients": [
            "Marinara Dipping Sauce: ADVERTISEMENT",
            "1 avocado, halved and pitted ADVERTISEMENT",
            "1 red bell pepper, seeded and quartered ADVERTISEMENT",
            "1 tablespoon hot sauce (such as Louisiana®) ADVERTISEMENT",
            "1 cup tomato sauce ADVERTISEMENT",
            "Zucchini chips: ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1 tablespoon buttermilk ADVERTISEMENT",
            "1 tablespoon Italian dressing ADVERTISEMENT",
            "1 sleeve buttery round crackers (such as Ritz®) ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1 1/2 tablespoons smoked paprika ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon ground coriander ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "2 zucchini, very thinly sliced ADVERTISEMENT",
            "3 tablespoons grapeseed oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine avocado, red bell pepper, and hot sauce in a blender; blend to a semi-chunky consistency.\nPour avocado mixture into a saucepan set over medium heat. Stir in tomato sauce, 1 tablespoon at a time, until dipping sauce reaches desired consistency. Cook until thickened and heated through, 5 to 10 minutes.\nWhisk egg whites, buttermilk, and Italian dressing together in a bowl.\nCombine crackers, pecans, coconut, paprika, chili powder, coriander, black pepper, dried onion, salt, cumin, and garlic powder in a food processor; pulse into fine crumbs. Pour into a shallow bowl.\nDip zucchini slices in the egg mixture; coat each side with cracker mixture.\nHeat grapeseed oil in a deep skillet over medium-high heat. Cook breaded zucchini slices in batches until golden brown, 1 to 3 minutes per side. Serve with the tomato dipping sauce alongside.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simple Hot and Sour Soup",
        "ingredients": [
            "1 3/4 ounces dried shiitake mushrooms ADVERTISEMENT",
            "1 ounce dried cloud ear mushrooms ADVERTISEMENT",
            "1/2 (12 ounce) package silken tofu, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 (8 ounce) can bamboo shoots, cut into thin matchstick-size pieces ADVERTISEMENT",
            "2 teaspoons vinegar ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "10 fluid ounces chicken stock ADVERTISEMENT",
            "2 ounces cooked ham, thinly sliced ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon Shaoxing cooking wine ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 teaspoons corn flour ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place shiitake mushrooms and cloud ear mushrooms in a bowl of water; soak until softened, about 30 minutes. Drain and finely chop the mushrooms.\nBring a pot of water to a boil; add tofu and cook for 1 minute. Remove using a slotted spoon and place in a bowl. Bring water back to a boil and add bamboo shoots; cook for 1 minute. Drain and set bamboo shoots aside.\nMix vinegar and white pepper together in a bowl.\nBring chicken stock to a boil in a large saucepan. Add bamboo shoots, mushrooms, and ham; return to a boil. Add tofu, soy sauce, Shaoxing wine, and salt; bring back to a boil.\nMix corn flour and water together in a bowl until dissolved; stir into chicken stock mixture until soup starts to thicken. Drizzle beaten eggs into soup, stirring gently to form cooked egg clumps, 2 to 3 minutes.\nStir vinegar-pepper mixture into soup and drizzle in sesame oil.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Berry Almond Cake",
        "ingredients": [
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, at room temperature ADVERTISEMENT",
            "2 eggs, at room temperature ADVERTISEMENT",
            "1 cup sour cream, at room temperature ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup almond flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups mixed frozen berries ADVERTISEMENT",
            "2 tablespoons sliced almonds ADVERTISEMENT",
            "1 tablespoon turbinado sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch square baking pan.\nCombine sugar and butter in a large bowl; beat with an electric mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Add eggs one at a time, beating well after each addition. Mix in sour cream, almond extract, and vanilla extract until batter is smooth.\nStir all-purpose flour, almond flour, baking soda, baking powder, cardamom, and salt together in a bowl. Add to the batter; mix on low speed just until combined.\nSpread batter evenly in the prepared pan. Scatter berries on top. Sprinkle sliced almonds and turbinado sugar over berries.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 45 to 50 minutes. Cool in the pan; serve warm or at room temperature.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Banana Split Brownie Pizza ",
        "ingredients": [
            "1 (18.25 ounce) package brownie mix (such as Betty Crocker®) ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 (12 fluid ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, at room temperature ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 bananas, thinly sliced ADVERTISEMENT",
            "10 strawberries, thinly sliced, or more to taste ADVERTISEMENT",
            "2 tablespoons chocolate syrup, or to taste ADVERTISEMENT",
            "2 tablespoons chopped peanuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a pizza pan with parchment paper.\nStir brownie mix, oil, eggs, and water in a bowl until well blended. Spread on the prepared pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 15 minutes. Let cool completely, about 15 minutes.\nMix crushed pineapple, cream cheese, sugar, and vanilla extract together in a bowl. Spread over cooled brownie.\nArrange banana and strawberry slices over cream cheese layer. Drizzle chocolate syrup and sprinkle peanuts on top. Cut \"pizza\" into slices.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Khachapuri",
        "ingredients": [
            "Pastry: ADVERTISEMENT",
            "4 cups all-purpose flour, divided ADVERTISEMENT",
            "4 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "3 1/2 teaspoons white sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 pound shredded Muenster cheese, or more to taste ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg, separated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 cups flour, yeast, sugar, and salt in the bowl of a stand mixer fitted with the paddle attachment.\nCombine milk and margarine in a 1-quart saucepan; heat over low heat until milk is very warm and margarine is mostly melted, about 5 minutes.\nBeat milk mixture into the flour mixture on low speed until just combined. Increase speed to medium and beat until smooth, about 2 minutes. Add remaining 2 cups flour; beat until a soft dough forms. Switch to the dough hook and knead until smooth and elastic, about 10 minutes.\nTransfer dough to a greased bowl. Turn over to coat. Cover and let rise until doubled, about 1 hour.\nGently punch down dough to deflate. Let rise until doubled again, about 45 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Grease a 9-inch round baking pan.\nGently punch down dough and roll into a circular shape. Transfer to the baking pan.\nMix Muenster cheese, egg, and egg yolk together in a bowl. Spread over dough in the baking pan. Gather up dough in 1 1/2-inch pleats. Squeeze pleats together gently and twist to make a topknot.\nLet dough rest, 10 to 15 minutes. Brush with egg white.\nBake in the preheated oven until golden brown, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vietnamese Eggplant with Spicy Sauce",
        "ingredients": [
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 white eggplant, sliced ADVERTISEMENT",
            "3 tablespoons minced lemongrass ADVERTISEMENT",
            "1 tablespoon crushed garlic ADVERTISEMENT",
            "1 tablespoon chopped green onion ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 teaspoon minced red chile pepper ADVERTISEMENT",
            "1 teaspoon minced fresh ginger ADVERTISEMENT",
            "1 tablespoon oyster sauce ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon oil in a skillet over medium heat. Add eggplant; cook until golden brown and soft, but not mushy, 3 to 5 minutes per side.\nMix remaining 2 tablespoons oil, lemongrass, garlic, green onion, basil, red chile, and ginger together in a bowl. Pour over eggplant in the skillet. Cook until green onion wilts, about 3 minutes. Stir in oyster sauce and sugar. Cook until flavors combine, 2 to 3 minutes. Remove from heat.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken Schnitzel",
        "ingredients": [
            "4 skinless, boneless chicken breast halves, trimmed ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup crushed toasted oat cereal (such as Cheerios®) ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 lemons, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken between 2 sheets of heavy plastic on a solid, level surface. Firmly pound with the smooth side of a meat mallet to 1/4-inch thickness.\nPlace flour in a bowl. Beat eggs together in a separate bowl. Mix crushed oat cereal, garlic powder, salt, and black pepper together in large resealable plastic bag.\nDredge each chicken breast in flour and dip into eggs, allowing excess egg to drip back into bowl. Transfer coated chicken to cereal mixture; seal bag and shake until evenly coated. Place coated chicken on a plate and refrigerate for 1 hour.\nHeat oil in a 12-inch skillet over medium-high heat; fry chicken until browned, 3 to 4 minutes per side. Transfer chicken to a paper towel-lined plate and squeeze lemon over each.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Indian Tuna (or Chicken) Salad",
        "ingredients": [
            "1 (5 ounce) can chunk white tuna, drained ADVERTISEMENT",
            "1 rib celery, diced ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "1 small carrot, chopped ADVERTISEMENT",
            "1/4 cup chopped walnuts (optional) ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons tamarind chutney ADVERTISEMENT",
            "1 teaspoon red chile chutney ADVERTISEMENT",
            "1 teaspoon green chutney ADVERTISEMENT",
            "1/4 teaspoon garam masala ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tuna, celery, red onion, raisins, carrot, and walnuts together in a bowl. Add mayonnaise, tamarind chutney, red chile chutney, green chutney, garam masala, and salt; mix with a fork until uniform in consistency.\nCover and refrigerate for at least 30 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken Schnitzel with Mango Cream Sauce ",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "4 cups bread crumbs ADVERTISEMENT",
            "2 mangoes, peeled and coarsely chopped ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons mango jam ADVERTISEMENT",
            "1/4 cup vegetable oil, or as needed ADVERTISEMENT",
            "2 shallots, chopped ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken on a solid, level surface. Firmly pound with the smooth side of a meat mallet to an even 1/4-inch thickness.\nPour flour into a shallow bowl. Whisk eggs with water in a separate bowl. Spread bread crumbs on a shallow plate.\nDredge each chicken breast in flour. Dip into the egg mixture; press into the bread crumbs to coat both sides. Place breaded chicken on a large plate.\nCombine mangoes, cream cheese, heavy cream, and mango jam in a blender; puree into a smooth sauce. Transfer sauce to the refrigerator to thicken up.\nHeat oil in a large skillet over medium heat. Cook breaded chicken until golden brown and no longer pink in the center, about 3 minutes per side.\nSpoon mango sauce over cooked chicken. Garnish with chopped shallots and sea salt.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Char-grilled Oysters",
        "ingredients": [
            "18 fresh oysters in shells ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/2 tablespoons sriracha sauce ADVERTISEMENT",
            "1 1/2 tablespoons minced garlic ADVERTISEMENT",
            "1 tablespoon chopped green onions ADVERTISEMENT",
            "1 tablespoon chopped cilantro ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place oysters in a baking pan, flat-side up.\nStir butter, sriracha sauce, garlic, green onions, cilantro, and lime juice together in a bowl.\nBake oysters in the preheated oven until they open slightly, about 10 minutes.\nRemove the top shell of the oysters using a towel and an oyster knife, being careful not to spill the liquor. Gently cut the muscles that attach the oysters to the shell.\nDivide the butter mixture among the oysters, placing a dollop on each. Sprinkle Parmesan cheese on top.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nBroil oysters in the preheated oven until butter melts and Parmesan cheese is golden brown, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Holige (Flatbread with Sweet Raisin Filling)",
        "ingredients": [
            "Dough: ADVERTISEMENT",
            "1 cup fine semolina flour ADVERTISEMENT",
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "3/4 cup water, or as needed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "5 dates, pitted ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "2 tablespoons mixed nuts (cashews, almonds, walnuts) ADVERTISEMENT",
            "1 tablespoon poppy seeds, toasted ADVERTISEMENT",
            "1/4 teaspoon freshly ground cardamom, or more to taste ADVERTISEMENT",
            "1/4 teaspoon freshly ground nutmeg (optional) ADVERTISEMENT",
            "1/4 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup ghee (clarified butter) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine semolina flour, 3/4 cup whole wheat flour, turmeric, and salt in a large bowl. Mix in 2 tablespoons vegetable oil. Stir in enough water to form a soft dough.\nBrush remaining 1 tablespoon vegetable oil over dough. Cover dough with a damp cloth or paper towel and let rest, 2 to 3 hours.\nProcess raisins and dates into a paste in a food processor or high-powdered blender. Add sugar, coconut, mixed nuts, poppy seeds, cardamom, and nutmeg; blend until thoroughly combined.\nRoll raisin and date mixture into golfball-sized balls.\nRoll dough into 1-inch balls. Sprinkle 1/4 cup whole wheat flour over a flat work surface. Roll 1 ball of dough out into a thin circle; place 1 raisin and date ball in the center. Wrap dough around the ball and pinch to seal. Roll back out into a circle. Repeat with remaining dough and raisin and date balls.\nMelt 1 teaspoon of ghee in a large skillet. Cook dough until brown spots appear, about 2 minutes. Add 1 teaspoon ghee to the top of the dough and flip. Cook until brown spots appear on the second side, about 2 minutes. Transfer to a serving plate. Repeat with remaining dough.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Manuka Mumble",
        "ingredients": [
            "1 1/2 cups extra-virgin coconut oil ADVERTISEMENT",
            "1/2 cup manuka honey ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine coconut oil and honey in a chilled bowl.\nLine a small tray with a sheet of plastic wrap; evenly spoon oil-honey mixture on top. Cover with another sheet of plastic wrap and press down to a 1/2-inch thickness using a tray of similar size. Refrigerate for 8 hours to overnight.\nRemove top layer of plastic wrap and cut hardened mixture into bite-size squares. Place squares in the bottom of a large, chilled bowl. Sprinkle 1 1/2 teaspoons cinnamon and 1/2 teaspoon nutmeg over squares, stir lightly. Sprinkle remaining 1 1/2 teaspoons cinnamon and 1/2 teaspoon nutmeg on top. Refrigerate.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mu Ssam (Radish Wrap)",
        "ingredients": [
            "1 pound Korean white radish ADVERTISEMENT",
            "3 tablespoons vinegar, divided ADVERTISEMENT",
            "3 tablespoons white sugar, divided ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 3/4 cups daikon radish sprouts ADVERTISEMENT",
            "1/2 large cucumber, cut into 2 1/2-inch matchsticks ADVERTISEMENT",
            "1 yellow bell pepper, cut into 2 1/2-inch matchsticks ADVERTISEMENT",
            "1 large carrot, cut into 2 1/2-inch matchsticks ADVERTISEMENT",
            "1 tablespoon Korean hot pepper paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place radish lengthwise on a flat work surface. Trim ends and slice off the top third so it is flat. Turn and cut into rectangular, 1/16-thick slices using a mandoline slicer.\nMix 2 tablespoons vinegar, 2 tablespoons sugar, and salt together in a small bowl until sugar dissolves. Place the radish rectangles in bowl, turning to coat. Marinate until soft enough to roll, about 1 hour.\nTrim radish sprouts to be 3 inches in length.\nSet aside any cucumber matchsticks without skin for another use.\nSqueeze excess liquid from the radish rectangles. Place some radish sprouts and a slice each of cucumber, yellow bell pepper, and carrot on 1 rectangle; roll up. Repeat with remaining sprouts, cucumber, yellow bell pepper, carrot, and radish rectangles.\nMix remaining 1 tablespoon vinegar, remaining 1 tablespoon sugar, and hot pepper paste to make a dipping sauce. Serve sauce with radish wraps.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Open-Faced Oysters",
        "ingredients": [
            "1 (8 ounce) package fresh mushrooms, finely chopped ADVERTISEMENT",
            "1 bunch fresh cilantro, chopped ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 green onions, thinly sliced ADVERTISEMENT",
            "1 lime, zested and juiced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "20 freshly shucked oysters on the half shell ADVERTISEMENT",
            "20 drops hot sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Arrange oysters on a baking dish.\nMeasure 1 tablespoon lime juice into a bowl; reserve.\nCombine mushrooms, cilantro, olive oil, green onions, lime juice, lime zest, and garlic in a bowl. Place a spoonful of the mixture over each oyster. Add a drop of hot sauce to each oyster. Drizzle reserved lime juice on top.\nBake in the preheated oven until warmed through, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Embrochette",
        "ingredients": [
            "1 pound extra large shrimp (16-20), peeled and deveined ADVERTISEMENT",
            "12 shucked oysters ADVERTISEMENT",
            "1 (12 ounce) package bacon slices, halved ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "metal skewers ADVERTISEMENT",
            "1 serving cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Tuck 1 oyster into the curve of a shrimp; wrap half a bacon slice around both. Place on a metal skewer, making sure to run the skewer through the oyster to keep it from sliding out during cooking. Repeat with remaining shrimp, oysters, and bacon slices. Season with black pepper.\nPreheat a gas or wood grill for medium heat. Spray grate lightly with cooking spray. Cook skewers, flipping at least twice, until bacon is almost crispy, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Delicious Whole Grain Banana Bread",
        "ingredients": [
            "1/3 cup butter, at room temperature ADVERTISEMENT",
            "1/3 cup unpasteurized Manuka honey ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 3/4 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon fleur de sel (sea salt flakes) ADVERTISEMENT",
            "1/4 cup hot water ADVERTISEMENT",
            "1/4 cup dark chocolate chunks ADVERTISEMENT",
            "2 tablespoons chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan.\nCombine butter and honey in a large bowl; beat with an electric mixer until well combined. Mix in bananas and vanilla extract.\nMix whole wheat flour, baking soda, baking powder, and fleur de sel together in a separate bowl. Mix into the butter mixture until batter is combined.\nWhisk hot water into the batter. Fold in dark chocolate and walnuts. Pour batter into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center of the loaf comes out mostly clean, about 45 minutes. Cool in the pan for 5 minutes; invert onto a baking rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kosher Fresh Cherry Salsa",
        "ingredients": [
            "2 tablespoons boiling water ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "2 cups pitted and halved sweet cherries ADVERTISEMENT",
            "1/3 cup finely chopped red bell pepper ADVERTISEMENT",
            "1/3 cup finely chopped red onion ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine boiling water and red pepper flakes in a large bowl. Let stand until pepper flakes soften, about 5 minutes.\nStir cherries, red bell pepper, red onion, lime juice, sugar, and salt into the bowl with red pepper flakes. Let stand until flavors combine, about 30 minutes. Stir in cilantro before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Cherry Lemon Muffins",
        "ingredients": [
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "1 cup white sugar, divided ADVERTISEMENT",
            "6 lemons, juiced ADVERTISEMENT",
            "3/4 cup wheat germ ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "1 3/4 cups pitted and sliced fresh cherries ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 1/4 cups all-purpose flour, sifted ADVERTISEMENT",
            "1 1/2 tablespoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger (optional) ADVERTISEMENT",
            "3/4 cup plain Greek yogurt ADVERTISEMENT",
            "3 extra large eggs, beaten ADVERTISEMENT",
            "1/2 cup soybean oil ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line 2 muffin tins with paper liners.\nMix oats, 1/3 cup sugar, lemon juice, wheat germ, water, and lemon zest together in a small bowl.\nMix cherries with 2 tablespoons sugar in a small bowl.\nCombine remaining 2/3 cup sugar, flour, baking powder, cinnamon, and ginger in a large bowl. Stir in oat mixture. Mix in yogurt, eggs, oil, and butter until batter is thick and smooth.\nFold cherries into the batter. Divide batter evenly among muffin cups, filling each 3/4 full.\nBake in the preheated oven until tops start to brown and a toothpick inserted into the center comes out clean, 18 to 20 minutes. Cool in the tins for 5 minutes before transferring to a wire rack to cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sukju Namul (Mung Bean Sprout Salad)",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 pound mung bean sprouts ADVERTISEMENT",
            "1 baby carrot, cut into matchsticks ADVERTISEMENT",
            "1 green onion, cut into 1-inch pieces ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1 teaspoon crushed garlic ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan. Add mung beans; cook until tender, about 5 minutes. Drain. Rinse under cool running water to stop the cooking process. Drain well; transfer to a bowl.\nCombine baby carrot and green onion in a small microwave-safe bowl. Cover with water and place in the microwave for 30 seconds. Drain.\nStir baby carrot and green onion into the bean sprouts in the bowl. Add sesame oil, garlic, salt, pepper, and sesame seeds; mix by hand until combined.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Big Ray's Cherry Rhubarb Coffee Bars",
        "ingredients": [
            "Rhubarb Filling: ADVERTISEMENT",
            "4 cups chopped rhubarb ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/3 cup cornstarch ADVERTISEMENT",
            "1 (20 ounce) can cherry pie filling ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup cold butter, cubed ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup cold butter, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine rhubarb and lemon juice in a large saucepan over medium-low heat; cook, stirring often, for 5 minutes.\nMix 1 cup sugar and cornstarch together in a bowl; stir into rhubarb mixture. Cook and stir until rhubarb mixture is thickened and bubbling, about 5 minutes. Stir in pie filling; remove from heat and cool filling, about 10 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nCombine 3 cups flour, 1 cup sugar, baking powder, baking soda, and salt in a large bowl; cut in 1 cup cubed butter until mixture resembles fine crumbs.\nBeat buttermilk, eggs, and vanilla extract together in a separate bowl; add to flour mixture and stir just until batter is moistened.\nSpread a little more than half of the batter into the prepared baking dish; top with cherry-rhubarb filling. Drop teaspoonfuls of remaining batter over filling.\nCombine 1 1/2 cup sugar and 1 1/2 cups flour in a bowl; cut in 1/2 cup cubed butter until mixture resembles coarse crumbs. Sprinkle mixture over batter.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 40 to 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fred's Rhubarb Cake with Honey and Pecans",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3 cups diced rhubarb ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking dish.\nMix flour, 3/4 cup brown sugar, baking soda, and salt together in a bowl. Mix in sour cream, honey, and vanilla extract until thoroughly blended. Mix in eggs until just blended. Fold rhubarb into the batter.\nSpread batter evenly in the prepared baking dish.\nMix 1/2 cup brown sugar, white sugar, pecans, and cinnamon together in a bowl. Stir in butter until mixture starts to clump together. Sprinkle mixture over batter.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mango Ice Cream",
        "ingredients": [
            "1/2 cup plain Greek yogurt ADVERTISEMENT",
            "1 cup frozen mango chunks ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "2 tablespoons water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer Greek yogurt, mango chunks, ginger, and water in a blender in the order listed. Pulse 3 or 4 times; blend until smooth, adding more water to reach desired consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coconut and Molasses-Filled Rice Dumplings",
        "ingredients": [
            "Dough: ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup rice flour ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 cup grated coconut ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water, vegetable oil, and salt to a boil in a large pot. Add rice flour gradually, stirring constantly, until a smooth, thick dough forms, 2 to 3 minutes. Remove from heat and let cool.\nMix coconut, molasses, and cardamom together in a bowl to make filling.\nDivide the cooled dough into 9 balls; flatten into thin discs. Place 1 tablespoon of the filling in the center of each disc. Wrap up dough around filling and roll into a ball between your palms.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add balls of dough, cover, and steam until a toothpick inserted into the center comes out clean, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Deconstructed California Roll Bowl ",
        "ingredients": [
            "2 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 cup teriyaki marinade ADVERTISEMENT",
            "1 tablespoon orange juice concentrate ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked short-grain white rice ADVERTISEMENT",
            "1 tablespoon peanut oil ADVERTISEMENT",
            "1 onion, cut into strips ADVERTISEMENT",
            "1 zucchini, cut into strips ADVERTISEMENT",
            "1 tablespoon soy sauce, or to taste ADVERTISEMENT",
            "1 tablespoon black sesame seeds ADVERTISEMENT",
            "1 avocado, chopped ADVERTISEMENT",
            "1 teaspoon wasabi paste, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts in a shallow container. Cover with teriyaki marinade and orange juice concentrate. Cover and marinate in the refrigerator for 6 to 8 hours.\nBring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, about 18 minutes.\nHeat a large nonstick skillet over medium heat. Add chicken breasts, discarding marinade. Cook until browned on both sides and no longer pink in the center, about 6 minutes per side. Remove from heat; let rest for 5 minutes. Slice into strips.\nHeat peanut oil in a skillet over medium heat. Cook and stir onion until softened, about 5 minutes. Add zucchini; cook and stir until almost tender, about 5 minutes. Return chicken strips to the skillet; drizzle soy sauce on top. Stir in black sesame seeds. Fold in avocado gently.\nServe chicken mixture over rice, with wasabi paste alongside.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "S'mores Cheesecake Cupcakes",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup mini marshmallows ADVERTISEMENT",
            "Crust: ADVERTISEMENT",
            "1 (14.4 ounce) package graham cracker crumbs ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "Cheesecake: ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow cream ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stuff 1 chocolate chip inside each marshmallow, using a hot metal spoon to make the marshmallow stick to the chocolate and form a very small ball. Place on a plate lined with waxed paper. Transfer to the freezer.\nPreheat oven to 350 degrees F (175 degrees C). Grease 2 muffin tins.\nMix graham cracker crumbs with melted butter in a bowl.\nPack graham cracker mixture into the muffin tins with the back of a spoon, creating a crust on the bottom of each cup.\nBeat cream cheese and sugar in a bowl with an electric mixer until smooth. Blend in milk. Beat in eggs one at a time, mixing just enough to incorporate. Beat in sour cream, flour, and vanilla extract until batter is smooth.\nFill muffin cups halfway with batter. Place a frozen marshmallow ball in the center of each. Cover with remaining batter.\nBake in the preheated oven until set, 15 to 20 minutes. Let cool completely, about 30 minutes.\nSpoon marshmallow cream into a small pot. Heat over low heat until soft, about 5 minutes. Mix in cinnamon and cocoa powder. Pipe frosting over cooled cupcakes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Overload S'mores",
        "ingredients": [
            "1 tablespoon chocolate-hazelnut spread (such as Nutella®) ADVERTISEMENT",
            "2 chocolate chip cookies ADVERTISEMENT",
            "1 tablespoon chocolate sprinkles ADVERTISEMENT",
            "1 marshmallow ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread chocolate-hazelnut spread on the underside of each chocolate chip cookie. Cover with chocolate sprinkles.\nPlace marshmallow on a stick and heat over an open campfire flame until it begins to brown and melt, 1 to 2 minutes.\nSandwich the marshmallow between the cookies. Let marshmallow cool briefly before eating, 1 to 2 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mint Chocolate S'mores",
        "ingredients": [
            "1 peppermint marshmallow ADVERTISEMENT",
            "1 chocolate graham cracker ADVERTISEMENT",
            "1 creme de menthe thins (such as Andes®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place marshmallow on a stick and heat over an open campfire flame until it begins to brown and melt, 1 to 2 minutes.\nBreak chocolate graham cracker in half; sandwich the hot marshmallow and creme de menthe thin between the halves. Let cool briefly before eating, 1 to 2 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Date, Almond, and Yogurt Bread",
        "ingredients": [
            "3/4 cup slivered almonds ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup whole milk yogurt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup chopped dates ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 6-inch baking pan.\nSpread almonds on a baking sheet.\nToast almonds in the preheated oven until they turn golden brown and become fragrant, about 5 minutes.\nCombine sugar and butter in a large bowl; beat with an electric mixer until creamy. Beat in yogurt and eggs. Mix in flour, baking soda, nutmeg, and salt. Fold 1/2 cup toasted almonds and dates into the batter.\nPour batter into the prepared pan. Top with remaining 1/4 cup toasted almonds.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 50 to 60 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spicy Shrimp Baba Ghanoush Flatbread",
        "ingredients": [
            "1 large eggplant ADVERTISEMENT",
            "1 red bell pepper ADVERTISEMENT",
            "1 green bell pepper ADVERTISEMENT",
            "1/2 cup tahini ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil, divided ADVERTISEMENT",
            "4 whole-grain flatbreads ADVERTISEMENT",
            "4 teaspoons basil pesto ADVERTISEMENT",
            "4 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 pound shrimp ADVERTISEMENT",
            "1 tablespoon Cajun seasoning, or more to taste ADVERTISEMENT",
            "3 tomatoes, cut into 16 slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPreheat a charcoal grill for medium heat and lightly oil the grate. Poke several holes in the eggplant with a knife.\nGrill eggplant, red bell pepper, and green bell pepper until skin starts to blacken and flesh softens, 10 to 15 minutes.\nPlace eggplant on a baking sheet. Chop red bell pepper and green bell peppers.\nBake eggplant in the preheated oven until soft, about 20 minutes. Cool until easily handled, about 10 minutes. Peel off skin. Mash flesh into a coarse paste.\nCombine mashed eggplant, tahini, lemon juice, garlic, and cumin in a blender; puree until smooth. Pour into a bowl. Drizzle 1 tablespoon olive oil on top.\nArrange flatbreads on a baking sheet. Spread 2 tablespoons eggplant puree and 1 teaspoon pesto on top of each flatbread. Top with 1/4 cup red bell pepper, 1/4 cup green bell pepper, 1 cup mozzarella cheese, and 1/4 cup Parmesan cheese.\nBake in the preheated oven until mozzarella cheese and Parmesan cheese are melted, about 5 minutes.\nToss shrimp with Cajun seasoning in a bowl.\nHeat remaining 1 tablespoon olive oil in a skillet. Cook shrimp in the hot oil until opaque, about 3 minutes.\nDivide shrimp and tomato slices among flatbreads. Cut into slices or wrap up and serve with remaining eggplant puree on the side.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Big Kids' Watermelon",
        "ingredients": [
            "1 large large watermelon ADVERTISEMENT",
            "1 (750 milliliter) bottle spiced rum (such as Captain Morgan's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut a 4- to 6-inch-diameter circle, about 6 inches deep, in the middle of the watermelon using a paring knife, making a plug you can pull out. Slowly pour spiced rum into the watermelon; wait until it is absorbed. Repeat several times until spiced rum is used up; this can take several hours.\nReplace the plug in the watermelon and wrap entire watermelon in plastic wrap or aluminum foil; refrigerate for 2 to 3 days.\nRemove plastic wrap and slice watermelon.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dahl Puri",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "1 cup dried yellow split peas ADVERTISEMENT",
            "1 scotch bonnet chile pepper, minced ADVERTISEMENT",
            "2 garlic cloves ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "Puri: ADVERTISEMENT",
            "2 1/2 cups self-rising flour ADVERTISEMENT",
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 cup warm water, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken stock and yellow split peas to a boil in a saucepan. Reduce heat and simmer until split peas are soft, about 20 minutes. Drain and let cool, about 15 minutes.\nCombine yellow split peas, scotch bonnet chile pepper, garlic, turmeric, and cumin in a food processor; blend until filling is finely ground.\nCombine flour and 2 tablespoons vegetable oil in a large bowl. Pour in water slowly, stirring constantly, until dough starts to come together. Add a little more water if dough seems dry.\nKnead dough on a floured work surface until soft and no longer sticky. Let dough rest for 10 minutes, covered with a damp cloth.\nRoll dough into a large circle about 1/4-inch thick. Brush 1 teaspoon vegetable oil over the surface of the dough. Roll up into a long roll. Cut into 10 pieces. Roll each piece of dough into a 6-inch circle. Let circles rest, covered with damp cloth, for 5 minutes.\nDivide filling among circles. Wrap dough around filling, pinching edges to seal; roll into balls. Roll each ball back out into a large, thin circle.\nHeat 1 teaspoon oil in a large skillet. Cook 1 piece of dough in the hot skillet until it puffs up and turns light brown, about 2 minutes. Flip and continue cooking until second side is browned, 1 to 2 minutes. Transfer to a colander to cool; cover with a damp cloth. Repeat with remaining oil and dough.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Best Banana Yogurt Bread",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons ground allspice ADVERTISEMENT",
            "3 overripe bananas, thinly sliced ADVERTISEMENT",
            "1/2 cup banana-flavored yogurt ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x4-inch loaf pan.\nCombine 1 cup sugar and butter in a bowl; beat with an electric mixer until creamy. Beat in eggs and vanilla extract. Mix in flour and allspice gradually until batter is blended. Fold in bananas and banana-flavored yogurt.\nPour batter into the prepared loaf pan.\nMix 3 tablespoons sugar and cloves together in a small bowl; sprinkle over batter.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Watermelon Whiskey Sweet Tea",
        "ingredients": [
            "2 cups cubed seeded watermelon ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "4 (1.5 fluid ounce) jiggers whiskey ADVERTISEMENT",
            "8 (1.5 fluid ounce) jiggers sweet tea ADVERTISEMENT",
            "4 lime wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place watermelon and lemon juice in a blender; blend until smooth.\nFill a cocktail shaker with ice; add 1 shot whiskey, 2 shots blended watermelon, and 2 shots sweet tea. Cover and shake; pour into serving glass and garnish glass with lime wedge. Repeat with remaining ingredients to create 4 drinks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]