[
    {
        "title": "Roasted Butternut Squash Soup with Apples and Bacon",
        "ingredients": [
            "1 (3 pound) butternut squash - peeled, seeded, and cubed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "8 strips bacon, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "6 stalks celery, chopped ADVERTISEMENT",
            "6 carrots, chopped ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 Granny Smith apple - peeled, cored, and cubed ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 cup apple cider ADVERTISEMENT",
            "1 1/2 quarts chicken stock ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg (optional) ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Place squash in a large bowl and drizzle with olive oil; mix to coat; sprinkle with salt and pepper. Spread squash into a single layer on a baking pan. Roast the squash in the preheated oven, turning once, until fork-tender and caramelized; 30 to 40 minutes.\nPlace the bacon in a Dutch oven and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to a paper towel-lined plate, reserving the drippings in the pan.\nPlace the onion, celery, carrot, bay leaf, curry powder, thyme, and salt and pepper in the Dutch oven; cook in reserved bacon drippings until the carrots and celery are soft. Mix in the apples and cooked squash and cook another 5 minutes. Stir the garlic into the mixture and cook another 1 minute. Pour the apple cider over the mixture; reduce heat to medium-low and bring to a simmer; allow to reduce to about half its original volume. Stir in the chicken stock; simmer over medium-low heat for about 20 minutes.\nPuree the soup in small batches in a blender, or use an immersion blender. If using a blender, don't fill the blender more than half-way. Always remove the center lid piece of a stand blender when blending hot liquids so the steam can escape. Cover the hole with a dish towel while blending. Stir the nutmeg into the soup. Garnish each bowl with 1 tablespoon of sour cream and some of the bacon pieces to serve.\n",
        "picture_link": "COljWg26DPkVbBMGHNP4IfALX8sa/Ha"
    },
    {
        "title": "Slow Cooker Kielbasa Stew",
        "ingredients": [
            "2 pounds kielbasa sausage, cut into 1 inch pieces ADVERTISEMENT",
            "1 1/2 pounds sauerkraut, drained and rinsed ADVERTISEMENT",
            "2 Granny Smith apples - peeled, cored and sliced into rings ADVERTISEMENT",
            "3/4 onion, sliced into rings ADVERTISEMENT",
            "2 pounds red potatoes, quartered ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1/2 teaspoon caraway seeds ADVERTISEMENT",
            "1/2 cup shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place half the sausage in a slow cooker, and top with the sauerkraut. Cover with the remaining sausage, apples, and onion. Top with the potatoes. Pour chicken broth over all, and sprinkle with caraway seeds.\nCover, and cook on High 4 hours, or until potatoes are tender. Top each serving with Swiss cheese.\n",
        "picture_link": "kLmmt.HmzP6mVCnWyQsovN/XUXh4gdi"
    },
    {
        "title": "Diabetic Dog Treats",
        "ingredients": [
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 pounds beef liver, cut into pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Line a 10x15 inch jellyroll pan with parchment paper.\nPlace the liver into a food processor. Pulse until finely chopped. If you have room, add the flour and eggs, and process until smooth. Otherwise, transfer to a bowl, and stir in the flour and eggs using a wooden spoon. Spread evenly in the prepared pan.\nBake for 15 minutes in the preheated oven, or until the center is firm. Cool, and cut into squares using a pizza cutter. The treats will have a consistency similar to a sponge. Store in a sealed container in the refrigerator.\n",
        "picture_link": "oPqZOb9WXiZI.BAX7chTdGe.RKUZufq"
    },
    {
        "title": "Teriyaki Sauce",
        "ingredients": [
            "2/3 cup soy sauce ADVERTISEMENT",
            "1/4 cup cooking sherry ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine soy sauce, sherry, sugar, ginger, and garlic.\n",
        "picture_link": "MER0cEbRFDugIhjZCEaAmP4Wdj5yWgy"
    },
    {
        "title": "Slow Cooker Bean Casserole AKA Sweet Chili",
        "ingredients": [
            "1/2 cup ketchup ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 (16 ounce) can baked beans with pork ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker, mix together ketchup, molasses, mustard, pork and beans, salt, and pepper.\nCook bacon and bell pepper in a large skillet over medium heat for about 5 to 7 minutes, then add to the slow cooker. In same skillet, brown beef, and stir into the slow cooker.\nCover, and cook on High setting for 1 hour.\n",
        "picture_link": "ahrfryZMv4nTeeGlUayKA.dY2RLRyM2"
    },
    {
        "title": "Chicken Vegetable Barley Soup",
        "ingredients": [
            "1 cup slivered almonds ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "4 cups sliced fresh mushrooms ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "5 cups diced red potatoes ADVERTISEMENT",
            "3 cups chopped cooked chicken ADVERTISEMENT",
            "2 1/2 quarts chicken broth ADVERTISEMENT",
            "1 cup quick-cooking barley ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spread slivered almonds evenly over a baking sheet. Toast in preheated oven until golden brown and fragrant.\nHeat the oil in a large stock pot over medium heat. Cook onions, celery, mushrooms, and garlic in oil until onions are tender.\nStir in carrots, potatoes, chicken, and broth. Bring to a boil, then stir in barley. Reduce heat, cover, and simmer 20 minutes.\nRemove from heat, and stir in butter, parsley, and toasted almonds. Season with salt and pepper to taste.\n",
        "picture_link": "/biihghAVY2oxO0khMSMCkvSyzyOR4i"
    },
    {
        "title": "Nany's White Cake",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 8 or 9 inch round cake pans.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, mixing well after each addition. Combine the flour, baking powder and salt; stir into the batter alternately with the milk. Stir in vanilla. Distribute batter evenly between the prepared pans.\nBake for 25 to 30 minutes in the preheated oven, until the cake springs back when pressed gently in the center. Cool in pans over a wire rack. When completely cooled, frost or fill as desired.\n",
        "picture_link": "k9aStrSId.xsJ5e2V9qwSR50rB/qIF6"
    },
    {
        "title": "Roasted Pork Tenderloin",
        "ingredients": [
            "2 pounds pork tenderloin ADVERTISEMENT",
            "1/2 teaspoon ground sage ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "1 (32 ounce) jar sauerkraut, drained ADVERTISEMENT",
            "1/2 apple ADVERTISEMENT",
            "1/2 onion ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nRub tenderloin with sage and garlic salt. Place tenderloin in a baking pan or casserole. Cover meat with half of the sauerkraut. Place the apple and onion, cut side down, on top of the sauerkraut. Cover with remaining sauerkraut. Sprinkle with brown sugar.\nCover and bake in preheated oven for 2 to 3 hours, until the internal temperature has reached 145 degrees F (63 degrees C).\n",
        "picture_link": "xcKQx55wqgaBnTXQn5xVhzlGWzQdRXu"
    },
    {
        "title": "Green Bean and Portobello Mushroom Casserole",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 pound baby portobello mushrooms, sliced ADVERTISEMENT",
            "1/2 medium onion, chopped ADVERTISEMENT",
            "3 cloves garlic, finely chopped ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup with roasted garlic ADVERTISEMENT",
            "3/4 teaspoon seasoned salt with no MSG ADVERTISEMENT",
            "1/3 teaspoon white pepper ADVERTISEMENT",
            "2 (15.5 ounce) cans French cut green beans, drained ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nPlace bacon in a large skillet over medium-high heat, and fry until crisp. Remove from the skillet to drain on paper towels. Pour olive oil into the skillet, and reduce heat to medium. When oil is hot, add mushrooms and onion; cook, stirring frequently until the onions start to become translucent. Add garlic, and fry for a couple of minutes, just until fragrant. Stir in the mushroom soup and almonds, and bring to a boil. Season with seasoned salt and white pepper, and crumble in the bacon. Gently stir in the green beans, then transfer the mixture to a casserole dish.\nBake uncovered for 30 minutes in the preheated oven. Remove from the oven, and sprinkle Cheddar cheese over the top. Return to the oven for 5 minutes, or until cheese is melted. Let stand 5 minutes before serving.\n",
        "picture_link": "0PGzQSpIEyvzyoeGVIeyjF/Y9Oe3hpG"
    },
    {
        "title": "Easy Grilled Tri Tip",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 cloves garlic, peeled and chopped ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "4 pounds beef tri tip, cut into 1/2 inch slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, non-reactive bowl, blend the soy sauce, olive oil, water, garlic, and pepper. Place the beef tri tip in the marinade. Cover, and marinate in the refrigerator at least 4 hours.\nPreheat an outdoor grill for high heat, and lightly oil grate.\nGrill the beef slices 3 to 5 minutes per side, or to desired doneness. Discard remaining marinade.\n",
        "picture_link": "SymKDqXk8ErwG5iAtscKBymBnuDDg7m"
    },
    {
        "title": "Garlic Prawns",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 orange, juiced ADVERTISEMENT",
            "1 teaspoon dried basil, or to taste ADVERTISEMENT",
            "2 tablespoons white wine (optional) ADVERTISEMENT",
            "30 tiger prawns, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a glass dish, mix together the olive oil, mustard, garlic, lemon juice, orange juice, basil and white wine. Add the prawns, and stir to coat. Cover, and let marinate for 1 hour.\nHeat an outdoor grill to high heat.\nThread prawns onto skewers. Grill for 3 to 5 minutes, turning once, until pink.\n",
        "picture_link": "Fb5Gk6Wa3y/y7qk8nJeScUcWX9nzKTW"
    },
    {
        "title": "Rainbow Veggie Chili",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 zucchini, sliced ADVERTISEMENT",
            "1 yellow squash, sliced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 fresh jalapeno pepper, diced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes, with liquid ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (15 ounce) can chili beans in spicy sauce, undrained ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium-high heat. Stir in zucchini, yellow squash, red bell pepper, green bell pepper, jalapeno, garlic, and onion. Cook 5 minutes, just until tender.\nMix tomatoes with liquid, tomato paste, black beans, corn, and chili beans in spicy sauce into the pot. Season with chili powder, oregano, black pepper, and cayenne pepper. Bring to a boil. Reduce heat to low and simmer 1 hour, stirring occasionally.\n",
        "picture_link": "X65o61TtJUI9xwcoAkhupOmzssXlDe2"
    },
    {
        "title": "Pineapple Upside Down Cupcakes",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "24 maraschino cherries ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple ADVERTISEMENT",
            "1 (18.25 ounce) package pineapple cake mix (such as Duncan Hines® Pineapple Supreme) ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/3 cups pineapple juice ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon confectioners' sugar for dusting, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Move an oven rack into the middle of the oven. Preheat oven to 350 degrees F (175 degrees C).\nSpray 24 muffin cups with cooking spray.\nLine a work surface with waxed paper.\nSpoon 1 teaspoon melted butter into the bottom of each sprayed muffin cup.\nSpoon 1 tablespoon brown sugar in each muffin cup.\nPress a maraschino cherry into the center of the brown sugar in each muffin cup.\nSpoon a heaping tablespoon of crushed pineapple over the cherry and compact it with the back of a spoon into an even layer.\nMix pineapple cake mix, eggs, pineapple juice, and vegetable oil in a large bowl with electric mixer on low speed until moistened, about 30 seconds. Turn mixer speed to medium and mix for 2 minutes.\nPour pineapple cake batter into the muffin cups, filling them to the top; do not overfill.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, about 20 minutes.\nAllow cupcakes to cool at least 5 minutes before inverting muffin cups onto the waxed paper to release. Serve with pineapple and cherry sides up. Sprinkle cupcakes lightly with confectioners' sugar.\n",
        "picture_link": "dpIbAS0LDV6ugoZLJE2KkrbW74DAjcy"
    },
    {
        "title": "Pork Loin Stuffed with Spinach",
        "ingredients": [
            "1/2 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1/3 cup dry bread crumbs ADVERTISEMENT",
            "3 pounds pork tenderloin ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 tablespoons teriyaki sauce ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSaute spinach, butter, onions and garlic over medium heat until soft. Add bread crumbs. Cut tenderloin in half lengthwise. Stuff with spinach mixture and secure with kitchen twine.\nIn a bowl, mix ketchup, orange juice and teriyaki sauce. Baste tenderloin with 1/2 of the mixture. Sprinkle pork with cumin. Place in shallow roaster and bake at 350 degrees uncovered for one hour. Baste with reserved marinade and cook one more hour covered. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "VkGFoZyei4GjqJpH1hAGOL0TbLhRbkG"
    },
    {
        "title": "Honey Mustard Tofu",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 pound firm tofu, sliced into 1/4 inch slices ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "2 cubes vegetable bouillon ADVERTISEMENT",
            "4 tablespoons prepared mustard ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a medium skillet over medium-high heat. Dredge tofu slices in flour and place in hot butter. Brown slightly, then turn over and brown the other side. Add water, wine and bouillon cubes; simmer for 10 minutes, or until bouillon completely dissolves. Stir in mustard and honey. Simmer until thickened.\n",
        "picture_link": "5S8UMfC24roh3QQ1H0CgLhun4lNX4Ve"
    },
    {
        "title": "Pasta Melanzana",
        "ingredients": [
            "3/4 cup bow tie (farfalle) pasta ADVERTISEMENT",
            "1 medium eggplant, peeled and cubed ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, finely chopped ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3 cups fresh spinach, chopped ADVERTISEMENT",
            "3 tablespoons fresh lemon juice ADVERTISEMENT",
            "salt and pepper ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "cracked black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Keep warm.\nMeanwhile, heat the olive oil and butter in a skillet over medium heat. Add the garlic; cook and stir until softened. Mix in the eggplant. Let the eggplant cook for 5 minutes without stirring. Then stir and cook until tender, about 5 more minutes.\nMix in the spinach and season with salt, and pepper. Cook, stirring occasionally, for 3 minutes. Stir in the drained pasta and lemon juice along with 1/2 cup Parmesan cheese. Transfer to a serving dish and top with remaining cheese and cracked black pepper.\n",
        "picture_link": "uQR4HWBZv1j2r5A.cuH9/NHwcf4Msee"
    },
    {
        "title": "Seared Scallops with Jalapeno Vinaigrette",
        "ingredients": [
            "1 large jalapeno pepper, seeded and membranes removed ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 teaspoon Dijon mustard ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "12 large fresh sea scallops ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "2 oranges, peeled and cut in between sections as segments ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place jalapeno, rice vinegar, olive oil, and Dijon mustard in a blender. Puree on high until mixture is completely liquefied, 1 to 2 minutes. Season with salt and black pepper to taste.\nSeason scallops with sea salt and cayenne pepper. Heat vegetable oil in a skillet over high heat. Place scallops in skillet and cook until browned, 2 to 3 minutes per side. Transfer to a plate. Garnish scallops with orange segments and drizzle jalapeno vinaigrette over the top.\n",
        "picture_link": "cZE6w.karXRMKNi98j8O69ZPzNY1H6."
    },
    {
        "title": "Sausage Egg Muffins",
        "ingredients": [
            "1/2 pound ground pork sausage ADVERTISEMENT",
            "12 eggs, beaten ADVERTISEMENT",
            "1/2 (4 ounce) can chopped green chile peppers, drained ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 12 muffin cups.\nPlace sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain and set aside.\nIn a large bowl, combine eggs, chiles, onion, garlic powder, salt pepper and sausage; mix well. Spoon 1/4 cup of sausage mixture into each prepared muffin cup.\nBake in preheated oven for 15 to 20 minutes, until egg has set and a toothpick inserted into each 'muffin' comes out clean.\n",
        "picture_link": "5AOnXWlNapSfYlSnNnT5BAXvQz2nila"
    },
    {
        "title": "Fat Free Refried Beans",
        "ingredients": [
            "2 cups canned black beans, divided ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "3/4 cup diced onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl mash 2/3 cup of beans to a smooth paste.\nIn a medium saucepan over medium heat, combine the remaining beans with the water. When heated through, stir in garlic, pepper, salt and liquid smoke.\nStir the bean paste into the whole beans and mix well. Stir in the onion and cook for 10 minutes, or until onions are slightly cooked.\n",
        "picture_link": "eXnycQdtqNxyC243b3d3hhsrA5ZNOIK"
    },
    {
        "title": "Bleu Cheese Macaroni",
        "ingredients": [
            "2 cups uncooked elbow macaroni ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 cup sliced green bell pepper ADVERTISEMENT",
            "1/2 cup sliced red bell pepper ADVERTISEMENT",
            "3/4 cup heavy cream ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1 cup crumbled blue cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain.\nMeanwhile, in a medium saucepan over medium heat combine butter, salt, pepper and bell peppers. Simmer until heated through. Stir in cream, flour, yogurt, bleu cheese and Parmesan cheese.\nStir cooked macaroni into cheese mixture and serve hot.\n",
        "picture_link": "PNpYDhbnM19qeTjFIh0PZ23zCFRwHA2"
    },
    {
        "title": "Virginia Apple Pudding",
        "ingredients": [
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups chopped, peeled apple ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a small baking dish, combine butter, sugar, flour, baking powder, salt, and milk until smooth.\nIn a microwave-safe bowl, combine apples and cinnamon. Microwave until apples are soft, 2 to 5 minutes. Pour apples into the center of the batter.\nBake in the preheated oven 30 minutes, or until golden.\n",
        "picture_link": "FHnAXRnIiy385OBjGP/8TvRuD9P.EEe"
    },
    {
        "title": "Haddock Au Gratin",
        "ingredients": [
            "2 pounds haddock fillets ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground dry mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2/3 cup heavy cream ADVERTISEMENT",
            "2/3 cup half-and-half cream ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly butter a medium or large baking dish.\nRinse and dry fillets. Season with 1 teaspoon salt and 1/8 teaspoon pepper.\nIn a skillet or frying pan, melt butter over medium heat. Saute onion in butter until golden. Stir in flour until completely incorporated. Stir in mustard, 1/2 teaspoon salt, light and heavy creams. Cook until thickened, stirring constantly. Remove from heat and stir in cheeses. Pour sauce over fish and sprinkle with paprika.\nBake in preheated oven for 30 minutes, until brown and bubbly.\n",
        "picture_link": "0dqriuteDTN43CoyOW.TJLSTmQxaSy."
    },
    {
        "title": "Old Fashioned Stuffing",
        "ingredients": [
            "30 slices white bread, lightly toasted ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "2 stalks celery, finely chopped ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "2 teaspoons rubbed sage ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Allow the toasted bread to sit approximately 24 hours, until hard.\nPreheat oven to 325 degrees F (165 degrees C). Lightly grease a 9x13 inch baking dish.\nCrush the bread into crumbs with a rolling pin. Place the crumbs in a large bowl.\nMelt the butter in a medium saucepan over medium heat. Stir in the onion and celery and slowly cook until soft. Remove from heat and drain.\nMix the eggs and chicken broth into the bread crumbs. The mixture should be moist, but not mushy. Use water, if necessary, to attain desired consistency. Mix in the onion, celery, rubbed sage, garlic powder, salt and pepper.\nPress the mixture into the baking dish. Bake 1 hour in the preheated oven, or until the top is brown and crisp.\n",
        "picture_link": "IDKrHon8mioARusf/Xk0p88AzHcwL/."
    },
    {
        "title": "Skillet Chicken Cordon Bleu",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "4 whole boneless, skinless chicken breast, cubed ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/2 cup shredded Swiss cheese ADVERTISEMENT",
            "1/2 cup diced ham ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 10 inch skillet over medium high heat cook the chicken breasts in the butter for 10 minutes or until browned. Remove chicken and set aside.\nIn the same skillet add the wine and stir to deglaze the pan. Add the soup, cheese and ham. Heat to boiling, stirring often.\nReturn chicken to skillet. Reduce heat to low. Cover and cook for 5 to 7 minutes or until chicken is completely cooked, stirring occasionally. Serve over hot cooked egg noodles if desired.\n",
        "picture_link": "SjSfEwgxfYTilchIyaB7CrsqIGfH19e"
    },
    {
        "title": "Tangy Chicken Breasts",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup Worcestershire sauce ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup lemon juice ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in a single layer in a bowl or pan. Mix together Worcestershire sauce, oil, lemon juice, and garlic; pour over chicken. Cover. Refrigerate for at least 6 hours.\nTake chicken out of marinade, and place on broiler pan or grill. Broil until done, approximately 7 minutes on each side.\n",
        "picture_link": "iEudNWenYc3H.4pNDwILkU9otHo1Efy"
    },
    {
        "title": "Richard's Chicken Breasts",
        "ingredients": [
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup Marsala wine ADVERTISEMENT",
            "1 cup chopped portobello mushrooms ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "4 slices mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season flour with poultry seasoning. Dredge the chicken breasts in the seasoned flour. Melt the butter with the oil in a medium skillet over medium-high heat, fry the chicken in the hot butter mixture for about 5 minutes each side, depending on the thickness. Remove the chicken and set aside (keep warm.)\nDeglaze pan with Marsala wine (deglazing is swirling or stirring a liquid in a pan to dissolve cooked food particles remaining on the bottom). Add the chopped mushrooms, chopped onions and rosemary. Saute for 5 minutes over high heat.\nReturn the chicken breasts to the skillet, baste with drippings, put cheese on the breasts and cook for another 2 1/2 minutes with the lid on tightly. Don't touch the lid! Remove from heat and let stand for 10 minutes, until the breasts cook through. Check the seasoning and adjust. You will have the plumpest, juiciest chicken breasts you can imagine!\n",
        "picture_link": "6mm1oMO7BRf8WiPnyyCiDSNGnbLQfTu"
    },
    {
        "title": "Cajun Style Burgers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "3 tablespoons dry bread crumbs ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "4 slices Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nIn a medium bowl, mix the ground beef, bread crumbs, egg, green onions, 1 tablespoon Cajun seasoning, and mustard. Form into 4 patties.\nIn a small bowl, blend the barbeque sauce and 1 teaspoon Cajun seasoning.\nLightly oil the grill grate, and cook the patties 5 minutes per side, or until well done. Place a slice of cheese on each burger, and allow to melt. Serve with seasoned barbeque sauce.\n",
        "picture_link": "zHiknlomMOQKW6jrpjOEEDC3HBz/Dt6"
    },
    {
        "title": "Noodles Alfredo",
        "ingredients": [
            "1 (8 ounce) package wide egg noodles ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook noodles according to package directions.\nMeanwhile, heat butter or margarine and cream in a small saucepan over low heat until butter or margarine is melted. Stir in cheese, parsley, and salt and pepper; keep warm over low heat.\nDrain pasta. Toss with sauce to coat.\n",
        "picture_link": "BZjnMz/j5uu7wuvH/wOXd1XfMPrWRj."
    },
    {
        "title": "Tandy Cake",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 1/4 cups peanut butter ADVERTISEMENT",
            "2 pounds milk chocolate candy bar, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10x15 inch pan. Sift together the flour and baking powder; set aside.\nIn a large bowl, combine eggs, sugar and vanilla. Beat on high speed of an electric mixer until light and lemon-colored. Beat in the flour mixture. Microwave milk and margarine about 2 minutes, or until it begins to bubble. Stir into batter.\nPour batter into 10x15 inch pan. Bake in the preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the cake comes out clean.\nWhen cake is cool, plop peanut butter all over and spread evenly to the edges. Refrigerate to set, about 1 hour.\nIn a microwave safe dish, melt chocolate and spread evenly over peanut butter layer. Refrigerate to allow chocolate to harden.\n",
        "picture_link": "w2rWPGCgtS1tg/ptGEKPGN2.uESsb26"
    },
    {
        "title": "Cheese Enchiladas",
        "ingredients": [
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 teaspoons Creole-style seasoning ADVERTISEMENT",
            "1 (12 ounce) package corn tortillas ADVERTISEMENT",
            "1 (8 ounce) package Cheddar cheese, shredded, divided ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 (6 ounce) can sliced ripe olives ADVERTISEMENT",
            "1 (6 ounce) can sliced mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl combine tomato sauce, tomato paste and Creole-style seasoning.\nWarm tortillas in microwave, or in oven; dip them in the tomato sauce mixture and lay them in a 9x13 inch casserole dish. Fill each tortilla with cheese, onion, olives and mushrooms; roll. Repeat until dish is full. Sprinkle a small amount of cheese on top.\nBake in preheated oven for 25 to 30 minutes, or until cheese is melted and bubbly.\n",
        "picture_link": "wnPzb8WKTmgpf1XOZcSDYuT08eTQl6y"
    },
    {
        "title": "Bannock",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure flour, salt, and baking powder into a large bowl. Stir to mix. Pour melted butter and water over flour mixture. Stir with fork to make a ball.\nTurn dough out on a lightly floured surface, and knead gently about 10 times. Pat into a flat circle 3/4 to 1 inch thick.\nCook in a greased frying pan over medium heat, allowing about 15 minutes for each side. Use two lifters for easy turning. May also be baked on a greased baking sheet at 350 degrees F (175 degrees C) for 25 to 30 minutes.\n",
        "picture_link": "41sk0zUz3neTjQK.B7Muto7/ccyer1."
    },
    {
        "title": "German Lentil Soup",
        "ingredients": [
            "2 cups dried brown lentils, rinsed and drained ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup cooked, cubed ham ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "5 drops hot pepper sauce ADVERTISEMENT",
            "1/4 teaspoon caraway seed ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lentils in a 5 to 6 quart slow cooker. Add chicken stock, bay leaf, carrots, celery, onion, and ham. Season with Worcestershire sauce, garlic powder, nutmeg, hot pepper sauce, caraway seed, celery salt, parsley, and pepper.\nCover, and cook on Low for 8 to 10 hours. Remove bay leaf before serving.\n",
        "picture_link": "1m/dEO/G3Qr1h4DjCCFD9UD7BOcDfDC"
    },
    {
        "title": "Brownies III",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, beat the eggs and vegetable oil together until well blended. Combine the flour, sugar, cocoa powder, baking powder and salt; stir into the egg mixture. Fold in walnuts if desired. Spread evenly into the prepared pan.\nBake in the preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the brownies comes out clean. Allow to cool. Cut into squares.\n",
        "picture_link": "g7kMB71NhFKzlIqfEHv/.78CKmJEsCS"
    },
    {
        "title": "Chicken and Dumplings II",
        "ingredients": [
            "1 (4 pound) whole chicken ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 cubes chicken bouillon ADVERTISEMENT",
            "1 pinch poultry seasoning ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "1 dash garlic powder ADVERTISEMENT",
            "1 pinch dried sage ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 1/2 cups chopped celery ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "2 potatoes, cubed ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped tomatoes ADVERTISEMENT",
            "1 (10.75 ounce) can condensed chicken broth ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups buttermilk baking mix ADVERTISEMENT",
            "1/8 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium high heat, combine the chicken, water, bouillon, poultry seasoning, thyme, garlic powder, sage and salt and pepper. Bring to a boil, reduce heat to low and allow to simmer. Add the onion, celery, carrots, potatoes, green bell pepper and tomatoes, cover pot and allow to simmer for one hour, or until vegetables are tender and chicken is done.\nIn a separate small bowl, combine the flour, buttermilk baking mix, parsley, ground black pepper and milk. Mix together well and form into little balls. Drop these balls into the simmering soup. Simmer for 5 more minutes.\nRemove chicken, debone, take off skin, chop the chicken meat and return to pot. Heat through and serve.\n",
        "picture_link": "Tj0VvLheBDhehxxKVY5oy6F72RSgB6m"
    },
    {
        "title": "Pineapple Crisp",
        "ingredients": [
            "2 (20 ounce) cans crushed pineapple, drained ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread well-drained pineapple into a 9x9 inch square baking pan.\nIn a medium bowl, mix together flour, sugar, baking powder, salt and egg until smooth. Spoon mixture evenly over pineapple. Pour melted butter over mixture and then sprinkle with cinnamon.\nBake in preheated oven for 40 to 45 minutes. Serve hot or cold.\n",
        "picture_link": "LlYHcPBUNDBCDNmLxQwZvGE1z.r3Msu"
    },
    {
        "title": "Banana Butter Icing",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup mashed bananas ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 1/4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter, banana, lemon juice and vanilla. Slowly beat in confectioners' sugar, adding more if needed to make a nice fluffy, spreadable icing. Makes about 2 1/3 cups.\n",
        "picture_link": "gSpoN4yO907ePQ7OwQcc6r213J9PfUK"
    },
    {
        "title": "Very Fruity Rum Punch",
        "ingredients": [
            "1 1/2 cups rum ADVERTISEMENT",
            "1/3 cup banana liqueur ADVERTISEMENT",
            "1 dash grenadine syrup ADVERTISEMENT",
            "1 (6 ounce) can frozen orange juice concentrate ADVERTISEMENT",
            "1 (6 ounce) can frozen pineapple juice concentrate ADVERTISEMENT",
            "1 orange, sliced into rounds ADVERTISEMENT",
            "1 lime, sliced into rounds ADVERTISEMENT",
            "1 lemon, sliced into rounds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large punch bowl, prepare the orange and pineapple juice according to package directions. Stir in the rum, banana liqueur and Grenadine. Float slices of orange, lime and lemon on top.\n",
        "picture_link": "RwqzdIe68rlzB0jA/rWSRWaIT7L0EOO"
    },
    {
        "title": "Old-World Cabbage Soup",
        "ingredients": [
            "1/2 medium head cabbage, chopped ADVERTISEMENT",
            "4 large carrots, cubed ADVERTISEMENT",
            "1 sweet onion, minced ADVERTISEMENT",
            "4 stalks celery, cubed ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "1 1/2 cups tomato-vegetable juice cocktail ADVERTISEMENT",
            "3 cups vegetable broth ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chopped cabbage into an 8-quart soup pot.\nMicrowave diced carrot in 2 tablespoons water for 6 minutes on high.\nMicrowave diced celery in 2 tablespoons water for 4 minutes on high.\nAdd the microwaved vegetables to the pot. Add minced sweet onion, celery, and ketchup. Add juice cocktail, vegetable broth, chicken broth, and tomatoes. Fill each can with water, and add the water to the mixture. Cover, and bring to a boil. Continue boiling for 30 minutes.\nReduce heat to simmer and cook for 2 to 3 hours.\nServe with slices of a French baguette. Have salt, black pepper, and Tabasco available to season to taste at the table.\n",
        "picture_link": "TDui3lbGoy668g6VUO3ei0V49U7r06a"
    },
    {
        "title": "Aunt Gail's Oatmeal Lace Cookies",
        "ingredients": [
            "1 cup unsalted butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the butter and sugar until light and fluffy. Stir in the vanilla and almond extracts. Sift together the flour, baking soda, and salt; stir into the butter mixture. Finally, mix in the rolled oats.\nRoll dough into balls about 1 inch in diameter. Place the dough balls about 3 inches apart onto the prepared cookie sheet. Dip the bottom of a glass in water and then in sugar, use this to flatten down the cookies. Sugar the glass as needed. Bake for 8 to 10 minutes, cookies should be slightly browned. Store in an airtight container.\n",
        "picture_link": "JzyQwlcpO0kC3jQAN1MvoGQqx.htkrS"
    },
    {
        "title": "Skyline Chili I",
        "ingredients": [
            "2 1/2 pounds lean ground beef ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 1/3 (6 ounce) cans tomato paste ADVERTISEMENT",
            "5 tablespoons chili powder ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion salt ADVERTISEMENT",
            "2 teaspoons steak sauce ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown the beef lightly.\nPlace all the ingredients in a crock pot and mix together well. Cook for 12 hours or more on low.\n",
        "picture_link": "E8doTATzCKkamdQXlOUO111aHwyVMmO"
    },
    {
        "title": "Squash and Zucchini Casserole",
        "ingredients": [
            "2 medium yellow squash ADVERTISEMENT",
            "2 large zucchini ADVERTISEMENT",
            "1 Vidalia onions, thinly sliced ADVERTISEMENT",
            "2 large tomatoes, sliced ADVERTISEMENT",
            "2 cups grated Romano cheese ADVERTISEMENT",
            "1/2 cup butter, divided ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCut the zucchini and squash into long, thin layers. Lightly grease a 7x11-inch baking dish and layer the squash, zucchini, onion and tomatoes into the baking dish. Sprinkle with cheese and add pats of butter between each layer of vegetables, and season each layer with salt and ground black pepper to taste.\nContinue this layering process until all the vegetables are used up and top this off with the remaining butter and cheese.\nCover and bake at 375 degrees F (190 degrees C) for 20 to 30 minutes, or until vegetables are to desired tenderness and cheese is melted and bubbly.\n",
        "picture_link": "rRjRqj2ONpzzZlai75.kylRKNfzAKf2"
    },
    {
        "title": "Leftover Pot Pie",
        "ingredients": [
            "2 cups leftover turkey, chopped or shredded ADVERTISEMENT",
            "2 cups turkey gravy ADVERTISEMENT",
            "2 cups mixed vegetables ADVERTISEMENT",
            "2 (9 inch) unbaked pie shells ADVERTISEMENT",
            "2 tablespoons cornstarch (optional) ADVERTISEMENT",
            "1/4 cup water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIf you are using stock, bring the stock to a boil. Add cornstarch to cold water, and blend until smooth; whisk into stock to thicken.\nLine a 9 inch pie plate with pastry. Mix turkey and vegetables together, and place in pie crust. Pour gravy or thickened stock over turkey and vegetables. Cover with remaining pie crust. Cut slits in the top to release steam.\nPlace pot pie on a cookie sheet to prevent stock from over flowing into your oven. Cook in center of oven until crust is golden brown, approximately 1 hour. Slice, and serve hot.\n",
        "picture_link": "pAuG4EAEOt31mogxZzL6TBmDPaVx8Ua"
    },
    {
        "title": "Spaetzle I",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, combine flour, eggs and salt. Add water a little at a time to form a soft dough.\nBoil 2 quarts of water in a large pot. Squeeze dough out into the water using noodle or fruit press or by pressing through a colander with large holes. When noodles float to the top of the water, they are done (3 to 4 minutes). Serve as a side or main dish.\n",
        "picture_link": "4tLUgBTr.ci9tqe2XMGjsD9V1df5tj2"
    },
    {
        "title": "Cocoa Quickies",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "6 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup shredded coconut (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the milk, butter, sugar, and cocoa in a medium sized saucepan, and bring to a full rolling boil. Boil for one minute. Remove from heat, and stir in oats. Mix in coconut, if desired. Drop by teaspoonfuls onto waxed paper. Let stand until set. Quickies may be refrigerated to speed setting.\n",
        "picture_link": "KV0n.TaQxeoZBltqy60A0iim5Phcu/a"
    },
    {
        "title": "Christmas Creamy Egg Nog",
        "ingredients": [
            "4 egg yolks ADVERTISEMENT",
            "1 (5 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 1/2 cups milk ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1 fluid ounce rum ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, beat egg yolks until they are thickened and light. Gradually stir in condensed milk, sugar, vanilla and milk. Beat the egg whites until stiff, then add them to the milk mixture. Stir rum into the mixture (to taste). Garnish with nutmeg.\n",
        "picture_link": "u9W95Y9758.HCnsRifMJmhHB0AVhQeu"
    },
    {
        "title": "Cajun Corn and Crab Bisque",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 large celery stalk, minced ADVERTISEMENT",
            "Cajun seasoning to taste ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 1/2 cups frozen corn kernels ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1 teaspoon liquid shrimp and crab boil seasoning ADVERTISEMENT",
            "1 pound fresh lump crabmeat ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "Additional chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a small saucepan over medium heat; then gradually whisk in the flour. Cook 5 to 7 minutes, whisking constantly, until a golden roux forms; set aside.\nHeat the oil in a Dutch oven over medium heat. Combine the onion, garlic, and celery and cook 1 minute. Add the Cajun seasoning to taste. Stir in the broth, corn, and bay leaf. Bring to a simmer, then pour in the milk, cream, and liquid crab boil. When the mixture begins to simmer, reduce heat to low and simmer 7 minutes. Stir in the roux, 1 tablespoon at a time, blending thoroughly. Continue to cook, on low heat, whisking until mixture thickens. Stir in crabmeat, green onions, and Worcestershire sauce. Simmer 6 to 8 minutes more. Season with salt and pepper to taste.\n",
        "picture_link": "MegzQAfIIZBMqNA2h8v6Tr6Vu1EUQhi"
    },
    {
        "title": "Creamy Artichoke Pasta",
        "ingredients": [
            "12 ounces uncooked spaghetti ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 (6 ounce) can marinated artichoke hearts ADVERTISEMENT",
            "1 small onion ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 cup low-fat cottage cheese ADVERTISEMENT",
            "1/2 cup low-fat sour cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add spaghetti and cook until al dente. Drain and keep warm.\nWhile pasta is cooking, heat a large skillet over medium-high heat. Place olive oil, butter, and liquid from artichoke hearts in skillet. Cut artichoke hearts into bite-size pieces. When olive oil mixture is hot, add onion and garlic. Saute until soft and lightly browned. Stir in artichoke hearts and saute until heated through. Season with salt, black pepper, cayenne pepper, and oregano. Remove from heat and stir in cottage cheese and sour cream. Toss mixture with cooked pasta and top with Parmesan cheese.\n",
        "picture_link": "rM/D8cnl3lhUVTYQAxD0VXi1MKl.GKm"
    },
    {
        "title": "Pumpkin Butter I",
        "ingredients": [
            "1 (29 ounce) can canned pumpkin puree ADVERTISEMENT",
            "3/4 cup apple juice ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pumpkin, apple juice, spices, and sugar in a large saucepan; stir well. Bring mixture to a boil. Reduce heat, and simmer for 30 minutes or until thickened. Stir frequently.\nTransfer to sterile containers and chill in the refrigerator until serving.\n",
        "picture_link": "KIMdJJkcOeZ.qUFd/2OYvQRnMhYAsy6"
    },
    {
        "title": "Garlicky Beet Delight",
        "ingredients": [
            "6 medium beets ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash the beets and boil until tender, about 45 minutes (or 20 minutes in a pressure cooker). Remove the skins by running cold water over the boiled beets, and then slipping of their skins. Slice the beets and toss with the olive oil, vinegar, garlic, and salt.\n",
        "picture_link": "jZMKQRLDWmdubEL9DJm4EP.jPCXrcBi"
    },
    {
        "title": "Jam Thumbprints",
        "ingredients": [
            "2/3 cup butter ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 egg whites, lightly beaten ADVERTISEMENT",
            "3/4 cup finely chopped walnuts ADVERTISEMENT",
            "1/3 cup strawberry preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease cookie sheets, or line with parchment paper.\nIn a large bowl, cream together butter and sugar until light and fluffy. Beat in egg yolks, vanilla, and salt. Gradually mix in flour.\nShape dough into 3/4 inch balls. Dip in lightly beaten egg whites, then roll in finely chopped walnuts. Place 1 inch apart on prepared cookie sheets. Press down center of each with thumb.\nBake for 15 to 17 minutes, or until golden brown. Cool on baking sheet for 5 minutes, then remove to a wire rack to cool completely. Just before serving, fill centers of cookies with strawberry preserves.\n",
        "picture_link": "m5GqXY35Y1YxmFn8QvQR/.TxtCFg1T."
    },
    {
        "title": "Almond Chicken Salad",
        "ingredients": [
            "4 green onions, thinly sliced ADVERTISEMENT",
            "1 large carrot, shredded ADVERTISEMENT",
            "1 red bell pepper, cut into 1/2 inch pieces ADVERTISEMENT",
            "1/2 pound sugar snap peas, halved ADVERTISEMENT",
            "2 cups chopped, cooked chicken breast meat ADVERTISEMENT",
            "1/2 cup fresh cilantro leaves ADVERTISEMENT",
            "1/2 cup blanched slivered almonds, toasted ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 1/2 tablespoons sesame oil ADVERTISEMENT",
            "1 tablespoon teriyaki sauce ADVERTISEMENT",
            "1 tablespoon ground dry mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the onions, carrot, red pepper, peas, chicken, cilantro and almonds. Set aside.\nIn a small bowl, whisk together the sugar, vinegar, sesame oil, teriyaki sauce and dry mustard until smooth. Pour over salad mixture and toss until coated. Serve in pita pockets or on a bed of lettuce.\n",
        "picture_link": "blp6OfBvkwAL593kE31PZYwCZfVGfmW"
    },
    {
        "title": "Scallops Mascarpone",
        "ingredients": [
            "1 (16 ounce) package medium seashell pasta ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 (10 ounce) package sliced fresh button mushrooms ADVERTISEMENT",
            "1 bunch asparagus, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1 pound scallops, rinsed and patted dry ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 (8 ounce) container mascarpone cheese ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 7 to 9 minutes, until al dente.\nMelt 6 tablespoons of butter with the olive oil in a large skillet over medium heat. Mix in the parsley and garlic and cook for a couple of minutes until fragrant. Add the mushrooms and asparagus and season with salt, pepper and onion powder; cook, stirring occasionally until asparagus is tender, about 5 minutes depending on the thickness. Place the scallops in the pan, and cook briefly on each side until lightly browned and the center is cooked through, about 3 minutes per side. Remove from the heat when scallops are just finished.\nMeanwhile, in a small saucepan, combine the milk, mascarpone cheese and remaining butter. Cook over medium heat, stirring, until sauce is warm and butter is completely melted and blended in. Stir this sauce into the scallops and vegetables along with the pasta and serve immediately.\n",
        "picture_link": "M3XZbJ4eqFrr0MShjxki2iG4ztsmQK2"
    },
    {
        "title": "Crunchy Turkey Salad",
        "ingredients": [
            "1 cup cooked, cubed turkey meat ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 tart apples, cored and cubed ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon prepared Dijon-style mustard ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the turkey, celery, apples and walnuts.\nPrepare the dressing in a small bowl by whisking together the sour cream, mayonnaise, parsley, lemon juice, honey, mustard, salt and pepper. Pour over turkey mixture and toss to evenly coat. Refrigerate until chilled.\n",
        "picture_link": "MUT4YiUamE3KoW32L6ySZJZmIguAmne"
    },
    {
        "title": "Chutney Chicken",
        "ingredients": [
            "12 chicken thighs ADVERTISEMENT",
            "1 (12 ounce) jar hot chutney ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl, combine chutney and dry soup mix. Mix together. Season chicken pieces with salt and pepper to taste. Place seasoned chicken pieces in a 9x13 inch baking dish and pour chutney mixture over chicken.\nBake in the preheated oven for 45 to 60 minutes, or until chutney sauce has turned brown and crunchy.\n",
        "picture_link": "MaPpS0.TkMpxqNud/0R0kK9bwbw1TxW"
    },
    {
        "title": "Chicken Thigh and Dumpling Stew",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 pounds chicken thighs ADVERTISEMENT",
            "8 slices bacon ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "3 carrots, chopped ADVERTISEMENT",
            "1 red onion, finely chopped ADVERTISEMENT",
            "3 cloves garlic, finely chopped ADVERTISEMENT",
            "1 (14 ounce) can vegetable broth ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 (26 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (8.75 ounce) can sweet corn, drained ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (10 ounce) can buttermilk biscuits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium-high heat, melt the butter and cook the chicken thighs until the meat is just cooked through. Remove the chicken pieces from the skillet and allow to cool. Using forks, pull meat from the bones and cut into small pieces or shred. Set aside.\nMeanwhile, in a medium skillet, cook the bacon over medium heat until nicely browned and crispy. Remove strips from bacon grease and drain on a paper towel. Crumble the drained and cooled bacon and set aside. Reserve 1 tablespoon of the bacon drippings.\nScrape the chicken drippings from the large skillet into a large stock pot or Dutch oven. Cook the celery, carrots, red onion, and garlic over medium heat until the red onions are soft and transparent. Add the vegetable broth, chicken, and 1 tablespoon reserved bacon grease. Simmer over medium heat for 12 minutes, then stir in paprika, heavy cream, cream of chicken soup, and water. Heat through, stirring regularly, about 5 minutes. Stir in the sweet corn and ground pepper.\nTear each buttermilk biscuit into quarters and drop into the chicken stew. Reduce heat to medium-low; stir occasionally until dough is cooked though, forming dumplings at the top of the stew, about 10 minutes. Remove from heat and serve with a garnish of crumbled bacon.\n",
        "picture_link": "S5TjNMAr11X0PDBlEiAOOuYV/MQhGQC"
    },
    {
        "title": "Easter Eggs",
        "ingredients": [
            "2 pounds confectioners' sugar ADVERTISEMENT",
            "1/4 pound margarine, softened ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "12 ounces peanut butter ADVERTISEMENT",
            "1 pound flaked coconut ADVERTISEMENT",
            "4 cups semisweet chocolate chips ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine sugar, margarine, cream cheese and vanilla extract. Divide the batter in half and place each half of the batter in a bowl on its own. Stir peanut butter into one of the bowls and coconut into the second.\nUsing your hands, mold the dough into egg-shapes and arrange the forms on cookie sheets. Place the eggs in the freezer until frozen.\nOnce the eggs have frozen, melt the chocolate and shortening in the top of a double-boiler. Dip the eggs into the chocolate until coated. Place the eggs on wax paper lined cookie sheets and return to the freezer to harden. After the chocolate has hardened the eggs can be kept in the refrigerator.\n",
        "picture_link": "MXx5H5gsWzPS5ERdrNOmS6taQ6r0oTS"
    },
    {
        "title": "Peanut Butter Cornflake Crunch Bars",
        "ingredients": [
            "1 cup light corn syrup ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup smooth peanut butter ADVERTISEMENT",
            "10 cups cornflakes cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook syrup and sugar until mixture comes to a boil. Stir constantly; do not overcook.\nRemove from heat, add peanut butter, and stir until smooth. Pour mixture over cornflakes in a large bowl. Mix until cereal is thoroughly coated.\nSpread in a buttered 9 x 13 inch pan and press down lightly with buttered hands. When cool, cut into squares.\n",
        "picture_link": "EZUycg4/y020nSdv28ZuG/Tzp6rjMFq"
    },
    {
        "title": "Fry Sauce",
        "ingredients": [
            "1/3 cup ketchup ADVERTISEMENT",
            "2/3 cup mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ketchup and mayonnaise together in a small bowl until thoroughly blended.\n",
        "picture_link": "i8.APnPCppybgJVmBRWqTmU/q5Dpv66"
    },
    {
        "title": "Danish Kringle",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups brown sugar ADVERTISEMENT",
            "1 1/2 cups chopped English walnuts, divided ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cut 1 cup butter into flour until crumbly, leaving pea-sized chunks. Stir in sour cream, and mix well; dough will be very sticky. Form dough into a ball. Cover tightly, and refrigerate 8 hours, or overnight.\nPreheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet. Prepare the filling by combining 1 cup butter, brown sugar, and 1 cup chopped walnuts.\nDivide dough into three equal parts; return two parts to the refrigerator to keep cold. Quickly form 1/3 of the dough into a rectangle, and flour lightly. On a heavily floured surface, roll out to approximately 12x17 inches. Position lengthwise on the work surface. Along the long edges of the dough rectangle, use a sharp knife to cut 4 inch long angled lines about 1/2 inch apart. Spoon 1/3 of the filling along the length of the rectangle's uncut center. Alternating from one side of the dough to the other, fold each 1/2 inch wide strip towards the center, crisscrossing the filling in a braid-like fashion. Lightly press together the ends of the strips to seal. Sprinkle with 1/3 of the remaining walnuts. Repeat with remaining ingredients to form 3 braided danishes. Arrange danishes on prepared baking sheet.\nBake for 30 minutes in the preheated oven, or until golden brown. Cool for approximately 30 minutes. While the danishes are cooling, prepare the icing: mix confectioners sugar and water until smooth. Drizzle in fine streams over warm danishes.\n",
        "picture_link": "hQ2i0.185cdqFQTSComo5os1uXUXXoC"
    },
    {
        "title": "Honey Lemon Tea",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "1 teaspoon white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water into a mug. Add honey and heat in the microwave for 1 minute and 30 seconds. Stir in lemon juice, mixing until honey is dissolved, then stir in the sugar.\n",
        "picture_link": "HD9QDfFcX/CmdoHhf0UV2DxCfWRaCjq"
    },
    {
        "title": "Chicken Pepper Steak",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 boneless, skinless chicken breasts ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/2 cup soy sauce, divided ADVERTISEMENT",
            "1 large onion, cut into long slices ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "4 roma (plum) tomatoes, seeded and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Season chicken with salt and onion powder, and place in skillet. Cook for about 5 to 7 minutes, then add the garlic, 4 tablespoons soy sauce, and half of the sliced onion. Cook until chicken is no longer pink, and the juices run clear.\nDissolve cornstarch in water in a small bowl, and blend into the chicken mixture. Stir in 4 tablespoons soy sauce, bell pepper, tomatoes, and remaining onion. Simmer until gravy has reached desired consistency.\n",
        "picture_link": "rjdnkw7kdUFhz8dqOK66AsWzdEjOmRq"
    },
    {
        "title": "Halibut Weaver",
        "ingredients": [
            "2 pounds halibut ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace halibut in a baking dish. In a medium bowl, mix together mayonnaise, shredded Cheddar cheese, shredded Jack cheese, dill, and mustard. Spread cheese mixture over halibut. Sprinkle more dill on top if you like.\nBake in preheated oven for 30 minutes, or until fish is done, and cheese is golden brown and bubbly.\n",
        "picture_link": "54E3K4wmmCPwc9Q2nIu3G7gOIjovGtS"
    },
    {
        "title": "Aunt Joyce's Chocolate Cake",
        "ingredients": [
            "3 (1 ounce) squares unsweetened chocolate, chopped ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups warm water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Melt the chocolate in a double boiler or in the microwave.\nPour the melted chocolate into a large mixing bowl. Blend in the mayonnaise, vinegar and vanilla. Combine the flour, sugar, baking soda, and salt and gradually stir into the chocolate mixture. Slowly stir in the warm water. Pour batter into prepared pan.\nBake in the preheated oven for 30 to 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "bUTa.kkagE8BOs//RZ4g3hEUQdcGeXq"
    },
    {
        "title": "German Lasagna",
        "ingredients": [
            "9 lasagna noodles ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 pound kielbasa ADVERTISEMENT",
            "1 (20 ounce) can sauerkraut, drained ADVERTISEMENT",
            "8 ounces shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a blender or with an electric mixer, blend mushroom soup, cream of chicken soup and milk until smooth. Cut sausage in half lengthwise and slice thinly.\nIn a 9x13 inch dish, layer 1 cup soup mixture, 3 noodles, half the sauerkraut, half the sausage and a third of the cheese. Repeat. Top with remaining 3 noodles and remaining soup mixture. Cover with foil.\nBake in preheated oven 25 minutes, then uncover and bake 15 minutes more. Sprinkle with remaining cheese when still hot.\n",
        "picture_link": "YvlL.0JW1fE/njlWe5dHApajilebCmG"
    },
    {
        "title": "Banana Pudding II",
        "ingredients": [
            "2 eggs, beaten ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "32 vanilla wafers ADVERTISEMENT",
            "4 bananas, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a double boiler over simmering water, combine eggs, milk, sugar, cornstarch and salt. Stir constantly and cook until thick, about 15 minutes. Remove from heat and stir in vanilla and margarine.\nPlace a layer of vanilla wafers in a glass serving dish. Top with half the bananas. Top with half the pudding. Repeat. Serve immediately or refrigerate until serving.\n",
        "picture_link": "KijNxlL0DmhI1Kwa4ZfXUHrZ8jPLv/y"
    },
    {
        "title": "Cheesy Vegetable Chowder ",
        "ingredients": [
            "7 cups water ADVERTISEMENT",
            "9 cubes chicken bouillon, crumbled ADVERTISEMENT",
            "6 potatoes, cubed ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 large white onion, chopped ADVERTISEMENT",
            "1 bunch celery, chopped ADVERTISEMENT",
            "3 cups chopped carrots ADVERTISEMENT",
            "2 (15 ounce) cans whole kernel corn ADVERTISEMENT",
            "2 (15 ounce) cans peas ADVERTISEMENT",
            "2 cups chopped fresh green beans ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 pound processed cheese, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, combine water, bouillon, potatoes and garlic. Bring to a boil, then stir in onion, celery and carrots. Reduce heat and simmer 15 minutes.\nStir in corn, peas and green beans and continue to cook on low heat.\nMeanwhile, in a medium saucepan over medium heat, melt butter. Whisk in flour all at once to form a roux and let cook 10 seconds. Whisk in milk, a little at a time, and cook, stirring, until mixture is thick and bubbly. Stir in cheese until melted. Pour this mixture into the large soup pot, stir well and heat through.\n",
        "picture_link": "EoLYQJVi5S92EnNRG6yHISH0HU3ETPu"
    },
    {
        "title": "Skin-on Savory Mashed Potatoes",
        "ingredients": [
            "2 pounds unpeeled potatoes, cubed ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "2 teaspoons chopped garlic ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of lightly salted water to a boil. Add potatoes, and cook until tender, about 15 minutes.\nDrain potatoes, and transfer to a bowl. Add butter, and mash with a potato masher or electric mixer until potatoes are starting to become smooth. Add milk and sour cream, and mix to your desired texture. Careful not to over mix the potatoes once they are creamy. Season with garlic, basil, salt and pepper.\n",
        "picture_link": "bPtOtAZIn5Vr2hHoqnbMg9RpdKnUvkW"
    },
    {
        "title": "Santa Fe Rice Salad",
        "ingredients": [
            "2/3 cup uncooked white rice ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "3/4 cup black beans, drained and rinsed ADVERTISEMENT",
            "1 large tomato, seeded and diced ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/3 cup sliced green onions ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/4 cup vinegar ADVERTISEMENT",
            "1 tablespoon diced jalapeno peppers ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 avocado - peeled, pitted and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. Remove from heat and chill.\nIn a large bowl, mix together the rice, beans, tomato, cheese and green onion.\nIn a small bowl, whisk together the oil, vinegar, peppers, sugar and salt. Pour over the rice mixture and toss to coat. Cover and refrigerate salad for 30 minutes. Top with avocado just before serving.\n",
        "picture_link": "RzXooyrR1QF2ME3KBUboEmM674tVVbW"
    },
    {
        "title": "Parmesan Potatoes",
        "ingredients": [
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "10 potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bag combine Parmesan cheese, flour, salt and pepper; mix well. Place potatoes in bag and shake to coat.\nPour butter into a 9x13 inch baking dish. Stir in potatoes.\nBake in preheated oven for 1 1/2 hours, stirring occasionally.\n",
        "picture_link": "54aGIeuHy/3yRVG0FG6Y61A2i4oN5.2"
    },
    {
        "title": "Turkey Pot Pie III",
        "ingredients": [
            "2 (9 inch) unbaked pie shells ADVERTISEMENT",
            "1 (10.75 ounce) can condensed golden mushroom soup ADVERTISEMENT",
            "1 cup cooked, chopped turkey meat ADVERTISEMENT",
            "1 (10 ounce) can mixed vegetables, drained ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place one pie crust in an ungreased pie dish.\nIn a medium bowl, mix the mushroom soup and milk. Stir in the turkey meat and mixed vegetables. Pour the mixture into the pie crust in the dish. Top with the other pie crust, and seal the crust edges by crimping with a wet fork.\nBake in the preheated oven 45 minutes, or until the crust is golden brown\n",
        "picture_link": "Hk6ISlEKvxY3JEtmZevPUMzPjwjuOiW"
    },
    {
        "title": "Corn, Sausage and Pepper Chowder",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 pound red potatoes, cut into chunks ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "3 1/2 cups whole kernel corn ADVERTISEMENT",
            "4 ounces kielbasa, halved and sliced ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, melt butter. Cook onion, garlic, and bell peppers in butter until tender, 10 to 15 minutes. Stir in broth, potatoes, pepper and cumin and bring to a boil. Reduce heat and simmer 20 minutes, until potatoes are tender.\nPlace half the corn in a blender or food processor and puree until smooth. Stir pureed corn, remaining whole corn, kielbasa, milk and cream into soup. Simmer 20 minutes more.\n",
        "picture_link": "SrgdXCYkl/jC13QCr3zkOlJvxNi0aIi"
    },
    {
        "title": "Meatloaf with Italian Sausage",
        "ingredients": [
            "1 1/4 pounds ground beef ADVERTISEMENT",
            "4 (4 ounce) links Italian sausage, casings removed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 small green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup dry hot wheat cereal ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nChop sausage finely. In a large bowl combine beef, sausage, egg beat, bell pepper, onion, cereal, milk, Worcestershire sauce, salt and pepper. Mix together and press into a loaf pan.\nBake in the preheated oven for 1 hour, or until cooked through. Drain grease from loaf pan periodically during baking. Let stand 10 minutes before serving.\n",
        "picture_link": "kvZAdUtGmjc3vMu2plSsvbx/52LWb7y"
    },
    {
        "title": "Quick Poached Salmon with Dill Mustard Sauce",
        "ingredients": [
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/4 cup Dijon mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "3 tablespoons chopped fresh dill ADVERTISEMENT",
            "1 pound salmon ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup chopped shallots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, blend the plain yogurt, Dijon mustard, honey, lemon juice, and dill. Cover, and refrigerate until serving.\nIn a medium saucepan over medium heat, place the salmon in the white wine and water. Adjust the amount of water as necessary to just cover the fish. Sprinkle with shallots. Cover the saucepan, and cook 10 to 12 minutes, until salmon is easily flaked with a fork. Drain, and serve with the yogurt sauce.\n",
        "picture_link": "7WiOnU9e/pXOzhCyOz0uo7LIOubZf4O"
    },
    {
        "title": "Cosmopolitan",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger vodka ADVERTISEMENT",
            "1/2 fluid ounce cointreau ADVERTISEMENT",
            "1 teaspoon fresh lime juice ADVERTISEMENT",
            "1 1/2 fluid ounces cranberry juice ADVERTISEMENT",
            "1 twist lime zest, garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour all the ingredients into a shaker with lots of ice. Shake vigorously for several seconds and strain into a cocktail glass. Garnish with a lime twist.\n",
        "picture_link": "ZXljB1R.9WqTtA9x.zIXrGET/VOYQ1a"
    },
    {
        "title": "Bone-In Ham Cooked in Beer",
        "ingredients": [
            "20 pounds bone-in ham ADVERTISEMENT",
            "1 (20 ounce) can sliced pineapple ADVERTISEMENT",
            "2 (12 fluid ounce) cans beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease an 18 quart roasting pan.\nPlace the ham, with the fattier side up, in the roaster. Use toothpicks to secure pineapple rings on the ham. Pour the beer over the ham. Place lid on roasting pan.\nBake 6 to 8 hours, or until cooked through.\nRemove the pineapple rings and let sit 15 minutes before slicing.\n",
        "picture_link": "Yy4nKtoKnfzJxbbOn3Gm3vwK2wzI0Zi"
    },
    {
        "title": "Shortbread Crust",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream butter and confectioners' sugar until light and fluffy. Stir together flour and baking powder; blend into butter mixture. Pat into a 9 inch pie plate.\nBake in preheated oven for 12 to 15 minutes, or until edges are lightly browned.\n",
        "picture_link": "9vFvtBmHDta7//MgSlwUnYVTpUhkwi6"
    },
    {
        "title": "Southern Butter Rolls",
        "ingredients": [
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 tablespoons active dry yeast ADVERTISEMENT",
            "1 1/2 cups cold water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together flour, sugar, salt, and instant yeast. Mix in shortening. Mix in water.\nTurn out onto a lightly floured surface. Knead by hand for 20 minutes. Cover dough with oil. Place dough in a bowl, cover, and proof for 1 hour.\nForm rolls, and place on a greased baking tray. Proof for 45 minutes.\nBake at 400 degrees F (205 degrees C) for 12 to 14 minutes.\n",
        "picture_link": "TqogbrwxO4VCxfiYpNq8MaCcpc3broq"
    },
    {
        "title": "Zucchini Apple Bread",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "2 cups peeled, chopped zucchini ADVERTISEMENT",
            "1 cup chopped, peeled apple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 - 9x5 inch loaf pans.\nIn a large bowl, combine eggs, white sugar, brown sugar, oil and vanilla until well blended. In a separate bowl, combine flour, baking soda, salt and cinnamon. Stir flour mixture into egg mixture. Fold in walnuts, zucchini and apple. Pour into prepared pans.\nBake 1 hour, or until top springs back when touched lightly in center. Let cool in pans 10 minutes before removing to wire rack to cool completely.\n",
        "picture_link": "Ca1xRFb8fw/pxonCgS5czAEaqVL4hjC"
    },
    {
        "title": "Simple Chicken Gravy",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup water, or as needed ADVERTISEMENT",
            "1 (3 pound) roasted chicken (drippings from chicken) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add water to the chicken drippings to make about 1 1/2 cups of liquid in the bottom of the roaster.\nWhisk water into the flour until it is thick, but not pasty. Whisk the flour/water mixture into the drippings, and put the roaster on the stove over medium heat. Stir constantly until mixture is thickened and bubbly. Add salt and pepper to taste.\n",
        "picture_link": "1Z0ApIBwC.tKFQK/WMo0omWWPHHavIm"
    },
    {
        "title": "Nauvoo Gingerbread Cookies",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup molasses ADVERTISEMENT",
            "3/4 cup lard ADVERTISEMENT",
            "1/2 cup hot water ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the sugar, molasses, lard, and hot water until smooth. Stir in eggs. Combine the flour, baking soda, salt, cinnamon and ginger; stir into the batter to make a soft dough. Add more flour if needed. Cover the bowl and refrigerate dough for at least 1 hour, or until firm.\nPreheat the oven to 350 degrees F (175 degrees C). Roll out the dough to 1/4 inch thickness on a floured surface. Cut into desired shapes using cookie cutters. Place cookies onto ungreased baking sheets.\nBake for 10 minutes in the preheated oven, or until cookies appear dry in the center.\n",
        "picture_link": "Qf2sW0sZ9sBWg2WGwI6SgDwTnHc6oQi"
    },
    {
        "title": "Cucumber Raita",
        "ingredients": [
            "2 hot house cucumber - peeled, seeded and thinly sliced ADVERTISEMENT",
            "2 cups Greek yogurt ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons chopped fresh mint ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the cucumber, yogurt, lemon juice, mint, sugar, and salt in a bowl. Cover and refrigerate at least 3 hours, preferably overnight.\n",
        "picture_link": "IxlM9Hxwjk.zJ5grGOt5NBT4t7gaFB6"
    },
    {
        "title": "Easy Creamy Peppercorn Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breasts ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1 packet peppercorn gravy mix ADVERTISEMENT",
            "1 onion, sliced into thin rings ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C).\nPlace cleaned chicken breasts in a 9 x 13 inch glass baking dish or casserole dish. Arrange the sliced onion pieces evenly on top of the chicken pieces. Scoop the mushroom soup onto the chicken and onions. Mix the peppercorn gravy with water and pour it over the soup, onions and chicken.\nCover the dish and bake for 1 hour, stirring the chicken and mixture after 30 minutes. If desired, serve over rice or with mashed potatoes.\n",
        "picture_link": "iwSluxIWutTCKUXuFyzYwoEgywi8KRi"
    },
    {
        "title": "Chicken Creole with Chile Cream Sauce",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "2 teaspoons Creole or Cajun seasoning ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Chicken Soup (Regular or 98% Fat Free) ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "1 teaspoon lime juice ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "Hot cooked regular long-grain white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken with Creole seasoning.\nHeat oil in skillet. Add chicken and cook until browned.\nAdd soup, water, chiles and lime juice. Heat to a boil. Cook over low heat 5 minutes or until done.\nStir in sour cream and heat through. Serve over rice.\n",
        "picture_link": "yfAvdB4PfC5xN1j7l1pa9y3XtQwOEom"
    },
    {
        "title": "Oatmeal Sourdough Rolls",
        "ingredients": [
            "1 cup sourdough starter ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 cup quick cooking oats ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in bread machine pan in the order recommended by the manufacturer. Select the Dough Cycle, then press Start.\nWhen the cycle is complete, transfer dough to a lightly floured surface and divide into 24 rolls. Cover with a towel and let rolls rise until doubled, about 1 hour.\nPreheat oven to 400 degrees F (200 degrees C). Lightly grease a large baking sheet.\nArrange the rolls on the prepared baking sheet, and bake 10 to 12 minutes in the preheated oven, until lightly browned.\n",
        "picture_link": "3V0fpTeX7fvm9akuav5Nga9o1LkmB1G"
    },
    {
        "title": "Bats and Cobwebs",
        "ingredients": [
            "1 (8 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 small onion, chopped (optional) ADVERTISEMENT",
            "1 (28 ounce) jar pasta sauce ADVERTISEMENT",
            "8 ounces mozzarella cheese, cut into 1/2 inch cubes ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nFill a large pot with lightly salted water, bring to a rolling boil over high heat. Stir in the bow tie pasta and return to a boil. Boil pasta, stirring occasionally, until cooked through but still firm to the bite, about 12 minutes. Drain well.\nCook and stir ground beef and onion in a large skillet until beef is no longer pink, about 5 minutes. Drain fat. Stir in pasta sauce and bring to a boil. Reduce heat to simmer.\nStir cooked pasta and half of the mozzarella cheese into the sauce; toss to combine. Transfer to a 2-quart baking dish. Top with remaining mozzarella and Parmesan cheese.\nBake in preheated oven until lightly browned and bubbly, 15 to 20 minutes.\n",
        "picture_link": "ofa9/LyHKgaC5zsS8sIIxcZRRzNi5y."
    },
    {
        "title": "Crab Alfredo",
        "ingredients": [
            "8 ounces dried fettucine ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "1 (4 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "8 ounces crabmeat, flaked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Keep warm and covered.\nMeanwhile, melt the butter in a large saucepan over medium heat. Add the minced garlic and cook until garlic releases its aroma, about 2 minutes, being careful not to let the garlic brown. Stir in the flour, salt, pepper, and cayenne pepper. Reduce heat, and cook, stirring constantly for about 2 minutes. Add the half-and-half and stir over medium heat until slightly thickened, about 3 minutes.\nAdd the cream cheese and Parmesan cheese to the sauce and stir until cheeses melt and mixture is smooth. Mix in the crabmeat and continue cooking until crabmeat is heated through, about 3 minutes.\nDivide the fettucine between 2 plates or bowls and top with the crab sauce.\n",
        "picture_link": "O3BQiUCo0cg78nIxTTwokeIn48yGdmy"
    },
    {
        "title": "Grilled Sweet Potatoes with Apples",
        "ingredients": [
            "2 large sweet potatoes, sliced ADVERTISEMENT",
            "1 apple - peeled, cored and thinly sliced ADVERTISEMENT",
            "ground cinnamon to taste ADVERTISEMENT",
            "white sugar to taste ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill.\nIn a bowl, toss the sweet potato and apple slices with the cinnamon and sugar. Divide the mixture into 4 portions, places each on a large piece of aluminum foil. Top each with an equal amount of butter. Tightly seal foil around each portion.\nPlace foil packets on the grill, and cook 40 minutes, turning every 5 to 10 minutes, until potatoes and apples are tender.\n",
        "picture_link": "MsPUYPilWY1vYGF725YaVLQT8K1Izca"
    },
    {
        "title": "Cabbage and Smoked Sausage Soup",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 pound smoked sausage, sliced ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 head cabbage, cored and coarsely chopped ADVERTISEMENT",
            "3 carrots, sliced ADVERTISEMENT",
            "3 stalks celery, sliced ADVERTISEMENT",
            "1/3 cup uncooked long grain white rice ADVERTISEMENT",
            "1 (15 ounce) can red beans, with liquid ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 teaspoon crushed dried thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a large pot over medium heat, and cook the onion until lightly browned. Place sausage in the pot, and pour in water. Mix in cabbage, carrots, celery, rice, beans, tomato sauce, and crushed tomatoes. Dissolve bouillon in the mixture. Season with salt, bay leaf, and thyme. Bring to a boil. Reduce heat to low, and cook at least 1 hour, until vegetables are tender and rice is cooked.\n",
        "picture_link": "z0XddnbPDlXcHJG/7Jg3BzL45/VeosS"
    },
    {
        "title": "Quick and Easy Stuffed Peppers",
        "ingredients": [
            "2 large red bell peppers, halved and seeded ADVERTISEMENT",
            "1 (8 ounce) can stewed tomatoes, with liquid ADVERTISEMENT",
            "1/3 cup quick-cooking brown rice ADVERTISEMENT",
            "2 tablespoons hot water ADVERTISEMENT",
            "2 green onions, thinly sliced ADVERTISEMENT",
            "1/2 cup frozen corn kernels, thawed and drained ADVERTISEMENT",
            "1/2 (15 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange pepper halves in a 9 inch square glass baking dish. Cover dish with plastic wrap. Poke a few holes in the plastic wrap for vents, and heat 4 minutes in the microwave, or until tender.\nIn a medium bowl, mix tomatoes and their liquid, rice, and water. Cover with plastic, and cook in the microwave for 4 minutes, or until rice is cooked.\nStir green onions, corn, kidney beans, and red pepper flakes into the tomato mixture. Heat in the microwave for 3 minutes, or until heated through.\nSpoon hot tomato mixture evenly into pepper halves, and cover with plastic wrap. Poke a few holes in the plastic to vent steam, and heat in the microwave 4 minutes. Remove plastic, sprinkle with mozzarella cheese and Parmesan cheese, and allow to stand 1 to 2 minutes before serving.\n",
        "picture_link": "WvQofWbarOMo2z3slfdIOQKkEWjNjGy"
    },
    {
        "title": "Best Oven Baked French Toast",
        "ingredients": [
            "1/2 cup butter, melted ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "12 slices sandwich bread ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat a 9x13-inch baking dish with melted butter. Spread any remaining melted butter over bottom of dish.\nSprinkle brown sugar and cinnamon evenly over melted butter.\nArrange bread in two layers over brown sugar mixture.\nBeat eggs, milk, and salt in a bowl; pour over bread.\nCover and refrigerate overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until golden brown, about 30 minutes.\n",
        "picture_link": "gp6D5qVKx6/.SMFgv2.VtaRB..ecfp."
    },
    {
        "title": "Cheesy Ramen Noodles",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 (3 ounce) package any flavor ramen noodles ADVERTISEMENT",
            "1 slice American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan. Add ramen noodles and cook 2 minutes until tender. Pour out water, then stir in seasoning packet and cheese to serve.\n",
        "picture_link": "2Waqf21cXNW5k6MsejYbpdVo8NF9bcG"
    },
    {
        "title": "Shrimp Salsa",
        "ingredients": [
            "1/2 pound salad shrimp ADVERTISEMENT",
            "2 roma (plum) tomatoes, diced ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "1/4 cup minced cilantro ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the salad shrimp, tomatoes, onion, cilantro, lime juice, salt, pepper, and garlic together in a large glass bowl. Cover with plastic wrap and refrigerate until the flavors combine, at least 1 hour. Serve cold.\n",
        "picture_link": "20lR3jWlRdKW3MycY37KB/kfa/fgdkK"
    },
    {
        "title": "Brownie In a Mug",
        "ingredients": [
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons cocoa powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sugar, flour, cocoa powder, and salt together in a mug. Add water and olive oil; stir until mixture is evenly moist.\nCook in microwave for 1 minute 40 seconds. Serve topped with ice cream.\n",
        "picture_link": "FaiTd.aKY0bXRXCc/NWjRKwSkQOr6P6"
    },
    {
        "title": "Southwest-Style Egg Rolls",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "8 cups fresh baby spinach ADVERTISEMENT",
            "1 cup frozen corn ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "6 ounces Monterey Jack cheese, shredded ADVERTISEMENT",
            "1 (14 ounce) package egg roll wrappers ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat. Stir in onions, and cook until tender. Stir in spinach, corn, black beans, and lime juice. Season with salt and cumin. Remove from heat, and stir in cheese.\nPlace 1/4 cup of filling in the center of each egg roll wrapper. Fold in the sides, and roll egg rolls; dampen the edges with a small amount of water to seal.\nIn a large heavy skillet, heat enough vegetable oil to cover egg rolls over medium-high heat. Working in batches, carefully place egg rolls in hot oil, and cook until golden brown. Remove to paper towels.\n",
        "picture_link": ".fX.Qfto4LTmHuYiMhlRv1cClUqRjq."
    },
    {
        "title": "Roasted Asparagus with Herbes de Provence",
        "ingredients": [
            "1 bunch fresh asparagus spears, trimmed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon dried Herbes de Provence ADVERTISEMENT",
            "sea salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nToss the asparagus with olive oil, Herbes de Provence, salt, and pepper. Spread the asparagus onto the baking sheet in a single layer.\nRoast in preheated oven until tender and lightly browned, about 12 minutes.\n",
        "picture_link": "zEdAfl7ECApy.kLwgaK5azkIhBorlwG"
    },
    {
        "title": "Apricot Pork Tenderloin",
        "ingredients": [
            "2 pounds pork tenderloin ADVERTISEMENT",
            "1/4 cup softened butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon ground thyme ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 (18 ounce) jar apricot preserves ADVERTISEMENT",
            "2 tablespoons honey, or to taste ADVERTISEMENT",
            "1/4 cup dry sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nSpread butter all over the pork tenderloin. Season with salt, pepper, and thyme. Combine garlic powder, apricot preserves, honey, and sherry in a separate bowl.\nRoast the pork in the preheated oven for 30 to 40 minutes. Remove the pork from the oven and brush with the apricot sauce. Return the pork to the oven. Continue roasting, basting occasionally with the remaining sauce, until the pork is no longer pink in the center, about 15 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "PIBFEkAbn0Grzq3MDyn6mo9g4ulOej2"
    },
    {
        "title": "Blue Cheese Dressing",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1/4 cup blue cheese, crumbled ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mixing bowl, combine mayonnaise, onion, garlic, parsley, sour cream, lemon juice, vinegar, and blue cheese. Season with salt and pepper to taste. Cover, and refrigerate for at least one hour before serving.\n",
        "picture_link": "GYkDiN/NJcg4mAiNTnE2amPCQW44Tp6"
    },
    {
        "title": "Pasta Primavera Sauce",
        "ingredients": [
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3/4 cup fresh broccoli florets ADVERTISEMENT",
            "3/4 cup thinly sliced carrots ADVERTISEMENT",
            "3/4 cup sliced onion ADVERTISEMENT",
            "1/2 cup zucchini chunks ADVERTISEMENT",
            "1/2 cup sliced green bell pepper ADVERTISEMENT",
            "1/2 cup red bell pepper, sliced ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 bay leaf ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot combine tomatoes, tomato paste, broccoli, carrots, onion, zucchini, green bell pepper, red bell pepper, garlic, bay leaves, olive oil, basil, rosemary, oregano, thyme, salt, pepper, sugar, and water. Heat to just boiling, cover and reduce heat to simmer. Cook until all vegetable are tender, approximately 45 minutes. Stir occasionally.\n",
        "picture_link": "4cnk1lS/vPUpOSgd6mbZhjxz6B/q.36"
    },
    {
        "title": "Savory Pork Stew",
        "ingredients": [
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "2 pounds cubed pork stew meat ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "2 tablespoons cornstarch, or as needed ADVERTISEMENT",
            "8 red potatoes ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 sweet onion, diced ADVERTISEMENT",
            "1 (11 ounce) can whole kernel corn ADVERTISEMENT",
            "1 (14 ounce) can stewed tomatoes ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat. Sprinkle pork on all sides with salt, pepper, and garlic powder, and lightly coat with cornstarch. Place pork in the skillet, and cook until lightly browned but not done. Transfer to a slow cooker. Place potatoes, green bell pepper, red bell pepper, onion, and corn in the slow cooker.\nIn a bowl, mix the tomatoes, cream of mushroom soup, milk, broth, and Italian seasoning. Pour into the slow cooker.\nCover, and cook 1 hour on High. Reduce heat to Low, and continue cooking at least 1 hour.\n",
        "picture_link": "OZVoVxghzrVBAOXH6KU2ImerTgm8zOi"
    },
    {
        "title": "Debbie's Amazing Apple Bread",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups apples, peeled and diced ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a loaf pan.\nBeat eggs, sugar, vegetable oil, and vanilla extract in a mixing bowl; add apples.\nMix flour, salt, baking powder, and cinnamon in a separate bowl; add to apple mixture and stir just until evenly combined into a thick batter. Pour batter into the prepared loaf pan.\nBake in the preheated oven for 45 minutes. Cover loaf pan with aluminum foil; continue baking until a toothpick inserted into the center comes out clean, about 15 minutes more. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "pRko4mbYuzpYXVlvU3SOwYtfzrD7/9S"
    }
]