[
    {
        "title": "Cranberry Oatmeal Cookies",
        "ingredients": [
            "10 tablespoons butter ADVERTISEMENT",
            "2/3 cup packed dark brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 2/3 cups whole wheat flour ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "2 cups chopped cranberries ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBlend butter and sugar until fluffy. Add eggs and vanilla and mix well. In a separate bowl sift flour, baking soda, and salt together. Stir into butter mixture. Stir in the oats. Fold in nuts and cranberries. Drop spoonfuls of cookie dough onto ungreased cookie sheets, spaced at least 2 inches apart. These cookies spread.\nBake 8 to 10 minutes in the preheated oven, until the edges are crisp and the centers appear dry. Cool on wire racks and enjoy.\n",
        "picture_link": "WhUlUxosDnh08Bp3cMw/h0CUepAg5.S"
    },
    {
        "title": "Stuffed Mushrooms Casino",
        "ingredients": [
            "24 large fresh mushrooms ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/3 cup chopped green onions ADVERTISEMENT",
            "1/3 cup sherry ADVERTISEMENT",
            "1 (16 ounce) can minced clams, drained with juice reserved ADVERTISEMENT",
            "3 cloves garlic, peeled and minced ADVERTISEMENT",
            "1/2 cup seasoned bread crumbs ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon Italian-style seasoning ADVERTISEMENT",
            "1/2 cup bacon bits ADVERTISEMENT",
            "1/3 cup grated Romano cheese ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 lemon - cut into wedges, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking sheet.\nRemove stems from mushrooms. Reserve and chop approximately 1/2. Arrange mushroom caps in a single layer on the prepared baking sheet so that the edges of the caps touch one another. Set aside.\nIn a small saucepan over medium heat, melt 1/2 cup butter. Place reserved, chopped mushroom stems in the pan, and slowly cook and stir until soft. Stir in the flour to coat mushroom stems. Mix in green onions, sherry, minced clams and 1/2 their reserved juice (discard remainder), garlic, bread crumbs, pepper, Italian-style seasoning and bacon bits. Continue cooking approximately 3 minutes, until all ingredients are well mixed. Remove from heat and stir in Romano cheese. Allow mixture to cool approximately 5 minutes.\nFill the mushroom caps generously with the mixture. Drizzle with melted butter.\nBake in the preheated oven 20 to 25 minutes, until lightly browned. Serve with lemon wedges.\n",
        "picture_link": "/u/X.tdU72oqzPA2YBM8ABYWeN2/P4K"
    },
    {
        "title": "Garlic Pickled Eggs",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "1 onion, sliced into rings ADVERTISEMENT",
            "1 cup distilled white vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "10 cloves garlic, peeled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a medium saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool and peel.\nPlace the eggs in a 1 quart jar with the onion rings.\nIn a medium saucepan, bring to a boil the vinegar, water, sugar and garlic. Remove from heat and allow to cool approximately 15 minutes.\nPour the vinegar mixture over the eggs and cover. Refrigerate 1 week before serving.\n",
        "picture_link": "Ey1GF8IvoK9/MNd88JBK3.vgvueu4eC"
    },
    {
        "title": "Spicy Vegetable Beef Soup",
        "ingredients": [
            "1 pound rump roast ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "1 (14 ounce) can stewed tomatoes ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables, thawed ADVERTISEMENT",
            "4 mushrooms, sliced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "6 ounces rotelle pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim fat from roast and cut into 1 inch cubes. Place meat in a large pot over medium heat with oil, onion and garlic and cook, stirring, until meat is browned and onion is tender. Pour in broth, tomatoes and water. Stir in mixed vegetables, mushrooms and celery. Season with oregano, thyme, basil, parsley and cayenne. Bring to a boil, then reduce heat, cover and simmer 75 minutes.\nStir in pasta and cook 10 minutes more, until pasta is tender.\n",
        "picture_link": "YNn.RVlClsosjjdIdxAppUvQ7jlG33e"
    },
    {
        "title": "Old-Fashioned Vegetable Soup",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 large carrots, diced ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, chopped, juice reserved ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "2 quarts beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, melt butter. Cook onion, carrots and celery until onion is translucent. Stir in tomatoes with their juice, salt, pepper, parsley, soy sauce, Worcestershire and paprika. Pour in beef broth. Bring to a boil, then reduce heat and simmer 30 minutes, until vegetables are tender and flavors are well blended.\n",
        "picture_link": "DAGjyiPBskxzmOz6AqiYzB65h.mCKc2"
    },
    {
        "title": "Gourmet Cheese Potatoes",
        "ingredients": [
            "10 pounds potatoes, quartered ADVERTISEMENT",
            "1/2 onion, grated ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed Cheddar cheese soup ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 1/2 cups sour cream ADVERTISEMENT",
            "1 pound processed cheese, cubed ADVERTISEMENT",
            "2 tablespoons butter, diced ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop.\nPlace potatoes and onions in a 9x13 inch casserole dish.\nIn a medium saucepan combine soup, milk, sour cream and processed cheese; heat until cheese is melted. Pour over potatoes. Dot with butter and covered with shredded cheese.\nBake in preheated oven for 1 hour.\n",
        "picture_link": "6WrBLZNHKTDpRjAxLlUd.fRBy1Ne0Z6"
    },
    {
        "title": "Lemon Chiffon Pudding",
        "ingredients": [
            "3 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "2/3 cup sugar ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, stir together the flour and sugar until well blended. Stir in butter until smooth. Gradually beat in the egg yolks, lemon juice and milk. In a clean glass or metal bowl, whip egg whites with an electric mixer until stiff but flexible peaks form. Fold egg whites into the lemon mixture. Transfer to a casserole dish.\nBake for 35 minutes in the preheated oven, or until set. Serve warm or chilled.\n",
        "picture_link": "1Mzgxgo5J9ygdv1m8/o/4DJ20OQegnC"
    },
    {
        "title": "Chocolate Shell Sauce",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2/3 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter and chocolate in a small saucepan over medium heat, or in the microwave. Stirring frequently. Serve over ice cream.\n",
        "picture_link": "scGtgWuKMGE3WWk65Cm12gF/iVOhXNG"
    },
    {
        "title": "Thai Hot and Sour Soup",
        "ingredients": [
            "3 cups chicken stock ADVERTISEMENT",
            "1 tablespoon tom yum paste ADVERTISEMENT",
            "1/2 clove garlic, finely chopped ADVERTISEMENT",
            "3 stalks lemon grass, chopped ADVERTISEMENT",
            "2 kaffir lime leaves ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - shredded ADVERTISEMENT",
            "4 ounces fresh mushrooms, thinly sliced ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 teaspoon chopped green chile pepper ADVERTISEMENT",
            "1 bunch fresh coriander, chopped ADVERTISEMENT",
            "1 sprig fresh basil, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, bring the chicken stock to a boil. Stir in the tom yum paste and garlic, and cook for about 2 minutes. Stir in the lemon grass and kaffir lime leaves. Place the chicken in the saucepan, and cook 5 minutes, or until no longer pink and juices run clear.\nMix in the mushrooms. Add the fish sauce, lime juice, and green chile pepper. Continue cooking until well blended. Remove from heat, and serve warm with the coriander and basil.\n",
        "picture_link": "iZg0AzR/c1oiecJiwusE/OFCS0bhOV2"
    },
    {
        "title": "Lemon Thyme Chicken Tenders",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "6 sprigs fresh thyme, leaves stripped and chopped ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pound chicken breast tenders ADVERTISEMENT",
            "olive oil-flavored cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the olive oil, garlic, chopped thyme, lemon zest, and lemon juice in a large mixing bowl. Season the chicken tenders with salt and pepper. Toss chicken with the olive oil mixture; allow to marinate for 5 minutes.\nSpray a non-stick skillet with cooking spray, and place over medium-high heat. Cook chicken tenders in the hot pan until lightly browned and cooked through, about 4 minutes per side.\n",
        "picture_link": "IBiPGBfPBI85eR74y7xgW4TXP9Xb9eC"
    },
    {
        "title": "S'More Bars II",
        "ingredients": [
            "1 1/2 cups butter, melted ADVERTISEMENT",
            "4 cups graham cracker crumbs ADVERTISEMENT",
            "6 (1.5 ounce) bars milk chocolate candy bars ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, mix together the melted butter and graham cracker crumbs. Press half of the graham cracker mixture into the bottom of the prepared pan. In the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, stirring frequently until smooth. Remove from heat and spread over the graham cracker layer. For easier spreading, refrigerate the crust while the chocolate is melting. Make a layer of marshmallows over the chocolate and top with the remaining graham cracker crumbs.\nBake for 15 minutes in the preheated oven, cool and cut into squares.\n",
        "picture_link": "TUE2EvlpRFmBY7vxIQlDFudsxJuqfwe"
    },
    {
        "title": "Carne Con Chilies",
        "ingredients": [
            "4 large boneless pork chops, fat trimmed and reserved ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1/2 teaspoon seasoning salt, or to taste ADVERTISEMENT",
            "1 lime, cut into 4 wedges ADVERTISEMENT",
            "10 tomatillos, husked and cut in half ADVERTISEMENT",
            "1 tomato, quartered ADVERTISEMENT",
            "2 jalapeno peppers, seeded and halved ADVERTISEMENT",
            "3 dried red chile peppers, chopped ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice pork chops into strips, and season with pepper, garlic powder and seasoning salt. Squeeze lime juice over pieces.\nHeat a skillet over medium heat. Add fat, and cook, stirring until pan is coated. Remove fat, and put the seasoned meat in the pan. Fry until browned, about 5 minutes.\nAt the same time, make the green sauce. Combine the tomatillos, tomato, jalapenos, and dried chilies in a saucepan. Bring to a boil, and cook until soft. Drain excess liquid, and transfer to a blender or food processor along with the garlic and salt. Blend until smooth.\nPour sauce over the meat in the pan, and simmer for 15 minutes to blend all of the flavors. Taste, and adjust salt and pepper if necessary.\n",
        "picture_link": "Ah0PYay9WQ8CbqdXLTSCPGc.rBeK8HK"
    },
    {
        "title": "Easter Basket Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (16 ounce) can white frosting ADVERTISEMENT",
            "2 drops green food coloring ADVERTISEMENT",
            "1/2 teaspoon water ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "1 (14 ounce) package candy-coated chocolate pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the cake mix and bake the cake in two 8 inch rounds according to package directions. Cool completely.\nCut a circle out of the center of one of the layers, leaving a ring that measures 1 1/2 inches from the outer to the inner edge. Place the uncut layer on a serving platter and frost the top. Place the ring layer on top of the frosted layer, and frost the sides and top of the basket. Decorate the sides and top by pressing candy pieces into the frosting.\nTo tint the coconut, combine water and green food coloring in a medium bowl. Stir in coconut with a fork until evenly tinted. Place green coconut grass in center of cake basket.\nTo make a handle, cut a piece of aluminum foil 8x16 inches. Fold in half lengthwise 4 times. Wrap with ribbon, securing the ends with tape. Insert ends of the handle into the cake top. Fill basket with Easter candy and goodies, if desired.\n",
        "picture_link": "au8T4aegXoetJa0hnFsJB3fHNtOrm.K"
    },
    {
        "title": "Quick Shrimp Scampi Pasta",
        "ingredients": [
            "8 ounces uncooked spaghetti ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups dry white wine ADVERTISEMENT",
            "2 pounds large shrimp, peeled and deveined ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large saucepan, melt butter and add white wine. Over medium heat, add shrimp and basil. Cook until pink all over; about 3 to 5 minutes. Serve over pasta.\n",
        "picture_link": "m0DOw50k/QvfQpmQdpNGp.NmDNXN/oy"
    },
    {
        "title": "Almond Buttercrunch Candy I",
        "ingredients": [
            "2 (11.5 ounce) packages milk chocolate chips, divided ADVERTISEMENT",
            "2 cups butter ADVERTISEMENT",
            "1 pound brown sugar ADVERTISEMENT",
            "1 cup blanched slivered almonds, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C). Grease a 14 x 18 inch cookie sheet.\nSprinkle one package of chocolate chips on prepared pan. Place in warm oven until chips melt, about 5 minutes. Remove from oven, and spread melted chocolate over bottom of pan; set aside.\nIn a large heavy saucepan over medium-high heat, combine butter and brown sugar. Stirring constantly, heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads. Immediately remove from heat. Stir in 3/4 cup slivered almonds and pour onto pan with melted chocolate; spread mixture evenly.\nSprinkle remaining package of chocolate chips over the almond layer. The heat from the almond layer will melt the chocolate chips; spread melted chocolate evenly. Sprinkle remaining 1/4 cup almonds over chocolate.\nCut into squares, or allow to harden in a solid sheet and break it apart like brittle. Cool completely before removing from pan.\n",
        "picture_link": "OVtcb15/gkkLlolM1AzkPgXudvLYXk."
    },
    {
        "title": "New York System Hot Wiener Sauce I",
        "ingredients": [
            "3 pounds ground beef ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "2 teaspoons dry mustard ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon onion salt ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/4 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "10 ounces ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground beef in a large, deep skillet. Cook over medium high heat until evenly brown; drain.\nMix the chili powder, dry mustard, allspice, nutmeg, onion salt, garlic salt, celery salt, ginger root, cumin, Worcestershire sauce, soy sauce and ketchup into the skillet. Simmer at least 1 hour, until a desirable consistency has been attained. Serve hot.\n",
        "picture_link": "Mk1GdIMd1HLy8IBUb9fcMyfo4C142IW"
    },
    {
        "title": "Quick and Easy Chicken and Tomato Pasta",
        "ingredients": [
            "1/2 (16 ounce) package angel hair pasta ADVERTISEMENT",
            "olive oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - chopped ADVERTISEMENT",
            "2 teaspoons garlic and herb seasoning blend ADVERTISEMENT",
            "1 (6 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 (8 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "2 (16 ounce) cans diced tomatoes ADVERTISEMENT",
            "freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Boil pasta for 8 to 10 minutes, or until al dente. Drain.\nHeat olive oil in a large skillet over medium high heat. Sprinkle chicken with seasoned salt, and cook for 2 to 3 minutes. Stir in drained black olives and mushrooms. Continue cooking, stirring occasionally, until chicken is golden brown. Strain chicken juices from pan, and reduce heat to low. Stir in tomatoes, cover, and simmer for 15 minutes.\nToss the pasta and chicken mixture together, sprinkle with Parmesan cheese, and serve.\n",
        "picture_link": "KAiwU/XRhsriOTYterhHVunjz184sQu"
    },
    {
        "title": "Apple Radish BBQ Ribs",
        "ingredients": [
            "4 pounds pork spareribs ADVERTISEMENT",
            "2 quarts apple juice ADVERTISEMENT",
            "3 cups barbecue sauce ADVERTISEMENT",
            "1/2 cup prepared horseradish ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ribs in a stock pot, and cover with apple juice. Bring to a boil, reduce heat, and simmer for 1 to 2 hours. Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together barbecue sauce, horseradish, Worcestershire sauce, and garlic salt. Stir in 3 tablespoons of the apple juice from the ribs.\nBrush underside of ribs with 1/3 of the sauce. Turn them over, and place in roasting pan. Brush tops with remaining sauce.\nBake in preheated oven for 25 to 35 minutes, brushing occasionally with sauce.\n",
        "picture_link": "kXkUa89G1ZKcIsnFyBrMOaSeqv4pMlS"
    },
    {
        "title": "Squash with Tomato and Feta Cheese",
        "ingredients": [
            "2 cups peeled and cubed acorn squash ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/4 green bell pepper, diced ADVERTISEMENT",
            "1 cup dry bread stuffing mix ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cracked black peppercorns ADVERTISEMENT",
            "1 sprig fresh rosemary ADVERTISEMENT",
            "2 tablespoons crumbled feta cheese ADVERTISEMENT",
            "2 roma (plum) tomatoes, thinly sliced ADVERTISEMENT",
            "cracked black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a medium casserole dish.\nIn a steamer basket over boiling water, steam the squash 10 minutes, or until tender. Remove from heat, and mash with a fork.\nIn a medium bowl, blend the eggs and heavy cream. Mix in the squash, 3/4 of the green onions, green bell pepper, dry stuffing mix, and Parmesan cheese. Season with salt and pepper. Transfer to the prepared casserole dish. Press the rosemary sprig into the center of the mixture. Top with feta cheese, tomato slices, and remaining green onions. Season with pepper.\nBake 45 minutes in the preheated oven, until lightly browned. Discard rosemary sprig before serving.\n",
        "picture_link": "vT5PhlWPQAejksv4ugdNasEZ/RIX1IW"
    },
    {
        "title": "Butternut Squash Sweet Potato Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 butternut squash - peeled, seeded, and cut into chunks ADVERTISEMENT",
            "1 sweet potato, peeled and cut into chunks ADVERTISEMENT",
            "1 carrot, peeled and chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "4 cups chicken stock, or as needed ADVERTISEMENT",
            "3 small sweet bell peppers, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium-high heat. Cook and stir butternut squash, sweet potato, carrot, celery, onion, and garlic in hot butter until lightly browned, about 5 minutes.\nPour chicken stock and sweet bell peppers into butternut squash mixture; bring to a boil. Reduce heat to low, cover, and simmer until squash and potato are tender, about 40 minutes.\nPour squash mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\nReturn pureed soup to pot and season with salt and black pepper.\n",
        "picture_link": "ZhM/mlQAJeuUw1E.NKTwX7C9X7MA7ru"
    },
    {
        "title": "Slow Simmer Beef Stew",
        "ingredients": [
            "2 pounds beef stew meat, cut into cubes ADVERTISEMENT",
            "1/2 cup all-purpose flour, or more as needed ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "8 cups beef broth, divided ADVERTISEMENT",
            "6 cups sliced carrots ADVERTISEMENT",
            "6 cups diced potatoes ADVERTISEMENT",
            "3 cups chopped celery ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine beef stew meat and flour in a resealable plastic bag; seal bag and shake to coat beef.\nMelt butter with olive oil in a large pot over high heat; add beef and season with seasoned salt. Cook and stir beef until seared on all sides 5 to 7 minutes. Stir onion into the beef; cook and stir until the onion is browned, about 5 minutes more.\nPour enough of the beef broth into the pot to cover the bottom; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add remainder of the beef broth; bring to a simmer before adding carrots, potatoes, celery, balsamic vinegar, Worcestershire sauce, parsley, basil, paprika, and garlic powder.\nBring liquid to a boil, reduce heat to low, and cook stew at a simmer until the meat and vegetables are very tender, 3 to 4 hours.\n",
        "picture_link": "KVGz1JihVMOlphdtVUU5SBMHIfEntyO"
    },
    {
        "title": "Southern Style Collard Greens",
        "ingredients": [
            "2 sweet onions, finely chopped ADVERTISEMENT",
            "2 smoked ham hocks ADVERTISEMENT",
            "4 cloves garlic, finely chopped ADVERTISEMENT",
            "3 (32 ounce) containers chicken broth ADVERTISEMENT",
            "3 (1 pound) packages collard greens, trimmed ADVERTISEMENT",
            "1/3 cup vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt, or to taste ADVERTISEMENT",
            "3/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine onions, ham hocks, and garlic in a stockpot; add chicken broth. Cook mixture over medium heat until meat is falling off the bone, about 2 hours.\nStir collard greens, vinegar, sugar, salt, and pepper into the broth mixture; cook until greens have reached desired tenderness, about 2 more hours.\n",
        "picture_link": ".cD9/zot9tYA0qU5jHILOtrS5UtAvA6"
    },
    {
        "title": "Easy 7-Up® Biscuits",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "4 1/2 cups baking mix (such as Bisquick ®) ADVERTISEMENT",
            "1 cup lemon-lime soda (such as 7-Up®) ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Put butter in a 9x13-inch baking dish and place dish in the preheating oven until butter is melted.\nMix baking mix, lemon-lime soda, and sour cream together in a bowl until dough holds together and is sticky. Turn dough onto a floured work surface and roll into 1-inch thick circle. Cut circles out of dough using a cookie cutter or the rim of a wine glass and place in the melted butter.\nBake in the preheated oven until biscuits are golden brown, 10 to 12 minutes. Remove dish from oven and let stand until biscuits have absorbed all the butter.\n",
        "picture_link": "rTFP0YYcNhZ6wu9Ub6PDhkBVqsgeXtS"
    },
    {
        "title": "Peanut Butter Blossoms",
        "ingredients": [
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2/3 cup brown sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup white sugar, or as needed ADVERTISEMENT",
            "2 (12 ounce) bags milk chocolate candy kisses (such as Hershey's Kisses®), unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat peanut butter, shortening, 2/3 cup white sugar, brown sugar, milk, eggs, and vanilla extract together with an electric mixer in a large bowl until creamy and smooth.\nSift flour, baking soda, and salt together in a bowl. Gradually fold flour mixture into peanut butter mixture to form a smooth dough. Cover bowl with plastic wrap and refrigerate until chilled, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nPour 1/4 cup white sugar into a shallow bowl. Scoop dough into 1-inch balls, roll balls in sugar, and place 1 1/2 inches apart on baking sheets.\nBake cookies in the preheated oven for 6 minutes; rotate cookie sheets and continue baking for another 3 minutes. Press a chocolate kiss about halfway down in the center of each cookie. Bake for until chocolate begins to melt and lose form, another 2 to 3 minutes. Cool on wire racks until chocolate hardens, at least 3 hours.\n",
        "picture_link": "6VYFqjL5a5BHN1EI08Xc7M3HWdLbgSe"
    },
    {
        "title": "Leftover Pizza Breakfast Casserole",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 slices leftover pizza, cut into 3/4-inch squares ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x9-inch baking dish with cooking spray.\nArrange pizza squares in the prepared baking dish. Mix eggs, milk, mozzarella cheese, onion, butter, garlic, oregano, and salt together in a large bowl; pour over pizza pieces. Top with Parmesan cheese and red pepper flakes. Cover dish with aluminum foil.\nBake in the preheated oven for 45 minutes. Remove foil and continue baking until eggs are set and Parmesan cheese is melted, about 20 more minutes.\n",
        "picture_link": "O.r0sO5Ju9jNsMQbpsjoYqSKY8dWi82"
    },
    {
        "title": "Taco Bell® Seasoning Copycat",
        "ingredients": [
            "1 tablespoon dried onion flakes ADVERTISEMENT",
            "1 teaspoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon beef bouillon granules ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk onion flakes, flour, beef bouillon, garlic salt, cumin, paprika, chili powder, cayenne pepper, and sugar together in a bowl.\n",
        "picture_link": "GjlzHMAwssMm5FobnHp38JaOo9UkDjm"
    },
    {
        "title": "Broccoli Cornbread with Cheese",
        "ingredients": [
            "1 cup cottage cheese ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 (8.5 ounce) packages corn bread/muffin mix ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped broccoli, thawed ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nBeat cottage cheese, butter, and eggs in a large bowl. Stir corn bread mixes into butter mixture until just moistened. Fold in broccoli, onion, and 1 cup Cheddar cheese. Pour batter into prepared baking dish and sprinkle with remaining 1/2 cup Cheddar cheese.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Cool in the baking dish for 10 minutes before slicing and serving warm.\n",
        "picture_link": "Ntkh.1tc7Ajh54T7eKD1x7PyF6LqMge"
    },
    {
        "title": "Cashew Chicken Stir Fry",
        "ingredients": [
            "4 skinless, boneless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "1 tablespoon Cajun seasoning blend (such as Tony Chachere's®), or to taste ADVERTISEMENT",
            "1 1/4 cups chicken broth ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "4 teaspoons soy sauce, divided ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "2 cups shredded cabbage ADVERTISEMENT",
            "25 sugar snap peas, chopped ADVERTISEMENT",
            "10 small spears fresh asparagus, trimmed and cut into bite-size pieces ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1/2 red bell pepper, cut into thin strips ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 (8 ounce) can sliced bamboo shoots, drained ADVERTISEMENT",
            "1/2 cup cashews ADVERTISEMENT",
            "1 pinch paprika, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle chicken pieces with Cajun seasoning.\nWhisk chicken broth, cornstarch, and 3 teaspoons soy sauce together in a bowl until completely blended.\nHeat 1 tablespoon olive oil in a deep frying pan or wok over high heat. Cook and stir chicken in hot oil until cooked through, 6 to 10 minutes. Remove chicken from pan and drain any accumulated liquids.\nHeat remaining 1 tablespoon olive oil in the frying pan or wok over high heat. Stir fry cabbage, snap peas, asparagus, celery, red bell pepper, green onions, and bamboo shoots for 1 minute. Stir in 1 teaspoon soy sauce. Continue cooking until vegetables are tender but still crisp, about 3 minutes.\nStir chicken into cabbage mixture. Pour chicken broth mixture over chicken mixture, reduce heat to medium, and simmer until sauce thickens, about 1 minute. Reduce heat to low; add cashews and cook until heated through, 1 minute. Sprinkle with paprika.\n",
        "picture_link": "Z5p.29BXuexaolW1XbKo7uHj/0iQPl2"
    },
    {
        "title": "Easy Lemon Pepper Chicken Wings",
        "ingredients": [
            "2 cups oil, or as needed ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon lemon pepper seasoning (such as McCormick®) ADVERTISEMENT",
            "12 chicken wings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nStir olive oil and lemon pepper together in a bowl.\nFry the chicken wings in hot oil until no longer pink at the bone and the juices run clear, about 8 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nToss hot wings with olive oil mixture to coat.\n",
        "picture_link": "akx86l1WEkq9tc2tyu4EYGBvBmok3MK"
    },
    {
        "title": "Banana Nut Coconut Cake",
        "ingredients": [
            "Banana Nut Coconut Cake: ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 ripe bananas, mashed ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "Banana Nut Frosting: ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 ripe banana, mashed ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round cake pans or one 9x13-inch pan.\nIn a medium bowl, cream together white sugar and 1/2 cup butter. Mix in eggs and 3 mashed bananas.\nSift together flour and baking soda in a separate bowl. Add to the creamed mixture alternately with buttermilk, mixing well after each addition. Blend in 1 teaspoon vanilla extract. Fold in 1 cup of pecans and 1 cup coconut. Pour batter into prepared pans.\nBake in the preheated oven until a tester inserted in the center comes out clean, about 45 minutes. Cool completely on wire racks.\nTo Make Frosting: Cream together 1/2 cup butter and confectioners' sugar until light and fluffy. Mix in 1 medium mashed banana, 1 cup pecans, 1 cup coconut and 1 teaspoon vanilla.\n",
        "picture_link": "ZzdwRNp8CzyDM.JlJL5BS843Tr3wS/C"
    },
    {
        "title": "Porketta Roast",
        "ingredients": [
            "1 tablespoon dill seed ADVERTISEMENT",
            "1 tablespoon fennel seed ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon lemon pepper ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "4 pounds boneless pork roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a small bowl, combine the dill seed, fennel seed, oregano, lemon pepper, onion powder and garlic powder. Mix well and apply to the roast. Place roast in a 10x15 inch roasting pan.\nBake at 325 degrees F (165 degrees C) for 1 to 1 1/2 hours, or until internal pork temperature reaches 145 degrees F (63 degrees C).\n",
        "picture_link": "xqAN9YusVyf2.wGKZjMXMA1UYaFOyU2"
    },
    {
        "title": "Stuffed Brie",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cups fresh sliced mushrooms ADVERTISEMENT",
            "1/2 cup dates, pitted and chopped ADVERTISEMENT",
            "1 (8 ounce) wheel Brie cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium skillet over medium heat, melt butter and caramelize onions and mushrooms; add dates and warm mixture for about 2 minutes.\nSlice the Brie wheel in half down the center so that there is a top and a bottom; fill with the onion mixture. Replace the top of the Brie.\nMicrowave Brie for 1 to 3 minutes or until bubbly; serve.\n",
        "picture_link": "HBTsSwYhGkclF2ib7glNs05qeEsum5q"
    },
    {
        "title": "Chicken Risotto",
        "ingredients": [
            "2 cups uncooked white rice ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 cup fresh mushrooms, sliced ADVERTISEMENT",
            "2 tablespoons chopped green bell pepper ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "4 chicken thighs ADVERTISEMENT",
            "3 tablespoons Italian-style dry bread crumbs ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a large bowl, combine the rice, mushroom soup, chicken broth, mushrooms, green bell pepper, basil, onion, oregano, garlic, ground black pepper and 1/4 cup cheese. Stir until all ingredients are well mixed.\nPour this mixture into a 9x13 inch baking dish. Place the chicken on top of the mixture and cover with foil. In a separate small bowl, combine the bread crumbs and remaining cheese and set aside.\nBake at 325 degrees F (165 degrees C) for 1 hour, remove from oven, uncover and sprinkle with the reserved bread crumb mixture. Return to oven and bake, uncovered, for 20 more minutes, or until golden brown.\n",
        "picture_link": "8mToOjN/5L43/ubKkltdXXTqy9ktiFe"
    },
    {
        "title": "Baked Pretzels",
        "ingredients": [
            "1 cup beer ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon active dry yeast ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "2 tablespoons kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure first 6 ingredients in order listed into baking pan. Select: Dough/Pasta Setting and press start.\nWhen the cycle is complete remove dough to a lightly floured surface. If necessary, knead in enough flour to make dough easy to handle. Roll into a 14X9 inch rectangle. With a sharp knife, cut into eighteen 14X1/2 inch strips. Gently pull each strip into a rope 16 inches long. To shape into pretzels: Curve ends of each rope to make a circle; cross ends at top. Twist ends once and lay over bottom of circle. Place on greased baking sheets. DO NOT LET RISE.\nCombine lightly beaten egg and 1tablespoon water; brush on pretzels. Sprinkle with kosher salt. Bake in a preheated 350 degrees F (175 degrees C) oven for 18-20 minutes or until done. Remove from sheets and let pretzels cool on wire rack. Enjoy!\n",
        "picture_link": "61eF/YTzepuNjym2.NgOBUWJnggWyIC"
    },
    {
        "title": "Coney Sauce",
        "ingredients": [
            "1/2 pound ground beef ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup tomato sauce ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon monosodium glutamate (MSG) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium skillet over medium high heat, saute the ground beef for 10 to 15 minutes, or until well browned. Break up with a fork until fine. Add the water, onion, garlic, tomato sauce, chili powder, monosodium glutamate and salt. Allow to simmer for 10 minutes, or until heated thoroughly.\n",
        "picture_link": "6YKLnKXvdZflcR11vIvcdyDeAMTZ.6G"
    },
    {
        "title": "No Fuss Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup crushed cornflakes cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nRinse chicken and pat dry. In a small bowl mix together the mayonnaise, mustard and cheese. Brush mixture onto chicken pieces to coat; refrigerate any leftover mixture for dipping.\nPlace cereal crumbs in a shallow dish or bowl; roll chicken in crumbs to coat and place coated chicken in a lightly greased 9x13 inch baking dish.\nBake at 400 degrees F (200 degrees C) for 20 to 25 minutes or until chicken is cooked through and juices run clear.\n",
        "picture_link": "zBShCeJdV3Fc97HFRoJpjJ8hCWukvEm"
    },
    {
        "title": "Maple Walnut Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup real maple syrup ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line muffin pan with paper baking cups.\nSift the flour, baking powder, and salt together and set aside.\nCream the butter and sugar together until light and fluffy. Stir in the maple syrup and the eggs and beat until well blended. Add the flour mixture alternately with the milk and beat until well blended. Stir in the walnuts. Spoon the batter into the muffin tins filling each about 3/4 full.\nBake at 375 degrees F (190 degrees C) for 20 minutes or until toothpick inserted in center comes out clean. Remove to wire rack to cool completely.\n",
        "picture_link": "/k3dTT/vlPP8GizBSx9.11TFZkk76Fm"
    },
    {
        "title": "Chinese Chicken Casserole Surprise",
        "ingredients": [
            "2 skinless, boneless chicken breasts - cooked and cubed ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1 cup sliced almonds ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1 (8 ounce) can water chestnuts, drained and minced ADVERTISEMENT",
            "1 (5 ounce) can crispy chow mein noodles ADVERTISEMENT",
            "2/3 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup diced celery (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a lightly greased 9x13 inch baking dish, combine the chicken, broth, soup, milk, almonds, mushroom pieces, water chestnuts, noodles, cheese and celery (if using). Mix well and make sure mixture is spread evenly in the dish.\nBake in preheated oven for 45 minutes.\n",
        "picture_link": "au8QQQupLaYeGyh0YRL1DL53YS46U7S"
    },
    {
        "title": "Best Cocktail Meatballs",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "2/3 cup evaporated milk ADVERTISEMENT",
            "2 (1 ounce) packages dry onion soup mix ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to broil.\nIn a medium-sized mixing bowl, combine hamburger, milk, onion soup mix, and Worcestershire sauce. Roll the mixture into small balls. Arrange meatballs on a cookie sheet. Broil for 10 minutes, or until cooked through.\nIn a small bowl, mix ketchup and brown sugar. Transfer mixture to a slow cooker. Add the meatballs to the slow cooker.\nCook meatballs on high for approximately 30 minutes.\n",
        "picture_link": "i5QX8JSu8kDI8mnKLinfmK6EbQij05u"
    },
    {
        "title": "Plum Pie",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup chopped hazelnuts ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "5 cups plums, pitted and sliced ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nTo Make Crust: In a large bowl combine 3 cups flour, 3/4 cups white sugar, baking powder, and 1/8 teaspoon salt. Mix thoroughly, then cut in 2/3 cup butter or margarine with a pastry blender, until pieces are the size of small peas. Stir in eggs, vanilla extract, milk and lemon zest. Mix just until all ingredients are combined. Allow dough to rest in refrigerator.\nTo Make Streusel Topping: In a medium bowl mix 1/2 cup flour, brown sugar, 1/2 teaspoon cinnamon, 1/4 teaspoon salt, chopped nuts, and grated lemon zest. Work in butter or margarine with fingers until all ingredients are well combined. Set aside.\nTo Make Fruit Filling: Place pitted and sliced fruit in a large bowl. In a small bowl, mix remaining sugar, flour, cinnamon, and nutmeg until thoroughly combined. Pour over fruit and stir gently until all fruit is evenly coated.\nRoll out pie crust and place in a 9 inch pie pan. Trim and flute edges, then pour in fruit filling. Evenly cover fruit with streusel topping and bake in preheated oven for 45 to 55 minutes. Serve warm, or at room temperature.\n",
        "picture_link": "7FEt9b7oZeEKU6LZaMX8K8fGDUaFEqu"
    },
    {
        "title": "Valentine's Pie",
        "ingredients": [
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1 (16 ounce) can cherry pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In an electric mixer, beat the cream cheese and the powdered sugar until combined. Add vanilla and beat 2 minutes. Gently fold in whipped topping.\nTransfer mixture into the pie crust. Top the filling with the cherries. Refrigerate for at least one hour before serving.\n",
        "picture_link": "Jy6kwJD/7dvz2v3No4EAYEF75awiQWG"
    },
    {
        "title": "Banana Split Cake IV",
        "ingredients": [
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "4 bananas ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 quart strawberries, stemmed and quartered ADVERTISEMENT",
            "1 1/2 cups sugar free strawberry glaze ADVERTISEMENT",
            "1 (12 ounce) container lite frozen whipped topping, thawed ADVERTISEMENT",
            "1 (10 ounce) jar maraschino cherries, drained and quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the graham cracker crumbs and melted butter. Press into the bottom of a 9x13 inch baking pan. Chill to set.\nIn a large bowl, mix together the cream cheese, butter and confectioners' sugar until smooth and creamy. Spread over the chilled graham cracker crust. Arrange the sliced bananas over the cream cheese mixture. Then cover with the drained crushed pineapple. Place strawberries cut side down over the pineapple layer, then coat with the strawberry glaze. Spread the whipped topping over the strawberry layer, decorate with maraschino cherries and sprinkle with chopped nuts.\nRefrigerate at least 4 hours before serving.\n",
        "picture_link": "VFRwgPUIgDZgNrNUr8w/0EYXN20c3Cq"
    },
    {
        "title": "Butterscotch Cake I",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups butterscotch pudding ADVERTISEMENT",
            "1 cup butterscotch chips ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 15 1/2 x 10 1/2 x 1 inch jelly roll pan.\nCombine the cake mix, eggs, and butterscotch pudding. Spread the batter into the prepared pan and sprinkle with the butterscotch chips, white sugar, and slivered almonds.\nBake at 350 degrees F (175 degrees C) for 20 minutes. Enjoy!\n",
        "picture_link": "UzUiKy45rTOxqQ0szJpaZbk40xD7awe"
    },
    {
        "title": "Slow Cooker Escalloped Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - boiled ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "13 cups white bread cubes, baked until slightly dry ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 1/2 cups reserved cooking liquid from chicken ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "FOR DRESSING: Combine the onion, butter or margarine, bread cubes, poultry seasoning, salt, sage, pepper, reserved cooking liquid, mushroom soup and celery. Mix well.\nIn a slow cooker, layer the cooked chicken and dressing mixture. Cook on low for 4 to 8 hours. Serve.\n",
        "picture_link": "Os8b7Hh2vjzgnkuJgqo7tfgZ5kPWZEO"
    },
    {
        "title": "Banana Split Cake I",
        "ingredients": [
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "6 bananas, peeled and halved lengthwise ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 quart fresh strawberries, halved ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cracker crumbs and melted butter or margarine thoroughly and press into bottom of 9x12 inch baking pan. Chill in freezer for at least 15 minutes.\nIn the medium bowl of an electric mixer combine confectioners sugar, eggs, and softened butter or margarine; beat at medium speed for 20 minutes. (This step is important, so don't try to save time).\nSpread buttercream mixture evenly over chilled crust. Place bananas, cut side down, evenly on top of buttercream and spoon crushed pineapple evenly over top of bananas. Distribute strawberries over pineapple and spread the whipped topping evenly all over. Sprinkle with walnuts and refrigerate for at least 3 hours or overnight before serving.\n",
        "picture_link": "rRM9K3Qks7x0gz8vIE2GXO9CbPvu99G"
    },
    {
        "title": "Golden Lasagna",
        "ingredients": [
            "6 lasagna noodles ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "3 tablespoons chicken broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "2 cups diced chicken breast meat ADVERTISEMENT",
            "1 pound ricotta cheese ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/8 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add noodles and cook for 8 to 10 minutes or until al dente; drain.\nIn a small saucepan, saute onion and mushrooms in chicken broth. Remove from heat. Stir in soup, milk and basil. Mix well. Set aside.\nIn a lightly greased 9x13 inch baking dish, arrange 3 cooked lasagna noodles. Layer as follows: 1/2 the chicken, 1/2 the ricotta cheese, 1/2 the Cheddar cheese, 1/2 the Parmesan cheese and 1/2 the mushroom/soup mixture. Add the other 3 lasagna noodles and repeat layers. Bake uncovered in the preheated oven for approximately 50 minutes.\n",
        "picture_link": "Rv09KBs8mdc0Vxfmdq1/qvH4NhWxGl2"
    },
    {
        "title": "Mystery Chocolate Cake",
        "ingredients": [
            "1 1/2 cups well-drained, mashed, cooked beets ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 x 13 inch pan.\nIn a large bowl, combine beets, eggs, vanilla, oil, and sugar. Mix with an electric mixer on low speed until well combined.\nIn a separate bowl, mix together flour, soda, salt, and cocoa. Add to the creamed mixture, beating together well. Pour batter into prepared pan.\nBake for 25 to 30 minutes until done. Cool and frost with your favorite icing.\n",
        "picture_link": "Ed4CSb4JS40JTwDjTHz1kXDRc3sFDWK"
    },
    {
        "title": "Fresh Tomato Sauce",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "6 tomatoes, chopped ADVERTISEMENT",
            "3 onions, minced ADVERTISEMENT",
            "2 green bell peppers, minced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons white wine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, heat oil over medium heat; add tomatoes, onions, green bell peppers, garlic, white wine and salt and pepper to taste.\nMix ingredients well; cover and simmer for 30 minutes. Serve.\n",
        "picture_link": "7xqBmvdEOZr0tWiSnObAbStEzI51Y1G"
    },
    {
        "title": "Romesco Sauce",
        "ingredients": [
            "6 roma (plum) tomatoes, halved ADVERTISEMENT",
            "1 large red bell pepper, quartered ADVERTISEMENT",
            "12 cloves garlic ADVERTISEMENT",
            "2/3 cup olive oil ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "1 slice bread ADVERTISEMENT",
            "1/2 cup toasted whole almonds ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/2 teaspoon Spanish paprika ADVERTISEMENT",
            "1 pinch crushed red pepper flakes, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil.\nPlace the tomatoes, bell pepper, and garlic cloves onto the prepared baking sheet. Brush the vegetables with some of the olive oil, then sprinkle with kosher salt. Bake in the preheated oven until the garlic has turned golden brown, 15 to 20 minutes. Remove from the oven, and allow to cool for 10 minutes. While the vegetables are cooling, bake the bread slice on one of the oven racks until golden brown. Remove and allow to cool.\nScrape the vegetables and any juices from the pan into a food processor or blender. Break the bread into pieces, and add to the food processor along with the toasted almonds, vinegar, paprika, and red pepper flakes. Puree until finely ground, then drizzle in the remaining olive oil with the machine running. Season to taste with additional salt if necessary.\n",
        "picture_link": "X2HCJP3kIBo24GWUxEhWpuUvn7qnl/."
    },
    {
        "title": "Cauliflower Side Dish",
        "ingredients": [
            "1 head cauliflower, quartered ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup minced onion ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 cup Italian-seasoned dry bread crumbs ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cauliflower into a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until fork-tender, 5 to 7 minutes. Drain and allow to steam dry for a minute or two; chop into bite-size pieces.\nMelt 1 tablespoon butter in a skillet over medium-high heat. Cook the onion in the butter until the onion is browned, about 5 minutes. Add 3 tablespoons of butter and cook until the butter is melted. Stir in the bread crumbs and cook until the mixture bubbles. Mix the cauliflower into the skillet and cook until the cauliflower is warm, 3 to 5 minutes. Season with salt and black pepper; serve hot.\n",
        "picture_link": "ryqlEqRuR5K2ykwP6tf8vYapgK5KreO"
    },
    {
        "title": "Roasted Beet and Potato Soup",
        "ingredients": [
            "2 cups diced potatoes ADVERTISEMENT",
            "2 cups diced peeled beets ADVERTISEMENT",
            "olive oil, divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 1/2 cups whole milk ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Place the potatoes and beets into a baking dish, and drizzle with 1 tablespoon olive oil; season with salt and black pepper.\nRoast in the preheated oven until tender, about 1 hour; allow to cool.\nHeat 2 tablespoons of olive oil in a large soup pot over medium heat, and stir in the celery, onion, and garlic. Cook, stirring often, until the onion is translucent, about 5 minutes. Mix in the cooked vegetables, chicken broth, thyme, and bay leaf, bring to a boil, and reduce heat. Simmer until the celery is very tender, about 45 minutes.\nRemove from heat, and discard the bay leaf. Puree the mixture in the pot with an immersion blender until very well blended; stir in the milk and lemon juice to serve.\n",
        "picture_link": "k5zLdzBob19r1eYPFLaal8IeAGdbDwu"
    },
    {
        "title": "Mexican Fiesta Pasta Salad",
        "ingredients": [
            "1 (16 ounce) package dried rotini pasta ADVERTISEMENT",
            "1 1/2 cups medium chunky salsa ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 (16 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (11 ounce) can Mexican-style corn with red and green peppers, drained ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "2 green onions, sliced thin ADVERTISEMENT",
            "1 (4.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin, or to taste ADVERTISEMENT",
            "1/2 teaspoon dried cilantro, or to taste ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a rolling boil; cook the rotini in the boiling water until the pasta is cooked through yet firm to the bite, about 8 minutes. Drain. Rinse under cold running water until completely cooled; drain thoroughly.\nWhisk the salsa, mayonnaise, sour cream, black beans, Mexican-style corn, red bell pepper, green onions, black olives, garlic powder, cumin, cilantro, salt, and pepper together in a large bowl; add the cooled pasta and stir to coat evenly. Cover the bowl with plastic wrap and refrigerate 2 hours to overnight before serving.\n",
        "picture_link": "gip.Wku0mrd1zuacL/LQ0TepBubsQbK"
    },
    {
        "title": "Daddy's Whisker Soup",
        "ingredients": [
            "12 potatoes, peeled and diced ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon pepper ADVERTISEMENT",
            "5 cups milk ADVERTISEMENT",
            "1 (1 pound) loaf processed cheese food (such as Velveeta®), cubed ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine potatoes, onion, 1 tablespoon salt, and 1 tablespoon pepper in a large soup pot. Cover with water; bring to a boil over high heat. Cook until the potatoes are very tender, 10 to 15 minutes. Drain potatoes, and return to pot.\nStir the milk and cubed cheese into the potatoes. Season with dill, salt, and pepper. Cook and stir over low heat until the cheese is melted, about 10 minutes.\n",
        "picture_link": "jtMoDAtsaC7KqUhzFGc0ObtaZVyzfJO"
    },
    {
        "title": "Maritime Blueberry Buckle",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 cups fresh blueberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup softened butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch square baking dish. Whisk 1 cup flour, the baking powder, and salt together in a mixing bowl.\nBeat the shortening and 1/2 cup sugar with an electric mixer in a large bowl until light and fluffy. Beat in the egg. Pour in the flour mixture alternately with the milk, mixing until just incorporated. Pour the batter into prepared pan, then sprinkle evenly with blueberries. Combine 1/2 cup sugar, 1/3 cup flour, cinnamon, and butter in a bowl with a fork until crumbly and evenly mixed. Sprinkle evenly over the blueberries.\nBake in the preheated oven until a toothpick inserted into the buckle comes out clean, about 35 minutes. Allow to cool before serving warm.\n",
        "picture_link": "8foBwnElfbGdLoOp42i5wziR8fn6Ai6"
    },
    {
        "title": "Mom's Hearty Beef Stew with Dumplings",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 onion, coarsely chopped ADVERTISEMENT",
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "2 teaspoons steak seasoning (such as Montreal Steak Seasoning®), divided ADVERTISEMENT",
            "2 stalks celery, each cut into 4 pieces ADVERTISEMENT",
            "2 cups water, or to cover ADVERTISEMENT",
            "4 (.85 ounce) packages dry brown gravy mix ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 small turnip, peeled and quartered ADVERTISEMENT",
            "4 carrots, peeled and quartered ADVERTISEMENT",
            "7 potatoes, peeled and quartered ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons shortening ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large heavy pot or Dutch oven over medium-high heat until the oil is shimmering, and place the onion and beef into the hot oil. Sprinkle with 1 teaspoon of the steak seasoning, stir the meat and onions well, and sprinkle with 1 more teaspoon of seasoning. Add the celery, and cook and stir until the meat is browned, about 10 minutes.\nPour in 2 cups of water to just cover the meat, onion, and celery, bring to a boil, and stir and scrape the browned bits of flavor from the bottom of the pan. Cover, reduce heat, and simmer until the beef is very tender, about 2 hours. Remove the meat and celery pieces from the pan, set the meat aside, and discard the celery.\nIn a bowl, whisk together the gravy mix with 4 cups of water. Add the mixture to the juices in the pot, bring to a boil, and stir the meat back into the gravy mixture. Stir in the turnip and carrots, cover, and simmer for 20 minutes. Stir in the potatoes, cover, and simmer an additional 20 minutes.\nTo make dumplings, mix the flour, baking powder, and salt in a bowl. Cut the shortening into the flour mixture with a pastry cutter or two knives until the mixture looks crumbly. Pour in the milk, and lightly stir the mixture just until it combines to form a dough.\nRemove 2 cups of gravy from the pot, and reserve. Drop the dumplings by heaping tablespoon onto the meat and vegetables in the pot, cover, and simmer for 20 minutes. Do not peek until the time is up. Pour the reserved gravy back over the dumplings, stir lightly, and serve.\n",
        "picture_link": "EXuVNQMzh.Pl.gCFe4WcX3ongSeQlym"
    },
    {
        "title": "Creamy White Chicken and Artichoke Lasagna",
        "ingredients": [
            "2 cups boneless skinless chicken breast, cooked and shredded ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, chopped ADVERTISEMENT",
            "1/2 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "1 (8 ounce) package KRAFT Shredded Mozzarella Cheese with a Touch of PHILADELPHIA, divided ADVERTISEMENT",
            "1/2 cup KRAFT Grated Parmesan Cheese ADVERTISEMENT",
            "2 (8 ounce) packages PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 cup basil, chopped ADVERTISEMENT",
            "12 lasagna noodles, cooked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nCombine chicken, artichokes, tomatoes, 1 cup mozzarella and Parmesan. Beat cream cheese, milk, and garlic powder with mixer until well blended; stir in 2 tablespoons basil. Mix half with the chicken mixture.\nSpread half of the remaining cream cheese sauce onto bottom of 13x9-inch baking dish; cover with 3 noodles and 1/3 of the chicken mixture. Repeat layers of noodles and chicken mixture twice. Top with remaining cheese sauce and mozzarella; cover.\nBake 25 min. or until heated through. Sprinkle with remaining basil. Let stand 5 min. before cutting to serve.\n",
        "picture_link": "bieI1loK7cO0jMKyWFjsM4mToB43yd2"
    },
    {
        "title": "Blueberry Orange Bran Muffin",
        "ingredients": [
            "1/2 cup oat bran ADVERTISEMENT",
            "1 cup wheat bran ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2/3 cup brown sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 orange, juiced and zested ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease 12 muffin cups, or line with paper muffin liners.\nCombine the oat bran and wheat bran in a large bowl. Stir in sour cream and milk. Allow mixture to stand for 10 minutes. Combine flour, baking powder, baking soda, brown sugar, and salt in a separate bowl. Gently stir blueberries into the flour mixture, carefully coating all the blueberries with flour. Stir vegetable oil, orange juice and zest, egg, and vanilla extract into the bran mixture. Combine flour mixture with the wet ingredients until just blended. Drop batter into lined muffin cups.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "XQ8aFGOWfF.rvioVQUxhivx3Vu3NKse"
    },
    {
        "title": "Steamed Tuna Fish",
        "ingredients": [
            "2 pounds fresh tuna steaks ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup sherry ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 bunch green onions, finely chopped ADVERTISEMENT",
            "1/2 cup minced fresh ginger root ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tuna steaks in a steamer over 1 inch of boiling water, and cover. Cook 6 to 8 minutes, or until fish flakes easily with a fork.\nMeanwhile, in a medium saucepan, combine soy sauce, sherry, vegetable oil, green onions, ginger, garlic, salt, and black pepper. Bring to a boil.\nRemove tuna steaks from steamer, and place in a serving dish. Pour sauce over tuna steaks, and serve immediately.\n",
        "picture_link": "QTzyzcNLDajXD7WGHWCcOM311zGDpfW"
    },
    {
        "title": "Mediterranean Lamb and Lentil Stew",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 pounds lamb shoulder arm chops, cubed, round bones reserved ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 cup lentils, picked over and rinsed ADVERTISEMENT",
            "2 cups chicken broth, or more as needed ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes ADVERTISEMENT",
            "3 carrots, peeled and sliced ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "2 cups coarsely chopped fresh spinach ADVERTISEMENT",
            "1 lemon, juiced and zested ADVERTISEMENT",
            "1/2 cup ricotta salata cheese, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a heavy pot over medium-high heat. Add the lamb cubes and bones and brown on all sides, about 3 minutes. Sprinkle with salt and pepper. Add onion and garlic and continue cooking about 2 minutes, stirring frequently.\nStir in the lentils, 2 cups of the chicken broth, tomatoes, carrots and the thyme, sage and basil. Bring to a boil, reduce the heat to low and simmer, covered, until the lentils are tender but not quite done, stirring occasionally. Depending on the type and freshness of the lentils, this will take from 15 to 30 minutes. If the stew seems dry, add more broth (up to one cup additional). Discard the lamb bones.\nAdd the spinach and cook 5 minutes more. Stir in the lemon zest and juice. Garnish individual servings with some of the crumbled cheese.\n",
        "picture_link": "3uaWGB/EpQmgH207aL0nv/zlitikj5e"
    },
    {
        "title": "Butterscotch Fudge",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (11 ounce) package butterscotch chips ADVERTISEMENT",
            "1/2 (11 ounce) package white chocolate chips ADVERTISEMENT",
            "1 teaspoon butter flavored extract ADVERTISEMENT",
            "1 teaspoon rum flavored extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium sauce pan over medium heat, combine condensed milk, butterscotch chips and white chocolate chips. Stir constantly until melted and smooth. Remove from heat and stir in butter and rum flavorings. Pour into a 9x13 inch dish, cover and refrigerate until firm, 30 minutes. Cut and serve.\n",
        "picture_link": "zZ/GEJT/5h37ZTCJ8JquesgTiUqxvii"
    },
    {
        "title": "Masala Chai Brownies",
        "ingredients": [
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/3 cup unsweetened shredded coconut ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup very strongly brewed masala chai ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Spray an 8x8 inch baking pan with cooking spray, and dust lightly with the 2 tablespoons cocoa powder. Place the coconut in the jar of a blender, and pulse to mince; set aside.\nWhisk together the flour, sugar, 1/4 cup cocoa powder, baking powder, and salt. Stir in the brewed chai, canola oil, and vanilla extract, just until all ingredients are moistened. Fold in the coconut. Spread the batter in the prepared pan.\nBake in the preheated oven until the top is no longer shiny, about 20 minutes. Allow to cool for 1 hour before cutting.\n",
        "picture_link": "U.VkXFQ9ovCIkq/KTuCYiKDZWdid36S"
    },
    {
        "title": "Fresh Strawberry-Oatmeal Cookies",
        "ingredients": [
            "2 cups finely chopped fresh strawberries ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup regular rolled oats ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine the strawberries with 1/4 cup sugar in a medium bowl. Toss gently to blend, and set aside.\nCombine the flour, baking soda, and cinnamon in a large bowl. Stir in the rolled oats and blend evenly; set aside.\nBeat the butter, brown sugar, and white sugar in the large mixing bowl of an electric mixer at medium speed until fluffy. Add the egg, milk, and vanilla, and continue beating until smooth. Stir in the flour mixture, and mix well to blend. Combine the strawberries with the flour mixture, and stir to blend. Drop by teaspoonfuls onto ungreased baking sheets.\nBake in preheated oven until slightly brown, about 8 minutes. Cool on baking sheets. Store in an airtight container.\n",
        "picture_link": "ekyeJ2PvIr6.IwNzqj/uPJHnhGmpueW"
    },
    {
        "title": "Valentine Night Strawberries",
        "ingredients": [
            "20 fresh strawberries ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons chopped walnuts ADVERTISEMENT",
            "1 1/2 tablespoons confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dice two strawberries and set aside. Cut the stems off of each of the remaining strawberries, forming a base for strawberries to stand on. Starting at the pointed ends and cutting most of the way, but not completely through the stem end, slice each strawberry into four wedges.\nBeat the cream cheese until fluffy; stir in the diced strawberries, walnuts, and powdered sugar. Spoon or pipe about a teaspoon of mix into each strawberry.\n",
        "picture_link": "r53pbYYGnP63nNjEdTvXWP2dcD/nvYy"
    },
    {
        "title": "Easy Indian-Style Chicken",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon cumin seed ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "1/2 (14 ounce) can coconut milk ADVERTISEMENT",
            "1/2 teaspoon brown sugar ADVERTISEMENT",
            "1/2 teaspoon hot chile paste (optional) ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "3/4 teaspoon ground turmeric ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a large skillet over medium heat. Add cumin seeds, and fry for a few minutes until they become fragrant and begin to pop. Stir in chopped onion, and cook until the onion has softened and turned translucent, 3 to 4 minutes.\nStir together tomato paste and water, and pour into skillet. Stir in chicken, and cook until it has firmed and turned white, about 5 minutes. Add coconut milk, brown sugar, chile paste, cayenne pepper, turmeric, salt, and pepper.\nBring mixture to a simmer, then reduce heat to medium-low, cover, and continue to simmer until the chicken is tender and no longer pink in the center, about 15 minutes. Sprinkle with chopped cilantro before serving.\n",
        "picture_link": "jn5ChVYAGNK2Gj/YwLa/4V5CFLLU7KC"
    },
    {
        "title": "Tuscan Sausage Ragu",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound bulk sweet Italian sausage ADVERTISEMENT",
            "1 pound bulk hot Italian sausage ADVERTISEMENT",
            "1 large red onion, diced ADVERTISEMENT",
            "2 ribs celery, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup dry red wine ADVERTISEMENT",
            "1 (28 ounce) can Italian-style diced tomatoes, undrained ADVERTISEMENT",
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium heat. Cook and stir the sweet and hot Italian sausage until browned, about 10 minutes. Break the meat up into crumbles as it cooks. Stir in the onion, celery, and garlic; cook and stir until the onion is translucent, about 8 more minutes. Pour the mixture into a slow cooker. Pour red wine into the skillet, and stir to dissolve the brown flavor bits from the bottom of the skillet. Pour the wine into the slow cooker. Add the diced tomatoes, tomato sauce, and salt to taste. Mix well.\nCover the slow cooker, set to Low, and cook for 5 hours. Pour in the cream, stir, cover, and cook for 1 more hour. Adjust salt again if necessary, and serve.\n",
        "picture_link": "tt3kARWAk6OrfW5l641jOWbAvOElF96"
    },
    {
        "title": "Easy Tomato Sauce",
        "ingredients": [
            "4 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "1 tablespoon tomato puree ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, cook onion in olive oil until translucent. Stir in tomatoes, cook until juice begins to thicken. Stir in puree, salt and pepper. Reduce heat and simmer 15 minutes more, until rich and thick.\n",
        "picture_link": "JHFBN2nVaKY5QFifTuF9sob8DoZPSkC"
    },
    {
        "title": "Refreshing Cucumber Lemonade",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cucumber, sliced ADVERTISEMENT",
            "6 lemons, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make a simple syrup by stirring the water and sugar together in a saucepan over medium heat; heat until just about to boil and the sugar has dissolved. Place in refrigerator 30 minutes, or until cool.\nPlace the cucumber slices in a blender or food processor; blend until mashed into a pulp. Pour the cucumber pulp into a fine mesh strainer place over a bowl to catch the liquid; allow to sit until you have about 2/3 cup of liquid from the cucumber, about 15 minutes.\nStir the simple syrup, cucumber liquid, and lemon juice together in a pitcher. Serve cold.\n",
        "picture_link": "wzWWH/0VkAhHHPs99BQ8Nay2I6a03OS"
    },
    {
        "title": "Firecracker Scallops",
        "ingredients": [
            "5 slices bacon ADVERTISEMENT",
            "1 tablespoon bacon drippings ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 1/4 teaspoons garlic salt ADVERTISEMENT",
            "1 pound sea scallops ADVERTISEMENT",
            "2 tablespoons horseradish sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the bacon in a large, deep skillet over medium-high heat until crisp, about 10 minutes. Drain on a paper towel-lined plate, reserving about 1 tablespoon of the bacon drippings. Crumble the bacon once cool to the touch.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nHeat the reserved bacon drippings in a separate skillet over medium heat. Stir the butter and garlic salt into the bacon drippings; allow the butter to melt completely. Cook the scallops in the butter mixture until there is a light brown coating on each side, about 4 minutes per side. Transfer the scallops to a baking dish. Spoon the butter sauce over the scallops. Drizzle the horseradish sauce over the scallops and sprinkle with the crumbled bacon.\nBake the scallops under the preheated broiler until the sauce begins to bubble, about 1 minute.\n",
        "picture_link": "sHQNnvrozPCdG4B2lGnz77TnSW5YCQK"
    },
    {
        "title": "Peri Peri African Chicken",
        "ingredients": [
            "1/4 cup paprika ADVERTISEMENT",
            "2 tablespoons hot chili powder ADVERTISEMENT",
            "1 cup fresh lemon juice ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh ginger ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "4 bone-in chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the paprika, chili powder, lemon juice, garlic, ginger and salt. Rub chicken with the mixture, place in a dish, and marinate for 3 hours.\nPreheat a grill for medium heat.\nPlace chicken onto the grill and discard the marinade. Cook for about 30 minutes, turning occasionally, until the skin is slightly charred and juices run clear.\n",
        "picture_link": "OBntOzwG8r4172Q1zdqOv0AvAmrlv42"
    },
    {
        "title": "Butterscotch Sauce II",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, stir together the brown sugar, milk, corn syrup and butter. Warm over low heat until smooth and butter is melted. Do not boil.\n",
        "picture_link": "x.b6EnLYRT2rfJnquXMnU.pHVHtX/GG"
    },
    {
        "title": "Shrimp Kisses",
        "ingredients": [
            "1 (8 ounce) package Monterey Jack cheese, cut into strips ADVERTISEMENT",
            "40 large shrimp - peeled, deveined and butterflied ADVERTISEMENT",
            "20 slices bacon, cut in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (220 degrees C).\nPlace a small piece of cheese into the butterflied opening of each shrimp. Wrap half of a slice of bacon around each one to conceal the cheese, securing with toothpicks. Place on a cookie sheet.\nBake for 10 to 15 minutes in the preheated oven, until bacon is browned.\n",
        "picture_link": "ySVDWqpOucAItcpWgnKbHbjUF75CLqS"
    },
    {
        "title": "Best Lactose Free Blueberry Muffins",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 cups fresh blueberries ADVERTISEMENT",
            "1/2 cup soy milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon white sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Line muffin pans with paper liners, and spray the tops with cooking spray.\nIn a large bowl, mix together the margarine, 1 1/4 cups of sugar, and salt until smooth. Beat in the eggs one at a time until well blended. In a separate bowl, stir together the flour and baking powder. Spoon some of this mixture onto the blueberries, and toss to coat. This will keep them from sinking to the bottom. Stir the remaining flour mixture into the bowl with the eggs, alternating with the soy milk, vanilla extract, and lime juice. Gently fold in the blueberries. Spoon the batter into the muffin cups, filling to the top. Sprinkle a little sugar over the tops of the muffins.\nBake for 25 minutes in the preheated oven, or until muffin tops are golden brown, and the tops spring back when pressed lightly. Cool for at least 10 minutes before removing from pan.\n",
        "picture_link": "KMLnGn8JPlqezc07/6gOE9lloZJ9wyy"
    },
    {
        "title": "Skillet Apple Chicken",
        "ingredients": [
            "2 1/2 tablespoons olive oil ADVERTISEMENT",
            "2 boneless skinless chicken breasts, cut into 1/4-inch strips ADVERTISEMENT",
            "1 sweet apple - peeled, cored and thinly sliced ADVERTISEMENT",
            "1 1/2 tablespoons garlic salt ADVERTISEMENT",
            "1 tablespoon cracked black pepper ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 1/2 teaspoons chopped dried tarragon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium heat, and cook the chicken 5 minutes.\nGradually stir the apples into the skillet, and continue cooking 15 minutes, or until chicken juices run clear and apples are tender. Thoroughly mix in the garlic salt, pepper, pumpkin pie spice, and tarragon.\n",
        "picture_link": "FAMrMIRJowKNumAR4jGcKR4Jv2EXEo6"
    },
    {
        "title": "Pecan Chewies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "3 cups packed light brown sugar ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups chopped pecans ADVERTISEMENT",
            "3 cups self-rising flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan, or for thinner bars, use a 10x15 inch jellyroll pan.\nMelt butter in a saucepan over medium heat. Stir in brown sugar until smooth. Remove from heat and let cool slightly.\nStir the eggs and vanilla into the brown sugar and butter. Mix in the chopped pecans, and then the flour. Spread evenly in the prepared pan.\nBake for 25 minutes in the preheated oven, or until golden brown. Allow to cool before cutting into bars.\n",
        "picture_link": "WVXflj/hbR8T/bTbYG53WJqTKw3rsEm"
    },
    {
        "title": "Nat's Buttery Cashew Crunch",
        "ingredients": [
            "1 cup unsalted butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon light corn syrup ADVERTISEMENT",
            "10 ounces cashews ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Generously butter or grease a large baking sheet, and set aside.\nIn a saucepan over medium heat, combine the butter, sugar, salt and corn syrup. Cook, stirring until butter is melted. Stir in the cashews, and increase the heat to high. Heat to 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads. Stir occasionally with a long handled wooden spoon so the cashews do not burn.\nPour onto a greased baking sheet, and allow to cool for about 10 minutes. Break into pieces, and store in an airtight container lined with waxed paper.\n",
        "picture_link": "ZsTb.q2ttlOM0NMNL1u1ntxmtEBcrwK"
    },
    {
        "title": "Tia and David's Deep Fried Tortellini",
        "ingredients": [
            "1 (16 ounce) package refrigerated or fresh cheese tortellini ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "1/4 cup cornflake crumbs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "dried parsley, to taste ADVERTISEMENT",
            "oil for deep frying ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook tortellini according to package directions. Rinse under cool water, and allow to cool slightly.\nIn a large resealable plastic bag, combine bread crumbs, cornflake crumbs, salt, pepper, and parsley.\nHeat oil in a deep fryer or deep skillet over medium heat. In small batches, dip the tortellini in egg, and place in resealable bag. Shake to coat, and set aside on a plate until the oil is hot.\nIn batches, deep fry breaded tortellini until golden brown. Serve with tomato sauce for dipping.\n",
        "picture_link": "1XuamXfoEt3Su9fpTWJa4frNXi2paGe"
    },
    {
        "title": "Spicy Peach Chutney",
        "ingredients": [
            "4 pounds sliced peeled peaches ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "5 ounces chopped preserved ginger ADVERTISEMENT",
            "1 1/2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon mustard seed ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "4 cups packed brown sugar ADVERTISEMENT",
            "4 cups apple cider vinegar ADVERTISEMENT",
            "1/4 cup pickling spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large heavy pot, stir together the peaches, raisins, garlic, onion, preserved ginger, chili powder, mustard seed, curry powder, brown sugar and cider vinegar. Wrap the pickling spice in a cheesecloth bag, and place in the pot.\nBring to a boil, and cook over medium heat uncovered until the mixture reaches your desired consistency. It will take about 1 1/2 hours to get a good thick sauce. Stir frequently to prevent scorching on the bottom.\nRemove the spice bag, and ladle into hot sterilized jars. Wipe the rims with a clean moist cloth. Seal with lids and rings, and process in a barely simmering water bath for 10 minutes, or the time recommended by your local extension for your area. The water should cover the jars completely.\n",
        "picture_link": "HCBRLWAzcIsCoPG9wpOzFLhJpS3y7VK"
    },
    {
        "title": "Broccoli Buffet Salad",
        "ingredients": [
            "3 cups broccoli florets ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "1/4 cup sunflower seeds ADVERTISEMENT",
            "1/2 cup chopped raisins ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/2 cup plain low-fat yogurt ADVERTISEMENT",
            "1/4 cup light mayonnaise ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a measuring cup, mix together yogurt, mayonnaise, sugar, and lemon juice.\nIn a salad bowl, stir together broccoli, red onion, sunflower seeds, raisins, and crumbled feta cheese. Toss with yogurt dressing, and season with salt and pepper to taste. Cover, and refrigerate for 2 hours.\n",
        "picture_link": "IduTXE5bbhkpzU4hsAHieKmtIIoNoUu"
    },
    {
        "title": "Lemon Dill Rice",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 large onion, minced ADVERTISEMENT",
            "2 cups long-grain white rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "2 tablespoons dill seed ADVERTISEMENT",
            "1/2 teaspoon grated lemon zest ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nMelt butter in a heavy skillet over medium heat. Add the onion and rice; cook and stir until lightly toasted. Stir in the water and lemon juice, and season with salt and dill seed. Bring to a boil. Pour the rice mixture into a 3 quart casserole dish.\nBake for 1 hour, covered, in the preheated oven. Garnish with lemon zest and chopped parsley.\n",
        "picture_link": "YWLCLLN9gpfouyp6lactQw7tDeI5tf2"
    },
    {
        "title": "Cucumber Salad",
        "ingredients": [
            "4 medium cucumbers, peeled and diced ADVERTISEMENT",
            "1 (8 ounce) container vanilla low-fat yogurt ADVERTISEMENT",
            "1 (8 ounce) container reduced-fat sour cream ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain cucumbers for a few minutes on paper towels. In a serving dish, stir together the yogurt, sour cream, onion, garlic, and dill. Add cucumbers, and gently mix to coat. Season with salt and pepper. Refrigerate for a couple of hours before serving for best flavor.\n",
        "picture_link": "asy0QF3xr47qsN5lrQMZbBH8WLbuCLy"
    },
    {
        "title": "Sweet Dijon Salad Dressing",
        "ingredients": [
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup Dijon mustard ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "4 (1 gram) packets granular sucrolose sweetener (such as Splenda®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cider vinegar, Dijon mustard, olive oil and sugar substitute into a jar with a tight fitting lid. Close the jar, and shake vigorously to blend. Refrigerate until chilled before using.\n",
        "picture_link": "QxxrMBDnhpY3xbMbZeXZBpqgscSgCqa"
    },
    {
        "title": "Moist Garlic Chicken",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon dried Italian seasoning (optional) ADVERTISEMENT",
            "1/2 teaspoon dried dill weed (optional) ADVERTISEMENT",
            "1 teaspoon garlic salt, or to taste ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the water into a microwave-safe casserole dish, and place in the microwave. Heat until boiling, about 2 minutes. Stir in bouillon cubes, butter, italian seasoning, dill, and garlic salt.\nPierce the chicken breasts with a fork on one side, and place the pierced side down in the casserole dish. The chicken should be almost covered by the liquid, if not completely covered.\nCover the dish, and cook in the microwave for 10 minutes, or until chicken is no longer pink, and juices run clear. If the chicken is not done after the 10 minutes, continue to cook at 1 1/2 minute intervals.\n",
        "picture_link": "17otDLzbyBdmcninPtgt9Hd9T1lbSsC"
    },
    {
        "title": "Broccoli Cheese Pie",
        "ingredients": [
            "1 head fresh broccoli, chopped ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/4 pound fresh mushrooms, sliced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBring about 1 inch water to a boil in a pot. Place the chopped broccoli in a steamer basket over boiling water, and steam 5 minutes, or until tender but firm.\nIn a bowl, mix the Cheddar cheese, 3/4 cup flour, 1/2 teaspoon salt, and mustard. Mix in 1/4 cup butter until evenly moist. Press into the bottom and sides of an 8 inch pie dish.\nMelt the 1 tablespoon butter in a skillet over medium heat, and saute the onion and mushrooms until tender. Stir in 2 tablespoons flour, half and half, 1 teaspoon salt, and nutmeg. Bring to a boil, and cook 1 minute. Remove from heat. Mix in steamed broccoli. Gradually stir in eggs. Transfer to the pie crust.\nBake 15 minutes in the preheated oven. Reduce heat to 375 degrees F (190 degrees C), and continue baking 20 minutes, until a knife inserted in the center comes out clean.\n",
        "picture_link": "3L3icJEKW/QS4nCkpViiEeHaLBJbNv2"
    },
    {
        "title": "Jelly Roll",
        "ingredients": [
            "1 cup sifted cake flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons 2% milk ADVERTISEMENT",
            "1/2 cup confectioners' sugar for dusting ADVERTISEMENT",
            "1 cup strawberry jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Line a 10x15 inch jellyroll pan with parchment paper.\nSift together the flour, baking powder and salt. Set aside. In a large bowl, beat eggs and sugar with an electric mixer until thick and pale, about 5 minutes. Stir in the vanilla and milk. Stir in the dry ingredients gradually. The batter will be thin. Pour into the prepared pan.\nBake for 8 to 10 minutes in the preheated oven, until the center springs back when pressed lightly. Don't over bake, or it may crack.\nGenerously dust a clean dish towel with confectioners' sugar. Turn the cake out onto the towel, and peel off the parchment paper. Gently roll up the cake using the towel, and let cool for about 10 minutes.\nUnroll the cake, and spread an even coating of jam onto the top. Roll the cake back up into a tight spiral, and remove the towel. Dust with confectioners' sugar before serving.\n",
        "picture_link": "esgOZDsxfx92.tVO/i.BodiWSCglw0a"
    },
    {
        "title": "Creamy Garlic Sauce",
        "ingredients": [
            "1/2 cup water, divided ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour half of the water into a saucepan, and bring to a boil over medium heat. Add the garlic and garlic powder, and boil until the water has almost evaporated, about 5 minutes. Stir in the heavy cream, parsley, salt, and pepper. Mix the cornstarch with the remaining water, and stir into the sauce. Cook, stirring constantly, until thickened, about 3 minutes.\n",
        "picture_link": "iUUoMgsBEtJ/DwO..Fd0b5TrLuUWbDW"
    },
    {
        "title": "Pork Green Chile",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 1/2 pounds cubed pork stew meat ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (4.5 ounce) can diced green chile peppers, drained ADVERTISEMENT",
            "1/2 (3.5 ounce) can chopped jalapeno peppers ADVERTISEMENT",
            "1/2 medium onion, chopped ADVERTISEMENT",
            "5 tablespoons tomato sauce ADVERTISEMENT",
            "3 1/2 cups water ADVERTISEMENT",
            "onion salt to taste ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large cast iron skillet over medium-high heat. Stir in cubed pork, and cook until nicely browned and cooked through, about 15 minutes. Remove skillet from heat, and allow to cool briefly.\nSprinkle flour over pork. With a wooden spoon, stir pork to coat, scraping the bottom of the skillet to loosen browned bits. Add chile peppers, jalapenos, and onions. Stir in tomato sauce and water. Season to taste with onion salt, garlic salt, and salt and pepper.\nReturn skillet to medium heat. Bring to a simmer, cover, and cook 30 minutes, stirring occasionally. Remove cover, and cook 10 minutes more.\n",
        "picture_link": "pspImLqooQw1pFiIK.uXoESoJ1ROr8q"
    },
    {
        "title": "Stir-Fry Broccoli With Orange Sauce",
        "ingredients": [
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1 teaspoon canola oil ADVERTISEMENT",
            "1 1/2 cups broccoli florets, bite-size ADVERTISEMENT",
            "1/2 cup sliced or chopped water chestnuts, drained ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon light soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add oils to a small skillet on medium-high heat. Add broccoli and water chestnuts; stir-fry 3 minutes. In a small bowl, combine remaining ingredients. Add to broccoli; lower heat and cook until sauce is thickened, 2 minutes.\n",
        "picture_link": "4NFsiW/hRoJoIjvcE.tKf2nanDGkwaS"
    },
    {
        "title": "Olive and Feta Pasta",
        "ingredients": [
            "8 ounces uncooked whole wheat spaghetti ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "8 ounces crimini mushrooms, sliced ADVERTISEMENT",
            "2 small zucchini, sliced ADVERTISEMENT",
            "dried oregano to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "12 black olives, pitted and sliced ADVERTISEMENT",
            "1 ounce crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain.\nHeat the olive oil in a skillet over medium heat, and saute the garlic 2 minutes. Mix in mushrooms and zucchini. Season with oregano, salt, and pepper. Stir in olives, and cook until heated through. Place pasta in the skillet, toss to coat, and continue cooking about 2 minutes. Top with feta cheese to serve.\n",
        "picture_link": "WSLzfHMWYK6UeV.b6.O6CxXZ3/uc8qC"
    },
    {
        "title": "Beef, Bean, and Beer Chili",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "2 teaspoons salt, plus more to taste ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons ground ancho chile powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (12 ounce) bottle beer ADVERTISEMENT",
            "1 teaspoon unsweetened cocoa powder ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "2 cups water, or as needed ADVERTISEMENT",
            "1 cup tomato puree ADVERTISEMENT",
            "2/3 cup diced poblano pepper ADVERTISEMENT",
            "2 (12 ounce) cans pinto beans, drained and rinsed well ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a pot over high heat. Drizzle in vegetable oil. Add diced onion, ground beef, and salt. Break up meat with wooden spoon into small pieces as it browns. After meat browns and releases its juices, continue stirring until the released liquid evaporates, about 4 minutes. Reduce heat to medium-high. Add garlic, chile powder, cumin, paprika, black pepper, and cinnamon. Cook and stir until mixture begins to darken, 3 or 4 minutes.\nStir in beer. Add cocoa powder, oregano, cayenne, water, and tomato puree; stir well. Bring to a simmer; adjust heat to medium-low. Simmer 30 minutes.\nStir in diced green pepper and pinto beans. If mixture becomes too thick, add a bit more water. Simmer until peppers are tender and flavors have blended, about 30 more minutes.\n",
        "picture_link": "IF/Ym.a83EO6sw1LR9ChkdI2TJkgiKq"
    },
    {
        "title": "Overnight Coconut Pecan Steel Cut Oats",
        "ingredients": [
            "1/3 cup steel cut oats ADVERTISEMENT",
            "1 tablespoon unsweetened shredded coconut ADVERTISEMENT",
            "1 tablespoon crushed pecans ADVERTISEMENT",
            "1/2 teaspoon brown sugar ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix oats, coconut, pecans, brown sugar, and cinnamon in a small container; top with 1/3 cup milk. Cover and refrigerate for 8 hours or overnight. Stir 1 tablespoon milk into oat mixture before serving.\n",
        "picture_link": "TGgqR24EGIofQUSxgOzt1d9gzJMIXfO"
    },
    {
        "title": "Hawaiian Pineapple Sweet & Sour Smoked Sausage",
        "ingredients": [
            "1 (14 ounce) package Hillshire Farm® Smoked Sausage, cut into 1/2-inch slices ADVERTISEMENT",
            "1 red bell pepper, seeded, chopped ADVERTISEMENT",
            "1/4 cup sweet chili garlic sauce* ADVERTISEMENT",
            "1 cup fresh pineapple, cut into 1/2-inch pieces ADVERTISEMENT",
            "3 cups cooked rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir sausage and bell peppers over medium-high heat for 5 minutes or until sausage is lightly browned and peppers are tender.\nAdd chili garlic sauce and pineapple; cook and stir for 5 minutes.\nServe over cooked rice.\n",
        "picture_link": "b1lMviIXm06orknKGJ9vfZnXc4cXH1e"
    },
    {
        "title": "Balsamic Glaze",
        "ingredients": [
            "2 cups balsamic vinegar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix balsamic vinegar with brown sugar in a saucepan over medium heat, stirring constantly until sugar has dissolved. Bring to a boil, reduce heat to low, and simmer until glaze is reduced by half, about 20 minutes. Glaze should coat the back of a spoon. Let cool and pour into a jar with a lid; store in refrigerator.\n",
        "picture_link": "q4kK9If1vXW0nlMjWM89f4abwCdavGK"
    },
    {
        "title": "Chewy No Bake Granola Bars ",
        "ingredients": [
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup steel-cut oats ADVERTISEMENT",
            "1 cup crispy rice cereal ADVERTISEMENT",
            "1/2 cup chopped mixed dried fruit ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup mini chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13-inch baking dish.\nMix rolled oats, steel-cut oats, rice cereal, dried fruit, and almonds together in a large bowl.\nMelt butter in a saucepan over medium heat; add brown sugar, honey, and vanilla extract. Whisk until sugar is completely dissolved, about 2 minutes. Pour over oat mixture; stir to combine.\nSpread oat mixture into prepared baking dish. Press chocolate chips into top. Refrigerate until chilled, about 1 hour.\n",
        "picture_link": "oWo5T9Z39OKVFuO046aC16iX3SL1CqC"
    },
    {
        "title": "Super Easy Slow Cooker Chicken Enchilada Meat",
        "ingredients": [
            "2 cups chicken broth ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1/3 cup chili powder ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon oregano ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste (optional) ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend chicken broth, tomatoes, chili powder, flour, garlic, cumin, oregano, salt, and cayenne pepper in a blender until smooth.\nPut chicken breast in bottom of a slow cooker; pour blended enchilada sauce over the chicken.\nCook on Low 8 to 9 hours (or 4 to 6 hours on High). Shred the chicken with 2 large forks and stir into the sauce.\n",
        "picture_link": "v0G/O6szQjvLzRH.vjFZq6g8JTVPosS"
    },
    {
        "title": "Crunchy French Onion Chicken",
        "ingredients": [
            "1 1/3 cups French-fried onions, crushed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nSpread crushed onions in a shallow bowl. Pour beaten egg into a separate shallow bowl.\nDip chicken into beaten egg, then press into crushed onions. Gently tap chicken to let loose pieces fall away. Put breaded chicken to a baking sheet.\nBake chicken until no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "QL7VKhr.MuYRf3J3ZEDrVmCXyQ6jZFC"
    },
    {
        "title": "Paleo Banana Bread",
        "ingredients": [
            "1 serving cooking spray ADVERTISEMENT",
            "2 cups almond flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1/4 cup agave syrup ADVERTISEMENT",
            "2 ripe bananas, mashed ADVERTISEMENT",
            "1/2 teaspoon vanilla bean paste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray loaf pan with cooking spray.\nMix together almond flour, ground cinnamon, and baking soda in a bowl.\nBeat two eggs in a bowl. Mix in water, almond extract, agave syrup, mashed bananas, and vanilla bean paste. Add banana mixture to almond flour mixture; mix until no dry areas are visible. Pour batter into the prepared loaf pan.\nBake banana bread in the preheated oven until brown and crisp around the edges, about 45 minutes.\n",
        "picture_link": "Dm0V0J9jaOHGmsUmh4UN.fBc7C7q6c2"
    },
    {
        "title": "Slow Cooker Chicken Dinner",
        "ingredients": [
            "6 red potatoes, cut into chunks ADVERTISEMENT",
            "1/2 pound baby carrots, halved ADVERTISEMENT",
            "10 skinless, boneless chicken thighs, trimmed of excess fat ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/8 teaspoon garlic salt ADVERTISEMENT",
            "2 tablespoons mashed potato flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes and carrots in a slow cooker; top with chicken thighs.\nCombine cream of chicken soup, cream of mushroom soup, and garlic salt in a bowl. Pour over chicken thighs.\nCover and cook chicken mixture on High for 3 1/2 hours. Stir potato flakes into soup mixture to thicken; cook for an additional 30 minutes.\n",
        "picture_link": "fLmzY6fiZ6wNVqZ050emAf73ufv.qXK"
    },
    {
        "title": "Icelandic Pepper Cookies",
        "ingredients": [
            "1 1/4 cups butter, softened ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "3/4 cup light corn syrup ADVERTISEMENT",
            "2 small eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons ground cloves ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream butter and sugar. Stir in corn syrup and eggs; cream well. Sift together flour, baking powder, baking soda, salt, cinnamon, cloves, ginger, and pepper. Add dry ingredients to the butter mixture, and mix until smooth. Refrigerate dough over night.\nPreheat oven to 350 degrees F (175 degrees C).\nRoll out dough to 1/4 inch thickness. Cut out cookies with a 2 inch round cookie cutter. Place at least 1 inch apart on cookie sheet and bake for 8 to 10 minutes in preheated oven.\n",
        "picture_link": "Z8hNgskwXurkzZCCHRtQeLMwHJLQD2S"
    },
    {
        "title": "Eskimo Cookies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soften butter and beat well. Add sugar and mix well. Add cocoa, vanilla and water. Then add oatmeal.\nShape into 36 balls and roll in confectioners' sugar. Keep in refrigerator.\n",
        "picture_link": "/Vuvacef4qvX0hvd8RSVO8eYDP01Ipe"
    },
    {
        "title": "Cherry Winks",
        "ingredients": [
            "3/4 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup dates, pitted and chopped ADVERTISEMENT",
            "1/3 cup maraschino cherries, chopped ADVERTISEMENT",
            "2 1/2 cups crushed cornflakes cereal ADVERTISEMENT",
            "10 maraschino cherries, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets.\nCream the shortening with the sugar. Blend in the eggs, milk and vanilla.\nSift together the flour, baking powder, baking soda and salt. Add the flour mixture to the creamed mixture and mix well. Stir in the chopped pecans, chopped dates and 1/3 cup maraschino cherries.\nShape teaspoonful sized chunks of dough into balls. Roll each ball in the crushed corn flakes. Place balls on the prepared baking sheets and top each cookie with 1/4 maraschino cherry.\nBake at 375 degrees F (190 degrees C) for 10 to 12 minutes. Let cool completely before storing in airtight containers.\n",
        "picture_link": "2Qk13cTVJxLm7a1Uv605BuOsGnoLXDu"
    }
]