[
    {
        "title": "Bob's Stuffed Mushrooms",
        "ingredients": [
            "20 mushrooms, stems removed ADVERTISEMENT",
            "2 (6.5 ounce) cans minced clams, drained ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "3/4 cup Italian bread crumbs ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "2 tablespoons Italian seasoning ADVERTISEMENT",
            "1/2 tablespoon ground black pepper ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13 inch baking dish with a sheet of aluminum foil, and lightly spray with nonstick cooking spray. Clean the mushrooms carefully with a damp paper towel or a soft mushroom brush, and place into the prepared pan upside down.\nPlace the clams, 1/2 cup of melted butter, onion, Parmesan cheese, bread crumbs, and garlic in a large mixing bowl. Season with parsley, Italian seasoning, and pepper; mix well. Fill the mushroom caps with the clam mixture, and round over the tops. Sprinkle with the shredded mozzarella cheese, and drizzle with the remaining 1 cup of butter.\nBake in the preheated oven until the mushrooms are tender, and the mozzarella cheese has lightly browned, 25-30 minutes.\n",
        "picture_link": "OZiX11NsmT532BsQXGC4KpRxdDQwzYS"
    },
    {
        "title": "Sister Slaw",
        "ingredients": [
            "1 bunch Lacinato kale (dinosaur kale), shredded ADVERTISEMENT",
            "1/2 head green cabbage, shredded ADVERTISEMENT",
            "1/2 head red cabbage, shredded ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "1 small red onion, minced ADVERTISEMENT",
            "2/3 cup olive oil ADVERTISEMENT",
            "1/3 cup balsamic vinegar ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1 teaspoon maple syrup ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the kale, green cabbage, red cabbage, carrots, and onion in a very large bowl; set aside.\nWhisk together the olive oil, vinegar, lime juice, maple syrup, salt, and pepper. Pour the dressing over the vegetables, and stir thoroughly, making sure to coat the vegetables very well. Chill in the refrigerator for two hours before serving.\n",
        "picture_link": ".XnclAo7732/Upp/hzELtApvfWH1EcK"
    },
    {
        "title": "Warm Steak and Potato Salad",
        "ingredients": [
            "1 pound new potatoes ADVERTISEMENT",
            "1 pound beef sirloin steak ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "8 cups mixed baby salad greens ADVERTISEMENT",
            "1 pint cherry tomatoes, halved ADVERTISEMENT",
            "2 tablespoons minced shallot ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1/4 teaspoon dried tarragon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a pot, and fill with enough water to cover. Bring to a boil and cook until tender but still firm, about 10 minutes. Drain and cover to keep warm.\nPreheat oven to broil or preheat a grill for medium-high heat. Season both sides of steak with salt and pepper. Broil or grill steaks for 6 to 8 minutes per side, or to desired doneness.\nMeanwhile, whisk together oil, vinegar, mustard, and tarragon for dressing; season dressing to taste with salt and pepper.\nDivide greens, tomatoes, and shallots among 4 plates. Cut warm, unpeeled potatoes into quarters; slice steak into 1/4 inch thick strips. Top salad greens with steak and potatoes; drizzle dressing over salads. Serve warm.\n",
        "picture_link": "8Jfdkb5hy1khntnZ87MiJmvuVqVQ3w2"
    },
    {
        "title": "Lobster Mac and Cheese",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 (2 pound) lobster, split ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 shallot, chopped ADVERTISEMENT",
            "10 black peppercorns ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "5 tablespoons all-purpose flour ADVERTISEMENT",
            "1 pound shredded Gruyere cheese ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup grated Romano cheese ADVERTISEMENT",
            "kosher salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Reserve about 2 cups of the hot pasta water, then drain the pasta in a colander set in the sink, and rinse with cold water to cool. Set aside.\nReturn the pasta water to the large pot, and place the lobster halves in the pot, cut-side up. Return the water to a boil, then reduce heat to medium-low, cover, and steam the lobster just until the meat firms and turns opaque, about 3 minutes. Remove the lobster and allow to cool for a few minutes, then remove the meat and cut into bite sized pieces. Reserve the shells.\nMelt 2 tablespoons of butter in a saucepan over medium heat. Stir in the onion and cook until the onion has softened and turned translucent, about 5 minutes; scrape the onions into a small bowl and set aside. Place the reserved lobster shells, garlic, shallots, peppercorns, and milk into the saucepan. Bring to a gentle simmer over medium heat, and cook for 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nMelt 5 tablespoons of butter in a saucepan over medium-low heat. Whisk in the flour, and stir until the mixture becomes paste-like and light golden brown, about 10 minutes. Strain the milk through a mesh sieve. Gradually whisk the milk into the flour mixture, and bring to a simmer over medium heat. Cook and stir until the mixture is thick and smooth, 10 to 15 minutes.\nStir the Gruyere, Cheddar, and Romano cheeses into the thickened milk mixture until melted and smooth. Season to taste with salt and pepper, then stir in the reserved lobster, onions, and macaroni. Pour the macaroni into a 4 quart casserole and smooth the top. Sprinkle evenly with the panko crumbs.\nBake in the preheated oven until the sauce is bubbly, and the top is golden brown, 8 to 12 minutes.\n",
        "picture_link": "vIVDCrrHHhB50gKvcCySG2G7QVonB8u"
    },
    {
        "title": "Stuffed Filet Mignon Bites",
        "ingredients": [
            "4 (6 ounce) filet mignon steaks ADVERTISEMENT",
            "1 (16 ounce) bottle Italian dressing ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup minced jalapeno pepper ADVERTISEMENT",
            "20 slices thinly sliced bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice the steaks into 1/2-inch wide strips. Pound the strips to about half their original thickness. Place the steak in a bowl; pour the Italian dressing over the meat; allow to marinate at least 2 hours.\nMix together the cream cheese and jalapeno pepper in a bowl; set aside. Remove the strips from the marinade and lay out on a flat surface. Spread about 1 teaspoon of the cream cheese mixture on each strip.\nPreheat an outdoor grill for high heat and lightly oil grate.\nRemove the strips from the marinade and lay on a flat surface. Spread about 1 teaspoon of the cream cheese mixture on each strip. Fold the meat around the cream cheese mixture to form a ball. Wrap each ball with a slice of bacon. Secure bacon with water-soaked toothpicks or metal skewers.\nCook on preheated grill until steak is no longer pink, about 4 minutes per side.\n",
        "picture_link": "B20jy6Ez5cZolZQu9BCo2H5u3hRnUvG"
    },
    {
        "title": "Fried Pickles",
        "ingredients": [
            "1/2 cup buttermilk ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) jar dill pickle slices ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 cups fine cornmeal ADVERTISEMENT",
            "1 teaspoon seafood seasoning, such as Old Bay™ ADVERTISEMENT",
            "1/4 teaspoon Cajun seasoning ADVERTISEMENT",
            "1 quart oil for frying ADVERTISEMENT",
            "1/2 teaspoon Cajun seasoning ADVERTISEMENT",
            "1 (12 ounce) jar buttermilk ranch dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover a plate with parchment paper or wax paper. In a shallow dish, combine buttermilk, salt, and pepper. Place pickles in mixture and set aside.\nPour the flour, cornmeal, seafood seasoning, and 1/4 teaspoon Cajun seasoning into a large, resealable plastic bag; shake to mix well. Add pickles a few at a time and tumble gently to coat evenly with the flour mixture. Remove and place on prepared plate.\nHeat oil to 365 degrees F (180 degrees C) in deep-fryer or heavy deep skillet.\nFry pickles in several batches until golden brown and slightly crisp on the outside with a moist interior, 1 to 2 minutes. Drain on paper towels.\nIn a small bowl, combine buttermilk ranch dressing with 1/2 teaspoon Cajun seasoning; blend. Serve as a dipping sauce for warm pickles.\n",
        "picture_link": "U0mEZJt4gytFW9/qjf4ww6EqgOufsh."
    },
    {
        "title": "Hungarian Cucumber Salad",
        "ingredients": [
            "2 large seedless English cucumbers, sliced thin ADVERTISEMENT",
            "1 extra large onions, sliced thin ADVERTISEMENT",
            "1/4 cup chopped fresh dill ADVERTISEMENT",
            "3 tablespoons white vinegar ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly toss cucumber slices, onion slices, and chopped dill together in a large bowl.\nPour vinegar over cucumber mixture; toss to coat.\nPour oil over cucumber mixture; toss to coat.\nSeason with salt and black pepper.\n",
        "picture_link": "ZgS7BKWpDXbW7NXTDroIi5hVyyHAMI."
    },
    {
        "title": "Spicy White Chili with Chicken",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped (optional) ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 (15.5 ounce) cans Great Northern beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1 cup corn kernels ADVERTISEMENT",
            "1 (7 ounce) can diced green chiles ADVERTISEMENT",
            "2 tablespoons minced fresh cilantro ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 cooked chicken breast halves, cubed ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat; cook and stir onion, jalapeno, and garlic until onion is tender, about 5 minutes. Add chicken broth, Great Northern beans, garbanzo beans, corn, green chiles, cilantro, lime juice, cumin, and black pepper; bring to a boil. Reduce heat to medium-low and stir chicken into broth. Cover and simmer chili for 45 minutes, stirring occasionally.\nWhisk cornstarch and water together in a bowl; stir into chili and bring to a boil. Cook and stir until chili is thickened, about 5 minutes.\n",
        "picture_link": "igakUGuYVWmW/ytPlvbRHlDeZKx2xGa"
    },
    {
        "title": "Alisha's Scalloped Potatoes and Ham",
        "ingredients": [
            "8 potatoes, peeled and cut into 1/4-inch slices ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese, or to taste ADVERTISEMENT",
            "1 pound ham, diced ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch onion powder, or to taste ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nPreheat oven to 350 degrees F (175 degrees C).\nGrease a 9x13-inch baking dish.\nTransfer half of the cooked potatoes to a large bowl; add milk, sour cream, butter, and 1/4 cup Cheddar cheese.\nMash with a potato masher or fork until creamy.\nStir ham, garlic powder, onion powder, salt, black pepper, and remaining potato slices into the mashed potato mixture until well mixed.\nPour ham and potato mixture into prepared baking dish; sprinkle remaining 1/4 cup Cheddar cheese over mixture.\nBake in the preheated oven until cheese is melted, 20 to 30 minutes. Cool slightly before serving.\n",
        "picture_link": "dECNY9P7Rli7OijsMzFBuFY.AI.0oia"
    },
    {
        "title": "Tomato Mozzarella Salad",
        "ingredients": [
            "3 large tomatoes, sliced ADVERTISEMENT",
            "8 ounces mozzarella cheese, sliced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup minced fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tomato slices, alternating with mozzarella slices, on a large serving platter.\nCombine oil, balsamic vinegar, salt, and pepper in a jar with a tight-fitting lid; shake well. Drizzle over tomatoes and mozzarella; sprinkle with basil.\n",
        "picture_link": "HzUe4Pft3YEPNx25enznEfchY7acBEW"
    },
    {
        "title": "Traditional Sauerbraten",
        "ingredients": [
            "3 pounds beef rump roast ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "1 cup red wine vinegar, or to taste ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "10 whole cloves, or more to taste ADVERTISEMENT",
            "2 bay leaves, or more to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "10 gingersnap cookies, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beef rump roast, onions, vinegar, water, 1 tablespoon salt, 1 tablespoon black pepper, sugar, cloves, and bay leaves in a large pot. Cover and refrigerate for 2 to 3 days, turning meat daily. Remove meat from marinade and pat dry with paper towels, reserving marinade.\nSeason flour to taste with salt and black pepper in a large bowl. Sprinkle flour mixture over beef.\nHeat vegetable oil in a large Dutch oven or pot over medium heat; cook beef until brown on all sides, about 10 minutes. Pour reserved marinade over beef, cover, and reduce heat to medium-low. Simmer until beef is tender, 3 1/2 to 4 hours. Remove beef to a platter and slice.\nStrain solids from remaining liquid and continue cooking over medium heat. Add gingersnap cookies and simmer until gravy is thickened about 10 minutes. Serve gravy over sliced beef.\n",
        "picture_link": "gQ5BD7V5iJ.OxyteF1RFrUlTvWTq9A."
    },
    {
        "title": "Pumpkin Curry with Lentils and Apples",
        "ingredients": [
            "1 cup red lentils ADVERTISEMENT",
            "1 cup brown lentils ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "1/2 teaspoon turmeric ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "2 tomatoes, cored and chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 tablespoons curry powder, or to taste ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "2 cups peeled, cubed (1-inch), seeded pumpkin ADVERTISEMENT",
            "2 potatoes, unpeeled and chopped ADVERTISEMENT",
            "2 carrots, peeled and diced ADVERTISEMENT",
            "2 cups packed fresh spinach, chopped ADVERTISEMENT",
            "1 Granny Smith apple, unpeeled, cored and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the red and brown lentils in a pan with the water and turmeric. Cook over medium-low heat until tender, about 45 minutes. Drain, reserving 2 1/2 cups of the cooking liquid.\nMeanwhile, heat the canola oil in a large, deep pot over medium heat. Stir in the onion, and cook until tender and transparent, about 5 minutes. Stir in the tomatoes and garlic; cook 5 minutes more, stirring occasionally. Mix in the curry powder, cumin, salt, pepper, and cloves. Add the cooked lentils, reserved cooking liquid, pumpkin, potatoes, and carrots. Cover, and cook over medium-low heat until the vegetables are tender, 35 to 45 minutes. Stir in the spinach and apple. Cook until the pumpkin can be easily pierced with a fork, about 15 minutes more. Adjust seasonings to taste.\n",
        "picture_link": "6/Vt/V4CT7zkJZsnZyYQloAGeOreFBG"
    },
    {
        "title": "Banoffee Pavlova",
        "ingredients": [
            "1 cup castor sugar or superfine sugar ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "1 pinch cream of tartar ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 dash vanilla extract ADVERTISEMENT",
            "1 teaspoon white wine vinegar ADVERTISEMENT",
            "2 small bananas, sliced ADVERTISEMENT",
            "1 cup caramel ice cream topping ADVERTISEMENT",
            "1 tablespoon grated semisweet chocolate, for garnish ADVERTISEMENT",
            "2 cups sweetened whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper or aluminum foil, and trace an 8 inch circle onto the surface.\nIn a small cup or bowl, stir together the sugar, cornstarch, and cream of tartar. In a large glass or metal bowl, whip the egg whites with salt, vanilla, and vinegar until soft peaks form. Gradually sprinkle in the sugar mixture and continue to whip until stiff and shiny. Mound the mixture into the traced circle on the baking sheet. Flatten the top and smooth the sides using a metal spatula.\nPlace in the preheated oven, and immediately reduce the heat to 300 degrees F (150 degrees C). Bake for 1 to 1 1/2 hours, until a pale golden brown. Turn off the oven, and leave the door slightly ajar with the pavlova inside until completely cooled.\nJust before serving time, invert the cooled pavlova onto a serving plate, and top with slices of banana. Cover banana with caramel sauce. Top that with whipped cream and sprinkle with grated chocolate.\n",
        "picture_link": "32i0fmVivDP753OKxvQHoNMg2FHsaWi"
    },
    {
        "title": "Tuna Egg Sandwich",
        "ingredients": [
            "1 (5 ounce) can tuna, drained ADVERTISEMENT",
            "3 hard-cooked eggs, peeled and chopped ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 slices whole wheat bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the tuna, eggs, celery and mayonnaise. Season with salt and pepper to taste. Place half of the mixture onto 1 slice of bread and the other half on another slice of bread. Top with remaining slices of bread. Serve.\n",
        "picture_link": "G9K3SaU0VemD8MNIvx77uE3Hx9ynSeS"
    },
    {
        "title": "Homemade Cereal",
        "ingredients": [
            "7 cups quick cooking oats ADVERTISEMENT",
            "1 cup wheat germ ADVERTISEMENT",
            "1 cup wheat bran ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "1 teaspoon ground nutmeg (optional) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup chopped dates ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup flaked coconut (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C).\nIn a large bowl, mix oats, wheat germ, and wheat bran.\nIn a medium bowl, blend brown sugar, vegetable oil, honey, and water. Mix in vanilla extract, cinnamon, nutmeg, and salt. Stir the brown sugar mixture into the oat mixture until evenly moist, and transfer to a large, shallow baking dish.\nBake 45 minutes in the preheated oven, stirring every 15 minutes, until lightly brown. Mix dates, pecans, and coconut into the dish, and continue baking about 15 minutes. Allow to cool, and store in airtight containers.\n",
        "picture_link": "VLg.ktnLpvTKcXwD8oRKvanrlmTs8sK"
    },
    {
        "title": "Granola Bars",
        "ingredients": [
            "2 cups rolled oats ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 tablespoons creamy peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9-inch square baking dish.\nSpread the oats and coconut evenly across a baking sheet.\nToast oats and coconut in preheated oven until browned, about 10 minutes; transfer to a large mixing bowl.\nMix honey, peanut butter, vanilla extract, and salt in a saucepan over medium-low heat. Cook and stir until smooth. Pour the honey mixture over the oats and coconut; stir to coat. Spread the mixture evenly into the prepared baking dish.\nBake in preheated oven until beginning to dry, about 15 minutes for crunchy granola bars, less if you like them chewy. Cool completely before cutting.\n",
        "picture_link": "x18KZu7oAwIHso1fWmi4D5dsKCbMaQe"
    },
    {
        "title": "Serbian Cevapcici",
        "ingredients": [
            "1 1/2 pounds ground pork ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 pound ground lamb ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for medium-low heat.\nIn a large bowl, combine the ground pork, ground beef, ground lamb and egg white. Add the garlic, salt, baking soda, black pepper, cayenne pepper and paprika. Mix well using your hands, and form into finger length sausages about 3/4 inch thick.\nLightly oil the grilling surface. Grill sausages until cooked through, turning as needed, about 30 minutes.\n",
        "picture_link": "8uYwPBanfmEMhtf6IjqNOq4Z5NVVGHa"
    },
    {
        "title": "Real Poutine",
        "ingredients": [
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1 (10.25 ounce) can beef gravy ADVERTISEMENT",
            "5 medium potatoes, cut into fries ADVERTISEMENT",
            "2 cups cheese curds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep fryer or deep heavy skillet to 365 degrees F (185 degrees C). While the oil is heating, you can begin to warm your gravy.\nPlace the fries into the hot oil, and cook until light brown, about 5 minutes. Make the fries in batches if necessary to allow them room to move a little in the oil. Remove to a paper towel lined plate to drain.\nPlace the fries on a serving platter, and sprinkle the cheese over them. Ladle gravy over the fries and cheese, and serve immediately.\n",
        "picture_link": "2vpTv50lvJDrxaAMTiPn9YukUBtXRze"
    },
    {
        "title": "Quick Szechwan Sauce",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 red chile peppers, seeded and finely chopped ADVERTISEMENT",
            "2 teaspoons chopped fresh ginger ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "5 tablespoons sugar ADVERTISEMENT",
            "5 tablespoons ketchup ADVERTISEMENT",
            "5 tablespoons vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, stir together olive oil, chile peppers, ginger, and garlic. Mix in sugar, ketchup, and vinegar.\n",
        "picture_link": "jxrBwomrpc/PguvH0ebIz.bU2RkxWP2"
    },
    {
        "title": "Fresh Pear Bread",
        "ingredients": [
            "2 pears - peeled, cored and shredded ADVERTISEMENT",
            "1 pear - peeled, cored and mashed ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 egg white, lightly beaten ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup instant vanilla pudding mix ADVERTISEMENT",
            "1 1/2 teaspoons cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a 5x9 inch loaf pan.\nIn a bowl, mix the shredded pears, mashed pear, egg, egg white, water, and vanilla. In a separate bowl, mix the flour, sugar, pudding mix, cinnamon, baking soda, salt, and baking powder. Stir the pear mixture into the flour mixture just until moistened. Transfer to the prepared loaf pan.\nBake 1 hour in the preheated oven, or until a knife inserted in the center comes out clean.\n",
        "picture_link": "lf1GgWExbqKt8/iBHxpJ6jo7/ALO7mu"
    },
    {
        "title": "Easy Frozen Margaritas",
        "ingredients": [
            "2 quarts ice cubes ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen limeade concentrate ADVERTISEMENT",
            "12 fluid ounces tequila (measure with empty limeade can) ADVERTISEMENT",
            "1/4 cup Cointreau ADVERTISEMENT",
            "Garnish: ADVERTISEMENT",
            "margarita or kosher salt for the rims ADVERTISEMENT",
            "lime slices cut in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Working in 2 batches, place 1 quart ice cubes in a blender. Add 1/2 can limeade, 6 ounces tequila and 2 tablespoons Cointreau. Blend at highest speed until drink is almost smooth. Pour into a pitcher and repeat with remaining ingredients. Store in the freezer.\nTo salt the margarita glasses, pour a single layer of salt on a salad plate. Moisten each glass rim with lime; dip each rim in the salt. Pour margaritas into each glass; garnish with lime. Serve immediately.\n",
        "picture_link": "phVd2PBEzSoFDclT/.Y4CkKNmHaWBmG"
    },
    {
        "title": "Gourmet Pretzel Rods",
        "ingredients": [
            "1 (14 ounce) package individually wrapped caramels, unwrapped ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "15 pretzel rods ADVERTISEMENT",
            "1/2 (14 ounce) package candy-coated chocolate pieces ADVERTISEMENT",
            "1 1/2 cups chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a microwave safe dish, combine caramels and water. Microwave for 2 to 2 1/2 minutes or until smooth, stirring after each minute.\nDip a pretzel rod into melted caramel. Reserve about an inch at the end to use as a handle, and spread smooth with a spatula or the back of a spoon. Attach 12 chocolate pieces, then roll in chopped peanuts. Place on wax paper until set.\n",
        "picture_link": "8gSqAi68Ifgwem4AsPFiAiHUMx.1Ut."
    },
    {
        "title": "Dad's Down Home Cornbread and Jalapeno Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/2 pound ground pork ADVERTISEMENT",
            "3/4 cup canned whole kernel corn ADVERTISEMENT",
            "1/2 cup crumbled cornbread ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup shredded pepperjack cheese ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "3 fresh jalapeno peppers, seeded and minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\nMix the ground beef and ground pork in a large bowl. In a separate bowl, mix the corn, cornbread, sour cream, pepperjack cheese, onion, milk, egg, jalapeno peppers, garlic, kosher salt, and pepper. Gently mix the corn mixture into the meat mixture. Form into a rounded loaf shape, and place in the prepared baking dish\nBake 1 hour in the preheated oven, to a minimum internal temperature of 160 degrees F (72 degrees C). Loosely cover with aluminum foil during the last 15 minutes of cook time if the loaf is overly brown.\n",
        "picture_link": "4WK76grpave5asmRZCsFalcqEvZ96M6"
    },
    {
        "title": "Grilled Chicken and Portobello Lasagna Rollups",
        "ingredients": [
            "18 lasagna noodles, cooked and drained ADVERTISEMENT",
            "2 cups marinara sauce ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "2 portobello mushrooms, diced ADVERTISEMENT",
            "1 cup frozen chopped spinach ADVERTISEMENT",
            "2 cups diced cooked chicken ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 cups Alfredo sauce ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup pine nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the lasagna noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the noodles are cooked, but still firm to the bite, about 8 minutes; drain and rinse.\nPreheat oven to 375 degrees F (190 degrees C). Spread the marinara sauce in the bottom of a 9x13 glass baking dish; set aside.\nHeat oil in a skillet over medium heat; cook and stir mushrooms until they soften, about 5 minutes. Stir in spinach, and cook until hot; remove from heat.\nStir together the chicken, ricotta cheese, Parmesan cheese, oregano, and the cooked spinach mixture in a large bowl. Season to taste with salt and black pepper. Spread about 1/4 cup of the mixture on each lasagna noodle. Roll the noodle up, and place seam-side down into the prepared baking dish. Repeat for each noodle. Spoon Alfredo sauce over the rollups.\nBake, covered, in the preheated oven for 40 minutes. Uncover; sprinkle with mozzarella cheese and pine nuts. Return to the oven and bake until the cheese is melted and bubbly and the pine nuts are toasted, about 10 minutes. Serve hot.\n",
        "picture_link": "XacUrGF1Gj.e6eZhg6Vp0m8csNuM6Y2"
    },
    {
        "title": "Broiled Grapefruit",
        "ingredients": [
            "4 grapefruit ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "4 teaspoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler.\nCut the grapefruits in half, and use a small serrated knife to cut out the sections in the halves. Spoon the sections and juice into a bowl, then scrape out all of the remaining thick skins and pulp. Spoon the sections from the bowl back into the halves. This is best done one half at a time.\nSprinkle sugar and cinnamon over the top of each grapefruit half, adjusting as you see fit. Dot with butter. Place the halves on a cookie sheet.\nBroil for 3 to 5 minutes, until the butter is melted and sugar is starting to turn brown.\n",
        "picture_link": "qhG8lKQVQRaizbdpZrQ5bgLVQnNNCQO"
    },
    {
        "title": "Orange Tapioca Salad",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 (3 ounce) package orange flavored Jell-O® mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (3 ounce) package instant tapioca pudding mix ADVERTISEMENT",
            "1 (15 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 (8 ounce) tub frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water to a boil in a large saucepan. Whisk in the orange gelatin mix, vanilla pudding mix and tapioca pudding mix. Return to a boil and cook for 1 minute, stirring constantly. Remove from the heat and allow to cool completely. Fold in mandarin oranges, pineapple and whipped topping. Transfer to a serving bowl and refrigerate for at least 2 hours. Fluff the top using a spoon before serving.\n",
        "picture_link": "i6CEqqCmaXOVu.YDqeNyWuiN6PH7U8a"
    },
    {
        "title": "Sweeper Steak",
        "ingredients": [
            "2 teaspoons sesame oil ADVERTISEMENT",
            "1 1/2 pounds beef stew meat, cut into 1 inch cubes ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup, undiluted ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 1 quart casserole dish or larger with sesame oil.\nPlace the beef, cream of mushroom soup, soup mix and onion into the prepared baking dish and stir to blend.\nCover and cook for 1 hour, or until meat is tender.\n",
        "picture_link": "AFPO74ORp67fdqXrDD5JgG0mRQL6/Qm"
    },
    {
        "title": "Smoked Salmon Frittata",
        "ingredients": [
            "4 tablespoons olive oil ADVERTISEMENT",
            "1/4 medium onion, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 ounces pepper smoked salmon ADVERTISEMENT",
            "8 black olives, chopped ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 tablespoons heavy cream ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nHeat olive oil in an 8 inch oven-safe skillet over medium heat. Add onion, and season with a little salt and pepper. Cook, stirring until translucent. Add the salmon and olives; cook and stir briefly to release the flavors.\nIn a medium bowl, whisk together the eggs, milk and cream. Pour over the salmon and onion, and stir gently. Scatter cubes of cream cheese over the top. Cook over medium heat without stirring, until the edges appear firm.\nPlace the skillet in the preheated oven, and bake for 20 minutes, or until nicely browned and puffed. Flip onto a serving plate, and cut into wedges to serve.\n",
        "picture_link": ".oW0K2ta.0mExyDaAsCyhvAXx0YTWZW"
    },
    {
        "title": "Black-Eyed Peas and Gumbo",
        "ingredients": [
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 1/2 cups chopped okra ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "3/4 cup chopped celery ADVERTISEMENT",
            "3 cloves garlic, peeled and minced ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 cups chopped tomatoes ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/2 pound cooked ham, cubed ADVERTISEMENT",
            "1 (15.5 ounce) can black-eyed peas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/3 cup oil in a medium saucepan over medium low heat, and whisk in flour. Whisking constantly, cook 5 to 7 minutes, until a golden brown roux has formed.\nHeat 2 tablespoons oil in a large, heavy saucepan over medium high heat. Stir in okra, onion, celery, and garlic, and cook 10 minutes, or until tender.\nThoroughly blend roux into the vegetable mixture. Stir in water, tomatoes, parsley, salt, thyme, cayenne pepper, pepper, and bay leaves. Bring to a boil, reduce heat, and simmer 20 minutes, stirring occasionally.\nMix in ham, and continue cooking 15 minutes, until tender.\nStir in black-eyed peas, and continue cooking until heated through.\n",
        "picture_link": "Vy5PFmxB6Ow2GnFL0xNSYNK2Dfr.7Sy"
    },
    {
        "title": "Lemon Posset",
        "ingredients": [
            "3 cups heavy cream ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "3 lemons, juiced ADVERTISEMENT",
            "3 tablespoons additional heavy cream for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, stir together 3 cups of cream and sugar. Bring to a boil, and cook for 2 to 3 minutes. Stir in the lemon juice. Pour into serving glasses, and refrigerate until set, about 5 hours. Pour a little more cream over the tops just before serving.\n",
        "picture_link": "MuzycNueJPsi4MAkeb.ERvQuV57hh32"
    },
    {
        "title": "Brine for Smoked Salmon",
        "ingredients": [
            "1 gallon water ADVERTISEMENT",
            "1 cup kosher salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "lemon pepper to taste ADVERTISEMENT",
            "1 (3 ounce) package dry crab and shrimp seasoning mix ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "4 cloves garlic, crushed or to taste ADVERTISEMENT",
            "1 dash hot pepper sauce (optional) ADVERTISEMENT",
            "4 lemons, sliced and crushed ADVERTISEMENT",
            "2 oranges, sliced and crushed ADVERTISEMENT",
            "1 lime, sliced and crushed ADVERTISEMENT",
            "1 large yellow onion, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the water into a large bowl or small bucket. If you must use a pot, use one that does not contain aluminum. Stir in the kosher salt, white sugar, brown sugar, lemon pepper, parsley and seasoning mix. Add the garlic, hot pepper sauce, lemons, oranges, lime and onion.\nSoak your salmon in this brine in the refrigerator for 12 to 36 hours. Smoke using your desired method (see Cook's Note).\n",
        "picture_link": "r18vOTKAjFpy3tE/1W7ZnIFKmsH2oxa"
    },
    {
        "title": "Quick and Easy Chicken Chili",
        "ingredients": [
            "1 (15.5 ounce) can corn ADVERTISEMENT",
            "1 (15.5 ounce) can white hominy ADVERTISEMENT",
            "2 (15.5 ounce) cans pinto beans ADVERTISEMENT",
            "2 (15.5 ounce) cans kidney beans ADVERTISEMENT",
            "1 (12 ounce) jar salsa ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 pound shredded cooked chicken ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the corn, hominy, pinto beans, and kidney beans in a large saucepan over medium heat; bring to a boil. Stir in the salsa, chili powder, cumin, and water; return to a boil. Cook another 15 minutes. Stir in the chicken to serve.\n",
        "picture_link": "mtCYi088PDI8vhOBdLEc7WNuGLhzb0q"
    },
    {
        "title": "Roast Beef Stuffed Shells",
        "ingredients": [
            "12 ounces jumbo pasta shells ADVERTISEMENT",
            "1 1/2 pounds thinly sliced deli roast beef ADVERTISEMENT",
            "4 (10.25 ounce) cans beef gravy ADVERTISEMENT",
            "1 (10 ounce) bottle cream-style horseradish sauce ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease 2 - 9x13 inch baking dishes.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the pasta shells, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Drain well in a colander set in the sink and place shells on a sheet of wax paper to cool.\nCombine the roast beef and the gravy in a large saucepan and place over medium-low heat. Cook for 10 minutes or until heated through.\nUse a slotted spoon to fill each shell with roast beef, draining off as much gravy as possible. Spread about 1 1/2 teaspoons of horseradish sauce on top of the beef in each shell. Place the shells in the greased baking dishes, and top with the remaining gravy. Sprinkle the Cheddar cheese evenly over the stuffed shells. Bake, uncovered, until the cheese is melted and the filling is hot and bubbly, about 20 minutes.\n",
        "picture_link": "5p2Cj/daQheuzs64YleAu86B1pR5rGm"
    },
    {
        "title": "Cream Cheese Snowball Cookies",
        "ingredients": [
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup finely-chopped walnuts (optional) ADVERTISEMENT",
            "1/2 cup vegetable shortening (such as Crisco®) ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Sift the confectioners' sugar into a shallow bowl, stir in the walnuts, and set aside.\nBeat the shortening, butter, cream cheese, and sugar together in a bowl until the mixture is creamy and thoroughly blended. Mix in the almond extract, vanilla extract, and flour; stir to combine. Scoop up dough by rounded tablespoons, and roll into balls about 1 inch in diameter. Place the balls about 1 1/2 inches apart on ungreased baking sheets.\nBake in the preheated oven until the cookies turn slightly golden at the edges, about 6 minutes. Let the cookies cool on the baking sheets for about 1 minute, then roll in the confectioners' sugar-walnut mixture while still a little warm.\n",
        "picture_link": "XR9VI2AOseuPzxm/z8lAU8t.CjDStba"
    },
    {
        "title": "Gorgonzola Pear Pasta",
        "ingredients": [
            "9 ounces penne pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "3 tablespoons crumbled Gorgonzola cheese ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 large pear, peeled and cubed ADVERTISEMENT",
            "1/2 cup chopped toasted walnuts ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a rolling boil. Cook the penne in the boiling water, stirring occasionally, until tender yet firm to the bite, about 11 minutes; drain.\nReturn the drained pasta to the pot; stir the butter, Parmesan cheese, and Gorgonzola cheese into the pasta and place over medium heat; cook until the cheese is completely melted. Pour the cream into the pasta mixture; stir. Remove from heat and fold the pear into the pasta mixture. Top with walnuts. Season with pepper to serve.\n",
        "picture_link": "HpV6HB4pxYflHPgdyuZs8tS/ycIJw2i"
    },
    {
        "title": "Mussels in Curry Cream Sauce",
        "ingredients": [
            "1/2 cup minced shallots ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 1/2 cups dry white wine ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "32 mussels - cleaned and debearded ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup minced parsley ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, cook shallots and garlic in simmering wine until translucent.\nStir in cream and curry powder. When sauce is heated through, add mussels. Cover, and steam mussels for a few minutes, until their shells open wide. With a slotted spoon, transfer steamed mussels to a bowl, leaving the sauce in the pan. Discard any unopened mussels.\nWhisk butter into the cream sauce. Turn heat off, and stir in parsley and green onions. Serve immediately.\n",
        "picture_link": "aYEkQgiblUkraj2YKkqmnyjWFaz0f2q"
    },
    {
        "title": "Dog Biscuits II",
        "ingredients": [
            "2 1/2 cups sifted whole wheat flour ADVERTISEMENT",
            "1/2 cup dry milk powder ADVERTISEMENT",
            "1 cube beef bouillon, crumbled ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup cooked ground pork ADVERTISEMENT",
            "1 cup grated carrot ADVERTISEMENT",
            "6 tablespoons shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly oil two cookie sheets.\nIn a medium bowl, stir together the whole wheat flour, milk powder, beef bouillon, and salt. Add the ground pork, carrot, shortening and egg; mix in to the flour mixture while gradually adding water to form a stiff ball of dough.\nOn a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into desired shapes using cookie cutters, and reroll scraps until no dough is left. Place cookies 2 inches apart onto the prepared cookie sheets.\nBake for 25 to 30 minutes in the preheated oven, or until the bottoms of the cookies are browned. Allow cookies to set for a few minutes on the cookie sheet before removing to wire racks to cool completely.\n",
        "picture_link": "Bn70wohVUOLDnsENyvCFOMSJXphL7mq"
    },
    {
        "title": "Brazilian Black Bean Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cups onion, chopped ADVERTISEMENT",
            "8 cloves garlic, chopped, divided ADVERTISEMENT",
            "1 carrot, diced ADVERTISEMENT",
            "3 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "2 (15 ounce) cans black beans, drained and rinsed ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat. Add onion, half of the garlic, and carrot. Season with cumin and salt. Cook, stirring, until onion and carrot are tender. Stir in remaining garlic, and red pepper; continue cooking until tender.\nAdd beans, water, and orange juice to the pan, and season with cayenne pepper. Transfer a portion of the mixture to a blender or food processor, and puree until smooth. Puree part or all of the soup, depending on how you like the texture. Return puree to the pan, and simmer for 10 more minutes to blend flavors before serving.\n",
        "picture_link": "VpJ7wtD6PLgp87P3NFWf2ndHDhtI4rC"
    },
    {
        "title": "Conchi's Sangria",
        "ingredients": [
            "4 (750 milliliter) bottles red wine ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 Granny Smith apples - peeled, cored and sliced ADVERTISEMENT",
            "4 sliced fresh peaches ADVERTISEMENT",
            "2 bananas, peeled and sliced ADVERTISEMENT",
            "2 cinnamon sticks, crushed ADVERTISEMENT",
            "3 liters lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pitcher, combine red wine, sugar, apples, peaches, bananas and cinnamon sticks. Refrigerate for 6 hours or overnight.\nWhen you're ready to serve, stir in the lemon-lime soda.\n",
        "picture_link": "2.rGfWrTa1uz703slE2I/ZhpJJhipbW"
    },
    {
        "title": "Danish Meatballs with Dill Sauce",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 pound ground pork ADVERTISEMENT",
            "1/2 pound ground veal ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup finely chopped onion ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1/4 cup chopped fresh dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large bowl, mix beef, pork, veal, salt, pepper, eggs, onion and heavy cream. With moistened hands, shape the mixture into 1 inch balls. Roll the balls in the bread crumbs until all balls are well coated. Arrange in a single layer on a large, shallow baking sheet.\nMelt 1/2 cup butter in a large saucepan over low heat. Stir in the flour. Gradually stir in the chicken broth. Continue stirring until thickened and bubbly, then blend in the sour cream and fresh dill.\nMelt remaining butter in a small saucepan, and drizzle over the meatballs. Bake meatballs in the preheated oven 35 minutes, turning occasionally, until evenly browned.\nPlace meatballs in a chafing dish and cover with the sauce to serve.\n",
        "picture_link": "oKajTZQudt3lYJw62zUWtVN0768W2cO"
    },
    {
        "title": "Shearers' Mince and Potato Hot Pot",
        "ingredients": [
            "5 medium potatoes, peeled and thinly sliced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon tomato sauce ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 (6 ounce) can mushrooms, drained ADVERTISEMENT",
            "2 tablespoons butter, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place potato slices in a medium bowl with enough water to cover.\nHeat oil in a medium saucepan over medium heat. Stir in ground beef, onion, tomato sauce, and Worcestershire sauce. Season with salt and pepper. Cook until beef is evenly browned and onions are tender.\nIn a separate medium saucepan over medium heat, melt 1/4 cup butter, and thoroughly blend in flour. Gradually stir in milk. Cook and stir 5 minutes, or until thickened. Reduce heat, and blend Cheddar cheese into the mixture. Season with salt and pepper to taste.\nLine a medium baking dish with 1/2 the potato slices. Pour in the ground beef mixture, and top with mushrooms. Cover with the cheese sauce mixture. Top with remaining potatoes. Dot with 2 tablespoons butter.\nBake 30 to 40 minutes in the preheated oven, until lightly browned.\n",
        "picture_link": "IieETrdwkzyUO42w7weXaBUZV4nxMKu"
    },
    {
        "title": "Old Fashioned Oatmeal Cookies",
        "ingredients": [
            "1 cup raisins ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Simmer raisins and water over medium heat until raisins are plump, about 15 minutes. Drain raisins, reserving the liquid. Add enough water to reserved liquid to measure 1/2 cup.\nPreheat oven to 400 degrees F.\nMix the shortening, sugar, eggs and vanilla thoroughly. Stir in reserved liquid.\nBlend in the remaining ingredients.\nDrop by rounded teaspoons about 2 inches apart onto ungreased baking sheets. Bake 8 to 10 minutes or until light brown.\n",
        "picture_link": "WwrLpG0UZklJf5rwRFSe6VMkPVA9ple"
    },
    {
        "title": "Sugar Cookies VII",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream the butter and then gradually add the sugar. Cream thoroughly.\nAdd the eggs one at a time to the sugar and butter. Add the baking soda next. Lastly, add the flour, salt, and flavoring.\nCover and chill for several hours or freeze.\nPreheat oven to 350 degrees F (175 degrees C).\nRoll out on a lightly floured surface and cut in fancy shapes. Bake until golden brown, 8 to 10 minutes.\n",
        "picture_link": "xHF7GxHsqGRwf1FrcuHTSFSexkHxHlG"
    },
    {
        "title": "Marinated Pork Strips",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 pound pork tenderloin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium dish or bowl, mix together soy sauce, sugar, onion, garlic, ginger, sesame seeds, and oil. Add pork, and turn to coat. Cover, and refrigerate for 3 hours, turning and basting often.\nPreheat oven to 375 degrees F (190 degrees C).\nRemove pork from marinade, reserving marinade, and transfer to a lightly greased 9x13 inch baking dish. Bake for 45 minutes. Cut into 1/4 inch thick slices.\nWhile the meat is roasting, boil reserved marinade for 3 to 5 minutes. Serve with pork strips.\n",
        "picture_link": "bdbFFHy33Y/lEY/kPkhi0EDDwnW4JBu"
    },
    {
        "title": "Ugly Duckling Cake I",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (16 ounce) can fruit cocktail ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cake mix, undrained fruit, 1 cup coconut and eggs.\nBlend; beat at medium speed for 2 minutes and pour into a greased 9 x 13 inch pan.\nSprinkle with brown sugar and nuts. Bake at 325 degrees F (165 degrees C) for 45 minutes. Bring butter, sugar and milk to a boil. Boil 1 minute. Stir in 1/2 cup coconut. Spoon over warm cake. Top with prepared whipped topping, if desired.\n",
        "picture_link": "KzYgAWpXSbBKDPo6ZqRngwRoqwH9aYW"
    },
    {
        "title": "Ranger Cookies I",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCream shortening, add sugar gradually. Add eggs and vanilla; beat until light and fluffy.\nSift flour, baking soda, salt, and baking powder together and mix with the first mixture. Add oatmeal, rice cereal, and coconut. Mix well.\nDrop by tablespoons on slightly greased cookie sheet and bake for 12 minutes.\n",
        "picture_link": "2yfYywewZq8D94oqZI4yKyUifNdN.ve"
    },
    {
        "title": "Butter Pecan Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream butter, brown sugar and egg. Mix until well blended.\nSlowly add flour and salt and mix well. Cover and refrigerate for at least one hour.\nPreheat oven to 375 degrees F.\nRoll one inch pieces of dough into balls and place 2 inches apart on cookie sheets. Flatten balls with the bottom of a glass dipped in flour. Press a pecan into top of dough.\nBake 10 to 12 minutes until lightly colored.\n",
        "picture_link": "fjfEyM4ioIYSxyT09w6KIRxjKFdF/Va"
    },
    {
        "title": "Foolproof Chocolate Fudge",
        "ingredients": [
            "3 cups semisweet chocolate chips ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/2 cup coarsely chopped walnuts ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line one 8 or 9 inch square pan with wax paper.\nIn a heavy saucepan, over low heat, melt the chocolate chips with the condensed milk. Remove from heat and stir in the chopped nuts and vanilla extract. Spread mixture evenly into the prepared pan and chill for 2 hours or until firm. Once firm, turn fudge onto cutting board, peel off waxed paper and cut into small squares.\n",
        "picture_link": "7BWwBjp/FxpD610TGGpvjZoSDSkomtO"
    },
    {
        "title": "Chocolate Snowdrops",
        "ingredients": [
            "1 (18.25 ounce) package devil's food cake mix with pudding ADVERTISEMENT",
            "2 1/4 cups frozen whipped topping, thawed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine cake mix, whipped topping and egg; mix well. Mixture will be sticky.\nDrop 1 inch sized balls of dough into confectioners' sugar; roll slightly to form uniform size balls. Place on lightly greased baking sheet 2 inches apart. Bake 10-12 minutes. Remove to racks to cool. Store in tightly covered container.\n",
        "picture_link": "wfmwcHj07mHvgI9QZfgwU/npjE76Xp2"
    },
    {
        "title": "Sugar Cookies IV",
        "ingredients": [
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix confectioners' sugar, butter or margarine, egg, vanilla and almond extract. Stir in flour, baking soda and cream of tartar.\nRoll into big ball and wrap in plastic wrap and let chill for at least 3 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nDivide dough into halves. Roll each half 3/16 inch thick on lightly floured board. Cut desired shapes with 2 to 2 1/2 inch cookie cutters. Sprinkle with granulated sugar. Place on lightly greased cookie sheets. Bake until edges are a light brown, 6 - 8 minutes.\n",
        "picture_link": "ywp3MQCxwU4mAr3bt3Dt6VIQ1galccm"
    },
    {
        "title": "Frosted Corn Flake Cereal Clusters",
        "ingredients": [
            "1 cup sugar frosted corn flake cereal ADVERTISEMENT",
            "1 cup butterscotch chips ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In sauce pan over low heat, melt butterscotch chips and peanut butter. Remove from heat and add frosted corn flake cereal.\nDrop onto wax paper lined cookie sheet and chill. Enjoy!\n",
        "picture_link": "lCgmJ3q84iO/18mAgVjJz8TILuMEfIe"
    },
    {
        "title": "Jalapeno Cranberry Sauce",
        "ingredients": [
            "12 ounces fresh or frozen cranberries ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 cup sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse berries in cold water; drain.\nIn a saucepan, mix water and sugar; stir to dissolve sugar. Bring to boil. Add cranberries, Jalapeno peppers, and lemon juice, and return to boil. Reduce heat and simmer gently for 10 minutes, stirring occasionally. Add sherry and stir well. Remove from heat and let cool completely at room temperature.\nRefrigerate in a glass container with cover. Serve with turkey or chicken.\n",
        "picture_link": "2piGHiluApALC3kRzFkll9H.H1d2pqG"
    },
    {
        "title": "Cinnamon Coffee Cake I",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 3/4 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 10 inch tube pan.\nIn a large mixing bowl cream together the butter or margarine and 2 cups of the sugar until fluffy. Add the vanilla and the eggs one at time beating mixture well after each egg.\nCombine flour with baking powder and baking soda. Add alternately with sour cream to egg mixture. Beating just enough after each addition to keep batter smooth.\nCombine walnuts, cinnamon, and remaining 3/4 cup of sugar.\nSpoon 1/3 of the batter into prepared pan, sprinkle with 1/3 of the walnut mixture. Repeat layers two more times.\nBake at 350 degrees F (175 degrees C) for 70 minutes or until center is done. Let cake cool in pan for 10 minutes then remove pan and let cake continue cooling on a wire rack.\n",
        "picture_link": "dFNkmGdaY7gLMHiGq9e9.o6or2ce5sa"
    },
    {
        "title": "Easy Rosemary Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the soup, sour cream and rosemary. Mix well.\nPlace chicken pieces in a 9x13 inch baking dish, in a single layer. Pour rosemary mixture over chicken and bake in the preheated oven for 30 to 40 minutes, or until chicken is cooked through and juices run clear. Let cool 10 minutes and serve.\n",
        "picture_link": "e7OrQV9X6/TfDLN0FNNyHqe3.kB6via"
    },
    {
        "title": "Coconut Lentil Soup",
        "ingredients": [
            "1 1/2 cups red lentils ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1/2 red onion, finely chopped ADVERTISEMENT",
            "1 clove garlic, finely chopped ADVERTISEMENT",
            "1/2 inch piece fresh ginger root, finely chopped ADVERTISEMENT",
            "1/2 cup fresh shredded coconut ADVERTISEMENT",
            "3/4 cup soy milk ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the lentils and water in a medium saucepan over medium heat, and bring to a boil. Stir in onion, garlic, and ginger. Cover, reduce heat, and simmer 30 minutes, or until lentils are tender.\nPlace the coconut and soy milk in a blender, and blend until smooth and thick. Stir into the lentil mixture. Season with curry and pepper. Continue cooking 10 to 15 minutes.\n",
        "picture_link": "uv6MIq2VMs3vtP0BTdeccL0ORzj7ZHu"
    },
    {
        "title": "Lavender Tea Bread",
        "ingredients": [
            "3/4 cup milk ADVERTISEMENT",
            "3 tablespoons finely chopped fresh lavender ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 9x5 inch loaf pan.\nCombine the milk and lavender in a small saucepan over medium heat. Heat to a simmer, then remove from heat, and allow to cool slightly.\nIn a medium bowl, cream together the butter and sugar until smooth. Beat in the egg until the mixture is light and fluffy. Combine the flour, baking powder, and salt; stir into the creamed mixture alternately with the milk and lavender until just blended. Pour into the prepared pan.\nBake for 50 minutes in the preheated oven, or until a wooden pick inserted into the crown of the loaf comes out clean. Cool in the pan on a wire rack.\n",
        "picture_link": "NQ3s3dEp8b1F6IrictuF.ysm.98kqbu"
    },
    {
        "title": "Lamb Shank Braised in White Wine with Rosemary",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "4 lamb shanks ADVERTISEMENT",
            "5 cloves garlic, sliced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 teaspoons chopped fresh rosemary, plus sprigs for garnish ADVERTISEMENT",
            "1 pinch salt and freshly ground black pepper ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large frying pan, heat oil over medium-high heat. Add shanks to hot pan, and brown all sides; this should take about 12 minutes. Transfer to a plate.\nReduce heat to medium-low, and add garlic to the pan; cook for 30 to 40 seconds. Stir in onion, and continue cooking until translucent, 6 to 8 minutes. Return shanks to the pan, and season with 2 teaspoons fresh rosemary and salt and pepper to taste. Pour in wine, raise heat to medium-high, and bring to a simmer. Reduce heat to low, cover tightly, and simmer until the shanks are very tender when pierced with a knife, 2 to 2 1/2 hours. Turn once or twice during cooking, and add water as necessary to maintain original level of liquid. Serve shanks garnished with rosemary sprigs.\n",
        "picture_link": ".gxAKdysVcW619qNHhefTMqHXEgAqKC"
    },
    {
        "title": "Pineapple Cheesecake Squares",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2/3 cup unsweetened pineapple juice ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained with juice reserved ADVERTISEMENT",
            "1/2 cup heavy cream, whipped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine 2 cups flour, confectioners' sugar, and almonds. Cut in butter until mixture resembles coarse crumbs. Press into the bottom of a 9x13 inch pan. Bake in preheated oven for 15 to 20 minutes.\nWhile the crust is baking, prepare the cream cheese layer. In a large bowl, beat the cream cheese and 1/2 cup sugar until smooth. Beat in eggs one at a time. Blend in 2/3 cup unsweetened pineapple juice. Pour over hot crust and bake for about 20 minutes more in preheated oven. Allow to cool completely.\nMake the topping: In a saucepan, combine 1/4 cup flour, 1/4 cup sugar and 1 cup reserved pineapple juice. Bring to a boil and stir for 1 minute. Remove from heat and stir in crushed pineapple. Cool completely. When cool, fold in whipped cream. Spread topping over cream cheese layer. Refrigerate 4 hours before serving.\n",
        "picture_link": "0rpgEuiAaPxAkWCjdcEm90qHc39x92u"
    },
    {
        "title": "American-Style Red Beans and Rice",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (15 ounce) can kidney beans ADVERTISEMENT",
            "1 1/2 cups tomato sauce ADVERTISEMENT",
            "4 1/2 cups water, divided ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "5 teaspoons adobo seasoning, divided ADVERTISEMENT",
            "2 cups uncooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan combine olive oil, kidney beans, tomato sauce, 1/2 cup water, oregano, basil, thyme, salt, pepper and 2 teaspoons adobo. Simmer on low heat.\nMeanwhile, bring 4 cups water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes, or until rice is cooked and all liquid is absorbed. Stir in remaining 3 teaspoons adobo. Serve beans over the rice.\n",
        "picture_link": "XSHXzX6hDYYz8HNaV1NVLxuf6dxPpJu"
    },
    {
        "title": "Grilled Cornish Game Hens",
        "ingredients": [
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, peeled and chopped ADVERTISEMENT",
            "1 cup lemon juice ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 tablespoon white wine ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "1 tablespoon pepper ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 (1 1/2 pound) Cornish game hens ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, non-reactive bowl, mix onion, garlic, lemon juice, olive oil, white wine, Worcestershire sauce, hot pepper sauce, pepper, celery salt, and salt. Place Cornish game hens in the bowl, coating evenly with the marinade mixture. Cover, and marinate in the refrigerator at least 4 hours.\nPreheat an outdoor grill for medium heat, and lightly oil grate.\nCook hens about 1 hour on the prepared grill, brushing occasionally with remaining marinade, until no longer pink and juices run clear.\n",
        "picture_link": "H.xXb3elZ61s3CGdevx6HyMzz3Bnt9K"
    },
    {
        "title": "Austrian Pancake",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nIn a medium bowl, stir together the flour, salt and sugar. Pour in milk, eggs and cream, and stir into a smooth batter. Meanwhile, melt margarine in a cast iron skillet. Pour the batter over the melted margarine.\nPlace the skillet in the oven, and bake for 35 minutes. The pancake will rise to form a bubble in the middle. Remove from the oven, and let cool until the pancake sets, or goes down. Cut into pieces, serve with maple syrup and enjoy!\n",
        "picture_link": "33NworjGfEQYBDwnaCCk8KN.EnCm4pa"
    },
    {
        "title": "Mint Juleps",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup roughly chopped fresh mint leaves ADVERTISEMENT",
            "32 fluid ounces Kentucky bourbon ADVERTISEMENT",
            "8 sprigs fresh mint leaves for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, sugar and chopped mint leaves in a small saucepan. Bring to a boil over high heat until the sugar is completely dissolved. Allow syrup to cool, approximately 1 hour. Pour syrup through a strainer to remove mint leaves\nFill eight cups or frozen goblets with crushed ice and pour 4 ounces of bourbon and 1/4 cup mint syrup in each. (Proportions can be adjusted depending on each person's sweet tooth). Top each cup with a mint sprig and a straw. Trim straws to just barely protrude from the top of the cups. Serve juleps on a silver platter.\n",
        "picture_link": "G.4gCgvLhOAHrh1fLE0pY7tFFIteuim"
    },
    {
        "title": "Artichoke Bites II",
        "ingredients": [
            "1 (6.5 ounce) jar marinated artichoke hearts, drained, liquid reserved ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, peeled and minced ADVERTISEMENT",
            "8 eggs, lightly beaten ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup snipped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon Italian-style seasoning ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease four 1 3/4 inch muffin pans.\nPlace reserved liquid from marinated artichoke hearts in a medium saucepan. Over medium heat, slowly cook and stir onion and garlic until tender.\nIn a blender or food processor, mix artichoke hearts, eggs, Cheddar cheese, Swiss cheese, Parmesan cheese, parsley, black pepper, Italian-style seasoning, hot pepper sauce and Worcestershire sauce. Blend until smooth. Stir in the onions, garlic and dry bread crumbs.\nFill the muffin pans approximately 3/4 inch full with the mixture. Bake in the preheated oven 12 to 15 minutes, until firm and lightly browned. Serve warm.\n",
        "picture_link": "p0Kt.9zYXo8RXiaVM8tJ9iIY73.jisW"
    },
    {
        "title": "Quick and Easy Eggs Benedict",
        "ingredients": [
            "4 slices Canadian bacon ADVERTISEMENT",
            "1 teaspoon white vinegar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 tablespoon heavy cream ADVERTISEMENT",
            "1 dash ground cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "4 English muffins, split and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium-high heat, fry the Canadian bacon on each side until evenly browned.\nFill a large saucepan with about 3 inches water, and bring to a simmer. Pour in the vinegar. Carefully break the 4 eggs into the water, and cook 2 to 3 minutes, until whites are set but yolks are still soft. Remove eggs with a slotted spoon.\nMeanwhile, melt the butter until bubbly in a small pan or in the microwave. Remove from heat before butter browns.\nIn a blender or large food processor, blend the egg yolks, heavy cream, cayenne pepper, and salt until smooth. Add half of the hot butter in a thin steady stream, slow enough so that it blends in at least as fast as you are pouring it in. Blend in the lemon juice using the same method, then the remaining butter.\nPlace open English muffins onto serving plates. Top with 1 slice Canadian bacon and 1 poached egg. Drizzle with the cream sauce, and serve at once.\n",
        "picture_link": "LTruef6AJOMACmQdOTW60ExKNuUb88i"
    },
    {
        "title": "Whipped Cream Filling",
        "ingredients": [
            "1 pint heavy cream ADVERTISEMENT",
            "1 1/2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1 tablespoon cold water ADVERTISEMENT",
            "1 teaspoon unflavored gelatin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whip cream with confectioners' sugar until soft peaks form. Dissolve gelatin in water over low heat. Remove from heat, allow to cool slightly, then whip into cream until stiff peaks form.\n",
        "picture_link": "3yL1aB7SzSnQ6ik/w5L1MgpAVYuAbAq"
    },
    {
        "title": "Apple Rosemary Pork Tenderloin",
        "ingredients": [
            "4 teaspoons dried rosemary ADVERTISEMENT",
            "1 1/2 teaspoons dried thyme ADVERTISEMENT",
            "1 1/2 teaspoons dried marjoram ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 pounds pork tenderloin ADVERTISEMENT",
            "1 (12 fluid ounce) bottle hard apple cider ADVERTISEMENT",
            "water ADVERTISEMENT",
            "3 Granny Smith apples, cored and cut into 1 inch pieces ADVERTISEMENT",
            "1 large red onion, cut into 1 inch pieces ADVERTISEMENT",
            "5 tablespoons brown sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together rosemary, thyme, marjoram, salt, and pepper. Rub herb mixture over tenderloin. Place in a container, and pour hard cider over roast. Add water until pork is completely submerged. Cover, and refrigerate 6 to 8 hours, or overnight.\nPreheat oven to 325 degrees F (165 degrees C).\nPlace roast in a roasting pan, elevated from the bottom, and pour marinade around the meat. Bake for 1 hour in preheated oven.\nIn a large bowl, mix apples and onion. Put mixture around and on top of roast. Spoon brown sugar over entire pan evenly. Place roast back into oven, and continue to cook for 1 hour more, or until meat reaches 145 degrees F (63 degrees C). Transfer roast, apples, and onion to a serving platter.\nFor the gravy, brown flour in a skillet. Pour the marinade/drippings mixture into the skillet. Stir in syrup. Cook and stir over high heat until liquid has thickened to desired consistency.\nSlice roast, and serve with gravy.\n",
        "picture_link": "wS8QJmQJTRf7jAouovvM4b.rtE3wq/6"
    },
    {
        "title": "No Name Orange Roughy",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 (14.5 ounce) can whole peeled tomatoes with liquid, chopped ADVERTISEMENT",
            "4 (4 ounce) fillets orange roughy ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch dried thyme, crushed ADVERTISEMENT",
            "1 pinch dried rosemary, crushed ADVERTISEMENT",
            "1/4 cup sliced black olives, drained ADVERTISEMENT",
            "1/2 pound crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a medium skillet over medium heat. Stir in green onions, and cook until tender, 5 to 10 minutes.\nMix white wine and tomatoes with the green onions, and bring to a boil. Place orange roughy fillets in the white wine mixture. Season with basil, pepper, thyme, and rosemary. Reduce heat, and simmer 15 to 20 minutes, until fish is easily flaked with a fork. Remove fish fillets from skillet.\nSprinkle fish fillets with black olives and feta cheese.\n",
        "picture_link": "5KYACWJ1nUBh2I405hx5mlKoO4n0kf6"
    },
    {
        "title": "Easy Tortellini Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small red onion, chopped ADVERTISEMENT",
            "1 zucchini, chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1/4 cup red wine ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "1 (11 ounce) can white corn, undrained ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "8 ounces cheese tortellini ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, cook onion, zucchini and garlic in oil three minutes, until onion is translucent. Stir in crushed tomatoes, broth, sugar, Italian seasoning, wine and pepper sauce and bring to a boil.\nReduce heat and stir in corn and Parmesan. Simmer 30 minutes.\nStir in tortellini and simmer 10 minutes more, until pasta is tender.\n",
        "picture_link": "u1oIHRoHhPMp4itMIBUqQtCmY8vBDBG"
    },
    {
        "title": "Baja Sauce",
        "ingredients": [
            "1/4 red bell pepper, seeded and chopped ADVERTISEMENT",
            "1 jalapeno pepper, sliced ADVERTISEMENT",
            "2 tablespoons diced onion ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "1/4 teaspoon cracked black pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bell pepper, jalapeno pepper, and onion in the bowl of a food processor; puree until smooth. Stir together 4 teaspoons of this puree with the mayonnaise, and vinegar in a small bowl. Season with pepper, garlic powder, and cumin. Cover, and refrigerate for at least 3 hours to allow flavors to develop.\n",
        "picture_link": "XYRM3L2r85DkAZpbrAy5gDzzwzl90pq"
    },
    {
        "title": "Spinach Saute",
        "ingredients": [
            "1/8 cup water ADVERTISEMENT",
            "1 bunch fresh spinach, rinsed and stemmed ADVERTISEMENT",
            "1/3 cup cream cheese, softened ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water to a boil in a skillet over medium heat. Add spinach all at once, and reduce heat slightly. Cover, and let cook for about 3 minutes, or until spinach is not quite tender.\nStir in the cream cheese and lemon juice, and season with salt. Cook, stirring, until the cream cheese is melted and well blended. Serve immediately.\n",
        "picture_link": "dfwDKp3cTb3Ps3R8M6ibuSELcmX0Di."
    },
    {
        "title": "New Year's Champagne Punch",
        "ingredients": [
            "1 quart orange sherbet ADVERTISEMENT",
            "2 quarts fresh orange juice ADVERTISEMENT",
            "1 (2 liter) bottle ginger ale, chilled ADVERTISEMENT",
            "2 (750 milliliter) bottles champagne, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the orange juice, ginger ale, and champagne in the refrigerator to get them well chilled.\nIn a large punch bowl, place the block of sherbet in the center and pour the orange juice over the top. Next, pour the ginger ale over the sherbet. Finally, pour both bottles of champagne over the sherbet. Stir gently to mix the liquids, resulting in a foamy top. Serve immediately.\n",
        "picture_link": "cIsn8Gb0NJPrFvUwhPxQ/6vilJgG54m"
    },
    {
        "title": "Butterscotch Brownies III",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8 inch baking pan.\nIn a medium bowl, cream together 1/4 cup butter and 1 cup brown sugar until smooth. Beat in the egg and vanilla. Combine the flour, baking powder and salt; stir into the sugar mixture. Mix in the walnuts. Spread evenly into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, until the brownies start to pull away from the sides of the pan. Cool completely before frosting.\nTo make the frosting, combine 2 tablespoons butter, 1/4 cup brown sugar and milk in a small saucepan over medium- high heat. Bring to a boil and simmer for 2 minutes. Remove from heat, cool and beat in the confectioners' sugar. Adjust the milk or confectioners' sugar if necessary to achieve a good spreading consistency. Spread over cooled bars and let set before cutting into squares.\n",
        "picture_link": "KfZMTyMyKqylLOSQLHqZwzwpCeUmtT2"
    },
    {
        "title": "Apple Cider Pancakes",
        "ingredients": [
            "2 cups complete pancake mix ADVERTISEMENT",
            "1 1/4 cups apple cider ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup chopped walnuts (optional) ADVERTISEMENT",
            "butter flavored cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pancake mix into a medium bowl, and stir in apple cider. Apple cider may be adjusted to achieve the desired thickness. Stir in cinnamon, nutmeg, brown sugar and vanilla. Mix in walnuts if using.\nHeat a large skillet over medium heat, and spray with cooking spray. Use about 1/4 cup of batter per pancake. Cook 3 to 4 pancakes at a time. Turn over when bubbles appear in the center, and cook until golden on the other side. Serve immediately with pats of butter and maple syrup.\n",
        "picture_link": "6DoVFPkb/OtnTzk0MHZUwqFaFca/MEm"
    },
    {
        "title": "Hard Taco Shells",
        "ingredients": [
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "1 (12 ounce) package corn tortillas ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat about 1 inch of oil in a heavy skillet over medium to medium-high heat to 365 degrees F (180 degrees C).\nUse tongs to place one tortilla at a time into the oil. It should start to sizzle right away. Cook for about 15 seconds, then flip over and fold the shell in half, holding in place with the tongs until crispy, about 15 seconds. You may need a little practice at first. Drain on paper towels, and sprinkle with salt while still hot. Use for tacos right away, or they may become chewy. Leftovers may be heated in the oven for crisping.\n",
        "picture_link": "Bl6/024ozMD0lU8bj7jYhZTTgcqQQL."
    },
    {
        "title": "Strawberry Delight Dessert Pie",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "3 1/2 cups frozen whipped topping, thawed ADVERTISEMENT",
            "2 pints fresh strawberries, sliced ADVERTISEMENT",
            "2 (3.4 ounce) packages instant vanilla pudding mix ADVERTISEMENT",
            "3 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix graham cracker crumbs, 1/4 cup sugar and melted butter until well blended . Press mixture into the bottom of a 9x13 inch pan. Chill in freezer while you make the filling.\nIn a large bowl, beat the cream cheese with 1/4 cup sugar and 2 tablespoons milk until smooth. Fold in 1/2 of the whipped topping.. Spread filling over crust. Place the strawberries in an even layer over filling. Prepare instant pudding as directed on package, but using only 3 1/2 cups milk. Spread prepared pudding over strawberries. Chill 4 hours or overnight.\nBefore serving, spread remaining whipped topping over pudding.\n",
        "picture_link": "YbCBs1QHGEjdnFwdUP9XT4rjv6J0yyS"
    },
    {
        "title": "Chilled Russian Salad Dressing",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "3 teaspoons minced onion ADVERTISEMENT",
            "1 teaspoon prepared horseradish ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "3 tablespoons chili sauce ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, whisk together the mayonnaise, onion, horseradish, Worcestershire, parsley, chili sauce and ketchup. Chill until serving.\n",
        "picture_link": "uZc6vtjUM5tDx54fs40gQ6lutttyp3W"
    },
    {
        "title": "Really Rich Banana Bread",
        "ingredients": [
            "1 cup unsalted butter ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch ground allspice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 ripe bananas, mashed ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x5 inch loaf pan.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Stir in the eggs one at a time, beating well with each addition. In a separate bowl, stir together flour, baking powder, nutmeg, allspice and salt. Blend the flour mixture into the butter and egg mixture a bit at a time, beating well after each addition.. Stir in the banana and vanilla; mixing just enough to evenly combine. Pour batter into prepared pan.\nBake in preheated oven for 90 minutes, until a toothpick inserted into center of the loaf comes out clean. Cool the cake in the pan for 10 minutes and then turn out onto a wire rack to cool completely.\n",
        "picture_link": "W/wBlnZ2WK.yHb/98msV.U/Q7fR0Ire"
    },
    {
        "title": "Baked Pancake Squares",
        "ingredients": [
            "3/4 cup milk ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/4 cup egg substitute ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease an 8x8 inch baking dish.\nIn a large mixing bowl, beat together milk, butter and egg substitute. Add the sugar, then gradually beat the flour in. Carefully stir in the baking powder and salt. Pour batter into prepared pan.\nBake in preheated oven for 30 minutes. Cut into 16 square servings.\n",
        "picture_link": "UXvd1lPD6KH/8w2QwNtFhFNFZVh3B7u"
    },
    {
        "title": "Squash Braid",
        "ingredients": [
            "1 butternut squash- peeled, seeded and cubed ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2 tablespoons warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/3 cup warm milk (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, cover peeled and chopped squash with water. Bring water to a boil and cook until tender, about 15 to 20 minutes. Let cool and mash. Reserve 1 cup for use in this recipe and freeze remainder for later use.\nIn a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine the yeast mixture with milk, butter, 1 cup mashed squash, 1 egg, brown sugar, salt and 2 cups flour; stir well to combine. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Divide into 6 equal pieces and roll each into a rope about 18 inches long. Take 3 ropes, pinch ends together and then braid ropes together. Pinch ends to seal. Do the same with the other 3 ropes of dough. Place braids on lightly greased baking sheets. Cover and let rise for about 30 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, beat together 1 egg and 1 tablespoons water; brush loaves with egg wash. Bake in preheated oven for 20 to 25 minutes. Remove from baking sheets and let cool on a wire rack.\n",
        "picture_link": "Y5vrR5Fq6FX/DlK0/M6nrkr/.FR4KRC"
    },
    {
        "title": "Broiled Shrimp Scampi",
        "ingredients": [
            "2 pounds medium shrimp, peeled and deveined ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat broiler to 500 degrees (260 degrees C).\nStir shrimp together with butter, garlic and wine. Place on a baking sheet and broil for 10 minutes. Sprinkle on scallions and broil for another 2 to 3 minutes, until shrimp are firm. Serve hot.\n",
        "picture_link": "yrJjWw7g5gzRG9UZqiplZYJNKCPl7BW"
    },
    {
        "title": "Blueberry Snow",
        "ingredients": [
            "1 (10 inch) angel food cake ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "1 (21 ounce) can blueberry pie filling ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Break angel food cake into small pieces, and spread into the bottom of a 9 x 13 inch baking dish.\nMix together confectioners' sugar, cream cheese, vanilla, and milk until smooth. Fold in whipped topping. Pour over cake pieces. Pour blueberries over all. Chill for 4 hours or overnight.\n",
        "picture_link": "7QGlwI7FoukWXdrdQG2QGnyvPEaJ1fK"
    },
    {
        "title": "Grilled Pork Steaks with Lemon Butter Sauce",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "6 pork chops ADVERTISEMENT",
            "1 pinch kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat and lightly oil grate.\nMelt the butter in a small saucepan over medium heat. Stir in the lemon juice and the garlic and heat until garlic is tender. Remove from heat.\nArrange the chops on a plate and coat top side of each chop with the butter mixture. Place chops on the grill butter side down.\nSear over high heat for 1 minute, coating the top side of the chops with the butter mixture while the other side is grilling. Flip the chops and sear the other side for 1 minute.\nTurn the meat, cover the grill and cook 3 to 5 more minutes per side, brushing occasionally with the remaining butter mixture. Pork chops are done when internal temperature reaches 145 degrees F (63 degrees C).\n",
        "picture_link": "fqQ./o212vhveE1iR5O6ebOhPzLzwNy"
    },
    {
        "title": "Tortellini Carbonara",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 pound cooked ham, cut into 1/2 inch pieces ADVERTISEMENT",
            "4 cups half-and-half ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 1/2 cups frozen green peas ADVERTISEMENT",
            "9 ounces fresh cheese-filled tortellini ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium heat. Stir in the onion and ham and saute for 5 minutes, or until onion is translucent.\nPour in the half-and-half and the cheese, stirring frequently, until the sauce starts to thicken and bubble. Season with salt and pepper to taste and set aside.\nFill a large pot with water and bring to a boil. Add the tortellini and cook to desired doneness, or according to package directions. Add the peas to the boiling tortellini in the final minute of cooking. Drain all from the water and toss with the ham and sauce mixture.\n",
        "picture_link": "s0.Jm/rj0mMFQUQbnF3KkCezK/uxm/O"
    },
    {
        "title": "Lamingtons",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs, room temperature ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "4 cups confectioners' sugar, sifted ADVERTISEMENT",
            "1/3 cup cocoa powder, sifted ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/2 cup warm milk ADVERTISEMENT",
            "1 pound unsweetened dried coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour an 8x12-inch pan.\nSift together the flour, baking powder, and salt. Set aside.\nBeat 1/2 cup butter and 3/4 cup sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the vanilla with the last egg. Pour in the flour mixture alternately with the milk, mixing until just incorporated.\nPour batter into the prepared pan. Bake in the preheated oven until a toothpick inserted into the cake comes out clean, 30 to 40 minutes. Let stand 5 minutes, then turn out onto a wire rack and cool completely. Wrap with plastic wrap and store overnight at room temperature to give the cake a chance to firm up before slicing.\nTo make the icing: In a large bowl, combine confectioners' sugar and cocoa. Add the melted butter and warm milk and mix well to create a fluid, but not too runny, icing.\nCut the cake into 24 squares. Place parchment paper or waxed paper on a work surface, and set a wire rack on the paper. Pour the shredded coconut into a shallow bowl. Using a fork, dip each square into the icing, coating all sides, then roll it in the coconut. Place onto rack to dry. Continue until all lamingtons are coated.\n",
        "picture_link": "4bOHLRKfusebUNjgsSMduz3xnaH3u46"
    },
    {
        "title": "Veggie Casserole",
        "ingredients": [
            "1 (14.5 ounce) can French-style green beans, drained ADVERTISEMENT",
            "1 (11 ounce) can white corn, drained ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 (16 ounce) package cheese flavored crackers, crushed ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine green beans, corn, onion, and green bell pepper. Stir in sour cream, condensed soup, and shredded cheese. Season with salt and pepper. Mix well, and spread into a 2 quart casserole dish. In a separate bowl, mix together the crushed crackers and melted butter. Sprinkle over vegetable mixture.\nBake in preheated oven, for 25 minutes, or until the top is golden brown.\n",
        "picture_link": "JiXvDRt5BNHIR4sK53u6VDceB0fPazG"
    },
    {
        "title": "Spinach Bread",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients in bread machine pan in the order recommended by the manufacturer. Select white bread cycle.\n",
        "picture_link": "NYkfAzMmWe7H7.VoOXeC9SmNZfN9KRG"
    },
    {
        "title": "Coconut Pound Cake",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "3 1/2 ounces flaked coconut ADVERTISEMENT",
            "1 teaspoon coconut extract ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon coconut extract ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch tube pan.\nIn a large bowl, cream together 2 cups sugar and the butter. Fold in the eggs one at a time, fully incorporating each one before adding another.\nIn separate bowl, mix the flour, baking powder, milk, flaked coconut, and 1 teaspoon coconut extract. Beat into the creamed mixture. Pour the batter into the prepared pan.\nBake 1 hour in the preheated oven, or until a knife inserted in the center comes out clean. Cool on a wire rack for just a few minutes, then place on cake platter.\nTo make the glaze, mix together in a small saucepan 1 cup sugar, water, 1 teaspoon coconut extract, and walnuts. Boil for 1 minute, and pour over still warm cake.\n",
        "picture_link": "duHI6YzqEY/QZUu/CEhWvCd0N9o076i"
    },
    {
        "title": "Grandma's Ham Casserole",
        "ingredients": [
            "1 1/2 cups cubed ham ADVERTISEMENT",
            "5 potatoes, thinly sliced ADVERTISEMENT",
            "2 carrots, sliced thin ADVERTISEMENT",
            "1 (8 ounce) can mushrooms, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 9x13 inch baking dish, combine the ham, potatoes, carrots and mushrooms.\nIn a medium bowl, combine the soup with the water. Mix well and pour over the mixture in the baking dish, stirring to coat.\nBake at 350 degrees F (175 degrees C) for 1 to 1 1/2 hours, or until carrots are tender.\n",
        "picture_link": "PXd8xDTJrGnuRproxhMxs/nCqG0n46y"
    },
    {
        "title": "Sour Cream Bundt Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/8 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make the batter following the directions on the box, EXCEPT replace 2 teaspoons water with an equal amount of vanilla. Fold in sour cream. Bake according to directions given for baking a bundt cake. Cool on rack, place on serving plate, and dust with confectioners sugar.\n",
        "picture_link": "SYzzQn3mvgikGoIpH3Xrtut7o8dDbF2"
    },
    {
        "title": "Macaroni and Cheese Bake",
        "ingredients": [
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 pound elbow macaroni ADVERTISEMENT",
            "4 tomatoes, sliced ADVERTISEMENT",
            "12 slices processed sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nPreheat oven to 350 degrees F (175 degrees C). In a medium saucepan, heat soup and milk over medium heat until simmering. Remove from heat and stir in macaroni. Pour macaroni mixture into 9x13 baking dish. Place a layer of tomatoes, then a layer of cheese slices over macaroni. Repeat.\nBake for 25 minutes or until cheese is golden and bubbly.\n",
        "picture_link": "C4anqA.xAl3Uww81sHN3aP8071y1o4O"
    },
    {
        "title": "Hush Puppies II",
        "ingredients": [
            "2 quarts vegetable oil for frying ADVERTISEMENT",
            "1 (15 ounce) can creamed corn ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "2 cups self-rising flour ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a deep fryer, heat 1 inch of fat or oil to 365 degrees F (185 degrees C).\nIn a medium mixing bowl combine all other ingredients, blend well and let stand for 10 minutes.\nUse a serving spoon to scoop up tablespoon size pieces of batter and gently drop them into the oil. Rise the spoon as needed to keep the batter from sticking.\nCook the hushpuppies, 8 or 10 at a time, until brown. Remove from the oil with a slotted spoon and roll on paper towels to briefly drain. Serve hot.\n",
        "picture_link": "phsINXIjgDwcNYjeuvWhap9F3LPCtMS"
    },
    {
        "title": "Ice Box Fruitcake",
        "ingredients": [
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 cup chopped raisins ADVERTISEMENT",
            "1 (4 ounce) jar maraschino cherries, drained and chopped ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (12 ounce) package vanilla wafers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the pecans, raisins, walnuts, cherries, condensed milk and vanilla wafers. Dough will be very thick, you will need to use your hands.\nForm dough into a ring shape on top of a dinner plate. Wrap in many layers of plastic wrap and/or aluminum foil. Allow to age in the refrigerator for at least a week. The flavors will have a chance to blend and all of the milk will be absorbed into the cake.\n",
        "picture_link": "u7wI/4aCrttJBr4SbPcIOuTh438xZDe"
    },
    {
        "title": "Rhinelander Lentil Soup",
        "ingredients": [
            "4 tablespoons olive oil ADVERTISEMENT",
            "5 slices bacon, cut into small pieces ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "3 1/2 quarts water ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 cup dry lentils ADVERTISEMENT",
            "2 cubes beef bouillon ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch ground white pepper ADVERTISEMENT",
            "1 cup diced potato ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium high heat, combine the oil, bacon, carrots, onions, and celery. Saute for 5 minutes, or until bacon is crisp. Stir in the flour until it's dissolved and mixture is pasty.\nSlowly add the water, stirring constantly. Then add the bay leaves, salt, lentils, beef base, thyme, nutmeg, white pepper and potatoes. Stir all together well, bring just to a boil, reduce heat to low and simmer for 3 hours.\n",
        "picture_link": "JBMwFoyFIOB69S0yRWpQLvQx4cmYFaW"
    },
    {
        "title": "Pollo Bianco",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 chicken thighs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, heat the olive oil and add the chicken, browning both sides of each piece. Saute for approximately 10 minutes. Add salt and pepper to taste.\nAdd the diced onion to the skillet and stir together with the chicken pieces for approximately 5 minutes. Add 2 cups of water and let simmer on medium high heat until the onions caramelize and create a sauce.\nSimmer for approximately 30 minutes. You may need to add more water so that the sauce mixture doesn't dry out. Once the chicken is cooked through, remove and set on a plate.\n",
        "picture_link": "LrOYX231O83sVTBpl7porNOVYRrQday"
    },
    {
        "title": "Irish Spicy Cornbread",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup yellow cornmeal ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "4 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "4 1/2 teaspoons hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven and skillet to 400 degrees F (200 degrees C).\nIn a large bowl, mix together flour, cornmeal, sugar, baking powder, salt, and cayenne pepper. Cut in shortening until the mixture resembles coarse bread crumbs. In a small bowl, beat together milk, eggs and hot pepper sauce. Stir milk mixture into the flour/cornmeal mixture until just blended. Remove hot skillet from oven, spray with non-stick cooking spray and pour batter into skillet.\nBake in preheated oven for 20 to 25 minutes, or until a toothpick inserted into center of loaf comes out clean.\n",
        "picture_link": "4M60DqIw5kr113hB/XsgsTNX1oy9vEm"
    },
    {
        "title": "Taffy Apple Salad",
        "ingredients": [
            "1 (15 ounce) can pineapple chunks - drained with juice reserved ADVERTISEMENT",
            "2 1/2 cups miniature marshmallows ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 cups roasted Spanish peanuts ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "2 tart apples - peeled, cored and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the pineapple chunks and marshmallows. Mix together, cover and refrigerate overnight.\nIn a medium saucepan, stir together the pineapple juice, egg, flour, vinegar and sugar over medium low heat. Cook and stir sauce until thickened. Transfer to a medium sized bowl, cover and refrigerate overnight.\nIn a large bowl, blend together the marshmallow mix and sauce. Stir in the peanuts, whipped topping and apples. Refrigerate until serving time.\n",
        "picture_link": "Dma96pNfKrz/CLr95WjwXtSG8vC4w2S"
    },
    {
        "title": "Garbage Quiche",
        "ingredients": [
            "2 (9 inch) pie crusts, baked ADVERTISEMENT",
            "10 slices bacon ADVERTISEMENT",
            "8 ounces Gruyere cheese, shredded ADVERTISEMENT",
            "1 small head fresh broccoli, diced ADVERTISEMENT",
            "4 green onions ADVERTISEMENT",
            "2 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nEvenly distribute bacon across bottom of each pastry shell, followed by half of cheese. Add broccoli, scallions, and tomatoes, then cover with remaining cheese.\nIn a medium bowl, whisk together eggs, half-and-half, nutmeg, cayenne, salt, and pepper. Pour half of mixture into each pastry shell.\nBake in preheated oven for 15 minutes, then reduce heat to 350 degrees F (175 degrees C) and bake an additional 45 minutes, until quiches are set in center.\n",
        "picture_link": "uGPULz2w7Ux3R0FouIOG3HszuV5qYZ."
    },
    {
        "title": "Coffee Roast",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "4 pounds chuck roast ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 cups brewed coffee ADVERTISEMENT",
            "2 cups canned mushrooms ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 2 tablespoons of butter in a large saucepan over medium high heat. Add the roast and sear on all sides until well browned; set aside.\nIn the same saucepan, melt the remaining butter, add the salt and onions and saute for 5 minutes. Return the meat to the saucepan and pour in the coffee and the mushrooms.\nBring to a boil, reduce heat to low and simmer for 5 hours, turning meat over halfway through cooking time.\nTo make gravy: Remove a cup of the coffee mixture from the saucepan, combine with the cornstarch, stirring until smooth, and return to the simmering pan. Mix well, remove from heat and serve.\n",
        "picture_link": "f3EnAinodWzB1SgwRqcZLBhIbH3AWMa"
    },
    {
        "title": "Chocolate Decadence Yule Log",
        "ingredients": [
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 tablespoons coffee-flavored liqueur ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "confectioners' sugar for dusting ADVERTISEMENT",
            "4 (1 ounce) squares semisweet baking chocolate ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon coffee flavored liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly spray a 10x15 inch jellyroll pan and line with parchment paper. Sift flour with baking powder and salt and set aside.\nIn a large mixing bowl, beat the eggs on high for several minutes until they are very pale and fluffy. Gradually add in the sugar, beating 1 to 2 minutes more or until very thick. Gently, but thoroughly, fold in the flour mixture.\nMelt the chocolate in a small saucepan over low heat. In a small bowl, combine the 2 tablespoons of water with the 2 tablespoons coffee liqueur and the remaining 2 tablespoons sugar and the baking soda, then gradually stir into the melted chocolate until smooth. Quickly, but thoroughly, fold chocolate mixture into batter.\nPour batter into prepared 10x15 inch pan. Bake at 350 degrees F (175 degrees C) for 18 to 20 minutes, or until a toothpick inserted into the cake comes out clean. Lightly sift an even layer of confectioners sugar over a cloth napkin or tea towel (do not use Terry-cloth). Flip the cake out of its pan onto the prepared cloth as soon as it comes from the oven. Carefully peel away parchment paper. Lightly dust top of cake with confectioners sugar, then trim away crisp edges. Starting with one of the short sides of the cake, immediately roll the cake up in the cloth, jellyroll style, and cool thoroughly on a rack.\nFor the Filling and Frosting: In a small saucepan over low heat, melt the chocolate. Remove from heat and let cool to lukewarm. In a medium bowl, beat the cream cheese with the confectioners sugar until smooth, then blend in the vanilla extract and coffee liqueur. Blend in the melted chocolate. Unroll the cake and spread about 1/3 of the filling evenly over the surface. Roll the cake back up.\nArrange cake roll on serving tray, then frost generously, swiping with an icing spatula to form the long 'bark line' design. Swipe ends of cake in a circular motion to simulate the tree-rings of a cut log. Decorate log as desired with holly leaves and berries, mushrooms and snow.\n",
        "picture_link": "6zsguJEynck2Mlroyu5jscJduFffFaO"
    },
    {
        "title": "Best Chocolate Chippers",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "4 teaspoons cream of tartar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the butter, oil, brown sugar, and white sugar until smooth. Beat in the eggs and vanilla. Combine the flour, baking soda, cream of tartar, and salt; stir into the creamed mixture. Mix in the chocolate chips and walnuts. Drop dough by rounded teaspoons onto ungreased cookie sheets.\nBake for 12 to 15 minutes in the preheated oven, or until light brown. Allow cookies to cool on the baking sheets for a couple of minutes before transferring to wire racks to cool completely.\n",
        "picture_link": "ER/zr6IZcSugBHHsaYJV1XgShZwyXsW"
    }
]