[
    {
        "title": "Quick and Easy Peach Cheesecake",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 (12 ounce) jars peach preserves ADVERTISEMENT",
            "1 (8 ounce) container whipped topping ADVERTISEMENT",
            "2 (8 inch) prepared graham cracker crusts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese in a large bowl with an electric hand mixer until smooth.\nSpoon confectioners' sugar into cream cheese and beat until fully incorporated.\nBeat vanilla and peach preserves into cream cheese mixture until combined.\nFold whipped topping into cream cheese mixture until evenly smooth.\nDivide cream cheese mixture between the two prepared graham cracker crusts and spread evenly. Refrigerate until set, at least 1 hour.\n",
        "picture_link": "9om7TC9WWbBLPKO/nyRzw0VcSY.8ByC"
    },
    {
        "title": "Cedar Planked Salmon with Dill",
        "ingredients": [
            "1 cedar plank ADVERTISEMENT",
            "1/2 cup Dijon mustard ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 lemon, juiced and zested ADVERTISEMENT",
            "1 teaspoon chopped fresh dill ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (1.5 pound) salmon fillet, skin removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak cedar plank in water for at least 1 hour.\nPreheat grill for indirect cooking over medium heat.\nMix Dijon mustard, mayonnaise, lemon juice, lemon zest, dill, and garlic in a bowl.\nArrange salmon on soaked cedar plank and spread mustard mixture over salmon.\nPlace cedar plank on the cooler side of the grill; cook until salmon is easily flaked with a fork, 25 to 30 minutes.\n",
        "picture_link": "VBvTF7P9jxYG9FTWyI1/S2MRpzht.BG"
    },
    {
        "title": "\"Bowl Full of Cherry\" Ham Glaze",
        "ingredients": [
            "2 cups cherry preserves ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons ground allspice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cherry preserves, red wine, brown sugar, and allspice together in a saucepan.\nPlace over medium heat and bring to a simmer. Reduce heat to low, stirring often, until glaze thickens, about 10 minutes.\n",
        "picture_link": "foqq6RH6J26e.Wa6j46E3oDOcxwcGJi"
    },
    {
        "title": "Easy Italian Pasta Salad",
        "ingredients": [
            "1 (16 ounce) package bow-tie pasta ADVERTISEMENT",
            "2 large tomatoes, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "1 cucumber, chopped ADVERTISEMENT",
            "2 (6 ounce) cans sliced black olives ADVERTISEMENT",
            "5 stalks celery, chopped ADVERTISEMENT",
            "1 (8 ounce) bottle Italian-style salad dressing, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain. Rinse pasta in cold water until cool; drain.\nToss drained pasta, tomatoes, green bell pepper, yellow bell pepper, cucumber, black olives, and celery together in a large bowl.\nPour Italian-style dressing over the pasta mixture; toss to coat.\nChill salad 20 minutes before serving.\n",
        "picture_link": "PDGJSnK5WZdBGY.Uc9PBLRLPRJn26tK"
    },
    {
        "title": "Savory Mango Guacamole",
        "ingredients": [
            "3 large avocados, peeled and pitted ADVERTISEMENT",
            "1 small red onion, chopped ADVERTISEMENT",
            "1 mango - peeled, pitted, and chopped ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash avocados in a medium bowl to a lumpy consistency. Mix onion, mango, lime juice, garlic, salt, and cilantro into avocado.\n",
        "picture_link": "W8nY1kIK6qM7vN28TlouEQQFceKcDo."
    },
    {
        "title": "Fried Cabbage and Noodles",
        "ingredients": [
            "1 (8 ounce) package kluski noodles ADVERTISEMENT",
            "1 pound bacon, chopped ADVERTISEMENT",
            "1 head cabbage, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 dash hot pepper sauce (such as Frank's RedHot®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in kluski noodles and return to a boil. Cook kluski noodles uncovered, stirring occasionally, until tender but still slightly firm, 7 to 10 minutes. Drain well and set noodles aside.\nPlace chopped bacon in a large, deep skillet, and cook over medium-high heat, stirring often, until evenly browned, 5 to 8 minutes.\nCook and stir cabbage and onion into the bacon and drippings until the cabbage is wilted and tender, about 10 minutes.\nGently mix the cooked kluski noodles into cabbage mixture; season with hot sauce.\n",
        "picture_link": "rEUGmmyHnHrbD6302jR.F7VtWHRETeW"
    },
    {
        "title": "Cape Codder Cocktail",
        "ingredients": [
            "1 1/2 fluid ounces vodka ADVERTISEMENT",
            "5 fluid ounces cranberry juice ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "1 lime wedge for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour vodka and cranberry juice into a highball glass filled with ice; stir well.\nGarnish with a lime wedge.\n",
        "picture_link": "CWtc.aqXyupvO1Rc6nYhSomtbqb0w5q"
    },
    {
        "title": "Slow Cooker Butternut Squash Soup ",
        "ingredients": [
            "2 large butternut squashes, seeded and sliced into rounds ADVERTISEMENT",
            "4 carrots, peeled and cut into chunks ADVERTISEMENT",
            "1 large yellow onion, quartered ADVERTISEMENT",
            "8 cubes vegetable bouillon ADVERTISEMENT",
            "1 white potato, peeled and cut into chunks ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 500 degrees F (260 degrees C). Line a baking sheet with aluminum foil.\nSpread squash, carrots, and onion out into a single layer on the prepared baking sheet.\nBake in the preheated oven until slightly browned, about 10 minutes. Cut rind from squash and discard.\nPlace bouillon cubes in a slow cooker. Pour peeled squash pieces, carrots, onions, and potato into slow cooker. Pour water over vegetables and stir in bay leaf, garlic powder, nutmeg, salt, and black pepper.\nCook on High for 4 hours, stirring once. Discard bay leaf.\nPuree soup with an immersion blender until smooth.\n",
        "picture_link": "4kpA3j8H6lREnpw8Fl6AOG73tungU6C"
    },
    {
        "title": "Quick Black Bean Hummus",
        "ingredients": [
            "2 (15 ounce) cans black beans, drained ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon tahini ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend black beans, garlic, lemon juice, tahini, cumin, salt, and black pepper together in a blender. Pour olive oil into blender in a steady stream until desired consistency is reached.\n",
        "picture_link": "VUqR7y9k7/RY8bTqSbS6OngZPu8Kh9m"
    },
    {
        "title": "Barbeque Roasted Salmon",
        "ingredients": [
            "3 (6 ounce) salmon fillets ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "4 teaspoons lemon zest ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/4 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place salmon in a resealable bag and add lemon juice; marinate in the refrigerator for at least 1 hour.\nPreheat oven to 400 degrees F (200 degrees C). Line a baking dish with aluminum foil and spray foil with cooking spray.\nBlend brown sugar, chili powder, lemon zest, oil, cumin, cinnamon, and salt together in a blender until brown sugar mixture is smooth.\nRemove salmon from bag and discard bag and lemon juice. Spread brown sugar mixture over salmon and place in the prepared baking dish.\nBake in the preheated oven until fish flakes easily with a fork, 12 to 15 minutes.\n",
        "picture_link": "vRgOqJ5jasYQ38QI44E4i.ozPx.bGU6"
    },
    {
        "title": "Smoked Andouille Quesadilla",
        "ingredients": [
            "1 (12 ounce) package al fresco® Smoked Andouille Chicken Sausage, browned, sliced on the bias ADVERTISEMENT",
            "4 (10 inch) sun-dried tomato wraps or tortillas ADVERTISEMENT",
            "16 thin slices provolone cheese ADVERTISEMENT",
            "6 ounces roasted red peppers, drained, sliced ADVERTISEMENT",
            "1 fresh avocado, thinly sliced ADVERTISEMENT",
            "2/3 cup grated carrots ADVERTISEMENT",
            "2/3 cup mild salsa ADVERTISEMENT",
            "1/2 cup fat-free sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm a 10-inch skillet on medium heat, coat with cooking spray.\nPlace 1 piece of the flat bread in the pan and top with 4 slices of the cheese. Follow with half the slices of Smoked Andouille, and half of the red pepper strips, avocado slices, and shredded carrots filling in a circular pattern. Top with half the salsa. Finish with 4 more pieces of the cheese and a piece of flat bread.\nAllow the bottom to brown and heat through well, 4 - 5 minutes. Pre-heat broiler.\nOnce well browned, spray top tortilla with cooking spray and place quesadilla under broiler to nicely brown the top. Use a watchful eye for this step, since the top can brown quickly. Allow to rest for 3 - 5 minutes.\nPlace a large platter over the pan and carefully flip over. Slice into 8 wedges and serve with a dollop of sour cream.\nRepeat to make second quesadilla.\n",
        "picture_link": "AWYjE4GzENNrerlxsvZoeil1uLx7Et6"
    },
    {
        "title": "Curry and Cheese Cauliflower",
        "ingredients": [
            "salt to taste ADVERTISEMENT",
            "1 head cauliflower ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 teaspoons yellow curry powder ADVERTISEMENT",
            "3/4 cup shredded Cheddar-Monterey Jack cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBring a large pot of salted water to a boil; cook cauliflower in the boiling water until slightly tender, about 10 minutes. Carefully remove cauliflower and place, stem-side down, on a baking sheet. Cut cauliflower in half through the stem; lay cut-side down on the baking sheet.\nCombine mayonnaise and curry powder together in a bowl; spread over the cauliflower halves. Sprinkle Cheddar cheese-Monterey Jack cheese over curry-mayonnaise layer.\nBake in the preheated oven until cheese is melted and bubbling, about 10 minutes.\n",
        "picture_link": "MYD53/GQPx4pz3tS3wBxk9/oQeB99.G"
    },
    {
        "title": "Gluten-Free Pumpkin Bread",
        "ingredients": [
            "1 cup pumpkin puree ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "1/4 cup applesauce ADVERTISEMENT",
            "1 3/4 cups gluten-free multi-purpose flour (such as Mixoflour) ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x5-inch loaf pan.\nMix pumpkin puree, sugar, eggs, oil, and applesauce together in a large bowl. Whisk flour, baking soda, salt, cinnamon, nutmeg, cloves, and ginger together in a separate bowl; add to pumpkin mixture and stir until just blended into a batter. Gently fold raisins through the batter; pour into prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 70 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "dtMa2OT0D0MmqaVGt/UKD1JqzFnpxnq"
    },
    {
        "title": "Creamy Fettuccine Alfredo with Broccoli",
        "ingredients": [
            "2 cups broccoli ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 pound fettuccine pasta ADVERTISEMENT",
            "1 (16 ounce) jar four-cheese Alfredo sauce (such as Classico®) ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon ground black pepper (optional) ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese (such as Kraft®), or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Cook broccoli in the boiling water until bright green and tender, 2 to 3 minutes. Drain.\nFill a large pot with water; add salt and bring to a rolling boil. Stir in fettuccine, bring back to a boil, and cook pasta, stirring 2 to 3 times using tongs, over medium heat until cooked through but still firm to the bite, about 10 to 12 minutes. Drain and return pasta to pot.\nMix broccoli, Alfredo sauce, butter, and black pepper into pasta using tongs. Transfer fettuccine Alfredo to a serving bowl and top with Parmesan cheese.\n",
        "picture_link": "gF4WAgKt/6wR8woF0dKvC40Qp4PaB0G"
    },
    {
        "title": "Paleo Coconut Pancakes",
        "ingredients": [
            "1/2 cup coconut flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon coconut oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, baking soda, and salt together in a bowl.\nBeat egg yolks and butter together in a bowl until smooth; add coconut milk and vanilla extract and beat until smooth. Stir milk mixture into flour mixture until batter is evenly combined.\nBeat egg whites in a bowl until foamy, about 2 minutes; gently fold into batter.\nHeat coconut oil in a skillet over medium heat. Drop batter by large spoonfuls into the skillet and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "pUcXeBRdii2hZH8U2smel17/tHWnZAG"
    },
    {
        "title": "Celery Root Puree",
        "ingredients": [
            "1 large celery root, peeled and cut into chunks ADVERTISEMENT",
            "1 lemon, juiced, divided ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place celery root, 1/2 of the lemon juice, and kosher salt in a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, 15 to 20 minutes. Drain.\nBlend celery root, cream, and butter in a blender until smooth. Push puree into a bowl through a fine-mesh strainer with a wooden spoon or spatula until puree is completely smooth. Drizzle remaining lemon juice into puree and season with salt and cayenne pepper.\n",
        "picture_link": ".GDNg2W6mITKc7NlbM3gsFn7ASv9Vk2"
    },
    {
        "title": "Vegetarian Eggplant Meatballs",
        "ingredients": [
            "3 tablespoons olive oil, or more as needed ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "6 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1 eggplant, peeled and cubed ADVERTISEMENT",
            "10 leaves fresh basil, chopped ADVERTISEMENT",
            "3/4 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir onion and garlic until tender, 5 to 10 minutes. Add eggplant, basil, oregano, thyme, salt, and pepper to onion mixture; cook and stir, mashing occasionally with a wooden spoon, until eggplant is cooked through but still holds shape, about 10 minutes. Remove skillet from heat and cool mixture to room temperature.\nPreheat oven to 400 degrees F (200 degrees C). Line a baking sheet with a silicone mat (such as Silpat(R)).\nMix Parmesan cheese and bread crumbs into eggplant mixture; shape into 15 to 18 \"meatballs\". Arrange \"meatballs\" on the prepared baking sheet.\nBake in the preheated oven, turning occasionally, until browned on all sides, about 30 minutes.\n",
        "picture_link": "bf2DoKrw00Mha9VgLaGU4OjgT70v3kC"
    },
    {
        "title": "Favorite Basil-Tomato Soup",
        "ingredients": [
            "2 (28 ounce) cans crushed tomatoes ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "18 fresh basil leaves, or more to taste, finely chopped ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir tomatoes and chicken brother together in a large saucepan; bring to a boil, reduce heat to medium-low, and cook at a simmer until slightly reduced, about 10 minutes.\nStir basil and sugar into the tomato mixture; reduce heat to low and continue cooking until the basil is wilted, about 5 minutes.\nStir cream into the tomato mixture; add butter and continue cooking, stirring occasionally, until the butter is completely melted, 5 to 7 minutes more.\n",
        "picture_link": "89wguTj.MUbFWKtxQT5N4GOtcJC2wlG"
    },
    {
        "title": "Roasted Tomato Balsamic Vinaigrette",
        "ingredients": [
            "1 tablespoon double concentrated tomato paste ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1/2 teaspoon Dijon mustard ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk tomato paste, balsamic vinegar, rice vinegar, and Dijon mustard together in a bowl until smooth.\nSlowly drizzle olive oil into tomato paste mixture while whisking rapidly until dressing is thick and creamy. Season with salt and black pepper.\n",
        "picture_link": "4zHbLjZMCpDL.lAYTXzGg17X78nTWMG"
    },
    {
        "title": "Almond Coconut Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup stevia ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups.\nCombine flour, sugar, stevia, baking powder, and salt together in a bowl. Whisk sour cream, butter, and eggs together in a separate bowl; stir into flour mixture just until batter is moistened. Fold coconut and chocolate chips into batter. Fill the prepared muffin cups 2/3-full with batter and top with sliced almonds.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 18 to 20 minutes. Cool muffins for 5 minutes in the tin before transferring to a wire rack.\n",
        "picture_link": "iw1mZvrhKX.VWRGIvl9VrpRfJKlS4sS"
    },
    {
        "title": "Baked Oatmeal with Cinnamon",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 3/4 cups old-fashioned oats ADVERTISEMENT",
            "3 1/3 cups milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Prepare an 8-inch square baking dish with cooking spray.\nSpread oats into the prepared baking dish.\nBeat milk, eggs, brown sugar, vegetable oil, vanilla extract, cinnamon, and salt together in a large bowl until smooth; pour over oats.\nBake in preheated oven until oats are softened and mixture thickened, 50 to 55 minutes.\n",
        "picture_link": "ToISqIMsNZscPewoASantLPELSVCbTG"
    },
    {
        "title": "Dianne's Lemon-Feta Quinoa Salad",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "2/3 cup halved grape tomatoes ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup roasted unsalted sunflower seeds ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 tablespoon minced shallot ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon fresh ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water, quinoa, and 1/2 teaspoon sea salt to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes. Spread quinoa on a baking sheet and cool, about 30 minutes.\nMix quinoa, tomatoes, feta cheese, sunflower seeds, parsley, olives, and shallot together in a large bowl.\nWhisk olive oil, lemon juice, mustard, garlic, 1/4 teaspoon sea salt, and pepper together in a bowl; pour over quinoa mixture and toss to coat.\n",
        "picture_link": "YRMs4SGEZVW2fWLP0IS.IFlOyRg611y"
    },
    {
        "title": "Turkey Wrap by Avocados From Mexico",
        "ingredients": [
            "4 (8 to 10 inch) flour tortillas, any flavor ADVERTISEMENT",
            "1/2 cup cream cheese ADVERTISEMENT",
            "3 cups tightly packed leaf lettuce ADVERTISEMENT",
            "1/2 pound thinly sliced cooked turkey (from deli) ADVERTISEMENT",
            "1 bell pepper, cut into strips ADVERTISEMENT",
            "1 scallion, chopped ADVERTISEMENT",
            "1 Avocado from Mexico, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread each tortilla evenly with cream cheese. Arrange lettuce evenly over cream cheese to within 1 inch of top edge. Top with single layer of bell pepper strips. Evenly layer turkey slices over bell pepper. Sprinkle with scallions and avocado.\nStarting with bottom edge, tightly roll up each tortilla.\nTo serve, trim off uneven ends of rolls. Cut rolls into 1-inch slices; arrange on serving platter.\nGarnish with thinly sliced radishes.\n",
        "picture_link": "2pKsz.NBK3vOSmo3DotTxeodbmUyEr2"
    },
    {
        "title": "Tangy Glazed Black Cod",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 tablespoons fresh lime juice ADVERTISEMENT",
            "2 tablespoons light brown sugar ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 (1 pound) fillet black cod, bones removed ADVERTISEMENT",
            "1/3 pint cherry tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Spray the bottom of a Dutch oven or covered casserole dish with cooking spray.\nCombine lime juice, brown sugar, vinegar, and soy sauce in a saucepan over medium heat; cook and stir until sauce is thickened, about 5 minutes.\nPlace cod in the prepared Dutch oven. Pour sauce over fish and arrange tomatoes around fish. Cover dish with an oven-safe lid.\nBake in the preheated oven until fish flakes easily with a fork, about 10 minutes.\n",
        "picture_link": "GjozvrPTUHMifTQC62BRJD.6g7lHIue"
    },
    {
        "title": "Paleo Coconut Crepes",
        "ingredients": [
            "4 egg whites ADVERTISEMENT",
            "3 tablespoons almond milk ADVERTISEMENT",
            "1/4 teaspoon vanilla extract, or to taste ADVERTISEMENT",
            "2 tablespoons coconut flour ADVERTISEMENT",
            "1/8 teaspoon baking powder ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites, almond milk, and vanilla extract together in a bowl until smooth; add coconut flour, baking powder, and sea salt and continue to beat until no clumps remain. Let the mixture sit for 8 minutes.\nHeat a small non-stick skillet over medium heat. Pour about 1/3 of the batter into the pan. Tilt the pan so the batter covers the bottom of the skillet to all sides. Cook until the edges begin to slightly lift and the bottom is slightly browned, about 2 minutes; flip and cook until the other side is browned, 1 to 2 minutes more. Repeat with remaining batter.\n",
        "picture_link": "eLee.9xrxEmQIBIktKJ0movgA6nt8La"
    },
    {
        "title": "No-Bake Choco Bar",
        "ingredients": [
            "1 cup peanut butter ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup coconut oil ADVERTISEMENT",
            "2 cups oats ADVERTISEMENT",
            "1 1/4 cups dark chocolate chips ADVERTISEMENT",
            "1 cup shredded coconut (optional) ADVERTISEMENT",
            "1/2 cup walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir peanut butter, honey, and coconut oil together in a saucepan over medium-low heat until melted and smooth. Remove pan from heat and add oats, chocolate chips, coconut, walnuts, and vanilla extract to the peanut butter mixture; stir to coat.\nSpread the mixture into a 13x9-inch baking dish; refrigerate until set, at least 30 minutes. Cut into 20 bars.\n",
        "picture_link": "c0FxoPeG/3JWKYXCNdd9m2QVlizV73."
    },
    {
        "title": "Mom's Italian Tortellini Soup",
        "ingredients": [
            "3/4 pound Italian sausage links, casings removed ADVERTISEMENT",
            "3 cups thinly sliced mushrooms ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "5 1/4 cups water ADVERTISEMENT",
            "1 (28 ounce) can chopped tomatoes with juice ADVERTISEMENT",
            "1 1/2 cups hearty red wine ADVERTISEMENT",
            "5 cubes beef bouillon ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 (8 ounce) package spinach and cheese tortellini (such as Ronzoni® Ricotta and Spinach) ADVERTISEMENT",
            "2 cups chopped zucchini ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir sausage in a large saucepan over medium heat until browned and crumbly, 5 to 7 minutes; drain. Add mushrooms, onion, and garlic; cook and stir until mushrooms and onion are tender, about 5 minutes.\nMix tomatoes with juice, red wine, beef bouillon, basil, and pepper into sausage mixture; bring to a boil. Reduce heat to medium-low, cover saucepan, and simmer, stirring occasionally, until heated through, about 15 minutes. Bring liquid to a boil and add tortellini; cook until pasta is heated through, about 12 minutes.\nStir zucchini into soup and simmer until tender, about 5 minutes. Remove soup from heat and let stand 5 minutes before serving.\n",
        "picture_link": "dHHIpvgivYgq1ofLAKqzAE3YNizGhXS"
    },
    {
        "title": "Creamed Onions and Sage",
        "ingredients": [
            "24 small onions ADVERTISEMENT",
            "12 fresh mushrooms, sliced ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups half-and-half cream ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons dried sage ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "4 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 dash paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel onions a trim slightly at the top and bottom. Boil the onions gently in salted water until tender (about 30 minutes).\nPreheat oven to 350 degrees F (175 degrees C). Butter one shallow baking dish.\nSaute the sliced mushrooms in the butter or margarine. Stir in the flour. Stir in the half and half or milk, salt, sage, 1/2 of the lemon peel and all of the lemon juice. Cook, stirring over medium heat until sauce thickens.\nPlace the cooked onions in the prepared baking dish and pour the mushroom sauce over them.\nBake at 350 degrees F (175 degrees C) for about 20 minutes. Sprinkle the top with the chopped parsley, remaining lemon peel and paprika to taste.\n",
        "picture_link": "GpyF.u5t6U3.cqs7ZU7WQlAM1fOEJI6"
    },
    {
        "title": "Ghraybeh Cookies",
        "ingredients": [
            "1/2 cup cake flour ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup semolina flour ADVERTISEMENT",
            "1 cup clarified butter ADVERTISEMENT",
            "2/3 cup confectioners' sugar ADVERTISEMENT",
            "3/4 teaspoon orange flower water ADVERTISEMENT",
            "30 blanched almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C).\nSift together the cake flour, all-purpose flour, and semolina and set aside. Beat the butter for at least 10 minutes until it is fluffy. Then beat 2 more minutes while sprinkling in the blossom water and confectioners' sugar. Fold in the flour mixture gradually. Then refrigerate the soft dough in covered bowl for about 10 minutes.\nOn a lightly floured surface, roll or pat the dough out to 1/4 inch thickness, and cut into 1 inch sided diamonds and place them 1/2 inch apart on an ungreased baking sheet. Then place an almond in the center of each cookie.\nBack 35 to 40 minutes in the preheated oven. Do not over bake. Let the cookies cool for at least an hour. The are best served after they have cooled for several hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chinese Chews I",
        "ingredients": [
            "2 cups pureed dates ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups ground pecans ADVERTISEMENT",
            "1 1/2 cups cake flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nMix dry ingredients except confectioner's sugar. Add nuts and dates.\nThen add eggs which have been lightly beaten. Mix well.\nPress mixture into ungreased cookie sheet as thin as possible. Bake for 15-20 minutes.\nCut into 1 -2 inch squares while hot. Roll into balls as soon as the squares are cool enough to handle then roll in confectioner's sugar. Allow to cool completely before eating.\n",
        "picture_link": "xGrNFiXdKnVbXOArCytNzyNo87gGrnG"
    },
    {
        "title": "Starr's Soft Sugar Cookies",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon lemon extract ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "3 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBeat together white and brown sugars, butter and shortening until light and fluffy. Beat in eggs, vanilla and lemon extract to mix well.\nSift together nutmeg, flour, baking powder, cream of tartar, salt and soda. Add alternately with buttermilk to creamed mixture.\nDrop tablespoonfuls of dough 2 1/2 inches apart onto greased baking sheet. With the back of the spoon, spread round and round making the outer edge of the cookies a little thicker than the center. Sprinkle generously with the reserved white sugar and place a fat raisin in the center of each cookie.\nBake about 10 minutes. For softer cookies, bake in hot oven (425 degrees F (220 degrees C)) for about 8 minutes or until no indentation remains when you touch the center of the cookie with your fingertip. Remove cookies and cool on racks.\n",
        "picture_link": "lLKoScXr4bT8ROoqgl7fmN2TN.Z0ZOW"
    },
    {
        "title": "Coconut Macaroons I",
        "ingredients": [
            "2 1/2 cups shredded coconut ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "6 egg whites ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1 1/2 cups halved red candied cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 2 cookie sheets with parchment paper.\nIn small bowl, combine sugar and cornstarch.\nIn a large metal bowl, combine egg whites with almond extract. Place the bowl over a pan of simmering water. Stir in the sugar mixture. Whip with an electric mixer until thick and stiff, about 15 minutes. Fold in coconut. Remove from heat, and let cool for 5 minutes.\nPlace mixture in a pastry bag fitted with a large star tip. Press out dough about 1 1/2 inches apart onto cookie sheets. Place 1/2 a cherry into the top of each cookie.\nBake for 18 to 20 minutes or until lightly colored. Let cool on baking sheets for a minute before removing to wire racks.\n",
        "picture_link": "O1MQ7QeqZxlcqcLHutjQM2QyyED.fc."
    },
    {
        "title": "Lots o' Cookies",
        "ingredients": [
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease cookie sheets.\nIn a large bowl, cream sugars, butter and shortening. Beat in eggs and vanilla until well blended.\nMix in sifted flours, salt and baking soda and stir well.\nStir in remaining ingredients.\nDrop in teaspoon size balls on greased baking sheet about 2 inches apart. Bake 8 minutes or until edges are brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fried Green Tomatoes II",
        "ingredients": [
            "1/3 cup bread crumbs ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 pound green tomatoes, sliced 1/2 inch thick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together bread crumbs, sugar, salt and pepper.\nCoat tomatoes in the crumb mixture.\nHeat oil in a large frying pan over medium-high heat. Fry tomatoes for 2 minutes on each side. Drain on paper towels.\n",
        "picture_link": "Am3PauHNjXlgQ7kxKfKezBOqEYrHBVa"
    },
    {
        "title": "Southern Cornbread Oyster Dressing",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "3 cups crumbled cornbread ADVERTISEMENT",
            "3 cups soft bread cubes ADVERTISEMENT",
            "1/2 cup chopped parsley ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 pint shucked oysters, drained with liquid reserved ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter one 4 quart casserole dish.\nChop the oysters. Saute red onion, green onion, celery and oysters in 2 tablespoons of the butter until soft.\nIn a large bowl, combine cooked onion and oyster mixture with cornbread, bread cubes, parsley, eggs and 1/2 cup reserved oyster liquid. Gently toss to mix, add salt and pepper to taste.\nPlace dressing in casserole dish and dot with remaining butter. Bake uncovered for 45 minutes or until top is golden brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gobi Masala  (Cauliflower Curry)",
        "ingredients": [
            "2 tablespoons unsweetened coconut cream ADVERTISEMENT",
            "5 tablespoons milk ADVERTISEMENT",
            "1 tablespoon tamarind pulp ADVERTISEMENT",
            "2 tablespoons boiling water ADVERTISEMENT",
            "1 tablespoon chickpea flour ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon coriander seed ADVERTISEMENT",
            "1 head cauliflower, broken into small florets ADVERTISEMENT",
            "1 teaspoon mustard seed ADVERTISEMENT",
            "2 tablespoons vegetable oil for frying ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve the coconut cream in 5 tablespoons milk.\nSoak the tamarind in 2 tablespoons boiling water, 5 to 10 minutes. Squeeze the husk and discard the tamarind piece, save the water.\nCombine the tamarind water with the flour, chili powder and coriander in a mixing bowl, mix well. Add the cauliflower and coconut milk, stir until cauliflower is coated.\nHeat oil in a saucepan. Place the mustard seeds in the oil, when they start popping add the cauliflower mixture. Cover with a lid and simmer until cauliflower is tender, stir occasionally.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cream Cheese Brownies I",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup semisweet chocolate chips ADVERTISEMENT",
            "5 tablespoons shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 tablespoons cream cheese ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 9 inch square baking pan.\nIn top of a double boiler, melt chocolate chips and shortening, stirring frequently until smooth. Pour into a large bowl, and mix in sugar, cream cheese, and eggs. Stir in vanilla and almond extracts. Gradually mix in flour, baking powder and salt. Fold in almonds and pour the batter into pan.\nBake for 35 to 40 minutes in the preheated oven, until toothpick inserted near the center comes out clean. Let cool in pan before cutting into bars.\n",
        "picture_link": "O8pv29JgeyR8cBc8JzyXj8AR/WjN62y"
    },
    {
        "title": "Jim's Cornbread Stuffing",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "3 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "6 cups crumbled cornbread ADVERTISEMENT",
            "1 (6 ounce) can black olives ADVERTISEMENT",
            "1 (8 ounce) can water chestnuts, drained and chopped ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon rubbed sage ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in saucepan and cover with water. Bring to boil. Cover, remove from heat, and let eggs sit in hot water for 10 to 12 minutes. Remove from hot water; cool, peel and chop.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x13 inch baking dish.\nIn a 2 quart pot, combine the chicken stock, butter, bell pepper, onion and celery. Bring to boil and simmer until vegetables are tender.\nIn a large bowl, combine the cornbread, eggs, olives, chestnuts, salt, pepper, sage and poultry seasoning. Pour broth over cornbread and mix thoroughly.\nPlace stuffing in baking dish; bake for 60 to 75 minutes or until edges begin to brown.\n",
        "picture_link": "dC8FBCRcVbd.Jg9CjtbRmpJGrjTBNFi"
    },
    {
        "title": "Cranberry Conserve",
        "ingredients": [
            "2 quarts cranberries ADVERTISEMENT",
            "1/2 pound raisins ADVERTISEMENT",
            "1 cup diced orange segments ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "6 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Just cover cranberries with fresh cold water and bring to a boil, cooking until berries are soft. Add the sugar, orange pulp, and raisins, and simmer slowly until thick. Add the nut meats. Continue cooking for 5 more minutes. May be served warm or chilled.\n",
        "picture_link": "7LojiXQj9eklATKKU/Or.W8b8kaRlRq"
    },
    {
        "title": "Bittersweet Banana Pudding",
        "ingredients": [
            "1 (16 ounce) package silken tofu ADVERTISEMENT",
            "2 cups semi-sweet chocolate chips ADVERTISEMENT",
            "2 ripe bananas ADVERTISEMENT",
            "2 tablespoons raspberry vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend tofu and bananas in a blender.\nMelt chocolate in a double boiler.\nPour the chocolate into the blender, blend well. Add the vinegar to the blender. Mix until all of the ingredients are combined. Pour mixture into a shallow dish. Refrigerate for three hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hungarian Kifli I",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup cottage cheese, creamed ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 cups chopped walnuts ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, beat together butter or margarine and cottage cheese til light and fluffy. Add flour until dough forms a ball.\nDivide dough into 3 equal portions. Wrap in plastic wrap and refrigerate until firm.\nPreheat oven to 375 degrees F (190 degrees C) and grease cookie sheets.\nTo Make Filling: Combine egg whites, nuts, water, and ground cinammon. Mix well and set aside.\nOn a floured surface roll 1 portion of dough into a 10 inch circle. Spread circle with 1/3 of the filling to within approximately 1/2 inch of the edge.\nCut circle into 24 pie-shaped wedges. Beginning at outer edge roll up each wedge tightly. Place point side down on cookie sheet 1 1/2 inches apart. Bake 13-15 minutes or until golden (be sure to watch carefully as these cookies burn easily).\nRemove to rack to cool. Repeat process with each remaining portion of dough and filling.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Owl Cookies",
        "ingredients": [
            "1 1/4 cups candy-coated milk chocolate pieces ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "24 ounces dry sugar cookie mix ADVERTISEMENT",
            "1 cup cashew halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan combine 3/4 cup of the candies and milk. Melt over low heat, stirring until smooth. Remove from heat.\nPrepare cookie mixes according to package directions. Stir melted chocolate into half the dough. Form chocolate dough into two 12-inch long rolls about 1 inch in diameter. Wrap in wax paper or foil. Chill until firm, about 2 hours.\nDivide plain dough in half. On a well-floured surface, roll each plain half out to a 12 x 6 inch rectangle. Place a chocolate roll on long edge. Roll up, pressing doughs lightly together so plain dough encases chocolate roll. Repeat with remaining dough.\nWrap each roll in wax paper or foil. Chill about 2 hours until firm. Preheat oven to 375 F (190 C).\nCut each roll into 1/4 inch slices. Place 2 slices so they are touching on greased baking sheet. In the center of each chocolate circle, place one of the remaining candies for eye. Where the slices touch, place a cashew to form nose.\nBake until the plain cookie is lightly browned, 8 to 10 minutes. Cool cookies on baking sheets 2 to 3 minutes. Remove and cool on wire racks.\n",
        "picture_link": "PcpOdBbZDnIv5SUWU.UT3T9AoZ8SqB."
    },
    {
        "title": "Ricotta Cookies I",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup candied mixed fruit ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "35 pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the butter and sugar until smooth. Beat in the egg, vanilla, and ricotta cheese. Combine the flour and salt; blend into the ricotta mixture. Stir in the candied fruit and walnuts using a wooden spoon. Drop dough by rounded teaspoons onto ungreased cookie sheets. Top each cookie with a pecan half.\nBake for 12 to 15 minutes in the preheated oven, or until sides begin to brown. Remove and cool cookies on wire racks.\n",
        "picture_link": "BQvC7G5AUTWFs81r1mRAaB.rBJchZZq"
    },
    {
        "title": "Pfeffernuesse Cookie Mix",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup light molasses ADVERTISEMENT",
            "1 1/4 teaspoons baking soda ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together flour, sugar, baking soda, spices, and dash black pepper.\nIn large saucepan, combine molasses and butter; heat and stir until butter melts. Cool to room temperature.\nStir in eggs. Add dry ingredients to molasses mixture; mix well. Cover. Chill several hours or overnight.\nShape into 1\" balls. Place on greased cookie sheet.\nBake at 350 degrees F (180 degrees C) for 12 to 14 minutes or until cookies are done. Remove. Cool. Roll in powdered sugar.\n",
        "picture_link": "tWc4bu6aDmRs4XwX4WXMzIoiJRIozUW"
    },
    {
        "title": "Cauliflower Quiche",
        "ingredients": [
            "1 head cauliflower, cut into large florets ADVERTISEMENT",
            "1/3 cup chopped fresh mushrooms ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "5 large eggs, or more to taste ADVERTISEMENT",
            "1 cup half-and-half, or more to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese (optional) ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch curry powder, or to taste ADVERTISEMENT",
            "1 pinch paprika, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower; cover and steam until tender, 5 to 7 minutes. Cool to room temperature.\nBlend cauliflower, mushrooms, and green onions in a blender under chopped, yet still chunky.\nSeparate egg yolks and egg whites into 2 separate bowls. Beat egg whites in a bowl using an electric mixer until medium peaks form.\nCombine half-and-half, butter, and flour together in a saucepan over low heat; cook and stir until white sauce is thickened, about 5 minutes. Cool slightly.\nStir white sauce, Parmesan cheese, cauliflower mixture, egg yolks, turmeric, salt, pepper, and curry powder together in a bowl; gently fold in egg whites using a spatula or wide knife. Pour egg mixture into a glass baking dish. Sprinkle paprika over egg mixture.\nBake in the preheated oven until golden brown and set in the middle, 30 to 35 minutes.\n",
        "picture_link": "TPZruqMlNLPhbkKhFCK6WBR6qVGbAmK"
    },
    {
        "title": "Shrimp and Vegetable Couscous",
        "ingredients": [
            "1 pound medium shrimp, shelled and deveined, shells reserved ADVERTISEMENT",
            "2 1/3 cups cold water ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "2 zucchinis, diced ADVERTISEMENT",
            "1 eggplant, diced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup diced tomato ADVERTISEMENT",
            "2 teaspoons olive oil, or as needed ADVERTISEMENT",
            "2 cups couscous ADVERTISEMENT",
            "1/2 bunch fresh tarragon, chopped ADVERTISEMENT",
            "1/2 bunch fresh dill, chopped ADVERTISEMENT",
            "1 pinch cayenne, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium-high heat. Saute shrimp shells in melted butter until pink and fragrant, 3 to 4 minutes. Add water; bring to a simmer, reduce heat to low, and simmer until flavors combine, about 20 minutes.\nHeat 1/3 cup olive oil in a large skillet over medium-high heat. Saute zucchini and eggplant with a pinch of salt and pepper in hot oil until soft, 6 to 7 minutes. Clear a space in the center of the skillet. Add tomato; saute in the center of the skillet until slightly caramelized, 3 to 4 minutes. Add garlic to the skillet; cook and stir all vegetables together until garlic is fragrant, about 1 minute.\nHeat 2 teaspoons oil in a skillet over medium-high heat. Saute shrimp in hot oil until shrimp are pink, about 1 minute per side.\nCombine vegetable mixture, shrimp, couscous, tarragon, and dill together in a bowl. Season with salt, black pepper, and cayenne pepper. Scrape down the sides of the bowl and pat mixture into a flat shape.\nPour hot shrimp stock through a strainer into couscous mixture, discarding strained shells. Cover the bowl with aluminum foil and let sit until couscous is tender and fluffy, about 5 minutes. Toss.\n",
        "picture_link": "UV6SInS/QJX/aE.KIWVDhS3vaT2CNfK"
    },
    {
        "title": "Foolproof Flat Iron Steaks",
        "ingredients": [
            "2 (1 pound) flat iron steaks ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil ADVERTISEMENT",
            "3 tablespoons finely chopped green onions ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place steaks, balsamic vinegar, olive oil, green onions, garlic, soy sauce, thyme, mustard, and black pepper in an extra large resealable plastic bag, squeeze out excess air, and seal the bag. Knead the bag with your hands to distribute ingredients evenly and completely coat the steaks. Marinate in the refrigerator for 1 hour.\nPreheat grill for medium-high heat and lightly oil the grate. Remove steaks from refrigerator and let sit at room temperature for 10 minutes.\nRemove steaks from bag and discard marinade.\nCook steaks on the preheated grill until they start to firm and are reddish-pink and juicy in the center, 6 to 7 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove steaks to a plate and let rest for 5 minutes before slicing.\n",
        "picture_link": "gpd.VtnlCyLBQ9ureY7vR2M/7/epwM2"
    },
    {
        "title": "Sweet Potato Waffles with Cranberry Maple Syrup",
        "ingredients": [
            "Waffles: ADVERTISEMENT",
            "1 1/2 cups sweet potato puree ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 1/2 tablespoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "Syrup: ADVERTISEMENT",
            "1 cup maple syrup ADVERTISEMENT",
            "1/2 cup cranberry sauce ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions.\nStir sweet potato, milk, egg, and butter together in a bowl. Whisk flour, brown sugar, baking powder, 1 teaspoon cinnamon, nutmeg, ginger, cloves, and salt together in a separate large bowl. Add potato mixture to flour mixture; stir until batter is just combined.\nLadle batter into the preheated waffle iron and cook until waffles are golden and crisp, about 3 minutes.\nStir maple syrup, cranberry sauce, and 1/2 teaspoon cinnamon together in a saucepan over medium heat. Cook, stirring occasionally, until well-combined and heated through, 5 to 10 minutes. Pour syrup over cooked waffles.\n",
        "picture_link": "BcfLWDuSj1YjgggotEJBxBLpS88pqWG"
    },
    {
        "title": "Gluten-Free Pizza Crust",
        "ingredients": [
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "1 cup garbanzo bean (chickpea) flour (such as Bob's Red Mill®) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 cloves garlic, pressed (optional) ADVERTISEMENT",
            "1/2 teaspoon salt (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 500 degrees F (260 degrees C).\nCoat the bottom and sides of a cast-iron skillet or an oven-proof baking dish with 1 tablespoon olive oil; heat in oven for 5 minutes.\nWhisk garbanzo bean flour and water together in a bowl until batter is smooth. Add remaining olive oil, garlic, and salt; mix well. Pour batter into the heated skillet.\nCook crust in the preheated oven until lightly browned, about 15 minutes.\n",
        "picture_link": "4822chFJW4u2/qLhoz4Jd4L9HSS1IUq"
    },
    {
        "title": "Chocolate Buttercream Frosting",
        "ingredients": [
            "3 ounces dark chocolate ADVERTISEMENT",
            "1 cup butter, room temperature ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup strong brewed coffee, room temperature, divided ADVERTISEMENT",
            "3 1/2 cups confectioners' sugar, sifted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes. Cool melted chocolate to room temperature, about 5 minutes.\nBeat butter in a bowl using an electric mixer until light and fluffy; add cocoa powder and beat until well combined. Mix 1 tablespoon coffee into creamed butter mixture; add melted chocolate and mix well.\nBeat confectioners' sugar, 1 cup at a time, into creamed butter mixture, mixing well before each addition until frosting is smooth. Add remaining coffee, 1 tablespoon at a time, until desired consistency is reached.\n",
        "picture_link": "f3zN7zASAY4MjgWQJgIOsKUV9jgI0zK"
    },
    {
        "title": "Salad Smoothie",
        "ingredients": [
            "1 cup water, or as desired ADVERTISEMENT",
            "1/2 orange, peeled ADVERTISEMENT",
            "1 cup fresh spinach ADVERTISEMENT",
            "1/2 raw beet, peeled ADVERTISEMENT",
            "1/3 cup baby carrots ADVERTISEMENT",
            "1/3 cup cauliflower florets ADVERTISEMENT",
            "1/3 cup broccoli florets ADVERTISEMENT",
            "1/4 cup blueberries, or to taste ADVERTISEMENT",
            "1 stalk celery ADVERTISEMENT",
            "1/2 lime, peeled ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water into the pitcher of a high-powered blender; add the orange, spinach, beet, carrots, cauliflower, broccoli, blueberries, celery, lime, honey, and chia seeds. Blend on high speed until smooth, about 1 minute.\n",
        "picture_link": "qo1JldMHmEtbNha79eY.xtFkjPhoBVa"
    },
    {
        "title": "Broiled Cauliflower with Four Cheese Tomato Sauce",
        "ingredients": [
            "2 tablespoons corn oil ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "3 large cloves garlic, minced ADVERTISEMENT",
            "4 cups large cauliflower florets ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "1 (24 ounce) jar Classico® Four Cheese Sauce ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley, divided ADVERTISEMENT",
            "1 tablespoon finely grated Parmesan cheese ADVERTISEMENT",
            "1 cup freshly grated mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pan over medium-high heat. Add onion and saute until beginning to soften but not brown, 2 to 3 minutes. Stir in garlic and cook another minute. Add the cauliflower; salt and pepper to taste. Cook and stir another minute to combine.\nStir in the sauce and white wine; add 1 tablespoon of the parsley. Cook and stir 5 minutes at a low simmer.\nTurn heat to medium-low, cover. Cook until cauliflower is almost tender, about 10 more minutes, stirring a few times.\nTurn broiler to high. Line a rimmed baking sheet with foil. Spray lightly with cooking spray.\nPour cauliflower and tomato sauce onto the baking sheet. Gently scoop some of the tomato sauce back over the top of the cauliflower. Spread the cauliflower evenly on the sheet.\nSprinkle Parmesan cheese then mozzarella cheese over the cauliflower.\nBroil until cheese is bubbly and slightly browned in spots, about 2 minutes. Watch carefully so cheese doesn't burn. Let rest 3 minutes before transferring to serving platter. Garnish with remaining fresh parsley.\n",
        "picture_link": "9OgemnRT9RHjoDTj8BnM/pRawbsQQV."
    },
    {
        "title": "Roast Pork with Blueberry Port Sauce",
        "ingredients": [
            "1 (2 1/2 pound) pork shoulder roast ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1 large shallot, halved ADVERTISEMENT",
            "3 sprigs fresh rosemary ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "2/3 cup port wine ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "2 tablespoons cold butter, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nSeason roast generously on all sides with salt and black pepper.\nHeat olive oil in a large oven-proof skillet over medium-high heat. Cook roast in hot oil until browned on all sides, 3 to 4 minutes per side. Add shallot, cut-side down, to skillet and place rosemary sprigs on top of roast.\nRoast pork in the preheated oven for 45 minutes. Flip pork, place rosemary sprigs back on top of roast, and break up shallots with a spoon. Continue roasting until slightly pink in the center, about 45 minutes more. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nTransfer roast to a platter to rest for 10 minutes. Drizzle any excess fat in the skillet over the top of roast.\nPlace the same skillet over medium heat. Stir blueberries into skillet and cook and stir until soft, 1 to 2 minutes. Pour port wine into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon.\nStir chicken broth into blueberry mixture, increase heat to medium-high, and cook until liquid is reduced by half, 3 to 4 minutes. Reduce heat to low, stir cold butter into sauce and whisk until completely incorporated. Strain sauce through a fine-mesh sieve into a bowl.\nSlice pork roast against the grain into thin slices and top with blueberry sauce.\n",
        "picture_link": "0Fd7vtRYdMsradgAiERrDzZy5t5BUAy"
    },
    {
        "title": "Antipasto on a Stick",
        "ingredients": [
            "8 slices salami, rolled ADVERTISEMENT",
            "8 (1/2 inch) cubes mozzarella cheese ADVERTISEMENT",
            "8 pitted black olives ADVERTISEMENT",
            "4 grape tomatoes, halved ADVERTISEMENT",
            "4 marinated artichoke hearts, drained and halved ADVERTISEMENT",
            "8 leaves fresh basil, rolled ADVERTISEMENT",
            "8 bamboo toothpicks ADVERTISEMENT",
            "8 teaspoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thread each salami roll, mozzarella cheese, olive, tomato, artichoke heart, and basil roll onto each toothpick, respectively. Arrange toothpicks on a serving platter and drizzle olive oil over each.\n",
        "picture_link": "8JPEQLe7rgWpZ1yLk1VWBxAqXISqUW."
    },
    {
        "title": "Country Gravy Like None Other",
        "ingredients": [
            "2 tablespoons butter, or more as needed ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "1 (12 ounce) package pork sausage, or more to taste ADVERTISEMENT",
            "1 (12 ounce) package spicy pork sausage, or more to taste ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "6 cups 2% milk, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat. Cook and stir onion in hot butter until softened, about 3 minutes. Crumble pork sausage and spicy pork sausage into onion; cook and stir until sausage is browned and cooked through and onions are tender, 7 to 10 minutes.\nStir flour, salt, and black pepper into sausage mixture, adding additional butter if mixture is too dry, and cook until flour begins to brown, about 5 minutes.\nPour milk into sausage mixture, increase heat to high, and bring to a boil, stirring constantly, adding more milk if mixture is too thick. Reduce heat to low, cover the pot with a lid, and simmer, stirring occasionally, until flavors blend, about 20 minutes.\n",
        "picture_link": "RzZ1YQgworILwx4NPANuOZs9KKSAyDO"
    },
    {
        "title": "Salted Caramel Nut Brittle",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 tablespoon light-color corn syrup ADVERTISEMENT",
            "1/3 cup lightly salted roasted cashews, coarsely chopped ADVERTISEMENT",
            "1/3 cup almonds, toasted and coarsely chopped ADVERTISEMENT",
            "1/4 cup roasted and salted pumpkin seeds ADVERTISEMENT",
            "2 tablespoons sesame seeds, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 15x10x1-inch baking pan with Reynolds Wrap(R) Non-Stick Foil; set aside.\nMelt the butter in a 2-quart heavy saucepan over medium heat. Stir in sugar, water and corn syrup. Bring to boiling over medium-high heat, stirring until sugar is dissolved. Avoid splashing side of saucepan. Clip a candy thermometer to side of pan. Cook over medium heat, stirring frequently, until thermometer registers 290 degrees F or a small amount of mixture dropped into very cold water separates into threads that are hard but not brittle. This will take about 18 minutes. Adjust heat as necessary to maintain a steady boil. Watch carefully the last 5 minutes to prevent overcooking. Remove from heat and remove the thermometer.\nPour into the prepared baking pan. Tilt pan to spread mixture evenly. Let stand 2 minutes. In a small bowl combine the cashews, almonds, pumpkin seeds, and sesame seeds. Sprinkle evenly over candy mixture.\nSet baking pan on a wire rack. Cool completely and break into large pieces to serve.\n",
        "picture_link": "eFiArau7ADS4L.Uwads/g9LSQODf8Ui"
    },
    {
        "title": "Southwest Fiesta Dressing",
        "ingredients": [
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/4 cup light sour cream ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon finely chopped cilantro ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon chili powder, or to taste ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir yogurt, sour cream, ketchup, onion, lime juice, cilantro, cumin, chili powder, garlic powder, and salt together in a bowl with a whisk until smooth.\nCover bowl with plastic wrap and refrigerate until chilled, at least 10 minutes.\n",
        "picture_link": "KPBcmnxZhMlpgiBOVvQ3HJ9s.Nui9U6"
    },
    {
        "title": "Italian Sausage Gravy and Biscuits",
        "ingredients": [
            "1 (12 ounce) package ground Italian sausage ADVERTISEMENT",
            "1/2 cup onion, diced ADVERTISEMENT",
            "1 (16 ounce) jar Classico Fresh Four Cheese Alfredo Sauce ADVERTISEMENT",
            "3 fresh sage leaves, finely chopped ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "1 (10 ounce) can refrigerated biscuit dough, baked according to package instructions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook sausage in a large skillet over medium heat until no longer pink, following cooking instructions indicated on the packaging. Add diced onions and continue to cook until onion softens and turns transparent. Drain fat.\nStir in the Alfredo sauce, sage and black pepper. Bring to a simmer, stirring occasionally; reduce heat and simmer for 10 minutes.\nServe over fresh biscuits and top with green onion.\n",
        "picture_link": "a4lPOLwDhfq2F7GYt16uHJz0wm7cBrO"
    },
    {
        "title": "Peanut-Free Chocolate Macaroons",
        "ingredients": [
            "2 1/2 cups rolled oats ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a work surface with waxed paper.\nStir oats, cocoa powder, and coconut together in a large bowl.\nWhisk sugar, milk, and butter together in a nonstick pot; bring to a boil and cook, stirring constantly, until sugar is completely dissolved, about 2 minutes. Remove from heat and stir vanilla extract into butter mixture.\nStir oat mixture into butter mixture until well-combined. Drop mixture by the spoonful onto waxed paper and let sit until set, at least 15 minutes.\n",
        "picture_link": "Sc9/qbXsF5Q4VVy7kTI24P9nXQocOUu"
    },
    {
        "title": "Mayo Parmesan Chicken with Rice",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "4 cloves garlic, pressed ADVERTISEMENT",
            "1 tablespoon finely chopped fresh rosemary ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves, halved horizontally ADVERTISEMENT",
            "1 cup white rice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk mayonnaise, garlic, rosemary, salt, and black pepper together in a bowl. Spread mayonnaise mixture evenly over each piece of chicken.\nSpread rice out into the bottom of a 9x13-inch baking dish. Pour water over rice. Place chicken pieces on top of rice and top with Parmesan cheese.\nBake in the preheated oven until chicken breasts are no longer pink in the center and the juices run clear, 35 to 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "CXXlsd9H.wUYgkXCkyExqDdx6KImpSu"
    },
    {
        "title": "Mom's Chicken and Dumplings (Slow Cooker Version)",
        "ingredients": [
            "4 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "3 (12.5 fl oz) cans chunk chicken (such as Kirkland®), drained and broken into chunks ADVERTISEMENT",
            "4 baking potatoes, peeled and cubed ADVERTISEMENT",
            "4 carrots, sliced ADVERTISEMENT",
            "2 cups chopped broccoli ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons quick-mixing flour (such as Wondra®) ADVERTISEMENT",
            "salt and cracked black pepper to taste ADVERTISEMENT",
            "2 1/4 cups all-purpose baking mix (such as Bisquick®) ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chicken broth, chicken, potatoes, carrots, and broccoli together in a slow cooker.\nWhisk water and quick-mixing flour together in a bowl until a paste-like consistency is reached; stir into slow cooker mixture. Season with salt and pepper.\nCook on Low for 5 hours. Stir baking mix and milk together in a bowl. Drop milk mixture by the teaspoonful into the slow cooker on top of the chicken mixture. Continue cooking, turning the dumplings once, until dumplings are cooked through, about 1 hour more.\n",
        "picture_link": "whsFrL1XPClcEO.fPkQ6RjQkPKLFzE2"
    },
    {
        "title": "Easy Apple Cabbage Slaw",
        "ingredients": [
            "1 small head cabbage, cored and finely chopped ADVERTISEMENT",
            "1 Granny Smith apple, cut into matchstick-size pieces ADVERTISEMENT",
            "5 green onions, thinly sliced ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss cabbage, apple, and onions together in a large bowl.\nWhisk vinegar, sugar, olive oil, vegetable oil, Dijon mustard, and red pepper flakes together in a saucepan over medium heat; bring dressing to a simmer. Pour hot dressing over cabbage mixture and toss to coat. Cover the bowl with plastic wrap and refrigerate until flavors blend and slaw is cold, at least 1 hour.\n",
        "picture_link": "SHxFacVkWvZNnkqIVwlbcbgyeSWWQCe"
    },
    {
        "title": "Blonde Apple Brownies",
        "ingredients": [
            "1 cup salted butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup lightly packed light brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "6 McIntosh apples - peeled, cored, and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish.\nBeat butter, white sugar, brown sugar, and eggs together in a bowl using an electric mixer until smooth and creamy. Beat flour into creamed butter mixture until well combined; add baking powder and beat. Stir cinnamon into batter. Fold apples into batter; spread into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center comes out with moist crumbs, about 45 minutes.\n",
        "picture_link": "8YgjVo2I8Pn3BwXbYzLdwSZ1/ltv8P."
    },
    {
        "title": "Parsley Walnut Pesto Quinoa Salad",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup quinoa ADVERTISEMENT",
            "2 cups broccoli florets ADVERTISEMENT",
            "1 cup fresh parsley ADVERTISEMENT",
            "1/4 cup walnuts ADVERTISEMENT",
            "2 tablespoons olive oil, or more as needed ADVERTISEMENT",
            "1 cup diced tomato ADVERTISEMENT",
            "1 cup diced baby cucumber ADVERTISEMENT",
            "1/4 cup sliced leeks ADVERTISEMENT",
            "1/4 cup crumbled blue cheese, or more to taste ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water is absorbed, 15 to 20 minutes. Cool to room temperature.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add broccoli, cover the saucepan, and steam until broccoli is tender, 2 to 4 minutes. Cool to room temperature.\nPuree parsley, walnuts, and olive oil together in a blender or food processor until sauce is smooth.\nStir quinoa, broccoli, tomato, cucumber, and leeks together in a large bowl. Pour parsley sauce over quinoa mixture and toss to coat completely. Sprinkle blue cheese over the top and season with sea salt.\n",
        "picture_link": "PUNZCR0UaLTNsZ2aPzCNCP8Ey0LjmEq"
    },
    {
        "title": "Blueberry and Peach Crisp",
        "ingredients": [
            "Fruit: ADVERTISEMENT",
            "2 (10 ounce) packages frozen sliced peaches(such as Cascadian Farm®), thawed and drained ADVERTISEMENT",
            "1 (10 ounce) package frozen blueberries(such as Cascadian Farm®), thawed and drained ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/2 cup old-fashioned oats ADVERTISEMENT",
            "1/3 cup firmly packed brown sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup chopped almonds ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon nutmeg ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nGently stir peaches, blueberries, and lemon juice together in an 8-inch square baking dish. Stir 2 tablespoons flour and white sugar into the fruit mixture.\nStir oats, brown sugar, 1/4 cup flour, almonds, cinnamon, and nutmeg together in a small bowl. Mash butter into the oats mixture with a pastry cutter or a fork until the mixture is crumbly; sprinkle over the fruit to cover.\nBake in preheated oven until the fruit is bubbling and the topping is golden brown, about 30 minutes.\n",
        "picture_link": "j.sKLfhm/BhTe6BPaRWMFLQN2Obghf."
    },
    {
        "title": "Gluten-Free Teff Crackers",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup teff flour ADVERTISEMENT",
            "3 tablespoons tapioca flour ADVERTISEMENT",
            "1/4 cup sunflower seed kernels ADVERTISEMENT",
            "1/4 cup pepitas (roasted green pumpkin seeds) ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1 tablespoon flax seeds ADVERTISEMENT",
            "1 tablespoon teff ADVERTISEMENT",
            "1 teaspoon black sesame seeds ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x12-inch baking sheet.\nStir water, teff flour, and tapioca flour together in a bowl until smooth; add sunflower seeds, pepitas, sesame seeds, flax seeds, teff, black sesame seeds, and 1/4 teaspoon salt and stir until mixture is soupy. Pour mixture onto the prepared baking sheet, tapping pan on the counter to evenly distribute mixture in the pan.\nBake in the preheated oven until crackers are crisp, about 40 minutes. Sprinkle salt over warm crackers.\n",
        "picture_link": "Sd0ciIkvtprElNqX1al5C.YDRzU.hru"
    },
    {
        "title": "Loaded Baked Potato Soup",
        "ingredients": [
            "8 large red potatoes ADVERTISEMENT",
            "1 (12 ounce) package bacon ADVERTISEMENT",
            "1/2 gallon milk ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (8 ounce) package processed cheese (such as Velveeta®), cubed ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 teaspoon onion salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Wrap potatoes in aluminum foil.\nBake in the preheated oven until potatoes are tender, 45 minutes to 1 hour. Cool potatoes until easily handled and cut into cubes.\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels and crumble.\nCombine milk, cream, sour cream, processed cheese, and Cheddar cheese in a large pot over medium heat; cook, stirring frequently, until cheeses are melted, about 10 minutes. Add potatoes and bacon to milk mixture and simmer over medium heat, stirring frequently, until potatoes begin to dissolve into soup, about 20 minutes; season with onion salt and black pepper.\n",
        "picture_link": "IIPWpxALpaWmJHh7nNyih4vZVFwQzhC"
    },
    {
        "title": "Spiced Pear & Apple Pie",
        "ingredients": [
            "1 Classic Crisco® Double Pie Crust ADVERTISEMENT",
            "4 cups peeled, thinly sliced pears ADVERTISEMENT",
            "2 cups peeled, thinly sliced apples ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "2 tablespoons Pillsbury BEST® All Purpose Flour ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "Milk ADVERTISEMENT",
            "Cinnamon sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare recipe for double crust pie. Roll out dough for bottom crust. Place in 9-inch pie plate. Press to fit without stretching dough. Trim even with pie plate. Heat oven to 400 degrees F.\nHeat oven to 400 degrees F. Combine pears, apples, sugar, flour, cinnamon, ginger, salt and lemon juice in large bowl. Spoon into prepared pie crust.\nRoll out dough for top crust. Place onto filled pie or cut into strips creating a lattice top. Trim 1/2-inch beyond edge. Fold under bottom crust edge to seal. Crimp and flute edges. Cut slits in top crust or prick with fork to allow steam to escape. Brush crust with milk and sprinkle with cinnamon sugar.\nBake 30 to 40 minutes or until apples are tender and crust is golden brown.\n",
        "picture_link": "sDA.lIMC74R6lRIJvZvCvS4ShnVavpW"
    },
    {
        "title": "Cheesy Avocado Bites",
        "ingredients": [
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1 baguette, cut into 3/4-inch-thick slices ADVERTISEMENT",
            "2 avocados, peeled and pitted ADVERTISEMENT",
            "10 cherry tomatoes, chopped ADVERTISEMENT",
            "1/2 onion, minced (optional) ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread butter onto 1 side of each baguette slice.\nMix avocados, tomatoes, and onion in a bowl until smooth and consistent in texture; scoop onto butter-side of baguette slices. Sprinkle mozzarella cheese over avocado mixture layer. Arrange baguette slices on a baking sheet.\nBake in the preheated oven until cheese is melted, about 7 minutes.\n",
        "picture_link": "xXfuiHT5mN47M42rCZQ6bnNhPCwCInC"
    },
    {
        "title": "Autumn Butternut and Kale Salad with Maple Vinaigrette",
        "ingredients": [
            "4 cups butternut squash - peeled, seeded, quartered, and cut into 1/4-inch thick slices ADVERTISEMENT",
            "1 cup thinly sliced red onion ADVERTISEMENT",
            "1 cup pure maple syrup ADVERTISEMENT",
            "1 teaspoon Mazola® Corn Oil ADVERTISEMENT",
            "1/2 teaspoon Spice Islands® Thyme ADVERTISEMENT",
            "1/4 teaspoon Spice Islands® Fine Grind Black Pepper ADVERTISEMENT",
            "4 cups thinly sliced kale ADVERTISEMENT",
            "1 1/2 tablespoons grated Parmesan or Romano cheese ADVERTISEMENT",
            "1 1/2 tablespoons chopped toasted pecans ADVERTISEMENT",
            "Maple Dijon Vinaigrette: ADVERTISEMENT",
            "1 tablespoon pure maple syrup ADVERTISEMENT",
            "1 1/2 teaspoons Mazola® Corn Oil ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "1/8 teaspoon Spice Islands® Sea Salt ADVERTISEMENT",
            "1/4 teaspoon Spice Islands® Fine Grind Black Pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 450 degrees F. Toss squash, onion, maple syrup, oil, thyme and black pepper in a large bowl. Place evenly on large rimmed baking sheet lined with parchment paper; roast 30 minutes or until squash is tender and edges are starting to brown.\nPlace kale in the same large bowl. Toss with hot, cooked squash and onions and set aside. Whisk vinaigrette ingredients together. Drizzle over salad and toss to combine. Sprinkle with cheese and pecans; serve immediately.\n",
        "picture_link": "ObduUWnzt3d4Mj50DV0OmXdUUnL2gd."
    },
    {
        "title": "Golden Apple Raisin Squares",
        "ingredients": [
            "1 (3.9 ounce) container Mott's® Healthy Harvest Blueberry Delight Applesauce ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "2 large eggs, beaten ADVERTISEMENT",
            "3/4 cup granulated sugar ADVERTISEMENT",
            "1/3 cup canola oil ADVERTISEMENT",
            "1 Golden Delicious apple, peeled and cut into 1/4-inch dice ADVERTISEMENT",
            "1/3 cup golden raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F. Lightly oil or coat an 8x8-inch baking dish with nonstick cooking spray and set aside. Whisk together the all-purpose flour, whole wheat flour, baking powder, baking soda, cinnamon, salt, and cloves in a large bowl.\nCombine the eggs, applesauce, sugar, oil, and apple in a separate bowl, and whisk until well blended. Pour the liquid ingredients over the dry ingredients and stir until just moistened. Stir in the raisins. Pour the batter into the prepared baking dish. Smooth with a rubber scraper.\nBake 30 to 35 minutes, or until the top is golden and a toothpick inserted in the center comes out clean.\n",
        "picture_link": "n78yzAXjhVwxORcXx0CSv5rsLE27d2K"
    },
    {
        "title": "Instant Mango Frozen Yogurt",
        "ingredients": [
            "4 1/2 cups diced frozen mango, not thawed ADVERTISEMENT",
            "1 1/2 cups nonfat plain Greek yogurt ADVERTISEMENT",
            "1/3 cup confectioners' sugar or brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mango, yogurt and sugar in a food processor. Process until smooth.\n",
        "picture_link": "r0wsrKSpvT32vpepa5Jp0LlzNtZb0Ci"
    },
    {
        "title": "Swiss Cheese and Bacon Scalloped Potatoes",
        "ingredients": [
            "1 onion, finely chopped ADVERTISEMENT",
            "1 1/2 cups shredded Swiss cheese ADVERTISEMENT",
            "6 slices diced cooked bacon ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 pounds potatoes, peeled and thinly sliced ADVERTISEMENT",
            "2 cups half-and-half, warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter an 8-cup casserole dish.\nCombine onion, Swiss cheese, bacon, flour, salt, and pepper in a bowl.\nSpread 1/3 of the potatoes into the bottom of the prepared casserole dish and top with 1/3 of the cheese mixture. Repeat layering twice, ending with cheese mixture. Pour heated half-and-half over top layer. Cover dish with aluminum foil.\nBake in the preheated oven for 45 minutes. Remove foil and continue baking until potatoes are tender, 25 to 30 minutes.\n",
        "picture_link": "nj/0ewi23z4xYLrUFp9Bq352UtxzqD."
    },
    {
        "title": "Baked Pasta Primavera",
        "ingredients": [
            "8 ounces dried fettuccine or linguine pasta ADVERTISEMENT",
            "1 cup shredded carrots* ADVERTISEMENT",
            "1 cup fresh or frozen peas ADVERTISEMENT",
            "1 cup sliced yellow squash ADVERTISEMENT",
            "1 cup fresh asparagus spears, cut into 1-inch pieces ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup lowfat milk ADVERTISEMENT",
            "1/2 cup reduced-sodium chicken broth ADVERTISEMENT",
            "4 ounces herbed goat cheese ADVERTISEMENT",
            "1/2 cup cherry tomatoes, halved ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "1 tablespoon snipped fresh basil ADVERTISEMENT",
            "1 tablespoon snipped fresh oregano ADVERTISEMENT",
            "1/4 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F. Line a 2-quart rectangular baking dish with Reynolds Wrap(R) Pan Lining Paper, parchment side up. No need to grease dish.\nCook the pasta according to package directions in a Dutch oven, adding the carrots, peas, squash, and/or asparagus for the last 3 minutes of cooking time. Drain, reserving 1/4 cup of the pasta water. Return the pasta mixture to the Dutch oven. Cover and set aside.\nMelt butter in a medium saucepan; whisk in flour and salt. Whisk in the milk, chicken broth, and goat cheese. Cook and stir over medium heat until thickened and bubbly. Cook and stir 1 minute more. Stir in the reserved pasta water, tomatoes, 1/4 cup of the Parmesan cheese, basil, and oregano.\nPour milk mixture over the pasta mixture, tossing to coat. Spoon pasta mixture into prepared baking dish. Sprinkle with the almonds and remaining 1/4 cup Parmesan cheese.\nBake 15 to 20 minutes or until the mixture just starts to turn golden and the sauce is bubbly.\n",
        "picture_link": "CMm3DLDc1YQwHXAVf6htlhhQh5EfdLC"
    },
    {
        "title": "Peanut Butter Cheesecake Cups",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 1/4 cups chocolate cookie crumbs ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "Cheesecake: ADVERTISEMENT",
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "Ganache: ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 1/2 cups shaved dark chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line 10 muffin cups with paper liners.\nStir cookie crumbs and butter together in a bowl; press into the prepared muffin cups. Refrigerate chocolate crusts until chilled, about 15 minutes.\nBeat peanut butter, cream cheese, and confectioners' sugar together in a bowl until smooth. Spoon peanut mixture over the chocolate crusts; refrigerate until chilled, about 30 minutes.\nPour cream into a microwave-safe bowl and heat in microwave until just before boiling, about 2 minutes. Stir chocolate into cream to melt. Refrigerate ganache until completely chilled, about 1 hour.\nBeat ganache using an electric mixer until whipped; spread evenly over peanut butter mixture layer.\nFreeze cheesecakes until solid, about 1 hour.\n",
        "picture_link": ".jO63Vync1bfrH.eKjFyYqa/3PnNF0K"
    },
    {
        "title": "Yeah, I-Lived-in-Texas, Smoked Brisket",
        "ingredients": [
            "wood chips ADVERTISEMENT",
            "1/4 cup paprika ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup ground cumin ADVERTISEMENT",
            "1/4 cup cayenne pepper ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup chili powder ADVERTISEMENT",
            "1/4 cup garlic powder ADVERTISEMENT",
            "1/4 cup onion powder ADVERTISEMENT",
            "1/4 cup kosher salt ADVERTISEMENT",
            "1/4 cup freshly cracked black pepper ADVERTISEMENT",
            "10 pounds beef brisket, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak wood chips in a bowl of water, 8 hours to overnight.\nMix paprika, white sugar, cumin, cayenne pepper, brown sugar, chili powder, garlic powder, onion powder, salt, and black pepper together in a bowl. Rub the spice mixture over the entire brisket; refrigerate for 24 hours.\nPreheat smoker to between 220 degrees F (104 degrees C) and 230 degrees F (110 degrees C). Drain wood chips and place in the smoker.\nSmoke brisket in the preheated smoker until it has an internal temperature of 165 degrees F (74 degrees C), about 12 1/2 hours. Wrap brisket tightly in butcher paper or heavy-duty aluminum foil and return to smoker.\nContinue smoking brisket until an internal temperature of 185 degrees F (85 degrees C) is reached, about 1 hour more.\n",
        "picture_link": "PfPWUGU4BQ2wnTGw5UzuXlYlfHqvrXO"
    },
    {
        "title": "Shrimp Veracruzana",
        "ingredients": [
            "2 teaspoons canola oil ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 medium onion, halved and thinly sliced ADVERTISEMENT",
            "2 jalapeno peppers, seeded and very thinly sliced, or to taste ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 pound peeled and deveined raw shrimp (16-20 per pound; see Shopping Tip) ADVERTISEMENT",
            "3 medium tomatoes, diced ADVERTISEMENT",
            "1/4 cup thinly sliced pitted green olives ADVERTISEMENT",
            "1 lime, cut into 4 wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large nonstick skillet over medium heat. Add bay leaf and cook for 1 minute. Add onion, jalapenos and garlic and cook, stirring, until softened, about 3 minutes. Stir in shrimp, cover and cook until pink and just cooked through, 3 to 4 minutes. Stir in tomatoes and olives. Bring to a simmer, reduce heat to medium-low, replace cover and cook until the tomatoes are almost broken down, 2 to 3 minutes more. Remove the bay leaf. Serve with lime wedges.\n",
        "picture_link": "L4.7Gj.7aBF6oGrpblUP0JuPnZE/i0O"
    },
    {
        "title": "Honey Cornbread Muffins",
        "ingredients": [
            "1 cup Martha White® Plain Enriched Yellow Corn Meal ADVERTISEMENT",
            "1 cup Pillsbury BEST® All Purpose Flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/3 cup Crisco® Pure Corn Oil ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F. Line 12 muffin cups with paper baking cups.\nCombine corn meal, flour, baking powder and cinnamon in large bowl. Whisk egg, milk, honey, oil and sour cream in small bowl. Add to corn meal mixture, stirring just until moistened. Spoon evenly into prepared muffin cups.\nBake 18 to 20 minutes or until lightly browned. Cool 2 minutes. Remove to wire rack to cool completely.\n",
        "picture_link": "nGjyypXt68iBVlXzuzmDpePaU49dLnW"
    },
    {
        "title": "Garlic Lentils with Kale",
        "ingredients": [
            "1 cup olive oil ADVERTISEMENT",
            "1 large red onion ADVERTISEMENT",
            "1 (8 ounce) package dry lentils, rinsed and sorted ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 bunch kale, or to taste, chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a pot over medium heat. Cook red onion in hot oil until browned, 7 to 10 minutes.\nPour lentils into the pot with onion; add enough water to cover the lentils by 2 to 3 inches. Bring the water to a boil and reduce heat to medium-low.\nStir tomato paste, garlic, brown sugar, and paprika into the lentil mixture to integrate the paste smoothly into the liquid; bring to a simmer and cook until the lentils are tender, about 1 hour.\nStir kale into the lentils, reduce heat to low, and cook until the kale is tender, 10 to 15 minutes; season with salt and freshly ground black pepper.\n",
        "picture_link": "9K5BcMXag/YyA64hxpWO3aERh715U7a"
    },
    {
        "title": "Sausage and Shrimp Gumbo",
        "ingredients": [
            "1 (14 ounce) package Hillshire Farm® Smoked Sausage ADVERTISEMENT",
            "1/4 cup cooking oil ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, seeded, chopped ADVERTISEMENT",
            "1 red bell pepper, seeded, chopped ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup frozen sliced okra ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 teaspoons Cajun seasoning ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "1/2 pound large raw shrimp, peeled, deveined ADVERTISEMENT",
            "3 cups hot cooked long-grain white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut sausage into 1/2-inch slices; set aside.\nCombine flour and oil in a 4 quart heavy saucepan; mixing until smooth. Cook and stir over medium-high heat 3 minutes. Reduce heat to medium; cook and stir 6-8 minutes or until roux is a dark reddish brown.\nStir in onion, bell peppers, celery, okra and garlic; cook and stir 8-10 minutes or until vegetables are tender. Stir in Cajun seasoning.\nStir in chicken broth; bring to a boil. Cook and stir for 1 minute. Reduce heat to low; stir in sausage, pepper sauce, black pepper and salt to taste. Simmer, covered 15 minutes. Remove cover.\nBring to a boil; add shrimp and cook 3 minutes or until shrimp turn pink.\nLadle gumbo into bowls with rice.\n",
        "picture_link": "1uvnwt/H/dWnM1lFCYxLo2UFC2rvsue"
    },
    {
        "title": "Vanilla Cream or Sauce",
        "ingredients": [
            "2 1/2 cups whole milk, divided ADVERTISEMENT",
            "1 tablespoon cornstarch, or more as desired ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 cups milk in a heavy saucepan over low heat until simmering, about 5 minutes.\nBeat remaining 1/2 cup milk and cornstarch together in a bowl using a whisk until dissolved; add sugar and egg yolks and beat until smooth. Slowly pour milk mixture into simmering milk while gently whisking the simmering milk; simmer, stirring frequently, until thickened, about 3 minutes. Remove saucepan from heat and stir vanilla extract into sauce.\nPour the sauce through a wire mesh sieve into a bowl to remove any cornstarch lumps. Place a piece of plastic wrap on top of the sauce, ensuring the plastic wrap is touching the sauce to prevent a skin from forming; cool to room temperature, about 20 minutes.\nMove sauce to refrigerator and chill completely cold, at least 30 minutes.\n",
        "picture_link": "5c7jCxOSHA1va/FgNHlK01dGhLfUaZS"
    },
    {
        "title": "Quick Spanish Rice",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "2 teaspoons beef bouillon granules ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups cooked white rice (such as Uncle Ben's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a frying pan over medium heat; cook and stir onion, green bell pepper, celery, and garlic until slightly tender, 5 to 10 minutes. Stir tomatoes with juice, chili powder, beef bouillon granules, and salt into onion mixture; add rice. Simmer rice mixture, stirring occasionally, until heated through and flavors are blended, 15 to 20 minutes.\n",
        "picture_link": "MxbPGi.GOZDlYEpgKB1t7en93Qz2lly"
    },
    {
        "title": "Bowl of Oatmeal Cookie",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "2/3 cup quick-cooking oats ADVERTISEMENT",
            "2 tablespoons raisins, or to taste (optional) ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon butter, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg in a microwave-safe bowl; add 1 cup plus 3 tablespoons milk, oats, raisins, brown sugar, vanilla extract, butter, cinnamon, and salt and mix well.\nMicrowave on high for 1 minute; stir and microwave for 1 minute more. Stir oatmeal and microwave until cooked, about 1 minute more.\n",
        "picture_link": "oEC7dJr0Wl2BuIdcwP2Z4jXncElLHbu"
    },
    {
        "title": "Date-Marshmallow Waldorf Salad",
        "ingredients": [
            "2 cups peeled, diced tart apples ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped pitted dates ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/4 cup miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the apples in a medium serving bowl and sprinkle with sugar, lemon juice and salt. Stir in the celery, dates and walnuts. In a separate bowl, whip the cream with an electric mixer until it can hold a peak. Mix in mayonnaise and gently fold into the apple mixture along with the marshmallows. Refrigerate for at least 1 hour before serving.\n",
        "picture_link": "B3UNeKVGNqfALxDrKVl2uvagHBqi5nm"
    },
    {
        "title": "Fruit Galore Sponge Cake",
        "ingredients": [
            "1/3 cup vanilla flavored syrup ADVERTISEMENT",
            "1 sponge cake ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "1 cup sliced strawberries ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drizzle vanilla syrup over top of sponge cake. Let soak for 5 to 10 minutes.\nArrange blueberries on top of cake, then place strawberries on top of the blueberries. Finish by generously spreading whipped topping over the fruit.\nServe immediately, or if you prefer, chill in the refrigerator (no more than 2 to 3 hours), until ready to eat.\n",
        "picture_link": "R75jDupSxT2sNKpJNIT5wkfhVSZA9kq"
    },
    {
        "title": "Pasteles De Coco (Coconut Pastries)",
        "ingredients": [
            "1 (17.25 ounce) package frozen puff pastry (2 sheets), thawed ADVERTISEMENT",
            "1 (15.5 ounce) can canned grated coconut in syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Cover a baking sheet with parchment paper.\nRoll out each sheet of pastry dough slightly, just to thin it. Cut each sheet into 12 squares, and place half the squares on the prepared baking sheet, leaving at least half an inch between each square.\nPlace a spoonful of coconut in the center of each pastry square, then top with a second pastry square. Pinch the dough on two sides to seal in the coconut filling.\nBake pastries in preheated oven until golden brown, 10 to 20 minutes. Cool on a rack.\n",
        "picture_link": "WinY3EVXbc8JV1ymSfGdSLtpTZE4PPu"
    },
    {
        "title": "Mashed Turnips with Caraway",
        "ingredients": [
            "2 pounds turnips, peeled and cubed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 teaspoons caraway seeds ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the turnips in a pot and cover with water; bring to a boil over high heat and cook until turnips turn yellowish orange and are soft, 10 to 12 minutes. Drain water, leaving turnips in the pot.\nStir the butter and caraway seeds into the turnips. Season to taste with salt and pepper. Use a potato masher to mash turnips to desired consistency. Stir in the cream and mash again, blending well.\n",
        "picture_link": "4qDixZH1XT1tSFKjLq5/36NKWk3AFJ2"
    },
    {
        "title": "Kentucky Burgoo",
        "ingredients": [
            "5 pounds bone-in mutton shoulder or leg, cut into 1 pound pieces ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "3 pounds baking potatoes, peeled and cubed ADVERTISEMENT",
            "1 pound carrots, peeled and sliced ADVERTISEMENT",
            "2 (15 ounce) cans crushed tomatoes ADVERTISEMENT",
            "2 teaspoons extra-virgin olive oil or canola oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cups medium salsa ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup hickory smoke flavored barbeque sauce ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (14.5 ounce) can green beans, drained ADVERTISEMENT",
            "1 (16 ounce) package frozen lima beans, thawed ADVERTISEMENT",
            "1 (10 ounce) package frozen okra ADVERTISEMENT",
            "1 (46 fluid ounce) can tomato juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Day one: In a large heavy stockpot, add meat and cover with water. Add 1 teaspoon salt, Italian seasoning, and enough water to completely cover meat. Simmer over medium heat for 1 hour.\nPreheat oven to 375 degrees F (190 degrees C). Remove meat from stock; refrigerate stock for later use. Debone meat, discard bones, and place meat in a roasting pan. Roast meat for 1 1/2 hours in the preheated oven or until tender when pierced with a fork. Cover pan with aluminum foil and refrigerate.\nDay two: Remove stock from refrigerator; skim off and discard top layer of hardened white fat. Pour 4 cups of stock into a heavy stockpot; add potatoes, carrots, 1 can of crushed tomatoes, and 1 teaspoon salt. Cook vegetable mixture over medium-high heat for 20 minutes, stirring occasionally. Cool slightly and refrigerate.\nPreheat oven to 300 degrees F (150 degrees C). Heat olive oil in a small skillet over medium heat. Add the onion. Cook and stir until onion is transparent, 5 to 8 minutes. Set aside. Remove meat from refrigerator and add remaining stock to pan. Cover the roasting pan with a lid or aluminum foil.\nCook meat for 1 1/2 hours in the preheated oven. Remove the meat from the oven and pour in the salsa, onion, tomato sauce, brown sugar, barbecue sauce, and 1 can crushed tomatoes. Continue roasting for another 1 1/2 hours. Cool slightly and refrigerate overnight.\nDay three: In a large Dutch oven portable roaster or large stock pot, combine meat with the vegetable mixture from the day before, corn, green beans, lima beans, okra, and tomato juice. Cook for 3 hours at 300 degrees F (150 degrees C) if using a roaster, or if using a stock pot, simmer over medium-low heat, stirring occasionally.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grilled Maple Turkey Sandwich",
        "ingredients": [
            "3 strips bacon ADVERTISEMENT",
            "4 ounces sliced deli-style maple turkey ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "2 slices raisin black bread ADVERTISEMENT",
            "4 slices Swiss cheese ADVERTISEMENT",
            "2 tablespoons honey mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon into a skillet over medium heat, and cook until crisp. Remove, and drain on paper towels. Drain bacon grease from skillet. Add maple turkey to the skillet, and cook briefly, just long enough to heat through.\nButter both sides of the bread. Layer one slice with two slices of the Swiss cheese, then layer with the maple turkey, and the bacon. Drizzle with honey mustard, and top with remaining two slices of Swiss cheese. Top with remaining bread slice, and cut sandwich in half. Return sandwich halves to the skillet, and cook over medium heat, turning once, until cheese begins to melt, 4 to 5 minutes.\n",
        "picture_link": "uVd1jYv2feckYfmFKew9i0VYDswg.CW"
    },
    {
        "title": "Swedish Meatball Casserole",
        "ingredients": [
            "3 cups hot water ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (5.6 ounce) box beef pasta skillet meal (such as Hamburger Helper®) ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 teaspoons seasoned salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nPour the hot water into a 3 quart casserole dish. Stir the softened cream cheese into the water. Mix in the sauce mix from the packaged dinner and the nutmeg. Add the uncooked noodles and stir until well combined. Cover and bake in a preheated oven for 30 minutes.\nIn a large bowl, combine ground beef, bread crumbs, egg, Worcestershire sauce, seasoned salt, and garlic powder. Mix well and form into golf ball sized meatballs. Place a cooling rack onto a cookie sheet and arrange the meatballs on the rack. Bake in the preheated oven until no longer pink in the center, about 15 minutes.\nStir the cooked meatballs into the noodles and return the casserole to the oven. Cook uncovered for 5 to 10 minutes.\n",
        "picture_link": "xZMbJAiGvJs/nytDcqjtg1kXQEFyIFC"
    },
    {
        "title": "Ben's Bearnaise Sauce",
        "ingredients": [
            "1/2 cup dry white wine ADVERTISEMENT",
            "2 tablespoons tarragon vinegar ADVERTISEMENT",
            "2 tablespoons shallots, minced ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "4 sprigs fresh tarragon, chopped ADVERTISEMENT",
            "2 sprigs fresh chervil, minced ADVERTISEMENT",
            "2 sprigs fresh parsley, minced ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 cup hot melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the wine, vinegar, shallots, white pepper, tarragon, chervil, and parsley in a small saucepan. Boil over medium-high heat until the liquid is reduced to about 2 tablespoons. Strain vinegar reduction into a large bowl; set aside.\nBring several inches of water to a boil in a saucepan over high heat, then reduce heat to low or medium-low to maintain the water at a bare simmer. Whisk the egg yolks into the vinegar reduction, then place the bowl over the simmering water. Whisk constantly until the yolks have thickened and turned a pale lemon yellow color. The mixture will form ribbons when the whisk is lifted from the bowl. Once the yolk has reached this point, remove the bowl from the simmering water.\nSlowly pour the hot butter into the egg yolk mixture while continuing to whisk vigorously. Do not stop whisking until all of the butter is fully incorporated or the sauce will separate. Once finished, the mixture will have become a thick and creamy sauce. Serve immediately.\n",
        "picture_link": "0bvI0ZutqXulxF0U8PVd2s6EF8X250a"
    },
    {
        "title": "Orange Sunrise Smoothie",
        "ingredients": [
            "1/2 cup orange juice ADVERTISEMENT",
            "1 banana, frozen and chunked ADVERTISEMENT",
            "1 peach, peeled and sliced ADVERTISEMENT",
            "1/2 cup honeydew melon, cubed ADVERTISEMENT",
            "1 (8 ounce) container orange yogurt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the orange juice, banana, peach, honeydew melon, yogurt, sugar, and ice in a blender. Blend until smooth, or chunky, as desired. Pour into two glasses and serve.\n",
        "picture_link": "bQ7XoQANtMKpO80a4I9nB/OL.kUI1Ky"
    },
    {
        "title": "J-Lo's Asian Mojito",
        "ingredients": [
            "5 fresh mint leaves ADVERTISEMENT",
            "3 lime wedges ADVERTISEMENT",
            "1 fluid ounce sour apple schnapps ADVERTISEMENT",
            "1 1/2 fluid ounces limon flavored rum ADVERTISEMENT",
            "1/2 fluid ounce pineapple juice ADVERTISEMENT",
            "6 cubes ice ADVERTISEMENT",
            "1 fluid ounce club soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Muddle (crush) together the mint leaves, lime wedges and sour apple schnapps in a glass using the handle of a wooden spoon. Add lemon rum and pineapple juice; shake well and pour over ice. Top with club soda.\n",
        "picture_link": "sdQFzMGum/7lAavARypMTVSYnQtopOO"
    },
    {
        "title": "Best Teriyaki Sauce",
        "ingredients": [
            "1 cup soy sauce ADVERTISEMENT",
            "1 cup ruby red grapefruit juice ADVERTISEMENT",
            "1/3 cup hoisin sauce ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "3 tablespoons rice wine vinegar ADVERTISEMENT",
            "1/4 cup brown sugar, packed ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "1 habanero pepper, halved and seeded ADVERTISEMENT",
            "4 cloves garlic, smashed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine soy sauce, grapefruit juice, hoisin sauce, ketchup, rice wine vinegar, brown sugar, ginger, habanero pepper, and garlic in a saucepan over medium high heat. Bring to a boil, then reduce heat to medium-low, and simmer 10 minutes, or until thick, stirring occasionally. Strain sauce to remove pepper and garlic. Refrigerate in a covered container until ready to use.\n",
        "picture_link": "U3TFDcsvY9U33W2DpeiREwUjWqHiJKa"
    },
    {
        "title": "Turkey and Tomato Panini",
        "ingredients": [
            "3 tablespoons reduced-fat mayonnaise ADVERTISEMENT",
            "2 tablespoons nonfat plain yogurt ADVERTISEMENT",
            "2 tablespoons shredded Parmesan cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "Freshly ground pepper to taste ADVERTISEMENT",
            "8 slices whole-wheat bread ADVERTISEMENT",
            "8 ounces thinly sliced reduced-sodium deli turkey ADVERTISEMENT",
            "8 tomato slices ADVERTISEMENT",
            "2 teaspoons canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Have four 15-ounce cans and a medium skillet (not nonstick) ready by the stove.\nCombine mayonnaise, yogurt, Parmesan, basil, lemon juice and pepper in a small bowl. Spread about 2 teaspoons of the mixture on each slice of bread. Divide turkey and tomato slices among 4 slices of bread; top with the remaining bread.\nHeat 1 teaspoon canola oil in a large nonstick skillet over medium heat. Place 2 panini in the pan. Place the medium skillet on top of the panini, then weigh it down with the cans. Cook the panini until golden on one side, about 2 minutes. Reduce the heat to medium-low, flip the panini, replace the top skillet and cans, and cook until the second side is golden, 1 to 3 minutes more. Repeat with another 1 teaspoon oil and the remaining panini.\n",
        "picture_link": "dWuYPD1lCZlDXZFx4F6hby62Tzi7LYW"
    },
    {
        "title": "Cindy's Tuna, Spinach, and Bacon Quiche",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup blue cheese salad dressing ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1/4 cup thawed frozen chopped spinach ADVERTISEMENT",
            "1 (12 ounce) can solid white tuna packed in water, drained ADVERTISEMENT",
            "3 slices bacon strips, cooked and chopped ADVERTISEMENT",
            "6 ounces Swiss cheese, shredded ADVERTISEMENT",
            "1 (9 inch) unbaked pie shell ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk together eggs, milk, blue cheese dressing, and cornstarch in a bowl until smooth. Fold in spinach, tuna, bacon, and Swiss cheese until evenly mixed. Pour into pie shell.\nBake in preheated oven until a knife inserted into the center comes out clean, 30 to 35 minutes.\n",
        "picture_link": "NBra8e4fghEjRYZaPdXBecvLA08BQfi"
    },
    {
        "title": "Almondy Warmth Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons ground nutmeg ADVERTISEMENT",
            "1/2 cup packed light brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup butter-flavored spread ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 teaspoons almond extract ADVERTISEMENT",
            "1 tablespoon amaretto liqueur ADVERTISEMENT",
            "1 1/2 teaspoons bourbon ADVERTISEMENT",
            "1/2 cup chopped almonds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a cookie sheet. Sift together flour, baking powder, baking soda, salt, cinnamon, and nutmeg in a medium bowl. Set aside.\nCream together brown sugar, white sugar, and vegetable oil spread in a medium bowl. Stir in sour cream, olive oil, almond extract, amaretto and bourbon, blending well after each addition.\nGradually stir flour mixture into sugar mixture until well blended. Stir in almonds if desired. Drop by rounded spoonfuls onto prepared cookie sheet.\nBake until just crisp around the edges, 12 to 14 minutes.\n",
        "picture_link": "kz9rlK4fiGfLq1wBnmjqyhNBLsAl252"
    },
    {
        "title": "Beach Body Fruit Soup",
        "ingredients": [
            "1 fresh peach, pitted and chopped ADVERTISEMENT",
            "6 fresh strawberries, hulled ADVERTISEMENT",
            "1 apple, cored and chopped ADVERTISEMENT",
            "1/2 cantaloupe - peeled, seeded, and cubed ADVERTISEMENT",
            "1/2 honeydew melon - peeled, seeded, and cubed ADVERTISEMENT",
            "1/4 cup cream of coconut ADVERTISEMENT",
            "1 teaspoon fresh ground nutmeg ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "1 pint fresh blueberries, rinsed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the peach, strawberries, apple, cantaloupe, and honeydew in a blender; blend until only slightly chunky, 20 to 30 seconds. Pour in the cream of coconut, nutmeg, honey, and lime juice; blend until smooth.\nDivide the mixture evenly between 8 bowls. Top each bowl with a few blueberries and serve cold.\n",
        "picture_link": "pCHvwfVIbqe7/.ZKNO.Ht51lJMSJr3u"
    },
    {
        "title": "Mojo de Ajo",
        "ingredients": [
            "6 dried chipotle chili pepper ADVERTISEMENT",
            "1 cup extra-virgin olive oil ADVERTISEMENT",
            "1 1/2 cups chopped garlic ADVERTISEMENT",
            "5 tablespoons fresh lime juice ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chipotles in a bowl and cover with very hot water. Allow to soak for 3 minutes; drain. Remove the stems and seeds from the peppers and discard. Cut the peppers into thin strips.\nHeat the oil in a large skillet over low heat. Cook the garlic in the oil until golden brown, 4 to 5 minutes. Stir in the peppers and the lime juice; simmer 5 minutes; season with the salt. Transfer the mixture to a bowl and allow to cool. Store in the refrigerator in an airtight container.\n",
        "picture_link": "in4TxcRX3U2Kcve9ztry34VBFQ1D9Ve"
    },
    {
        "title": "Pampered Pooch Rice and Lamb Casserole",
        "ingredients": [
            "1 1/2 cups converted long-grain white rice ADVERTISEMENT",
            "2 teaspoons safflower oil ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/4 teaspoon ground thyme ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 cup grated Monterey Jack cheese ADVERTISEMENT",
            "2 cubes beef bouillon ADVERTISEMENT",
            "1 pound lean ground lamb ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine rice and safflower oil in a saucepan over medium heat; stir and cook 2 minutes. Add the water, thyme, garlic powder, and bouillon. Cover, and cook 15 minutes more over medium heat, or until liquid is absorbed.\nMeanwhile, cook the ground lamb in a large skillet over medium heat until browned, about 10 minutes. Drain, then stir into the rice along with the Monterey Jack cheese until the cheese melts. Cool completely before serving.\n",
        "picture_link": "JxxQzpVEjMivO7jz4KsoY.DqLI9pgd."
    }
]