[
    {
        "title": "Awesome Red Wine Pot Roast",
        "ingredients": [
            "3 pounds boneless beef chuck roast ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried marjoram ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "6 red potatoes, washed and halved ADVERTISEMENT",
            "6 carrot, peeled and cut into 2-inch lengths ADVERTISEMENT",
            "8 pearl onions, peeled and halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nSprinkle the roast evenly with the flour and set aside. Heat the canola oil in an oven-proof Dutch oven with lid over medium-high heat. Brown the roast on all sides, about 10 minutes total; remove from the heat. Pour in the water and wine. Sprinkle with the basil, marjoram, thyme, salt, and pepper. Arrange the onion slices on the roast.\nReplace the cover and bake in the preheated oven for 3 hours. Add the potatoes, carrots, and pearl onions. Pour in additional water if the roast looks dry. Continue baking covered until the roast pulls apart easily with a fork, about 1 hour longer.\n",
        "picture_link": "A5K1F95N79fD9RfhHvWsrjyrCuyLu9a"
    },
    {
        "title": "Beef Enchiladas I",
        "ingredients": [
            "1 cup chopped onion ADVERTISEMENT",
            "1 pound sirloin steak, cut into bite size strips ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "2 (7 ounce) cans diced green chile peppers ADVERTISEMENT",
            "4 cups tomato sauce, divided ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 (12 ounce) package corn tortillas ADVERTISEMENT",
            "1/2 cup fresh salsa ADVERTISEMENT",
            "3/4 cup chopped black olives, drained ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/3 cup chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large casserole dish.\nIn a skillet over medium heat, saute onions until almost translucent. Stir in beef, garlic, and chile peppers, and continue cooking until the meat is no longer pink. Pour in the tomato sauce and chili powder. Mix thoroughly and heat through. Remove from heat.\nSpoon a little of the meat mixture into a corn tortilla and add small amounts of salsa, Cheddar cheese and olives. Fold the tortilla up and place in the prepared casserole dish. Repeat for the remaining tortillas using up all of the meat mixture. Reserve 1/2 cup of Cheddar cheese for topping.\nPour the other half of the tomato sauce and sour cream over all of the tortillas. Top with green onions and 1/2 cup of reserved Cheddar cheese.\nBake 30 minutes in the preheated oven, or until hot and bubbly.\n",
        "picture_link": "qr3VVyWwiaKXVA67pE5qjz0homZYrFW"
    },
    {
        "title": "Sour Cream and Chive Mashed Potatoes",
        "ingredients": [
            "2 pounds Yukon Gold potatoes, peeled and quartered ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot with enough water to come up 2 inches from the bottom. Bring to a boil, and cook for 20 to 25 minutes, until fork tender. Drain, and mash. Mix in the milk using a potato masher or an electric mixer until fluffy. Stir in the sour cream and chives, and season with salt and pepper.\n",
        "picture_link": "244o/2ujqXxfrzeNeZVbIaV9szlM0ga"
    },
    {
        "title": "Twice Baked Potato Casserole With Bacon",
        "ingredients": [
            "2 large baking potatoes ADVERTISEMENT",
            "1/2 pound lean bacon ADVERTISEMENT",
            "3/4 cup shredded mild Cheddar cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons unsalted butter, melted ADVERTISEMENT",
            "1 teaspoon dried chives ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "3/4 cup shredded mild Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch casserole dish.\nPoke a few holes into each potato using a toothpick.\nBake potatoes in the preheated oven until fully cooked, about 1 hour. Cool for about 15 minutes.\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels and crumble.\nCut a thin slice from one side of each potato; carefully scoop out the flesh and transfer to a bowl. Discard skins. Mix 3/4 cup Cheddar cheese, sour cream, milk, butter, chives, salt, black pepper, and garlic powder with potatoes. Spread potato mixture into the prepared casserole dish; top with 3/4 cup Cheddar cheese and crumbled bacon.\nBake in the preheated oven until just bubbling, 10 to 15 minutes. Cool for at least 5 minutes before serving.\n",
        "picture_link": "3uIky4yxCgFSCCz69l57Cb/XsWs/oUy"
    },
    {
        "title": "Sweet Polish Sausage",
        "ingredients": [
            "2 pounds kielbasa sausage, cut into 1 inch pieces ADVERTISEMENT",
            "1/3 cup Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 dashes hot pepper sauce ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sausage in a large saucepan. Add water to cover and simmer over low heat for 1 hour. Drain, remove sausage and set aside.\nPreheat oven to 350 degrees F (175 degrees C).\nIn the same saucepan combine the Worcestershire sauce, lemon juice, onion, sugar, hot pepper sauce and water. Bring all to a boil, stirring. Place reserved sausage in a 9x13-inch baking dish and cover it with the sauce mixture.\nBake at 350 degrees F (175 degrees C) for 1 hour.\n",
        "picture_link": "k7Gt1SRSicnEAbh7tw/jUObCEsX2QJm"
    },
    {
        "title": "Broccoli and Cheese Brunch Casserole",
        "ingredients": [
            "8 ounces pork sausage ADVERTISEMENT",
            "1 (10 ounce) package chopped frozen broccoli, thawed and drained ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "8 eggs, lightly beaten ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 roma (plum) tomato, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a 7x11 inch baking dish.\nIn a bowl, mix cooked sausage, broccoli, and 1/2 cup Cheddar cheese. In a separate bowl, mix 1/2 cup Cheddar cheese, ricotta cheese, eggs, milk, pepper, and salt. Spoon the sausage mixture into the prepared baking dish. Spread the Cheddar and ricotta mixture over the sausage mixture. Sprinkle with remaining Cheddar. Arrange tomato slices on top.\nCover with aluminum foil, and bake 30 minutes in the preheated oven. Uncover, and bake for an additional 15 minutes. Let stand for 10 minutes before serving.\n",
        "picture_link": "E36.mnFOJ4GturINjEfi53MunQrgcxW"
    },
    {
        "title": "Red Snapper Livornese",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 small onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "5 whole canned tomatoes, drained and chopped ADVERTISEMENT",
            "2 tablespoons capers, chopped ADVERTISEMENT",
            "1/2 cup sliced black olives, drained ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 pound red snapper fillets ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium skillet, heat olive oil and saute onion until tender, about 5 minutes. Add garlic, and saute for 1 minute. Stir in tomatoes, capers, black olives, red pepper flakes, and parsley. Bring to a boil, and simmer for 10 minutes.\nSpread 1/2 cup of the sauce in a 11x7 inch baking dish, and arrange the snapper fillets in a single layer in the dish. Drizzle lemon juice over the fillets, and then pour the remaining sauce over all.\nBake for 15 minutes for 1/2 inch thick fillets, or 30 minutes for 1 inch thick fillets. Baste once with the sauce while baking. Snapper is done when it flakes easily with a fork.\n",
        "picture_link": "R05x4V19sF6NweMMcZxoHxOOCLNjGhW"
    },
    {
        "title": "Sweet Honey French Bread",
        "ingredients": [
            "3/4 cup water ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "2/3 teaspoon salt ADVERTISEMENT",
            "2/3 teaspoon white sugar ADVERTISEMENT",
            "2 cups bread flour ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "1 tablespoon honey (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add to your bread machine per manufacturer instructions. While bread is baking, drizzle with honey if desired.\n",
        "picture_link": "DlkTgropQLXokVr9KJFb9ENKQB3cfp."
    },
    {
        "title": "Buffalo Chicken Burgers with Blue Cheese Dressing",
        "ingredients": [
            "1/4 cup light sour cream ADVERTISEMENT",
            "1/4 cup reduced fat blue cheese crumbles ADVERTISEMENT",
            "1/4 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 1/2 pounds ground chicken ADVERTISEMENT",
            "1/4 cup hot pepper sauce ADVERTISEMENT",
            "1/2 teaspoon celery salt (optional) ADVERTISEMENT",
            "1/4 teaspoon poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 tablespoon hot pepper sauce ADVERTISEMENT",
            "4 Kaiser rolls, split ADVERTISEMENT",
            "4 leaves iceberg lettuce ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate. Stir the sour cream, blue cheese, and Worcestershire sauce together in a small bowl; set aside.\nMix the ground chicken, 1/4 cup hot sauce, celery salt, poultry seasoning, paprika, and cayenne pepper together in a mixing bowl until evenly blended. Form into four 3/4-inch-thick patties.\nCook the chicken burgers on the preheated grill 6 to 7 minutes until well marked. Spray the uncooked top of the burger with cooking spray, and flip the burgers over. Brush the cooked side with 1 tablespoon hot sauce, and continue cooking until no longer pink in the center and the juices run clear, about 5 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nTo assemble the burgers, place a lettuce leaf on each roll bottom. Top with a burger patty, then spoon on 2 tablespoons of blue cheese sauce, and 2 tablespoons celery. Place the top of the roll on top to finish the sandwich.\n",
        "picture_link": "0ncpZnBsAVYo4JUJTIk0GK61fKJC7V2"
    },
    {
        "title": "Curried Hummus",
        "ingredients": [
            "2 (15.5 ounce) cans chick peas (garbanzo beans), rinsed and drained ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 garlic cloves, crushed ADVERTISEMENT",
            "4 teaspoons curry powder ADVERTISEMENT",
            "6 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "Salt, to taste ADVERTISEMENT",
            "Hot sauce, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put all ingredients in a food processor and blend until smooth. Serve (drizzled with olive oil, if desired) with pita chips.\n",
        "picture_link": "o0.FUnXl9cT/SM.guec6gkTaFzGpKN6"
    },
    {
        "title": "Garlic Parmesan Monkey Bread",
        "ingredients": [
            "3 tablespoons finely chopped green onions ADVERTISEMENT",
            "3 tablespoons parsley ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "5 tablespoons butter, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 (1 pound) loaves frozen bread dough, thawed ADVERTISEMENT",
            "1/2 cup Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 10 inch Bundt pan or tube pan.\nIn a medium bowl, mix together the green onion, parsley, garlic powder, salt, butter and eggs until well blended. Break the bread dough off in walnut-sized pieces, and dip each piece into the egg mixture.\nPlace coated dough balls into the prepared pan. Once there is a layer of balls covering the bottom of the pan, sprinkle with Parmesan cheese. Repeat, sprinkling each layer with cheese until everything is in the pan. Cover loosely, and let rise until doubled in size, about 45 minutes. Preheat the oven to 350 degrees F (175 degrees C).\nBake for 30 minutes in the preheated oven, or until golden brown.\n",
        "picture_link": "ermDyeVN501TUDfYutSiR0KhYg0DgIa"
    },
    {
        "title": "Irish Cream Creme Brulee",
        "ingredients": [
            "2 cups heavy cream ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons Irish cream liqueur ADVERTISEMENT",
            "superfine sugar as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Place 6 ramekins on a towel set in a roasting pan at least 3 inches deep.\nStir together cream and sugar in a saucepan over medium heat, and cook until very hot, stirring until the sugar dissolves. Whisk together egg yolks, vanilla, and Irish cream until combined. Slowly add 1/3 of the hot cream, whisking it in 2 tablespoons at a time until incorporated. Once you have incorporated 1/3 of the cream, you can stir in the remaining hot cream without fear of the mixture curdling.\nPour custard into the ramekins, then fill roasting pan with boiling hot water to come halfway up the sides of the ramekins. Bake in preheated oven until set, 50 to 60 minutes.\nOnce the custard has set, place ramekins on a wire rack, and allow to cool to room temperature, about 1 hour. Cover, and refrigerate until cold, about 4 hours. Custards may remain refrigerated until ready to serve.\nUnwrap the custards, and sprinkle about 1 teaspoon of superfine sugar onto each. Gently shake the custards so the sugar coats the entire top surface, then tip the custards to a 45 degree angle and shake off excess sugar.\nUsing a small hand torch, melt the sugar by making short passes over top of the custards with the flame not quite touching. Continue melting the sugar until it turns deep brown. Once the sugar has melted and turned to caramel, the cold custard underneath will harden the sugar into a crispy crust. Serve immediately. Alternatively, the sugar-dusted custards may be browned underneath the broiler in the oven.\n",
        "picture_link": "aYEJeAEMmRDfIogZLTJ8ExsI0oLX7tO"
    },
    {
        "title": "Eggplant Lasagna",
        "ingredients": [
            "1 teaspoon olive oil for brushing ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup Italian-seasoned breadcrumbs ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 large eggplants, peeled and sliced into 1/2-inch rounds ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "48 ounces chunky tomato sauce (such as Prego®) ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Oil 2 baking sheets and a 9x13-inch baking dish with 1 teaspoon olive oil.\nWhisk eggs and water together in a shallow dish. Combine Parmesan cheese, bread crumbs, salt, and ground black pepper in a separate shallow dish.\nDip eggplant slices into egg mixture, then press each gently into bread crumb mixture. Gently tap off any excess crumbs. Arrange slices on the prepared baking sheets.\nBake eggplant slices in the preheated oven until tops are golden brown, 20 to 25 minutes. Flip eggplant and bake an additional 20 to 25 minutes.\nRemove eggplant from the oven and increase temperature to 400 degrees F (200 degrees C).\nHeat 2 tablespoons olive oil in a skillet over medium-high heat and stir in ground beef. Season beef with salt and ground black pepper. Cook and stir until beef is browned and crumbly, about 10 minutes. Drain excess grease. Stir tomato sauce into ground beef; bring to a simmer and set sauce aside.\nPlace 1/3 of the eggplant slices on bottom of the dish. Pour 1/3 of tomato sauce with ground beef on top of eggplant layer. Sprinkle 1/3 of mozzarella cheese on top of sauce layer. Repeat 2 more times, finishing with a layer of mozzarella cheese.\nBake in the preheated oven until cheese is melted and sauce is bubbling, 10 to 15 minutes. Cool for 5 minutes before slicing.\n",
        "picture_link": "7u9UqkiSHAmYNRb36701IAjEC7CDoC."
    },
    {
        "title": "Easy Tilapia",
        "ingredients": [
            "2 (3 ounce) fillets tilapia fillets ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 lemon, halved ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 tomatoes, seeded and chopped ADVERTISEMENT",
            "3 tablespoons capers ADVERTISEMENT",
            "1 cup asparagus spears, trimmed and cut in half ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large non-stick skillet over medium heat. Drizzle fillets with olive oil and season with salt and pepper. Place fillets in skillet and sprinkle with half of the lemon over. Cook for 3 minutes per side, or until fish flakes easily with a fork. Transfer fillets to a plate, and keep warm.\nAdd wine, remaining 1/2 lemon, tomatoes, capers, and salt and pepper to the skillet. Increase heat to medium high and boil for 2 minutes to burn off alcohol. Reduce heat to low and return fillets to the pan along with the asparagus. Cover and simmer 2 minutes more, then transfer fish and asparagus to a serving dish and keep warm.\nAgain, increase heat to medium high and whisk in butter, and boil to desired consistency. Spoon sauce over fish, and serve.\n",
        "picture_link": "ucfp7qosY6e3EcEW3ORifWstAkI6EPu"
    },
    {
        "title": "Cocoa Banana Bars",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups mashed bananas ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nBeat the butter and sugar with an electric mixer in a large bowl until light and fluffy. Add the egg and the vanilla and beat until well combined. Stir in the mashed banana, set aside.\nStir together the flour, baking soda, baking powder, and salt in a separate large bowl, and make a well in the center. Pour the banana mixture into the well and stir just until combined.\nRemove half of the batter from the bowl. Mix the cocoa powder into the batter remaining in the bowl and stir well. Spread the cocoa batter in the bottom of the prepared pan. Spoon the remaining batter on top and use a knife to swirl the batter into a marbled design.\nBake in the preheated oven until the edges are golden, about 25 minutes. Allow to cool before cutting into 24 pieces.\n",
        "picture_link": "VoLfpniClxYeQDOW8mTpe4q/THlqJwe"
    },
    {
        "title": "Quick Cheeseburger Pie",
        "ingredients": [
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "4 tablespoons cold water ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup dill pickle juice ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/2 cup chopped dill pickles ADVERTISEMENT",
            "2 cups shredded Swiss cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nTo Make Pat-in-Pan Pastry: In a medium bowl, mix 1 1/3 cups flour and 1/2 teaspoon salt. Cut in shortening until mixture resembles tiny peas. Add cold water 1 tablespoon at a time, stirring with a fork after each addition. Mix lightly just until pastry almost cleans sides of bowl. Pat into bottom and sides of an 8 inch pie pan. Bake in preheated oven for 15 minutes.\nTo Make Filling: Crumble ground beef into a large skillet and saute over medium heat for 1 minute. Add onion and garlic. Continue to saute until onion is browned, about 10 minutes. Drain grease from mixture.\nSprinkle beef mixture with 1/2 teaspoon salt and 1/4 cup flour. Stir in pickle liquid, milk, pickles, and 1 cup shredded cheese. Spoon mixture into pastry shell.\nBake in preheated oven for 15 minutes. Sprinkle top with remaining 1 cup cheese and bake an additional 5 minutes, until pastry is golden brown and cheese is bubbly.\n",
        "picture_link": "Z5dnKDrvTViU6lQKWfyusDLJCyGN3.W"
    },
    {
        "title": "Chocolate Toffee Crunch Bars",
        "ingredients": [
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1/2 cup finely chopped walnuts ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together graham cracker crumbs, 1/4 cup brown sugar, and 1/3 cup melted butter. Press into the bottom of an ungreased 9x13 inch pan.\nBake for 8 to 10 minutes in preheated oven. In a saucepan, combine 1/2 cup butter and 1/2 cup brown sugar. Cook over moderate heat, stirring constantly, until mixture comes to a boil; boil for 1 minute. Pour immediately over baked cookie base.\nBake for 10 more minutes. Remove from oven, and sprinkle with chocolate chips. Let stand for 2 to 3 minutes, until chips are shiny and soft. Spread the softened chocolate evenly over the top. Sprinkle with chopped nuts. Cool before cutting into bars.\n",
        "picture_link": "wZBa6GCW9wXRMR6vn/DPnLfYYI8pb3m"
    },
    {
        "title": "Scrumptious Sweet Potato Casserole",
        "ingredients": [
            "3 cups cooked and mashed sweet potatoes ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup packed light brown sugar ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nIn a large mixing bowl, combine sweet potatoes, white sugar, 1/4 cup margarine, vanilla, milk, and beaten eggs. Mix well. Pour mixture into prepared baking dish.\nIn a medium mixing bowl, combine brown sugar, chopped pecans, flour, and 1/4 cup margarine. Mix well. Sprinkle over sweet potato mixture.\nBake for 25 to 30 minutes.\n",
        "picture_link": "DXxDspyTF5HdmxjYPC6OvrhscsZuO4e"
    },
    {
        "title": "Beef Stew II",
        "ingredients": [
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 carrots, sliced ADVERTISEMENT",
            "3 stalks celery, sliced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dredge beef cubes in flour until evenly coated.\nMelt butter in a skillet, and cook coated beef cubes until evenly browned.\nTransfer beef to slow cooker and add onions, carrots, celery, garlic, bay leaves, salt, sugar, pepper, paprika, cloves, lemon juice and Worcestershire sauce. Pour in water and stir.\nCover and cook on LOW 10 to 12 hours or on HIGH 5 to 6 hours. Serve hot!!\n",
        "picture_link": "r02cmskJ5/3KudjVY6/LXtlrEqIXws2"
    },
    {
        "title": "Fruity Fun Skewers",
        "ingredients": [
            "5 large strawberries, halved ADVERTISEMENT",
            "1/4 cantaloupe, cut into balls or cubes ADVERTISEMENT",
            "2 bananas, peeled and cut into chunks ADVERTISEMENT",
            "1 apple, cut into chunks ADVERTISEMENT",
            "20 skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thread the strawberries, cantaloupe, banana and apple pieces alternately onto skewers, placing at least 2 pieces of fruit on each skewer. Arrange the fruit skewers decoratively on a serving platter.\n",
        "picture_link": "JztM//kLZQN64BCPMmnRvunf6LY7P1."
    },
    {
        "title": "Easy Parmesan Crusted Chicken",
        "ingredients": [
            "1/2 cup Hellmann's® Real Mayonnaise ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "4 (5 ounce) boneless, skinless chicken breast halves ADVERTISEMENT",
            "4 teaspoons Italian-seasoned dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F.\nCombine Hellmann's(R) Real Mayonnaise with cheese in medium bowl. Arrange chicken on baking sheet. Evenly top with mayonnaise mixture, then sprinkle with bread crumbs.\nBake 20 minutes or until chicken is thoroughly cooked.\n",
        "picture_link": "I2tVBnqlSDr.j4psf7SUKXdRJQ7l2ca"
    },
    {
        "title": "Sensational Steak Sandwich",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound thinly sliced sirloin steak strips ADVERTISEMENT",
            "8 ounces sliced fresh mushrooms ADVERTISEMENT",
            "1 green bell pepper, seeded and cut into strips ADVERTISEMENT",
            "1 medium onion, sliced ADVERTISEMENT",
            "10 slices provolone cheese ADVERTISEMENT",
            "1 loaf French bread ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "1/4 cup Pinot Noir or other dry red wine ADVERTISEMENT",
            "1/2 cup prepared horseradish (optional) ADVERTISEMENT",
            "1/2 cup brown mustard (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat. Add the beef, and cook until browned. Add the mushrooms, bell pepper and onion; cook and stir until starting to become tender, about 5 minutes.\nIn a slow cooker, combine the beef broth, salt, pepper, Worcestershire sauce, red pepper flakes and red wine. Transfer the beef and vegetables to the slow cooker, and stir to blend. Cover, and cook on High for 3 to 4 hours, until beef is extremely tender.\nPreheat the oven to 425 degrees F (220 degrees C). Drain the liquid from the slow cooker, and save for dipping. Slice the French bread loaf lengthwise like a submarine sandwich. Mix together the horseradish and mustard; spread onto the inside of the loaf. Place slices of provolone cheese on both sides of the loaf, then fill with the beef and vegetables. Close the loaf, and wrap the entire sandwich with aluminum foil.\nBake for 10 to 15 minutes in the preheated oven. For crunchier bread, you can bake it without the aluminum foil. Slice into servings, and serve with the juices from the slow cooker for dipping.\n",
        "picture_link": "PByp7bXWhH3/jfeqy4rcvwEov3Qj1S6"
    },
    {
        "title": "Marble Swirl Pound Cake",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "3 1/2 cups cake flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, with electric mixer at low speed, beat sugar and butter or margarine until blended. Increase speed to high, and beat until light and fluffy. Add flour, milk, baking powder, vanilla, salt, and eggs; beat at medium speed until well mixed. Increase speed to high, and beat batter 4 minutes longer.\nRemove about 2 1/2 cups batter to a medium bowl. With a wire whisk or fork, beat cocoa into batter in medium bowl until well blended.\nGrease a 10 inch tube pan. Alternately spoon vanilla and chocolate layers into prepared pan. With a large spoon, cut and twist through batters to obtain marbled effect.\nBake at 350 degrees F (175 degrees C) for 1 hour, or until a toothpick inserted in the center of the cake comes out clean. Cool cake in pan, and on a wire rack, for 10 minutes. Remove cake from pan, and cool completely.\n",
        "picture_link": "QIhjK2MCYDJBAjeL.hlOW3nf6mhgP.K"
    },
    {
        "title": "Balsamic Mushrooms",
        "ingredients": [
            "1/3 cup olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 pound fresh mushrooms, sliced ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "3 tablespoons white wine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute the garlic in olive oil for 1 to 2 minutes. Do not brown the garlic. Add mushrooms and cook 2 more minutes, stirring occasionally. Stir in balsamic vinegar and wine, cook another 2 minutes. Season to taste with salt and pepper.\n",
        "picture_link": "84RbhiTGHq3xa8vAjcQlDpDStyXZqJ."
    },
    {
        "title": "Simple Deviled Eggs",
        "ingredients": [
            "6 hard-cooked eggs ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon white vinegar ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon finely chopped onion ADVERTISEMENT",
            "1 tablespoon finely chopped celery ADVERTISEMENT",
            "1 pinch paprika, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice eggs in half lengthwise and remove yolks; set whites aside. Mash yolks with a fork in a small bowl. Stir in mayonnaise, sugar, vinegar, mustard, salt, onion, and celery; mix well. Stuff or pipe egg yolk mixture into egg whites. Sprinkle with paprika. Refrigerate until serving.\n",
        "picture_link": "avpb9zzye0oGog8SeEF2qYkZqeaKg0i"
    },
    {
        "title": "Summer Potato Salad",
        "ingredients": [
            "5 cups peeled and cubed potatoes ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons seasoning salt ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon ground mustard ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1/3 cup chopped celery ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add potatoes; cook until tender but still firm, about 15 minutes. Drain, and transfer to a large bowl.\nPlace eggs in a saucepan, and cover completely with cold water. Bring water to a boil. Cover, remove from heat, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, and cool. Peel, chop, and add to potatoes.\nIn a small bowl, combine lemon juice, oil, sugar, seasoned salt, Worcestershire sauce, mustard powder and black pepper; mix well. Blend in mayonnaise. Pour lemon dressing over potatoes, and stir to coat.\nMix in green onions, celery, and parsley. Refrigerate for at least 2 hours before serving.\n",
        "picture_link": "tuheMwh8uu8fUA7ODHU1f3fZ84N1lTC"
    },
    {
        "title": "Microwave Pralines",
        "ingredients": [
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "2/3 cup heavy cream ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 1/2 cups pecan halves ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, microwave safe bowl, combine sugar, cream, salt, margarine and pecans. Microwave 9 minutes on high, stirring once. Let rest 1 minute. Stir in vanilla and continue to stir 3 minutes more. Drop by teaspoonfuls onto buttered waxed paper. (If mixture is runny, allow to cool 30 seconds more and try again.)\n",
        "picture_link": "QQBKEwVGhSAhSHNOSNz2ahRGZwhP4Au"
    },
    {
        "title": "Easy Pizza Sauce II",
        "ingredients": [
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine tomato sauce, garlic, oregano and basil and mix all together. Spread mixture over pizza crust, if desired.\n",
        "picture_link": "KLh..21b5juCYDUX6fExshYp3WjGZxG"
    },
    {
        "title": "Banana Chip Muffins II",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 cup applesauce ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Coat a 12 cup muffin tin with nonstick spray.\nWhisk together flour, baking powder, soda, cinnamon, salt, and sugar. Mix in egg whites, applesauce, and banana mash until just moistened. Stir in chocolate chips. Divide batter into muffin cups.\nBake for 15 to 18 minutes.\n",
        "picture_link": "vSctpM92M65dgyS3qi/dp/QB0s1ANHi"
    },
    {
        "title": "Beer Batter for Fish",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "3/4 cup beer ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "4 cups pastry flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1 1/2 pounds cod fillets ADVERTISEMENT",
            "2 quarts vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together flour, baking powder, baking soda, and cornstarch.\nIn a large bowl, beat together eggs and milk. Mix in beer. Stir in flour mixture. Season with salt, black pepper, and garlic powder.\nIn an electric deep fryer or a heavy saucepan, heat oil to 375 degrees F (190 degrees C).\nCoat fish in batter, and submerge in hot oil. Fry until golden brown, about 4 to 5 minutes. Serve.\n",
        "picture_link": "ioROSkC/bE/oYXD4KJcOuVtE6HR5KlW"
    },
    {
        "title": "No Roll Sugar Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets.\nCream butter or margarine, shortening, white sugar and confectioners' sugar together until light and fluffy. Beat in the egg and the vanilla.\nSift the flour, baking soda, salt and cream of tartar together. Add the flour mixture to the sugar mixture and blend.\nShape dough into walnut-sized balls and place on the prepared baking sheets. Dip a glass in white sugar and press balls flat. Bake at 375 degrees F (190 degrees C) for 10 to 12 minutes or until lightly browned.\n",
        "picture_link": "fXPx2RGSJznMiHJhetEk3yOT1KojeYO"
    },
    {
        "title": "Fish Roll-Ups",
        "ingredients": [
            "2/3 cup butter ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "1 cup minced crabmeat ADVERTISEMENT",
            "2 tablespoons minced fresh parsley ADVERTISEMENT",
            "1/4 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "24 buttery round crackers, crushed ADVERTISEMENT",
            "12 (6 ounce) fillets sole ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly coat a 9x13 inch baking pan with cooking spray.\nMelt butter in frying pan over medium heat. Add onion and saute for 1 minute. Stir in crabmeat, parsley, garlic powder salt and pepper and cook 1 minute more. Remove from heat and stir in crushed crackers.\nSpread mixture over filets; sprinkle with lemon juice and Parmesan cheese. Roll up filets, seal with toothpicks and place in prepared baking dish. Dot each roll with butter and cover pan tightly with foil.\nBake in preheated oven for 15 to 17 minutes until fish flakes.\n",
        "picture_link": "B9cAsPJiMlcQ8MFanRaKidwoXh7j2vi"
    },
    {
        "title": "Szechuan Spicy Eggplant",
        "ingredients": [
            "1 (1 1/2 pound) eggplant ADVERTISEMENT",
            "4 tablespoons soy sauce ADVERTISEMENT",
            "1/4 cup chicken stock ADVERTISEMENT",
            "1 teaspoon chili sauce ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons oyster sauce (optional) ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "4 tablespoons water ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "4 large green onions, finely chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh ginger root ADVERTISEMENT",
            "1/4 pound fresh shrimp - peeled, deveined, and diced ADVERTISEMENT",
            "1/3 pound lean ground beef ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "4 cups hot cooked rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the eggplant stem and cut into 1-inch cubes. In a medium bowl, combine the soy sauce, chicken stock, chili sauce, sugar, ground black pepper and oyster sauce. Stir together well and set aside. In a separate small bowl, combine the cornstarch and water, and set aside.\nCoat a large, deep pan with cooking spray over high heat and allow a few minutes for it to get very hot. Saute the garlic, half of the green onions, ginger and dried shrimp, if using (see Cook's Note) for 3 to 5 minutes, stirring constantly, until they begin to brown. Stir in the ground beef or pork and cook for 3 more minutes, again stirring constantly, until browned.\nPour the eggplant into the pan and stir all together. Pour the reserved soy sauce mixture over all, cover the pan, reduce heat to medium low and let simmer for 15 minutes, stirring occasionally. If you're using fresh shrimp, add it during the last few minutes of cooking. Stir in the reserved cornstarch mixture and let heat until thickened. Finally, stir in the rest of the green onions and the sesame oil.\nServe over hot rice.\n",
        "picture_link": "DVU6m6ntG8Usz1OM5.gYFjJDozEO7Qe"
    },
    {
        "title": "Crock-Pot® Chicken Chili",
        "ingredients": [
            "1 (16 ounce) jar green salsa (salsa verde) ADVERTISEMENT",
            "1 (16 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "2 (15 ounce) cans white beans, drained ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 (14 ounce) can corn, drained ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 skinless, boneless chicken breasts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix green salsa, diced tomatoes with green chile peppers, white beans, chicken broth, corn, onion, oregano, cumin, salt, and black pepper together in a slow cooker. Lay chicken breasts atop the mixture.\nCook on Low until the chicken shreds easily with 2 forks, 6 to 8 hours.\nRemove chicken to a cutting board and shred completely; return to chili in slow cooker and stir.\n",
        "picture_link": "0/3TZvwYQh/zTNXwuYWcfCiI9cvZSRS"
    },
    {
        "title": "Carrots in Dill Butter",
        "ingredients": [
            "8 carrots, peeled and sliced into 1 inch pieces ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dill seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium-sized heavy saucepan, combine carrots, water, butter, sugar, salt and dill seed. Bring to a boil; reduce heat, cover and simmer 25 to 30 minutes, or until carrots are tender and most of the liquid is absorbed.\n",
        "picture_link": "cqvuIooSw8vYzhlBxVCOZGYW1C/ZaD6"
    },
    {
        "title": "Garlicky Appetizer Shrimp Scampi",
        "ingredients": [
            "6 tablespoons unsalted butter, softened ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon minced shallots ADVERTISEMENT",
            "2 tablespoons minced fresh chives ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "2 pounds large shrimp - peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nIn a large bowl, mix together softened butter, olive oil, garlic, shallots, chives, salt, pepper, and paprika; add the shrimp, and toss to coat.\nLightly oil grill grate. Cook the shrimp as close to the flame as possible for 2 to 3 minutes per side, or until opaque.\n",
        "picture_link": "yKsxhxu8Pg4asRc2.BmDXsRk59DVCGS"
    },
    {
        "title": "Pizzelles II",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup margarine, melted and cooled ADVERTISEMENT",
            "2 tablespoons anise extract ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs and sugar with an electric mixer until fluffy. Stir in the melted margarine and anise extract. Combine the flour and baking powder; stir in gradually. Dough will be sticky.\nPreheat your pizzelle iron according to the manufacturer's instructions. Drop batter by rounded spoonfuls onto the iron. Close and cook for about 90 seconds, or until steam stops coming out of the iron. Carefully remove and cool. Store in an airtight tin at room temperature.\n",
        "picture_link": "h869vkOq5SCjNWFFXwFXxzFZTkpPv7i"
    },
    {
        "title": "Best-Ever Texas Caviar",
        "ingredients": [
            "2 (15 ounce) cans black beans, rinsed and drained ADVERTISEMENT",
            "2 (15 ounce) cans pinto beans, rinsed and drained ADVERTISEMENT",
            "2 (15 ounce) cans white corn, rinsed and drained ADVERTISEMENT",
            "1 (4 ounce) can chopped green chiles, undrained ADVERTISEMENT",
            "1 jalapeno chile pepper, seeded and finely chopped (optional) ADVERTISEMENT",
            "1 red bell pepper - cored, seeded and finely chopped ADVERTISEMENT",
            "1 green bell pepper - cored, seeded and finely chopped ADVERTISEMENT",
            "1 small red onion, finely chopped ADVERTISEMENT",
            "1 bunch cilantro leaves, finely chopped ADVERTISEMENT",
            "1/2 cup rice vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the black beans, pinto beans, white corn, green chiles, jalapeno pepper, red and green bell peppers, red onion, and cilantro together in a large bowl.\nTo make the dressing, stir the rice vinegar, olive oil, sugar, and garlic powder together in a pan. Bring to a boil, then remove from heat, and cool. Pour dressing over bean mixture, and toss to mix evenly.\n",
        "picture_link": "Jt/53HlBtUF2rp/D91yQA8UIomP1tiO"
    },
    {
        "title": "American Frittata",
        "ingredients": [
            "4 potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 onions, sliced ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "8 eggs, beaten ADVERTISEMENT",
            "3/4 cup cubed ham ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 5 minutes. Drain and set aside to cool. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nIn a cast iron skillet, heat oil over medium heat. Add onions and cook slowly, stirring occasionally, until onions are soft.\nStir in eggs, drained potatoes, ham, salt and pepper. Cook until eggs are firm on the bottom, about 5 minutes. Top frittata with shredded cheese and place in preheated oven until cheese is melted and eggs are completely firm, about 10 minutes.\n",
        "picture_link": "v1.yjMxlT98MdVHkVsaGrEsAkdS3U2a"
    },
    {
        "title": "Jalapeno Steak",
        "ingredients": [
            "4 jalapeno peppers, stemmed ADVERTISEMENT",
            "4 cloves garlic, peeled ADVERTISEMENT",
            "1 1/2 teaspoons cracked black pepper ADVERTISEMENT",
            "1 tablespoon coarse salt ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 1/2 pounds top sirloin steak ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine jalapenos, garlic, pepper, salt, lime juice and oregano in a blender. Blend until smooth.\nPlace steak in a shallow pan or large resealable plastic bag. Pour jalapeno marinade over the steak, and turn to coat. Cover pan or seal bag; marinate in the refrigerator 8 hours or overnight.\nPreheat an outdoor grill for high heat, and lightly oil the grill grate.\nDrain and discard marinade. Grill steak 5 minutes per side, or to desired doneness.\n",
        "picture_link": "BVV558uPYguHVP9DM95I2opN2Hos1ly"
    },
    {
        "title": "Grandpa's Popcorn Balls",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon distilled white vinegar (optional) ADVERTISEMENT",
            "5 quarts popped popcorn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, combine the sugar, corn syrup, butter and water. Stir and heat to hard-crack stage or 300 degrees F (150 degrees C). Remove from heat, add vanilla or vinegar; mix well.\nPour slowly over popped popcorn while stirring. Wait 5 minutes and shape into 3 inch round balls.\n",
        "picture_link": "M/218xa0j4vEGlot6HHL9wM7X5hWlMu"
    },
    {
        "title": "Magic Cookie Bars I",
        "ingredients": [
            "1/2 cup margarine, melted ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 1/3 cups flaked coconut ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nInto bottom of 9 x1 3 pan pour melted margarine. Sprinkle crumbs evenly over melted margarine, chopped nuts over crumbs, then distribute chocolate chips over nuts. Add the coconut and pour milk over all.\nBake 25 minutes or until lightly browned on top. Cool 15 minutes before cutting into finger length bars.\n",
        "picture_link": "RjbLqBbyT9wYFtNTErx8wBWrfNTo/HW"
    },
    {
        "title": "Pecan Tassies",
        "ingredients": [
            "2 cups margarine ADVERTISEMENT",
            "4 (3 ounce) packages cream cheese ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 1/2 cups packed brown sugar ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together the margarine and cream cheese until well blended. Beat in flour, 1 cup at a time, until the mixture forms a smooth dough. Roll into small balls, and press into the bottoms and sides of tart pans or mini muffin pans.\nIn another bowl, mix together the eggs, brown sugar, butter, vanilla, and salt. Stir in the pecans. Use a spoon to fill each of the crusts 2/3 full with the filling mixture.\nBake for 15 to 18 minutes in the preheated oven, until shell is light brown, and the filling has puffed up. Cool, and carefully remove from pans.\n",
        "picture_link": "GVGsYFX9h8uymEai1mPdos40oZAuoWK"
    },
    {
        "title": "Monster Cookies II",
        "ingredients": [
            "1 cup margarine, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "3 cups peanut butter ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 1/2 teaspoons corn syrup ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "4 teaspoons baking soda ADVERTISEMENT",
            "9 cups rolled oats ADVERTISEMENT",
            "1/2 pound candy-coated milk chocolate pieces ADVERTISEMENT",
            "1/2 pound semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together the margarine, white sugar, brown sugar, and peanut butter until smooth. Beat in the eggs, two at a time, then stir in the corn syrup and vanilla. Mix in baking soda and oats until well blended. Stir in the chocolate candies and chocolate chips. Roll dough into 2 inch balls, and place 3 inches apart on an ungreased cookie sheet. Flatten slightly with a fork.\nBake for 12 to 15 minutes in the preheated oven. Cool on cookie sheets for a few minutes, before transferring to wire racks to cool completely.\n",
        "picture_link": "hufHpgZmm38ROpmJQZfm0Zw0TtpIn2O"
    },
    {
        "title": "Unbaked Chocolate Oatmeal Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "3 cups quick cooking oats ADVERTISEMENT",
            "5 tablespoons cocoa powder ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "1/2 cup flaked coconut (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook butter or margarine, milk and sugar in kettle and boil for 1 and 1/2 minutes.\nAdd peanut butter, oatmeal, cocoa powder and any one of the optional ingredients.\nDrop on waxed paper and allow to cool before serving.\n",
        "picture_link": "QOtfXl/myZNgg9YXwIKsD8wZwWKMb8a"
    },
    {
        "title": "Jeff's Chili Con Queso",
        "ingredients": [
            "1 (8 ounce) package processed American cheese, cubed ADVERTISEMENT",
            "1 (8 ounce) package mild Cheddar cheese, cubed ADVERTISEMENT",
            "1 (7 ounce) can mild, chunky salsa ADVERTISEMENT",
            "3/4 (15 ounce) can chili ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over low heat, melt the processed American cheese and Cheddar cheese.\nWhen cheeses are melted and thoroughly blended, mix in salsa, chili, sour cream, chili powder and hot pepper sauce. Cook and stir 10 to 15 minutes before serving warm.\n",
        "picture_link": "EsoIVsqh1Jnh3Mh.5.5Rg.lcxsEr4t."
    },
    {
        "title": "Creamy Pumpkin Pie",
        "ingredients": [
            "4 cups fresh pumpkin, cooked and mashed ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (9 inch) deep dish pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C.)\nIn a large bowl, combine pumpkin puree, sweetened condensed milk and eggs. Season with cinnamon, ginger, nutmeg and salt. Mix together with a wire whisk until thoroughly blended. Pour filling into pie crust.\nBake in preheated oven for 15 minutes. Reduce the heat to 350 degrees F (175 degrees C) and bake another 35 to 40 minutes or until a knife inserted comes out clean.\n",
        "picture_link": "uNLWfhu66FM4exDjMQXTr5.F6ZuRRCy"
    },
    {
        "title": "Lance's French Onion Soup",
        "ingredients": [
            "5 onions, thinly sliced ADVERTISEMENT",
            "6 cups beef broth ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3 tablespoons butter or margarine ADVERTISEMENT",
            "1 pound shredded Swiss cheese ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (1 pound) loaf French bread, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium stock pot, heat beef broth over medium-high heat.\nIn a saute pan, add butter and oil and cook over medium-high heat. Once heated, add onions and stir, until onions are tender and transparent. Stir in sugar.\nAdd onions to heated broth, stir and let simmer for 20 minutes.\nAdd wine and season with salt and pepper, simmer for 10 minutes.\nPour soup mixture into individual serving bowls and place a slice of bread on top, making sure bread gets well soaked. Place shredded cheese on top of bread and broil, 3 inches below heat, until cheese bubbles.\n",
        "picture_link": "dmR2ia7X42I8Z/59H.GFDp19cUkH.z2"
    },
    {
        "title": "Mocha Coffee",
        "ingredients": [
            "1 cup hot brewed coffee ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour hot coffee into a mug. Stir in cocoa, sugar and milk.\n",
        "picture_link": "Ze.HH3VcmY72GEp/edu7z02yEL2jVzm"
    },
    {
        "title": "Kheer (Rice Pudding)",
        "ingredients": [
            "2 cups coconut milk ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup Basmati rice ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1/2 teaspoon rose water (optional) ADVERTISEMENT",
            "1/4 cup sliced almonds, toasted ADVERTISEMENT",
            "1/4 cup chopped pistachio nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the coconut milk, milk and sugar to a boil in a large saucepan. Add Basmati rice, and simmer over low heat until the mixture thickens and the rice is tender, about 20 minutes.\nStir in the raisins, cardamom and rose water, and cook for a few more minutes. Ladle into serving bowls, and garnish with almonds and pistachios.\n",
        "picture_link": "83q8CDnja8FIkqSSEFSszDs6eE9MQsa"
    },
    {
        "title": "Feta and Sun-Dried Tomato Stuffed Chicken",
        "ingredients": [
            "1/3 cup lemon juice ADVERTISEMENT",
            "1/3 cup extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons Greek seasoning ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "2 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (4 ounce) package crumbled feta cheese ADVERTISEMENT",
            "6 chopped sun-dried tomatoes ADVERTISEMENT",
            "10 pitted and coarsely chopped kalamata olives (optional) ADVERTISEMENT",
            "1 tablespoon oil from the sun-dried tomatoes ADVERTISEMENT",
            "4 strips roasted red pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the lemon juice, extra-virgin olive oil, Greek seasoning, and lemon zest in a bowl. Pound the chicken breasts between sheets of wax paper or plastic wrap to a thickness of 1/4 inch. Marinate the chicken in the lemon marinade at least 30 minutes. Meanwhile, stir together the feta cheese, sun-dried tomatoes, kalamata olives, and 1 tablespoon of oil from the jar of sun-dried tomatoes in a small bowl; set aside.\nPreheat oven to 375 degrees F (190 degrees C).\nRemove the chicken from the marinade, and shake off excess. Discard the remaining marinade. Divide the stuffing mixture onto each piece of chicken. Fold the edges of the chicken over the filling, and secure with toothpicks. Place onto a baking dish, seam-side down, and place two roasted pepper strips onto each stuffed breast.\nBake in the preheated oven until the chicken is no longer pink, about 30 minutes. Remember to remove the toothpicks before serving.\n",
        "picture_link": "fSwuWbA38GT4sF666HoEjpp1AMeWl3O"
    },
    {
        "title": "Quick and Super Easy Chicken and Dumplings",
        "ingredients": [
            "2 1/4 cups biscuit baking mix ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "2 (10 ounce) cans chunk chicken, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the biscuit mix and milk just until it pulls together. Set aside.\nPour the cans of chicken broth into a saucepan along with the chicken; bring to a boil. Once the broth is at a steady boil, take a handful of biscuit dough and flatten it in your hand. Tear off 1 to 2 inch pieces and drop them into the boiling broth. Make sure they are fully immersed at least for a moment. Once all of the dough is in the pot, carefully stir so that the newest dough clumps get covered by the broth. Cover, and simmer over medium heat for about 10 minutes, stirring occasionally.\n",
        "picture_link": "daodMt.iDqw5fwtfHwI8iW3NIiAeer6"
    },
    {
        "title": "Whipped Sweet Potato Casserole",
        "ingredients": [
            "2 pounds sweet potato, peeled and cubed ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "2 tablespoons butter, cubed ADVERTISEMENT",
            "1 cup miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large saucepan cook sweet potatoes in salted water over medium-high heat for about 20 minutes, or until done. Drain, and add orange juice, brown sugar, nutmeg and butter. Whip until smooth. Spread into a medium size casserole dish and top with marshmallows.\nBake in preheated oven for about 10 minutes, or until marshmallows are golden brown.\n",
        "picture_link": "wbLceRAPscGIj7mUVpKfpOTGdmL21Yu"
    },
    {
        "title": "Heavenly Shortbread",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (170 degrees C).\nCream softened butter thoroughly. ( If using margarine, add four drops of butter flavoring.) Slowly add sugar.\nSift flour and corn starch before adding. Mix well. Press into an ungreased jelly roll pan 11 x 15 x 1 1/2 inches.\nBake 30 minutes or until very light brown. Score and cut while warm.\n",
        "picture_link": "JSJ.qlHid3Mwh.iE47VxzMuc5RgQetS"
    },
    {
        "title": "Movie Star Popcorn",
        "ingredients": [
            "3 tablespoons peanut oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup unpopped popcorn ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a 2 to 3 quart saucepan or pot with a lid set over medium-high heat. Pour in popcorn kernels and sprinkle enough salt to lightly cover the layer of kernels. Remember, you can always add more salt later. Add the butter to the pot and cover with the lid.\nAs soon as the kernels start to pop, shake the pan back and forth across the burner constantly until the popping slows down. As soon as the pops are about 2 seconds apart, remove from the heat and pour into a serving bowl. Taste, and season with additional salt if desired.\n",
        "picture_link": "s.2jG/34VkVMlbKAuxjo.ngY1qV38CS"
    },
    {
        "title": "Slow Cooker Sweet and Sour Kielbasa",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "2 large onions, sliced ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 (28 ounce) bottle ketchup ADVERTISEMENT",
            "3 tablespoons cider vinegar ADVERTISEMENT",
            "1 1/2 teaspoons spicy brown mustard ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons hot pepper sauce ADVERTISEMENT",
            "1 pound kielbasa sausage, cut into 1 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Saute onions until tender. Stir in brown sugar, ketchup, vinegar, mustard, Worcestershire sauce and pepper sauce. Simmer, stirring occasionally, for 20 minutes.\nPlace sausage in a slow cooker with the sauce and onions. Cook on low for 4 to 5 hours. The longer it simmers the better!\n",
        "picture_link": "ScbhZyLO/SEeRUNls1TbFoBm38CiOMi"
    },
    {
        "title": "Brandy Flamed Peppercorn Steak",
        "ingredients": [
            "3 tablespoons crushed black peppercorns ADVERTISEMENT",
            "2 (8 ounce) beef top sirloin steaks ADVERTISEMENT",
            "1 tablespoon lemon pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "3 tablespoons brandy ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 shallot, chopped ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 teaspoon white sugar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Press crushed peppercorns into both sides of each steak. Sprinkle with lemon pepper and salt.\nMelt butter in a large skillet over medium-high heat. Stir in garlic and wine, and cook for 1 minute. Arrange steaks in pan, and cook until desired doneness, about 5 minutes per side. Reduce heat to low.\nPour brandy onto steaks, and carefully light with a match. Let the flames burn off. Sprinkle green onion and shallot around the steaks, and circle the steaks with cream. Cook, stirring sauce, until hot. Transfer steaks to plates. Stir sugar into sauce, and then spoon over meat.\n",
        "picture_link": "hC1YxiF1rMACLdkfKMrn4AXwGRvqKv6"
    },
    {
        "title": "Easy Mini Quiches",
        "ingredients": [
            "6 slices bacon, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3/4 cup buttermilk baking mix ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 cups shredded American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease 2 mini muffin pans. In a large skillet over medium heat, fry bacon and onion together for about 5 minutes, or until bacon is crisp. Drain and set aside.\nIn a medium bowl, beat the eggs. Stir in the baking mix, parsley, shredded cheese, bacon and onion. Spoon into greased muffin cups.\nBake for 10 to 15 minutes in the preheated oven, or until the tops are lightly browned. Allow mini quiches to cool in the pan before carefully removing with a small knife or spatula.\n",
        "picture_link": "Q52yOmEYyrsQvhWG9WFNtwKZy6MuCXq"
    },
    {
        "title": "Crazy Chicken Marinade Grilled Chicken",
        "ingredients": [
            "4 limes, juiced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the lime juice, olive oil, chili powder, sage, oregano, and cumin together in a small bowl. Arrange the chicken breasts in a shallow glass container; pour the lime juice marinade over the chicken. Cover the container with plastic wrap; refrigerate 1 1/2 hours, turning the chicken every 30 minutes.\nPreheat an outdoor grill for medium heat and lightly oil the grate. Remove the chicken to a platter and allow to come to room temperature. Pour the marinade into a small saucepan and bring to a boil over high heat. Reduce heat to medium-low and simmer for 10 minutes.\nBasting with the marinade, grill the chicken breasts until no longer pink in the center and the juices run clear, 8 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "Y8Yb0jweOgDYur58SpIfmpQHCUafoE."
    },
    {
        "title": "Sausage and Sauerkraut",
        "ingredients": [
            "2 pounds sauerkraut, rinsed and drained ADVERTISEMENT",
            "1 tablespoon caraway seeds (optional) ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 apple, diced ADVERTISEMENT",
            "1/2 pound bacon, cut into 1-inch pieces ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 1/2 pounds kielbasa sausage, cut into 1-inch thick slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the sauerkraut, caraway seeds, brown sugar, and apple into a large saucepan over medium-low heat, and bring the mixture to a simmer. Reduce heat to low, and cook for 2 hours, stirring occasionally.\nPreheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.\nPlace the bacon and onion into a skillet over medium heat, and cook until the bacon is almost crisp and the onion is beginning to brown, about 10 minutes. Stir the bacon mixture into the sauerkraut. In the same skillet, brown the kielbasa sausage in the remaining bacon grease until the sausage begins to brown, 10 to 15 minutes; stir into the sauerkraut mixture. Spoon the sauerkraut and sausage mixture into the prepared baking dish.\nBake in the preheated oven until bubbling, about 1 hour.\n",
        "picture_link": "BBYZjR3qdfFoc6ucldW3pPrhMFrYZsO"
    },
    {
        "title": "Pan Fried Halibut Steak with Light Green Sauce",
        "ingredients": [
            "4 (8 ounce) halibut steaks ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup all-purpose flour for dusting ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "2 tablespoons finely chopped fresh parsley ADVERTISEMENT",
            "4 tablespoons finely chopped fresh basil ADVERTISEMENT",
            "2 tablespoons drained capers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse the halibut steaks and pat dry. Season with salt and pepper, then dust with flour.\nMelt the butter in a large skillet over medium-high heat. Fry the halibut steaks in the butter for 4 to 5 minutes, until nicely browned. Remove from the skillet and keep warm.\nReduce the heat to medium, and stir the wine into the pan, scraping up any browned bits stuck to the bottom. Mix in the lemon juice, then stir in the cream. Simmer for 2 to 3 minutes or until it starts to thicken. Season with parsley, basil and capers, and stir for another minute. Serve halibut with sauce spooned over it. Garnish with additional parsley if desired.\n",
        "picture_link": "T/m7ZbOQgtZimm4uM/ZG9aSKbMWuGwO"
    },
    {
        "title": "Mushroom Soup Without Cream",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup peeled and sliced carrots ADVERTISEMENT",
            "1 cup sliced onions ADVERTISEMENT",
            "1 cup sliced leeks (optional) ADVERTISEMENT",
            "1/2 cup sliced celery ADVERTISEMENT",
            "1 teaspoon fresh thyme leaves ADVERTISEMENT",
            "2 pounds sliced fresh brown or white mushrooms ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a stock pot over medium heat. Add carrots, onions, leeks, and celery. Cook and stir until tender, but not browned, about 10 minutes. Stir in thyme and mushrooms, and continue cooking until mushrooms are soft, about 5 minutes.\nPour chicken stock into the pot, and season with salt and pepper. Cover, and simmer over low heat for 30 minutes. Ladle into bowls, and serve with green onions sprinkled on the top.\n",
        "picture_link": "YqXdREWS1/7HOy/sND1NhXc.ptsXY2i"
    },
    {
        "title": "Lentil Quiche",
        "ingredients": [
            "1 cup chopped onion ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup dried lentils ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cups broccoli florets ADVERTISEMENT",
            "1 cup chopped fresh tomatoes ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 teaspoons Italian seasoning ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Place the onion and olive oil into a 9 inch deep-dish pie plate. Bake for about 15 minutes, or until onion is tender.\nPlace the lentils and water into a saucepan, and bring to a boil. Cook for about 20 minutes, or until lentils are tender. Drain most of the water off, then place the broccoli florets on top of the lentils. Cover and cook for about 5 minutes. This will dry the lentils, and cook the broccoli.\nTransfer the lentils, broccoli and tomatoes to the pie plate with the onions, and stir to evenly distribute each item. Stir in cheese at this time if using. In a medium bowl, whisk together the eggs, milk, salt, pepper, and Italian seasoning. Pour over the ingredients in the pie plate.\nBake for 45 minutes in the preheated oven, or until the center is firm when the quiche is jiggled. Cool for a few minutes before slicing and serving.\n",
        "picture_link": "xUvNKD/6fg0IlvS.4FVSXWXtqYkOvcW"
    },
    {
        "title": "Phyllo-Wrapped Halibut Fillets with Lemon Scallion Sauce",
        "ingredients": [
            "2 tablespoons melted butter ADVERTISEMENT",
            "4 sheets phyllo dough ADVERTISEMENT",
            "2 (5 ounce) halibut fillets ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons chopped fresh dill ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1/2 cup whipping cream ADVERTISEMENT",
            "2 green onions, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nLightly butter 1 sheet of phyllo dough. Lay another sheet directly on top of the first sheet, and lightly butter it. Repeat with remaining 2 sheets of phyllo. Cut sheets in half.\nSeason halibut fillets with salt and pepper. Place a fillet near the bottom edge of one of the halved sheets of phyllo. Sprinkle with dill. Fold in the sides of the phyllo, then roll the fillet. Place on a baking sheet, and lightly brush with butter. Repeat with remaining fillet.\nBake in a preheated oven until pastry is puffed and golden brown, about 12 to 15 minutes.\nMeanwhile, bring lemon juice to a boil in a small saucepan over high heat. Boil until almost evaporated. Reduce heat to medium, and stir in cream. Simmer until the cream thickens somewhat. Stir in green onions, and season with salt and pepper. Serve halibut on a pool of sauce.\n",
        "picture_link": "eDDAudawRUooLSkIZo6GK7RUFeskYQy"
    },
    {
        "title": "Pork Butt Roast with Vegetables",
        "ingredients": [
            "salt and pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "6 pounds pork butt roast ADVERTISEMENT",
            "2 onion, sliced ADVERTISEMENT",
            "20 new potatoes, raw ADVERTISEMENT",
            "16 carrots, peeled ADVERTISEMENT",
            "2 cups mushrooms, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large frying pan over medium high heat. Sprinkle pork on all sides with salt, pepper and garlic powder; rub into meat. Sear the meat on all sides until lightly brown. Transfer to a roasting pan.\nPlace onion slices over meat and in the roasting pan. Fill the pan 2/3 full of water. Cover and place in preheated oven for 3 hours. Add the potatoes and carrots; cover and cook 45 minutes. Add the mushrooms and cook another 15 minutes. Remove and let stand at least 10 minutes before serving.\n",
        "picture_link": "/c.2FyxMU3YldvczfnLtYoD00NmoEWm"
    },
    {
        "title": "Lemon Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F (205 degrees C). Grease bottoms only of 12 muffin cups or line with baking cups.\nIn a medium bowl, combine flour, sugar, baking powder, lemon zest and salt; mix well. In a small bowl, combine milk, oil and egg; blend well. Add dry ingredients all at once; stir just until dry ingredients are moistened (batter will be lumpy.)\nFill cups 2/3 full. Bake for 20 to 25 minutes or until toothpick inserted in center comes out clean. Cool 1 minute before removing from pan. Serve warm.\n",
        "picture_link": "aq11N74EwCb8X8f6.T07rfDxzR3vXCy"
    },
    {
        "title": "Slow Cooker Western Omelet",
        "ingredients": [
            "1 (2 pound) package frozen shredded hash brown potatoes ADVERTISEMENT",
            "1 pound diced cooked ham ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 green bell pepper, seeded and diced ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease a 4 quart or larger slow cooker. Place 1/3 of the hash brown potatoes in a layer on the bottom. Layer 1/3 of the ham, onion, green pepper, and Cheddar cheese. Repeat layers two more times. In a large bowl, whisk together eggs and milk, and season with salt and pepper. Pour over the contents of the slow cooker.\nCover, and cook on Low for 10 to 12 hours.\n",
        "picture_link": "ct0a7f0AFJoML.8vqCKB/gs6wu1MpPS"
    },
    {
        "title": "Shrimp Tetrazzini",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "8 ounces shrimp, shelled and deveined ADVERTISEMENT",
            "8 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/4 cup sherry ADVERTISEMENT",
            "1 (8 ounce) package spaghetti ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook spaghetti in a large pot of boiling salted water until al dente. Drain well.\nOver a medium-low heat melt butter in a medium saucepan. Add onion to melted butter and stir until onion is soft. Add shrimp and mushrooms, cook for 5 minutes stirring often. Remove shrimp mixture from saucepan, place in a medium size bowl and set aside.\nRemove saucepan from heat. Combine flour, mayonnaise, salt, milk, and sherry in the saucepan. Mix well. Return the saucepan to the heat and cook until sauce thickens.\nPour sauce into the bowl containing the shrimp mixture. Add the spaghetti to the bowl and mix well.\nPlace all ingredients in a 1-1/2 quart casserole dish (baking pan). Sprinkle the parmesan cheese on top of the mixture. Bake at 350 degrees F (175 degrees C) for 30 minutes.\n",
        "picture_link": "j4hb/dEJ.qUTRHIX7fVRF95hJugZBvy"
    },
    {
        "title": "Best Beef Stroganoff",
        "ingredients": [
            "1 (16 ounce) package egg noodles ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (8 ounce) package fresh mushrooms, thinly sliced ADVERTISEMENT",
            "1 pound beef loin steak, cut into thin strips ADVERTISEMENT",
            "1 (14 ounce) can beef consomme ADVERTISEMENT",
            "1/4 cup Burgundy wine (optional) ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons cold water, or as needed ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add noodles and cook 5 to 7 minutes or until al dente; drain.\nMelt butter in a large saucepan over medium-high heat. Stir in onions and garlic, and cook until slightly tender. Mix in mushrooms, and continue cooking 2 minutes. Place steak strips in saucepan and cook about 1 minute. Mix in consomme, Burgundy and lemon juice. Bring to a boil.\nIn a small bowl, thoroughly blend flour with cold water until smooth. Reduce saucepan heat to low. While stirring constantly, slowly pour flour mixture into saucepan. Gradually return to boil while stirring rapidly, until sauce is thick and smooth. Cover saucepan and continue cooking 5 minutes, stirring occasionally. Remove from heat, let cool slightly and stir in sour cream. Serve over cooked egg noodles.\n",
        "picture_link": "W2P63Log.4/Fsf9nFph15ewr1wMpv4q"
    },
    {
        "title": "Homemade Chicken Parmigiana",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/3 cup minced onion ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1/2 teaspoon sugar ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/3 cup fine dry bread crumbs ADVERTISEMENT",
            "2 tablespoons freshly grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "3 (5 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3/4 cup shredded Mozzarella cheese ADVERTISEMENT",
            "1 tablespoon freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat. Stir in garlic and onion, and cook until the onion has softened and turned translucent, about 2 minutes. Pour in diced tomatoes and sugar. Increase heat to medium-high, and bring to a simmer, then reduce heat to medium-low, and continue simmering for 10 minutes, stirring occasionally. Once the sauce has simmered, stir in the cream and season to taste with salt and pepper. Simmer for an additional 3 minutes. Lower heat and keep sauce warm\nStir together bread crumbs, 2 tablespoons Parmesan cheese, and dried oregano; set aside. In a small bowl, whisk together egg and 2 tablespoons milk until blended. Dip chicken breasts into the egg, then press into breadcrumb mixture to coat both sides, shaking off excess.\nHeat olive oil in a large skillet over medium heat. Add chicken breasts and cook on both sides until they reach an internal temperature of 160 degrees F (70 degrees C), and the bread crumb crust is golden brown, about 10 minutes.\nTo serve, spoon sauce over chicken and top with Mozzarella and Parmesan cheeses. Let stand a few minutes until the cheese has melted from the heat of the sauce.\n",
        "picture_link": "hATAGDdmI/Y3BR.n6m6vDjqkGL5eWvS"
    },
    {
        "title": "Lemon-Pepper Salmon",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 (4 ounce) salmon steaks ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 tablespoon lemon pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cup chopped fresh tomatoes ADVERTISEMENT",
            "1 cup chopped fresh cilantro ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1 cup uncooked couscous ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the butter and olive oil in a large skillet over medium heat. Place salmon in the skillet, and season with garlic, lemon pepper and salt. Pour 1/4 cup water around salmon. Place tomatoes and cilantro in the skillet. Cover, and cook 15 minutes, or until fish is easily flaked with a fork.\nBring 2 cups water to boil in a pot. Remove form heat, and mix in couscous. Cover, and let sit 5 minutes. Serve the cooked salmon over couscous, and drizzle with sauce from skillet.\n",
        "picture_link": "zcJc6l6ONg3SMDxLKNvYZupk4xmKjwG"
    },
    {
        "title": "Easy Swedish Meatball Sauce ",
        "ingredients": [
            "1 cup beef stock ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 (20 ounce) package frozen cooked meatballs, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the beef stock, heavy cream, flour, soy sauce, black pepper, and rosemary in a large saucepan until smooth. Cook and stir over low heat until thickened, about 10 minutes, stirring occasionally. Stir in the meatballs, and continue cooking until meatballs are heated through, about 5 more minutes.\n",
        "picture_link": "mWrtMwhV8ssF7lkvfIquu9/pIS0ZXBa"
    },
    {
        "title": "Mandi's Cheesy Potato Soup",
        "ingredients": [
            "5 potatoes, peeled and cubed ADVERTISEMENT",
            "1 small carrot, finely chopped ADVERTISEMENT",
            "1/2 stalk celery, finely chopped ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "3 tablespoons margarine, melted ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons steak seasoning ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups shredded four-cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, combine potatoes, carrot, celery, water and salt. Bring to a boil, then reduce heat, cover and simmer until potatoes are tender, 15 to 20 minutes. Once tender, stir in milk.\nIn a small bowl, combine melted margarine, flour, steak seasoning and pepper. Stir into soup, increase heat to medium, and cook, stirring, until thick and bubbly. Remove from heat and stir in cheese until melted. Let stand 5 to 10 minutes before serving.\n",
        "picture_link": "drMKHFazelQxrhyb4RPFfLH94uYY.H6"
    },
    {
        "title": "Strawberry Oat Muffins",
        "ingredients": [
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "1 cup chopped fresh strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a muffin pan, or use paper liners. In a small bowl, combine oats and buttermilk, and let stand 5 minutes. In a medium bowl, combine flour, baking powder, baking soda and salt; set aside.\nIn a large bowl, beat together the egg, oil, brown sugar and vanilla. Blend in the oat mixture. Stir in the flour mixture, just until moistened. Fold in strawberries. Fill muffin cups 2/3 to 3/4 full.\nBake in the preheated oven for 15 to 20 minutes, or until a toothpick inserted into the center comes out clean.\n",
        "picture_link": "291fh.QUdnH.XZU3j97Xp2vdlIvVuza"
    },
    {
        "title": "Rich and Creamy Potatoes Au Gratin",
        "ingredients": [
            "3 pounds Yukon Gold potatoes, peeled and very thinly sliced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 cup heavy cream, divided ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "freshly grated nutmeg to taste ADVERTISEMENT",
            "2 cups freshly shredded Gruyere cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace potatoes, garlic, and salt into a large pot, fill with enough water to cover, and bring to a boil. Reduce heat to medium, and simmer the potatoes until tender but not mushy, 8 to 10 minutes. With a slotted spoon, transfer about half the potatoes to a 9x13-inch baking dish.\nPour half of the cream over the potatoes, season with black pepper and nutmeg, and sprinkle half of the Gruyere cheese onto the mixture. Top with the remaining potatoes; sprinkle again with black pepper and nutmeg. Pour on the remaining cream, and sprinkle with remaining Gruyere cheese.\nBake in the preheated oven until the cheese topping is crisp and brown on top, about 1 hour.\n",
        "picture_link": "TT0S6dUoY4djy9UHRMbgovTv28NuVTe"
    },
    {
        "title": "Allie's Mushroom Pizza",
        "ingredients": [
            "1 (12 inch) pre-baked pizza crust ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1 cup fresh spinach, rinsed and dried ADVERTISEMENT",
            "8 ounces shredded mozzarella cheese ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place pizza crust on baking sheet.\nIn a small bowl, mix together olive oil and sesame oil. Brush onto pre-baked pizza crust, covering entire surface. Stack the spinach leaves, then cut lengthwise into 1/2 inch strips; scatter evenly over crust. Cover pizza with shredded mozzarella, and top with sliced mushrooms.\nBake in preheated oven for 8 to 10 minutes, or until cheese is melted and edges are crisp.\n",
        "picture_link": "5xxNu8FKJutuyyDnO4sKsaqx/DVmC8q"
    },
    {
        "title": "Good Ol' Alabama Sweet Tea",
        "ingredients": [
            "2 cups sugar ADVERTISEMENT",
            "1/2 gallon water ADVERTISEMENT",
            "1 tray ice cubes ADVERTISEMENT",
            "3 family sized teabags of orange pekoe tea ADVERTISEMENT",
            "3 cups cold water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the sugar into a large pitcher. Bring water to a boil in a large pan. When the water begins to boil, remove from the heat, and place the teabags in. Let steep for 5 to 6 minutes.\nRemove tea bags, and return tea to the heat. Bring just to a boil, then pour into the pitcher, and stir until the sugar is dissolved. Fill the pitcher half way with ice, and stir until most of it melts. Then fill the pitcher the rest of the way with cold water, and stir until blended.\n",
        "picture_link": "ELCNaLIqjegw0.JR0vOCMErFpSrhVcq"
    },
    {
        "title": "Cool Cucumber Salsa",
        "ingredients": [
            "2 medium cucumbers - peeled, seeded, and chopped ADVERTISEMENT",
            "2 medium tomatoes, chopped ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 teaspoon minced fresh parsley ADVERTISEMENT",
            "2 teaspoons minced fresh cilantro ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (12 ounce) package tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the cucumbers, tomatoes, green pepper, jalapeno pepper, onion, garlic, lime juice, parsley, cilantro, dill, and salt. Cover and refrigerate for 1 hour. Serve with tortilla chips.\n",
        "picture_link": "6XJaKych2j81lNJBHBMX21pUS9rxh0S"
    },
    {
        "title": "Creamy Banana Pudding",
        "ingredients": [
            "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk ADVERTISEMENT",
            "1 1/2 cups cold water ADVERTISEMENT",
            "1 (4-serving size) package instant vanilla pudding mix ADVERTISEMENT",
            "2 cups whipping cream, whipped ADVERTISEMENT",
            "36 vanilla wafers ADVERTISEMENT",
            "3 medium bananas, sliced and dipped in ADVERTISEMENT",
            "lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, combine sweetened condensed milk and water. Add pudding mix; beat until well blended. Chill 5 minutes.\nFold in whipped cream. Spoon 1 cup pudding mixture into 2 1/2-quart glass serving bowl.\nTop with one-third each of the vanilla wafers, bananas and remaining pudding. Repeat layering twice, ending with pudding mixture. Chill thoroughly. Garnish as desired. Store leftovers covered in refrigerator.\n",
        "picture_link": "TkT9Ih5vx7nqcWvU6/NtMQ8fI4A2N1m"
    },
    {
        "title": "Easy Polenta with Tomato Sauce",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "1 cup yellow cornmeal ADVERTISEMENT",
            "1 cup Parmesan cheese ADVERTISEMENT",
            "2 cups spaghetti sauce, or your favorite recipe ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9 inch square baking dish.\nIn a large pot, combine the milk and chicken stock. Bring to a boil over medium-high heat. When it is at a rolling boil, gradually whisk in the cornmeal, making sure there are no lumps. Reduce heat to low and simmer, stirring constantly until thick, about 5 minutes. Remove from the heat and stir in the Parmesan cheese.\nPour the polenta into the prepared baking dish, and spread spaghetti sauce over the top.\nBake for 10 minutes in the preheated oven, or until sauce is bubbling.\n",
        "picture_link": "8LneHTZg8WnQaN4DCUvUgQP/8hLRbnG"
    },
    {
        "title": "Cornell Chicken Marinade",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups cider vinegar ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crack the egg into a medium bowl and whisk until beaten. Slowly whisk in the oil until fully blended. Then whisk in the vinegar, salt, poultry seasoning, and ground black pepper. Set some of the sauce aside to use for basting while grilling. Place chicken in shallow baking dish, and coat with sauce. Cover, and marinate in the refrigerator for 24 hours.\n",
        "picture_link": "egvXEN13OmCiVq.RoDq/pc8Bem1BlKe"
    },
    {
        "title": "Southern Ham and Brown Beans",
        "ingredients": [
            "1 pound dry pinto beans ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "1 large, meaty ham hock ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beans and water in a large stockpot. Add the ham hock, onion and garlic. Season with chili powder, salt and pepper. Bring to a boil, and cook for 2 minutes. Cover, and remove from heat. Let stand for one hour.\nReturn the pot to the heat, and bring to a boil once again. Reduce heat to medium-low, and simmer for at least 3 hours to blend flavors. The longer you simmer, the thicker the broth will become. I like to cook mine for about 6 hours.\nRemove the ham hock from the broth, and let cool. Remove the meat from the bone, and return the meat to the stockpot, discarding the bone. Adjust seasonings to taste.\n",
        "picture_link": "xs5HT/TKyeijhR.H4ivLX23VEfDhXgq"
    },
    {
        "title": "Strawberry Cake and Frosting I",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3 ounce) package strawberry flavored Jell-O® mix ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (10 ounce) package frozen strawberries ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 3/4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round pans.\nIn a large bowl, stir together cake mix, gelatin mix and flour. Make a well in the center and pour in water, oil, and eggs. Stir in half of the container of strawberries. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pans.\nBake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\nTo make the Strawberry Frosting: In a large bowl combine butter, confectioners' sugar and the remaining half of the frozen strawberries. Beat on high speed until creamy.\n",
        "picture_link": "r.BTWtEMaqwFJWgUFoatfqiULHozRL."
    },
    {
        "title": "French Leek Pie",
        "ingredients": [
            "1 (9 inch) refrigerated pie crust ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "3 leeks, chopped ADVERTISEMENT",
            "1 pinch salt and black pepper to taste ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "1 1/4 cups shredded Gruyere cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMelt butter in a large saucepan over medium-low heat. Stir in leeks; cook, stirring occasionally, for about 10 minutes, or until soft. Season with salt and pepper. Reduce heat to low. Stir in cream and cheese, and warm through. Pour mixture into pie shell\nBake in preheated oven for 30 minutes, or until custard is set and golden on top. Allow to sit 10 minutes before cutting pie into wedges.\n",
        "picture_link": "zOl8jnO1A7Cis4EoDHcs8mtaKs.RXie"
    },
    {
        "title": "Ground Beef and Rice with Cheese",
        "ingredients": [
            "1 cup white rice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "3 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "8 slices processed cheese food (such as Velveeta®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice and water to a boil in a saucepan. Reduce heat to medium-low; cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes.\nPreheat an oven to 400 degrees F (200 degrees C). Grease a 1-quart baking dish.\nWhile the rice is cooking, heat a large skillet over medium-high heat and stir in the ground beef. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the condensed tomato soup and chili powder; cook until heated through.\nSpread 1/3 of the rice into the bottom of the prepared baking dish and cover with 1/3 of the ground beef mixture. Place 2 slices of processed cheese over the meat, then cover with 2 more layers of rice and meat. Arrange the remaining 6 slices of cheese over the top.\nBake in the preheated oven until the casserole has heated through and the cheese is bubbly and browned, about 20 minutes.\n",
        "picture_link": "r2.Yhr7XMyautcH81lKrSsxKZP.pxcq"
    },
    {
        "title": "Traditional Osso Buco",
        "ingredients": [
            "2 pounds veal shanks, cut into short lengths ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup Butter ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 large carrot, chopped ADVERTISEMENT",
            "2/3 cup dry white wine ADVERTISEMENT",
            "2/3 cup beef stock ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Gremolata: ADVERTISEMENT",
            "1/2 cup chopped fresh flat leaf parsley ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 teaspoons grated lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dust the veal shanks lightly with flour. Melt the butter in a large skillet over medium to medium-high heat. Add the veal, and cook until browned on the outside. Remove to a bowl, and keep warm. Add two cloves of crushed garlic and onion to the skillet; cook and stir until onion is tender. Return the veal to the pan and mix in the carrot and wine. Simmer for 10 minutes.\nPour in the tomatoes and beef stock, and season with salt and pepper. Cover, and simmer over low heat for 1 1/2 hours, basting the veal every 15 minutes or so. The meat should be tender, but not falling off the bone.\nIn a small bowl, mix together the parsley, 1 clove of garlic and lemon zest. Sprinkle the gremolata over the veal just before serving.\n",
        "picture_link": "uZGJHgEfNZjX2/sc0xYVcSh943luMt6"
    },
    {
        "title": "Slow Cooker Italian Beef",
        "ingredients": [
            "1 pound thinly sliced roast beef ADVERTISEMENT",
            "1 (.7 ounce) package dry Italian-style salad dressing mix ADVERTISEMENT",
            "1 (16 ounce) jar pepperoncini, sliced ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine roast beef, dry dressing mix, pepperoncini and beef broth in a slow cooker. Cook over medium-high heat until hot, about 1 hour\n",
        "picture_link": "y.lf1QA/rOLeeU09t9atSmQQYfO6on6"
    },
    {
        "title": "English Toffee",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/4 cup slivered almonds ADVERTISEMENT",
            "1 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 10x15 inch jellyroll pan.\nMelt butter in a heavy skillet over medium heat. Stir in sugar and water. Bring to a boil and add almonds. Cook, stirring constantly until nuts are toasted and the sugar is golden. Pour the mixture into the prepared pan; do not spread.\nImmediately sprinkle the chocolate chips on top. Let stand for a minute, then spread the chocolate over the top. Let cool completely, then break into pieces.\n",
        "picture_link": "YJUlY/w8zxSC.6fNew077y2yRnSr4IC"
    },
    {
        "title": "Tender and Easy Buttermilk Waffles",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups low-fat buttermilk ADVERTISEMENT",
            "1/3 cup melted butter ADVERTISEMENT",
            "2 large eggs, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, sugar, baking powder, baking soda, and salt together in a bowl until evenly combined. Whisk buttermilk and butter together in a separate bowl; add eggs. Stir buttermilk mixture into flour mixture until just combined and batter is slightly lumpy; add vanilla extract.\nPreheat a waffle iron according to manufacturer's instructions.\nPour enough batter into the preheated waffle iron to reach 1/2 inch from the edge. Cook according to manufacturer's instructions.\n",
        "picture_link": "IjrXEJy137/VtcEq7zHG804Qy/Pmz0q"
    },
    {
        "title": "Swedish Meatballs II",
        "ingredients": [
            "6 tablespoons butter, divided ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup dried bread crumbs ADVERTISEMENT",
            "1 cup evaporated milk, divided ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch dried parsley ADVERTISEMENT",
            "1 1/2 teaspoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon tomato sauce ADVERTISEMENT",
            "ground nutmeg to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 3 tablespoons butter in a large skillet over medium heat. Add the onion and saute for 5 to 10 minutes, or until tender.\nIn a separate bowl, combine the bread crumbs with 2 tablespoons of evaporated milk and stir, allowing the crumbs to absorb the milk. Add the ground beef, onion, egg, salt, ground black pepper and parsley to taste. Mix well and form into golf ball-sized meatballs.\nHeat remaining butter in the same skillet over medium- to medium-high heat and add the meatballs. Carefully shake the skillet to turn the meatballs, as needed. Saute for 10 to 15 minutes, or until meatballs are browned on all sides. Transfer the meatballs to a serving platter, reserving the liquid in the skillet.\nAdd the flour to the skillet and stir until smooth. Then gradually add the evaporated milk, tomato sauce and nutmeg to taste; again stirring until mixture is warmed, smooth and creamy. Strain over meatballs.\n",
        "picture_link": "yZzShtsQ7EO/uV7eF77rM451is668KG"
    },
    {
        "title": "Chicken Jambalaya I",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/3 cup chopped celery ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "2/3 cup white rice ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 cups cooked, cubed chicken meat ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter or margarine in a large skillet over medium low heat. Add celery, onion and green bell pepper and saute until tender. Stir in tomatoes, broth, rice, thyme or basil, garlic salt, ground black pepper, hot pepper sauce and bay leaf.\nBring all to a boil; reduce heat, cover skillet and simmer for about 20 minutes or until rice is tender. Stir in chicken or turkey and cook until heated through. Discard bay leaf and serve hot.\n",
        "picture_link": "vJlqMIOD9XTgQo0YFi13pTn0rIky5z."
    },
    {
        "title": "Pumpkin Cheesecake I",
        "ingredients": [
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1 1/4 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 prepared 8 inch pastry shells ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat together the cream cheese and the sugar, add the pumpkin and the spices. Beat in eggs one at a time. Add salt. Beat until creamy. Pour the batter evenly into the two pastry shells.\nBake at 350 degrees F (175 degrees C) for 50 minutes or until the knife inserted in the center comes out clean. Let cool then top with whipped topping, if desired.\n",
        "picture_link": "bNA8Gw30x/EmdivoU8TqvOqZUO7DqE6"
    },
    {
        "title": "Kale and Banana Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "2 cups chopped kale ADVERTISEMENT",
            "1/2 cup light unsweetened soy milk ADVERTISEMENT",
            "1 tablespoon flax seeds ADVERTISEMENT",
            "1 teaspoon maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the banana, kale, soy milk, flax seeds, and maple syrup into a blender. Cover, and puree until smooth. Serve over ice.\n",
        "picture_link": "C7.0J2OaF6.u1gFCggNnSatiNOP1HrG"
    },
    {
        "title": "Maple Glazed Chicken with Sweet Potatoes",
        "ingredients": [
            "1 1/2 pounds sweet potatoes, peeled and cut into 1-inch pieces ADVERTISEMENT",
            "1 pound chicken tenders ADVERTISEMENT",
            "2 teaspoons steak seasoning (such as Montreal Steak Seasoning®) ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1/2 cup sliced green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the sweet potatoes into a large pot and cover with water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Mash the potatoes, and set aside.\nSprinkle chicken tenders with steak seasoning; heat the oil in a large skillet over medium heat, and cook the chicken tenders until the meat is lightly browned and no longer pink inside, 5 to 8 minutes per side. Remove the chicken, and set aside. Stir the maple syrup into the skillet, scraping up and dissolving any browned flavor bits from the skillet. Bring to a boil, simmer for 2 minutes, and stir in the green onions.\nTo serve, place the mashed sweet potatoes onto a serving platter, top with the chicken tenders, and pour the maple sauce over the chicken.\n",
        "picture_link": "C92JtC4FNW9yoSPnR/AYMofFOcYemyS"
    },
    {
        "title": "Spaghetti Squash with Pine Nuts, Sage, and Romano",
        "ingredients": [
            "1 spaghetti squash, halved lengthwise and seeded ADVERTISEMENT",
            "1/4 cup toasted pine nuts ADVERTISEMENT",
            "1/4 cup grated Pecorino Romano cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh sage ADVERTISEMENT",
            "2 teaspoons butter, melted ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the squash, cut side down, in a large baking dish.\nBake the squash in the preheated oven for 50 minutes.\nScrape flesh of squash from the rind using a fork and place in a bowl. Add the pine nuts, cheese, sage, butter, salt, and pepper; toss to combine. Serve immediately.\n",
        "picture_link": "ZLnVbpPXMXgMWVAP1gx5TseZcpW/sA2"
    },
    {
        "title": "Bacon Wrapped Water Chestnuts III",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "1 pound bacon ADVERTISEMENT",
            "2 (8 ounce) cans water chestnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium-size mixing bowl, combine brown sugar, Worcestershire sauce, and ketchup.\nCut bacon in half. Wrap one slice of bacon around each chestnut. Secure the bacon with a toothpick. Arrange the water chestnut wraps in a 9x13 inch baking dish.\nBake the water chestnut wraps for 10 to 15 minutes.\nRemove from water chestnut wraps from the oven and drain some of the grease out of the pan. Pour the sauce over the wraps.\nBake for 30 to 35 more minutes.\n",
        "picture_link": "muP5PBdutmcGQxb9vEIFRr1z0pw9sH2"
    },
    {
        "title": "Butter Cream Frosting I",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 egg yolk, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter until soft. Add salt and part of sugar gradually, blending after each addition. Then add egg yolks and vanilla; blend well. Add remaining sugar, alternately with milk, until of right consistency to spread, beating after each addition until smooth. Makes 2 1/2 cups or enough frosting to cover tops and sides of two 8 or 9 inch layers.\nNote: If desired, 1 whole egg may be substituted for the 2 egg yolks to make 2 3/4 cups frosting.\n",
        "picture_link": "ZqbQYeT6dOUkAHlibrPY1bmUvTpLB0O"
    },
    {
        "title": "Chef John's Creamy Mushroom Soup ",
        "ingredients": [
            "1/4 cup unsalted butter ADVERTISEMENT",
            "2 pounds sliced fresh mushrooms ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "6 sprigs fresh thyme ADVERTISEMENT",
            "2 cloves garlic, peeled ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 pinch salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon fresh thyme leaves for garnish, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large soup pot over medium-high heat; cook mushrooms in butter with 1 pinch salt until the mushrooms give off their juices; reduce heat to low. Continue to cook, stirring often, until juices evaporate and the mushrooms are golden brown, about 15 minutes. Set aside a few attractive mushroom slices for garnish later, if desired. Mix onion into mushrooms and cook until onion is soft and translucent, about 5 more minutes.\nStir flour into mushroom mixture and cook, stirring often, for 2 minutes to remove raw flour taste. Tie thyme sprigs into a small bundle with kitchen twine and add to mushroom mixture; add garlic cloves. Pour chicken stock and water into mushroom mixture. Bring to a simmer and cook for 1 hour. Remove thyme bundle.\nTransfer soup to a blender in small batches and puree on high speed until smooth and thick.\nReturn soup to pot and stir in cream. Season with salt and black pepper and serve in bowls, garnished with reserved mushroom slices and a few thyme leaves.\n",
        "picture_link": "C3jTyTQi5RZQ3NwrkIYLPUFPol3uwoS"
    },
    {
        "title": "Spicy Salmon with Caramelized Onions",
        "ingredients": [
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 (6 ounce) salmon fillets ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 tablespoons minced onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the black pepper, paprika, cayenne pepper, minced garlic, Dijon mustard, brown sugar, onion powder, and salt in a small bowl. Stir in 1 tablespoon of olive oil to make a paste. Spread the paste all over the salmon fillets, and set aside to marinate at room temperature 30 minutes.\nHeat the remaining 2 tablespoons of olive oil in a small pan over medium heat. Stir in the onion, and cook until tender and golden brown, about 10 minutes. Heat a separate non-stick skillet over medium-high heat. Cook the salmon fillets in the hot skillet until golden brown on each side, and no longer translucent in the center, about 4 minutes per side. Pour the browned onions and olive oil over the salmon fillets to serve.\n",
        "picture_link": "i0/YelAITEFgdsUCOI/e43R824DMHki"
    },
    {
        "title": "Maple Cajun Mahi Mahi",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "2 (4 ounce) fillets mahi mahi fillets, rinsed and patted dry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a pan over medium-high heat.\nStir the maple syrup, Cajun seasoning, and garlic powder together in a small bowl.\nBrush the maple syrup mixture over the mahi mahi fillets.\nCook the mahi mahi in the hot oil until the fish flakes easily with a fork, 3 to 5 minutes per side.\n",
        "picture_link": "DSolLmajvgHhP4ircEUEPAsoRXE/HIq"
    }
]