[
    {
        "title": "Green Monster - Spinach Smoothie",
        "ingredients": [
            "1 cup yogurt ADVERTISEMENT",
            "1 banana, broken into chunks ADVERTISEMENT",
            "1/2 cup frozen blueberries ADVERTISEMENT",
            "4 cups fresh spinach ADVERTISEMENT",
            "1 tablespoon water, or as desired (optional) ADVERTISEMENT",
            "2 ice cubes, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer yogurt, banana, and blueberries in a blender, respectively. Add as much spinach to blender that will fit; pour in water. Blend on high speed until smooth, adding the remaining spinach if needed. Add ice for a colder and thicker smoothie. Add more water for a thinner smoothie.\n",
        "picture_link": "XZVYR3.9.rYoOqoyDnH/ffMqq34OOP."
    },
    {
        "title": "Vegan Sugar Cookies",
        "ingredients": [
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup vegan margarine (such as Earth Balance®) ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "all-purpose flour for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat confectioners' sugar and margarine together in a bowl using an electric mixer until smooth and creamy. Add vanilla extract and beat until smooth.\nWhisk 2 1/2 cups flour, cornstarch, baking powder, and baking soda together in a separate bowl. Beat flour mixture into creamed butter mixture on medium-low speed just until dough is combined. Separate dough into 2 balls and refrigerate for at least 2 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nDust dough with flour and roll into 1/4-inch thick pieces on a work surface. Cut cookies into desired shapes using cookie cutters and arrange on a baking sheet.\nBake in the preheated oven until cookies are just beginning to turn brown, 10 to 14 minutes. Let cookies rest on baking sheet, 5 to 10 minutes; transfer to a wire rack to cool.\n",
        "picture_link": ".MiwBUfQ4JFg0cT6sQMeDsS2OE.XXoG"
    },
    {
        "title": "VELVEETA® Potato Bites",
        "ingredients": [
            "2 pounds baking potatoes, peeled, cut into chunks ADVERTISEMENT",
            "2 green onions, thinly sliced ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/4 pound VELVEETA®, cut into 24 cubes ADVERTISEMENT",
            "1 (2.75 ounce) packet SHAKE 'N BAKE Extra Crispy Seasoned Coating Mix ADVERTISEMENT",
            "1 1/2 cups TACO BELL® Thick 'N Chunky Salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook potatoes in boiling water in large saucepan 15 to 20 min. or until tender; drain. Cool 10 min. Mash potatoes until smooth. Add onions, egg and pepper; mix just until blended.\nHeat oven to 400 degrees F. Empty coating mix into pie plate. Roll potato mixture into 24 balls, using about 2 Tbsp. for each. Insert 1 VELVEETA cube into center of each ball, completely enclosing VELVEETA. Add, 1 at a time, to coating mix; turn to evenly coat. Place on rimmed baking sheet sprayed with cooking spray.\nBake 14 to 16 min. or until heated through. Serve with salsa.\n",
        "picture_link": "rUqII61fayhYzDTfre25eWc3JwUfZ7C"
    },
    {
        "title": "Salsa Simmered Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (15 ounce) jar mild picante salsa ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken breasts all over with salt and black pepper.\nHeat oil in a large skillet over medium-high heat. Cook chicken breasts in hot oil until browned, 4 to 6 minutes per side. Pour salsa and chicken broth over chicken, bring mixture to a boil, reduce heat to medium-low, and simmer for 15 minutes. Turn chicken over, stir salsa mixture, and continue to simmer until chicken is tender and sauce is slightly thickened, about 15 minutes more. An instant-read thermometer inserted into the center of the chicken should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "50FhUxE66w3rPooKXP0iwu1C/Z8P.JG"
    },
    {
        "title": "Valentine's Slice-and-Bake Cinnamon Heart Shortbread Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup heart-shaped cinnamon candies, ground into a fine powder ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 3/4 cups all-purpose flour, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter in a large bowl with a hand mixer until fluffy; add vanilla extract, confectioners' sugar, ground cinnamon candies, and cornstarch and mix with hand mixer until combined.\nIncorporate flour 1/4 cup at a time, mixing with your hands until all flour is used and dough comes together.\nDivide dough into halves; roll each into an 8-inch cylinder. Wrap each cylinder in waxed paper and freeze until firm, at least 1 hour to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Remove dough from freezer and let thaw just until slightly softened.\nCut dough into 1/4-inch slices and arrange onto baking sheets.\nBake in preheated oven until firm along the edges but not yet browned, about 10 minutes. Cool cookies on racks for 5 minutes before moving to a rack to cool completely.\n",
        "picture_link": "2Ov34WraUlqLmlfdHWkFP6hB3bybMEC"
    },
    {
        "title": "Fudge Cayenne",
        "ingredients": [
            "1/2 cup almond milk ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 cup dark chocolate chips ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir milk and margarine together in a saucepan; bring to a simmer over medium-low heat, about 5 minutes.\nCombine confectioners' sugar, chocolate chips, cocoa powder, vanilla extract, cayenne pepper, and ground cinnamon together in a bowl. Pour hot milk mixture over sugar mixture and stir until smooth; spread into a glass baking dish.\nRefrigerate fudge until firm, at least 30 minutes.\n",
        "picture_link": "UjmesDJdqdm8RUmGl72Rv/AS.A7mo6G"
    },
    {
        "title": "Spanish Omelet",
        "ingredients": [
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup KRAFT Zesty Italian Dressing ADVERTISEMENT",
            "1 pound red potatoes, cooked, finely chopped ADVERTISEMENT",
            "1 (6 ounce) package OSCAR MAYER Smoked Ham, chopped ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 pound VELVEETA®, cut into 1/2-inch cubes ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nCook peppers, onions and garlic in dressing in 10-inch ovenproof skillet on medium heat 5 min., stirring frequently. Add potatoes; cook 5 min., stirring frequently. Remove from heat. Spread potato mixture to evenly cover bottom of skillet; top with ham.\nWhisk eggs and milk until blended; pour over ham. Top with VELVEETA.\nBake 30 min. or until center is set. Sprinkle with cilantro.\n",
        "picture_link": "7ZChwmAN8whSbxDSXAU2dqaXqwpq2cO"
    },
    {
        "title": "Black Forest Ham and Asparagus Bundles",
        "ingredients": [
            "48 fresh 3-inch asparagus tips ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "12 thin slices Black Forest ham, halved crosswise ADVERTISEMENT",
            "4 ounces soft goat cheese ADVERTISEMENT",
            "24 10-inch fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine asparagus tips, water, and kosher salt in a skillet; bring to a boil and cook until asparagus is tender to the bite but still crisp, about 2 minutes. Drain asparagus in a colander and immediately immerse in ice water for several minutes until cold to stop the cooking process. Drain and pat asparagus dry with paper towels.\nPlace a piece of ham on a work surface, curved side of ham towards the top. Put 1/2 teaspoon goat cheese in center of ham and top with 2 asparagus spears, tips pointing to curved side of ham. Fold left and right sides of ham over filling, and tie bundle together with a chive. Repeat with remaining asparagus, ham, goat cheese, and chives.\n",
        "picture_link": "1dRVASMCA2bK3GNZnZQBEL7t6oQcpIq"
    },
    {
        "title": "Date and Almond Couscous",
        "ingredients": [
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 cup pearl (Israeli) couscous ADVERTISEMENT",
            "1 cup chicken broth, or more as needed ADVERTISEMENT",
            "1 cup chopped ham ADVERTISEMENT",
            "1/2 cup chopped pitted dates ADVERTISEMENT",
            "1/2 cup chopped dry-roasted almonds ADVERTISEMENT",
            "1/4 cup chopped pitted green olives ADVERTISEMENT",
            "1/4 cup freshly chopped parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon olive oil in a skillet over medium-low heat; cook and stir onion in the hot oil until lightly browned and very tender, about 30 minutes.\nStir couscous into onion mixture; turn heat to medium. Cook and stir couscous until fragrant and lightly browned, about 5 minutes. Pour broth over couscous mixture and bring to a boil; reduce heat, cover skillet, and simmer until couscous has absorbed all the liquid, 5 to 10 minutes.\nHeat remaining 1 tablespoon olive oil in a small skillet over medium heat; cook and stir ham in the hot oil until lightly browned, 5 to 7 minutes.\nMix ham, dates, almonds, olives, parsley, salt, and pepper into couscous mixture; cook and stir until heated through, 2 to 3 minutes.\n",
        "picture_link": "WFJVpbv24e/2qbLmXHBHbsRbjOSVDpa"
    },
    {
        "title": "Decadent Seafood Chowder",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "1/3 cup flour ADVERTISEMENT",
            "4 cups half-and-half ADVERTISEMENT",
            "1 cup dry vegetable soup mix ADVERTISEMENT",
            "1/2 cup dried onion flakes ADVERTISEMENT",
            "2 tablespoons lemon pepper ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "1 pinch saffron ADVERTISEMENT",
            "1 cup diced salmon ADVERTISEMENT",
            "1 cup diced halibut ADVERTISEMENT",
            "1 cup peeled and deveined shrimp ADVERTISEMENT",
            "1 cup peeled and deveined prawns ADVERTISEMENT",
            "1 cup scallops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter with garlic together in a large pot over medium-high heat. Whisk in flour; cook and stir until mixture makes a paste and is fragrant, about 1 minute. Slowly whisk half-and-half into flour mixture until smooth. Add vegetable soup mix, onion flakes, lemon pepper, thyme, and saffron to half-and-half mixture; cook and stir until mixture thickens, 5 to 10 minutes.\nStir salmon, halibut, shrimp, prawns, and scallops into half-and-half mixture; bring to a simmer, reduce heat to medium-low, and cook, stirring frequently, until seafood is cooked through and chowder is hot, about 30 minutes.\n",
        "picture_link": "YDdVUmhXAqWoiq1CSrzu405dEc2pF6y"
    },
    {
        "title": "IPA Corned Beef",
        "ingredients": [
            "1 (4 pound) corned beef brisket with spice packet ADVERTISEMENT",
            "1 tablespoon spicy brown mustard ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "22 fluid ounces IPA beer (such as Lagunitas® Wilco Tango Foxtrot) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat corned beef with spicy brown mustard and place, fat-side down, into a slow cooker. Add garlic and seasoning packet to corned beef; pour in beer, covering beef completely.\nCook on Low for 8 hours. Remove corned beef from slow cooker and allow to rest for 15 minutes before slicing across the grain.\n",
        "picture_link": "SCpbnhqxS4tPswaM0wUSgQZNg58IjzS"
    },
    {
        "title": "Gluten-Free Pineapple Upside-Down Cake",
        "ingredients": [
            "Fruit Layer: ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup sweet vermouth ADVERTISEMENT",
            "1/2 (14 ounce) can pitted dark sweet cherries, drained and halved ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained well and juice reserved ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon ground star anise ADVERTISEMENT",
            "1 (19 ounce) package gluten-free vanilla cake mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nCombine brown sugar, 1/2 cup butter, and sweet vermouth in a saucepan over low heat; cook and stir until sugar is dissolved, about 5 minutes.\nArrange cherries and spoon pineapple into the bottom of a 9x13-inch baking dish. Pour brown sugar mixture over fruit.\nBeat eggs in a bowl using an electric mixer on medium-low speed until smooth. Add 1/2 cup melted butter, pineapple juice, vanilla extract, and star anise to eggs; beat on medium-low speed until well combined, about 1 minute. Gradually add cake mix, about 1/2 cup at a time, to egg mixture, scraping sides of bowl with a spatula until batter is smooth and fluffy. Pour batter over fruit mixture until evenly spread in dish.\nBake in the preheated oven until cake is golden brown and completely set in the middle, about 1 hour. Cool cake for 15 minutes in the dish. Run a knife along the edge of the cake to loosen. Place a platter over the cake and flip cake onto platter.\n",
        "picture_link": "4n6xweeFCR0OZtop9QkZYHAspDAdrha"
    },
    {
        "title": "Gluten-Free Chocolate Cake with Coconut",
        "ingredients": [
            "3/4 cup cashews ADVERTISEMENT",
            "Crust: ADVERTISEMENT",
            "1/2 cup cashews ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "2 tablespoons agave syrup ADVERTISEMENT",
            "Chocolate Cake: ADVERTISEMENT",
            "3 tablespoons cocoa powder ADVERTISEMENT",
            "3 tablespoons coconut oil ADVERTISEMENT",
            "3 tablespoons agave syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 3/4 cup cashews in a bowl and add enough water to cover; soak for 2 hours. Drain.\nBlend 1/2 cup cashews in a blender until smooth. Stir blended cashews, coconut, and 2 tablespoons agave syrup together in a bowl until smooth; press into a small cake pan.\nBlend soaked cashews in a blender until smooth. Add cocoa powder, coconut oil, and 3 tablespoons agave syrup; blend until smooth. Pour chocolate cake over cashew crust; refrigerate until set, 2 hours to overnight.\n",
        "picture_link": "e9qYKzIykXm/z9Ab3zMrDsgOQqT/gDu"
    },
    {
        "title": "Brownie Pops",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened baking chocolate, chopped ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon brandy-based orange liqueur (such as Grand Marnier®) (optional) ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (1 ounce) square unsweetened baking chocolate, chopped ADVERTISEMENT",
            "1 tablespoon brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 1/2 cups chocolate confectioners' coating ADVERTISEMENT",
            "1/4 cup bittersweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking pan.\nPlace 1/2 cup butter and white sugar in a microwave-safe bowl. Heat in microwave on high until butter is melted, about 1 minute. Stir 2 ounces baking chocolate into butter-sugar mixture until chocolate melts. Stir in eggs; mix well. Add flour, 1 tablespoon orange liqueur, vanilla extract, and salt; stir to combine. Pour batter into the prepared baking dish.\nBake in the preheated oven until the top is dry and the edges have started to pull away from the sides of the pan, 20 to 25 minutes. Remove from oven and cool completely.\nPlace remaining 1/4 cup butter in a large microwave-safe bowl. Heat in microwave on high until melted, about 30 seconds. Stir 1 ounce baking chocolate into melted butter until chocolate melts. Stir in orange liqueur and 1/2 cup confectioners' sugar. Crumble the cooled brownies into the mixture; stir to combine.\nForm brownie mixture into 1-inch balls; arrange on a baking sheet. Refrigerate until firm, about 2 hours. Insert a lollipop stick into each brownie ball.\nMelt chocolate coating and chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Keep warm.\nDip each brownie pop into the chocolate coating, allowing excess chocolate to drip back into the saucepan. Transfer the coated brownie pops onto a baking sheet or set upright into a piece of craft foam. Allow coating to set, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grandma's Swedish Meatballs",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "2 tablespoons grated onion ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix ground beef, bread crumbs, egg, onion, black pepper, nutmeg, and salt together in a bowl; form into small balls. Arrange balls on a baking sheet.\nBake in the preheated oven for 10 minutes. Flip meatballs and continue baking until cooked through, 12 to 15 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "vQu.pouQGpmpyCDCW5jzEVMLgKBM92W"
    },
    {
        "title": "Sweet Southern BBQ Back Ribs",
        "ingredients": [
            "Dry Rub: ADVERTISEMENT",
            "1/3 cup light brown sugar, plus ADVERTISEMENT",
            "1 tablespoon light brown sugar ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 1/2 teaspoons black pepper ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 cup ketchup-based barbecue sauce ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed ADVERTISEMENT",
            "3 tablespoons prepared yellow mustard ADVERTISEMENT",
            "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "About one hour before smoking, make the dry rub. Combine all ingredients in small bowl; mix well.\nBrush thin layer of mustard on both sides of ribs; sprinkle an even coat of dry rub both sides of ribs. Set aside at room temperature for 1 hour.\nHeat charcoal or gas grill for indirect cooking at 250 to 300 degrees F. Add drained wood chips, if using.\nPlace the ribs, meaty side down, over a drip pan and cook for 1 1/2 to 2 hours. Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nMeanwhile, make the sauce. Combine all ingredients in medium saucepan; bring to a simmer until flavors are blended, stirring frequently. Set aside to cool.\nRemove ribs from grill. Double-wrap each rack in heavy-duty aluminum foil. Return wrapped ribs to the grill and cook for 1 1/2 to 2 hours more over indirect heat, until very tender. Add more coals as needed to maintain temperature for a charcoal grill.\nRemove ribs from grill and unwrap. Place ribs over direct heat on grill and brush with sauce. Cook for about 5 minutes until the sauce is set. Turn ribs and repeat with more sauce.\nServe ribs with remaining sauce.\n",
        "picture_link": "ID7U6ZOYLAD6evxSNt.Rf3H3TSbHe4K"
    },
    {
        "title": "Creamy Summer Coleslaw",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 1/2 tablespoons white vinegar ADVERTISEMENT",
            "2 teaspoons sour cream ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper, or to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 pound cabbage, cut into wedges ADVERTISEMENT",
            "2 carrots ADVERTISEMENT",
            "1/4 small onion, chopped, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mayonnaise, sugar, milk, lemon juice, vinegar, sour cream, black pepper, and cayenne pepper together in a small bowl.\nShred cabbage, carrots, and onion in a food processor with grater attachment; place vegetables in a large bowl and stir to combine. Stir mayonnaise mixture into cabbage mixture; cover and refrigerate for at least 2 hours and preferably overnight. Stir coleslaw before serving.\n",
        "picture_link": "AXRyjUS5DvXhS5.9TCwv22QQZP7.6U."
    },
    {
        "title": "Healthy Homemade Ice Cream",
        "ingredients": [
            "1 1/2 cups almond milk ADVERTISEMENT",
            "2 bananas - peeled, sliced, and frozen ADVERTISEMENT",
            "1/2 cup strawberries, sliced and frozen ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend almond milk, frozen bananas, frozen strawberries, and vanilla extract together in a blender until desired consistency is reached. Transfer mixture to a bowl and freeze until solid, about 4 hours.\n",
        "picture_link": "YBsD6YRnSwiD/SBtUAGuD3ApJOvmoFC"
    },
    {
        "title": "Asian Style BBQ St. Louis Ribs",
        "ingredients": [
            "Dry Rub: ADVERTISEMENT",
            "1/2 cup kosher salt ADVERTISEMENT",
            "1/3 cup light brown sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground anise seed or fennel seed ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 racks Smithfield® Extra Tender St. Louis Pork Spareribs, membrane removed ADVERTISEMENT",
            "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional) ADVERTISEMENT",
            "2 cups hoisin barbecue sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "About 30 minutes before smoking, make the dry rub. Combine all rub ingredients in a coffee grinder; grind until smooth. Generously coat both sides of ribs with rub. Set aside at room temperature for 30 minutes.\nHeat charcoal or gas grill for indirect cooking at 275 degrees F. Add drained wood chips, if using.\nPlace the ribs, meaty side up, over a drip pan and cook for 2 hours. Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nRemove ribs from grill. Double-wrap each rack in heavy-duty aluminum foil. Return wrapped ribs to the grill and cook for 2 hours more over indirect heat, until very tender. Add more coals as needed to maintain temperature for a charcoal grill.\nRemove ribs from grill and unwrap. Place ribs over direct heat on grill and brush with barbecue sauce. Cook for about 5 minutes until the sauce is set. Turn ribs and repeat with more sauce.\nServe ribs with remaining barbecue sauce.\n",
        "picture_link": "8idE3lBsmR/ugBXVNlMb4zXnTvbzSpy"
    },
    {
        "title": "Apple and Lentil Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 apples - peeled, cored, and diced ADVERTISEMENT",
            "1/4 cup all-purpose flour, sifted ADVERTISEMENT",
            "10 cups chicken stock ADVERTISEMENT",
            "1 (15 ounce) can lentils, drained and rinsed ADVERTISEMENT",
            "1 teaspoon celery seed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat until hot; stir in onion and apples and cook and stir for 4 minutes. Stir flour into apple mixture; cook and stir for 2 minutes.\nWhisk chicken stock into apple mixture; bring soup to a boil. Stir lentils and celery seed into soup; return mixture to a boil, reduce heat to low, and simmer until apples are tender, about 45 minutes.\n",
        "picture_link": "izgEd.Vns0st4wxLf7jyUf9FVsyC.mq"
    },
    {
        "title": "Easy Tex-Mex Chicken Tacos",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1 (16 ounce) package yellow rice ADVERTISEMENT",
            "5 tablespoons olive oil, divided (optional) ADVERTISEMENT",
            "1 pound boneless chicken, cut into 3/4-inch cubes ADVERTISEMENT",
            "1 (1 ounce) package chicken taco seasoning mix ADVERTISEMENT",
            "1 (16 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 1/2 cups shredded Mexican cheese blend ADVERTISEMENT",
            "1 (4 ounce) can sliced olives ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "12 corn tortillas ADVERTISEMENT",
            "1 tablespoon bacon grease ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan; add rice and 1/4 cup olive oil. Bring liquid back to a boil, reduce heat to medium-low, cover saucepan, and simmer until rice is tender, 20 to 25 minutes.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir chicken and taco seasoning mix until chicken is no longer pink in the center, 5 to 10 minutes. Mix rice, black beans, Mexican cheese blend, olives, and jalapeno pepper into chicken; cook and stir until heated through, about 5 minutes.\nHeat a separate skillet over medium-high heat; warm tortillas in skillet until pliable, 1 to 2 minutes per tortilla.\nFill each tortilla with about 1/2 cup chicken-rice mixture, folding tortilla over filling.\nHeat bacon grease in a skillet over medium heat; fry the filled tortillas until crispy, 2 to 3 minutes per side.\n",
        "picture_link": "NPU0iXwH555er/ZiKnRRTpxdA0gjq9i"
    },
    {
        "title": "Kansas City Style St. Louis Ribs",
        "ingredients": [
            "2 racks Smithfield® Extra Tender St. Louis Pork Spareribs, membrane removed ADVERTISEMENT",
            "Vegetable oil ADVERTISEMENT",
            "1/4 cup favorite barbecue seasoning rub ADVERTISEMENT",
            "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional) ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 (18 ounce) bottle ketchup ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup light molasses ADVERTISEMENT",
            "1 tablespoon chili seasoning blend ADVERTISEMENT",
            "2 teaspoons hickory liquid smoke ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "About one hour before smoking, coat both sides of ribs with a little vegetable oil and sprinkle with barbecue seasoning rub. Set aside at room temperature for 1 hour.\nHeat charcoal or gas grill for indirect cooking at 230 to 250 degrees F. Add drained wood chips, if using.\nPlace the ribs, meaty side down, over a drip pan and cook for 2 hours. Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nRemove ribs from grill. Double-wrap each rack in heavy-duty aluminum foil. Return wrapped ribs to the grill and cook for 1 1/2 to 3 hours more over indirect heat, until very tender. Add more coals as needed to maintain temperature for a charcoal grill.\nMeanwhile, make the sauce. Combine all ingredients in small saucepan. Bring to a boil over medium-high heat; reduce heat and simmer 15 minutes, stirring frequently.\nRemove ribs from grill and unwrap. Place ribs over direct heat on grill and brush with Kansas City-style barbecue sauce. Cook for about 5 minutes until the sauce is set. Turn ribs and repeat with more sauce.\n",
        "picture_link": "fCnyKuvl.DS18rrMtbjDvEOOt0PYdUG"
    },
    {
        "title": "Manju (Japanese Sweet Bean Paste Cookies)",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "1 (18 ounce) can koshi an (sweetened red bean paste) ADVERTISEMENT",
            "1/4 cup evaporated milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 2 baking sheets.\nBeat sugar and butter with an electric mixer in a large bowl until smooth and creamy. Beat eggs, 1 at a time, into creamed butter until smooth; add vanilla extract and beat well.\nSift flour and baking powder together in a bowl. Gradually stir flour mixture into butter mixture, mixing well after each addition, until dough is smooth.\nGenerously flour your hands. Make walnut-size balls from the dough and press into 4-inch circles on a floured surface, making the circles thicker in the center and thinner on the edges. Spoon about 1 1/2 teaspoons koshi an in the center of each dough circle. Gather the edges together and pinch dough around the filling until sealed. Place dough balls, pinched-side down, on the prepared baking sheets about 2 inches apart. Brush dough balls with evaporated milk.\nBake in the preheated oven until tops are lightly browned, about 15 minutes.\n",
        "picture_link": "KnaOnali22dolIR/RZo9a9f0x6RyX7m"
    },
    {
        "title": "Rice Pudding with Rose Water",
        "ingredients": [
            "3 1/2 cups whole milk, or more as needed ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup white rice ADVERTISEMENT",
            "1 1/2 teaspoons rose water ADVERTISEMENT",
            "1/2 cup blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring milk and sugar to a boil in a saucepan; add rice and stir until mixture comes to a boil again. Reduce heat to low and cook until mixture becomes very creamy, about 45 minutes. Add more milk if mixture becomes too thick.\nPour rose water into mixture and stir until bubbles appear on the surface. Remove saucepan from heat and cool slightly. Pour rice pudding into a bowl and refrigerate until chilled, at least 1 hour. Serve pudding cold with almonds sprinkled on top.\n",
        "picture_link": "vm1IEdntr.3ON.a.ZzWVUPlgISDhES2"
    },
    {
        "title": "Lemon Pepper Rubbed Back Ribs",
        "ingredients": [
            "Dry Rub: ADVERTISEMENT",
            "3 tablespoons light brown sugar ADVERTISEMENT",
            "2 tablespoons sea salt ADVERTISEMENT",
            "1 tablespoon ground white pepper ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "2 teaspoons cayenne pepper ADVERTISEMENT",
            "1 1/2 teaspoons dried lemon peel ADVERTISEMENT",
            "1/2 teaspoon ground apple pie spice ADVERTISEMENT",
            "2 racks Smithfield® Extra Tender Pork Back Ribs, membrane removed ADVERTISEMENT",
            "Vegetable oil ADVERTISEMENT",
            "Handful hickory or apple wood chips for smoking, soaked in water and drained (optional) ADVERTISEMENT",
            "3/4 cup apple juice, in a spray bottle (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "About one hour before smoking, make the dry rub. Combine sugar, salt, white pepper, onion powder, cayenne pepper, lemon peel and apple pie spice in small bowl; mix well. Coat both sides of ribs with a little vegetable oil and sprinkle with lemon pepper rub. Set aside at room temperature for 1 hour.\nHeat charcoal or gas grill for indirect cooking at 230 to 250 degrees F. Add drained wood chips, if using.\nPlace the ribs, meaty side down, over a drip pan and cook for 2 hours. If desired, spray both sides of ribs with apple juice. Add about 12 coals to a charcoal grill every 45 minutes or so to maintain the heat.\nRemove ribs from grill. Double-wrap each rack in heavy-duty aluminum foil. Return wrapped ribs to the grill and cook for 1 1/2 to 2 hours more over indirect heat, until very tender. Add more coals as needed to maintain temperature for a charcoal grill.\n",
        "picture_link": "no5uFD0wA/Z30YSBXOaoO1kkVikA6yi"
    },
    {
        "title": "Scorpion Lemonade",
        "ingredients": [
            "14 fluid ounces water ADVERTISEMENT",
            "3 fluid ounces lemon juice ADVERTISEMENT",
            "1 tablespoon agave nectar ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, lemon juice, agave nectar, and cayenne pepper in a bottle or jar with a lid; cover and shake well. Refrigerate until chilled.\n",
        "picture_link": "kLiY5Ys88V7zm8huEOSFkNxNqxFwY2e"
    },
    {
        "title": "Brussels Sprout Pakora",
        "ingredients": [
            "1 (16 ounce) package Brussels sprouts ADVERTISEMENT",
            "1 cup chickpea flour ADVERTISEMENT",
            "3 tablespoons rice flour ADVERTISEMENT",
            "1 tablespoon ground coriander ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup water, or more as needed ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "2 chile peppers, seeded and diced ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add Brussels sprouts, cover, and steam until tender, about 5 minutes.\nSift chickpea and rice flour together in a large bowl; mix in coriander, cumin, baking powder, salt, and black pepper. Whisk in enough water until pakora batter is the consistency of pancake batter. Stir in Brussels sprouts, cilantro, and chile peppers until combined.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nScoop a few tablespoons of pakora batter at a time into the hot oil. Fry until golden, about 5 minutes.\n",
        "picture_link": "PurvbfkP0t9YV8BWEjHv4EBK0GWf0Ia"
    },
    {
        "title": "Red Velvet Cake with Beets",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 cup pureed cooked beets ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon red food coloring ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon vinegar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch cake pan with parchment paper.\nSift flour and baking powder together in a large bowl.\nWhisk sugar, buttermilk, beets, oil, eggs, cocoa powder, red food coloring, vanilla extract, vinegar, baking soda, and salt together in a large bowl. Add flour mixture gradually to the bowl, stirring after each addition just until incorporated. Pour batter into prepared pan. Tap pan firmly to settle the batter and remove large bubbles.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 35 minutes.\n",
        "picture_link": "iqaGGPBIw0vjL7xsYS7k.3DZtr7acf2"
    },
    {
        "title": "Bacon Fries",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (28 ounce) package frozen steak fries ADVERTISEMENT",
            "1 (16 ounce) package bacon slices, halved ADVERTISEMENT",
            "1/4 teaspoon seasoned salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 475 degrees F (245 degrees C). Spray a large baking sheet with cooking spray.\nWrap half a bacon slice around each French fry and place seam side-down on the baking sheet about 1-inch apart.\nBake in the preheated oven until bacon is browned and crisp, about 30 minutes. Remove from oven and sprinkle with seasoned salt. Transfer to serving plate.\n",
        "picture_link": "k.d/.j7pNEEHMomiPNxjYZuYECURmhG"
    },
    {
        "title": "Cocoa Tea Mix Recipe",
        "ingredients": [
            "1 1/2 cups boiling water ADVERTISEMENT",
            "1 Earl Grey tea bag ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1 1/2 tablespoons hot cocoa mix ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour boiling water into a mug and steep tea bag, about 2 minutes. Remove tea bag; add milk, hot cocoa mix, and sugar. Stir until well-blended, about 20 seconds.\n",
        "picture_link": "KAR2UuJUPPr20DpvxEb5yS4fRW868.S"
    },
    {
        "title": "Clean-Eating Potato and Corn Chowder",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 1/2 ribs celery, diced ADVERTISEMENT",
            "3 pounds Yukon Gold potatoes, peeled and diced ADVERTISEMENT",
            "1 (16 ounce) package frozen sweet corn ADVERTISEMENT",
            "1 cube vegetable bouillon (such as Rapunzel®) ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons whole wheat pastry flour ADVERTISEMENT",
            "2 1/2 cups unsweetened almond milk ADVERTISEMENT",
            "1 1/2 cups chicken stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a Dutch oven over medium heat. Stir in onion and celery; cook until translucent and soft, 5 to 7 minutes. Add potatoes, cover, and cook until beginning to soften, about 5 minutes. Stir in corn, bouillon, marjoram, parsley, a generous amount of salt, and pepper; cover and cook until corn is warmed through, about 2 minutes. Stir in flour; cover and cook 2 minutes more.\nStir almond milk and chicken stock into vegetable mixture; cover and bring to a boil. Lower heat and simmer until potatoes are tender and soup is thickened, 15 to 20 minutes. Remove from heat and cool slightly, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caramelized Onion Dip",
        "ingredients": [
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "1 large onion, thinly sliced ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons white sugar, or as needed ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over low heat; stir in onion. Cook and stir until onion is soft but not browned, 20 to 30 minutes. Increase heat to high, add butter, and sprinkle sugar over onions. Cook and stir frequently until onion is very tender and dark brown, 8 to 10 minutes more. Remove from heat and cool to room temperature.\nCombine sour cream, yogurt, and mayonnaise together in a bowl; season with salt and black pepper. Mince cooled onions on a cutting board; stir onions into sour cream mixture. Store in refrigerator to allow flavors to blend, at least 1 hour.\n",
        "picture_link": "PTcPFNQY/3X0n0soTwbTSxZ.G6KDTV2"
    },
    {
        "title": "Japanese-Style Crispy Fried Pork Bowl (Tonkatsu Donburi)",
        "ingredients": [
            "2/3 cup prepared dashi stock ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "2 teaspoons mirin (Japanese sweet wine) ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 (3 ounce) fried breaded pork chops, sliced into long strips ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 1/2 cups cooked short-grain rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix dashi, sugar, mirin, soy sauce, and salt together in a small bowl.\nHeat vegetable oil in a small skillet over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Stir in dashi mixture. Lay pork slices carefully on top of the onions. Drizzle eggs around the slices. Cover skillet and cook until eggs are set, about 2 minutes.\nDivide rice between 2 bowls. Top each with half the onions, eggs, and pork slices.\n",
        "picture_link": "MkF43lK4oZwasXx6CjVfUbLXOk./NiC"
    },
    {
        "title": "Lemon Verbena Mint Detox Tea",
        "ingredients": [
            "1 cup boiling water ADVERTISEMENT",
            "1 sprig fresh lemon verbena (about 10 leaves) ADVERTISEMENT",
            "1 sprig fresh mint (about 15 leaves) ADVERTISEMENT",
            "1 teaspoon honey, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour boiling water over verbena and mint sprigs; steep until desired flavor is reached, 3 to 4 minutes. Stir in honey.\n",
        "picture_link": "lTcwkknbw8tg5zJORZ9TVQc1y.Zs61S"
    },
    {
        "title": "Cheesy Cauliflower and Broccoli Gratin",
        "ingredients": [
            "1 head cauliflower, cored and cut into florets ADVERTISEMENT",
            "1 head broccoli, cut into florets ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/4 cups skim milk ADVERTISEMENT",
            "5 ounces shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 teaspoons spicy mustard ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1 pinch nutmeg ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup crumbled tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring salted water to a boil in a saucepan. Cook cauliflower until easily pierced with a fork, about 5 minutes. Transfer cauliflower to a baking dish with slotted spoon. Cook broccoli until easily pierced with a fork, about 2 minutes. Transfer broccoli to baking dish with slotted spoon.\nMelt butter in a saucepan over medium heat. Add flour and whisk until beginning to brown, about 2 minutes. Whisk in milk and bring to a boil. Simmer, whisking constantly, until sauce is smooth and thickened, about 2 minutes more. Remove from heat; gradually whisk in 4 ounces Cheddar cheese. Stir in parsley, garlic, mustard, red pepper flakes, and nutmeg. Season with salt and pepper.\nPour sauce over cauliflower and broccoli; toss to coat. Combine tortilla chips and remaining Cheddar cheese in a small bowl; sprinkle over cauliflower and broccoli.\nBake in preheated oven for 10 minutes. Increase heat to broil; bake until bubbly and brown, about 5 minutes more.\n",
        "picture_link": "77zwV2eulfY9f521BQBBnCNAZUtEVra"
    },
    {
        "title": "Gluten Free Penne with Cajun Chicken",
        "ingredients": [
            "1 (12 ounce) box Barilla Gluten Free Penne ADVERTISEMENT",
            "4 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "4 boneless, skinless chicken thighs ADVERTISEMENT",
            "1 Vidalia onion, cut julienne style ADVERTISEMENT",
            "1 red bell pepper, cut julienne style ADVERTISEMENT",
            "6 domestic mushrooms, quartered ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/2 cup Parmesan cheese, grated ADVERTISEMENT",
            "Salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil.\nMeanwhile in a hot skillet, brown the chicken in olive oil over high heat for approximately 5 minutes. Add onion, bell pepper, mushrooms, garlic and Cajun seasoning and saute for 3 additional minutes. Stir in wine then season with salt and pepper; reduce liquid by half.\nAdd cream and bring to simmer.\nMeanwhile, cook pasta according to package directions.\nDrain and toss with sauce and stir in cheese before serving.\n",
        "picture_link": "AO4ZbvfZsrD1yBs44ZBpVyfGUqNJPCi"
    },
    {
        "title": "Easy Dill Hollandaise Sauce",
        "ingredients": [
            "1/4 cup unsalted butter ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 teaspoon chopped fresh dill ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 tablespoon boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a microwave-safe glass or ceramic bowl in microwave at 15-second intervals, stirring after each interval to prevent popping, 1 to 2 minutes. Whisk lemon juice, salt, and dill into melted butter; cook in microwave an additional 10 seconds. Whisk egg yolks into butter mixture vigorously until smooth, about 30 seconds. Whisk boiling water in gradually until smooth and creamy, about 1 minute more.\n",
        "picture_link": "gtPMCv0ooK4CiC9AFA50OR/6a2PTpNe"
    },
    {
        "title": "Orange Hollandaise Sauce",
        "ingredients": [
            "4 egg yolks ADVERTISEMENT",
            "6 tablespoons fresh orange juice, divided ADVERTISEMENT",
            "3/4 cup butter, cut into 1/4-inch slices, at room temperature ADVERTISEMENT",
            "1/8 teaspoon salt, or to taste ADVERTISEMENT",
            "1/8 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place egg yolks and 1/4 cup orange juice in a heatproof bowl or in a double boiler set over simmering water, whisking constantly until warm and just starting to thicken, 1 to 2 minutes. Add butter, 1 slice at a time, whisking each addition until fully incorporated. Continue to whisk until sauce is thickened, 2 to 3 minutes.\nRemove from heat and season with salt and black pepper. Thin sauce with remaining 2 tablespoons orange juice to reach desired consistency.\n",
        "picture_link": "gQfyiimhxaWwpDwO3uQd2KFkvJ12CTC"
    },
    {
        "title": "Bircher Muesli with Kefir",
        "ingredients": [
            "1/2 cup rolled oats ADVERTISEMENT",
            "6 tablespoons plain kefir ADVERTISEMENT",
            "1/2 apple, grated ADVERTISEMENT",
            "4 strawberries, diced ADVERTISEMENT",
            "1 teaspoon honey, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oats and kefir in a small bowl. Cover with plastic wrap and refrigerate until oats soak up the kefir and thicken, 8 hours to overnight.\nStir apple and strawberries into the oats. Add honey to reach desired level of sweetness.\n",
        "picture_link": "5WwOMpMNaWegNGQ0qQwp2sOZwKd/8GC"
    },
    {
        "title": "Coconut Coffee Muffins",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2/3 cup strong brewed coffee, cooled ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "1/2 cup coconut flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup shredded unsweetened coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray 6 muffin cups with cooking spray.\nWhisk coffee, eggs, and coconut oil together in a bowl. Combine coconut flour, brown sugar, and shredded coconut together in a separate bowl. Stir coffee mixture into flour mixture until batter is just combined; spoon into prepared muffin cups.\nBake in the the preheated oven until a toothpick inserted in the center comes out clean, about 20 minutes.\n",
        "picture_link": "NfXs6ySeMHJfrvDdzlGUt7n6aWSh.q2"
    },
    {
        "title": "Cauliflower Patties",
        "ingredients": [
            "1 head cauliflower, broken into florets ADVERTISEMENT",
            "1 cup almond flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to boil in a saucepan. Add cauliflower; boil until tender, about 15 minutes. Strain cauliflower, transfer to a bowl, and mash with a fork.\nStir almond flour, eggs, cayenne pepper, salt, and black pepper into cauliflower until well-combined; form into 1/4-cup sized patties.\nHeat 1 teaspoon olive oil in a skillet over medium heat. Fry patties in a single layer until golden brown, about 5 minutes per side. Repeat with remaining patties and olive oil.\n",
        "picture_link": "pi9WB70lgeUMOd7dove5t.4klia6mDO"
    },
    {
        "title": "Beer Braised Cabbage",
        "ingredients": [
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1/2 cup light-bodied beer ADVERTISEMENT",
            "1 tablespoon whole grain mustard ADVERTISEMENT",
            "1/2 teaspoon minced fresh thyme ADVERTISEMENT",
            "1 small head cabbage - halved, cored, and thinly sliced ADVERTISEMENT",
            "2 teaspoons cider vinegar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium-high heat. Add onion; cook until softened, about 5 minutes. Stir in beer, mustard, and thyme. Lower heat and simmer until slightly thickened, about 2 minutes. Add cabbage and vinegar. Cover and cook, stirring occasionally, until cabbage is wilted and tender, about 8 minutes. Season with salt and black pepper.\n",
        "picture_link": "pDvZIfMCU4kyQ/F55gD47eoNvn7oPCi"
    },
    {
        "title": "Lemon, Ginger, and Cinnamon Flavored Water",
        "ingredients": [
            "2 lemons ADVERTISEMENT",
            "3 inch piece fresh ginger, or more to taste ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "1 gallon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash lemons and ginger. Slice lemons; peel and thinly slice ginger. Place lemon slices, ginger slices, and cinnamon sticks in a large pitcher; fill container with water. Store in refrigerator.\n",
        "picture_link": "X83V8cYNKLxxFE6Iywbv4pGI830qUvi"
    },
    {
        "title": "Rendang Gaging (Beef Stew)",
        "ingredients": [
            "Spice Paste: ADVERTISEMENT",
            "5 shallots, halved ADVERTISEMENT",
            "5 stalks lemongrass, bottom thirds only, peeled ADVERTISEMENT",
            "5 cloves garlic ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root ADVERTISEMENT",
            "1 (1 inch) piece galangal ADVERTISEMENT",
            "5 dried red chile peppers, or more to taste ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons curry powder (optional) ADVERTISEMENT",
            "2 pounds beef stew meat, cut into 1-inch pieces ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "2 teaspoons brown sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place shallots, lemongrass, garlic, ginger, galangal, and chile peppers in a food processor; process spices into a coarse paste.\nHeat vegetable oil in a large pot over medium heat. Add spice paste; cook and stir until sizzling and fragrant, 3 to 5 minutes. Stir in curry powder and cook until fragrant, about 1 minute. Add beef; stir to coat with spices, about 3 minutes. Pour in coconut milk. Cover and simmer stew until beef is tender, about 30 minutes.\nStir vinegar, sugar, and salt into the pot. Continue to cook, covered, until sauce reduces and thickens, about 30 minutes more.\n",
        "picture_link": "Tvskqv9epVhvzKt2J4LJ2tkrO5PENJ."
    },
    {
        "title": "Beefy Broccoli & Cheddar Burritos",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (5.7 ounce) package Knorr® Rice Sides™ - Cheddar Broccoli ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "8 (10 inch) burrito-size flour tortillas ADVERTISEMENT",
            "1 (16 ounce) jar salsa, divided ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 green onions, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nCook ground beef in 12-inch nonstick skillet over medium-high heat, stirring occasionally, until beef is done, about 5 minutes. Remove beef mixture and set aside.\nStir Knorr(R) Rice Sides(TM) - Cheddar Broccoli, water and beans into same skillet and bring to a boil over high heat. Reduce heat to medium and cook covered 7 minutes or until rice is tender. Stir in beef mixture. Remove from heat and let stand 2 minutes. Stir in 1/2 cup salsa and 1/2 cup cheese.\nSpoon about 3/4 cup rice mixture onto each tortilla; roll-up.\nEvenly spread 1/2 cup salsa in bottom of 13 x 9-inch greased baking dish. Arrange burritos, seam-side-down. Spoon remaining salsa down center of burritos, then sprinkle with remaining 1/2 cup cheese. Cover tightly with aluminum foil and bake 25 minutes or until heated through. Garnish with green onions.\n",
        "picture_link": "iUHAIUuvsQ2489omBAkhBd2meS.AgXu"
    },
    {
        "title": "Quaglie Alla Melagrana (Quail with Pomegranate)",
        "ingredients": [
            "1 1/2 cups pomegranate seeds ADVERTISEMENT",
            "1/2 cup pomegranate juice ADVERTISEMENT",
            "1/2 cup orange juice, or as needed ADVERTISEMENT",
            "1/2 cup Marsala wine, or as needed ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "2 tablespoons grated orange zest ADVERTISEMENT",
            "12 quail, dressed ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "12 slices pancetta (Italian unsmoked cured bacon) ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "2 oranges, sectioned ADVERTISEMENT",
            "1/2 cup pomegranate seeds, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together 1 1/2 cups pomegranate seeds, pomegranate juice, orange juice, Marsala, mint, and orange zest in a very large glass or ceramic bowl. Add the quail, and turn to evenly coat. Cover the bowl with plastic wrap, and marinate at room temperature for 2 hours.\nRemove the quail from the marinade, and pat dry with paper towels. Season the quail inside and out with salt and pepper. Strain the marinade, reserving the liquid, and stuff the quail with the pomegranate seeds. Wrap each quail with 1 slice of pancetta.\nPreheat an oven to 400 degrees F (200 degrees C).\nHeat the olive oil in a large skillet over medium-high heat. Cook the quail 4 at a time in the hot oil until golden brown on all sides, 5 to 8 minutes total. Place the quail into a large roasting pan in a single layer; set aside. Pour the chicken stock and reserved liquid marinade into the skillet, and bring to a boil. Cook and stir until the sauce has reduced to half its original volume. Pour the sauce over the quail.\nBake the quail in the preheated oven until no longer pink at the bone and the juices run clear, 10 to 15 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Pour the juices from the baking dish back into the skillet; cover the quail with aluminum foil, and keep warm. Taste the juices, and add additional orange juice and Marsala wine if desired. Stir in the orange segments, and bring to a boil over medium-high heat. Cook a few minutes until hot. Pour the sauce and orange segments over the quail, and sprinkle with 1/2 cup of pomegranate seeds to serve.\n",
        "picture_link": "VlSiBBcpCUJFSTVxdj1tW1l0N.GnNHC"
    },
    {
        "title": "Miso Salmon (Sake Misozuke) with Spinach Sauce",
        "ingredients": [
            "1 1/2 pounds salmon fillet, cut into 4 portions ADVERTISEMENT",
            "5 teaspoons salt ADVERTISEMENT",
            "1 cup white miso paste ADVERTISEMENT",
            "1/4 cup sake ADVERTISEMENT",
            "1/4 cup mirin (Japanese sweet wine) ADVERTISEMENT",
            "1/4 pound spinach leaves ADVERTISEMENT",
            "1 tablespoon water, or as needed ADVERTISEMENT",
            "1/2 cup white miso paste ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "2 tablespoons sake ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season salmon fillets with salt. Cover and refrigerate for 1 hour.\nWipe the excess salt from the salmon fillets, and wrap the fillets with 2 layers of cheesecloth. Mix 1 cup miso, 1/4 cup sake, and mirin together in a bowl. Spread both sides of the wrapped fillets with the miso mixture. Place the salmon in an air-tight container, and refrigerate for at least 5 hours, or overnight.\nHeat a small saucepan of water over medium-high heat. Add the spinach, and cook until wilted, 1 to 2 minutes. Drain in a colander, and allow to cool. Place spinach in a food processor. Process until smooth, adding water if the spinach becomes too dry. Set aside.\nMix the remaining 1/2 cup of miso with sugar, egg yolks, and 2 tablespoons sake in the top of a double boiler over barely simmering water, stirring frequently and scraping down the sides with a rubber spatula until thickened. Set aside to cool, then stir in the pureed spinach.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source. Lightly grease a baking sheet. Unwrap the cheesecloth, and scrape off excess miso from the salmon fillets. Arrange fillets on the prepared baking sheet.\nBroil in the preheated oven until the salmon is golden, about 4 minutes. Flip the fillet over, then brush with the spinach sauce. Continue broiling until the salmon is cooked through and easily flaked with a fork, about 4 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Fruit Basket Cobbler",
        "ingredients": [
            "2 cups sliced fresh peaches ADVERTISEMENT",
            "2 cups sliced fresh nectarines ADVERTISEMENT",
            "2 cups pitted and quartered plums ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1 cup currant jelly ADVERTISEMENT",
            "1/2 teaspoon apple pie spice ADVERTISEMENT",
            "1/8 teaspoon white pepper ADVERTISEMENT",
            "1 (16.3 ounce) can refrigerated flaky biscuits (such as Pillsbury Grands!®) ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray an 8x13-inch baking dish with cooking spray.\nIn a large bowl, lightly mix together the peach, nectarine, and plum slices until well mixed, and toss with the cornstarch to dust the fruit. Pour in the currant jelly, apple pie spice, and white pepper, and lightly mix again with your hands to coat the fruit with the jelly and seasonings. Spread the fruit into the prepared baking dish.\nPop open the can of biscuits, and cut them in half. Arrange the biscuit dough halves on top of the fruit. Mix the sugar and cinnamon in a small bowl, and sprinkle the mixture evenly on the biscuit dough.\nBake in the preheated oven until the biscuits are golden brown, 20 to 25 minutes. Allow to cool on a rack for at least 20 minutes to let the dish set up.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Strawberry-Pineapple Smoothie II",
        "ingredients": [
            "1/2 cup apple juice ADVERTISEMENT",
            "2 tablespoons pineapple juice ADVERTISEMENT",
            "1/2 cup low-fat strawberry yogurt ADVERTISEMENT",
            "1/4 cup pineapple chunks, drained ADVERTISEMENT",
            "3/4 cup frozen strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the apple juice and pineapple into a blender; add the yogurt, pineapple chunks, and frozen strawberries and blend until smooth.\n",
        "picture_link": "idR.ZEjHpnIqLQouTgQIzmxCAQfvw9W"
    },
    {
        "title": "Peanut Sesame Rib-Eye Steak",
        "ingredients": [
            "4 stalks lemon grass, coarsely chopped ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup fish sauce ADVERTISEMENT",
            "1/4 cup rice wine vinegar ADVERTISEMENT",
            "1 teaspoon dark soy sauce ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon Asian (toasted) sesame oil ADVERTISEMENT",
            "4 (8 ounce) beef rib eye steaks (thick-cut) ADVERTISEMENT",
            "1/2 cup chopped peanuts ADVERTISEMENT",
            "1/2 cup black sesame seeds ADVERTISEMENT",
            "1/4 cup sea salt ADVERTISEMENT",
            "1/4 cup crushed black peppercorns ADVERTISEMENT",
            "1 tablespoon vegetable oil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the lemon grass, 1/4 cup vegetable oil, fish sauce, rice wine vinegar, dark soy sauce, sugar, and sesame oil into the work bowl of a food processor, and process until the mixture forms a paste. Coat both sides of the steaks with the marinade paste, and refrigerate, covered, for 2 to 3 hours.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nIn a bowl, combine peanuts, sesame seeds, sea salt, and pepper until thoroughly mixed.\nRemove the steaks from the marinade, and discard any remaining marinade. Pat the steaks very dry with paper towels for good charring. Rub each steak with about 3/4 teaspoon of vegetable oil. Sprinkle the peanut mixture generously over both sides of each steak, and press the spices into the meat.\nGrill on the preheated grill until the steaks show grill marks, start to become firm, and are reddish-pink and juicy in the center, 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Let the steaks rest at least 5 minutes before slicing.\n",
        "picture_link": "gXilKGqWY/C.ZqJCgEBc4hfi7tAYK3G"
    },
    {
        "title": "Dad's Potato Salad",
        "ingredients": [
            "5 pounds potatoes, unpeeled ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "1 (16 ounce) package uncooked spiral pasta ADVERTISEMENT",
            "1 (16 ounce) jar dill pickles, chopped (reserve juice) ADVERTISEMENT",
            "2 bunches green onions, chopped ADVERTISEMENT",
            "3 cups mayonnaise, or to taste ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1/4 cup dill pickle juice, or as needed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a large pot and cover with salted water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Allow the potatoes to cool.\nWhile potatoes are cooking, place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel once cold.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the spiral pasta, and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink, rinse with cold water, and let cool.\nPeel the potatoes. Chop potatoes and hard-cooked eggs into bite-size pieces in a large bowl. Mix in the cooked pasta, dill pickles, and green onions. In a bowl, stir together the mayonnaise, Worcestershire sauce, enough dill pickle juice to make a creamy dressing, and salt and pepper to taste. Pour the dressing over the potato mixture, and toss lightly to coat all ingredients with dressing. Chill the salad until cold, at least 30 minutes.\n",
        "picture_link": "RXZKS3SMBDbCWUCfuET8F8Wz.XvlNHm"
    },
    {
        "title": "Red, White, and Bull",
        "ingredients": [
            "1 (750 milliliter) bottle champagne, chilled ADVERTISEMENT",
            "1 (8.3 ounce) can citrus flavored energy drink (e.g. Red Bull™) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the champagne and energy drink into a large pitcher. Stir to mix, pour into glasses, and serve.\n",
        "picture_link": "ahqgREGACdyJbwHYw379SWnFd8bXaDK"
    },
    {
        "title": "Fuzzy Moguai",
        "ingredients": [
            "6 1/2 fluid ounces sweet and sour mix ADVERTISEMENT",
            "4 fluid ounces mandarin flavored vodka ADVERTISEMENT",
            "4 fluid ounces orange liqueur ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the sweet and sour mix, vodka and orange liqueur in a shaker or large glass. Stir, and pour into two glasses with ice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pomegin",
        "ingredients": [
            "2 ice cubes ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger gin ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger pomegranate juice ADVERTISEMENT",
            "4 fluid ounces tonic water ADVERTISEMENT",
            "1 wedge lime ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ice cubes in a small glass. Pour in gin, pomegranate juice, and tonic water. Stir, and garnish with lime.\n",
        "picture_link": "JLxgs4Z2aMcfU7cKMicMGi6ObtIr3O."
    },
    {
        "title": "Oregano-Flavored Feta",
        "ingredients": [
            "1 1/4 cups crumbled feta cheese ADVERTISEMENT",
            "4 ounces cream cheese ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "Ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1 cup feta in the work bowl of a food processor; process until fine-textured. Add cream cheese, oregano and pepper; process until smooth. Scrape into a bowl; stir in remaining feta. Transfer to a serving bowl or storage container.\n",
        "picture_link": "gdrRokc3vQdKGXlqx6IWLBHffzX2FrS"
    },
    {
        "title": "Cured Olives",
        "ingredients": [
            "4 pounds fresh ripe olives ADVERTISEMENT",
            "10 cups water ADVERTISEMENT",
            "4 tablespoons kosher salt ADVERTISEMENT",
            "2 lemons, sliced ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "2 hot chile peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse olives and soak overnight in cold water. Drain, and make a small slit in each olive, or you can smash them slightly.\nPack the olives into sterile pint jars. Slice chile peppers into rings, and place one into each jar. Place a lemon slice into each jar.\nStir together the water and salt until salt is completely dissolved. Pour over the olives in the jar, leaving about 1/2 inch of space at the top. Pour olive oil into the jars to within 1/4 inch of the top. Cover with lids and seal. Let the olives cure in the refrigerator for two weeks before tasting. If the olives are bitter, let them cure for another week.\n",
        "picture_link": "wN15EZuGf.ZimlxtxD9RXUFLEDESUsa"
    },
    {
        "title": "Kim's Salsa",
        "ingredients": [
            "1 (28 ounce) can whole tomatoes, chopped and liquid reserved ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "3/4 cup finely chopped jalapeno peppers ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 cup red wine vinegar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the tomatoes, tomato paste, onion, green pepper, garlic, jalapenos, sugar, chili powder, vinegar, salt, and cumin in a large saucepan. Bring mixture to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the salsa is thickened and is noticeably darker in color, at least two hours. Cool and store it in the refrigerator for up to two weeks or in the freezer for three months.\n",
        "picture_link": "FOfZ9vg.MLB8UytPnbMlAz/Nx/iYmPy"
    },
    {
        "title": "Raspberry Liqueur Valentine Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon lemon extract ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 egg white, room temperature ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk, room temperature ADVERTISEMENT",
            "2 tablespoons raspberry flavored liqueur ADVERTISEMENT",
            "1 tablespoon cherry flavored Jell-O® mix ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, beat together the butter, shortening, and 1 cup sugar until smooth and creamy; then add eggs, vanilla, and lemon extract. In a large bowl, mix together flour, salt, and baking powder. Make a well in the middle, and pour creamy mixture into it, folding the dry into the wet until mixed. Stir in 2 tablespoons milk at the end. To make rolling easier, you may cover and refrigerate anywhere from 1 hour up to a few days.\nPreheat oven to 350 degrees F (175 degrees C). On a lightly floured surface, roll out dough to 1/8 inch thickness. Use a heart-shaped cookie cutter to cut shapes out of dough. Place cookies 2 inches apart on a baking sheet.\nBake in preheated oven for 6 to 10 minutes. Slightly browned is OK, but not necessary. Remove from baking sheets to wire racks to cool.\nMeanwhile, in a medium bowl, beat egg white with an electric mixer until frothy but not stiff. Gradually beat in 1 1/2 cups sugar, then 1/8 cup milk. Mix in raspberry liqueur and cherry-flavored gelatin. Gradually beat in remaining 1 1/2 cups sugar and pinch of salt, mixing until the icing looks about like marshmallow fluff, not quite stiff enough to stand in peaks. Spread icing on top of cookies.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Panellets - Catalan Potato Cookies",
        "ingredients": [
            "1 pound small potatoes, scrubbed ADVERTISEMENT",
            "1 cup almonds ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a saucepan with enough water to cover. Bring to a boil, and cook until tender, 20 to 30 minutes. When done, you can stab them with a fork, and they will fall off easily. Drain, cool slightly, and peel.\nPreheat the oven to 350 degrees F (175 degrees C).\nPlace 1 cup of almonds into a food processor, and grind to a fine powder. Add sugar to almonds, and process to mix. Transfer to a medium bowl. Add potatoes to the almond mixture, and mash together until it becomes a very thick paste. Roll into 1 inch balls, and roll the balls in chopped almonds. Place cookies on a baking sheet, and brush with egg white.\nBake for 10 to 15 minutes in the preheated oven, until the tops are brown. Gently remove from the baking sheets, and cool on a plate in the refrigerator. Serve cold. They are supposed to be squishy when you eat them.\n",
        "picture_link": "Zuz0hhkwzk7YRaWM18I2Gy592tRmPmy"
    },
    {
        "title": "Mango Dream",
        "ingredients": [
            "3 (1.5 fluid ounce) jiggers mango nectar ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger rum ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger triple sec ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a cocktail shaker or glass, shake or mix the mango nectar, rum, and triple sec. Serve with ice in a martini glass.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Oatmeal Cream Cheese Patties",
        "ingredients": [
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1 cup uncooked rolled oats ADVERTISEMENT",
            "1 tablespoon soy sauce (optional) ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, mix the cream cheese, walnuts, onion, eggs, oats, and soy sauce. Form into patties.\nHeat the oil in a skillet over medium heat, and cook the patties 2 minutes on each side, just until firm.\nPlace the patties in a baking dish. Pour in the cream of mushroom soup.\nBake 1 hour in the preheated oven.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pasta and Fresh Cilantro Crunchy Stuff",
        "ingredients": [
            "4 bunches cilantro leaves ADVERTISEMENT",
            "2 bunches fresh basil, stems removed ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "24 ounces freshly grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "salt and pepper, to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 pounds crimini mushrooms, sliced ADVERTISEMENT",
            "1 (8 ounce) jar sun-dried tomatoes packed in oil, drained and chopped ADVERTISEMENT",
            "3 (16 ounce) jars Alfredo pasta sauce ADVERTISEMENT",
            "2 (16 ounce) packages fusilli pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a blender or food processor, puree the cilantro, basil, and 3 cloves of garlic until minced very fine. Thoroughly combine the herb mixture in a large bowl with the Parmesan, and 1/4 cup of olive oil; season to taste with salt and pepper. Pack the mixture firmly, about 1 inch thick, into a medium-sized, glass baking dish.\nBake in preheated oven until the top is lightly browned and crispy, about 5 to 7 minutes. Remove from oven, stir well, and return to the oven for an additional 5 to 7 minutes until golden brown. Remove from the oven, break apart with a spoon, and allow to cool.\nWhile the crunchy stuff is baking, heat olive oil in a large pan over low heat. Lightly brown 2 tablespoons of garlic, stir in the mushrooms, and cook until softened. Stir in the sun-dried tomatoes, and Alfredo sauce; cook to warm.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. To serve, toss pasta in sauce, and sprinkle with crunchy stuff!\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pickled Cheese",
        "ingredients": [
            "7 ounces feta cheese ADVERTISEMENT",
            "4 sprigs fresh thyme ADVERTISEMENT",
            "7 fluid ounces white wine vinegar ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse the feta cheese, and pat dry with paper towels. Cut into half-inch cubes. In a 1 pint glass jar, place a layer of cheese cubes, followed by a layer of thyme. Repeat layers until the jar is nearly full. Whisk together the white wine vinegar and honey; pour over the cheese until the jar is full. Screw the lid on, and leave in the refrigerator to marinate for at least one day.\n",
        "picture_link": "lbDlSVchP/P1udVCY3qcjCT3zh0HZpO"
    },
    {
        "title": "Holiday Artichoke Dip",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "1 (10 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "1/2 cup roasted red peppers, drained and chopped ADVERTISEMENT",
            "2 tablespoons fresh parsley, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the cream cheese, ranch dressing mix, artichoke hearts, roasted red peppers, and parsley. Chill 4 hours in the refrigerator before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegetable Pancake",
        "ingredients": [
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "1 1/4 cups dry yellow lentils ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 green chile peppers, chopped ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, sliced ADVERTISEMENT",
            "1 1/2 tablespoons jaggery (palm sugar) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 carrot, shredded ADVERTISEMENT",
            "1 bunch fresh spinach, finely chopped ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, soak the rice and lentils in the water for 4 to 5 hours.\nPlace the rice and lentils in a food processor with the chile peppers, ginger, jaggery, and salt. Process until smooth, and mix in the carrot and spinach. Continue to process until smooth and well mixed.\nHeat the oil in a tava (or large skillet) over medium-low heat. Thinly and evenly spread the batter into the tava. Cover, and cook 15 minutes, or until browned and set enough to turn. Turn with a spatula, and continue cooking until browned and cooked through.\n",
        "picture_link": "RWASGqAQPfCoWJq7A7s9QTC/ljquc6q"
    },
    {
        "title": "Maple Walnut Crumb Cake",
        "ingredients": [
            "5 cups all-purpose flour ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 1/2 teaspoons baking powder ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/4 cups vegetable oil ADVERTISEMENT",
            "1 1/8 cups milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon maple flavored extract ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/4 cup ground walnuts ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13 inch baking pan.\nIn a medium bowl, stir together the flour, sugar, salt and baking powder. Separate the mixture into two bowls - one with about 5 cups, and the other with about 3. In the bowl with the smaller amount, stir in the eggs, oil, milk, vanilla extract and maple extract. Pour this mixture into the prepared baking pan. To the remaining bowl, stir in the butter, cinnamon and walnuts until crumbly and well blended. Sprinkle this over the top of the batter in the pan.\nBake for 35 to 40 minutes in the preheated oven, or until a knife inserted into the center of the cake comes out clean. Dust with confectioners' sugar before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Steamed Mussels with Curry",
        "ingredients": [
            "1/4 cup curry powder ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 pounds mussels, cleaned and debearded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with 1 inch of water. Stir in the curry powder and garlic, and bring to a boil. Add the mussels, and steam over high heat until they are all open, 5 to 10 minutes. Serve immediately.\n",
        "picture_link": "gC7KI/iEkQ0xQ2MMdQl/NiuqNRZbovC"
    },
    {
        "title": "Big Ray's Pork Pie",
        "ingredients": [
            "2 1/2 pounds lean ground pork ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cup fresh bread crumbs ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nCrumble the ground pork into a skillet over medium-high heat. Add the onion and water. Cook, stirring frequently, until evenly browned. Remove from heat, and mix in the fresh bread crumbs. Season with salt, cinnamon, and cloves, and mix well.\nPress one of the pie crusts into the bottom and up the sides of a pie plate. Fill with the pork mixture. Place the second crust over the top, and pinch the seams to seal. Poke a couple of holes in the top crust to vent steam.\nBake for 35 minutes in the preheated oven, or until crust is golden.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pea Roast",
        "ingredients": [
            "1 (2 pound) beef roast ADVERTISEMENT",
            "1 (36 ounce) bottle ketchup ADVERTISEMENT",
            "1 (15 ounce) can sweet peas, with liquid ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "8 small potatoes, peeled and quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the roast in a slow cooker. Mix in the ketchup, sweet peas with liquid, onion, and potatoes.\nCover, and cook 6 to 8 hours on Low, until meat is tender and easily shredded.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Virginia Whiskey Cake",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup port wine ADVERTISEMENT",
            "1/8 cup brandy ADVERTISEMENT",
            "3/4 cup candied mixed fruit ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/2 cup bourbon whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease an 9x5 inch loaf pan.\nIn a medium bowl, cream together the butter and sugar until light and fluffy. Gradually beat in the egg yolks until well blended. Combine the flour, baking powder, and nutmeg; stir into the batter alternately with the port wine and brandy. Fold in the candied fruit.\nIn a separate clean dry bowl, whip egg whites to soft peaks. Fold 1/4 of the egg whites into the batter to lighten, then fold in the remaining whites. Pour into the prepared loaf pan.\nBake for 1 hour in the preheated oven, or until a toothpick inserted into the center of the loaf comes out clean. Cool cake in the pan, and pour the bourbon over it. When the bourbon has soaked in, remove it from the pan, and wrap with aluminum foil. Let it sit for at least 1 day before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Horseradish Pan Sauce",
        "ingredients": [
            "1/4 cup dry vermouth or dry white wine ADVERTISEMENT",
            "1/4 cup low-sodium canned chicken broth ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vermouth and broth in a measuring cup. Follow basic sauce instructions below, whisking horseradish and butter into reduced liquid.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grilled Sausage Burrito",
        "ingredients": [
            "6 (4 ounce) links chorizo sausage ADVERTISEMENT",
            "1 (15 ounce) can black beans ADVERTISEMENT",
            "1 green bell pepper ADVERTISEMENT",
            "1 red bell pepper ADVERTISEMENT",
            "1 yellow bell pepper ADVERTISEMENT",
            "1/2 head iceberg lettuce, shredded ADVERTISEMENT",
            "3/4 cup chunky salsa ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "2 cups guacamole ADVERTISEMENT",
            "6 (12 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill and lightly oil grate.\nPlace whole bell peppers on the grill. Cook, turning occasionally until evenly charred. Place into a plastic bag and allow to cool. Place sausages on the grill. Brown on all sides, then move over to indirect heat and allow them to cook through, about 10 minutes.\nHeat black beans in a small saucepan over medium heat until heated through. Remove from heat and drain off liquid. When peppers are cool enough to touch, peel off skin, remove seeds and stem, and chop. Transfer peppers and beans to a medium bowl, and stir in salsa. Set aside.\nWhen sausages are done, slice into 1/2 inch rounds, and stir into the pepper mixture. Place tortillas on the grill to warm, about 20 seconds. Spoon the sausage filling onto each tortilla, and sprinkle lettuce on top. Layer with sour cream and guacamole as desired.\n",
        "picture_link": "IpILIo/3o69W58vgWifB2xiLTh3ILUy"
    },
    {
        "title": "Broadway Family Easter Egg Bake",
        "ingredients": [
            "8 eggs ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup sliced white onion ADVERTISEMENT",
            "2 cups shredded Swiss cheese ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "6 slices dark caraway rye bread ADVERTISEMENT",
            "2 tablespoons softened butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Once the water is boiling, remove from the heat, cover, and let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel once cold, and cut into 1/4-inch thick slices.\nPreheat an oven to 350 degrees F (175 degrees C).\nMelt 1 tablespoon of butter in a skillet over medium heat. Cook and stir the onion in the butter until the onion has softened and turned translucent, about 5 minutes. Spread the onion evenly into a 9x13-inch baking dish. Arrange sliced eggs over top, and sprinkle with the Swiss cheese. Whisk the condensed soup and milk together in a bowl until smooth. Season with mustard, seasoned salt, dill, and black pepper. Pour the mixture over the eggs. Butter the rye bread with 2 tablespoons of softened butter, and cut each slice into quarters. Place on top of the casserole, butter-side-up, overlapping if necessary.\nBake in the preheated oven until the bread is beginning to brown and the casserole is hot, 30 to 35 minutes.\n",
        "picture_link": "2wsI8bLMxL3s4EGCPX7Uvb.WRGVAEX."
    },
    {
        "title": "Americano Cocktail",
        "ingredients": [
            "2 cups ice ADVERTISEMENT",
            "1 1/2 fluid ounces bitter orange aperitif (such as Campari®) ADVERTISEMENT",
            "1 1/2 fluid ounces sweet vermouth ADVERTISEMENT",
            "3 ounces club soda, or as needed ADVERTISEMENT",
            "1 (1 inch) piece orange peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add ice to a tall glass. Pour in Campari and vermouth. Stir and top with soda water. Squeeze a twist of orange peel over the drink and drop it in.\n",
        "picture_link": "yPxoCey6wCB36lm7bYkAivdaDoXtEHe"
    },
    {
        "title": "Sherry Cobbler",
        "ingredients": [
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "3 orange slices ADVERTISEMENT",
            "1/2 cup dry sherry (such as fino or amontillado) ADVERTISEMENT",
            "1 1/2 cups crushed ice ADVERTISEMENT",
            "1/4 cup fresh raspberries and/or blackberries, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put sugar and water into a cocktail shaker and stir to dissolve. Add orange slices to the shaker and pour in sherry. Fill with ice, shake well, and strain into a tall glass full of crushed ice. Garnish with seasonal berries and a fresh slice of orange.\n",
        "picture_link": "q14USNJDy4XE86fLWKg4YFEsDAgzVvy"
    },
    {
        "title": "Southwest Salad Taco Cups",
        "ingredients": [
            "12 small corn tortillas (approx. 5-1/2 inches) ADVERTISEMENT",
            "1 (12 ounce) bag DOLE® All Natural Southwest Salad Kit ADVERTISEMENT",
            "1 cup fresh salsa, drained of excess juice ADVERTISEMENT",
            "1 cup coarsely chopped cooked chicken ADVERTISEMENT",
            "2/3 cup additional shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup sliced black olives, well drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F.\nWarm tortillas so they are pliable. Lightly spray six, 8-ounce custard cups with nonstick cooking spray and gently press tortilla into each cup. Bake 10 minutes or until brown and crisp. Carefully remove tortillas from cups and cool on rack. Repeat for remaining tortillas.\nStir together Taco Ranch Dressing and salsa. Moisten chicken with 1 tablespoon prepared taco dressing mixture. Combine cheeses in small bowl, set aside. Coarsely chop salad blend and combine with dressing mixture. Toss with cheeses and chicken.\nFill each tortilla cup with heaping 1/3 cup salad mixture. Garnish with black olives, tortilla strips and one small dollop sour-cream.\n",
        "picture_link": "IXmVQ/ccUEQoewO9OF4Q0YhgHgt6JGG"
    },
    {
        "title": "Val's Home Made Cheese With Garlic and Cayenne",
        "ingredients": [
            "7 cups 2% milk ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/2 cup freshly squeezed lemon juice ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a very large pot with water. Place stainless steel stock pot, cheesecloth, a large stainless steel spoon, strainer, and tongs in the water. Bring water to a boil. Boil utensils for 10 minutes to sterilize. Transfer sterilized items to a clean surface, drain water.\nPour 2% milk and buttermilk into the sterilized stock pot, and place over medium-low heat. Slowly heat the milk to 180 to 185 degrees F (80 to 85 degrees C), stirring constantly. Scrape bottom of pot as the milk heats to prevent scorching. When the milk has reached the correct temperature, remove from heat. Very gently stir in the lemon juice, and let the milk cool to 100 degrees F (38 degrees C). Whitish curds will separate from the greenish-yellow whey. Do not over mix or agitate to preserve the curds.\nWith slotted spoon, gently transfer the curds to the cheesecloth-lined colander. Gather up 4 corners of the cheesecloth, and tie into a bundle. Hang the bundle up over the sink from the faucet or a kitchen cabinet handle; allow to drip several hours until cheese curds are cool and moist but not sopping wet.\nPlace the curds into a mixing bowl, and mix with kosher salt, garlic powder, and cayenne pepper until thoroughly combined. Place a piece of plastic wrap about 12 by 18 inches onto a work surface. Spoon the cheese along a shorter side of the plastic, and pick up the edge of the wrap to roll the cheese into a tight cylinder. Twist the ends closed to enclose the cheese in the plastic; refrigerate until thoroughly chilled.\n",
        "picture_link": "Bsxn.ud5BOD96Mc5x43nQWefhlQTPA6"
    },
    {
        "title": "Cocktail a la Louisiane",
        "ingredients": [
            "1 1/2 cups ice ADVERTISEMENT",
            "1 fluid ounce rye whiskey ADVERTISEMENT",
            "3/4 fluid ounce Benedictine® liqueur ADVERTISEMENT",
            "3/4 fluid ounce sweet vermouth ADVERTISEMENT",
            "3 dashes aromatic bitters (such as Peychaud's®) ADVERTISEMENT",
            "1 Maraschino cherry for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice.\nPour in whiskey, Benedictine, sweet vermouth, anise liqueur and bitters. Cover shaker and shake several times to combine.\nStir well and strain into a cocktail glass; garnish with a cherry.\n",
        "picture_link": ".zDgPnjpfeSqZfbxwxPyb.5ytJdTDPW"
    },
    {
        "title": "El Nacionalista",
        "ingredients": [
            "ice ADVERTISEMENT",
            "1 fluid ounce bitter orange aperitif (such as Campari®) ADVERTISEMENT",
            "1 fluid ounce mezcal ADVERTISEMENT",
            "1/2 fluid ounce Amaro liqueur ADVERTISEMENT",
            "1/2 fluid ounce dry vermouth ADVERTISEMENT",
            "3 dashes chocolate or mole bitters (such as Bittermens® or Fee Brothers®) ADVERTISEMENT",
            "1/2 teaspoon single malt Scotch whiskey ADVERTISEMENT",
            "1 lemon zest, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ice cubes into a cocktail shaker. Pour in Campari, mezcal, Amaro, and vermouth. Shake in a few dashes of bitters. Stir or shake well and strain into a cocktail glass. Drizzle with a few drops of peaty, smoky Scotch. Twist the lemon rind over the drink and drop it in.\n",
        "picture_link": "1slP9FsgW49azgtoS4QOcvA7PlXfBeq"
    },
    {
        "title": "Harvey Wallbanger Cocktail",
        "ingredients": [
            "1 1/2 cups ice ADVERTISEMENT",
            "2 fluid ounces vodka ADVERTISEMENT",
            "5 fluid ounces freshly squeezed orange juice ADVERTISEMENT",
            "1 tablespoon Galliano® liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice. Pour in vodka and orange juice. Shake well and strain into a cocktail glass. Pour a floater of Galliano(R) over the top. Serve with a slice of orange.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Indian Stuffed Eggplant",
        "ingredients": [
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "4 small eggplants, halved lengthwise ADVERTISEMENT",
            "1/2 cup ghee (clarified butter) ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground coriander ADVERTISEMENT",
            "2 teaspoons vindaloo curry powder (optional) ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scoop the inside out of the eggplant halves, leaving 1/4 inch of flesh attached to the skin. Roughly chop the removed eggplant, and set the shells aside.\nHeat the ghee in a large skillet over medium heat. Cook and stir the onion and garlic until the onion has softened and turned translucent, about 5 minutes. Stir in the coriander, vindaloo powder, chili powder, and salt; continue cooking 2 to 3 minutes until the spices are very fragrant. Stir in the chopped eggplant flesh, and cook until very soft, mashing as you go. Pour in a little water if needed to keep the eggplant from burning. Keep the mashed eggplant hot over low heat.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nDeep fry the eggplant halves in the hot oil until crisp, about 5 minutes. Drain upside-down on a paper towel-lined plate. Once drained, spoon in the reserved filling, and serve hot.\n",
        "picture_link": "U5EGk4cLTIt99FWMnftfkymtJcKcjS2"
    },
    {
        "title": "Vieux Carre Cocktail",
        "ingredients": [
            "1 1/2 cups ice ADVERTISEMENT",
            "1 fluid ounce rye whiskey ADVERTISEMENT",
            "1 fluid ounce cognac ADVERTISEMENT",
            "1 ounce sweet vermouth ADVERTISEMENT",
            "1/8 ounce Benedictine® liqueur ADVERTISEMENT",
            "1 dash Angostura bitters ADVERTISEMENT",
            "1 dash Peychaud bitters ADVERTISEMENT",
            "1 lemon twist ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put ice in a cocktail glass. Pour in rye, cognac, vermouth, and Benedictine. Shake in Angostura and Peychaud's bitters. Stir, then strain into a short cocktail glass, and garnish with a twist of lemon peel.\n",
        "picture_link": "rWHQmIyTo1Amzk4ll9/W.ytdmeSgJbu"
    },
    {
        "title": "Easy Thai Beef or Chicken Salad",
        "ingredients": [
            "1 cup white rice ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "1 head lettuce - rinsed, dried and torn ADVERTISEMENT",
            "3 large cucumbers, seeded and chopped ADVERTISEMENT",
            "1 large onion, finely diced ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1 bell pepper, diced ADVERTISEMENT",
            "1 cup chopped fresh cilantro ADVERTISEMENT",
            "1 cup freshly squeezed lime juice ADVERTISEMENT",
            "1/2 cup fish sauce ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse rice in a fine mesh strainer under cold running water until no longer cloudy. Transfer to a medium saucepan and cover with 2 1/2 cups water. Bring to a boil, cover, and reduce heat to low. Simmer for 15 minutes, remove from heat and let stand for at least 10 minutes, or until all liquid has evaporated.\nPreheat oven to 250 degrees F (120 degrees C).\nSeason chicken with salt and garlic powder. Heat 2 tablespoons vegetable oil in a skillet over medium-high heat. Cook chicken, reducing heat when necessary, until no longer pink in center and juices run clear. Transfer to preheated oven to keep warm.\nPlace lettuce, cucumbers, onions, tomatoes, bell peppers, and cilantro together in a large mixing or serving bowl. Toss to combine. In another bowl, stir together the lime juice, fish sauce, sugar, and crushed red pepper until well blended and sugar is dissolved.\nRemove chicken from oven, slice into thin strips, and drizzle with dressing. Divide salad and rice among serving plates, and top each with chicken slices. Dressing may also be served at the table and each salad dressed individually.\n",
        "picture_link": "e8bBfkzyJ3zMEBj5iyTsxIe9CN/oha2"
    },
    {
        "title": "Pork and Bean Salad II",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "4 (15 ounce) cans baked beans with pork, drained ADVERTISEMENT",
            "1 cup sweet pickle relish ADVERTISEMENT",
            "1 small onion, diced (optional) ADVERTISEMENT",
            "5 radishes, diced ADVERTISEMENT",
            "1 (16 ounce) jar creamy salad dressing (e.g. Miracle Whip) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan, and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and slice.\nIn a large bowl, stir together the baked beans, relish, onion, and radishes. Stir in the salad dressing, and gently mix in the sliced hard-cooked eggs until everything is evenly blended. The amount of dressing may be adjusted to suit your taste. Cover, and chill for 1 hour before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Stoj Shot",
        "ingredients": [
            "1 fluid ounce vodka ADVERTISEMENT",
            "1 fluid ounce wild cherry brandy ADVERTISEMENT",
            "2 fluid ounces sweet and sour mix ADVERTISEMENT",
            "1 dash grenadine syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a highball glass with ice cubes. Pour vodka, cherry brandy, and sweet and sour mix over the ice. Top with grenadine syrup.\n",
        "picture_link": "f3Ff3e10YHmVRvg1rcyQOjf.Gh3cLaq"
    },
    {
        "title": "Gingeradish",
        "ingredients": [
            "8 ounces chopped fresh ginger ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put ginger in a blender or food processor, and add vinegar to cover. Process until smooth, about 2 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegetarian Bean Burritos",
        "ingredients": [
            "1 (15.5 ounce) can pinto beans, drained ADVERTISEMENT",
            "2 tablespoons tomato sauce ADVERTISEMENT",
            "2 tablespoons taco seasoning mix, or more to taste ADVERTISEMENT",
            "8 flour tortillas ADVERTISEMENT",
            "2 cups shredded lettuce ADVERTISEMENT",
            "2 cups grated Colby Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend pinto beans, tomato sauce, and taco seasoning in a food processor until a paste forms.\nCook and stir pinto bean mixture in a skillet over medium heat until warmed, about 5 minutes.\nPlace tortillas on a plate and heat in microwave on high until warm, about 30 seconds. Spread warm pinto bean mixture, shredded lettuce, and Colby Jack cheese onto each warm tortilla. Roll the tortilla around the filling to form a burrito.\n",
        "picture_link": "08lW6vVBNyyR.wh5h4YAjYNeJvDGAd2"
    },
    {
        "title": "Picnic Sausage",
        "ingredients": [
            "3 pounds ground beef ADVERTISEMENT",
            "1 pound ground spicy pork sausage ADVERTISEMENT",
            "1/4 cup sugar-based curing mixture (such as Morton® Tender Quick®) ADVERTISEMENT",
            "2 teaspoons liquid smoke flavoring ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons whole peppercorns ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 pinch dried sage ADVERTISEMENT",
            "2 tablespoons dried minced onion ADVERTISEMENT",
            "4 (12x18 inch) pieces of nylon netting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the ground beef, pork sausage, curing salt, liquid smoke, garlic powder, peppercorns, paprika, sage, and onion flakes until well blended. Cover, and refrigerate for 24 hours.\nPreheat the oven to 225 degrees F (110 degrees C).\nDivide the meat mixture into 4 equal pieces, and form each piece into an 8 inch long log. Place each log onto a piece of netting, and roll tightly. Twist the ends and tie with string, or fold under. Place sausage rolls on a broiling pan with a rack.\nBake for 5 1/2 to 6 hours in the preheated oven. The internal temperature of the sausage should be 160 degrees F (70 degrees C). Remove and cool. Remove nylon net, and wrap sausage in foil. Refrigerate overnight before slicing. Store in the refrigerator for up to 2 weeks, or freeze for up to 2 months.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tastiest Cookie Ever",
        "ingredients": [
            "1/4 cup butter or margarine, softened ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1 cup chopped dates ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup sesame seeds, lightly toasted ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease an 8x8 inch square baking pan.\nIn a medium bowl, mix together the butter, honey, eggs, vanilla and cardamom with an electric mixer until light and fluffy. Use a spoon to stir in sesame seeds, dates, and walnuts. Gradually mix in flour until well blended. Spread the batter evenly into the prepared pan.\nBake for 20 minutes in the preheated oven, or until set. Cool in the pan for a few minutes, then cut into 16 squares, and dust with confectioners' sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sago Plum Pudding II",
        "ingredients": [
            "3 tablespoons pearl sago ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon lemon peel, cut into strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together sago and milk and let rest 8 hours or overnight in the refrigerator.\nIn a bowl, combined soaked sago, sugar, baking soda, bread crumbs and butter. Stir well. Pour into a pudding mold or other heatproof bowl with the lemon peel and seal tightly.\nBring a large pot of water to boil. Place the pudding on a rack, submerged in the water, and boil for 2 1/2 hours, topping off the water as necessary. Serve hot or cold.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Black Forest Angel Food Cake",
        "ingredients": [
            "1 (9 inch) angel food cake ADVERTISEMENT",
            "2 (3.5 ounce) packages instant chocolate fudge pudding mix ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 1/2 teaspoons almond extract ADVERTISEMENT",
            "1 (20 ounce) can cherry pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Use a long serrated knife to cut the angel food cake in half, width-wise. Hollow out each cake half; use the bits of cake to fill the hole in the center, making 2 cake bowls.\nWhisk the pudding mix, whipped topping, milk, and almond extract in a large bowl; beat well. Pour pudding mixture evenly into the cake bowls.\nEvenly spoon cherry pie filling around the top edge of each cake. Chill cakes in refrigerator for 30 minutes before serving.\n",
        "picture_link": "78mFbjvnwG.rdTgs.uRzMGkixyIdF9y"
    },
    {
        "title": "Date and Orange Slice Bars",
        "ingredients": [
            "8 ounces chopped pitted dates ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 tablespoons hot water ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 (10.5 ounce) packages orange slice candies, cut in half lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan combine the dates, 1/2 cup of sugar, 2 tablespoons of flour, and water. Bring to a boil, and cook until thickened, about 10 minutes. Remove from heat, and set aside to cool.\nPreheat the oven to 325 degrees F (165 degrees C). Grease a 9x13 inch baking dish.\nIn a medium bowl, cream together the shortening and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Dissolve the baking soda in hot water, then stir into the creamed mixture. Combine 1 3/4 cups of flour and salt; stir into the batter just until blended.\nSpread half of the batter in the bottom of the prepared pan. Cover with a layer of orange slice candy, then spread the date mixture over the orange candy. Cover with the remaining batter.\nBake for 30 minutes in the preheated oven, or until golden brown. Cool, and cut into bars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chili Liver",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1 pound beef liver, sliced into thin strips ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (10.5 ounce) can condensed French onion soup ADVERTISEMENT",
            "1/4 cup tomato-based chili sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, fry bacon until browned and crisp. Remove from pan, cool and crumble. Keep the grease in the pan.\nDredge the liver slices in flour seasoned with salt and pepper. Fry liver in the bacon drippings over medium-high heat until browned on the outside. In a small bowl, mix together the French onion soup and chili sauce. Pour the mixture over the liver, cover, reduce heat to low, and simmer for 15 minutes stirring occasionally until tender. Remove lid, and continue cooking liver to desired doneness.\nServe liver and sauce topped with crumbled bacon.\n",
        "picture_link": "t7BsTkwgcyXTNbD1vNp2rh/xD1mATKm"
    },
    {
        "title": "Rack of Ribs",
        "ingredients": [
            "1 rack pork spareribs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 (32 ounce) package sauerkraut, drained ADVERTISEMENT",
            "3 tablespoons dried dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 300 degrees F (150 degrees C).\nSeason the ribs with salt and pepper and place into a roasting pan that is slightly larger than the rack. In a medium bowl, stir together the sauerkraut, onion and dill; spread on top of the ribs and place around them in the roasting pan.\nBake for 3 to 4 hours in the preheated oven, until the rib meat easily pulls away from the bone.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Carrot Pudding Ring",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "1 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 cups grated carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a tube pan or bundt pan.\nCream together butter and brown sugar. Add egg and water; blend well.\nMix together the flour, baking powder, baking soda, salt, nutmeg and cinnamon in a separate bowl; blend into the creamed butter mixture. Stir in the grated carrots and mix thoroughly. Pour evenly into prepared tube pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cranberry Eggnog",
        "ingredients": [
            "1/2 cup cranberries ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 quart eggnog ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan over medium heat, combine cranberries and water. Bring to a boil and cook until the cranberries are mushy. Stir in sugar and nutmeg; remove from heat. Pour the eggnog into a blender along with the cranberry mixture and mix until well blended. Serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Brandy Pecan Pie",
        "ingredients": [
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup half-and-half cream ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 tablespoons brandy ADVERTISEMENT",
            "1 cup coarsely chopped pecans ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, beat eggs together with half-and-half. Mix in sugar, flour, salt, molasses, corn syrup, vanilla, and brandy. Stir in pecans. Pour into pie crust.\nBake in preheated oven for 40 to 50 minutes, or until done.\n",
        "picture_link": "xedyCwFvYeTt4NGkPNUaKowB8n6UUtq"
    },
    {
        "title": "Ukrainian Snow Cap Cookies",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 tablespoon cream ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "1 cup flaked coconut, ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease baking sheets or line with parchment paper. Sift together the flour, baking powder and salt; set aside.\nIn a medium bowl, cream the butter and beat in egg yolks one at a time. Stir in cream, and then mix in the dry ingredients to form a light dough. If necessary, cover dough and chill for 30 minutes for easier handling.\nOn a lightly floured surface, roll the dough out to 1/4 inch thickness, and cut into small circles. Place the circles onto the prepared baking sheets. In a clean glass or metal bowl, whip egg whites to soft peaks. Gradually add confectioners' sugar while continuing to whip to stiff peaks. Fold in walnuts and coconut. Spoon some of the meringue mixture onto the top of each cookie.\nBake for 12 minutes in the preheated oven, or until delicately browned.\n",
        "picture_link": "hJ4C.lj44A.x6WjvapY4EdcHSkEqDDG"
    },
    {
        "title": "Glittery Snow Flakes",
        "ingredients": [
            "1 pound butter, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "3 tablespoons edible white glitter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nIn a large bowl, beat the butter and confectioners' sugar with an electric mixer until light and fluffy. Combine the flour and cornstarch; beat with the mixer for 5 to 10 minutes. The batter needs to be soft and fluffy.\nFit a cookie press with a star disc and fill with cookie dough. Press cookies onto ungreased cookie sheets. Sprinkle with edible glitter.\nBake for 20 to 25 minutes in the preheated oven. They will not brown on top so peek at the bottom of a cookie after 20 minutes. Cool cookies on the cookie sheet for a few minutes before transferring to wire racks to cool completely. Store cookies in an airtight tin for up to two weeks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simple German Potato Salad",
        "ingredients": [
            "8 medium red potatoes, diced ADVERTISEMENT",
            "1/2 cup creamy salad dressing, e.g. Miracle Whip ™ ADVERTISEMENT",
            "3 spiced dill pickles, coarsely chopped ADVERTISEMENT",
            "1/4 cup chopped white onion ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "3 hard-cooked eggs, peeled and sliced ADVERTISEMENT",
            "5 hot dogs, cut into pieces ADVERTISEMENT",
            "1 cup creamy cucumber salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a pot and fill with enough water to cover. Bring to a boil, then reduce the heat to medium and simmer until tender, about 10 minutes. Drain and cool.\nIn a large bowl, stir together the salad dressing, pickles, eggs, hot dogs and salad dressing. Season with onion, salt, pepper and garlic powder. Stir in the cooled potatoes until coated. Cover and chill until serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]