[
    {
        "title": "Florentine Caramelized Onion Soup",
        "ingredients": [
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "4 pounds onions ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 (750 milliliter) bottle dry white wine ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "1 small cinnamon stick ADVERTISEMENT",
            "4 cups cubed, stale French or Italian bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large heavy pot, heat oil over medium heat. Cut onions in half lengthwise, then slice thinly. Place sliced onions in pot and toss to coat with oil. Cover, reduce heat to medium-low, and cook, stirring occasionally, until onions are softened and beginning to color, 30 minutes.\nIncrease heat to medium and cook, stirring occasionally, uncovered, until onions are amber in color, 45 minutes.\nSprinkle onions with sugar and a little bit of salt; cook, stirring, until sugar melts and onions are caramel colored, 5 minutes. Pour in wine and broth, and place cinnamon stick in pot. Bring to a boil, then reduce heat, cover and simmer 1 hour.\nStir the bread into the soup and cook, uncovered, stirring occasionally until the bread disintegrates, 30 to 45 minutes.\nRemove the cinnamon stick. Whisk the soup to incorporate the bread. Adjust seasoning. Serve hot.\n",
        "picture_link": "eQl4CECSp6PV5akAaBUAGqaJra38knu"
    },
    {
        "title": "Dishpan Cookies IV",
        "ingredients": [
            "2 cups vegetable oil ADVERTISEMENT",
            "2 cups brown sugar ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "4 cups cornflakes cereal ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "1 1/2 cups salted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the oil, brown sugar and white sugar until smooth. Beat in the eggs one at a time then stir in the vanilla. Combine the flour, baking soda and salt; stir into the sugar mixture. Mix in the rolled oats, cornflakes, coconut and peanuts. Drop by heaping tablespoonfuls 3 to 4 inches apart onto the prepared cookie sheets. Flatten slightly.\nBake for 10 to 12 minutes in the preheated oven, or until top is lightly browned. Allow cookies to cool one minute on the baking sheet before removing to wire racks to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Lentil Soup with Asparagus Tips",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 medium head garlic ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1 red bell pepper ADVERTISEMENT",
            "2 1/2 cups dry lentils ADVERTISEMENT",
            "2 (32 fluid ounce) containers chicken broth ADVERTISEMENT",
            "1 1/2 large carrot, shredded ADVERTISEMENT",
            "1 large onion, grated ADVERTISEMENT",
            "1 cup asparagus tips ADVERTISEMENT",
            "1 cup sweet peas ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons orange marmalade ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1 pinch saffron ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nCut the top off of the head of garlic and place in a shallow dish in 1 inch of water. Drizzle with 2 tablespoons olive oil, sprinkle with basil, cover and place on a baking sheet. Halve and seed the bell pepper, drizzle with remaining 1 tablespoon olive oil and place on the baking sheet.\nBake garlic and pepper in preheated oven until pepper is browned and garlic is soft, 20 to 40 minutes. Remove from oven and, when cool enough to handle, remove skin from pepper and chop. Squeeze out garlic cloves and mash together in a bowl to form a paste.\nWhile garlic and pepper are baking, combine lentils and chicken broth in a large pot over medium heat. Bring to a boil, then reduce heat and simmer 40 minutes, until lentils are just tender.\nStir garlic paste, bell pepper, carrots, onion, asparagus, peas into lentil mixture, adding more broth to thin if necessary. Season with sugar, marmalade, curry powder, saffron, salt and pepper. Simmer 30 minutes more, until vegetables are tender and flavors are well blended.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Health Balls II",
        "ingredients": [
            "3/4 cup peanut butter ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "1/2 cup granola ADVERTISEMENT",
            "1/2 cup crispy rice cereal ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/8 cup semisweet chocolate chips ADVERTISEMENT",
            "1/3 cup butterscotch chips ADVERTISEMENT",
            "1/2 cup graham cracker crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan over medium heat, melt together the peanut butter and honey, stirring frequently until warm and creamy. Remove from heat and set aside to cool.\nIn a large bowl, toss together the granola, rice cereal, pecans, chocolate and butterscotch chips and graham cracker crumbs. Stir in the peanut butter mixture. Shape into balls of desired size and refrigerate until serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Really Nice Spice Cookies",
        "ingredients": [
            "3/4 cup unsalted butter, softened ADVERTISEMENT",
            "1/3 cup packed light brown sugar ADVERTISEMENT",
            "1/2 cup dark brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3/4 cup sifted all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter, light brown sugar and dark brown sugar until smooth. Beat in the egg until well blended. Combine the flour, cinnamon, nutmeg and ginger; stir into the creamed mixture to form a stiff dough. Knead lightly in the bowl for a few turns. Shape dough into 25 small balls. Place balls 2 inches apart onto the prepared cookie sheets and flatten slightly.\nBake for 8 to 10 minutes in the preheated oven, or until golden.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Wonderful Almond Fingers",
        "ingredients": [
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 5/8 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 (1 ounce) squares semisweet chocolate, chopped ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together unsalted butter and sugar. Beat in the egg and egg yolk one at a time, then stir in the vanilla and almond extracts. Combine the flour, baking powder and salt; gradually stir into the sugar mixture until smoothly blended. Fill a large pastry bag fitted with a 3/4 inch round tip. A large freezer storage bag with one of the corners snipped off will also work.\nPipe dough into 2 inch long logs using a side to side squiggle motion. Space cookies at least 2 inches apart. Place cookie sheets with cookies into the freezer for a couple of minutes to harden.\nBake for 15 minutes in the preheated oven, or until cookies are lightly browned. Cool for a few minutes on the baking sheets, then remove to wire racks to cool completely.\nIn the microwave or in a metal bowl over a pan of simmering water, melt chocolate and 2 tablespoons of butter, stirring frequently until smooth. Remove from heat and stir in the milk. Dip both ends of the cooled cookies into the chocolate and place them onto waxed paper to set.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Frosting V",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine sugar, cocoa and salt. Add milk and shortening. Cook over medium heat until it comes to a boil. Remove from heat and let cool before spreading on cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Cherry Pie",
        "ingredients": [
            "1 1/3 cups vanilla wafer crumbs ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 (1 ounce) square unsweetened chocolate, chopped ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons chopped maraschino cherries ADVERTISEMENT",
            "2 cups whipped cream, garnish ADVERTISEMENT",
            "8 maraschino cherries, garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C.) In a medium bowl, combine crumbs, and 1/4 cup softened butter. Press onto the bottom and sides of an 8 inch pie pan. Bake in preheated oven for 8 minutes. Cool.\nIn a microwave-safe bowl, microwave chocolate until melted. Stir occasionally until chocolate is smooth. Set aside. In a large bowl, cream 1/2 cup butter and sugar until light and fluffy. Blend in melted chocolate, salt and vanilla. Add eggs, one at a time, beating 5 minutes for each egg. Stir in chopped cherries. Spread into cooled crust. Chill 4 hours.\nBefore serving, garnish pie with whipped cream and maraschino cherries.\n",
        "picture_link": "KSvHm/raQVpUzKUKQGj3DsF./6iagBW"
    },
    {
        "title": "Beef and Barley Soup IV",
        "ingredients": [
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "1 beef soup bone ADVERTISEMENT",
            "1/4 cup barley ADVERTISEMENT",
            "3 carrots, peeled ADVERTISEMENT",
            "1 onion, peeled and left whole ADVERTISEMENT",
            "3 stalks celery ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 6 quart soup pot, combine stew meat, soup bone, barley and carrots. Cover with water to within 2 inches of top of pot. Bring to a boil, then reduce heat and simmer 1 hour.\nPlace onion and celery in pot and continue to simmer 2 hours more.\nRemove onion, carrots, bone and celery. Season with salt and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peanut Butter Crunchies",
        "ingredients": [
            "1/4 cup margarine ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups crispy rice cereal squares ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the margarine, peanut butter and sugar until smooth. Beat in the egg. Combine the flour, baking powder and salt; stir into the peanut butter mixture. Crush the cereal squares and stir into the dough until well blended. Roll tablespoons of dough into balls and place them 2 inches apart onto the prepared cookie sheets. Flatten slightly using a fork and making a criss cross pattern. Dip the fork in sugar to prevent sticking.\nBake for 8 to 10 minutes in the preheated oven, or until the bottoms are lightly browned. Let stand on the cookie sheet for 1 minute before removing to wire racks to cool completely.\n",
        "picture_link": "j0tFAzOKWzdysttp8IF3GPe8Nu5h9R."
    },
    {
        "title": "Cream of Artichoke Soup II",
        "ingredients": [
            "5 whole artichokes ADVERTISEMENT",
            "2 leeks, finely chopped ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a steamer or in a colander over boiling water, steam artichokes 45 minutes, until tender.\nWhile artichokes are steaming, heat butter in a large pot over medium heat. Saute leeks in butter until translucent. Remove from heat.\nScrape the flesh from each artichoke leaf and place in the pan with the leeks. Scrape the prickly choke away from the heart of the artichokes, chop the hearts and add to the leek mixture. Return to medium heat and stir to combine. Pour in broth and heat through. Slowly stir in milk, but do not boil. Season with salt and pepper. Serve hot.\n",
        "picture_link": "ypRgqEjOfnTktg90JuCvhVcaKW/dMr."
    },
    {
        "title": "Chicken Noodle Soup III",
        "ingredients": [
            "12 shallots, thinly sliced ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "6 ounces egg noodles ADVERTISEMENT",
            "1 cup bean sprouts ADVERTISEMENT",
            "3 quarts chicken broth ADVERTISEMENT",
            "3 cups shredded, cooked chicken breast meat ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small skillet over medium heat, cook shallots in oil until brown and fragrant. Remove from heat and set aside.\nBring a large pot of water to a boil. Cook noodles in boiling water until just tender, 8 to 10 minutes; drain and rinse under cold water. Set aside.\nBring a small pot of water to a boil; have ready a bowl of ice water. Blanch bean sprouts by plunging them into boiling water for 1 minute, then into cold water. Drain and set aside.\nIn a large saucepan over medium heat, bring chicken broth to a simmer.\nDivide noodles evenly between 6 bowls. Top with bean sprouts and shredded chicken. Pour the heated broth into the bowls. Drizzle with the shallot mixture and garnish with the green onion. Season with salt and pepper. Serve at once.\n",
        "picture_link": "X2WoBItooXboBYlWglJ.ciYX7kEvSBC"
    },
    {
        "title": "Cranberry Pineapple Juice",
        "ingredients": [
            "1 (64 fluid ounce) bottle cranberry juice, chilled ADVERTISEMENT",
            "1 (46 fluid ounce) can pineapple juice ADVERTISEMENT",
            "1 (8 ounce) can pineapple tidbits ADVERTISEMENT",
            "1 cup cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a punch bowl, combine cranberry juice and pineapple juice. Stir in pineapple tidbits and cranberries. Serve with ice.\n",
        "picture_link": "WF081JUSlHOhX4MA5WPNDNVrGp0b9bO"
    },
    {
        "title": "Nut Horns",
        "ingredients": [
            "8 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 cups shortening ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 (0.6 ounce) cake compressed fresh yeast ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "8 cups chopped walnuts ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 cup white sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together flour and salt. Add shortening, 4 beaten eggs, evaporated milk, yeast and 1/4 cup sugar. Mix as much as you can in the bowl, then turn out onto a floured surface and knead until smooth, about 5 minutes. Place into an oiled bowl, cover and chill overnight.\nTo make the filling: Melt margarine and stir in sugar. Mix in the cinnamon and walnuts; remove from heat and set aside to cool. When the nuts are cooled, stir in the egg and just enough of the milk to moisten the filling.\nPreheat oven to 350 degrees F (175 degrees C). Grease cookie sheets. Roll out dough to 1/4 inch in thickness. Sprinkle some of the remaining sugar over the dough. Cut into small triangles about 3 inches long and 2 inches at the base. Put a teaspoon of filling at the base of the triangle and roll towards the point. Roll in sugar and place 2 inches apart onto the prepared cookie sheets.\nBake for 10 to 15 minutes in the preheated oven. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "Gdl9OzbtUgz3OxSmjHy15hbL/KUbyAq"
    },
    {
        "title": "Tammi's Crawfish Etoufee",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 pound frozen raw crawfish ADVERTISEMENT",
            "1 cup chopped green onion ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup minced fresh parsley ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1 teaspoon crushed red pepper ADVERTISEMENT",
            "1 teaspoon Creole-style seasoning ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, heat butter and olive oil together. Saute garlic powder and mushrooms until mushrooms are tender; about 3 to 5 minutes.\nAdd crawfish and onions. Reduce heat to low and cook for 5 minutes.\nStir in Parmesan cheese, parsley, and half and half. Simmer for 5 minutes and stir in crushed red pepper and Creole seasoning. Salt and pepper to taste.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peach Cheesecake Bars",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1/3 cup corn syrup ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup corn syrup ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3/4 cup peach preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl mix together the flour sugar and salt. Cut in the butter until the mixture is fine and crumbly. Stir in 1/3 cup corn syrup until a dough forms. Press into the bottom of the prepared pan.\nIn another bowl, beat cream cheese and eggs using an electric mixer, until smooth and creamy. Mix in 1 cup corn syrup and vanilla until well blended. Spread evenly over the crust.\nBake for 35 to 40 minutes in the preheated oven, until the edges are light brown. Remove from the oven and spread peach preserves over the hot filling immediately. Chill for at least 3 hours before cutting into small squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mincemeat Bars",
        "ingredients": [
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "3 tablespoons hot water ADVERTISEMENT",
            "1/4 cup slivered almonds ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1 (9 ounce) package condensed mincemeat, crumbled ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons hot milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Grease two 9x13 inch baking pans.\nIn a large bowl, mix together the butter, brown sugar, molasses and 1 teaspoon vanilla until well blended. Combine the flour, salt, baking soda, cinnamon and cloves; stir into the molasses mixture. Stir in hot water, almonds, raisins and mincemeat. Spread the dough evenly into the bottoms of both pans. It will be thin but the mixture will puff up when baking.\nBake for 12 to 15 minutes in the preheated oven, or until firm. Cool in pans on wire racks. In a small bowl, mix together the confectioners' sugar, hot milk, 1/2 teaspoon vanilla and 1/2 teaspoon almond extracts until smooth. Spread over warm bars. Allow to cool before cutting into squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lebkuchen V",
        "ingredients": [
            "1 cup honey ADVERTISEMENT",
            "1/4 cup dark molasses ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 1/2 teaspoons ground cloves ADVERTISEMENT",
            "2 tablespoons chopped candied orange peel ADVERTISEMENT",
            "2 tablespoons chopped candied citron ADVERTISEMENT",
            "1 cup chopped blanched almonds ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1 1/2 teaspoons orange zest ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons hot water ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the honey, molasses, cinnamon, nutmeg and cloves until well blended. Mix in the candied orange peel, citron, almonds, brown sugar, orange and lemon zests. Stir the baking soda into the hot water, then beat into the mixture along with the egg. Gradually mix in the flour. The dough should be very stiff, you may need to knead it on the counter to get it thoroughly blended. Cover and chill overnight so the flavors can ripen.\nPreheat oven to 350 degrees F (175 degrees C). On a lightly floured surface, roll the dough out to 1/2 inch thickness. Cut into bars about 2 inches long and 3/4 inch wide. Place cookies 1 inch apart onto ungreased cookie sheets.\nBake for 12 to 15 minutes in the preheated oven, until the bottoms are only starting to brown. Remove cookies to cool on wire racks. Ice them with a thin confectioners glaze while they are still warm, if you like. When cool, store in a tightly closed container. If you want soft cookies, put half an apple in the container for several days.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Fudgy Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "8 drops food coloring ADVERTISEMENT",
            "3/4 cup chocolate hazelnut spread ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the butter, white sugar and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla and food coloring. Mix in the chocolate hazelnut spread. Combine the flour, baking powder, and baking soda; stir into the sugar mixture until just blended. Fold in chocolate chips. Drop dough by spoonfuls 2 inches apart onto the prepared cookie sheets. These cookies spread.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "lYe8XIQQtpil7/uAVyZ6DwpVgmVuL0m"
    },
    {
        "title": "Gumdrop Cookies III",
        "ingredients": [
            "2 cups brown sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 cup gumdrops, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a medium bowl, stir together the flour and brown sugar. Mix in eggs until well blended. Stir in the pecans and chopped gumdrops. Press evenly into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, or until firm. Allow to cool before cutting into squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spence's Secret Thai Red Shrimp Curry",
        "ingredients": [
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 1/2 tablespoons red curry paste, or more to taste ADVERTISEMENT",
            "1 red onion, cut into 1/2-inch dice ADVERTISEMENT",
            "2 large bell peppers, cut into 3/4-inch pieces ADVERTISEMENT",
            "2 (14 ounce) cans coconut milk ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "3 1/2 tablespoons maple syrup ADVERTISEMENT",
            "3 tablespoons fish sauce ADVERTISEMENT",
            "3 stalks lemon grass, bruised and chopped ADVERTISEMENT",
            "4 kaffir lime leaves, torn into quarters ADVERTISEMENT",
            "1 pound medium shrimp, peeled and deveined ADVERTISEMENT",
            "1/4 cup packed chopped fresh basil ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a wok over medium-high heat; stir in curry paste and cook until fragrant, about 1 minute. Stir onion into curry paste; cook until just tender, about 3 minutes. Stir in peppers; cook and stir for 3 more minutes.\nStir coconut milk, chicken broth, maple syrup, fish sauce, lemon grass, and lime leaves into vegetable mixture. Bring curry to a boil; reduce heat to low and simmer until vegetables are tender, about 8 minutes. Stir in shrimp; cook until shrimp is pink at the center, about 5 minutes.\nRemove wok from heat; stir basil and cilantro into curry. Serve hot.\n",
        "picture_link": "SVXWF96krXuF1nF9bZZ9nHMtNxoTToG"
    },
    {
        "title": "Siri's Heart Sugar Cookies",
        "ingredients": [
            "2/3 cup butter, softened ADVERTISEMENT",
            "1 cup granulated sugar, or more to taste ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/4 teaspoons cream of tartar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 pinch salt (optional) ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBeat butter and sugar with an electric mixer in a large bowl until fluffy. Add 1 egg, allowing it to blend into the butter mixture before adding the next with the vanilla extract.\nDissolve cream of tartar in milk; beat into the butter mixture. Add 4 cups flour and pinch of salt; beat until doughy.\nSpread 1 cup flour onto a flat work surface. Roll the dough out on the prepared surface; cut out in desired shapes until all dough is used.\nBake on non-stick baking sheets in preheated oven until cookies are set in the middle, about 12 minutes.\n",
        "picture_link": "GrtcPF2aiWZSNNY9Rgmtg4oSlgucFHq"
    },
    {
        "title": "Crunchy Berry Parfait",
        "ingredients": [
            "1 cup vanilla low-fat yogurt ADVERTISEMENT",
            "6 strawberries, hulled and sliced ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "1/2 cup vanilla-flavored granola with almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer 1/4 cup yogurt into the bottom of a bowl. Top with about half of each of the sliced strawberries, blueberries, and granola; repeat layering.\n",
        "picture_link": "0n3xcG.5CfiEhg7p5wE8Nyj/LmtdinO"
    },
    {
        "title": "Award Winning Chicken Chili",
        "ingredients": [
            "1 (2 to 3 pound) whole chicken ADVERTISEMENT",
            "6 cups water, or as needed to cover ADVERTISEMENT",
            "3 (15.5 ounce) cans white beans, drained ADVERTISEMENT",
            "2 (15.5 ounce) cans hominy, drained ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 (4 ounce) cans chopped green chiles ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon dried oregano, or more to taste ADVERTISEMENT",
            "2 cubes chicken bouillon, or more to taste ADVERTISEMENT",
            "1 (8 ounce) package shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover chicken with water in a large pot and bring to a boil; reduce heat to low and simmer until chicken is no longer pink in the center, 45 minutes to 1 hour. Remove chicken and set aside to cool. Reserve cooking liquid. Shred chicken when cool enough to handle.\nCombine chicken, cooking liquid, white beans, hominy, onion, green chiles, garlic, cumin, oregano, and chicken bouillon in a slow cooker. Cover and refrigerate overnight.\nCook chicken and bean mixture on Low in slow cooker for 4 to 4 1/2 hours. Top individual servings with Monterey Jack cheese.\n",
        "picture_link": "GvnQpGEbL46gTUDDJM.NdYCqYqsGlCa"
    },
    {
        "title": "Peanut Butter Banana Quesadilla",
        "ingredients": [
            "1/4 cup peanut butter ADVERTISEMENT",
            "2 (8 inch) flour tortillas ADVERTISEMENT",
            "1 banana, sliced ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread half the peanut butter onto one side of 1 flour tortilla; top with sliced banana. Spread the remaining peanut butter on one side of the other flour tortilla; place tortilla, peanut butter-side down, on top of banana slices.\nSpray cooking spray into a skillet and place skillet over medium heat. Place quesadilla into the heated skillet; cook until lightly browned, about 3 minutes per side. Cut quesadillas in half to serve.\n",
        "picture_link": "bun7630p23fM1aS7OLYBOc/bUOZZG1S"
    },
    {
        "title": "Chocolate-Hazelnut Marble Cake Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "6 tablespoons vegan butter ADVERTISEMENT",
            "2/3 cup So Delicious® Dairy Free Hazelnut Coconut Milk Creamer ADVERTISEMENT",
            "1/3 cup dark chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F. Line a baking sheet with parchment paper. Sift together flour, sugar, baking powder, salt, and baking soda in large bowl. Add vegan butter and mix together with hands until mixture forms large, coarse crumbs the size of peas. Add chocolate chips and creamer, mix for a few more seconds until just moistened. Turn the dough onto a lightly floured work surface and press together gently until the dough clings together in a ball. Pat into a circle about 2-inches thick and 6 inches in diameter.\nLet sit for 15 minutes at room temperature. Cut into 8 wedges. Sprinkle with remaining tablespoon of sugar.\nBake for 15-20 minutes or until golden on top. Allow to cool for a few minutes, before separating wedges.\n",
        "picture_link": "q.4KSUtqFe9yrOj.ztOZcXiRplgufPa"
    },
    {
        "title": "Chef John's Oysters Rockefeller",
        "ingredients": [
            "2 cups rock salt, or more as needed ADVERTISEMENT",
            "1 cup chopped watercress ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "2 tablespoons minced green onion (white and pale green parts only) ADVERTISEMENT",
            "2 tablespoons chopped celery ADVERTISEMENT",
            "2 tablespoons chopped fresh tarragon ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons anise-flavored liqueur (such as Pernod®) ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "36 oysters on the half shell ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 500 degrees F (260 degrees C). Pour rock salt into a large, shallow casserole dish.\nCombine watercress, butter, bread crumbs, green onions, celery, tarragon, Italian parsley, anise-flavored liqueur, salt, black pepper, and cayenne pepper in a food processor; blend until smooth.\nPlace 8 to 12 shucked oysters on top of the rock salt. Spoon 1 to 2 teaspoons of watercress mixture a top each oyster.\nBake in the preheated oven until oysters are firm and butter has melted, about 5 minutes. Repeat with remaining oysters.\n",
        "picture_link": "K/BPm4nG.ZtlnjBXElriwDwqrIy5PEe"
    },
    {
        "title": "North African Beef and Brown Rice",
        "ingredients": [
            "1/2 pound beef round steak, diced ADVERTISEMENT",
            "1/2 small onion, finely diced ADVERTISEMENT",
            "1 tablespoon tomato-chicken bouillon granules (such as Knorr®) ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon beef stock concentrate ADVERTISEMENT",
            "1/3 pound carrots, cut into 1/2-inch dice ADVERTISEMENT",
            "3/4 pound sweet potatoes, cut into 1/2-inch dice ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "3/4 cup finely shredded cabbage ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "1 1/2 teaspoons smoked paprika ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "5 black cardamom seeds ADVERTISEMENT",
            "1 cup brown rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir steak, onion, and tomato-chicken bouillon together in a large pot over medium heat until steak is browned, 5 to 10 minutes. Add garlic, 1 cup water, beef stock concentrate, carrots, and sweet potatoes to the steak mixture; cook and stir until carrots and sweet potatoes are softened, about 20 minutes.\nMix 1 1/2 cups water, cabbage, cinnamon sticks, paprika, cumin, black pepper, coriander, and cardamom seeds into the steak-sweet potato mixture; bring to a boil. Add brown rice and reduce heat to low. Cover pot and simmer until rice has absorbed the liquid, about 45 minutes. Fluff rice and remove cinnamon sticks before serving.\n",
        "picture_link": "ADn5uIQHaxjDGnOarpvmiPjr0P4PMJq"
    },
    {
        "title": "Bubbling Bread Sticky Buns",
        "ingredients": [
            "1/4 cup chopped walnuts (optional) ADVERTISEMENT",
            "18 frozen dinner rolls (such as Rhodes®) ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 (3.5 ounce) package cook and serve butterscotch pudding mix (such as Jell-O®) ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9-inch fluted tube pan (such as Bundt(R)).\nSprinkle 1/4 cup walnuts into the prepared pan. Arrange dinner rolls in the pan.\nMix brown sugar and pudding mix in a small bowl; sprinkle evenly over the rolls. Add raisins and 1/2 cup walnuts.\nMix white sugar and cinnamon in a small bowl; sprinkle evenly over raisin and walnut layer. Pour melted butter over the entire roll mixture. Cover pan loosely with plastic wrap and a towel; place on a baking sheet. Allow to rise at room temperature for 8 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Remove towel and plastic wrap from pan, keeping the fluted tube pan on the baking sheet in case ingredients overflow.\nBake in the preheated oven until rolls are cooked and browned, about 30 minutes. Place a sheet of aluminum foil over rolls midway through baking if they brown too quickly. Cool in the pan for 5 to 10 minutes before turning onto a plate.\n",
        "picture_link": "DjQZq.bjQmCQLombZaitSewAYHPKPjG"
    },
    {
        "title": "Peanut Butter Banana Breakfast Smoothie",
        "ingredients": [
            "2 frozen bananas (peel before you freeze) ADVERTISEMENT",
            "2 cups almond milk ADVERTISEMENT",
            "2 cups ice cubes ADVERTISEMENT",
            "1/2 cup chunky peanut butter ADVERTISEMENT",
            "2 tablespoons wheat germ ADVERTISEMENT",
            "2 tablespoons ground flax seed ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend bananas, almond milk, ice, peanut butter, wheat germ, flax seed, and honey in a blender until smooth.\n",
        "picture_link": "xmrz/y8aXKMN9v0.pyuz0qiX4W2Kniy"
    },
    {
        "title": "White Christmas Candy",
        "ingredients": [
            "1 (12 ounce) package white chocolate chips ADVERTISEMENT",
            "2 tablespoons creamy peanut butter ADVERTISEMENT",
            "2 cups crispy rice cereal (such as Rice Krispies®) ADVERTISEMENT",
            "1 cup mini marshmallows ADVERTISEMENT",
            "1 cup lightly salted peanuts ADVERTISEMENT",
            "1 tablespoon multi-colored sprinkles, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix white chocolate chips and peanut butter together in a large microwave-safe bowl.\nMicrowave on high for 1 minute; stir with a spatula. Continue cooking in microwave in 30 second intervals; stir until smooth. Fold in rice cereal, marshmallows, and peanuts.\nDrop white chocolate mixture by spoonfuls onto a sheet of waxed paper. Sprinkle each mound with sprinkles. Set aside to cool for 30 minutes.\n",
        "picture_link": "/IRtooE7GrdMcnkRLHWTzgIFtS3EJue"
    },
    {
        "title": "Berry Mallow Yam Bake",
        "ingredients": [
            "2 (15 ounce) cans yams, drained and cut into chunks ADVERTISEMENT",
            "2 cups fresh cranberries ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup oatmeal ADVERTISEMENT",
            "1/3 cup margarine, softened ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nToss yams and cranberries together in a bowl. Mix flour, brown sugar, oatmeal, margarine, and cinnamon together in a separate bowl. Add about half the oat mixture to the yam mixture; toss to combine and spread into a 1 1/2-quart casserole dish. Sprinkle remaining oat mixture over the casserole.\nBake in preheated oven until lightly browned, about 35 minutes.\n",
        "picture_link": "pin3h.dvUSBSJHpCFGSjfpwnwlpq8ge"
    },
    {
        "title": "Grandma Edna's Christmas Cabbage",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 large head cabbage ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 cup warm milk ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "15 saltine crackers, crumbled ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 6 tablespoons butter in a large skillet over medium heat; cook and stir onion in the melted butter until lightly browned, 10 to 15 minutes.\nRemove and set aside several large leaves of cabbage. Core cabbage and cut into very fine shreds. Mix cooked onion, chopped cabbage, eggs, and milk together in bowl; transfer mixture to a 9x13-inch casserole dish. Cover mixture with reserved whole cabbage leaves.\nBake in the preheated oven until cabbage mixture is cooked through and set, about 50 minutes.\nHeat 2 tablespoons butter in a skillet over medium heat; cook and stir cracker crumbs in the melted butter until lightly browned, about 5 minutes.\nRemove cabbage leaves from top of casserole dish and sprinkle cabbage-egg mixture with buttered cracker crumbs.\nBake in the preheated oven until topping is browned, about 10 more minutes. Season with salt and black pepper.\n",
        "picture_link": "rigEqIXKxJvRlDtvcY5/AU.EUnvZTVe"
    },
    {
        "title": "Simply Traditional Potato Pancakes",
        "ingredients": [
            "1 (20 ounce) package Simply Potatoes® Shredded Hash Browns ADVERTISEMENT",
            "1/3 cup shredded carrot ADVERTISEMENT",
            "1/4 cup finely chopped onion ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs, slightly beaten ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "Applesauce or sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl stir together Simply Potatoes, carrot, onion, flour and salt. Stir in beaten eggs.\nHeat oil in 12-inch nonstick skillet over medium heat. Drop four generous 1/4 cup pancakes of potato mixture into skillet; flatten slightly. Cook each pancake 2 to 3 minutes on each side or until golden brown, turning once. Cook remaining pancakes, adding additional oil to skillet if needed. Drain pancakes on paper towel. Serve with applesauce or sour cream if desired.\n",
        "picture_link": "HfWir9tbZofubjXxKQSVtu5iLr7PKC6"
    },
    {
        "title": "Slow Cooker Chicken and Artichokes in Garlic Lemon Alfredo Sauce",
        "ingredients": [
            "1 (15 ounce) jar Alfredo sauce ADVERTISEMENT",
            "3 tablespoons garlic powder ADVERTISEMENT",
            "1 1/2 tablespoons lemon zest ADVERTISEMENT",
            "3/4 cup chicken broth ADVERTISEMENT",
            "2 teaspoons quick-mixing flour (such as Wondra®) ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "1 (14 ounce) can quartered artichoke hearts, drained ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir Alfredo sauce, garlic powder, lemon zest, and chicken broth together in the crock of a slow cooker until smooth. Place quick-mixing flour and water into a small jar with a lid and shake to combine; stir into sauce mixture.\nPlace artichoke hearts and chicken breasts into slow cooker and cover with sauce. Cover and cook on Low for 4 1/2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Cake Pops",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup buttermilk ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup freshly brewed hot coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a cake pop maker and brush with oil.\nWhisk together flour, sugar, cocoa, baking soda, baking powder, and salt in a bowl; beat in buttermilk, vegetable oil, egg, and vanilla extract with an electric mixer until smooth. Beat coffee into batter until evenly incorporated.\nFill each reservoir of prepared cake pop maker with about 1 tablespoon batter.\nBake until a toothpick inserted into the center of cake pop comes out clean, about 4 minutes; remove cake pops and allow to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pulled Pork Pesto Sandwich",
        "ingredients": [
            "Pulled Pork: ADVERTISEMENT",
            "1/4 cup kosher salt ADVERTISEMENT",
            "1/4 cup freshly ground black pepper ADVERTISEMENT",
            "1/4 cup Italian seasoning ADVERTISEMENT",
            "2 tablespoons dried rosemary ADVERTISEMENT",
            "2 tablespoons granulated garlic ADVERTISEMENT",
            "2 tablespoons granulated onion ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "1 tablespoon lemon pepper ADVERTISEMENT",
            "1 (4 pound) pork shoulder roast ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 cups dry white wine ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 goat horn peppers, or other hot green chiles, sliced ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1/4 cup garlic basil spread (see footnote for recipe link) ADVERTISEMENT",
            "1/4 cup Marsala wine ADVERTISEMENT",
            "1 cup prepared pesto sauce ADVERTISEMENT",
            "Assembly: ADVERTISEMENT",
            "4 Italian-style hoagie buns, split lengthwise ADVERTISEMENT",
            "2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 cup halved cherry tomatoes, divided ADVERTISEMENT",
            "1/2 cup chopped fresh basil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nCombine kosher salt, 1/4 cup black pepper, 1/4 cup Italian seasoning, rosemary, granulated garlic, granulated onion, 1 tablespoon red pepper flakes, and lemon pepper together in a bowl.\nPlace pork shoulder in a large roasting pan. Rub with lemon juice, 1 tablespoon olive oil, red wine vinegar, and Worcestershire sauce on all sides and between any crevices. Sprinkle with kosher salt mixture and rub over all sides. Pour white wine, chicken stock, and 4 crushed garlic cloves into the bottom of the roasting pan.\nCover pan tightly with heavy-duty aluminum foil and roast pork in the preheated oven until tender and a thermometer inserted reaches 200 degrees F (95 degrees C), 3 to 4 hours. Transfer pork to a cutting board and allow to cool slightly before pulling. Using two forks, shred the pork shoulder into bite-size pieces. Transfer meat to a large bowl and toss with some of the pan juices to keep it moist.\nIncrease oven temperature to 500 degrees F (260 degrees C).\nHeat 1 tablespoon olive oil in a large pot or Dutch oven over medium-high heat; cook and stir goat horn peppers, red bell pepper, onion, 1 tablespoon Italian seasoning, 1 teaspoon red pepper flakes, salt, and black pepper in the hot oil until onion softens and begins to turn golden, about 12 minutes.\nStir in mushrooms, garlic basil spread, and Marsala wine and cook until wine has reduced and mushrooms have softened, about 5 minutes. Mix pulled pork and pesto sauce into vegetables and heat through, about 10 minutes. Spoon pork mixture into hoagie buns and top each with 1/2 cup mozzarella cheese.\nPlace sandwiches onto a baking sheet and bake in the hot oven until cheese is melted and bread is toasted, about 5 minutes. Top with cherry tomatoes and basil.\n",
        "picture_link": "7fkprbfaA.IbDiLkTHEJrrMQXoOECna"
    },
    {
        "title": "Hearty Crab Pizza",
        "ingredients": [
            "1/2 teaspoon corn meal ADVERTISEMENT",
            "1 pre-baked pizza crust ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 (8 ounce) package imitation crabmeat, chopped ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1 cup whole kernel corn ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "dried Italian seasoning, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a pizza pan and sprinkle corn meal into pan.\nPoke several holes into pizza crust and place into the prepared pizza pan.\nBake in the preheated oven until crust is heated through, about 5 minutes. Remove crust and turn oven heat down to 400 degrees F (205 degrees C).\nMelt butter in a saucepan over medium-high heat; cook and stir onion and garlic in hot butter until onion is tender, about 5 minutes. Stir basil, oregano, and Parmesan cheese into onion and garlic. Spread onion mixture evenly over pizza crust; top with 1/2 cup shredded mozzarella cheese.\nHeat imitation crab in the saucepan over medium-high heat until warmed through, about 2 minutes. Sprinkle imitation crab over pizza, followed by tomato and corn kernels. Top pizza with remaining 1 1/2 cup mozzarella cheese. Season with Italian seasoning.\nBake in the hot oven until cheese is melted and crust is golden brown, 10 to 20 minutes.\n",
        "picture_link": "ZJSpoh7tFM1KTmpLbSQFARoSeahEuvm"
    },
    {
        "title": "Kiwi-Banana-Pineapple-Orange Smoothie",
        "ingredients": [
            "1 kiwifruit, peeled and sliced ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup diced pineapple ADVERTISEMENT",
            "1/4 cup coconut water ADVERTISEMENT",
            "1/4 cup low-fat vanilla yogurt ADVERTISEMENT",
            "1 teaspoon agave nectar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend kiwi, banana, orange juice, pineapple, coconut water, yogurt, and agave nectar in a blender until smooth.\n",
        "picture_link": "8GoorDMubYkMdyyMKwa.c9fQeVfSeKa"
    },
    {
        "title": "Sage Sausage and Cider Stuffing",
        "ingredients": [
            "1/2 pound bulk sage-flavored pork sausage ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 teaspoons chopped fresh sage ADVERTISEMENT",
            "1 Golden Delicious apple - peeled, cored, and diced ADVERTISEMENT",
            "2 teaspoons chicken soup base ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3/4 cup apple cider ADVERTISEMENT",
            "1/2 loaf Italian bread, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease a 2-quart baking dish.\nHeat a large skillet over medium-high heat. Cook and stir the sausage in the skillet until crumbly, evenly browned, and no longer pink. Drain and discard any excess grease; set the sausage aside in a mixing bowl. Melt the butter and olive oil in the skillet over medium heat; stir in the celery and onion. Cook and stir until the onion has softened and turned translucent, about 5 minutes.\nStir the cooked sausage into the onions along with the sage and apples. Continue cooking until the apples are just turning soft, about 5 minutes more. Whisk the chicken soup base and water together in a bowl until dissolved. Add the apple cider; stir in the sausage mixture along with the bread cubes until the bread is moist. Pack the stuffing into the prepared baking dish.\nBake uncovered in the preheated oven until lightly browned and the edges are crisp, about 30 minutes.\n",
        "picture_link": ".r5becTrc9DOWQgl3dkcqhuDa5IQL/K"
    },
    {
        "title": "Rasgullas",
        "ingredients": [
            "6 cups milk ADVERTISEMENT",
            "3 tablespoons fresh lime juice ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the milk to a boil in a heavy-bottomed pan till it starts foaming; immediately add the lime juice and stir. It will curdle right away. You should see the milk solids (chenna) separate from the whey. Pour into a colander lined with cheesecloth; rinse the chenna with cold water to get rid of the lime juice. Allow the water to drain completely.\nGather the muslin cloth edges like a parcel and express as much water as possible; what you now have is soft paneer. Turn the paneer onto a rolling mat or other smooth surface. Knead the paneer well to make a smooth paste. Roll into a ball and divide into 20 equal portions.\nBring the water to a boil in a pressure cooker; stir the sugar into the boiling water until dissolved.\nRoll each portion of paneer into a smooth ball between your palms, making sure there are no cracks; gently drop the balls into the hot syrup. Secure the lid onto the pressure cooker and bring to pressure. Reduce heat to medium-low and pressure cook for 6 minutes.\nRelease the pressure from the cooker while running under water; remove the lid. The rasgullas should be floating on the syrup and have expanded 2 or 3 times in size. Pour the rasgullas and syrup into a bowl. Gently stir the cardamom into the mixture. Refrigerate to chill completely before serving cold.\n",
        "picture_link": "0ZgRcQRxLnhseTip1yA1ELwAudZjqPe"
    },
    {
        "title": "Candied Cashew and Pear Salad",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "2 1/2 cups cashews ADVERTISEMENT",
            "2 cups frozen raspberries, thawed ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/2 cup extra virgin olive oil ADVERTISEMENT",
            "3 chopped hearts of romaine ADVERTISEMENT",
            "1 (10 ounce) bag fresh baby spinach ADVERTISEMENT",
            "3 pears, cored and diced ADVERTISEMENT",
            "1/2 cup dried cherries ADVERTISEMENT",
            "1 cup feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with aluminum foil. Place the sugar and cinnamon into a saucepan. Melt the sugar over medium heat without stirring. Add the cashews, and stir until well coated, then spread out onto the prepared baking sheet to cool to room temperature.\nPuree the raspberries, vinegar, and olive oil until smooth; set aside. Toss together the romaine, spinach, pears, cherries, and feta cheese in a large bowl. Toss with half of the raspberry dressing, and sprinkle with candied cashews. Serve with remaining dressing on the side.\n",
        "picture_link": "bK5Q943ZB/9nlyqOLMbbLKsr0b.juQq"
    },
    {
        "title": "Chettinad-Style Chicken",
        "ingredients": [
            "2 1/4 pounds skinless, boneless chicken breast, cut into bite-sized chunks ADVERTISEMENT",
            "1 teaspoon turmeric ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons poppy seeds ADVERTISEMENT",
            "2 teaspoons whole black peppercorns ADVERTISEMENT",
            "2 teaspoons fennel seed ADVERTISEMENT",
            "2 teaspoons coriander seed ADVERTISEMENT",
            "1 teaspoon cumin seed ADVERTISEMENT",
            "3 large onions, minced ADVERTISEMENT",
            "4 green chile peppers, chopped ADVERTISEMENT",
            "2 sprigs fresh curry leaves ADVERTISEMENT",
            "1 tablespoon ginger paste ADVERTISEMENT",
            "1 teaspoon garlic paste ADVERTISEMENT",
            "1 cup chopped fresh tomatoes ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub the chicken pieces with the turmeric and salt. Set aside.\nHeat the oil in a large skillet or kadhai over medium heat. Fry the poppy seeds, peppercorns, fennel seed, coriander seed, and cumin seed in the hot oil until they just begin to change color; remove from the skillet, keeping the oil in the skillet. Grind the spice mixture with a mortar and pestle and set aside.\nAdd the onion, green chile peppers, curry leaves, ginger paste, and garlic paste to the remaining oil; cook until the onions are golden brown, 7 to 10 minutes. Stir the tomatoes and ground spices into the mixture; cook until the tomatoes are softened. Add the chicken. Season with salt and simmer for 5 minutes. Pour the water over the mixture, cover, and cook until the chicken is no longer pink in the middle and the juices run clear, about 30 minutes. Serve hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mango-Cherry Chicken",
        "ingredients": [
            "2 tablespoons cooking oil ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves - rinsed and patted dry ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 fresh jalapeno pepper, sliced into rings ADVERTISEMENT",
            "1 pound frozen tart cherries, thawed and roughly chopped ADVERTISEMENT",
            "1 pound frozen mango chunks, thawed and roughly chopped ADVERTISEMENT",
            "2 cups sparkling cherry juice (such as R.W. Knudsen®) ADVERTISEMENT",
            "1/4 cup fresh lemon juice, or to taste ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large, deep skillet over medium heat. Sprinkle salt over both sides of each piece of chicken; cook the chicken in the hot oil until browned on both sides, but still slightly pink in the center, 3 to 5 minutes per side. Remove chicken to a plate and set aside. Add the onion, garlic, and jalapeno pepper to the remaining oil in the skillet; cook and stir until the onion is tender and beginning to brown, 5 to 7 minutes. Stir the cherry and mango into the mixture; cook and stir until the liquid in the pan is slightly thickened, 3 to 5 minutes. Add the cherry juice, lemon juice, and brown sugar to the mixture; stir and return to a simmer.\nReturn the chicken to the pan. Ladle some of the sauce over the chicken to cover. Return the mixture to a simmer and cook until the liquid thickens and the chicken is no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ada (Adai)",
        "ingredients": [
            "1 cup split Bengal gram (chana dal) ADVERTISEMENT",
            "1 cup skinned split black lentils (urad dal) ADVERTISEMENT",
            "1/2 cup split yellow lentils (moong dal) ADVERTISEMENT",
            "1 cup rice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 dried red chile peppers, or to taste ADVERTISEMENT",
            "water, as needed ADVERTISEMENT",
            "2 tablespoons cumin seeds ADVERTISEMENT",
            "2 tablespoons cooking oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chana dal, urad dal, moong dal, and rice into a large bowl and cover with several inches of cool water; allow to soak 8 hours to overnight.\nGrind the soaked dal and rice with the salt and red chile peppers into a paste using a mortar and pestle. Add enough water to the mixture to make a batter just thin enough to spread. Stir the cumin seeds into the batter.\nHeat a griddle (or a tawa) over medium heat. Gently grease the griddle with oil on the edges and the middle. Ladle the batter on the tawa and spread into a thin circle using the back of the ladle or a large spoon. Cook for a few minutes and flip over to the other side. Cook a few more minutes, transfer to a plate, and serve immediately. Adas are best eaten hot off the griddle.\n",
        "picture_link": "ZoxmM3j7F1243macWK6WVv/iW6jEGJW"
    },
    {
        "title": "Classic Lukshen Noodle Kugel",
        "ingredients": [
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "1/3 cup vegetable oil, divided ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain well in a colander set in the sink.\nPreheat an oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon of the vegetable oil in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is golden brown, 10 to 15 minutes more. Combine the noodles, onion, eggs, remaining vegetable oil, salt, and pepper in a large bowl. Pour mixture into an 8-inch square pan.\nBake in the preheated oven until firm, about 35 minutes.\n",
        "picture_link": "XD4OkxAMLg9tjIrnYESzGf58yiDLq9O"
    },
    {
        "title": "Salmon and Garbanzo Bean Soup",
        "ingredients": [
            "1/2 pound bacon, chopped ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 pound salmon fillets, cut into 1 inch cubes ADVERTISEMENT",
            "5 cups chicken broth ADVERTISEMENT",
            "1 bunch fresh spinach, rinsed and thinly sliced ADVERTISEMENT",
            "1 (14 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon in a large pot over medium-high heat until the fat has rendered out and the bacon begins to crisp. Pour out the excess grease, then stir in the onion. Continue cooking and stirring until the onion has turned golden-brown, 5 to 8 minutes more. Add the salmon cubes, and cook gently until they turn opaque on all sides, but are not yet cooked in the center.\nIncrease heat to high, and pour in the chicken broth. Once the soup begins to simmer, reduce heat to medium-low, and cook for 10 minutes. Stir in the spinach and garbanzo beans, return to a simmer, then season to taste with salt and pepper, and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Duck Fried Rice",
        "ingredients": [
            "1 cup chopped Chinese roast duck meat, skin and fat separated and set aside ADVERTISEMENT",
            "1/2 cup thinly sliced Chinese barbecued pork ADVERTISEMENT",
            "6 green onions, thinly sliced ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3 cups cooked long-grain rice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the duck skin and fat in a wok or large skillet over medium heat until the skin is crispy, and the fat has rendered, about 10 minutes. Increase heat to medium-high, and stir in the duck meat, pork, half of the green onions, and the soy sauce. Cook and stir until the meats are heated through, about 5 minutes.\nAdd rice and toss together until rice is hot and sizzling, about 5 minutes. Make a wide well in the middle of the rice, exposing the bottom of the pan. Pour in the beaten eggs and stir until the eggs have scrambled. Then stir the scrambled eggs into the rice along with the rest of the green onions. Toss and stir until the rice is very hot, about 5 minutes. Season to taste with salt and pepper before serving.\n",
        "picture_link": "xO6XwhIjEY2kbWbiLKktOnZwlvIPIs."
    },
    {
        "title": "Boneless Pork Chops and Apples",
        "ingredients": [
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup kosher salt ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "4 (8 ounce) thick-cut boneless pork chops ADVERTISEMENT",
            "1 pinch coarse-ground black pepper ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 sprigs fresh rosemary ADVERTISEMENT",
            "2 apples, cored and quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir honey and salt into water in a large bowl until honey and salt are dissolved into the brine. Place pork chops in the brine and let sit in the refrigerator for 2 hours.\nRemove pork chops from brine, rinse, and pat dry. Place chops on a plate and refrigerate until dry, about 10 minutes. Discard brine.\nPreheat oven to 350 degrees F (175 degrees C). Sprinkle pepper over the pork chops.\nMelt butter and olive oil in a cast-iron skillet over medium heat; cook pork chops until browned, 3 to 5 minutes. Flip pork chops and season with rosemary; add apples. Cover skillet.\nBake in the preheated oven until pork chops are cooked through, about 12 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove pork chops from skillet and allow to rest a few minutes before serving.\n",
        "picture_link": ".ps26tKDaSsR2FaqrIVeGdbPIaWHDUy"
    },
    {
        "title": "Polish Beet Soup",
        "ingredients": [
            "1 1/4 pounds beets with greens attached ADVERTISEMENT",
            "6 cups low-sodium chicken broth ADVERTISEMENT",
            "2 leeks, white and light green parts only, chopped and washed ADVERTISEMENT",
            "1/2 pound celery root, peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "1 cup 1/2-inch cubed carrots ADVERTISEMENT",
            "1/4 pound parsnips, peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "3 cups 1/2-inch cubed boiling potatoes ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons chopped fresh dill, or to taste ADVERTISEMENT",
            "6 hard-boiled eggs, quartered lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim greens and stems from beets. Thoroughly wash and chop greens and stems. Peel and cut beets into 1/2-inch cubes.\nBring beets, chicken broth, leeks, celery root, carrots, and parsnips to a boil in a large pot. Add potatoes, reduce heat to medium-low, and simmer until vegetables are tender, 10 to 12 minutes. Stir beet greens and stems into soup and simmer until greens and stems are tender, about 5 minutes. Mix sugar, lemon juice, and salt into soup.\nStir sour cream and flour together in a bowl until smooth and thickened. Whisk 1 cup soup into sour cream mixture until smooth; pour sour cream mixture into soup and stir. Simmer soup until thickened slightly, about 1 minute. Add dill and remove pot from heat. Ladle soup into serving bowls and arrange 4 egg quarters in each bowl.\n",
        "picture_link": "OTqLoqJfyNjVhccpWsQcWnnEQoK/d8S"
    },
    {
        "title": "Spicy Sushi Mayo",
        "ingredients": [
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 teaspoons Sriracha hot sauce ADVERTISEMENT",
            "1/4 teaspoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mayonnaise, Sriracha hot sauce, and sesame oil together in a bowl using a fork until smooth.\n",
        "picture_link": "VQd8DOkjRBzhttJmWMFySOagX9yQWia"
    },
    {
        "title": "Rick's Spicy Beans and Ham",
        "ingredients": [
            "1 (16 ounce) package dried white navy beans ADVERTISEMENT",
            "1 (16 ounce) package 12-bean soup mix ADVERTISEMENT",
            "2 tablespoons butter, or to taste ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "4 carrots, chopped ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "4 smoked ham hocks, or more to taste ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "2 (6 ounce) cans chopped green chiles ADVERTISEMENT",
            "2 tablespoons chicken soup base ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse navy beans and 12-bean mix thoroughly and set aside.\nMelt butter in a large stockpot over medium-high heat; saute onions, carrots, and celery until onions are clear and soft, 15 to 20 minutes.\nMix bean mixture, ham hocks, tomatoes, beer, green chiles, chicken soup base, chili powder, cumin, and cayenne pepper into onion mixture; add enough water to fill the pot. Bring liquid to a boil, reduce heat to low, and simmer, stirring occasionally, until beans are soft, 6 to 8 hours.\n",
        "picture_link": "5hqhhsJe5V1F6cMZpKfNe1z4/qLzNUa"
    },
    {
        "title": "Cheesy Buttery Puff",
        "ingredients": [
            "10 RITZ Crackers, crushed ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 pound VELVEETA®, cut into 1/2-inch cubes ADVERTISEMENT",
            "4 ounces PHILADELPHIA® Cream Cheese, cubed, softened ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "3 tablespoons chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F.\nSpread cracker crumbs onto bottom of 9-inch square baking dish sprayed with cooking spray. MICROWAVE milk, VELVEETA and cream cheese in large microwaveable bowl on HIGH 1-1/2 min. or until smooth, stirring after each minute. Whisk egg yolks and chives until well blended. Stir into VELVEETA mixture.\nBeat egg whites in small bowl with mixer on high speed until stiff peaks form; gently stir into VELVEETA mixture. Pour into prepared dish.\nBake 20 to 25 min. or until puffed and golden. Serve immediately.\n",
        "picture_link": "XnfYnArjxXxaYbyoO2t7giWTcIj4RFm"
    },
    {
        "title": "Easy Fresh Corn Fritters",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "1 2/3 cups fresh corn kernels ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "1/4 cup sifted all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 dash ground red pepper ADVERTISEMENT",
            "6 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites in a glass or metal bowl until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks.\nMix corn, egg yolks, flour, salt, and red pepper together in a large bowl; fold beaten egg whites into the corn mixture.\nHeat oil in a large skillet over medium-high heat. Working in batches, drop corn mixture into hot oil by the tablespoonful in several spots without crowding the pan; cook until browned and set, 2 to 3 minutes per side. Repeat with remaining batter.\n",
        "picture_link": "ASJRNeXMMs3UAFc.O/t2Ki67OwWPATO"
    },
    {
        "title": "Buffalo Chicken Macaroni and Cheese",
        "ingredients": [
            "1/2 pound cubed cooked chicken ADVERTISEMENT",
            "2 tablespoons hot sauce, or to taste ADVERTISEMENT",
            "2 tablespoons ranch dressing, or to taste ADVERTISEMENT",
            "1 (7.25 ounce) package macaroni and cheese mix ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1/4 cup 2% milk ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 tablespoons crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix chicken, hot sauce, and ranch dressing together in a bowl until coated; set aside for flavors to blend.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain and transfer back to the pot. Stir margarine, milk, and cheese powder into pasta until sauce is smooth.\nPour half of the macaroni and cheese into an 8-inch square casserole dish; top with chicken mixture, celery, and blue cheese. Spread remaining macaroni and cheese on top of blue cheese layer.\nBake in the preheated oven until chicken is warmed and casserole is bubbling, about 15 minutes.\n",
        "picture_link": "unH1HwhL2d49xIspGOk5A2N3Ac5r7US"
    },
    {
        "title": "Breakfast Pasta",
        "ingredients": [
            "1/2 (14 ounce) package spaghetti ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "1/4 cup chopped baby bella (crimini) mushrooms ADVERTISEMENT",
            "1/4 cup frozen peas ADVERTISEMENT",
            "1/4 cup shredded carrots ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\nHeat 1 tablespoon oil in a skillet over medium heat; cook and stir eggs in the hot oil until set and scrambled, about 5 minutes.\nHeat remaining 2 tablespoons oil in a separate skillet over medium-high heat; saute onion, mushrooms, peas, and carrots until onion is browned, about 10 minutes. Add pasta to onion mixture and toss. Add eggs and mix well. Sprinkle Parmesan cheese, salt, and pepper over pasta mixture and toss.\n",
        "picture_link": "cDdL4Uof5NhIO/09RULLokkkqYTwcu."
    },
    {
        "title": "Easy Baked Doughnuts",
        "ingredients": [
            "Doughnuts: ADVERTISEMENT",
            "2 cups baking mix (such as Bisquick ®) ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "Coating: ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix baking mix, milk, egg, 2 tablespoons sugar, and cinnamon together in a bowl with a whisk, beating vigorously for 20 strokes. Transfer dough to a floured work surface and knead 5 times. Roll dough into 1/2-inch thickness and cut with a floured doughnut cutter. Place doughnuts onto a baking sheet.\nBake in the preheated oven until cooked through and lightly browned, 7 to 9 minutes.\nPour melted butter into a bowl. Place 1/2 cup sugar in a separate bowl. Dip doughnuts into butter; transfer to sugar and lightly press until doughnuts are coated.\n",
        "picture_link": "4drehbKVcE7.MYREZpZKo7FStWCanSe"
    },
    {
        "title": "Shrimp Goat Cheese Watermelon Salad Stack",
        "ingredients": [
            "8 large shrimp, peeled and deveined ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon smoked paprika ADVERTISEMENT",
            "1/4 teaspoon chipotle pepper powder (optional) ADVERTISEMENT",
            "1 seedless watermelon, cut crosswise into 2-inch thick slices ADVERTISEMENT",
            "1 (8 ounce) goat cheese log, cut into 8 slices ADVERTISEMENT",
            "2 teaspoons balsamic vinegar ADVERTISEMENT",
            "4 sprigs fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 430 degrees F (220 degrees C).\nSeason shrimp all over with onion powder, garlic powder, salt, smoked paprika, and chipotle pepper powder. Set shrimp into a baking dish.\nBake shrimp in the preheated oven until bright pink on the outside and the meat is no longer transparent in the center, about 8 minutes.\nUse a ring mold (slightly larger in diameter than the diameter of the goat cheese slices) to cut watermelon into circle shapes. Cut circle shapes into twelve 1/4-inch thick slices.\nPlace a slice of watermelon on a plate. Top with 1 slice cheese, 1 slice watermelon, 1 slice cheese, 1 slice watermelon, 2 shrimp, respectively, to form a salad stack. Repeat with remaining watermelon slices, cheese, and shrimp. Drizzle balsamic vinegar over each stack and garnish with basil.\n",
        "picture_link": "Yzcav9Ge5PmFCrGxfcXhcpKigHnmsSq"
    },
    {
        "title": "Quick Red Curry Soup",
        "ingredients": [
            "1/4 cup red curry paste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cups coconut milk ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1 lime, zested ADVERTISEMENT",
            "2 cups cherry tomatoes ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 pound shrimp ADVERTISEMENT",
            "1 (14 ounce) can bean sprouts, drained ADVERTISEMENT",
            "1 cup chopped cooked chicken ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir red curry paste and olive oil together in a saucepan over low heat and cook until fragrant, about 5 minutes.\nPour coconut milk, chicken stock, lime juice, and lime zest into the saucepan. Bring the mixture to a boil, reduce heat to medium-low, and cook, at a simmer for 10 minutes.\nStir cherry tomatoes and cilantro into the soup; bring mixture again to a simmer and cook until the tomatoes are soft, 10 to 15 minutes.\nStir shrimp, bean sprouts, and cooked chicken into the soup; cook until shrimp are bright pink on the outside and the meat is no longer transparent in the center, 10 to 15 minutes. Season soup with salt and pepper.\n",
        "picture_link": "XaS2tkIjrkCeg/vXlrWZZT7RNFmZJeK"
    },
    {
        "title": "All Natural Ramen Noodles",
        "ingredients": [
            "4 cups vegetable broth ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "1 tablespoon Sriracha hot sauce ADVERTISEMENT",
            "9 ounces soba noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine broth, water, soy sauce, sesame oil, ginger, and hot sauce in a pot; bring to a boil. Add noodles to boiling broth mixture and cook until noodles are tender yet firm to the bite, 5 to 7 minutes. Transfer noodles to serving bowls and top with desired amount of broth.\n",
        "picture_link": "mYSOaocy9bT.pEq7Pjg6l9WKMw/PcGi"
    },
    {
        "title": "Mexican Style Lasagna",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 pound Mexican VELVEETA®, cut into 1/2-inch cubes ADVERTISEMENT",
            "3/4 cup TACO BELL® Thick 'N Chunky Medium Salsa ADVERTISEMENT",
            "6 (6 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup KRAFT Shredded Cheddar & Monterey Jack Cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F.\nBrown meat in large skillet; drain. Add water and VELVEETA; stir until VELVEETA is melted. Remove from heat. Stir in salsa.\nSpread 1/4 of meat mixture into 8-inch square baking dish sprayed with cooking spray; top with 2 tortillas. Repeat layers 2 times. Top with remaining meat mixture and shredded cheese. Cover.\nBake 30 min. Uncover. Let stand 5 min. before serving.\n",
        "picture_link": "fvVFn1EzdjQgt2vfvqs7Nnw3ddxZFli"
    },
    {
        "title": "Harmon's Brunswick Stew ",
        "ingredients": [
            "1 tablespoon butter, or as needed ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 (16.5 ounce) cans cream-style corn ADVERTISEMENT",
            "2 (14.5 ounce) cans crushed tomatoes ADVERTISEMENT",
            "2 (5 ounce) cans white chicken chunks (such as Swanson®), drained ADVERTISEMENT",
            "1 (10 ounce) can pork in barbeque sauce (such as Vietti®) ADVERTISEMENT",
            "1 (10 ounce) can beef in barbeque sauce (such as Vietti®) ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon hot sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium-high heat. Saute onion in melted butter until tender, 5 to 7 minutes.\nStir sauteed onion, cream-style corn, crushed tomatoes, white chicken chunks, pork in barbeque sauce, beef in barbeque sauce, Worcestershire sauce, black pepper, salt, and hot sauce together in a slow cooker crock.\nCook on High until hot, at least 30 minutes.\n",
        "picture_link": "/j0QQwXjS5QxET5piILhZVD0KocbqNC"
    },
    {
        "title": "Slow Cooker Red Beans and Rice Soup",
        "ingredients": [
            "4 1/2 cups water ADVERTISEMENT",
            "14 ounces smoked sausage (such as Healthy Choice®), quartered lengthwise and cut into 1/4-inch pieces ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "2 ribs celery, chopped ADVERTISEMENT",
            "2 cubes chicken bouillon (such as Knorr®) ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/4 cup long-grain rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, sausage, kidney beans, onion, celery, chicken bouillon, Cajun seasoning, garlic salt, and thyme in a slow cooker.\nCook on High for 4 hours. Add rice and cook until rice is tender, about 1 hour more.\n",
        "picture_link": "qhFWIVCnzNZG/6kwx5qs5GJEbzg3KmW"
    },
    {
        "title": "Fudgy Nutella® Mug Cake",
        "ingredients": [
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons coconut flour ADVERTISEMENT",
            "1 tablespoon cocoa powder ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "3 1/2 tablespoons almond milk, divided ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons chocolate-hazelnut spread (such as Nutella®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir all-purpose flour, coconut flour, cocoa powder and baking powder together in a small bowl; add 3 tablespoons almond milk, vanilla extract, Nutella(R) and 1/2 tablespoon milk, respectively, stirring between each addition until you finally have a smooth batter. Transfer batter to mug.\nCook in microwave for 1 minute. Allow to rest for about 5 seconds and continue cooking until a toothpick inserted in the center comes out clean, about 30 seconds more.\nLet cake cool for 2 to 4 minutes.\n",
        "picture_link": "hf7V0LFBOu7OAqeH1H8LfAiiniLQNbi"
    },
    {
        "title": "Pineapple Upside Down Monkey Bread",
        "ingredients": [
            "2 (16 ounce) cans refrigerated buttermilk biscuit dough ADVERTISEMENT",
            "butter-flavored cooking spray ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pineapple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 12-cup tube pan(such as Bundt(R)).\nUnroll and separate biscuits; cut each portion into four or six pieces, depending on your preference. Spray cut biscuits with cooking spray to coat.\nPour white sugar into gallon-size resealable plastic bag; add biscuits to bag, seal bag, and shake to coat.\nMelt butter in a saucepan over low heat; stir brown sugar and vanilla into the melted butter to dissolve the sugar. Pour butter mixture into the prepared tube pan. Sprinkle chopped pineapple evenly around the pan atop the butter mixture; top with sugar-coated biscuit dough.\nBake in preheated oven until golden brown, 40 to 50 minutes; let cook in pan for 5 to 10 minutes before inverting onto a serving platter.\n",
        "picture_link": "qZbjVMqlB6nkWZ52UFk4UpyMjG/6jIC"
    },
    {
        "title": "Amazing Chocolate Beet Cake",
        "ingredients": [
            "1 (15 ounce) can sliced beets, drained with 1/2 cup liquid reserved ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease three 8x4x2-inch bread pans.\nBlend beets and reserved liquid in a blender until smooth.\nBeat pureed beets, sugar, eggs, olive oil, and vanilla extract together in a large bowl until smooth.\nMix flour cocoa powder, baking soda, and salt together in a separate bowl; add to the beet mixture and stir into a smooth batter. Fold chocolate chips into the batter. Pour batter into prepared bread pans to about 3/4-full.\nBake in preheated oven until a toothpick inserted into the center comes out clean, 30 to 40 minutes.\n",
        "picture_link": "uRTzKe3jbHqqSLqtDPLjXxWb1ghvVWu"
    },
    {
        "title": "Easy Brunswick Stew",
        "ingredients": [
            "3 (15 ounce) cans cream-style corn ADVERTISEMENT",
            "3 (14 ounce) cans diced tomatoes, drained ADVERTISEMENT",
            "33 ounces cooked diced chicken breast ADVERTISEMENT",
            "18 ounces shredded cooked pork ADVERTISEMENT",
            "1 (15.25 ounce) can sweet corn, drained ADVERTISEMENT",
            "1 1/2 cups ketchup ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup bacon drippings ADVERTISEMENT",
            "1/3 cup hickory smoke-flavored barbeque sauce ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon hot sauce (such as Tabasco® Green Jalapeno Sauce) ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cream-style corn, diced tomatoes, chicken, pork, sweet corn, ketchup, tomato sauce, water, bacon drippings, barbeque sauce, Worcestershire sauce, hot sauce, and black pepper together in a Dutch oven or stockpot; simmer over low heat until heated through, 20 to 45 minutes.\n",
        "picture_link": "cpbKiXu0GLP39sfJe/HLfhYzexJXrim"
    },
    {
        "title": "Banana Chiffon Cake",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 cups white sugar, divided ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 eggs, separated, divided ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "2 bananas, mashed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSift flour, 1/2 of the sugar, baking powder, and salt together in a bowl. Add egg yolks, water, oil, and vanilla extract and beat until smooth.\nBeat egg whites and cream of tartar together in a bowl using an electric mixer until soft peaks form. Continue beating until stiff and shiny peaks form; add remaining sugar and beat until incorporated. Fold egg yolk mixture and bananas into egg white mixture just until blended. Slowly pour batter into a 10-inch tube pan.\nBake in the preheated oven until cake springs back when lightly touched, 55 to 65 minutes. Invert pan onto a plate and cool. Loosen edges of cake and remove pan.\n",
        "picture_link": "BF5iaqSGIx46HaNhnCmRr3cjipzSVYy"
    },
    {
        "title": "King Kamehameha Pie",
        "ingredients": [
            "1 1/2 cups unsweetened pineapple juice ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "7 cups thinly sliced apples ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large saucepan, combine l l/4 cup pineapple juice and sugar. Bring to a boil, and add apples. Cover, and simmer until apples are tender but not soft - 3 to 4 minutes. Lift apples from syrup, and set aside.\nCombine cornstarch with remaining 1/4 cup pineapple juice, and add to syrup in pan. Cook, stirring constantly, until thick and bubbly; cook one minute more. Remove pan from heat. Stir butter or margarine, vanilla, and salt into the syrup. Cool 10 minutes without stirring.\nPour about half of the syrup into baked pie shell, spreading it to cover bottom evenly. Arrange cooked apples over syrup in crust. Spoon remaining syrup over apples. Chill.\n",
        "picture_link": "ObyqxH3msveHuVmVZ7SfXwGGeDRsPfO"
    },
    {
        "title": "Peanutty Ice Cream Pie",
        "ingredients": [
            "1 1/3 cups finely chopped peanuts ADVERTISEMENT",
            "3 tablespoons margarine, melted ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "3 tablespoons chopped peanuts ADVERTISEMENT",
            "1 quart vanilla ice cream, softened ADVERTISEMENT",
            "1/4 cup mini candy-coated chocolate pieces (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the peanuts, butter and sugar; press onto the bottom and up the sides of a greased 9-inch pie plate. Cover and refrigerate for 15 minutes.\nIn a large bowl, combine peanut butter and corn syrup. Add coconut and peanuts. Stir in ice cream just until combined. Spoon into crust.\nCover and freeze overnight or until firm. Just before serving, sprinkle with mini candy-coated chocolate pieces, if desired.\n",
        "picture_link": "no.55wy36OQQm7eqr9r56sbL5bxW7vy"
    },
    {
        "title": "Maple Pecan Pie I",
        "ingredients": [
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 cups pecan halves ADVERTISEMENT",
            "1 cup real maple syrup ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSpread the nuts evenly over pie shell.\nMix together butter or margarine, vanilla, and flour. Beat the eggs well, and blend into the flour mixture. Add salt, maple syrup, and cream. Pour filling over the nuts in the pie shell. Make sure the nuts are covered, so they will not burn.\nBake for 50 to 60 minutes, or until knife inserted in center come out clean. Let cool at least 15 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Jeff Davis Pie I",
        "ingredients": [
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the sugar, flour and spices. Stir in butter. Beat in eggs and add milk and vanilla. Mix well.\nPour into unbaked pie shell. Bake 10 to 15 minutes at 400 degrees F (205 degrees C), then reduce heat to 350 degrees F (175 degrees C) and bake 30 minutes more or until pie sets.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Oatmeal Pie I",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "3/4 cup dark corn syrup ADVERTISEMENT",
            "3/4 cup quick cooking oats ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup flaked coconut ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, beat the eggs well. Stir in sugar, butter or margarine, corn syrup, oatmeal, vanilla, and salt. Pour mixture into the pie shell, and top with coconut.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes. Cool before serving.\n",
        "picture_link": "DtQEY/llLpPOkkzO8ZulOnJHnAmgnyq"
    },
    {
        "title": "Shamrock Silk Pie",
        "ingredients": [
            "1 (15 ounce) package frozen prepared pie crusts, thawed ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup Irish Mist liqueur ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 tablespoon Irish Mist liqueur ADVERTISEMENT",
            "3 drops green food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Prepare pie crust according to package directions for a filled one crust pie. In a microwave-safe bowl, microwave chocolate chips until melted. Stir occasionally until chocolate is smooth.\nIn a large bowl, combine cream cheese, sugar, and flour. Mix with an electric mixer at medium speed until well blended. Add melted chocolate, eggs, and 1/4 cup liqueur. Mix well. Fold in 1 cup whipped topping. Pour filling into the pie shell.\nBake for 30 to 35 minutes, or until knife inserted in center comes out clean. Cool.\nCombine remaining whipped topping, 1 tablespoon liqueur, and the food coloring. Spread over pie.\n",
        "picture_link": "7IfBsQWxRSKrjPXnJIM0L0Kgf5X8292"
    },
    {
        "title": "Rum Cream Pie",
        "ingredients": [
            "2 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1/2 cup rum ADVERTISEMENT",
            "1/8 cup grated semisweet chocolate, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the cold water into a small bowl and sprinkle with the gelatin. Set aside and allow the gelatin to soften.\nCombine the egg yolks and sugar in a heat-proof mixing bowl. Beat with a hand mixer or a whisk until the mixture is thick and lemon-colored. Set the bowl over a pot of simmering water on the stove and cook, stirring constantly, about 5 minutes. The mixture should feel hot to the touch and have reached 145 degrees F (63 degrees C) on an instant-read thermometer.\nRemove the bowl from the heat and mix in the rehydrated gelatin. Stir until the gelatin dissolves and allow the mixture to cool to room temperature.\nWhip the cream to medium-stiff peaks; stir in the rum. Fold the whipped cream into the egg mixture. Pour the filling into the two pie shells and sprinkle with chocolate shavings. Chill the pies for at least 6 hours or overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pecan Pie II",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup dark corn syrup ADVERTISEMENT",
            "1 1/2 cups pecan halves ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bake pie shell at 450 degrees F (230 degrees C) for 5 minutes. Cool. Turn oven down to 425 degrees F (220 degrees C).\nBeat eggs and salt until very light and lemon colored. Beat in sugar a little at a time. With a wire whisk, fold in melted butter or margarine, and corn syrup. Pour into partially baked shell. Arrange pecan halves on top, broken side down.\nBake for 10 minutes, and reduce heat to 325 degrees F (165 degrees C). Bake for 30 minutes.\n",
        "picture_link": "YSyIHfVe.zDyZEih.C.lMobuiqz5Oei"
    },
    {
        "title": "Chocolate Chip Pie II",
        "ingredients": [
            "18 graham crackers ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "27 large marshmallows ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup frozen whipped topping, thawed ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Roll graham crackers to fine crumbs; there should be about 1 cup. Melt the butter or margarine, and combine with the crumbs. Pat into 9 inch pie plate. Chill.\nHeat 24 to 30 large marshmallows slowly in the milk. Cool. Fold in whipped topping, vanilla and grated bitter chocolate. Pour filling into crust, and refrigerate l hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pumpkin Pecan Pie II",
        "ingredients": [
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup canned pumpkin ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1/2 cup dark corn syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together 3/4 to 1 cup brown sugar, 1/2 teaspoon ground cinnamon, and 1/4 teaspoon salt. Stir in 1 canned pumpkin, eggs, corn syrup, and 1 teaspoon vanilla.\nPour mixture into pie shell and sprinkle with pecans. Arrange additional pecans, if desired, for a \"pretty\" pie.\nBake 350 degrees F (175 degrees C) for 40 minutes. Cool. Serve with spicy whipped cream.\nTo Make Spicy Whipped Cream: In medium bowl, mix 1/2 cup brown sugar, 1/2 teaspoon cinnamon, 1/8 teaspoon nutmeg. Stir in 3/4 cup whipping cream and 1/2 teaspoon vanilla. Chill 1 hour. Whip until stiff.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange Blueberry Pie",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "3 tablespoons orange juice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (3 ounce) package orange flavored Jell-O® mix ADVERTISEMENT",
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "1 1/2 teaspoons orange zest ADVERTISEMENT",
            "1 pint fresh blueberries ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slightly beat egg yolks. Combine yolks, I cup water, and 1/4 cup sugar in saucepan. Cook and stir over low heat until mixture is slightly thickened. Remove from heat. Add gelatin, and stir until dissolved. Add 1/2 cup water, orange rind, and orange juice. Chill until slightly thickened.\nBeat egg whites and salt until foamy. Gradually beat in 1/4 cup sugar, and continue beating until stiff peaks are formed. Fold in thickened gelatin. Blend well. Fold in 1 1/2 cups blueberries. Spoon filling into pie shell. Chill until firm.\nBeat whipping cream until soft peaks form. Top individual servings with whipped cream and remaining blueberries.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "My Own Macaroni and Cheese",
        "ingredients": [
            "2 slices bacon ADVERTISEMENT",
            "4 cups macaroni ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tomato, sliced ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nIn large pot, cook macaroni pasta in boiling salted water with a pinch of basil and one teaspoon of olive oil until al dente. Rinse with cool water. Drain.\nMeanwhile, use a blender to mash the whole peeled tomatoes. In a large bowl combine mashed tomatoes, 1 cup of the grated Cheddar cheese, chopped bacon and bell green pepper, bacon, and chopped carrots. Mix well. Add the cooked macaroni and toss well to coat evenly.\nPlace in 2 quart baking dish. Sprinkle the remaining 1 cup grated Cheddar cheese and 2 teaspoons basil on top. Layer the sliced tomatoes over all.\nBake in preheated oven for 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Better Butter Beer",
        "ingredients": [
            "2 tablespoons butterscotch ice cream topping ADVERTISEMENT",
            "10 fluid ounces seltzer water ADVERTISEMENT",
            "2 scoops vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spoon butterscotch topping into a tall glass. Whisk 1 to 2 fluid ounces seltzer water into butterscotch topping until topping is slightly thinned. Add the remaining seltzer water until glass is 3/4 full. Gently scoop ice cream into glass.\n",
        "picture_link": "9ik7CVnbANhTRy.iZFulflvkJqK.BHO"
    },
    {
        "title": "Peachy Keen Long Island Iced Tea",
        "ingredients": [
            "1 fluid ounce peach schnapps ADVERTISEMENT",
            "1 fluid ounce vodka ADVERTISEMENT",
            "1 fluid ounce gin ADVERTISEMENT",
            "1 fluid ounce gold tequila ADVERTISEMENT",
            "1 fluid ounce rum ADVERTISEMENT",
            "3 fluid ounces sweet and sour mix ADVERTISEMENT",
            "1 fluid ounce cola, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large glass with ice. Pour peach schnapps, vodka, gin, tequila, and rum over the ice; stir in sweet and sour mix. Top with a splash of cola; stir.\n",
        "picture_link": "lASYPZn/H0aSkvenSydtDD6vgnSLE6y"
    },
    {
        "title": "Party Cocktail Meatballs",
        "ingredients": [
            "5 pounds frozen cooked meatballs, thawed ADVERTISEMENT",
            "1 (28 ounce) bottle ketchup ADVERTISEMENT",
            "1 (18 ounce) jar apple jelly ADVERTISEMENT",
            "1 (12 ounce) jar red currant jelly ADVERTISEMENT",
            "1/4 teaspoon hot sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water; bring to a boil. Cook meatballs, working in batches of necessary, in the boiling water until they begin floating on top and are heated through, about 3 minutes. Remove meatballs with a slotted spoon, drain in a strainer, and transfer to a large saucepan.\nCombine ketchup, apple jelly, red currant jelly, and hot sauce in a separate large saucepan; cook and stir over low heat until jelly is dissolved and sauce is heated through, 5 to 10 minutes. Pour sauce over meatballs. Simmer, stirring occasionally, over medium heat until meatballs and sauce are thoroughly heated, 15 to 20 minutes.\n",
        "picture_link": "dFkMkNjURoV18MbCYTzgVD4XmNyVhBO"
    },
    {
        "title": "Maple Toffee Bars",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon maple extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (12 ounce) bag chocolate chips ADVERTISEMENT",
            "2 tablespoons chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter and vegetable shortening with brown sugar, egg, vanilla extract, and maple extract until smooth; stir in flour and salt. Lightly press the dough into a 10x15-inch baking dish.\nBake until the crust is set and lightly browned, about 15 minutes.\nMelt chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove crust from oven and spread melted chocolate in a layer on top. Sprinkle with walnuts. Cut bars while still warm; let chocolate set, about 1 hour, before serving.\n",
        "picture_link": "3Hvlxyiip0BOrCWPAtIUdpoI1jRsFkO"
    },
    {
        "title": "Crustless Pumpkin Pie",
        "ingredients": [
            "1 cup granular sucralose sweetener (such as Splenda®) ADVERTISEMENT",
            "3 tablespoons almond flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 cups canned pumpkin ADVERTISEMENT",
            "3/4 cup half-and-half ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "hot water as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch pie dish.\nCombine sweetener and almond flour in a large bowl; beat in eggs until well mixed. Stir in pumpkin, half-and-half, vanilla extract, and pumpkin pie spice until smooth. Pour pumpkin mixture into prepared pie dish.\nPlace pie dish into a large baking pan; fill baking pan with about 1/2 inch hot water.\nBake in preheated oven until a knife inserted into the center of the pie comes out clean, 50 to 55 minutes.\n",
        "picture_link": "lmBFIPm3fvQwg5ZdcVjQT0qK13int5y"
    },
    {
        "title": "Night Before Scrambled Eggs",
        "ingredients": [
            "3 tablespoons butter or margarine, divided ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1 3/4 cups shredded cheese (such as Cheddar or Swiss), divided ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1/3 cup finely chopped onion ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "6 slices cooked bacon, chopped* ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tbsp of the butter in a saucepan. Whisk in flour and salt. Gradually whisk in milk until smooth. Bring mixture to a simmer over medium heat, stirring constantly, until slightly thickened. Remove from heat. Add 1-1/4 cups of the cheese, stirring until melted. Set aside.\nMelt remaining 2 tbsp butter in a large frying pan. Add mushrooms and onion; saute until tender and liquid evaporates.\nWhisk eggs. Add eggs and bacon or ham to mushroom/onion mixture. Cook until eggs are just set but still a little wet. Stir cheese sauce into egg mixture.\nSpoon mixture into a greased 9-inch (23 cm) square baking pan or 2.5 L casserole. Sprinkle remaining 1/2 cup cheese over top. Cover and refrigerate overnight.\nThe next morning, uncover and bake in a preheated 350 degrees F (180 degrees C) oven until heated through and cheese is melted, 20 to 25 minutes.\n",
        "picture_link": "JMa7eRDc8mYN9p0oLUiLYaHL7GS4Uui"
    },
    {
        "title": "Amaretto Yams",
        "ingredients": [
            "24 amaretto cookies, crushed ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 (29 ounce) cans sweet potatoes ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup orange marmalade ADVERTISEMENT",
            "1 teaspoon amaretto liqueur, or more to taste ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix crushed cookies with 1/2 cup butter in a bowl. Mash sweet potatoes with 1/4 cup butter in separate bowl; add brown sugar, marmalade, amaretto liqueur, and ginger to sweet potatoes. Mix well. Pour sweet potato mixture into a 9x9-inch baking dish; top with cookie mixture.\nBake in the preheated oven until cooked through and bubbling, about 30 minutes.\n",
        "picture_link": "L7TtABByV/SDuoZaUpi2Uqh9j27zPxO"
    },
    {
        "title": "Apple Butter Cream Cheese Spread",
        "ingredients": [
            "1 (8 ounce) package light cream cheese, softened ADVERTISEMENT",
            "1/2 cup apple butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cream cheese, apple butter, vanilla, and cinnamon in the container of a food processor fitted with a metal blade. Process until just smooth, about 20 seconds. Scrape down the sides of the container and process again until combined, if necessary.\nScrape the spread into a small bowl; cover with plastic wrap and refrigerate until slightly firm, about 30 minutes.\n",
        "picture_link": "GRFGtln0PCA3JBRxrPjBmQfxLvxRHmS"
    },
    {
        "title": "Easy Southern Sweet Potato Casserole",
        "ingredients": [
            "1 pound sweet potatoes, peeled and cubed ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 (10.5 ounce) package marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch casserole dish.\nToss sweet potatoes with brown sugar in a bowl until coated; arrange in the prepared casserole dish. Top sweet potatoes with marshmallows.\nBake in the preheated oven until sweet potatoes are tender and marshmallows are browned, 35 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Berry-nana Soy Smoothie",
        "ingredients": [
            "1 cup vanilla soymilk ADVERTISEMENT",
            "1 cup frozen blueberries or frozen berry mix ADVERTISEMENT",
            "1 banana, sliced ADVERTISEMENT",
            "1 tablespoon soy protein powder ADVERTISEMENT",
            "1/2 cup ice cubes ADVERTISEMENT",
            "1 teaspoon honey (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree all ingredients in blender on high until smooth. Serve immediately.\n",
        "picture_link": "8t9MmQI5kBlVFbRAeUWiLSx.AJ8uIiy"
    },
    {
        "title": "Thanksgiving Leftover Stuffed Shells",
        "ingredients": [
            "18 jumbo pasta shells ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons turkey broth ADVERTISEMENT",
            "2 cups turkey gravy ADVERTISEMENT",
            "1/4 cup dry sherry ADVERTISEMENT",
            "1/2 cup turkey broth ADVERTISEMENT",
            "1 1/2 cups shredded cooked turkey ADVERTISEMENT",
            "1 cup prepared stuffing ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "1/2 cup finely shredded Swiss cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 extra large egg, beaten ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to a boil. Cook shell pasta in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain.\nWhisk flour into 3 tablespoons of turkey broth in a bowl until the mixture is smooth and free of lumps; transfer to a saucepan. Whisk turkey gravy, sherry, and 1/2 cup turkey broth into the flour mixture and bring to a boil; reduce heat to medium and cook until thick, about 5 minutes, whisking constantly. Remove from heat.\nProcess turkey and stuffing in a food processor until finely ground, about 1 minute. Add ricotta cheese, Swiss cheese, Parmesan cheese, and 1/2 cup mozzarella cheese to the food processor and blend until filling is thoroughly combined, about 1 more minute. Add egg and pulse 1 or 2 times to combine. Transfer turkey and cheese filling to a bowl and gently stir in 1/2 cup more mozzarella cheese and chopped parsley.\nPour about 1/4 of the turkey gravy mixture into the bottom of a 9x13-inch baking dish and swirl to coat the bottom. Stuff shells with about 1 1/2 tablespoons of the turkey filling and arrange in the baking dish. Pour remaining turkey gravy over the shells and sprinkle remaining 1/2 cup mozzarella cheese over the gravy. Cover the baking dish tightly with aluminum foil.\nBake in the preheated oven until the filling is set, the casserole is bubbling, and the cheese topping has melted, about 45 minutes.\n",
        "picture_link": "8WpsgV5pYNconxcXa7DRT1c3cRQx9s2"
    },
    {
        "title": "Holiday Spiced Cranberry Relish",
        "ingredients": [
            "1 (12 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 (12 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1 (8 ounce) can whole berry cranberry sauce ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix pineapple, mandarin oranges, cranberry sauce, cinnamon, brown sugar, and vanilla extract together in a bowl.\nCover bowl with plastic wrap and refrigerate at least 4 hours.\n",
        "picture_link": "Cf9aX5FGN5K1DyyituiEo2QW5pLjTEy"
    },
    {
        "title": "Coffee Slush",
        "ingredients": [
            "3 pints half-and-half cream ADVERTISEMENT",
            "3 cups cold brewed coffee ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream, coffee, sugar, and vanilla extract together in a freezer-safe container. Cover container and freeze until coffee mixture is solid, at least 3 hours.\nRemove container from freezer and defrost in room temperature for 1 hour. Break coffee mixture apart with a fork creating a slush-like consistency. Transfer to a punch bowl or large pitcher.\n",
        "picture_link": "2pcmaOeBJ0KpxZ7SfNsOz2Bwlu9UTE."
    },
    {
        "title": "Easy Slow Cooker Apple Butter",
        "ingredients": [
            "14 cups sliced apples ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 1/2 teaspoons apple pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place apple slices in a slow cooker. Stir sugar and apple pie spice with the apples.\nCook on High for 4 hours; stir. Remove cover and continue cooking until the apples are very tender and most of the liquid has evaporated, 2 to 2 1/2 hours.\nScrape apple butter into a bowl; refrigerate 8 hours to overnight.\nBlend apple butter with an immersion blender until smooth. Alternately, you can run the butter through a food mill or blend in a blender.\n",
        "picture_link": "NNTzQjCYZPUSYLXU21O5c.q0MCQyPVS"
    },
    {
        "title": "Carrot Cake with Cream Cheese Icing from Egg Farmers of Ontario",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "2 cups granulated sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/4 cups vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (14 ounce) can crushed pineapple, well drained ADVERTISEMENT",
            "3 cups grated carrots ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "1/2 (250 g) package cream cheese, softened ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "2 cups icing sugar ADVERTISEMENT",
            "Milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cake: Combine sugar, eggs, oil and vanilla in a large bowl; beat with an electric mixer until combined. Combine flour, baking soda, cinnamon and salt in a medium bowl. Add to liquid ingredients; beat until combined. Stir in pineapple, carrots, walnuts and raisins. Pour batter into a greased 12-cup (3 L) Bundt pan or 13 x 9-inch (33 x 23 cm) baking pan. Bake in a preheated 350 degrees F (180 degrees C) oven until a cake tester inserted in the centre comes out clean (about 60 to 65 minutes for Bundt pan or 45 to 50 minutes for 13 x 9-inch (33 x 23 cm) baking pan). Let cake cool before icing.\nIcing: Combine cream cheese, butter, vanilla and icing sugar in a bowl. Beat with an electric mixer until smooth. Thin with a little milk, adding 1 tbsp for spreading or about 4 tbsp (60 mL) for drizzling over cake.\n",
        "picture_link": "P2aISvhtDu07CK/7CXuoVSLCQRTniLG"
    },
    {
        "title": "Chunky Cranberry Fluff",
        "ingredients": [
            "1 pound cranberries, chopped ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "1 (10.5 ounce) package miniature marshmallows ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cranberries and sugar together in a bowl; refrigerate 8 hours to overnight.\nStir whipped topping, pineapple, marshmallows, and walnuts into the cranberry mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Savory Sweet Potato Muffins with Bacon",
        "ingredients": [
            "1 large sweet potato ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1/2 small onion, chopped ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon mild curry powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups with butter. Line a baking sheet with aluminum foil.\nPlace sweet potato and bacon on the prepared baking sheet.\nBake in the preheated oven for 20 minutes; flip sweet potato and bacon. Bake until sweet potato is tender and bacon is crisp, about 20 more minutes. Let bacon cool on paper towels.\nHeat oil in a skillet over medium heat; cook and stir onion until soft and translucent, about 10 minutes.\nWhisk flour, baking powder, baking soda, curry powder, and salt together in a large bowl. Stir in Cheddar cheese until coated.\nPeel sweet potato and transfer to a bowl; roughly mash. Measure out 1 cup of mashed sweet potato. Chop bacon and stir into onion.\nWhisk eggs vigorously in a separate bowl. Add milk, sour cream, and butter; whisk until smooth. Fold in 1 cup sweet potato, bacon, and onions. Gently stir the sweet potato mixture into the flour mixture, using a rubber spatula, until just combined. Pour batter into the prepared muffin tin.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 18 minutes. Cool muffins in the pan for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "bQya/q8OFivSpzkW19b/4h1JM7qts5i"
    },
    {
        "title": "Chocolate Baklava",
        "ingredients": [
            "1 pound pecans, finely chopped ADVERTISEMENT",
            "8 ounces dark chocolate (such as Callebaut®), finely chopped ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 pound phyllo dough, thawed ADVERTISEMENT",
            "1 1/4 cups unsalted butter, melted ADVERTISEMENT",
            "3/4 cup orange juice ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 ounces semisweet chocolate ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 10x14-inch baking pan with butter.\nMix pecans, dark chocolate, 3/4 cup sugar, and cinnamon in a bowl. Trim phyllo dough to fit prepared baking pan. Layer 8 sheets of phyllo dough in prepared baking pan, brushing each sheet with melted butter; sprinkle with 2 cups pecan mixture. Spread butter on 4 more sheets of phyllo and layer over pecans; sprinkle with 2 more cups pecans. Repeat layers with 4 more sheets of phyllo and remaining pecans. Pour any leftover butter over baklava.\nCut through the top few layers of phyllo lengthwise, leaving bottom layer intact, to create 4 long rows. Make evenly-spaced zigzag cuts along each row to create small triangles, again leaving bottom layer of phyllo intact.\nBake in preheated oven until phyllo dough is golden brown and flaky, about 1 hour; immediately finish cutting through to bottom layer of baklava.\nBring orange juice, honey, water, 1/2 cup sugar, and lemon juice to a boil in a saucepan; reduce heat to medium and simmer until thickened, about 20 minutes. Pour sauce over baklava.\nMelt remaining 2 ounces chocolate and 1 teaspoon butter in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Drizzle chocolate over baklava. Cover and refrigerate until ready to serve.\n",
        "picture_link": "7xVyauQpZdf6eASsZ8wZxpFi/yLkq6y"
    },
    {
        "title": "An Updated Red Potato Salad",
        "ingredients": [
            "8 red potatoes ADVERTISEMENT",
            "1 1/2 cups mayonnaise (such as Hellmann's®/Best Foods®) ADVERTISEMENT",
            "2/3 cup sour cream ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons dried minced onion ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "4 hard-cooked eggs, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and cube potatoes.\nTransfer potatoes to a large bowl; stir in mayonnaise, sour cream, vinegar, sugar, onion, and celery seed until well coated. Gently mix in eggs and season with salt and black pepper. Refrigerate until chilled.\n",
        "picture_link": "s1licrAoDcZDWyDzMudszNTpehDRiBq"
    },
    {
        "title": "Easy Sweet Potato Crisp",
        "ingredients": [
            "1 (40 ounce) can sweet potatoes, drained ADVERTISEMENT",
            "1 cup quick-cooking rolled oats ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPour sweet potatoes into an 8x8-inch pan.\nMix oats, brown sugar, pecans, butter, and cinnamon together in a bowl; spread mixture over sweet potatoes.\nBake in the preheated oven until top is golden brown, 25 to 30 minutes.\n",
        "picture_link": "jcfxGOteeaNM5OisDK5ZSzwNKjGpRYe"
    }
]