[
    {
        "title": "Lazy Dazy Cake I",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Sift together flour, salt and baking powder. Set aside.\nIn a large bowl, beat eggs for 4 minutes with electric mixer on high. Add sugar and continue beating until light and fluffy. Add flour mixture.\nIn a sauce pan, bring 1 cup milk and 2 tablespoons butter to a boil. Add to batter and beat until combined.\nPour batter into 9x13 inch pan. Bake at 350 degrees F (175 degrees C) for 1 hour, or until a toothpick inserted into the cake comes out clean.\nTo make the frosting: In a saucepan, combine brown sugar, coconut, 6 tablespoons butter and 4 tablespoons milk. Heat and stir until butter is melted and mixture is smooth. Pour over cake as soon as it comes out of the oven. Put cake in the oven under the broiler and bake 3 to 4 minutes, or until icing is light brown.\n",
        "picture_link": "AYMshbn5s8JSlt152ycuQ5ZKr1VK/s."
    },
    {
        "title": "Brown Sugar Sauce",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1 cup cold milk ADVERTISEMENT",
            "1/4 cup brandy ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a small saucepan set over medium heat. In a medium-size bowl, stir flour with sugar. Then whisk into melted butter until mixture is moistened. Stir in milk until smooth. Cook, whisking frequently, until thickened and smooth, about 5 minutes. Stir in brandy and vanilla. Remove from heat.\nServe right away over Apple Coffee Cake with Brown Sugar Sauce. Or cover and refrigerate for a week or more. Reheat just before serving.\n",
        "picture_link": "ReXswVK9dj6Zq59fYASuHDrDybpLbSu"
    },
    {
        "title": "Rocky Road Fudge Bars",
        "ingredients": [
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 (1 ounce) square unsweetened chocolate, melted ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (1 ounce) square unsweetened chocolate, chopped ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch baking pan.\nIn a medium saucepan, melt chocolate and butter over low heat, stirring occasionally. Remove from the heat and add 1 cup sugar, 1 cup flour, baking powder, vanilla, 2 eggs and walnuts. Stir until well blended. Spread evenly into the bottom of the prepared pan.\nFor the next layer, in a medium bowl, beat the 6 ounces of cream cheese (reserve 2 ounces of the package of cream cheese for the next layer) with the 1/2 cup of sugar, egg, 2 tablespoons of flour, 1/2 teaspoon of vanilla, and 1/4 cup of butter. Mix until fluffy and smooth. Spread evenly over the first layer.\nSprinkle the 1/4 cup of chopped nuts and chocolate chips over the second layer. Bake for 25 to 35 minutes in the preheated oven. Then sprinkle the miniature marshmallows over the top and bake for 2 minutes longer.\nBegin to prepare the icing while the bars are in the oven. In a medium saucepan, melt together the 1/4 cup of butter, 1 square of chocolate, remaining 2 ounces of cream cheese and 1/4 cup of milk. Remove from heat and stir in 3 cups of confectioners' sugar and 1 teaspoon of vanilla. Beat until smooth. Pour over the marshmallows and swirl together. Refrigerate until firm, cut into squares.\n",
        "picture_link": "o2IrKhKEGzY95pZAPZ7Is9KqT/ZBP4m"
    },
    {
        "title": "Caramel Cake I",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 3/4 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x13 inch baking pan.\nSift the flour before measuring then resift with the 1 cup of the packed brown sugar.\nAdd the butter or margarine, eggs, milk, salt, baking powder and 1 teaspoon of the vanilla to the flour mixture and beat on medium high speed of an electric mixer for 2 to 3 minutes. (Use the whisk attachment for best results.) Spread batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 30 minutes or until a cake tester comes out clean. Remove cake from oven and place on a wire rack for 10 minutes then remove pan and place cake on a serving dish. Once cake is cooled completely frost with Caramel Icing.\nTo Make Caramel Icing: In a saucepan over medium heat stir the 2 remaining cups of brown sugar, and the cream until the sugar is dissolved. Cover and cook for 3 minutes. Uncover and cook without stirring till a candy thermometer reads 238 to 240 degrees F (113 to 115 degrees C). Stir in the remaining butter with a wooden spoon. Remove the icing from the heat and let cool to 110 degrees F (55 degrees C). Add the remaining 1 teaspoon vanilla. Beat the icing until it is thick and creamy. If it becomes heavy, thin it out with cream until the right consistency appears. Spread over the top of the cooled cake and top with chopped pecans.\n",
        "picture_link": ".8h43ULys45pZ0kY38roTKVQ.usKql2"
    },
    {
        "title": "Ooey Goey Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "8 ounces cream cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 3/4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease and flour one 13x9 inch pan. Preheat oven to 350 degrees F (175 degrees C).\nMix together cake mix, melted butter, and 1 egg. Press into prepared pan.\nIn separate bowl mix cream cheese, 2 eggs, and confectioners' sugar. Pour over first layer.\nBake at 350 degrees F (175 degrees C) for 40 minutes.\n",
        "picture_link": "T2KlFDYiplfrMZOo5DP4id4fpXIGIIi"
    },
    {
        "title": "Mafioso Chocolate Cake",
        "ingredients": [
            "1/2 cup Dutch process cocoa powder ADVERTISEMENT",
            "3/4 cup boiling water ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups sifted cake flour ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "3/4 cup Dutch process cocoa powder ADVERTISEMENT",
            "2 2/3 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease a 9x13 inch pan.\nIn a small bowl, mix together 1/2 cup cocoa and 3/4 cup boiling water; set aside.\nIn another small bowl, dissolve baking soda in the sour cream by stirring them together.\nIn a large bowl, cream the 1/2 cup butter and 2 cups sugar. To the butter and sugar mixture, alternately add the sifted flour and the cocoa mixture with the sour cream mixture. Beat until fluffy. Beat the egg whites until stiff and fold in the egg whites and 1 1/2 teaspoons of vanilla.\nBake in the preheated oven until a toothpick inserted near the center comes out clean, about 50 minutes. Frost with La Famiglia Chocolate Frosting (below).\nTo Make La Famiglia Chocolate Frosting: Cream 6 tablespoons butter or margarine in a small bowl. Add 3/4 cup cocoa and confectioner's sugar alternately with milk; beat until spreading consistency. More or less milk can be used depending on the texture you want. Blend in 1 teaspoon vanilla. This yields about 2 cups of frosting.\n",
        "picture_link": "CcCyqPBvY5kBU8tvqPIEVpGwsGiR7cS"
    },
    {
        "title": "Chicken Sopa",
        "ingredients": [
            "1 (3 pound) chicken - cooked, deboned and cut into bite size pieces ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (4 ounce) can diced green chiles ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "12 (6 inch) corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPut the chicken into a mixing bowl. Add the chicken soup, mushroom soup, green chiles and broth. Mix well.\nIn a 9x13 inch baking dish place a layer of corn tortillas to cover the bottom, then a layer of the chicken mixture, then a layer of cheese. Continue to layer, like you would lasagna, until all of the chicken mixture is gone. Bake in the preheated oven for 20 minutes or until the cheese is bubbly and brown. Let cool and serve.\n",
        "picture_link": "fMAndVGsis5WhFJwqkHcAGBd5iTVGwO"
    },
    {
        "title": "Easy Stuffed Zucchini",
        "ingredients": [
            "1/2 pound ground beef ADVERTISEMENT",
            "1 large zucchini, ends trimmed ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (16 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1/2 (6 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook and stir the ground beef in a skillet over medium heat until the meat is browned, breaking the beef up into crumbles as it cooks, about 10 minutes. Drain off excess fat, and transfer the beef into a mixing bowl. Slice the zucchini in half the long way, and use a spoon to scoop out the flesh, leaving a 1/2-inch thick shell all around the zucchini. Chop the scooped-out zucchini flesh, and add to mixing bowl. Stir in the bread crumbs, garlic, spaghetti sauce, black olives, and Parmesan cheese; mix the stuffing well. Lightly stuff both halves of the zucchini with the meat mixture. Place the zucchini halves into a baking dish, and cover tightly with foil.\nBake in the preheated oven for 45 minutes, remove from oven, and remove the foil. Sprinkle 1/2 cup of shredded mozzarella cheese over each zucchini half. Move an oven rack to within 6 inches of the oven broiler's heat source, turn on the broiler, and broil the zucchini until the mozzarella cheese is browned and bubbling, about 5 minutes.\n",
        "picture_link": "Uxhaju1trZ.H6l9U15mEsNdvJx2kSyK"
    },
    {
        "title": "Santa Fe Veggie Quesadillas",
        "ingredients": [
            "1 (12 inch) flour tortilla ADVERTISEMENT",
            "3/4 cup shredded Cheddar/Monterey Jack cheese blend ADVERTISEMENT",
            "1/2 cup whole kernel corn, drained ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "1/2 cup black beans, drained ADVERTISEMENT",
            "1 chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare a lightly oiled large skillet over medium heat. Place the tortilla in the skillet and flip it once to ensure an even coating of oil on both sides.\nAllow the tortilla to heat on one side for 1 minute. Beginning at the center of the tortilla, evenly spread the cheese blend until the tortilla's entire surface is covered. Top the cheese with corn, red bell pepper, black beans and green onion. When the cheese is completely melted, carefully slide the tortilla from the pan onto a cutting board. Slice into 8 wedges and serve warm.\n",
        "picture_link": "Jry0dWwssBfyU06t5yd5OHFUQjwoSOC"
    },
    {
        "title": "Mexican Pumpkin Empanadas",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 cup vegetable shortening ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "4 cups canned pure pumpkin ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 beaten egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nIn a large bowl, whisk the flour, 1/3 cup of sugar, 1 1/2 teaspoons of salt, and baking powder together. Cut the shortening into the flour mixture until it resembles coarse crumbs; stir the water in, about 2 tablespoons at a time, just until you can gather the dough together. Knead the dough a few times in the bowl, then scrape it out onto a floured surface. Cut the dough in quarters, and cut each quarter into thirds to make 12 equal portions. Roll the portions into balls. Cover the dough balls with a cloth, and allow to rest while you make the filling.\nMix the pumpkin, 2 eggs, 1 cup of sugar, 1 teaspoon of salt, cinnamon, ginger, and cloves together until smooth. On a floured surface, roll each dough ball out into a thin circle about 6 inches across; spoon about 1/3 cup of filling into the center of the dough circle. Fold the dough over the filling to make a half-moon shaped pie, and crimp the edges of the crust together with a fork, leaving little fork lines in the dough. Gently lay the empanadas onto the prepared baking sheets. Brush the top of each pie with beaten egg.\nBake in the preheated oven until the filling is hot and the crusts are shiny and browned, about 20 minutes.\n",
        "picture_link": "ikLVi7h5LWcbODYoVQj0j63v83tRZ72"
    },
    {
        "title": "Macaroni Au Gratin",
        "ingredients": [
            "1 (8 ounce) package elbow macaroni ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 pound Cheddar cheese, sliced ADVERTISEMENT",
            "paprika to taste ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a 2 quart casserole dish.\nBring a large pot of lightly salted water to a boil. Add macaroni and cook for 8 to 10 minutes or until al dente; drain. Transfer to prepared casserole dish and lay cheese slices over macaroni. Sprinkle with paprika.\nMelt butter in a small saucepan over medium heat. Add milk and flour, stirring until it thickens. Stir in salt and pepper and pour over macaroni and cheese.\nBake in preheated oven for 30 minutes.\n",
        "picture_link": "ifqWWQ/HHwo9vhsVuDwPBLme34LHOv6"
    },
    {
        "title": "Easter Leftovers Casserole",
        "ingredients": [
            "12 potatoes, cubed ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 cups cooked ham, cubed ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "6 tablespoons butter, divided ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 cup Cheddar cheese, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender, about 20 minutes. Drain and mash with 1/4 cup of the butter and milk.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine mashed potatoes, ham, garlic, mushroom soup, butter, egg and parsley in a mixing bowl. Transfer mixture to greased casserole dish and bake for 20 minutes. Sprinkle with cheddar cheese and bake an additional 15 minutes or until cheese is melted.\n",
        "picture_link": "IFhQS/6bWJLaffwb2ECwPB66wG.W8tq"
    },
    {
        "title": "Scalloped Cabbage with Ham and Cheese",
        "ingredients": [
            "1 medium head cabbage, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 1/2 cups cooked ham, diced ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup processed American cheese ADVERTISEMENT",
            "2 tablespoons dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nSteam cabbage and onion in a small amount of water until tender. Add the ham. Place into a buttered baking dish.\nIn a skillet, melt butter over low heat. Stir in flour until smooth. Add milk, stirring until smooth. Add salt, cheese and stir until melted. Pour over the cabbage mixture. Sprinkle with bread crumbs and dot with butter. Bake for 30 minutes.\n",
        "picture_link": "Zdqw3eah3zs4sEat8L6edh7Az8b8TBW"
    },
    {
        "title": "Chili II",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 cups beef stock ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 (28 ounce) can stewed tomatoes, lightly drained ADVERTISEMENT",
            "7 sun-dried tomatoes, softened and chopped ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "1 pinch dried sage ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large Dutch oven, heat the olive oil over medium heat. Brown the ground beef until no longer pink. Drain most of the fat from the ground beef.\nPush the ground beef to the sides of the pan and saute the onion and garlic in the middle until softened.\nPour in beef stock, red wine, and balsamic vinegar. Stir in tomatoes, sun-dried tomatoes, tomato paste and black beans. Mix thoroughly. Sprinkle in the cayenne pepper, chili powder, salt, pepper, oregano, sage and sugar, then add the bay leaf. Mix thoroughly.\nCover and simmer on lowest heat for 45 to 90 minutes.\n",
        "picture_link": "a6EvGYjBDZGD6pxxeQuQpBVBz0PJty."
    },
    {
        "title": "Oatmeal Pancakes I",
        "ingredients": [
            "2 cups rolled oats ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix oats and buttermilk in a bowl. Let sit for 15 minutes. Add eggs, butter, flour, sugar, baking powder and baking soda; stir until blended.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.\n",
        "picture_link": "gpAirck2jhRojus3Y3fM53Yzf1rhYAe"
    },
    {
        "title": "German Sweet Chocolate Pie",
        "ingredients": [
            "1 (4 ounce) bar German sweet chocolate, chopped ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Microwave chocolate and 2 tablespoons of the milk in large microwave-safe bowl on HIGH 1 1/2 to 2 minutes or until chocolate is almost melted, stirring halfway through heating time. Stir until chocolate is melted and mixture is smooth.\nBeat in cream cheese, sugar, and remaining milk with wire whisk until blended. Refrigerate 10 minutes. Gently fold in 3 1/2 cups of the whipped topping until no streaks remain. Spoon into crust.\nFreeze pie 4 hours. Before cutting pie, let stand at room temperature 15 minutes. Serve with remaining whipped topping. Store pie in freezer.\n",
        "picture_link": "nBO07Z5F8LDDEAFb.bwuQVIH.9CDaJe"
    },
    {
        "title": "Tuna and Chickpea Salad",
        "ingredients": [
            "1 (5 ounce) can Italian tuna packed in olive oil, undrained ADVERTISEMENT",
            "1 (16 ounce) can chickpeas (garbanzo beans), drained ADVERTISEMENT",
            "1 (2.25 ounce) can black olives, chopped ADVERTISEMENT",
            "1/4 cup chopped Italian (flat-leaf) parsley ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "lemon, juiced ADVERTISEMENT",
            "1/4 cup crumbled reduced-fat feta cheese, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the tuna, chickpeas, olives, parsley, red onion, lemon juice, and feta cheese together in a bowl. Season with salt and pepper.\n",
        "picture_link": "3fRZPjj84zB0d1ZO.O9UqqGL673XJpC"
    },
    {
        "title": "Barbecued Pork Chops",
        "ingredients": [
            "8 lean pork chops ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/3 cup distilled white vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a skillet, heat a small amount of oil and brown both sides of the pork chops.\nIn a bowl combine ketchup, salt, celery seed, nutmeg, vinegar, water, and bay leaf; Pour over chops.\nBake in oven for 90 minutes. Turn chops once during baking.\n",
        "picture_link": "mrBOuqXsZ.Fid.Bcips3d6jiyWpM7m2"
    },
    {
        "title": "Buffalo Chicken Strips II",
        "ingredients": [
            "2/3 cup plain non-fat yogurt ADVERTISEMENT",
            "2 tablespoons low-fat mayonnaise ADVERTISEMENT",
            "2 ounces crumbled blue cheese ADVERTISEMENT",
            "3 tablespoons finely chopped green onions ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1/2 pound skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "1 tablespoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Dip: In a small bowl, whisk together the yogurt, mayonnaise and bleu cheese. Stir in green onion and pepper; cover and refrigerate.\nTo Make Strips: Heat oil in a large skillet. Season chicken with salt and sautee over medium high heat, stirring frequently, until lightly browned and cooked through, about 7 to 10 minutes. Remove skillet from heat. Add butter and hot pepper sauce to skillet and swirl until the butter melts and the sauce coats the chicken.\nServe hot chicken with refrigerated dip mix.\n",
        "picture_link": "3L2w2sqJOoqUvE5vMco3NL7lIxYKhFO"
    },
    {
        "title": "Chunky Cheese Soup",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 cups peeled and diced potatoes ADVERTISEMENT",
            "1/2 cup diced carrots ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/4 cup chopped onions ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup cooked ham, cubed ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, mix the water, potatoes, carrots, celery, onions, salt and pepper. Bring to boil. Reduce heat and simmer 30 minutes, or until vegetables are tender.\nMix the ham into the vegetable mixture.\nIn a medium saucepan, melt the butter. Stir in the flour until smooth. Slowly pour in the milk. Bring to a boil. Cook and stir 2 minutes, or until thickened. Stir in the Cheddar cheese until melted.\nMix the melted cheese mixture with the vegetable mixture and serve.\n",
        "picture_link": "o6dqUNLOg8NQeg4CUJduOlPVB482zWC"
    },
    {
        "title": "Sex on the Beach III",
        "ingredients": [
            "1 fluid ounce vodka ADVERTISEMENT",
            "1 fluid ounce peach schnapps ADVERTISEMENT",
            "3 fluid ounces orange juice ADVERTISEMENT",
            "3 fluid ounces cranberry juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a highball glass with ice, pour in vodka and peach schnapps, then fill glass with half orange juice and half cranberry juice.\n",
        "picture_link": "UNscjTmun6QvrYLwAb74oMYvjb/v8bO"
    },
    {
        "title": "Eggnog Fudge",
        "ingredients": [
            "1 cooking spray ADVERTISEMENT",
            "1 cup eggnog ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 1/2 cups miniature marshmallows ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/8 cup butter, chilled ADVERTISEMENT",
            "1/2 (11 ounce) package white chocolate chips ADVERTISEMENT",
            "1 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9 x 13 inch baking pan with aluminum foil and set aside.\nSpray the bottom and sides of a large saucepan with cooking spray. Heat eggnog and sugar over medium heat. Bring to rolling boil, stirring constantly with a wooden spoon. Boil for 2 minutes.\nFold in marshmallows, cinnamon and nutmeg. Return to a boil for 6 minutes, stirring constantly. As the mixture boils it will become brown. Remove from heat and quickly stir in butter, white chocolate chips and almonds. Stir until well mixed and glossy.\nQuickly pour into prepared pan.\nCool at room temperature. Remove from pan, remove foil and cut into squares.\n",
        "picture_link": "aSz5fqD1eu51jhCKtuRYMzoQa9EvqOm"
    },
    {
        "title": "Friendship Tea",
        "ingredients": [
            "1/2 cup instant tea powder ADVERTISEMENT",
            "1 cup sweetened lemonade powder ADVERTISEMENT",
            "1 cup orange-flavored drink mix (e.g. Tang) ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine instant tea, lemonade powder, orange drink mix, cinnamon and clove. Mix well and store in an airtight container.\nTo serve, Put 2 to 3 teaspoons of mix in a mug. Stir in 1 cup of boiling water. Adjust to taste.\n",
        "picture_link": "fMyzU1ikQ6hgZXj.KLioNe/Kc44TOZO"
    },
    {
        "title": "Caramel Chocolate Corn",
        "ingredients": [
            "16 cups popped popcorn ADVERTISEMENT",
            "1 cup roasted peanuts ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup milk chocolate chips ADVERTISEMENT",
            "1 teaspoon shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease cookie sheets.\nPlace popcorn and peanuts in a paper bag. Set aside.\nIn a microwave safe bowl, combine sugar, butter, corn syrup, vanilla and salt. Microwave 4 minutes, until bubbly. Stir in baking soda. Pour over popcorn mixture and shake bag to coat.\nRoll down edges of bag and place bag in microwave. Heat for 2 minutes, shaking three times to mix. Spread mixture onto prepared sheets to cool.\nIn a microwave safe bowl, combine chocolate and shortening. Microwave 90 seconds, stirring once, until melted. Drizzle over popcorn mixture. Let cool before serving.\n",
        "picture_link": "TEgTPRSjvMJpcAqiyY595wy495lXq4K"
    },
    {
        "title": "Sarah's Dry Rubbed Chicken",
        "ingredients": [
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "2 teaspoons rubbed sage ADVERTISEMENT",
            "2 teaspoons dried thyme leaves ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (4 pound) whole chicken ADVERTISEMENT",
            "6 cloves garlic, crushed ADVERTISEMENT",
            "2 onions, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the garlic powder, onion powder, paprika, parsley, oregano, cayenne pepper, sage, thyme, coriander, celery seed, salt, and black pepper in a bowl. Rub the chicken inside and out with the spice blend. Stuff the cavity of the chicken with the crushed garlic and onion. Place into a 9x13-inch baking dish and cover with plastic wrap. Refrigerate 4 hours to overnight.\nPreheat an oven to 325 degrees F (165 degrees C).\nRemove and discard the plastic wrap. Bake the chicken in the preheated oven until no longer pink at the bone and the juices run clear, about 2 hours. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C). Remove the chicken from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing.\n",
        "picture_link": "FGs4vb99h.Te.BSEGwlugY7ScBtX.xa"
    },
    {
        "title": "Best Lasagna",
        "ingredients": [
            "1 (16 ounce) package lasagna noodles ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "4 cups ricotta cheese ADVERTISEMENT",
            "1 cup grated Romano cheese ADVERTISEMENT",
            "2 1/2 cups spaghetti sauce ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "2 medium zucchini, sliced ADVERTISEMENT",
            "1 cup fresh basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a rapid boil. Boil lasagna noodles 6 to 8 minutes until al dente. Drain and rinse with cold water. Lay noodles flat and remove excess water with a paper towel.\nIn a skillet, brown the ground beef over medium-high heat. Add onion, salt, pepper, and Italian seasoning. Cook until there is no remaining pink color in beef. Drain any liquids and set aside.\nIn a large bowl, mix together ricotta cheese, Romano cheese, 2 cups of the spaghetti sauce and the seasoned ground beef. Mix until well blended. Meanwhile, preheat oven to 375 degrees F (190 degrees C).\nAdd a thin layer of spaghetti sauce in the bottom of a 9x13 inch baking dish. Add a layer of noodles lengthwise and a few noodles in the opposite direction. Pour in a generous layer of ricotta mixture on top of noodles. Top ricotta layer with several basil leaves. Add another layer of noodles lengthwise. Spread on 1 cup of the mozzarella cheese. Line up the zucchini slices on top of the mozzarella cheese. Add another thin layer of ricotta cheese. Add the last layer of noodles lengthwise. Top the noodles with the remaining spaghetti sauce, several more basil leaves in an eye catching arrangement and top with the remaining 1/2 cup mozzarella cheese.\nBake in a preheated oven for 50 to 55 minutes. If Mozzarella cheese becomes too browned, loosely cover with a piece of foil.\n",
        "picture_link": "rGdL9d0M/9r/EPcYQePmAgNCWacqf/q"
    },
    {
        "title": "Chicken Kabobs",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "1 large green bell pepper, cut into 2 inch pieces ADVERTISEMENT",
            "1 onion, cut into wedges ADVERTISEMENT",
            "1 large red bell pepper, cut into 2 inch pieces ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nThread the chicken, green bell pepper, onion, and red bell pepper pieces onto skewers alternately.\nLightly oil the grill grate. Place kabobs on the prepared grill, and brush with barbeque sauce. Cook, turning and brushing with barbeque sauce frequently, for 15 minutes, or until chicken juices run clear.\n",
        "picture_link": "dfCRHgwtD5u3M4t2t39c8YxJr.1KLmy"
    },
    {
        "title": "Moroccan Chickpea Stew",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons ground coriander ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 potatoes, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "1 cup tomato sauce ADVERTISEMENT",
            "1 cup golden raisins ADVERTISEMENT",
            "water, or enough to cover ADVERTISEMENT",
            "1 (14.5 ounce) can chickpeas, drained and rinsed ADVERTISEMENT",
            "1 bunch kale, ribs removed, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium heat; cook the onion and garlic in the hot oil until the onions are translucent, 5 to 7 minutes. Stir the cumin, coriander, cayenne pepper, garam masala, curry powder, and salt into the onion and garlic; cook together until fragrant, about 1 minute. Add the potatoes, diced tomatoes, tomato sauce, and raisins to the pot. Pour enough water over the mixture to cover; bring to a simmer and cook until the potatoes are soft, 10 to 15 minutes.\nAdd the chickpeas and kale to the pot; simmer until the kale wilts, about 3 minutes. Sprinkle the cilantro over the stew and immediately remove the pot from the heat.\n",
        "picture_link": "QkTI6pZ7m2uDKKzamGoT.KlnVhi3aEm"
    },
    {
        "title": "PHILADELPHIA Marble Brownies",
        "ingredients": [
            "1 (19.8 ounce) package brownie mix ADVERTISEMENT",
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1/3 cup sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nPrepare brownie batter as directed on package; spread into greased 13x9-inch pan.\nBeat cream cheese with mixer until creamy. Add sugar, egg and vanilla; mix well. Drop by tablespoonfuls over brownie batter; swirl with knife.\nBake 35 to 40 min. or until cream cheese mixture is lightly browned. Cool completely before cutting to serve. Keep refrigerated.\n",
        "picture_link": "Vt6IDaasx7vq5PU6OUVm6HUL4iOowUm"
    },
    {
        "title": "Easy Shrimp Vegetable Stir Fry",
        "ingredients": [
            "2 cups instant brown rice ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "6 tablespoons soy sauce ADVERTISEMENT",
            "6 tablespoons water ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 cups broccoli florets ADVERTISEMENT",
            "1 cup baby carrots ADVERTISEMENT",
            "1 small white onion, chopped ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 1/2 pounds uncooked medium shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the rice and 1 3/4 cup water together in a microwave-safe bowl. Cover, and cook in the microwave on High for 8 minutes until the water is fully absorbed. Fluff with a fork.\nWhisk together the soy sauce, water, honey, cider vinegar, and cornstarch in a small bowl. Set the sauce aside.\nHeat the olive oil in a non-stick skillet over medium heat. Stir in the garlic and cook for 10 seconds. Add the broccoli, carrots, onion, and black pepper; cook and stir until the broccoli and carrots are tender, about 5 minutes. Stir in the mushrooms and cook for 2 minutes. Remove the vegetables from the skillet and set aside.\nReturn the skillet to the heat and pour in the sauce mixture; cook for 1 minute. Add the shrimp to the sauce and stir until the shrimp are bright pink on the outside and the meat is no longer transparent in the center and the sauce thickens, about 3 minutes. Stir the vegetables back into the pan and serve over the brown rice.\n",
        "picture_link": "za1y5m9WHL1rt/.TuDkDs3EPAcA/v2C"
    },
    {
        "title": "White Chocolate Blondie Brownies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "3 (1 ounce) squares white chocolate, chopped ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup white chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nMelt the butter and white chocolate together over low heat in a saucepan. Remove from heat, and let cool slightly. Meanwhile beat eggs with sugar and vanilla extract in a mixing bowl; mix in the butter mixture, and stir in the flour and salt until thoroughly combined. Scoop the batter into the prepared baking pan; sprinkle with white chocolate chips.\nBake in the preheated oven until a toothpick inserted into the center of the pan comes out clean, 30 to 35 minutes. Allow to cool in pan for about 10 minutes before cutting into bars.\n",
        "picture_link": "x11Jp/OFs2Z9EXnD3bOs4YJZ1goFyU6"
    },
    {
        "title": "Lazy Man's Pierogi",
        "ingredients": [
            "1 (16 ounce) package rotelle pasta ADVERTISEMENT",
            "1/2 pound bacon, chopped ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1/2 pound mushrooms, quartered ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 (16 ounce) can sauerkraut - rinsed and drained ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Preheat oven to 350 degrees F (175 degrees C).\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Stir in onions, and cook until translucent. In a separate pan, saute the mushrooms in butter.\nIn a large bowl, combine pasta, bacon, onion, mushrooms, sauerkraut and condensed soup. Season with salt and pepper. Pour into a 9x13 inch baking dish.\nBake in preheated oven for 45 minutes.\n",
        "picture_link": "Y1hfnKFcrfb1uQWVGXuZ5vUUHHa5DhC"
    },
    {
        "title": "Strawberry Balsamic Chicken",
        "ingredients": [
            "4 (8 ounce) containers strawberry yogurt ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "4 large strawberries ADVERTISEMENT",
            "2 teaspoons minced fresh parsley ADVERTISEMENT",
            "1 teaspoon minced fresh mint leaves ADVERTISEMENT",
            "1 tablespoon balsamic vinegar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the yogurt, 1/2 cup balsamic vinegar, sugar, pepper, cinnamon and salt. Place chicken breast halves in a shallow baking dish, and pour the sauce over them. Refrigerate for 1 hour, turning chicken over half way through.\nHeat the olive oil in a large skillet over medium-high heat. Scrape the marinade off of the chicken breasts, and place them into the hot oil. Quickly brown the chicken on both sides, then reduce the heat to medium-low, cover, and cook until chicken is no longer pink and juices run clear, about 15 minutes. Remove from heat, and let rest for 3 minutes.\nWhile the chicken is cooking, transfer the marinade to a saucepan. Bring to a low simmer over medium heat. Remove stems from strawberries, and slice thinly so they will fan nicely. Set aside.\nSlice chicken breasts on the diagonal into 1/2 inch thick slices. Place on serving plates, and sprinkle with lemon juice. Spoon about 2 tablespoons of the marinade over each chicken breast, and fan one sliced strawberry over the top. Garnish with a sprinkle of fresh mint and parsley. If you really love balsamic vinegar, finish the dish off with an artful drizzle.\n",
        "picture_link": "L//6y8I7AfdBeJgc3n3pSDS4MzF5hOG"
    },
    {
        "title": "Bacon Baked Beans",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "2 (16 ounce) cans baked beans ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1/4 cup yellow mustard ADVERTISEMENT",
            "3/4 cup ketchup ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 Granny Smith apple - peeled, cored and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Cook bacon in a large skillet or in the microwave until much of the grease has been released, but the bacon is still flexible. Drain on paper towels and set aside.\nIn a 9 inch square baking dish, stir together the baked beans, onion, mustard, ketchup, brown sugar and apple. Top with slices of bacon.\nBake uncovered for 45 minutes in the preheated oven, until the bacon is crisp and beans are bubbling hot.\n",
        "picture_link": "7FHXTl6aDfuGgWx0SMZbSN8wdfHIXgy"
    },
    {
        "title": "Breakfast In A Glass",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1/4 cup strawberries ADVERTISEMENT",
            "1/3 cup nonfat milk ADVERTISEMENT",
            "1 (8 ounce) container nonfat plain yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine banana, strawberries, milk and yogurt. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "vZhuuUD.jCim5UCpm7WRTxOlJ0gGX32"
    },
    {
        "title": "Apple Blue Cheese Salad",
        "ingredients": [
            "1 Granny Smith apple, cored and julienned ADVERTISEMENT",
            "1 cup balsamic vinaigrette salad dressing ADVERTISEMENT",
            "1 cup crumbled blue cheese ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "4 slices turkey bacon ADVERTISEMENT",
            "6 cups torn romaine lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the julienned apple into a bowl with the balsamic vinaigrette. Refrigerate for at least one hour to marinate.\nCook bacon in the microwave or in a skillet over medium-high heat until browned. Drain, and crumble.\nIn a salad bowl, combine the blue cheese, pecans, bacon and romaine lettuce, and toss to blend. When ready to serve, pour the apples and dressing over the top.\n",
        "picture_link": "eq8GYG1vwhltBICPa3QMiUd3anH2hAe"
    },
    {
        "title": "Orange Banana Smoothie",
        "ingredients": [
            "1 cup cold milk ADVERTISEMENT",
            "2 oranges, peeled and segmented ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 (8 ounce) container vanilla fat-free yogurt ADVERTISEMENT",
            "4 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine milk, oranges, banana, sugar, salt and yogurt. Blend for about 1 minute. Insert ice cubes, and blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "qt022avV7yJm6wQQ.PeWJNLefLqSf8q"
    },
    {
        "title": "Oven Roasted Greek Potatoes",
        "ingredients": [
            "2 teaspoons lemon pepper ADVERTISEMENT",
            "1/2 teaspoon dried marjoram ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/8 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons Italian salad dressing ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "6 medium potatoes, peeled and quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix the lemon pepper, marjoram, basil, thyme, and rosemary. In a separate bowl, mix the wine, water, olive oil, dressing, garlic, lemon juice, lemon zest, and 1/2 the seasoning mixture. Pour into a medium glass baking dish. Place potatoes in the dish, coat with the mixture, and sprinkle with remaining seasonings. Cover, and refrigerate 8 hours, or overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nBake potatoes 1 hour and 15 minutes in the preheated oven, basting once half way through the bake time.\n",
        "picture_link": "vMlyk9d6TgRL5UZ2NVetvPv/RFSJ9NS"
    },
    {
        "title": "Spinach and Spaghetti Squash Quiche",
        "ingredients": [
            "1/2 cup frozen chopped spinach , thawed, drained and squeezed dry ADVERTISEMENT",
            "1/2 cup cooked, shredded spaghetti squash ADVERTISEMENT",
            "1 beaten egg ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated skim milk ADVERTISEMENT",
            "1 cup part-skim-milk mozzarella cheese ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1/3 cup bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPierce squash several times with a fork, and place in a microwave-safe dish. Microwave on high for 10 minutes, turn over, and continue cooking 10 minutes more. Squash flesh should be very tender inside. Set aside to cool.\nCut squash in half lengthwise and scoop out seeds. Shred 1/2 cup of squash and place in a mixing bowl. Stir in egg, egg whites, evaporated milk, mozzarella cheese, and spinach until well combined. Spray a 9 inch pie place or quiche dish with cooking spray. Spread bread crumbs in the bottom and around the sides to coat. Pour egg mixture into prepared dish.\nBake quiche in the preheated oven for 45 minutes, or until a toothpick inserted in the center comes out clean. Allow to cool for at least 10 minutes before cutting. Serve warm or at room temperature.\n",
        "picture_link": "EuKQ0ahDgE2zuU7RB8W5ras8xElR1fa"
    },
    {
        "title": "Mediterranean Orzo Spinach Salad",
        "ingredients": [
            "1 cup uncooked orzo pasta ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil, divided ADVERTISEMENT",
            "1 pound ground lamb ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon ground coriander ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 cups fresh spinach leaves, chopped ADVERTISEMENT",
            "3 tomatoes, seeded and chopped ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "1/4 cup chopped fresh mint leaves ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "5 green onions, chopped ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of lightly salted water to a boil. Add orzo pasta, cook for 5 minutes, or until al dente. Drain.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Place the lamb and garlic in the skillet. Season lamb with coriander, salt, and pepper. Cook until evenly browned. Remove from heat, and drain.\nIn a large bowl, mix the spinach, tomatoes, lemon juice and zest, mint, parsley, green onions, and remaining olive oil. Toss with the orzo, lamb, and feta cheese to serve.\n",
        "picture_link": "k5xgYfACrV6uMiu83WsL2eHzf06ShVm"
    },
    {
        "title": "Kale and Adzuki Beans",
        "ingredients": [
            "1 cup uncooked adzuki beans ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, peeled and crushed ADVERTISEMENT",
            "6 cups roughly chopped kale ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/4 cup tamari ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place adzuki beans in a medium saucepan with enough water to cover. Bring to a boil, reduce heat, and simmer 30 to 45 minutes, until tender.\nHeat olive oil in a medium skillet over medium heat, and saute garlic about 1 minute. Mix in kale and 2 tablespoons water. Season with tamari, cumin, and coriander. Thoroughly blend in adzuki beans. Reduce heat to low, cover, and simmer about 20 minutes, until kale is tender. Season with salt and pepper.\n",
        "picture_link": "/OMK.8mVWrVeyXOLB0/3PiqXhUHOoj."
    },
    {
        "title": "Chicken Voila",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in a bowl, and season with salt, pepper and garlic. Sprinkle the flour over the chicken pieces and toss to coat.\nHeat the oil and butter in a large skillet over medium heat. Shake the excess flour off of the chicken, and reserve in the bowl. Place the chicken in the hot pan, and brown on all sides. Remove from the pan, and keep warm.\nWhisk some of the chicken broth into the flour in the bowl until smooth. Stir this into the drippings in the skillet, then stir in the remaining broth. Bring to a boil, then reduce the heat to low, and return the chicken pieces to the skillet. Simmer over medium heat until the chicken is cooked through, and the sauce has thickened. Taste, and season with additional salt and pepper if desired.\n",
        "picture_link": "5gGrNQmmYexbIfyk0AqO5IJllpSDjb6"
    },
    {
        "title": "Grilled Cheese with Tomato, Peppers and Basil",
        "ingredients": [
            "8 (1 ounce) slices bread ADVERTISEMENT",
            "4 slices Cheddar cheese ADVERTISEMENT",
            "1 large tomato, sliced ADVERTISEMENT",
            "2 serrano peppers, seeded and thinly sliced ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter one side of each slice of bread, and place 4 of the slices butter-side down on a griddle over medium heat.\nOn each piece of bread, place one slice of cheese, 1 slice of tomato, and a few slices of serrano pepper. Sprinkle dried basil and salt and pepper to taste. Top each sandwich with a slice of buttered bread, butter-side up.\nGrill sandwiches until golden brown, about 2 to 3 minutes each side.\n",
        "picture_link": "heKnoXiZs4M6eEdEsZ9Tq1.vV8Ww3yq"
    },
    {
        "title": "Praline Sundae Topping",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "16 large marshmallows ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1/2 cup chopped pecans, toasted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over low heat. Stir in brown sugar, marshmallows, corn syrup and salt. Bring to a boil over low heat, stirring constantly. Boil for 1 minute. Remove from the heat, and cool for 5 minutes. Stir in evaporated milk, pecans and vanilla; mix well.\n",
        "picture_link": "GmbO6.MHbZieKK.imWJTYdj.l59mpoC"
    },
    {
        "title": "Onion and Cheddar Burgers",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "6 hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine beef, onion, egg and ketchup. Season with salt, pepper, oregano, and Worcestershire sauce. Lightly mix in cheddar cheese. Shape beef mixture into 6 thick patties. Preheat oven on broiler setting.\nPlace hamburgers on broiler pan. Broil, turning once, until cooked through, about 5 minutes per side. Serve on hamburger buns.\n",
        "picture_link": "kqeV4e7U2oO95kFkIvrjylx.a9/Hi/K"
    },
    {
        "title": "Chicken Fried Steak Cuban Style",
        "ingredients": [
            "4 (4 ounce) cube steaks ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups dry bread crumbs ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 lemon, sliced ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish, combine the breadcrumbs with the oregano, cumin, and salt and pepper. Beat eggs in another shallow dish. Dip each steak in beaten eggs, and then in the breadcrumb mixture. Make sure to cover each steak well with the breadcrumb mixture.\nIn a large, deep skillet, heat 1inch oil over medium high heat.\nPlace the steaks in the oil when it's hot (so that the breading will not stick to the pan). Cook steaks, turning once, until brown for well done and golden brown for medium. Serve with lemon slices.\n",
        "picture_link": ".AyUd6TvMwG9X7uyri3qDm0oRbsNoKS"
    },
    {
        "title": "Consomme Pork Chops",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "6 pork chops ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "1 cup beef consomme ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat the oil in a skillet over medium heat. Place the flour in a shallow dish. Season pork chops with salt and pepper, and press in the flour to lightly coat. Place chops in the skillet, and lightly brown on both sides. Drain on paper towels.\nIn a large baking dish, mix the rice, consomme, and water. Arrange onion slices over the rice. Top with pork chops.\nBake in the preheated oven 1 1/2 hours, or until rice is tender and pork is done.\n",
        "picture_link": "b5nK0AikSKHOnXmyyqpRIuamuhMI78q"
    },
    {
        "title": "Cape Breton Blueberry Grunt",
        "ingredients": [
            "3 cups fresh blueberries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nArrange the blueberries in the bottom of a casserole dish; sprinkle 1 cup sugar over the blueberries.\nCream together the shortening, 1/2 cup sugar, and egg. Add the milk, flour, baking powder, and salt. Beat until evenly combined. Drop by spoonfuls on top of the blueberries.\nBake in preheated oven until golden brown, about 30 minutes.\n",
        "picture_link": "Qqz4Njx4lTQtKsaE37zmOZpGc0rxYce"
    },
    {
        "title": "Chocolate Cake Shot",
        "ingredients": [
            "1 fluid ounce hazelnut liqueur ADVERTISEMENT",
            "1/2 fluid ounce vodka ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shot glass, combine 1 part hazelnut liqueur and 1 part vodka. Coat a wedge of lemon with sugar. Suck the lemon wedge, and with the juice still in your mouth, drink the shot.\n",
        "picture_link": "j2y7CBLw8l75.rDR1.AqfiPQ7tmfeie"
    },
    {
        "title": "Horchata (Cinnamon Rice Milk)",
        "ingredients": [
            "1 cup long grain rice, rinsed ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "1 cinnamon stick, broken into pieces ADVERTISEMENT",
            "1 teaspoon vanilla (optional) ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, combine rice, water and cinnamon stick. Set aside for 3 hours.\nAfter 3 hours, bring to a boil, reduce heat, and simmer for 30 minutes. Allow to cool.\nPuree rice mixture in a blender until smooth. Strain through cheesecloth or a fine sieve. Flavor with vanilla and sugar to taste. Chill, and serve over ice.\n",
        "picture_link": "fs5/ZZBSKFI.J90VHmkQdb97MEBpdQS"
    },
    {
        "title": "Working Mom's Hamentashen",
        "ingredients": [
            "1 (18.25 ounce) package moist yellow cake mix ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 cup fruit preserves, any flavor ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a large bowl, mix together the cake mix and flour. Stir in the eggs and water to form a stiff dough. On a lightly floured surface, roll the dough out to 1/8 inch thickness. Cut into 3 inch round circles and place 2 inches apart onto the prepared cookie sheets. Place a teaspoon of filling into the center of each cookie and pinch the sides to form three corners. Moisten with water if necessary.\nBake for 6 to 8 minutes in the preheated oven, or until lightly browned. Allow cookies to cool for 1 minute on the cookie sheets before removing to wire racks to cool completely.\n",
        "picture_link": "QnzUo13Z9v5HqyhnqjlfGowXAYBlc5G"
    },
    {
        "title": "Easy Creamy Vanilla Fudge",
        "ingredients": [
            "3 3/4 cups confectioners' sugar ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x5 inch pan. Set aside.\nIn a 3 quart saucepan, over very low heat, mix together confectioners sugar, butter, milk, vanilla, and salt until mixture is creamy.\nPour quickly into greased 9x5 inch pan. Refrigerate until firm, then cut into squares. Store in an airtight container in the refrigerator.\n",
        "picture_link": "8SjivWROGVXJQzhNFrzKfT2hLlHlYbq"
    },
    {
        "title": "Stuffed Cabbage",
        "ingredients": [
            "1 large head cabbage ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 onion, finely diced ADVERTISEMENT",
            "3/4 cup cooked white rice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cabbage head in freezer and freeze overnight. Remove from freezer, thaw and peel away leaves.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine the beef, egg, onion, rice, salt and pepper. Mix together well. Take a small handful and form into a small roll or ball. Place into the center of a cabbage leaf. Fold the sides of the leaf over and roll the ball up into the leaf. Place seam side down in baking dish. Continue until all of the filling is used up.\nMix together the soup with a 1/2 can water; pour over stuffed cabbage.\nBake uncovered at 350 degrees F (175 degrees C) for 1 hour; baste often with the sauce.\n",
        "picture_link": "msKHsl2a5e/e8o0s3UM/gaYu86gNTUu"
    },
    {
        "title": "Balsamic Vinegar and Olive Oil Dressing",
        "ingredients": [
            "1 sprig fresh oregano ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium glass mixing bowl combine the oregano, thyme, oil, vinegar, salt and pepper. Mix together and pour mixture into a bottle, using a funnel to keep yourself from losing oil. Cover tightly and store at room temperature.\n",
        "picture_link": "/5hVDdi.TCDFPoVUNB0EZ9DJkR8IZ.C"
    },
    {
        "title": "Vegetable Dip",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 teaspoon crushed garlic ADVERTISEMENT",
            "1 tablespoon tarragon vinegar ADVERTISEMENT",
            "1 teaspoon grated onion ADVERTISEMENT",
            "1 teaspoon prepared horseradish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine mayonnaise, curry powder, garlic, vinegar, onion and horseradish. Mix together, cover, and chill overnight to allow the flavors to blend.\n",
        "picture_link": "qivuIXW/oyZ6FVRdHNbM92bI7bYLerC"
    },
    {
        "title": "Artichoke and Crabmeat Triangles",
        "ingredients": [
            "1 (14 ounce) can artichoke hearts, drained ADVERTISEMENT",
            "16 ounces crabmeat ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (12 ounce) package English muffins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium size mixing bowl, combine artichoke hearts, crabmeat, mayonnaise, onions, and cheese. Mix thoroughly.\nSplit each English muffin in half ,and spread the mixture on the cut side of the split muffins. Cut each of the sliced muffins into quarters. Arrange the muffin-bites on a baking sheet.\nBake for 12 minutes, or until golden brown. Serve hot.\n",
        "picture_link": "OofqZGf/6sJF/0nqqJezb74Ai8upHIq"
    },
    {
        "title": "Beef Stroganoff I",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 1/2 pounds sirloin tip, cut into thin slices ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Add beef and the onions; cook until the meat is browned and the onion tender.\nStir in sour cream, and heat through. Do not boil.\n",
        "picture_link": "1TqNZFjCj.ifohb2ShxdUfkQsEhDnJe"
    },
    {
        "title": "Rice Casserole",
        "ingredients": [
            "2 cups instant rice ADVERTISEMENT",
            "1 (15 ounce) can condensed French onion soup ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1/4 pound butter, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 9x11 inch microwave safe dish, mix together the rice, French onion soup, mushroom soup and butter.\nCook in microwave oven on high power for 10 minutes or until boiling. Decrease power to medium, stir and cook for 20 minutes. Serve when all liquid is absorbed.\n",
        "picture_link": "NkVSeK8Vmmz.Mhr.v9FO4yEouk0tts2"
    },
    {
        "title": "Dilly Potato Salad",
        "ingredients": [
            "2 pounds red potatoes, diced ADVERTISEMENT",
            "6 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 cup nonfat plain yogurt ADVERTISEMENT",
            "3 tablespoons fat-free mayonnaise ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 teaspoon prepared Dijon-style mustard ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add potatoes; cook until tender but still firm, about 15 minutes. Drain, and set aside to cool.\nIn a large bowl, combine the potatoes and chopped eggs.\nMix together the yogurt, mayonnaise, green onions, mustard, dill weed and garlic powder. Pour dressing over potatoes and eggs; toss and chill until ready to serve.\n",
        "picture_link": "apmoA/ltlTHVWyAckmobBON0GbwfRG2"
    },
    {
        "title": "Margarita Pie",
        "ingredients": [
            "1 1/4 cups crushed pretzels ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 limes, zested and juiced ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine crushed pretzels, melted butter, and sugar. Press mixture into a pie pan.\nIn a large bowl, mix together lime juice, lime zest, orange juice, and sweetened condensed milk. Fold in whipped topping. Spoon filling into pretzel crust. Chill pie for 25 to 30 minutes.\n",
        "picture_link": "iNCNEGaOVEpNGEFYtUtXqgAEfvzg3CO"
    },
    {
        "title": "Peanut Sauce II",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons minced fresh ginger root ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/4 cup tamari or soy sauce ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1/4 cup fresh basil leaves, cut into thin strips ADVERTISEMENT",
            "3 fresh basil leaves for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a skillet over medium heat. Stir in onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add garlic, jalapeno pepper, and ginger; cook and stir for 2 minutes more.\nStir in peanut butter, water, tamari, and honey until smooth. Add shredded basil. Heat through, and remove from heat. Garnish with whole basil leaves, if desired.\n",
        "picture_link": "/Y2PcmEikanyEy8p2GLVtNOvkkPW11W"
    },
    {
        "title": "Chef John's Baked Lemon Pepper Salmon",
        "ingredients": [
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 1/2 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon yellow miso paste ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "2 (8 ounce) center-cut salmon fillets, boned, skin on ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together lemon juice and black pepper in small bowl. Add mayonnaise, miso paste, Dijon mustard, and cayenne pepper to lemon-pepper mixture; whisk together.\nSpread the lemon-pepper mixture over salmon fillets. Reserve about a tablespoon for later use.\nCover salmon with plastic wrap and refrigerate for 30 minutes.\nPreheat oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper or silicone baking mat.\nPlace fillets on the prepared baking sheet. Spread remaining lemon-pepper mixture on fillets without letting it pool around base. Sprinkle with a pinch more black pepper and a generous amount of sea salt.\nBake in the preheated oven until the fish flakes easily with a fork, 10 to 15 minutes.\n",
        "picture_link": "7dkjwqEPnN2gmx.mf7Edb5sG.c2VOuu"
    },
    {
        "title": "Quick Black Bean Soup",
        "ingredients": [
            "2 (15 ounce) cans black beans ADVERTISEMENT",
            "1 (15 ounce) can diced tomatoes with green chile peppers, drained ADVERTISEMENT",
            "2 (15 ounce) cans chicken broth, divided ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 (15 ounce) can black beans ADVERTISEMENT",
            "3 cups hot cooked rice ADVERTISEMENT",
            "6 tablespoons sour cream, for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain some of the liquid from 2 cans black beans.\nPut 2 cans black beans, diced tomatoes with green chile peppers, 1 cup chicken broth, cumin, salt, black pepper, and cayenne pepper into a blender and blend until smooth; pour into a saucepan and add remaining chicken broth and 1 can black beans. Place saucepan over medium heat, bring mixture to a simmer, and cook for 15 minutes.\nPut 1/2 cup hot rice into each of 6 bowls. Ladle soup over rice and top with 1 tablespoon sour cream.\n",
        "picture_link": "NYjlv9eMW6WoTktdoRQgYyu0gzn1AUO"
    },
    {
        "title": "Really Easy Chowder",
        "ingredients": [
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 pound frozen cod fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium sized stock pot place undrained tomatoes, celery, oregano, basil, salt and pepper. Bring to a boil over medium heat.\nPlace frozen fish filets in pot. Reduce heat and cook for 10 to 15 minutes. Cook until mixture is heated through and fish is opaque and flaky. Thin with a little water if desired.\n",
        "picture_link": "BLwiSRhbc32/f9peO6Aa79HFRJRKBOS"
    },
    {
        "title": "Southwest Stew",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can pinto beans, drained and rinsed ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "4 potatoes, cubed ADVERTISEMENT",
            "1 cup medium salsa ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook ground beef and onion until done.\nIn a large pan add beef, onion, tomatoes, beans, corn, potatoes, picante sauce, water, cumin, salt and pepper to taste, and garlic powder. Simmer, covered, for 45 minutes. I like to use slow cooker and let it simmer all day. Serve; top with cheese.\n",
        "picture_link": "ck2Q2dAxxd7.Kg78yo5EbcLo28wUGYG"
    },
    {
        "title": "No-Fry Spicy Potato Skins",
        "ingredients": [
            "4 large russet potatoes ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1 1/2 teaspoons ground coriander seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nBake the potatoes for 1 hour. Remove the potatoes from the oven, but keep the oven on. Slice the potatoes in half lengthwise, and let them cool for 10 mins. Scoop out most of the potato flesh, leaving about 1/4 inch of flesh against the potato skin (you can save the potato flesh for another use, like mashed potatoes)\nCut each potato half crosswise into 3 pieces. Place the olive oil in a small cup. Dip each potato piece into the olive oil and place it on a baking sheet. Repeat this with the remaining potato pieces\nCombine the salt and the spices and sprinkle the mixture over the potatoes. Bake the potato skins for 15 minutes or until they are crispy and brown. Serve them immediately.\n",
        "picture_link": "kVB8plxFXYH2sOC0detSpi24IJbzW12"
    },
    {
        "title": "Polish Cream Cheese Coffee Cake",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBeat 1 cup white sugar, 1/2 cup butter, and 1 egg in a bowl until smooth. Add sour cream and vanilla extract; mix well. Stir in 3 cups flour, baking soda, and baking powder until mixture comes together in a sticky dough. Spread half the dough evenly into prepared baking dish.\nBeat cream cheese, 1/2 cup white sugar, and 1 egg in another bowl until smooth. Spoon mixture into baking dish over dough. Drop remaining half of dough by spoonfuls over cream cheese mixture.\nMix pecans, brown sugar, 1/3 cup flour, and 1/3 cup butter in a bowl until mixture resembles a coarse crumble; sprinkle over dough.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.\n",
        "picture_link": "nFxQhjymw.1pleA8WeW/gVui3Ytbv3m"
    },
    {
        "title": "Homey Chicken and Rice Casserole",
        "ingredients": [
            "1 cup rice ADVERTISEMENT",
            "1 1/4 cups chicken broth ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cups sliced white mushrooms ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cups shredded cooked chicken ADVERTISEMENT",
            "1 (10.75 ounce) can fat-free cream of chicken soup ADVERTISEMENT",
            "1 cup light sour cream ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 tablespoon seasoned salt (such as LAWRY'S®) ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup crushed garlic-and-butter flavor croutons ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch square baking dish.\nBring rice and 1 1/4 cup chicken broth to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes.\nHeat olive oil in a saucepan over medium heat. Cook and stir mushrooms and onion in hot oil until mushrooms are soft and onion is translucent, 5 to 7 minutes. Stir chicken, chicken soup, sour cream, milk, 1/2 cup chicken broth, seasoned salt, and black pepper into the mushroom mixture. Reduce heat to low. Add cooked rice to the saucepan; stir until rice is evenly mixed in. Transfer mixture to prepared baking dish.\nBake in preheated oven 15 minutes. Top casserole with Cheddar cheese and crushed croutons; bake until top begins to brown, about another 10 minutes. Let cool 5 minutes before serving.\n",
        "picture_link": "T2ena1PzqqPdFQfUZF01ow2IYG7kd7a"
    },
    {
        "title": "Italian Spaghetti with Ham",
        "ingredients": [
            "8 ounces spaghetti ADVERTISEMENT",
            "2 cups sliced ham, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1/4 cup sliced black olives ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook spaghetti according to package directions.\nWhile spaghetti is cooking, heat the 1 tablespoon butter or margarine in a large skillet. Saute ham and garlic.\nDrain spaghetti well, and combine with sauteed ham and garlic in the skillet. Over very low heat, slowly stir in the cheese, eggs, olives, and half of the parsley. Remove from heat. Add salt and butter to taste, and sprinkle with remaining parsley. Serve.\n",
        "picture_link": "Xf6xv05nmIsmKVDhTpMHOGQGHmtbC6m"
    },
    {
        "title": "Walnut Pumpkin Pie",
        "ingredients": [
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "2 cups pumpkin puree ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a mixing bowl, combine the pumpkin, condensed milk, egg, 3/4 teaspoon cinnamon, ginger, nutmeg and salt. Pour batter into the pie crust.\nBake at 425 degrees F (220 degrees C) for 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C).\nIn a small bowl, combine brown sugar, flour, and remaining 1/2 teaspoon cinnamon. Cut in the butter or margarine until the mixture is crumbly. Stir in walnuts. Sprinkle mixture evenly over the pie. Bake pie for 40 minutes or until a knife inserted one inch from the edge comes out clean. Cool and garnish as desired.\n",
        "picture_link": "FFJjTdX1/lzZoi0CoV9nBQL076KlGYO"
    },
    {
        "title": "EZ Peanut Butter Pie I",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup creamy peanut butter ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the cream cheese, sugar and vanilla together. Add the peanut butter and mix well. Fold in the dessert topping until completely blended.\nFill the pie crust with the peanut butter mixture and chill in the freezer until ready to serve. Note: Good in a chocolate crust with chocolate chips sprinkled on top.\n",
        "picture_link": "mWfhUqSyMtQoqaQEjXwnC2FIkYMkiJO"
    },
    {
        "title": "Creamed Peas and Onions",
        "ingredients": [
            "4 tablespoons butter ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (16 ounce) package frozen peas and onions, thawed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over low heat, stir together the butter and flour. Cook until flour is evenly coated.\nOver medium heat, stir in approximately 1/2 cup of milk at a time until thick.\nAdd the peas and onions and cook until hot. Season with salt and pepper.\n",
        "picture_link": "7/Kv9xXB.dI4Qu1pd7KXqwBqTiT0G.a"
    },
    {
        "title": "Zucchini Pie II",
        "ingredients": [
            "4 cups zucchini - peeled, seeded and sliced ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 1/2 tablespoons cream of tartar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon butter, diced ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil zucchini until tender. Drain and let stand in cold water for about 5 minutes, then drain.\nAdd sugar, flour, cinnamon, cream of tartar, lemon juice, salt, and nutmeg. Mix well. Put into the pie crust. Dot with butter. Put top crust on.\nBake at 400 degrees F (205 degrees C) for 40 to 50 minutes.\n",
        "picture_link": "2ugqSbXNU3fVIAAv4/hujICPfq/Iz5i"
    },
    {
        "title": "Triple Fudge Brownies",
        "ingredients": [
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 15x10 inch baking pan.\nPrepare pudding mix according to package directions using the 2 cups milk. Whisk in the cake mix. Stir in the chocolate chips. Pour batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes or until the top springs back when lightly touched. Dust with confectioners' sugar. Serve with ice cream if desired.\n",
        "picture_link": "Nmnf.7eBAz.T16uynpyDSQZ8SJXRz8O"
    },
    {
        "title": "Green and Red Tomato and Corn Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "4 green tomatoes, chopped ADVERTISEMENT",
            "4 tomatoes, chopped ADVERTISEMENT",
            "1 1/2 cups fresh corn kernels ADVERTISEMENT",
            "7 cups vegetable broth ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a stockpot heat the oil over medium heat. Add the onion and garlic, saute until soft.\nStir in the cumin powder, tomatoes and corn. Cook over medium heat for 5 minutes.\nStir in vegetable broth, reduce heat to low and cook until heated through. Season to taste with salt and pepper.\n",
        "picture_link": "t4kzMplvJlow270.0sn0XBk8fXXiUZ6"
    },
    {
        "title": "Pumpkin Raisin Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 1/4 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon allspice ADVERTISEMENT",
            "3 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "2 1/4 cups sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 (15 ounce) can pumpkin ADVERTISEMENT",
            "1 cup finely chopped pecans ADVERTISEMENT",
            "2 cups golden raisins ADVERTISEMENT",
            "3 tablespoons sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 2 baking sheets.\nIn a large bowl, stir together all-purpose and whole wheat flours, baking powder, and baking soda. Mix in ginger, allspice, cinnamon, cloves, and salt. Set aside.\nIn a separate large bowl, cream butter until fluffy. Mix in applesauce, then slowly stir in 2 1/4 cups sugar until well blended. Mix in the eggs and pumpkin. Gradually mix the dry ingredients into the wet ingredients. Then stir in pecans and raisins.\nDrop by heaping tablespoonfuls onto cookie sheets, leaving 2 inches between scones. Flatten scones with the back of the spoon.\nIn a small bowl, stir together 3 tablespoons of sugar and cinnamon, and sprinkle on top of scones.\nBake in a preheated oven until golden brown, about 12 to 14 minutes. Remove, and let cool on cookie sheets 5 minutes before removing to wire racks to cool.\n",
        "picture_link": "ie0aYYP9QiewlJWG40jeB3sPDz8m.16"
    },
    {
        "title": "Hazelnut-Crusted Salmon",
        "ingredients": [
            "1 pound salmon fillet, cut into 4 pieces ADVERTISEMENT",
            "1/2 cup fat-free mayonnaise ADVERTISEMENT",
            "1/2 cup chopped hazelnuts ADVERTISEMENT",
            "2 teaspoons minced fresh tarragon ADVERTISEMENT",
            "1/2 teaspoon orange zest ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a baking sheet with cooking spray.\nArrange salmon on the baking sheet and spread with equal amounts mayonnaise. Top with hazelnuts and sprinkle with tarragon, orange zest, salt and pepper.\nBake 15 minutes in the preheated oven, or until fish flakes easily with a fork.\n",
        "picture_link": "4yAS8DbZsnzadpSa0Y.tqdU7ZeaYiym"
    },
    {
        "title": "Honey Almond Chicken",
        "ingredients": [
            "6 bone-in chicken parts ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup slivered almonds ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Arrange chicken parts in a baking dish.\nMelt butter in a skillet over medium heat, and cook onion 5 minutes, until tender. Stir in honey, almonds, and lemon juice, and continue cooking 2 minutes, or until heated through. Pour over the chicken, coating each piece.\nCover dish with aluminum foil. Bake chicken 30 minutes in the preheated oven. Remove foil, and continue baking 30 minutes, until chicken juices run clear.\n",
        "picture_link": "MZLe9hYZdws5mZCcGiqilKmPep8.32G"
    },
    {
        "title": "Hamburger Quiche",
        "ingredients": [
            "1 (16 ounce) package frozen hash brown potatoes, thawed ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 pound sharp Cheddar cheese, shredded ADVERTISEMENT",
            "1/4 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "1 (3 ounce) jar real bacon bits ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "1/4 pound sharp Cheddar cheese, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch pie dish.\nPress hash browns onto the bottom and sides of pie dish. Bake in preheated oven for 25 to 30 minutes, or until it begins to brown.\nMeanwhile, place ground beef and onion in a large, deep skillet. Cook over medium-high heat until beef evenly brown. Drain, crumble and allow to cool. In a medium bowl, whisk together milk, eggs and cornstarch. Stir in 1/2 pound shredded cheese and ground beef mixture. Mix in the liquid smoke, bacon bits, Worcestershire sauce and salt. Pour into hash brown crust.\nBake in preheated oven for 20 minutes. Remove from oven, sprinkle 1/4 pound of grated sharp cheddar on top, and place back in the oven. Bake 15 minutes, or until filling is puffed and golden brown. Let stand for 20 minutes before serving.\n",
        "picture_link": "D.OYM3x5uejFDF1PVR14I7PblMbS/.2"
    },
    {
        "title": "Spinach, Egg, and Pancetta with Linguine",
        "ingredients": [
            "1 (16 ounce) package uncooked linguine pasta ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "3 ounces pancetta bacon, diced ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "3 cups loosely packed torn fresh spinach ADVERTISEMENT",
            "2 hard-cooked eggs, peeled and chopped ADVERTISEMENT",
            "freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to boil. Cook linguine until al dente, about 8 to 10 minutes.\nAs the water is being brought to boil, heat 1 tablespoon olive oil in a skillet over medium heat. Stir in pancetta, and cook until browned. Remove to paper towels.\nReturn skillet to heat, and pour in 2 tablespoons olive oil. Stir in crushed red pepper flakes. Then stir in spinach, and cook until softened. Return pancetta to the skillet, and stir in eggs. Cover, and turn off heat.\nWhen the pasta is done, drain, and mix into skillet, reserving some pasta water. If the pasta is too dry, add a small amount of pasta water. Top with freshly grated Parmesan.\n",
        "picture_link": "Urvuq7xgeH9b9seoBfW2NXfktAVfv16"
    },
    {
        "title": "Creamy Mushroom Pasta",
        "ingredients": [
            "1 (12 ounce) package dry fettuccine noodles ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 fresh mushrooms, sliced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and olive oil. Cook for 7 minutes, or until tender. Drain.\nMeanwhile, melt butter in a skillet over low heat. Add the mushrooms, and cook until soft and dark. Stir in the garlic, Italian seasoning, salt, white wine, and chicken broth. Increase the heat to medium, and cook stirring constantly for about 5 minutes.\nReduce heat to low, and stir in the sour cream until smooth. Stir in cornstarch, and simmer for a minute to thicken. Stir in pasta, or spoon sauce over pasta. Serve, and top with grated Parmesan cheese.\n",
        "picture_link": "nhilLNZ5TaFvbPKr9Uaqzhc6OSFn/mq"
    },
    {
        "title": "Cheddar Pennies",
        "ingredients": [
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "6 ounces shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a large cookie sheet.\nIn a medium bowl, mix together the flour, salt and cayenne pepper. Stir in the Cheddar cheese and melted butter to form a firm dough. Roll pieces of dough into ropes as big around as a penny. Slice into 1/4 inch slices. If dough is too soft, it can be chilled until firm. Place slices onto the prepared cookie sheet so they are 1 inch apart.\nBake for 20 to 25 minutes in the preheated oven, until the bottoms of the pennies are lightly toasted and the tops are firm. Allow to cool completely before serving. Store in an airtight container at room temperature.\n",
        "picture_link": "J.OAOwzSQiKIz3ZyhLLnuq3z.J5VBo2"
    },
    {
        "title": "Choereg (Armenian Easter Bread)",
        "ingredients": [
            "1 cup whole milk ADVERTISEMENT",
            "1 cup unsalted butter ADVERTISEMENT",
            "1 cup margarine ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup lukewarm water ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "2 (.25 ounce) envelopes active dry yeast ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "6 cups all-purpose flour, or as needed ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 tablespoons ground mahleb ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, combine the milk, butter and margarine. Heat until butter and margarine are melted, but do not let it boil. Stir in 1 cup of sugar until dissolved, then set aside to cool to lukewarm.\nMeanwhile, in a small bowl, dissolve 2 teaspoons of sugar in warm water. Sprinkle the yeast over the surface, and let stand until frothy, about 10 minutes.\nCrack the eggs into a large bowl, and stir a little to break up the yolks. Slowly pour in the heated milk mixture while whisking constantly, so as to temper the eggs and not cook them. Add the yeast mixture, and stir just until blended.\nIn a large bowl, combine the flour, baking powder, mahleb, and salt. Make a well in the center, and pour in the wet mixture. Stir until it forms a sticky dough. Pour onto a floured surface, and knead in additional flour as needed to make a more substantial dough. Knead for about 10 minutes. Place in an oiled bowl, and set in a warm place to rise for about 2 hours, or until doubled in size.\nWhen the dough has doubled, punch down again, and let rise until doubled. It will only take about half as long this time.\nSeparate the dough into 5 even portions, then separate each of those into thirds. Roll each of those into ropes about 12 inches long. Braid sets of three ropes together, pinching the ends to seal, and tucking them under for a better presentation. Place the loaves onto baking sheets lined with parchment paper. Loaves should be spaced 4 inches apart. Set in a warm place to rise until your finger leaves an impression behind when you poke the loaf gently.\nPreheat the oven to 350 degrees F (175 degrees C). Brush the loaves with beaten egg, and sprinkle with sesame seeds.\nBake for 25 minutes in the preheated oven, or until nicely golden brown all over.\n",
        "picture_link": "bMvHeLoFqDotwT7MWyZjFeP/9vCcBUG"
    },
    {
        "title": "Mediterranean Summer Tomatoes",
        "ingredients": [
            "5 fresh tomatoes ADVERTISEMENT",
            "5 shallots, coarsely chopped ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1 loaf French bread, for dipping (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Core and slice the tomatoes, and arrange them in a serving dish. Sprinkle the shallots over the tomatoes. Whisk the olive oil and balsamic vinegar together with a fork, then pour over the tomatoes. Let stand for 5 minutes before serving, or refrigerate, covered, for up to 3 days. Eat with French bread, and dip the bread in the marinade when finished with the tomatoes.\n",
        "picture_link": "oQzMgAoeFM4q1eCWUtGBoZwdaGqAsGS"
    },
    {
        "title": "Playoff Meatballs",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup instant oatmeal ADVERTISEMENT",
            "3 tablespoons dried minced onion ADVERTISEMENT",
            "3/4 cup shredded mild Cheddar cheese ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (12 ounce) bottle barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the ground beef, eggs, oatmeal, onion, Cheddar cheese, ketchup, salt, and pepper using your hands. Form into tiny meatballs about 1 inch wide.\nPreheat the oven to 350 degrees F (175 degrees C). Heat the oil in a large skillet over medium heat. Add the meatballs, and cook, turning frequently, until browned, about 10 minutes. Use a slotted spoon to transfer the meatballs to a baking dish. Cover with barbeque sauce.\nBake for 30 minutes in the preheat oven, until sauce is thick and meatballs are cooked through. Serve hot.\n",
        "picture_link": ".qg9acsO6iEvgCEcN6sYhIu6Pdrf9xa"
    },
    {
        "title": "Singapore Noodle Curry Shrimp",
        "ingredients": [
            "2/3 cup chicken broth ADVERTISEMENT",
            "1 tablespoon oyster sauce ADVERTISEMENT",
            "1 1/2 tablespoons soy sauce ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "3 tablespoons peanut oil ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 small red bell pepper, diced ADVERTISEMENT",
            "1 small red onion, chopped ADVERTISEMENT",
            "4 green onions, chopped into 1 inch pieces ADVERTISEMENT",
            "1 (12 ounce) package frozen cooked cocktail shrimp ADVERTISEMENT",
            "1 1/2 cups frozen baby peas ADVERTISEMENT",
            "1/2 (8 ounce) package rice noodles, broken into 3 inch pieces and soaked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, oyster sauce, soy sauce and sugar in a small bowl, and set aside.\nIn a large skillet, heat the oil over medium-high heat. Add curry powder, garlic, and ginger; stir-fry for 10 seconds. Add peppers, onions, and scallions; stir-fry for 3 to 5 minutes. Stir in chicken stock mixture, and bring to a boil over high heat. Add shrimp and peas, and cook until hot. Add noodles, and cook until dish is heated thoroughly. Serve immediately.\n",
        "picture_link": "YwAUguHTIF3BIThToTESdCqbrk9tXE2"
    },
    {
        "title": "Val and Jess's Vegan Avocado Dip",
        "ingredients": [
            "2 avocados - peeled, pitted and diced ADVERTISEMENT",
            "1 (19 ounce) can black beans, drained and rinsed ADVERTISEMENT",
            "1 (11 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 medium onion, minced ADVERTISEMENT",
            "3/4 cup salsa ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the avocados, black beans, corn, onion, salsa, cilantro, and lemon juice. Season with chili powder, salt, and pepper.\n",
        "picture_link": "1AR5m8OQA.Qf6faT6URi8hf2T4UwXHG"
    },
    {
        "title": "Vegetarian Cassoulet",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion ADVERTISEMENT",
            "2 carrots, peeled and diced ADVERTISEMENT",
            "1 pound dry navy beans, soaked overnight ADVERTISEMENT",
            "4 cups mushroom broth ADVERTISEMENT",
            "1 cube vegetable bouillon ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "4 sprigs fresh parsley ADVERTISEMENT",
            "1 sprig fresh rosemary ADVERTISEMENT",
            "1 sprig fresh lemon thyme, chopped ADVERTISEMENT",
            "1 sprig fresh savory ADVERTISEMENT",
            "1 large potato, peeled and cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a small amount of oil in a skillet over medium heat. Cook and stir onion and carrots in oil until tender.\nIn a slow cooker, combine beans, carrots and onion, mushroom broth, bouillon, and bay leaf. Pour in water if necessary to cover ingredients with water. Tie together parsley, rosemary, thyme, and savory, and add to the pot. Cook on Low for 8 hours.\nStir in potato, and continue cooking for 1 hour. Remove herbs before serving.\n",
        "picture_link": "2dVHGPwj7xZiZJHKSAdvWLKGX6au5T6"
    },
    {
        "title": "Smothered Beef Liver",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "1 pound beef liver ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large skillet over medium heat. Saute onions until soft, but not browned. Remove from pan using a slotted spoon, and set aside. Slice the liver into serving size pieces, and remove any membrane.\nIn a shallow dish, mix together the flour, salt and pepper. Dredge the liver in the flour mixture, and place into the hot skillet. Brown the liver quickly on each side. Place reserved onions on top of liver pieces. Pour the tomato sauce and water over everything in the pan, lifting the liver pieces to let the tomato sauce coat the bottom of the pan.\nSprinkle the oregano over everything, and simmer over low heat for 8 to 10 minutes, stirring occasionally. Adjust salt and pepper to taste. Be careful not to overcook, or liver will be tough. I serve this with mashed potatoes and green beans.\n",
        "picture_link": "58o74xe09rV6OXkhaNhdDjJI18nDcAC"
    },
    {
        "title": "No Tomato Chili",
        "ingredients": [
            "2 1/2 pounds lean ground beef ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped (optional) ADVERTISEMENT",
            "3 cloves garlic, pressed ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "5 tablespoons chili powder ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, rinsed and drained ADVERTISEMENT",
            "2 (12 ounce) bottles chile sauce ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup chopped jalapeno pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble the ground beef into a soup pot over medium-high heat. Cook and stir until browned. Drain off the grease, and season with salt to taste. Add the onion, bell pepper, and garlic; cook and stir for about 3 minutes. Reduce the heat to medium, and season with Worcestershire sauce, chili powder, cumin and oregano. Cook and stir for another 5 minutes.\nReduce heat to low, and stir in the chili sauce, beef broth, kidney beans and cannellini beans. Cover, and simmer for about 35 minutes. Ladle into bowls to serve, and top with shredded Cheddar cheese and jalapeno.\n",
        "picture_link": "3q0wl.ZQeM4L.YSeEw3ygCJr5d5YMJm"
    },
    {
        "title": "Sweet and Spicy Soup with Black-Eyed Peas and Sweet Potato",
        "ingredients": [
            "1/2 red bell pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 celery stalk, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "3 plum tomatoes, chopped ADVERTISEMENT",
            "1 (15 ounce) can black-eyed peas, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can sweet potatoes, drained and cut into chunks ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons cinnamon ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "1 pinch dried rosemary ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch onion powder ADVERTISEMENT",
            "1 pinch mustard powder ADVERTISEMENT",
            "1 pinch cumin ADVERTISEMENT",
            "1 pinch coriander ADVERTISEMENT",
            "salt and cracked black pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven to broil. Brush red bell pepper lightly with olive oil, and place cut-side down on a baking sheet. Place sheet under broiler, and broil until pepper is blackened and blistered. Remove from broiler, and when cool enough to touch, peel skin. Chop pepper into bite-size pieces.\nHeat olive oil in a large skillet over medium heat. Stir in onion, celery, and garlic; cook until onion is soft and translucent.\nMix in water, vegetable broth, tomatoes, black-eyed peas, sweet potatoes, and chopped bell pepper. Add brown sugar, cinnamon, cayenne, and red pepper flakes. Add bay leaf, thyme, basil, oregano, and rosemary. Mix in garlic, onion, and mustard powders. Stir in cumin and coriander.\nBring contents to a boil. Reduce heat to medium-low; simmer, covered, until sweet potatoes begin to disintegrate, about 20 minutes. Season with salt and cracked pepper to taste. Stir in fresh parsley, and serve.\n",
        "picture_link": "L2ZlJ3euj1pdsel2842CvG2R0H2kt1q"
    },
    {
        "title": "Maharaja Curry",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon cumin seed ADVERTISEMENT",
            "2 medium onions, finely chopped ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon cayenne pepper to taste ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon minced ginger ADVERTISEMENT",
            "5 peeled, seeded, and chopped tomatoes ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast meat - cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat. Stir in cumin seed and cook until they start to pop, 20 to 45 seconds. Stir in onion, and cook until golden brown, about 5 minutes. Season with turmeric, cayenne, garam masala, garlic, and ginger. Cook for 1 to 2 minutes until fragrant.\nPuree the mixture with the tomatoes in a blender until smooth. Return the puree to the saucepan, and add the chicken. Simmer gently until the chicken has cooked, about 20 minutes; add water as needed while cooking to maintain desired consistency.\n",
        "picture_link": "5RDDVgqBQSo5PDBMWjzK6CQ9PyEJ7ay"
    },
    {
        "title": "Inger's Spaghetti Sauce",
        "ingredients": [
            "6 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 (.18 ounce) packet chicken bouillon granules ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 (28 ounce) cans crushed tomatoes ADVERTISEMENT",
            "2 teaspoons poultry seasoning ADVERTISEMENT",
            "1 teaspoon white sugar, or as needed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a pot over medium heat. Mix in onion and garlic, and cook 1 minute. Stir in the green bell pepper. Season with basil, oregano, and chicken bouillon. Stir in the tomato paste and crushed tomatoes, and season with poultry seasoning. Cook and stir 10 minutes.\nMix sugar into the sauce. (Some people add up to 2 tablespoons sugar; I suggest starting with 1 teaspoon.) Season with salt and pepper. Reduce heat to low, and simmer 3 to 4 hours.\n",
        "picture_link": "x/0.e2.ukwPRpNY.cwm8XKLbgRLMraa"
    },
    {
        "title": "Deb's General Tso's Chicken",
        "ingredients": [
            "4 cups vegetable oil for frying ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "2 pounds skinless, boneless chicken thighs, cut into bite-sized pieces ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1/4 cup dry sherry ADVERTISEMENT",
            "2 1/2 tablespoons soy sauce ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "12 dried whole red chilies, or to taste ADVERTISEMENT",
            "2 tablespoons minced fresh ginger, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the frying oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nBeat the eggs in a mixing bowl until smooth. Mix in the 1/2 cup plus 2 teaspoons cornstarch until no lumps remain. Mix in the chicken until evenly coated in the batter.\nIn batches, carefully drop the chicken cubes into the hot oil one by one, cooking until the chicken turns golden brown and begins to float, about 3 minutes. Drain on a paper towel-lined plate.\nMeanwhile, combine the sugar, white vinegar, rice vinegar, sherry, soy sauce, and garlic in a small saucepan. Bring to a boil over medium-high heat. Stir constantly until the sugar has dissolved and the sauce thickens to the consistency of light pancake syrup, about 3 minutes. Remove from the heat and keep warm.\nHeat 2 tablespoons vegetable oil in a wok or large skillet over medium-high heat. Stir in the dried chiles and ginger; cook and stir until the ginger begins to brown, about 30 seconds. Remove the chiles and ginger from the wok and stir them into the sauce. Place the fried chicken cubes into the wok and cook until very crispy and dark golden brown. Serve the chicken with the sauce.\n",
        "picture_link": "Y7t92bkUwib.NHA6U631nFzmBWq4b8C"
    },
    {
        "title": "Quick Garlic Breadsticks",
        "ingredients": [
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried basil, crushed ADVERTISEMENT",
            "4 hot dog buns, split ADVERTISEMENT",
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Stir together the Parmesan cheese, garlic powder, and basil in a small bowl; set aside.\nStir together the Parmesan cheese, garlic powder, and basil in a small bowl; set aside. Spread the cut sides of the hot dog buns with margarine. Sprinkle with the Parmesan cheese mixture and place, margarine-side-up, onto a baking sheet.\nBake in the preheated oven until golden brown, about 10 minutes.\n",
        "picture_link": "XMY6e8Hg3.knUKhigmPsz2q2McZmsZ."
    },
    {
        "title": "Healthier Chicken Enchiladas I",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup light sour cream ADVERTISEMENT",
            "1 cup shredded reduced-fat Cheddar cheese ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt (optional) ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1/3 cup chopped green bell pepper ADVERTISEMENT",
            "1/3 cup chopped red bell pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "8 (10 inch) whole wheat flour tortillas ADVERTISEMENT",
            "1 (12 ounce) jar taco sauce ADVERTISEMENT",
            "3/4 cup shredded reduced-fat Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook chicken in a nonstick skillet over medium heat, until no longer pink and juices run clear, about 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Drain excess fat. Cube chicken and return to skillet. Add onion, sour cream, 1 cup Cheddar cheese, parsley, oregano, and ground black pepper. Heat until cheese melts, about 3 minutes. Stir in salt, tomato sauce, water, chili powder, green bell pepper, red bell pepper, garlic, and black beans.\nRoll even amounts of mixture into tortillas. Arrange in a 9x13-inch baking dish. Cover with taco sauce and 3/4 cup Cheddar cheese.\nBake uncovered in preheated oven until cheese is melted and sauce is bubbling, about 20 minutes. Cool 10 minutes before serving.\n",
        "picture_link": "gIP27JHaqYCQA2Gg0zfo9LMec86dSCa"
    },
    {
        "title": "Swedish Chocolate Balls (or Coconut Balls)",
        "ingredients": [
            "4 cups regular rolled oats ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 cup butter or margarine, softened ADVERTISEMENT",
            "2 tablespoons strong coffee ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened baking chocolate, melted ADVERTISEMENT",
            "1/3 cup coconut flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the oats, sugar, and cocoa together in a bowl. Add the butter, and use your hands to mix the ingredients together to make a thick dough. Mix in the coffee, vanilla, and chocolate until thoroughly blended.\nPlace the coconut flakes in a small bowl. Pinch off small amounts of dough and roll between your hands to make small balls, about 1-1/2 inches in diameter. Roll the balls in the coconut flakes. Balls are ready to eat, or may be refrigerated 2 hours to become firmer.\n",
        "picture_link": "7phrzQG/fn2tE.z89N2hamuiG8uXQVm"
    },
    {
        "title": "Authentic Pad Thai Noodles",
        "ingredients": [
            "2/3 cup dried rice vermicelli ADVERTISEMENT",
            "1/4 cup peanut oil ADVERTISEMENT",
            "2/3 cup thinly sliced firm tofu ADVERTISEMENT",
            "1 large egg, beaten ADVERTISEMENT",
            "4 cloves garlic, finely chopped ADVERTISEMENT",
            "1/4 cup vegetable broth ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried red chili flakes ADVERTISEMENT",
            "3 tablespoons chopped peanuts ADVERTISEMENT",
            "1 pound bean sprouts, divided ADVERTISEMENT",
            "3 green onions, whites cut thinly across and greens sliced into thin lengths - divided ADVERTISEMENT",
            "3 tablespoons chopped peanuts ADVERTISEMENT",
            "2 limes, cut into wedges for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak rice vermicelli noodles in a bowl filled with hot water until softened, 30 minutes to 1 hour. Drain and set aside.\nHeat peanut oil over medium heat in a large wok.\nCook and stir tofu in the wok, turning the pieces until they are golden on all sides.\nRemove tofu with a slotted spoon and drain on plate lined with paper towels.\nPour all but 1 tablespoon of used oil from the wok into a small bowl; it will be used again in a later step.\nHeat the remaining 1 tablespoon of oil in the wok over medium heat until it starts to sizzle.\nPour in beaten egg and lightly toss in the hot oil to scramble the egg.\nRemove egg from the wok and set aside.\nPour reserved peanut oil in the small bowl back into the wok.\nToss garlic and drained noodles in wok until they are coated with oil.\nStir in vegetable broth, lime juice, soy sauce, and sugar. Toss and gently push noodles around the pan to coat with sauce.\nGently mix in tofu, scrambled egg, salt, chili flakes, and 3 tablespoons peanuts; toss to mix all ingredients.\nMix in bean sprouts and green onions, reserving about 1 tablespoon of each for garnish. Cook and stir until bean sprouts have softened slightly, 1 to 2 minutes.\nArrange noodles on a warm serving platter and garnish with 3 tablespoons peanuts and reserved bean sprouts and green onions. Place lime wedges around the edges of the platter.\n",
        "picture_link": "5dmq8wpYZan17YtjAFfJgYXU1BRVnsW"
    },
    {
        "title": "Refreshing Watermelon Salad",
        "ingredients": [
            "3 tablespoons lime juice ADVERTISEMENT",
            "1 cup sliced red onion, cut lengthwise ADVERTISEMENT",
            "15 cups cubed watermelon ADVERTISEMENT",
            "3 cups cubed English cucumber ADVERTISEMENT",
            "1 (8 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "cracked black pepper ADVERTISEMENT",
            "sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, pour lime juice over red onions. Allow to marinate while assembling the salad.\nGently combine the watermelon, cucumber, feta cheese, and cilantro in a large bowl. Season with black pepper. Toss watermelon salad with marinated onions and season with sea salt just before serving.\n",
        "picture_link": "JXgcktg/ZiEWPASflgLmFxZJXovy9aa"
    },
    {
        "title": "Bacon Wrapped Pineapple",
        "ingredients": [
            "1/2 pound sliced bacon, cut into thirds ADVERTISEMENT",
            "1 (20 ounce) can pineapple chunks in juice, drained ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup chili sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nWrap each chunk of pineapple with a piece of bacon and secure with toothpicks. Place in a shallow baking dish. In a small bowl, stir together the brown sugar, mayonnaise and chili sauce; pour over the bacon wrapped pineapple.\nBake uncovered for 25 minutes in the preheated oven, until bacon is crispy on the edges and the sauce is bubbly. Serve warm.\n",
        "picture_link": "2JYDsRDRPOltfgcn8UcSKbXdGQDp/mG"
    }
]