[
    {
        "title": "Restaurant-Style French Onion Soup",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "8 onions, sliced ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 tablespoon sherry ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 quarts beef broth ADVERTISEMENT",
            "1 French baguette, cut into 1/2-inch thick slices ADVERTISEMENT",
            "olive oil, or as needed ADVERTISEMENT",
            "6 slices Swiss cheese ADVERTISEMENT",
            "6 slices provolone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large soup pot over medium heat. Cook and stir onions, garlic, salt, black pepper, and thyme until onions are soft and brown, about 30 minutes. Pour in red wine and sherry; bring to a boil. Reduce heat to low and simmer until you can no longer smell alcohol cooking off, about 15 more minutes.\nSprinkle onion mixture with flour and stir until coated; cook for 10 minutes. Pour in broth, stir to blend in flour, and simmer until slightly thickened, about 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C) while soup is simmering. Arrange bread slices on a baking sheet and drizzle with olive oil.\nToast the baguette slices in the preheated oven until golden brown, 12 to 14 minutes, turning the bread over halfway through cooking. Remove toast and set aside.\nSet an oven rack about 8 inches from the heat source and turn on the oven's broiler.\nLadle soup into 6 oven-proof crocks, filling them about 3/4 full. Place 1 or 2 bread slices into the bowls and top each with a slice of Swiss cheese and a slice of provolone. Carefully place filled crocks onto a sturdy baking sheet.\nBroil soup until the cheese is browned and bubbling, 3 to 4 minutes.\n",
        "picture_link": "nZPs/otqMm/Alkw24mCp2OKbLUGjpya"
    },
    {
        "title": "Lemon-Lime Cupcakes",
        "ingredients": [
            "1 1/2 cups butter ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 tablespoons lemon extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup lemon-lime soda (e.g. 7-Up™) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 12 cup muffin pans and line with paper baking cups.\nBeat butter and sugar in a large bowl using an electric mixer until light and fluffy, about 15 minutes. Mix in the eggs one at a time, mixing each until well blended. Stir in the lemon extract. Stir in the flour, alternating with the lemon-lime soda, just until the batter is smooth. Spoon the batter into the prepared cups, dividing evenly.\nBake in the preheated oven until the tops spring back when lightly pressed, 20 to 25 minutes. Cool in the pan set over a wire rack. When cool, arrange the cupcakes on a serving platter.\n",
        "picture_link": "9SPrQvF.aYC8xCG9ulLIGT91zy4vu46"
    },
    {
        "title": "Savory Halibut Enchiladas",
        "ingredients": [
            "2 pounds skinless halibut fillets, cut into large pieces ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 green bell pepper, finely chopped ADVERTISEMENT",
            "1/4 cup coarsely chopped fresh cilantro ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 (10 ounce) cans enchilada sauce ADVERTISEMENT",
            "8 flour tortillas ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 avocados - peeled, pitted, and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSeason the halibut with garlic powder, salt, and pepper; cook in microwave until slightly cooked, about 2 minutes. Mix together the green onion, bell pepper, cilantro, sour cream, mayonnaise and 1 cup Cheddar cheese in a bowl. Gently fold the halibut into the mixture.\nPrepare a 9x13 baking dish with cooking spray. Pour 1/2 of a can of enchilada sauce into the bottom of the baking dish.\nPour 1 can of enchilada sauce into a bowl. Dip the tortillas, one at a time, into the sauce to lightly coat. Spoon the halibut in equal portions into the center of each tortilla. Make the enchiladas by tightly rolling the tortillas and place seam-side down in the baking dish. Pour the remaining enchilada sauce over top of the enchiladas. Sprinkle with 1 cup Cheddar cheese. Cover the dish with aluminum foil\nBake in preheated oven for 45 minutes. Top with avocado slices to serve.\n",
        "picture_link": "wH0g2eHejY94Orr8/hN5sH2NCPEd0fS"
    },
    {
        "title": "Eggplant and Goat Cheese Lasagna",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 large eggplant, sliced into 1/4 inch rounds ADVERTISEMENT",
            "1 (28 ounce) jar garden vegetable pasta sauce ADVERTISEMENT",
            "1 (11 ounce) log goat cheese, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpray a 9x13-inch baking dish with cooking spray.\nArrange one fourth of eggplant slices in a layer in the bottom of the dish.\nPour one fourth of pasta sauce on top of eggplant layer.\nDot pasta sauce layer with one fourth of goat cheese slices.\nRepeat layers three more times with remaining ingredients, ending with a top layer of goat cheese.\nBake in preheated oven until pasta sauce is bubbling and goat cheese is melted, 45 to 60 minutes.\n",
        "picture_link": ".Ad6CVLiX1OS/idkSLYFSUU1d5OS4Hq"
    },
    {
        "title": "Herbed Cream Cheese Omelet",
        "ingredients": [
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1/2 cup fresh cilantro leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the cream cheese with the cilantro in a bowl, adding salt and pepper to taste.\nHeat one-quarter of the butter in a well-seasoned omelet pan or 8 inch non-stick frying pan over medium-high heat. When the butter is hot and bubbling, swirl it around in the pan.\nJust before the butter begins to brown, beat 2 of the eggs and pour into pan. Lower the heat.\nAfter 10 seconds or so, the omelet will coagulate. Push the omelet to one side of the pan with a spoon or spatula, and let the raw egg run over the cleared skillet. Repeat this one more time, then take the skillet off the heat.\nDab one quarter of the herbed cream cheese along the middle of the omelet from one side to the other. Season the omelet with additional salt and pepper to taste. If it has not completely set, place the pan over medium heat for a half minute longer. When the omelet is set, slide it from the pan onto a plate so that the omelet rolls up and the herbed cream cheese runs along the length of the roll. Serve it right away. Make three more omelets the same way, making sure the pan and butter get good and hot before adding the beaten eggs. Serve each one as soon as it is cooked.\n",
        "picture_link": "1kjXr/3coSdrxo4.9xk.xZJxWK4mL3W"
    },
    {
        "title": "Oatmeal Lace Cookies",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "1/3 cup melted butter ADVERTISEMENT",
            "2 tablespoons cream ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together flour, baking powder and sugar. Add oatmeal, light corn syrup, melted butter, cream and vanilla. Blend well.\nDrop on ungreased cookie sheet 4 inches apart, using 1/4 teaspoon as a measure. Bake in 375 degree F (190 degrees C) oven for 5-7 minutes. Let stand a few seconds before removing from pan.\n",
        "picture_link": "uWTmT1TugQPRKyOM.iF0zH2TQy5txJO"
    },
    {
        "title": "Homemade Hashbrowns",
        "ingredients": [
            "2 cups mashed potatoes ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 onion, finely diced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg in a medium size mixing bowl. Mix egg and onion with mashed potatoes. Add salt and pepper.\nHeat olive oil in a medium size frying pan, over a medium heat. Scoop the potato mixutre into the frying pan in 4 inch circles, pat with a spatula to flatten the mounds to approximately 1/2 to 1 inch thick. Cook until bottom is browned. Flip the patty over and brown on the other side.\n",
        "picture_link": "qAGWUogqrnDS98QclejcVUzPldG.ueS"
    },
    {
        "title": "Shortbread Cookies III",
        "ingredients": [
            "1 1/2 cups butter, softened ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 cup cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Work all the ingredients together with your hands until blended. Shape all of the dough into 1 inch balls.\nBake cookies on ungreased cookie sheets, 2 inches apart at 300 degrees F (150 degrees C) for 20 minutes.\nLet cool 10 minutes then carefully lift with spatula to cake racks to cool. Store in air tight container with wax paper between layers. Cookies keep well.\nVariations: Flatten some balls with tines of fork and press 1/4 of a red or green glace cherry in center of each. Make thumbprint indentation in some balls and fill with a tiny bit of jam, jelly or marmalade. Dip some balls in slightly beaten egg white and roll in finely chopped walnuts. Bake as they are or make an indentation in top and spoon in a little jam or marmalade. Dip some balls in egg white and roll in desiccated coconut. Bake as they are or make an indentation and spoon in a little jam, jelly or marmalade.\n",
        "picture_link": "0W2sJsAMrozAifmDkQ2UMrQTFjXRtSy"
    },
    {
        "title": "Patty's Pasta Salad",
        "ingredients": [
            "1 1/2 pounds seashell pasta ADVERTISEMENT",
            "1 (6 ounce) can pitted black olives, chopped ADVERTISEMENT",
            "2 large tomatoes, chopped ADVERTISEMENT",
            "4 ounces sliced pepperoni sausage, each slice cut in half ADVERTISEMENT",
            "1/2 cup chopped green olives ADVERTISEMENT",
            "3 bunches green onions, chopped ADVERTISEMENT",
            "2 cups chopped ham ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 (16 ounce) bottle zesty Italian dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot of salted boiling water, cook pasta until al dente, rinse under cold water and drain.\nIn a large bowl, combine the pasta, black olives, tomatoes, pepperoni, green olives, green onions and ham or turkey. Before serving, add shredded mozzarella and dressing. Toss well and serve.\n",
        "picture_link": "BOg5uWK/Jlue.04ZzcodqyNnzWLzaLi"
    },
    {
        "title": "Lemon Chicken Soup I",
        "ingredients": [
            "4 pounds whole chicken ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "1/2 (16 ounce) package uncooked orzo pasta ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 lemons ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large soup pot, cook chicken in water until the meat begins to fall off the bone.\nSkim fat off stock. Remove the chicken from pot, and set aside to cool. Add pasta to stock, and cook for about 10 minutes. Shut off heat.\nIn a medium bowl, beat 2 eggs with the juice of 2 lemons until foamy. Whisk 1 cup stock slowly into the egg/lemon mixture. Repeat with another cup of stock, and pour mixture into soup.\nBone chicken, and add meat to soup. Stir well. Add salt and pepper to taste.\n",
        "picture_link": "flpM5G.LfkTHgBEboHj0TYJVposcwpe"
    },
    {
        "title": "Honey Curried Chicken",
        "ingredients": [
            "18 cut up chicken pieces ADVERTISEMENT",
            "1/4 cup prepared mustard ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "3 tablespoons curry powder ADVERTISEMENT",
            "2 (4.5 ounce) cans mushrooms, drained ADVERTISEMENT",
            "1 (4.5 ounce) can mushrooms, drained, liquid reserved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nLay chicken pieces in a 9x13 inch baking dish. In a small microwave safe bowl mix together the mustard, honey and curry powder. Microwave on HIGH (full power) for 1 minute. Add all of the mushrooms, mix together, and pour mixture over chicken. Bake in the preheated oven for 45 to 50 minutes or until chicken is cooked through and juices run clear. Turn chicken pieces after 1/2 hour of baking. When done, chicken will be a beautiful golden brown.\n",
        "picture_link": "DIJnTpkywLxNzexP4cvXRV3.jX2C.Yu"
    },
    {
        "title": "Nut Rolls",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 pint sour cream ADVERTISEMENT",
            "1 ounce active dry yeast ADVERTISEMENT",
            "1/2 cup warm milk ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "7 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 pounds ground walnuts ADVERTISEMENT",
            "1 1/4 cups melted butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract (optional) ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together 1 cup white sugar, 1/4 teaspoon salt, 1 cup melted butter, and 3 eggs. Mix and add 1/2 pint sour cream. Mix together yeast with warm milk and 1 teaspoon sugar. Add to mixture. Add flour. Mix and knead. Divide dough into 7 equal parts.\nTo Make Filling: Melt 1 cup plus 3 tablespoons butter. Add 2 cups sugar and stir to dissolve. Add to ground walnuts and mix until coated. Add ground cinnamon and vanilla extract to taste, if desired. Divide filling into 7 equal amounts.\nRoll each dough ball into rectangle. Spread slightly beaten egg white on top of dough. Spread equal amounts of filling on top of each rectangle. Roll in edges and spread edges with egg whites to seal. Then roll length wise. Brush tops with egg whites.\nBake in a 350 degrees F (175 degrees C) preheated oven for 30 minutes or until lightly brown. Cool. These freeze well.\n",
        "picture_link": "dCtX.nsaGSKjNHRHS0C8201DswGvHEG"
    },
    {
        "title": "Ibby's Pumpkin Mushroom Stuffing",
        "ingredients": [
            "6 cups cubed pumpkin bread ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup butter or margarine ADVERTISEMENT",
            "2 cups chopped red onion ADVERTISEMENT",
            "2 cups sliced crimini mushrooms ADVERTISEMENT",
            "2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "2 tablespoons chopped fresh tarragon ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "6 tablespoons chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread bread cubes on a baking sheet, and let dry overnight. Alternatively, heat in a 250 degrees F (120 degrees C) oven until dry, about 1 hour.\nPreheat oven to 375 degrees F (190 degrees C). Butter a 2 quart baking dish.\nMelt butter in a large skillet over medium heat. Saute celery and onions for about 10 minutes. Add mushrooms, and continue cooking for about 8 minutes, or until tender. Season with rosemary, tarragon, chives, parsley, salt, and pepper. Fold in bread cubes, and add enough broth to moisten. Transfer to prepared dish, and cover with foil.\nBake in preheated oven for 40 minutes. Remove cover, and bake for 10 minutes, or until top is crisp.\n",
        "picture_link": "FaK4Mo4LRy1SJFmoVzsB85qzTxJtzfe"
    },
    {
        "title": "Tofu Turkey I",
        "ingredients": [
            "5 (16 ounce) packages extra firm tofu ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 red onion, finely diced ADVERTISEMENT",
            "1 1/3 cups diced celery ADVERTISEMENT",
            "1 cup chopped mushrooms ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/8 cup dried sage ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 teaspoons dried rosemary ADVERTISEMENT",
            "1/4 cup tamari ADVERTISEMENT",
            "3 cups prepared herb stuffing ADVERTISEMENT",
            "1/2 cup sesame oil ADVERTISEMENT",
            "1/4 cup tamari ADVERTISEMENT",
            "2 tablespoons miso paste ADVERTISEMENT",
            "5 tablespoons orange juice ADVERTISEMENT",
            "1 teaspoon honey mustard ADVERTISEMENT",
            "1/2 teaspoon orange zest ADVERTISEMENT",
            "3 sprigs fresh rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a medium sized, round colander with a cheese cloth or a clean dish towel. Place the crumbled tofu in the colander. Place another cheese cloth over the top of the tofu. Place the colander over the top of a bowl to catch the liquid. Place a heavy weight on top of tofu. Refrigerate the colander, tofu and weight for 2 to 3 hours.\nMake the stuffing: In a large frying pan saute onion, celery and mushrooms in 2 tablespoons of the sesame oil until tender. Add the garlic, sage, thyme, salt and pepper, rosemary and 1/4 cup of the tamari. Stir well; cook for 5 minutes. Add prepared herb stuffing and mix well. Remove from heat.\nPreheat the oven to 400 degrees F (200 degrees C). Grease a cookie sheet.\nCombine 1/2 cup sesame oil, 1/4 cup tamari, miso, orange juice, mustard and orange zest in a small bowl; mix well.\nRemove the weight from the tofu. Hollow out the tofu so that there is one inch of tofu still lining the colander. Place the scooped out tofu in a separate bowl. Brush the tofu lining with a small amount of the miso seasoning. Scoop the stuffing into the center of the tofu shell. Place the leftover tofu on top of the stuffing and press down firmly. Turn the stuffed tofu onto the prepared cookie sheet. Putting the leftover tofu side of the \"turkey\" (the flat side) down. Gently press on the sides of the \"turkey\" to form a more oval shape. Brush the tofu turkey with 1/2 of the oil-tamari mixture. Place the sprigs of rosemary on top of the tofu. Cover the \"turkey\" with foil.\nBake for one hour. After one hour, remove \"turkey\" from the oven and remove the foil. Baste the \"turkey\" with the remaining tamari-oil sauce (reserving 4 tablespoons of sauce). Return \"turkey\" to oven and bake another hour or until the tofu turkey is golden brown. Place the tofu turkey on a serving platter, brush with the remaining tamari-oil mixture and serve hot.\n",
        "picture_link": "DyjCYcgDrc6W0kk4sZwBEWoqZCWbt0K"
    },
    {
        "title": "Grilled Caribbean Chicken Breasts",
        "ingredients": [
            "1/4 cup fresh orange juice ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon hot pepper sauce ADVERTISEMENT",
            "1/2 teaspoon chopped fresh oregano ADVERTISEMENT",
            "1 1/2 skinless, boneless chicken breasts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine the orange juice, orange peel, olive oil, lime juice, ginger, garlic, hot pepper sauce and oregano. Blend into a marinade.\nPlace chicken breasts in a nonporous glass dish or bowl. Pour marinade over chicken, cover dish or bowl and refrigerate to marinate for at least 2 hours, or up to 24 hours.\nPreheat oven to broil OR preheat grill to medium high heat and lightly oil grate.\nRemove chicken from marinade (disposing of any leftover marinade) and grill or broil 6 inches from the heat source for about 7 minutes per side, or until chicken is cooked through and no longer pink inside.\n",
        "picture_link": "rmagkH7NlL6uirkqDZK9M9YpJJIf5Ou"
    },
    {
        "title": "Linzer Torte Cookies",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup blanched slivered almonds, ground ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1 cup raspberry jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 11x7 inch baking pan.\nIn a medium bowl, cream together the butter and sugar. Beat in the egg and lemon peel. In another bowl, stir together the flour, almonds, cinnamon and cloves. Gradually stir the dry ingredients into the creamed mixture. The dough will be stiff, so you may need to knead it by hand to get it to come together. Press half of the dough into the bottom of the prepared pan.\nPress half of the dough into the bottom of the prepared pan. Spread the preserves over the crust. On a lightly floured surface, roll the remaining dough into long rope about 1/2 inch in diameter. Place lengths of the rope across the top of the jam in a lattice pattern over the preserves.\nBake 40 minutes or until top is golden. Cool in pan on wire rack. Cut into 2 inch by 1inch bars.\n",
        "picture_link": "zEvpyTXhdP9/DX1b1j/TGzNZvYQZ/Fa"
    },
    {
        "title": "Tofu Fudge Mocha Bars",
        "ingredients": [
            "1 (12 ounce) package silken tofu, undrained ADVERTISEMENT",
            "2 tablespoons safflower oil ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 1/3 cups turbinado sugar ADVERTISEMENT",
            "1 cup cocoa powder ADVERTISEMENT",
            "1/3 cup instant decaffeinated coffee powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nUsing an electric mixer, blend tofu until creamy. Add oil, salt, sugar, cocoa, coffee and vanilla and blend well.\nWhen sugar is dissolved into the tofu mixture remove the bowl from the electric mixer and whisk in flour.\nPour batter into a greased 9x13 inch baking pan.\nBake 25 to 30 minutes, or until the cake pulls away from the side of the pan. The bars will appear glossy, almost underdone. Cool in the pan and when cool cut into bars using a clean, wet knife.\n",
        "picture_link": "BAZpu3l6YZML6ejdN1DLEsMzm9imYE."
    },
    {
        "title": "Ranch Potatoes",
        "ingredients": [
            "5 pounds peeled and cubed potatoes ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "4 tablespoons heavy cream (optional) ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of salted water to a boil. Add potatoes; cook until tender but still firm. Drain, and transfer to a large bowl.\nBefore mashing potatoes, add the cream cheese, salad dressing, cream and salt.\nBeat with a mixer until smooth. Serve immediately.\n",
        "picture_link": "oc9WQr2aTZHqNFrW6vVfc1hPjueF8Wm"
    },
    {
        "title": "Cucumber Soup I",
        "ingredients": [
            "2 cucumbers ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 tablespoon farina ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/8 tablespoon dried tarragon ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel, seed, and chop 2 cucumbers.\nCook the chopped scallions in the margarine until soft. Add the chopped cucumbers and the wine vinegar. Pour in the broth, and stir in the farina. Salt to taste, and add tarragon. Let the soup simmer for 20 minutes, or until the cucumbers are soft.\nPut the soup into a blender, and puree it.\nPour the puree into a bowl, and whisk in the sour cream. Taste the soup for seasoning. Pour the soup into bowls, and garnish with cucumber slices and chopped parsley.\n",
        "picture_link": "NaEKgBsX1Bk9joi4mGr0hXGL3y8.RZy"
    },
    {
        "title": "Easy Tortilla Soup",
        "ingredients": [
            "2 (10.5 ounce) cans condensed chicken and rice soup ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "8 ounces tortilla chips ADVERTISEMENT",
            "4 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium high heat, combine the soup, tomatoes and chilies and tomato sauce. Bring just to a boil and remove from heat. Place some tortilla chips in the bottom of an individual bowl and sprinkle cheese over the chips. Pour soup over the chips and cheese.\n",
        "picture_link": "zpLNABWyBtfq9ssGtO4im8xbNQZrV6S"
    },
    {
        "title": "Banana Pie",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "5 bananas ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 (3.5 ounce) packages instant banana pudding mix ADVERTISEMENT",
            "3 1/2 cups milk ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "2 bananas, sliced (optional) ADVERTISEMENT",
            "1 tablespoon lemon juice (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix graham cracker crumbs and sugar. Stir in melted butter. Mix thoroughly, then press mixture into bottom of a 9x13 inch pan.\nCut bananas into 1/4 inch slices and make a single layer of banana slices on graham cracker crust. Reserve remaining banana slices.\nIn a large mixing bowl, whip cream cheese until fluffy. Add pudding mix and whip mixture until smooth. Add milk and mix until all ingredients are thoroughly combined. Pour mixture over layer of bananas.\nMake another layer of banana slices on top of pudding layer. Cover bananas with whipped topping. Refrigerate at least 3 hours before serving. If using banana slices for garnish, toss with lemon juice to prevent browning.\n",
        "picture_link": "qbF5H1CKoWr3huoyPe9nMIsNxFqKsJC"
    },
    {
        "title": "Granola-Chocolate Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups granola ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped, unsalted dry-roasted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl, cream together the butter, brown sugar and white sugar. Beat in the egg and vanilla. Combine the flour, salt and baking soda, stir into the creamed mixture. Finally, stir in the granola, chocolate chips and peanuts. Drop dough by heaping teaspoonfuls onto greased cookie sheets, about 2 inches apart.\nBake 12 to 15 minutes in the preheated oven, until cookies are lightly browned around edges. Remove cookies to wire racks and allow to cool.\n",
        "picture_link": "kG7LJRQ18gq1EhQL2Oo9aMqe6MoK6GK"
    },
    {
        "title": "Peach Salsa II",
        "ingredients": [
            "4 cups fresh peaches - peeled, pitted and chopped ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "4 jalapeno peppers, minced ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1 teaspoon grated lime zest ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 (49 gram) package light fruit pectin crystals ADVERTISEMENT",
            "3 1/2 cups white sugar ADVERTISEMENT",
            "canning jars ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sterilize jars and lids.\nIn a large saucepan, combine peaches, onion, pepper, cilantro, garlic, cumin, vinegar, and lime zest. Stir together pectin and 1/4 cup sugar. Bring to a boil, and stir in remaining 3 1/2 cups sugar. Boil for 1 minute, stirring constantly. Remove from heat, and stir for 5 minutes.\nPour peach salsa into prepared jars, leaving 1/4 inch air space. Seal, and process in a boiling water bath for 15 minutes.\n",
        "picture_link": "UrxhJJkdeIYvNO94H75TMfWpn6SHAEe"
    },
    {
        "title": "Brown Sugar Cut-Out Cookies and Icing",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups brown sugar ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "1 cup butter, very soft ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "confectioners' sugar ADVERTISEMENT",
            "splash of milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together 1 cup butter and brown sugar until smooth and creamy. Stir in 1 teaspoon vanilla. In a separate bowl, combine the flour, salt, and baking soda; stir into creamed mixture. Mix in milk, stirring until a soft dough forms. Cover, and chill for 1 hour.\nPreheat oven to 365 degrees F (185 degrees C). On a floured surface, roll out dough to 1/4 inch thick. Cut into desired shapes using cookie cutters. Place cookies 2 inches apart on ungreased cookie sheets.\nBake in a preheated oven for 6 minutes. Cool on wire racks.\nMeanwhile, in a large bowl, stir together 1 cup butter and 1 teaspoon vanilla until it becomes smooth and creamy. Gradually stir in sugar, one cup at a time, beating well after each addition. Beat in a splash of milk, and continue mixing until light and fluffy. Keep icing covered until ready to decorate. Spread icing on top of cookies.\n",
        "picture_link": "izmjJtrIF58v1Sn/xzuJR77YTvEZrzu"
    },
    {
        "title": "Grilled Scallops",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "2/3 cup chopped onions ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/2 pounds sea scallops ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat and lightly oil grate.\nMelt butter in a saucepan over medium heat. Cook onion and garlic until soft and translucent, about 5 minutes. Remove from heat, and stir in lemon juice and salt. Place scallops in a large bowl, and toss with butter mixture. Let stand for about 2 minutes.\nThread scallops onto skewers, or use a wire grill basket. Cook on preheated grill for about 4 minutes per side.\nReturn butter mixture to saucepan, and bring to a boil. Reduce heat to low, and keep warm while scallops cook. Toss with grilled scallops and serve.\n",
        "picture_link": "Wp80ihz3RWcBEgDCus4zws.9nqDtjW2"
    },
    {
        "title": "Steamed Mussels with Fennel, Tomatoes, Ouzo, and Cream",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 shallots, finely chopped ADVERTISEMENT",
            "4 cloves garlic, finely chopped ADVERTISEMENT",
            "1 bulb fennel - trimmed, cored and thinly sliced ADVERTISEMENT",
            "1 large tomato, cubed ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1/4 cup ouzo ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "4 pounds mussels, cleaned and debearded ADVERTISEMENT",
            "1/3 cup fresh basil leaves, torn ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a medium saucepan over medium heat. Stir in shallots and garlic, and cook until tender. Stir in fennel and tomato, and continue cooking about 5 minutes.\nMix white wine, ouzo, and heavy cream into the saucepan, and bring to a boil. Gradually stir in mussels, 1/2 the basil, and salt.\nCover saucepan, and continue cooking about 5 minutes, until the mussels have opened. Garnish with remaining basil to serve.\n",
        "picture_link": "N7DrCzu0B/9EUryjTz4T23IYlbYU8Oa"
    },
    {
        "title": "Orange Buttermilk Salad",
        "ingredients": [
            "1 (20 ounce) can crushed pineapple, undrained ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 (6 ounce) package orange flavored Jell-O® ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix pineapple and sugar together in a medium saucepan, and bring to a low boil, stirring occasionally. Stir in gelatin until completely dissolved, remove from heat, and cool to room temperature. Add buttermilk, and refrigerate 1 hour, or until partially set.\nGently fold in whipped topping. Pour mixture into a lightly oiled gelatin mold. Refrigerate 8 hours, or until completely set.\n",
        "picture_link": "S9OivwS5sOCgAP2w0cPI.PY0VMhc1JG"
    },
    {
        "title": "Vidalia Heaven",
        "ingredients": [
            "4 Vidalia onions ADVERTISEMENT",
            "4 cubes beef bouillon ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat, and lightly oil grate.\nPeel each onion, and core out the center. Drop a beef bouillon in the core of each onion, and cover the bouillon with 1 tablespoon of butter. Wrap tightly with aluminum foil.\nCook on grill for 30 to 60 minutes, or to desired doneness. Be careful not to puncture the aluminum foil, or the juices will drip out, and the onion will burn.\n",
        "picture_link": "gnLTP1XmTqQjzLKNOp40dasURJrQWei"
    },
    {
        "title": "Italian Tacos",
        "ingredients": [
            "1/2 pound Italian sausage ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (16 ounce) jar tomato pasta sauce ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "16 taco shells, heated ADVERTISEMENT",
            "3 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 tablespoon dried Italian seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the ground beef and Italian sausage in a large heavy skillet. Cook over medium heat until evenly browned. Drain off excess grease, and season meat with Italian seasoning.\nHeat the pasta sauce in a saucepan over medium heat until heated through. When the sauce is warm, stir in the sugar.\nFill taco shells with the meat mixture, spoon pasta sauce over, and top with mozzarella cheese.\n",
        "picture_link": "3scOWGje0U68uEH9xbuF/crbd9U0D6O"
    },
    {
        "title": "The Casserole",
        "ingredients": [
            "8 large potatoes, peeled and chopped ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 (15 ounce) can carrots, drained ADVERTISEMENT",
            "1 (15 ounce) can green beans, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish; set aside\nBring a large saucepan of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain and mash.\nPlace lean ground beef and onion in a large skillet. Cook and stir over medium high heat until beef is evenly browned and onion is tender. Drain fat and stir in carrots, green beans, cream of mushroom soup and tomato soup.\nPour mixture into the prepared baking dish and top with mashed potatoes. Sprinkle with Cheddar cheese and bake in preheated oven for 30 minutes, or until potatoes are lightly browned.\n",
        "picture_link": "W3COjfYudCDv2YkXCH/RINOmcbMn902"
    },
    {
        "title": "Easy Hamantaschen",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup granulated sugar ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "5 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 cup fruit preserves, any flavor ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, beat the eggs and sugar until lightly and fluffy. Stir in the oil, vanilla and orange juice. Combine the flour and baking powder; stir into the batter to form a stiff dough. If dough is not stiff enough to roll out, stir in more flour. On a lightly floured surface, roll dough out to 1/4 inch in thickness. Cut into circles using a cookie cutter or the rim or a drinking glass. Place cookies 2 inches apart onto the prepared cookie sheets. Spoon about 2 teaspoons of preserves into the center of each one. Pinch the edges to form three corners.\nBake for 12 to 15 minutes in the preheated oven, or until lightly browned. Allow cookies to cool for 1 minute on the cookie sheet before removing to wire racks to cool completely.\n",
        "picture_link": "f3hsSlhZSfasZBulB22uC8NNwQBCpOi"
    },
    {
        "title": "Salmon and Shrimp Cakes from Chef Bubba",
        "ingredients": [
            "10 ounces shrimp, peeled, deveined and minced ADVERTISEMENT",
            "1 cup finely chopped red bell pepper ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil, divided ADVERTISEMENT",
            "1 pound salmon fillets ADVERTISEMENT",
            "1 3/4 cups dry whole wheat bread crumbs ADVERTISEMENT",
            "5 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "1 fresh jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "2 eggs, well beaten ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Lightly grease a medium baking sheet.\nIn a medium skillet over medium low heat, cook and stir shrimp and red bell pepper until shrimp is partially cooked. Remove from heat, and set aside. Heat 1 tablespoon olive oil in the skillet over medium heat, and cook salmon just until no longer pink. Remove from heat, cool, and finely chop.\nIn a medium bowl, mix whole wheat bread crumbs, Parmesan cheese, black pepper, basil, and thyme. Stir in shrimp, red bell pepper, salmon, remaining olive oil, chives, and jalapeno. Thoroughly blend eggs and cream cheese into the mixture.\nDivide the mixture into about 4 patties 3/4 inch thick, and arrange on the prepared baking sheet. Bake 20 to 25 minutes in the preheated oven, until lightly browned.\n",
        "picture_link": "S9Y89n6D6vkQeii2p5N3jMLithV.eSy"
    },
    {
        "title": "Don't Want to Cook Monday Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (14 ounce) bag frozen broccoli florets ADVERTISEMENT",
            "1 (10.75 ounce) can condensed golden mushroom soup ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Spray a 9x13 inch baking dish with cooking spray.\nSpread the broccoli evenly in the bottom of the baking dish. Place chicken breasts over the broccoli. In a medium bowl, stir together the condensed soup, sour cream and horseradish. Pour or spread evenly over the chicken and broccoli.\nBake uncovered for 1 hour in the preheated oven. Let stand for a few minutes before serving for the sauce to thicken.\n",
        "picture_link": "1ObMHVNObWIPaorH3NxCGDsVvIHGcy6"
    },
    {
        "title": "Anthony's Chicken",
        "ingredients": [
            "1 pound dry penne pasta ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 (4 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1/2 cup olive oil for frying ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pound sliced bacon ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 (18 ounce) bottle honey mustard barbecue sauce ADVERTISEMENT",
            "3 tablespoons spicy brown mustard ADVERTISEMENT",
            "1 (8 ounce) package shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Transfer to a deep 9x13 inch baking dish.\nIn a medium bowl, whisk together the eggs and milk. Season with salt and pepper. Dip the chicken breasts in the egg mixture, then roll in bread crumbs to coat. Heat the olive oil and butter in a large skillet over medium-high heat. Fry chicken breasts until the juices run clear, and they are well browned on both sides. Remove to paper towels to drain. Drain excess oil from the chicken pan, leaving it coated.\nWhile the chicken is cooking, place bacon in a large, deep skillet. Cook over medium-high heat until crisp. Remove bacon from pan, crumble and set aside.\nPlace the skillet that used to have chicken in it over medium heat. Add tomato, onion and bacon, and cook for about 5 minutes, or until onion is soft. Pour in the barbeque sauce and spicy mustard. Simmer for 5 minutes. Pour the sauce over the pasta in the dish, then place the chicken on the top, and cover with shredded Monterey Jack cheese.\nBake for 15 to 20 minutes in the preheated oven, until cheese is melted and dish is heated through.\n",
        "picture_link": "4DcwO5WC/x.SSM6mKTzpg4vPrkjHNy6"
    },
    {
        "title": "Ryan's Favorite Beans",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "1 (31 ounce) can pork and beans, drained ADVERTISEMENT",
            "1 (31 ounce) can pork and beans, with liquid ADVERTISEMENT",
            "2 (15 ounce) cans kidney beans, drained ADVERTISEMENT",
            "1 (15 ounce) can lima beans, drained ADVERTISEMENT",
            "1 1/2 cups barbeque sauce ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring (optional) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace bacon in a Dutch oven. Cook over medium high heat until evenly brown. Drain, crumble, and set aside. Place the ground beef and onion in the Dutch oven. Cook until beef is evenly brown and onion is tender.\nReturn bacon to the Dutch oven. Mix in the drained pork and beans, pork and beans with liquid, kidney beans, and lima beans. Stir in the barbeque sauce, brown sugar, vinegar, and liquid smoke. Season with salt and pepper.\nCover Dutch oven, and bake 1 hour in the preheated oven.\n",
        "picture_link": "eUi3apQaI6rX0ryQJUkLzbbb0hNrzY."
    },
    {
        "title": "Plastic Chocolate",
        "ingredients": [
            "1 pound semisweet chocolate, chopped ADVERTISEMENT",
            "3/4 cup light corn syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate in a large metal bowl over a pan of simmering water. Stir occasionally until smooth. Remove from heat, and stir in the corn syrup. The mixture will become sticky, but keep stirring until very well blended.\nSpoon onto a piece of plastic wrap, and wrap tightly. Let stand at room temperature until firm before using. Overnight is best. Use unsweetened cocoa powder on work surfaces to prevent sticking.\n",
        "picture_link": "vnTkTY6RCuFiY97OapomEC5eU1SQV4y"
    },
    {
        "title": "Big M's Spicy Lime Grilled Prawns",
        "ingredients": [
            "48 large tiger prawns, peeled and deveined ADVERTISEMENT",
            "4 limes, zested and juiced ADVERTISEMENT",
            "4 green chile peppers, seeded and chopped ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger root, chopped ADVERTISEMENT",
            "1 medium onion, coarsely chopped ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the prawns and lime zest in a large, non-metallic bowl. Place the lime juice, chile pepper, garlic, ginger, and onion in a food processor or blender, and process until smooth. You may need to add a little oil to facilitate blending. Pour over the bowl of prawns, and stir to coat. Cover, and refrigerate for 4 hours.\nPreheat grill for medium-high heat. Thread prawns onto skewers, piercing each first through the tail, and then the head.\nBrush grill grate with oil. Cook prawns for 5 minutes, turning once, or until opaque.\n",
        "picture_link": "gIYkT3TochAn0Vm1wZPWR2cT0jHchFa"
    },
    {
        "title": "Rubbed Down Pork Chops",
        "ingredients": [
            "2 tablespoons garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "4 pork chops ADVERTISEMENT",
            "4 tablespoons minced garlic ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/2 cup water, divided ADVERTISEMENT",
            "1 medium onion, sliced ADVERTISEMENT",
            "2 cups fresh mushrooms, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the garlic powder, salt, and pepper. Rub pork chops on both sides with the garlic powder mixture and the minced garlic.\nIn a skillet over medium heat, mix the Worcestershire sauce and 1/4 cup water. Place pork chops in the skillet, and cook 10 minutes.\nTurn chops in the skillet, and pour in remaining 1/4 cup water. Mix in the onion and mushrooms, and continue cooking 10 minutes, or to desired doneness.\n",
        "picture_link": "b4oFdN/RfpHnYOQaVqkXaQg/cVTYxx2"
    },
    {
        "title": "Christmas Strawberry Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 3/4 cups frozen sweetened strawberries, thawed ADVERTISEMENT",
            "2 tablespoons strawberry extract ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 cups sugar ADVERTISEMENT",
            "1 1/2 cups canola oil ADVERTISEMENT",
            "1/4 cup frozen sweetened strawberries, thawed, with syrup ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 tablespoon strawberry extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 5x9 inch loaf pans.\nIn a bowl, mix the flour, baking soda, salt, and cinnamon. In a separate bowl, beat together the 1 3/4 cups strawberries, 2 tablespoons strawberry extract, eggs, sugar, and oil. Gradually beat the flour mixture into the strawberry mixture. Transfer to the prepared loaf pans.\nBake 45 minutes in the preheated oven, or until a toothpick inserted in the center of a loaf comes out clean. Cool on wire racks.\nIn a saucepan, mix the 1/4 cup strawberries with syrup, sugar, water, and 1 tablespoon strawberry extract. Bring to a boil, and stir constantly until sugar is dissolved, about 5 minutes. Pour over the bread while still warm.\n",
        "picture_link": "oJyE.9qPRI36SPLzeUEgx0CrM.1eYQe"
    },
    {
        "title": "English Baked Potatoes",
        "ingredients": [
            "4 large potatoes, cut into wedges ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, toss potato wedges and olive oil until the potatoes are coated. Spread the wedges out on a large baking sheet. Season with salt and pepper to taste.\nBake for 20 minutes in the preheated oven, turn over, and bake for an additional 10 to 15 minutes, or until tender. Serve plain, with vinegar, or dip in ketchup.\n",
        "picture_link": "ezYuU8zmc54KIU2tlspVElfNik/x4u6"
    },
    {
        "title": "Blackened Chicken Pizza with Yellow Tomato Salsa",
        "ingredients": [
            "1 1/2 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "3 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons freshly ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "1 1/2 teaspoons dried thyme ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into 1 inch strips ADVERTISEMENT",
            "3 tablespoons canola oil ADVERTISEMENT",
            "2 yellow pear tomatoes, stems removed ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "1 fresh jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/2 lime, zested and juiced ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 pre-baked thin pizza crust ADVERTISEMENT",
            "8 ounces shredded pepperjack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat over to 450 degrees F (230 degrees C). In a small bowl, combine paprika, garlic powder, salt, black pepper, onion powder, thyme, oregano, and cayenne. Sprinkle liberally over chicken. Store any remaining mixture in airtight container for later use.\nHeat a large skillet over high heat. Pour oil into hot skillet, and cook chicken in oil for 2 to 3 minutes, or until fully cooked.\nCombine tomatoes, onion, jalapeno, garlic, cilantro, lime zest, and lime juice. Season with salt and pepper to taste. Spread over pizza crust, then arrange chicken over tomato mixture. Top with cheese.\nBake in preheated oven for 10 to 15 minutes, or until cheese melts.\n",
        "picture_link": "Wzz0f5kWhur.5SrL2ExWCoOtz8UvBcW"
    },
    {
        "title": "Italian Chicken with Pesto Potatoes",
        "ingredients": [
            "3/4 cup balsamic vinegar ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 1/2 ounces sliced mozzarella cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 slices Parma ham ADVERTISEMENT",
            "1 pint cherry tomatoes ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound small potatoes ADVERTISEMENT",
            "2 tablespoons prepared basil pesto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a saucepan, bring the vinegar to a boil. Reduce heat, and simmer 15 minutes, stirring frequently, until thickened.\nCut a pocket in each chicken breast. Fill each pocket with an equal amount of mozzarella cheese, and season with salt and pepper. Wrap each chicken breast with a slice of ham. Arrange the wrapped chicken breasts in a baking dish. Place the tomatoes around the chicken, sprinkle all with olive oil, and season with salt and pepper.\nBake 25 minutes in the preheated oven, or until chicken is no longer pink and juices run clear.\nIn a saucepan with enough lightly salted water to cover, boil the potatoes 15 minutes, or until tender. Drain, return to the pan, and coat with the pesto.\nPlace chicken breasts, tomatoes, and potatoes on serving plates, and drizzle with the reduced balsamic vinegar to serve.\n",
        "picture_link": "e9R/GROUsvZaaPyTWEP5JHJ9VjoxJo."
    },
    {
        "title": "Easy Authentic Mexican Rice",
        "ingredients": [
            "1/4 cup canola oil ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 (6.5 ounce) can tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat canola oil in a skillet over medium-high heat. Season oil with onion powder and garlic powder. Cook and stir rice in seasoned oil until rice is golden, 2 to 4 minutes.\nPour water and tomato sauce over the rice; stir. Bring the mixture to a boil, cover the skillet, reduce heat to medium-low, and simmer until the rice is tender, about 15 minutes.\n",
        "picture_link": "063Pztmh.OA6vB/6rk7TGzXbDd7r1w."
    },
    {
        "title": "Mizeria (Polish Cucumber Salad)",
        "ingredients": [
            "1 pound small cucumbers, peeled and thinly sliced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 bunch dill, chopped ADVERTISEMENT",
            "2 1/2 tablespoons sour cream ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle salt over cucumbers in a bowl. Let stand until cucumbers are soft, about 5 minutes. Squeeze liquid from cucumbers and discard. Add dill to cucumbers.\nMix sour cream, lemon juice, and sugar in a bowl; add to cucumbers and toss to coat. Season with black pepper. Chill completely before serving, at least 30 minutes.\n",
        "picture_link": "ZZZkTyctVFHffVuHuRRPVYXZXImcF3i"
    },
    {
        "title": "Very Easy Potato Bacon Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "3/4 cup finely chopped onion ADVERTISEMENT",
            "2 cups peeled and diced potatoes ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 teaspoon dried dill weed (optional) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 3/4 cups milk ADVERTISEMENT",
            "3 tablespoons real bacon bits ADVERTISEMENT",
            "1 tablespoon dried parsley, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in saucepan over medium heat; cook and stir onion until lightly browned, about 10 minutes. Add potatoes, water, dill weed, salt, and pepper to onion; bring to a boil. Reduce heat and simmer until potatoes are tender and water is almost all evaporated, at least 30 minutes.\nStir milk and bacon bits into potato mixture; bring to a boil. Remove from heat and stir parsley into soup.\n",
        "picture_link": ".v41P0nYZihQ.mfgPfJapNxqup61GY6"
    },
    {
        "title": "Chef John's Pork al Latte ",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 slices bacon, coarsely chopped ADVERTISEMENT",
            "1 1/2 pounds pork shoulder, cut into 2-inch chunks ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 small yellow onion, diced ADVERTISEMENT",
            "4 cloves garlic, sliced ADVERTISEMENT",
            "1 1/4 cups chicken broth ADVERTISEMENT",
            "1/2 cup creme fraiche ADVERTISEMENT",
            "2 tablespoons chopped fresh sage leaves ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "15 whole fresh sage leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1 tablespoon olive oil into a skillet, place over medium heat, and cook bacon, stirring often, until crisp and bacon fat has rendered into the skillet, about 5 minutes.\nSeason pork cubes generously with salt and black pepper. Remove bacon from pan and set aside, reserving fat in pan. Turn heat to medium-high and brown pork pieces in bacon drippings until well browned on both sides, about 5 minutes per side. Transfer meat to a bowl, leaving pan drippings in skillet.\nTurn heat to medium and stir in chopped onion and a pinch of salt. Cook and stir onion until translucent and slightly browned, about 5 minutes. Stir garlic into onion and cook until fragrant, about 1 minute.\nPour chicken broth and creme fraiche into onion mixture; whisk until smooth. Scrape up and dissolve any browned bits of food on the bottom of the skillet. Bring mixture to a simmer.\nReturn bacon to sauce and stir in 2 tablespoons chopped sage. Place pork pieces into simmering sauce along with any accumulated juices from the meat. Reduce heat to low, cover, and simmer until meat is almost tender, about 1 hour.\nRaise heat to medium and cook uncovered until pan sauce reduces and thickens and meat is very tender, about 20 more minutes. Stir red pepper flakes into sauce; adjust seasonings to taste.\nHeat 1/4 cup olive oil in a small skillet over medium heat; drop whole sage leaves into the hot oil and cook, lightly tossing leaves in the oil, until crisp, 10 to 15 seconds. Drain sage leaves on paper towels and crumble over pork.\n",
        "picture_link": "eARO1XqdRjA0bA1bo4yC08X0B.uBxAK"
    },
    {
        "title": "The Last Caesar Salad Recipe You'll Ever Need",
        "ingredients": [
            "2 anchovy fillets ADVERTISEMENT",
            "2 cloves garlic, chopped, or to taste ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup half-and-half ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine anchovy fillets with garlic in a food processor and pulse several times to form a paste. Process mayonnaise, Parmesan cheese, half-and-half, lemon juice, Dijon mustard, and Worcestershire sauce with anchovy mixture until dressing is creamy. Refrigerate for 1 hour or more before serving.\n",
        "picture_link": "cBmAND1CuxMLwunHj.QfIprty9mWo0y"
    },
    {
        "title": "Cilantro Lime Quinoa",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "1 jalapeno pepper, diced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup quinoa, rinsed and drained ADVERTISEMENT",
            "1 1/2 cups low-sodium chicken broth ADVERTISEMENT",
            "1 cup corn (optional) ADVERTISEMENT",
            "1 mango, peeled and diced ADVERTISEMENT",
            "1 avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1 1/2 tablespoons lime juice ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium heat; cook and stir garlic until fragrant, about 1 minute. Add onion, jalapeno pepper, and salt; cook and stir until onion is tender, 5 to 10 minutes. Add quinoa and cook until slightly browned, 1 to 2 minutes. Pour in chicken broth and bring to a boil. Reduce heat to low and simmer until broth is absorbed, 15 to 20 minutes.\nStir corn, mango, avocado, lime juice, and cilantro into quinoa mixture. Serve immediately or chill and serve cold.\n",
        "picture_link": "U5zJiVitr6FzxqJmtC1GNeTv2K7zt7O"
    },
    {
        "title": "Burgundy Roast Beef",
        "ingredients": [
            "4 pounds rump roast ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1/2 cup Burgundy wine ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (8 ounce) jar sliced mushrooms, drained (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Place a large sheet of heavy-duty aluminum foil in a shallow roasting pan.\nPlace rump roast in the roasting pan. Pour mushroom soup over the roast and sprinkle with onion soup mix.\nWhisk wine and flour together in a small bowl; pour over the roast and top with mushrooms.\nFold the foil over the roast and crimp edges together to seal.\nBake in preheated oven for 4 1/2 hours. Let stand 10 minutes before serving.\n",
        "picture_link": "ncEQSRKavR7.TBQdaooLD8QmJ2HN6ve"
    },
    {
        "title": "Mancakes",
        "ingredients": [
            "8 ounces bacon, chopped ADVERTISEMENT",
            "1/2 cup thinly sliced green onions ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup cornmeal ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "2 ounces sharp Cheddar cheese, grated ADVERTISEMENT",
            "2 large eggs, beaten ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 cup warm maple syrup, or to taste ADVERTISEMENT",
            "1/8 teaspoon chipotle chile powder, or to taste ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, stirring occasionally, until evenly browned, about 10 minutes; remove from heat. Stir green onions into bacon and saute in hot fat until slightly softened, 1 to 2 minutes. Transfer bacon mixture to a strainer to drain, retaining drippings.\nWhisk flour, cornmeal, baking powder, salt, black pepper, and cayenne pepper together in a large bowl. Add drained bacon mixture, milk, Cheddar cheese, eggs, melted butter, and sugar to flour mixture; whisk until batter is smooth. Let batter rest for 10 minutes.\nCombine maple syrup and chipotle chile powder together in a small bowl; whisk until chile powder is completely dissolved.\nHeat 1 teaspoon bacon drippings, 1 teaspoon oil, and 1 teaspoon butter on a griddle over medium-high heat. Drop batter by 1/4-cupful onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter. Transfer pancakes to plate and top with maple syrup.\n",
        "picture_link": "55uFBbr9B1nMNpnQ2zuMknl.4a.jlAK"
    },
    {
        "title": "Hawaiian Ham and Cheese Sliders",
        "ingredients": [
            "cooking spray (such as Crisco®) ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "3 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon poppy seeds ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce, or more to taste ADVERTISEMENT",
            "1 (12 count) package Hawaiian sweet rolls, split, or more as needed ADVERTISEMENT",
            "1 pound sliced deli ham, or more as needed ADVERTISEMENT",
            "8 slices Swiss cheese, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nMelt butter in a saucepan over medium-low heat; cook and stir onion until softened, 5 to 10 minutes. Add mustard, poppy seeds, and Worcestershire sauce; cook and stir for 5 minutes.\nArrange the bottoms from each roll in the prepared baking dish. Spoon 2/3 the onion mixture over the roll bottoms. Add ham and Swiss cheese to each roll. Put tops of rolls over the Swiss cheese layer. Brush the remaining 1/3 onion mixture over tops of rolls. Cover dish with aluminum foil.\nBake in the preheated oven for 15 minutes. Remove aluminum foil and bake until tops of rolls are lightly browned, 5 to 10 minutes.\n",
        "picture_link": "Ij7JQD/cA16lGrvlVXYqwLaDDot5giW"
    },
    {
        "title": "Emily's Manicotti",
        "ingredients": [
            "1/2 pound ground beef ADVERTISEMENT",
            "1/2 pound pork sausage ADVERTISEMENT",
            "1/2 cup chopped sweet onion ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/4 cup Italian seasoned dry bread crumbs ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 (16 ounce) jar pasta sauce ADVERTISEMENT",
            "1 (8 ounce) package manicotti shells ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13 inch baking dish.\nCook the beef and pork in a skillet over medium-high heat until evenly brown. Drain grease, and transfer meat to a large bowl. Place onion and garlic in the skillet, and cook until onion is tender. Transfer to bowl with beef. Mix the bread crumbs, parsley, and oregano into the bowl.\nSpread 1/2 the pasta sauce over the bottom of the baking dish. Stuff manicotti shells with the meat mixture, arrange in the baking dish, and cover with remaining sauce.\nCover pan with foil, and bake manicotti 40 minutes in the preheated oven. Uncover, sprinkle with cheese, and continue baking 20 minutes, until bubbly.\n",
        "picture_link": "KIcm/ju6h1KoTr6GoMFUi.wJPSfYOqW"
    },
    {
        "title": "Tangy Broccoli",
        "ingredients": [
            "1 large head broccoli, cut into florets ADVERTISEMENT",
            "2 tablespoons prepared Dijon-style mustard ADVERTISEMENT",
            "4 ounces process cheese food ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Steam broccoli until tender-crisp.\nToss broccoli with mustard, then melt the cheese over the broccoli in a microwave for 1 minute on HIGH. Stir and serve.\n",
        "picture_link": "QegScILwpFOBZYkobW8z8PiVsG5G6a2"
    },
    {
        "title": "Death By Chocolate IV",
        "ingredients": [
            "1 (18.25 ounce) package devil's food cake mix ADVERTISEMENT",
            "1 cup chocolate syrup ADVERTISEMENT",
            "2 (3.9 ounce) packages instant chocolate pudding mix ADVERTISEMENT",
            "8 (1.4 ounce) bars chocolate covered toffee bars, chopped ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bake cake in 9x13 inch pan according to the manufacturers instructions. While the cake is baking, prepare the instant pudding according to instructions on box, set aside to chill.\nWhen the cake comes out of the oven, pour the chocolate syrup over the top of the entire cake. Using a fork, crumble the cake into small pieces. In a large clear bowl, put a layer of cake on the bottom, then cover with a layer of pudding. Then spread a layer of whipped topping, then sprinkle some of the crushed candy bars. Repeat the layers to the top of the bowl, ending with toffee bar pieces on top. Refrigerate until serving time.\n",
        "picture_link": "OU5XfwyEEtStG1pbY7apNui0z17aV1O"
    },
    {
        "title": "Rachel's Wasabi Cocktail Sauce",
        "ingredients": [
            "1 teaspoon brown sugar ADVERTISEMENT",
            "1/8 teaspoon wasabi paste ADVERTISEMENT",
            "1/8 teaspoon lemon or lime juice ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together the brown sugar, wasabi paste, lemon juice and ketchup. Chill until using, or use immediately.\n",
        "picture_link": "lwqdiux/9GRCXXPLaMOmNAZlT0.BCsK"
    },
    {
        "title": "Salmon and Potato Pie",
        "ingredients": [
            "6 potatoes, peeled ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 (6 ounce) can red salmon, undrained ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 (9 inch) unbaked pie shells ADVERTISEMENT",
            "1 to taste salt and pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain, cool and chop.\nIn a medium saucepan, cook onions, garlic and butter over medium heat until vegetables become transparent in color.\nAdd onion/garlic mixture, salmon and thyme to cooked potatoes. Mash all together with milk, adding just enough to bring about a mashed potato consistency. Spread evenly into pie shell.\nPlace second pie shell over top of salmon mixture. Cut slits into the upper shell, then pinch edges of both pie shells together. Bake on lower rack of oven for 45 minutes.\n",
        "picture_link": "vw9fiumh5NUWAowcx7VydxoBn6OpgBC"
    },
    {
        "title": "Hot Dog Men",
        "ingredients": [
            "8 hot dogs ADVERTISEMENT",
            "8 slices bread ADVERTISEMENT",
            "8 slices American cheese ADVERTISEMENT",
            "ketchup and mustard to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make a slit down the middle of one end of each hot dog; this will be the legs. At the other end, make a small slit each side; these will be the arms. Bring a saucepan of water to a boil, and add the hot dogs. Boil for about 5 minutes until the slits open up.\nPlace slices of cheese onto slices of bread. Set the hot dog men on top. Use ketchup and mustard to make a face, hair and clothes or buttons.\n",
        "picture_link": "WjkQiOSWs1QOPrwZQ189yYEYEDgZ/Iq"
    },
    {
        "title": "Amby Rae's Cucumber Salad",
        "ingredients": [
            "2 large cucumbers, peeled and cubed ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "4 sprigs fresh mint, chopped ADVERTISEMENT",
            "3 cloves garlic, peeled and minced ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumbers in a large salad bowl, and set aside.\nIn a small bowl, whisk together the sour cream, mint, garlic, lemon juice, olive oil, salt, and pepper until well blended. Pour over the cucumbers, and mix until well coated.\n",
        "picture_link": "UdkeudTJSuLk/.whh0DVhKzkc3QWvBm"
    },
    {
        "title": "Spicy Tomato Bisque with Grilled Brie Toast",
        "ingredients": [
            "4 ounces Brie cheese ADVERTISEMENT",
            "4 slices rye bread ADVERTISEMENT",
            "1 (28 ounce) can tomato puree ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "3/4 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "4 ounces cream cheese, cubed ADVERTISEMENT",
            "2 tablespoons chopped fresh basil leaves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven or a toaster oven to 400 degrees F (200 degrees C). Spread the Brie cheese onto two slices of bread, and top with remaining slices. Place on a baking sheet and toast in the oven for about 8 minutes, turning once halfway through. Cut in half, and set aside.\nIn a saucepan over medium heat, stir together the tomato puree, red pepper flakes, black pepper, basil, and sugar. Bring to a simmer, and cook for 10 minutes.\nWhisk in the cream cheese until well blended, then stir in the milk. Heat through without bringing to a boil. Stir in the fresh basil, and remove from the heat.\nTo serve, place each sandwich half into a separate bowl. Ladle soup over each one into the bowl. Serve immediately.\n",
        "picture_link": "VTLJ9HfWuKAA7.fuuU4dJ8T4iuy.yb2"
    },
    {
        "title": "Feta and Bacon Pasta Sauce",
        "ingredients": [
            "8 slices bacon, chopped ADVERTISEMENT",
            "2 leeks, sliced ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "8 ounces feta cheese, crumbled ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet over medium-high heat. Fry for a few minutes, then add the leeks. Cook and stir until bacon is crisp and leeks are tender. Set aside.\nMelt the butter in a saucepan over medium heat. Whisk together the flour and milk, then pour into the saucepan with the butter. Bring to a boil and cook, stirring constantly, until thickened. Remove from the heat and stir in the feta cheese. Mix in bacon and leeks, then season with pepper to taste. Serve over your favorite pasta.\n",
        "picture_link": "cy8pXSOiGQg7DjNpWyLu/wzZkbqGjzm"
    },
    {
        "title": "Peanut Butter Balls VIII",
        "ingredients": [
            "2 cups peanut butter ADVERTISEMENT",
            "2 1/2 cups whole bran cereal ADVERTISEMENT",
            "2 cups powdered milk ADVERTISEMENT",
            "1 1/2 cups raisins ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the peanut butter, bran cereal, powdered milk, raisins and honey using your hands or a wooden spoon. Roll dough into walnut sized balls. Refrigerate until serving.\n",
        "picture_link": "jeMmWFNZPKvDg4JG.gtLltMTvEvR92."
    },
    {
        "title": "Potato Soup IX",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "5 potatoes, peeled and cubed ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large saucepan over medium heat. Saute onion and garlic until tender. Add the potatoes, chicken stock, thyme, and pepper. Bring to a boil, then reduce heat to low. Cover, and simmer for 20 minutes, or until potatoes are tender.\nTransfer about half of the soup to a food processor or blender. Process until smooth, then return to the pot. Stir in milk, and continue cooking until heated through. Season with salt and pepper. Ladle into bowls, and garnish with chopped fresh parsley.\n",
        "picture_link": "Spd/OnR8GNqNGWsVW3avuke91BsYUly"
    },
    {
        "title": "Mouth Watering Ribs",
        "ingredients": [
            "1 1/2 pounds pork spareribs ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace ribs in a large pot over high heat with water to cover. Boil for 45 minutes. Remove ribs, allow to cool slightly, then cut into individual ribs.\nIn a separate medium bowl, combine the onion, ketchup, vinegar, lemon juice, mustard, brown sugar, salt and ground black pepper.\nArrange ribs in a 10x15 inch baking dish. Pour sauce over ribs.\nBake at 350 degrees F (175 degrees C) for 45 minutes to 1 hour.\n",
        "picture_link": "HYBHlqsCqDFFBcvaa6Z22lQ1xP5p1pK"
    },
    {
        "title": "Best Ever Hot Artichoke Dip",
        "ingredients": [
            "2 (6.5 ounce) jars marinated artichoke hearts, chopped ADVERTISEMENT",
            "2 cups mozzarella cheese, shredded ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup sliced almonds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C).\nIn a shallow baking dish combine the artichoke hearts, mozzarella cheese, parmesan cheese and mayonnaise. Bake for 45 minutes, or until hot and bubbly. Sprinkle with almonds if desired. Serve hot with tortilla chips or crackers.\n",
        "picture_link": "mLoX0cUufh62/fXI.zrgRYhszzRTJoG"
    },
    {
        "title": "Molasses Baked Chicken",
        "ingredients": [
            "1 (3 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a large baking dish.\nSeason the chicken with salt, pepper, and cinnamon. Arrange in the prepared baking dish.\nIn a bowl, mix the molasses, vinegar, and mustard.\nBake chicken 20 minutes in the preheated oven. Coat chicken with the molasses mixture. Continue baking 20 minutes, or until chicken juices run clear.\n",
        "picture_link": "XIhdNkcZbYSc9xdn7r3RE2Cccb0kw9W"
    },
    {
        "title": "Rebecca's Rockin' Vodka Lemonade",
        "ingredients": [
            "1 (12 fluid ounce) can frozen raspberry lemonade concentrate ADVERTISEMENT",
            "12 fluid ounces vodka ADVERTISEMENT",
            "1 lime ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a gallon pitcher prepare the lemonade concentrate according to package instructions, replacing one can of water with the vodka. Squeeze juice from one lime into mixture. Pour over ice and serve.\n",
        "picture_link": "FRVzkeO96mxGdLa2sOE0VrZILo9n98q"
    },
    {
        "title": "Enhanced Spaghetti",
        "ingredients": [
            "1 gallon water ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "2 cubes beef bouillon ADVERTISEMENT",
            "1 teaspoon salt (optional) ADVERTISEMENT",
            "1 (16 ounce) package uncooked spaghetti ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the water into a large pot. Season with paprika, garlic powder, beef bouillon and salt. Bring to a rolling boil. Add spaghetti, stir and boil for 4 minutes. Turn off the heat, cover and let stand for 4 more minutes. Drain and, if you wish, rise but don't overdo it. Serve with your favorite sauce.\n",
        "picture_link": "5hKZPjImc.NhJb.udqxnMg2Y/D1lN/G"
    },
    {
        "title": "Summertime Sweet Pickles",
        "ingredients": [
            "1 cup apple cider vinegar ADVERTISEMENT",
            "1/8 cup salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon mustard seed ADVERTISEMENT",
            "2 pounds cucumbers ADVERTISEMENT",
            "2 sweet onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan at medium-high heat, combine cider vinegar, salt, sugar, tumeric and mustard seed. Bring to a boil and let cook for 5 more minutes.\nMeanwhile, slice cucumbers and onion. Loosely pack the vegetables in a 1-quart canning jar or other similarly sized container. Pour hot liquid over the vegetables in the container. Refrigerate for 24 hours and enjoy! Keep refrigerated.\n",
        "picture_link": "iHaRpsVyWJF5P0qj0VQulS3Ft7RAt/2"
    },
    {
        "title": "Baked Eggs",
        "ingredients": [
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1 teaspoon ground dry mustard ADVERTISEMENT",
            "1 to taste salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a 9x13-inch baking dish.\nSprinkle cheese evenly in the bottom of the baking dish. In a large bowl, beat together eggs, milk, mustard powder, salt and pepper. Pour egg mixture on top of cheese.\nBake in preheated oven for 40 minutes or until firm. Let cool slightly before cutting into squares to serve.\n",
        "picture_link": "vaEW.YClzQrpyoTvLYYb7RQCVG0LNkS"
    },
    {
        "title": "Brown Sugar Instant Oatmeal Muffins",
        "ingredients": [
            "Streusel Topping: ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "Muffins: ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 packets instant maple and brown sugar oatmeal ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease 12 muffin cups.\nCombine 3 tablespoons flour, brown sugar, and cinnamon in a small bowl. Use a pastry blender or two knives to cut in the butter until the mixture resembles coarse crumbs. Reserve.\nCombine 1 3/4 cup flour, white sugar, baking powder, salt, and the instant oatmeal in a large bowl. Make a well in the center of the flour mixture; pour in the egg, milk, and oil. Stir just until moistened. Spoon batter into prepared muffin cups, filling each 2/3 full. Evenly sprinkle streusel topping over muffins.\nBake in preheated oven until toothpick inserted in center of muffin comes out clean, about 15 minutes. Cool on wire rack for 5 minutes before serving.\n",
        "picture_link": "I6wIDZy9sx5kiTyEqp4IUUmX8RWxrOK"
    },
    {
        "title": "Fresh Salsa",
        "ingredients": [
            "6 roma tomatoes, diced ADVERTISEMENT",
            "3 fresh jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "1/4 red onion, chopped ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "2 cloves cloves garlic, crushed ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 small jicama, peeled and chopped ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chilies, drained ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the tomato, jalapeno pepper, red onion, green onion, garlic, cilantro, lime juice, lemon juice, cumin, jicama, and the diced tomatoes with chilies in a bowl. Season with salt and pepper. Allow to sit at least 1 hour before serving.\n",
        "picture_link": "0hBF5xihqdYv..Aytm5Y887wGQ4m0qS"
    },
    {
        "title": "Slow Cooker Philly Steak Sandwich Meat",
        "ingredients": [
            "1/2 large onion, sliced ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 pound beef sirloin, cut into 2-inch strips, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "2 tablespoons bourbon whiskey (such as Jim Beam®) ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon hot sauce (such as Frank's Red Hot ®) ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer (such as Budweiser®) ADVERTISEMENT",
            "2 cubes beef bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread onion and garlic into the bottom of a slow cooker; layer beef over onion and garlic. Sprinkle cumin, black pepper, chili powder, onion powder, garlic powder, paprika, thyme, marjoram, and basil over beef; top with bourbon, soy sauce, mustard, Worcestershire sauce, and hot sauce. Pour beer over beef mixture and add beef bouillon cubes.\nCook on Low, stirring every hour or so, for 8 hours (or High for 4 hours).\n",
        "picture_link": "1GX8mcW.wmSAhRuH6Eo4O8go1QcYev."
    },
    {
        "title": "Quinoa Cookies",
        "ingredients": [
            "2/3 cup water ADVERTISEMENT",
            "1/3 cup quinoa ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "2 ripe bananas, mashed ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and quinoa to a boil in a saucepan. Place a cover on the saucepan, reduce heat to medium-low, and cook at a simmer until the moisture is absorbed completely, 15 to 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease 2 baking sheets.\nMix cooked quinoa, coconut, oats, flour, brown sugar, mashed bananas, applesauce, peanut butter, vanilla, salt, baking soda, and baking powder together in a large bowl. Fold chocolate chips into the quinoa mixture; drop by spoonful onto prepared baking sheets.\nBake in preheated oven until browned around the edges, 20 to 25 minutes. Allow cookies to set up a few minutes before transferring to a cooling rack\n",
        "picture_link": "Qw3hkWhvpqwkyM2diSFcjIrXrQf6JQS"
    },
    {
        "title": "Apple and Zucchini Salad",
        "ingredients": [
            "1 pound zucchini, diced ADVERTISEMENT",
            "3 apples, diced ADVERTISEMENT",
            "1/2 green bell pepper, diced ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine zucchini, apples, green bell pepper, and onion in a bowl.\nWhisk vegetable oil, vinegar, sugar, basil, salt, and black pepper together in a separate bowl; drizzle over zucchini-apple mixture. Toss to coat.\n",
        "picture_link": "vHvARCoYnLKlRB/xXP42HMsczqw2y3C"
    },
    {
        "title": "Sweet Smothered Pork Chops",
        "ingredients": [
            "4 pork chops ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon dried rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly coat the inside of a baking dish with butter or butter substitute.\nArrange pork chops in the prepared baking dish; season with salt and pepper. Spread mayonnaise over the tops of each pork chop with a spatula. Sprinkle panko bread crumbs over the mayonnaise. Drizzle honey over the bread crumbs. Season each chop with rosemary.\nBake pork chops in the preheated oven until no longer pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "AsrubeV0doDW8GooewYcLi1lbmIybRi"
    },
    {
        "title": "Blueberry and Banana Cream Cheese Pie",
        "ingredients": [
            "1/2 cup chopped pecans ADVERTISEMENT",
            "3 ripe bananas ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 (21 ounce) can blueberry pie filling ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Press pecans into unbaked pie shells. Bake at 350 degrees F (175 degrees C) until light brown.\nSlice bananas into cooled crusts.\nCream sugar and cream cheese together. Add nondairy whipped topping to cream cheese mixture. Pour mixture over bananas in both pie pans.\nTop pies with blueberries. Chill at least 4 hours before serving, or freeze for later use. Enjoy!\n",
        "picture_link": "FJAGaaP9MHIpeO1wcDGDfrtkug7.0By"
    },
    {
        "title": "Creamy Vidalia Onion Soup",
        "ingredients": [
            "4 Vidalia onions, thinly sliced ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "1 1/2 teaspoons paprika ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/8 tablespoon hot pepper sauce ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, melt butter or margarine over medium heat. Add onions: saute until golden brown, about 10 minutes.\nStir in flour and salt, and mix thoroughly. Gradually add chicken broth, stirring constantly. Cover, and simmer over low heat for about 10 minutes.\nWhen onions are very tender, stir in milk and cream. Heat through. Remove 1/2 cup soup, and mix in egg yolks. Slowly stir egg yolk mixture into soup in pan. Heat through, but do not allow soup to boil. Stir in paprika, black pepper, and red hot pepper sauce. Serve hot, and garnish with chopped parsley.\n",
        "picture_link": "IXts5DAD/oE1VAsPpJ72pBGxtDmzW6G"
    },
    {
        "title": "Cream of Broccoli Soup II",
        "ingredients": [
            "8 cups chicken broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "3/4 cup chopped celery ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 pinch ground white pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/3 cup cornstarch ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3 cups fresh broccoli florets, cooked ADVERTISEMENT",
            "1 1/2 cups shredded American cheese ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large saucepan, combine broth, cream of mushroom soup, onion, celery and salt and pepper. Bring to a boil, reduce heat, cover and simmer for 20 minutes.\nAdd milk and bring to a boil.\nIn a small bowl, mix cornstarch and water until cornstarch is completely dissolved. Gradually add mixture to soup, stirring constantly. Simmer for 5 minutes and then add broccoli and cheeses, mixing until melted.\n",
        "picture_link": "n7VNL/1DpuRhH.qmijL7dmGuYK9VrsC"
    },
    {
        "title": "Fresh Blueberry Pie I",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "4 cups fresh blueberries ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon quick-cooking tapioca ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "1 1/2 tablespoons lemon juice ADVERTISEMENT",
            "1/2 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPrepare pastry for two crust pies. Pick over and wash blueberries.\nCombine sugar, flour, tapioca, spices, and salt; stir into blueberries. Add lemon juice and rind, and let stand for 10 to 15 minutes. Mix well, and turn into pastry lined 9 inch pie plate. Dot with small pieces of butter or margarine. Cover with top crust.\nPlace pie on lowest rack in preheated oven. Bake for 10 minutes, then reduce oven temperature to 350 degrees F (175 degrees C). Bake for 30 minutes longer. Serve warm or cold.\n",
        "picture_link": "/iVMHnk2nob/VVmMS2.aV6nZDf/iv1K"
    },
    {
        "title": "Banana Cookies",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon lemon extract ADVERTISEMENT",
            "3 ripe bananas, mashed ADVERTISEMENT",
            "1/2 cup ground walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease or line baking sheets with parchment paper.\nIn a large bowl cream the shortening and the sugar together. Beat in the eggs, vanilla and lemon extract. Beat in the bananas and the nuts. Gradually add the flour, baking powder and salt.\nDrop the dough by spoonfuls onto the prepared baking sheets. Bake at 350 degrees F (175 degrees C) for 12 to 15 minutes or until lightly colored. Transfer to wire racks to cool.\n",
        "picture_link": "T5hz0FpWs6wR73l1cjFsCAucbrGSGhu"
    },
    {
        "title": "Deep Fried Shrimp",
        "ingredients": [
            "4 pounds large shrimp - peeled and deveined ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "8 eggs, beaten ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium size mixing bowl combine shrimp, salt and pepper; stir.\nHeat oil in a medium size saucepan. In another medium size mixing bowl stir together eggs, flour and baking powder. Dredge shrimp in egg mixture then fry in oil until they are golden.\n",
        "picture_link": "xD0p.sJtVRlmD.r9Y/CFvijywt6Dw.u"
    },
    {
        "title": "College Student's Gourmet Pasta",
        "ingredients": [
            "16 ounces pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in boiling salted water until tender. Drain.\nTo a saucepan, add butter or margarine, salt, milk, and Parmesan cheese. Cook over low heat until combined. Pour mixture over pasta, and serve.\n",
        "picture_link": "TlEni.ira6ijTlN0Xzcjig.EubxJgTS"
    },
    {
        "title": "Hard-Steamed Eggs",
        "ingredients": [
            "12 eggs, at room temperature ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a pot and fill with water to just below the bottom of the steamer. Bring water to just below a boil. Add eggs to steamer insert and steam for 15 minutes.\nImmediately transfer eggs to a bowl of ice water until cool enough to handle. Make a small crack on the large end of each egg and place eggs back into the ice water for about 20 minutes. Peel.\n",
        "picture_link": "9nJaFPAdc7G77RiKtWtUnkxMBvXDhGe"
    },
    {
        "title": "Spicy Fish Tacos with Fresh Lime Sauce",
        "ingredients": [
            "1 pound tilapia fillets ADVERTISEMENT",
            "2 tablespoons taco seasoning mix ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (4.6 ounce) package taco shells ADVERTISEMENT",
            "1 (6 ounce) container plain yogurt ADVERTISEMENT",
            "1 teaspoon lime juice ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon grated lime zest ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 cups coleslaw mix ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 small jalapeno chile, seeded, finely chopped ADVERTISEMENT",
            "1 tomato, seeded and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season tilapia fillets with taco seasoning.\nHeat oil in a 12-inch skillet over medium heat. Cook fish in hot oil until fish flakes easily with a fork, 3 to 4 minutes per side. Remove from heat and cut into bite-size pieces.\nPreheat oven to 325 degrees F (165 degrees C).\nHeat taco shells in preheated oven until crisp, about 5 minutes.\nMix yogurt, lime juice, sugar, lime zest, and salt together in a large bowl. Stir in coleslaw mix, cilantro, and jalapeno; let stand 5 minutes.\nSpoon about 1/4 cup fish and 1/4 cup coleslaw mixture into each taco shell. Top each with 1 tablespoon tomato.\n",
        "picture_link": "G85M0sLI6SsZPNdYryLePEaSzeTwiA."
    },
    {
        "title": "Lemon Meltaways",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together 3/4 cup butter and 1/3 cup confectioners' sugar until smooth. Stir in 1 tablespoon lemon juice and 1 teaspoon lemon zest. Combine the flour and corn starch, and blend into the lemon mixture to form a soft dough. Divide dough in half, roll each half into a log about 8 inches long and 1 inch in diameter. Wrap in plastic wrap and refrigerate for 2 hours, or until firm.\nPreheat oven to 350 degrees F (175 degrees C). Cut each roll into 1/4 inch slices and place onto the cookie sheet.\nBake in the preheated oven for 8 to 12 minutes, or until set. Cool completely before frosting.\nIn a small bowl, blend together 3/4 cup confectioners' sugar, 1/4 cup butter, 1 teaspoon lemon juice, and 1 teaspoon lemon zest with an electric mixer until smooth. Frost cookies and allow to dry before serving or storing.\n",
        "picture_link": "0JLCOfsc9nXOJP4q.st2pNwL0m3rNU2"
    },
    {
        "title": "Neptune's Favorite Crab Bisque",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can cream of asparagus soup ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "1 (6 ounce) can crabmeat ADVERTISEMENT",
            "1 1/4 cups white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend both cans of soup in medium or large pot, stir in milk and cream. Simmer over medium heat, stirring frequently (so milk and cream do not scorch). When boiling point is nearly reached, turn down heat.\nFlake crab meat and add to soup. Simmer an additional 5 minutes, then add white wine. Add small amount of butter to surface (optional) and sprinkle with chervil or parsley.\nVariations: (1) For a low-fat version, omit butter. Instead of milk and cream, substitute non-fat milk. (2) Instead of canned crab, use fresh or imitation crab. If using fresh crab, be sure to remove all cartilage and shell. (3) Substitute crab with lobster, clams, or mussels (shells or no shells). For an exquisite \"seafood bisque,\" combine all of the above. Yum!\n",
        "picture_link": "MARE2loQ89xz0/6djkuTMk01HrgDyfS"
    },
    {
        "title": "Oven Fried Chicken Wings",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup grated Parmesan cheese (such as Kraft®) ADVERTISEMENT",
            "1 cup seasoned bread crumbs ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "5 pounds chicken wings, tips discarded ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil and generously spray with cooking spray.\nMix Parmesan cheese, bread crumbs, garlic powder, onion powder, black pepper, and salt in a bowl.\nDip chicken wings in melted butter; press into bread crumb mixture until well-coated. Arrange wings on prepared baking dish.\nBake in preheated oven until golden brown, about 20 minutes. Flip chicken wings and continue baking until evenly browned and no longer pink in the center, about 10 minutes more.\n",
        "picture_link": "izOSKOLCz4P2xnGvnS77m.TZy5.rqxe"
    },
    {
        "title": "Huli Huli Chicken",
        "ingredients": [
            "2 (3 pound) chickens, each cut into 8 pieces ADVERTISEMENT",
            "1 cup unsweetened pineapple juice ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1/4 cup sherry ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger, crushed ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse chicken pieces and pat dry with paper towels. Combine pineapple juice, soy sauce, brown sugar, ketchup, sherry, ginger, garlic, and green onions in a large resealable plastic bag, stirring the marinade until brown sugar has dissolved. Place chicken pieces into the bag, squeeze out air, seal bag, and lomi (massage) bag to coat chicken with marinade. Refrigerate at least 4 hours to overnight.\nMove an oven rack 6 inches from heat source and preheat oven to 425 degrees F (220 degrees C).\nRemove chicken from marinade and arrange chicken, skin sides up, on a broiler pan.\nBake chicken in preheated oven until browned on both sides and the juices run clear, turning every 10 minutes, 30 to 45 minutes. Baste with remaining marinade after each turning. An instant-read meat thermometer inserted into the thickest piece of chicken, not touching bone, should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "wJySkQ7iLflgVMsDszm8AaW447Xnonu"
    },
    {
        "title": "Easy Sweet Chili",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "6 cloves garlic, finely chopped - or more to taste ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "2 (15 ounce) cans light red kidney beans, drained and rinsed ADVERTISEMENT",
            "2 (15 ounce) cans dark red kidney beans, drained and rinsed ADVERTISEMENT",
            "3 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "2 (15 ounce) cans corn ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble ground beef into a skillet over medium heat. Stir garlic, oregano, chili powder, and basil into the beef; cook and stir until beef is completely browned, 7 to 10 minutes.\nCombine light red kidney beans, dark red kidney beans, diced tomatoes, and corn in crock of a slow cooker. Stir cooked ground beef into the bean mixture.\nCook on Medium-Low for 2 hours. Stir sugar into the chili and continue cooking as long as you can wait, at least 6 hours. Season with salt and black pepper to serve.\n",
        "picture_link": "/PHiPartAYgX80OR2B8xnkFJjVXhB6S"
    },
    {
        "title": "Apple Cinnamon Zucchini Muffins",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2/3 cup oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons ground cinnamon, or more to taste ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "2 cups shredded zucchini ADVERTISEMENT",
            "1 cup shredded apple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray 24 muffin cups with cooking spray or line with paper liners.\nWhisk sugar, oil, eggs, and vanilla extract together in a bowl until smooth. Stir flour, cinnamon, baking soda, and baking powder into sugar mixture just until batter is combined. Fold zucchini and apple into batter and spoon into the prepared muffin cups.\nBake in the preheated oven until until muffins spring back after pressing the top, about 25 minutes.\n",
        "picture_link": "wuMg0MDe9DEmNyILSahdh9PTUmBiDGa"
    },
    {
        "title": "NO YOLKS® Creamy Chicken Noodle Casserole",
        "ingredients": [
            "6 ounces NO YOLKS® Extra Broad Noodles ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "2 ribs celery, chopped ADVERTISEMENT",
            "3 medium carrots, peeled and sliced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "1 (8 ounce) package light cream cheese, softened ADVERTISEMENT",
            "1/2 cup Parmesan cheese, grated ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cooked chicken breasts, chopped ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "Salt and pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine topping ingredients and set aside.\nPreheat oven to 400 degrees F. Add olive oil to a 7-quart stock pot, and saute mushrooms, celery, carrots, onions and garlic powder for 3-4 minutes over medium heat. Add chicken broth and thyme sprig and bring to a boil, stirring occasionally. Add cream cheese, Parmesan and noodles. Stir until well blended. Sprinkle flour over top of mixture. Stir and cook for 1-2 minutes, or until mixture begins to thicken. Fold in chicken.\nPour into a 3-quart casserole dish. Sprinkle on reserved topping mixture. Bake uncovered 15 minutes. Remove from oven and let stand 10 minutes.\n",
        "picture_link": "Og.xoV5gZIf0C92zlamB.ojleuB9Ode"
    },
    {
        "title": "Macadamia Nut Crusted Tilapia",
        "ingredients": [
            "4 (6 ounce) tilapia ADVERTISEMENT",
            "10 ounces macadamia nuts ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 teaspoon hot sauce ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler. Line a baking sheet with aluminum foil.\nCombine macadamia nuts, soy sauce, garlic, hot sauce, brown sugar, olive oil, and black pepper in a food processor; blend until the mixture is the consistency of paste.\nSpoon a thick layer of the macadamia mixture on top of each tilapia fillet. Place the fish macadamia mixture-side up on the prepared baking sheet. Under the broiler, cook fish until the macadamia crust is golden brown and the tilapia flakes easily, about 15 minutes.\n",
        "picture_link": "pIiEQfUNEFrKY57cc7wC3Kunrb6HZHO"
    },
    {
        "title": "Grilled Tuna Steaks with Dill Sauce",
        "ingredients": [
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "2 1 1/4-inch-thick tuna steaks ADVERTISEMENT",
            "1/4 cup spicy brown mustard ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "3 tablespoons dried dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the lemon juice with 1/2 cup olive oil in a sealable plastic bag; seal and shake. Add the tuna steaks and store in refrigerator to marinate while the grill preheats.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nWhisk the brown mustard, mustard powder, sugar, vinegar, and 1/3 cup olive oil together in a bowl; stir in the dill.\nRemove the tuna from the marinade and discard the marinade; cook the steaks on the preheated grill until the fish flakes easily with a fork, about 6 minutes per side. Drizzle the steaks with the mustard and dill sauce to serve.\n",
        "picture_link": "Q4gWIPQfJtHDse/71km013jMyhb9Ne6"
    },
    {
        "title": "Chad's Slow Cooker Taco Soup",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 pound bulk hot pork sausage ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn with red and green bell peppers (such as Mexicorn®), drained and rinsed ADVERTISEMENT",
            "1 (14.5 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (14 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®), undrained ADVERTISEMENT",
            "1/2 cup chili sauce ADVERTISEMENT",
            "2 fresh jalapeno peppers, diced ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle dark beer ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown the ground beef completely in a large skillet over medium heat; drain. Transfer the beef to a slow cooker.\nBrown the sausage completely in a large skillet over medium heat; drain. Transfer the beef to a slow cooker.\nAdd the crushed tomatoes, corn, black beans, kidney beans, ranch dressing mix, taco seasoning mix, onion, green bell pepper, red bell pepper, diced tomatoes with green chile peppers, chili sauce, jalapeno peppers, beer, and black pepper to the slow cooker. Set slow cooker to Low and cook 8 to 10 hours, or, if you prefer, on High for 4 to 6 hours.\n",
        "picture_link": "JKCPKD401XC3Z0gmQ4X7675/vkkPPr2"
    },
    {
        "title": "Idaho-Style Finger Steaks",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "2 tablespoons grill seasoning, such as McCormick Montreal Steak Seasoning ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 pounds boneless beef sirloin steak, cut into 2 1/2 x 1/4 inch strips ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 cups canola oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat together the egg, buttermilk, grill seasoning, and 1/2 cup of flour in a large bowl until smooth. Add the beef, and toss until well coated. Cover with plastic wrap, and place into the refrigerator to marinate at least 2 hours.\nSift 2 1/2 cups flour with the garlic powder, salt, and pepper into a large bowl. Remove steak strips from buttermilk batter and allow excess to drip off. Dredge each piece with seasoned flour and place onto a baking sheet. Place in the freezer and freeze until firm, 1 hour to overnight.\nHeat oil to 370 degrees F (185 degrees C) in a deep fryer or cast iron skillet.\nDrop a few frozen steak pieces into the hot oil and fry until golden brown on the outside, about 5 minutes. Do not overcrowd the frying oil, and do not allow the steak strips to thaw before they are fried. Once golden brown, remove to drain on a paper towel-lined plate.\n",
        "picture_link": "mhcN4UkHMCfsVxrrOG3yzuznRdDF2Ki"
    },
    {
        "title": "Filipino Avocado Milkshake",
        "ingredients": [
            "1 avocado - peeled, pitted, and cubed ADVERTISEMENT",
            "5 cubes ice ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "1 teaspoon fresh lemon or lime juice ADVERTISEMENT",
            "1 scoop vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place avocado, ice, sugar, milk, lemon juice, and ice cream into a blender. Puree until smooth.\n",
        "picture_link": "JLtg5iq7RIauS5t.KnWzzNIL4kS1SOG"
    },
    {
        "title": "Chili Macaroni Casserole ",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (14 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "1 (1.25 ounce) package chili seasoning mix ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cheddar cheese soup ADVERTISEMENT",
            "1 (10.75 ounce) can milk ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup crushed tortilla chips ADVERTISEMENT",
            "1/2 cup sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink.\nIn a large skillet over medium heat, cook and stir the ground beef with onion until the meat is browned, about 10 minutes. Break the meat up into crumbles as it cooks; drain excess grease. Mix in the tomato sauce, diced tomatoes, corn, kidney beans, taco seasoning, and chili seasoning; bring to a boil, reduce heat to a simmer, and cook, stirring occasionally, for about 20 minutes.\nWhisk the Cheddar cheese soup and milk in a saucepan until smooth, and bring to a simmer over medium-low heat. Whisk in 1 cup of shredded Cheddar cheese, 1/2 cup of sour cream, and garlic powder; season to taste with salt and black pepper.\nArrange the cooked macaroni into the bottom of a 10x15-inch baking dish, and mix with the soup mixture. Pour the ground beef chili over the macaroni, and sprinkle with 1 more cup shredded Cheddar cheese and crushed tortilla chips.\nBake in the preheated oven until the casserole is hot and bubbling and the cheese topping has melted, 20 to 30 minutes. Serve topped with dollops of sour cream.\n",
        "picture_link": "CNalmdkVQ165qvLENo1hm2A8gmO0zki"
    },
    {
        "title": "All-in-One Casserole",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, cut into small cubes ADVERTISEMENT",
            "2 (8 ounce) packages sliced fresh mushrooms ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "3 zucchinis, cubed ADVERTISEMENT",
            "2 sweet potatoes, cut into cubes ADVERTISEMENT",
            "2 large red potatoes, cut into cubes ADVERTISEMENT",
            "1/2 cup seasoned bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Lightly grease a baking dish.\nHeat 2 tablespoons of olive oil in a large skillet over medium-high heat. Cook and stir the chicken and mushrooms until the chicken breasts in the hot oil until the chicken is no longer pink in the center and the juices run clear, about 15 minutes. Season with salt, pepper, and garlic powder and remove from heat. Stir in the zucchini, sweet potatoes, red potatoes, bread crumbs, Parmesan cheese, and 1/4 cup of olive oil; transfer to the prepared baking dish.\nBake in the preheated oven, stirring every 15 minutes, until potatoes are tender and easily pierced with a fork about 1 hour.\n",
        "picture_link": "PtkTOzx0VO8KGCRVkTa/Lm1NHZdW0.G"
    },
    {
        "title": "Slow Cooker Cider Pork Roast",
        "ingredients": [
            "1 large onion, roughly chopped ADVERTISEMENT",
            "1 apple, peeled and roughly chopped ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "2 cups apple cider ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 (3 pound) pork loin roast ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 stalk celery, roughly chopped ADVERTISEMENT",
            "4 large carrots, roughly chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1/4 of the onion, 1/2 of the apple, and the garlic in the bowl of a food processor. Process until smooth. Transfer to slow cooker along with the apple cider and water.\nSeason the roast with salt and pepper. Combine the ginger and flour in a shallow container. Gently press the roast onto the flour mixture to coat all sides. Brush off any excess flour. Heat the oil in a large, heavy skillet. Brown the pork in the hot oil, turning until golden on all sides. Place the browned roast in the slow cooker and scatter the celery and the remaining onion and apple on top. Cook on low for 4 hours, then add carrots. Cook for an additional 3 hours.\nRemove the cooked roast and carrots to a heated platter. If desired, thicken the cooking juices from the slow cooker to make a gravy.\n",
        "picture_link": "t1R4LsViqSyUXzOWmDxQjXfditcRNPy"
    },
    {
        "title": "Portobello Bellybuttons",
        "ingredients": [
            "1 (16 ounce) package cheese tortellini ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 portobello mushrooms, chopped ADVERTISEMENT",
            "1/2 pound button mushrooms, sliced ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1/2 tablespoon dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook until al dente; drain.\nWhile water is boiling, melt the butter in a skillet and cook the garlic until fragrant. Stir in portobello mushrooms, button mushrooms, white wine, and basil. Season with salt and pepper to taste. Continue to cook until mushrooms are tender. Pour mushroom mixture into drained pasta and stir. Top with grated Parmesan cheese and serve.\n",
        "picture_link": "PILM05u7QWBSObTuYQNEDCLz.ItFPiW"
    }
]