[
    {
        "title": "Holiday Cappuccino",
        "ingredients": [
            "12 fluid ounces hot brewed espresso ADVERTISEMENT",
            "12 fluid ounces half-and-half ADVERTISEMENT",
            "2 fluid ounces brandy ADVERTISEMENT",
            "2 fluid ounces amaretto liqueur ADVERTISEMENT",
            "1 fluid ounce vanilla extract ADVERTISEMENT",
            "4 teaspoons instant hot chocolate mix ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "4 teaspoons whipped cream, or to taste ADVERTISEMENT",
            "1 teaspoon chocolate shavings, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir hot espresso, half-and-half, brandy, amaretto, vanilla extract, hot chocolate mix, and sugar together in a saucepan over medium-low heat until the sugar dissolves; cook at a simmer until hot, 2 to 3 minutes. Pour into 4 mugs and top each with whipped cream and chocolate shavings.\n",
        "picture_link": "WRrFsfw5490AMkUiUXRJqC8Z.jkKHAK"
    },
    {
        "title": "Olive Croutons",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon tapenade (olive spread) ADVERTISEMENT",
            "4 slices ciabatta bread, cut into cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nStir olive oil and tapenade together in a large bowl; add bread cubes and stir to coat. Spread cubes onto a baking sheet.\nBake in preheated oven until golden brown, 8 to 10 minutes. Cool completely before storing in an airtight container.\n",
        "picture_link": "tQ2FDzgUla/IChU/GBMZCSknlXzSnzm"
    },
    {
        "title": "Spicy Croutons",
        "ingredients": [
            "10 slices bread ADVERTISEMENT",
            "5 tablespoons ground dried chili pepper ADVERTISEMENT",
            "5 tablespoons garlic and herb seasoning ADVERTISEMENT",
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lay bread slices onto a flat surface. Cut circles out of the middle of each slice using a drinking glass; discard bread remainders.\nSprinkle about 3/4 teaspoon chili pepper and 3/4 teaspoon garlic and herb seasoning over each side of each bread circle.\nLightly grease a skillet with oil and place over medium heat. Cook bread circles in skillet until browned, 2 to 3 minutes per side.\n",
        "picture_link": "cB8Zjhr/yK.7tgxu8LgGvoekpzmyaB2"
    },
    {
        "title": "Misoyaki",
        "ingredients": [
            "Miso Marinade: ADVERTISEMENT",
            "1 1/4 cups white miso ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup sake ADVERTISEMENT",
            "1/2 cup mirin (Japanese sweet wine) ADVERTISEMENT",
            "4 (6 ounce) fillets butterfish (black cod) ADVERTISEMENT",
            "Beurre Blanc: ADVERTISEMENT",
            "2 1/2 teaspoons chopped shallot ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "4 whole black peppercorns ADVERTISEMENT",
            "7 teaspoons white wine vinegar ADVERTISEMENT",
            "3 1/2 teaspoons dry white wine ADVERTISEMENT",
            "7 teaspoons heavy whipping cream ADVERTISEMENT",
            "1 cup butter, cut into 1/2-inch pieces ADVERTISEMENT",
            "Lemon Sauce: ADVERTISEMENT",
            "lemon, juiced ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley, or to taste ADVERTISEMENT",
            "Sweet Soy Sauce: ADVERTISEMENT",
            "1 cup soy sauce ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk miso, 1 cup sugar, sake, and mirin together in a saucepan; bring to a boil. Reduce heat to low and simmer, stirring occasionally, until marinade has reduced, about 45 minutes. Transfer marinade to a shallow dish and cool completely, 30 minutes to 1 hour. Place butterfish in the marinade and refrigerate, 8 hours to overnight.\nCombine shallot, bay leaf, peppercorns, vinegar, and wine in a saucepan; bring to a boil. Reduce heat to medium and simmer until only about 1 tablespoon liquid remain, 2 to 3 minutes. Pour cream into mixture and simmer until cream mixture has reduced by half, 2 to 3 minutes. Increase heat to medium-high and rapidly whisk butter pieces, 1 at a time, until beurre blanc is smooth and thickened. Strain beurre blanc through a mesh strainer to remove spices.\nStir lemon juice into beurre blanc until lemon sauce is evenly mixed; fold in parsley.\nCombine soy sauce and 1 cup sugar in a saucepan over low heat; cook and stir until sugar is dissolved and sweet soy sauce has reduced to 1 cup, 15 to 20 minutes.\nHeat a skillet over medium heat for 2 to 3 minutes. Remove butterfish from marinade, discarding unused marinade. Cook butterfish in the hot skillet until fish flakes easily with a fork, 3 to 4 minutes per side. Transfer butterfish to a warmed plate and drizzle lemon sauce and sweet soy sauce around fish.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Joanne's Pumpkin Patch Paradise",
        "ingredients": [
            "4 cups crispy corn cereal squares (such as Corn Chex®) ADVERTISEMENT",
            "4 cups crispy rice cereal squares (such as Rice Chex®) ADVERTISEMENT",
            "1 cup pretzels ADVERTISEMENT",
            "1 cup peanuts ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 1/4 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup candy corn, or to taste (optional) ADVERTISEMENT",
            "1/2 cup candy-coated milk chocolate pieces (such as M&M;'s®), or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Grease a 10x15-inch baking sheet.\nCombine corn cereal, rice cereal, pretzels, and peanuts in a large bowl.\nHeat peanut butter, butter, Worcestershire sauce, salt, and garlic powder in a saucepan over high heat until peanut butter is melted, about 5 minutes. Pour mixture over cereal mixture and toss to evenly coat. Spread cereal mixture over prepared baking sheet.\nBake in the preheated oven, stirring every 15 minutes, until cereal mixture is dry, about 1 hour. Allow to cool. Stir candy corn and chocolate pieces into cereal mixture before serving.\n",
        "picture_link": "wxCV4/1cowuOqfXHopP6nhSgJZMH0ii"
    },
    {
        "title": "Berry Nut and Seed Crunch",
        "ingredients": [
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 1/2 cups walnuts ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "1 cup hulled pumpkin seeds ADVERTISEMENT",
            "1 cup sunflower seeds ADVERTISEMENT",
            "3/4 cup raspberry-flavored dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with parchment paper.\nHeat brown sugar in a saucepan over medium-low heat until melted; stir in walnuts and sesame seeds until walnuts are coated with sugar and sesame seeds. Transfer coated walnuts to the prepared baking sheet; set aside until cooled.\nMix coated walnuts, pumpkin seeds, sunflower seeds, and cranberries together in a bowl.\n",
        "picture_link": "NLvOxOahKfpkb9e.9tJtdP3GiHdprRW"
    },
    {
        "title": "Whoa, Momma, Fried Green Tomatoes",
        "ingredients": [
            "1/2 cup hot sauce ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 dash grill seasoning ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup panko bread crumbs, or as needed ADVERTISEMENT",
            "2 green tomatoes, sliced ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put hot sauce in small dish for dipping. Mix flour, brown sugar, grill seasoning, salt, and pepper in a separate small dish. Beat eggs into milk in a third dish. Pour panko in a fourth shallow dish. Arrange dishes in a line, respectively.\nDip one side of each tomato slice in hot sauce. Press each side of tomato into flour mixture to coat; dip into milk mixture. Gently press tomato slices into panko to coat. Arrange coated tomatoes on a baking sheet. Refrigerate until chilled, about 30 minutes.\nHeat oil in a deep-fryer or a cast-iron skillet to 375 degrees F (190 degrees C).\nFry tomato slices in hot oil until golden brown, 2 to 3 minutes per side.\n",
        "picture_link": "gFqoFsFu22nsjJKVKMEv4fPl9YtaFX6"
    },
    {
        "title": "Sarah's Fried Green Tomatoes",
        "ingredients": [
            "2 large green tomatoes, sliced 1/4-inch thick ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup cornmeal ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 cup olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put tomato slices in a colander to drain excess liquid. Discard end slices of tomatoes.\nWhisk milk and egg together in a bowl. Stir flour, cornmeal, panko, salt, onion powder, garlic powder, black pepper, and cayenne pepper together in a separate bowl.\nGently press a tomato slice into the flour mixture to coat and shake to remove excess flour. Dip into the beaten egg, then press again into the flour mixture. Keep breaded tomatoes on a plate while breading the rest; do not stack.\nPour enough olive oil into a large skillet to reach about 1/2 inch deep. Place skillet over medium heat and heat oil until hot but not smoking. Cook 4 to 5 tomato slices at a time in the hot oil until browned on the bottom, 2 to 3 minutes; turn tomatoes and continue cooking until browned on the other side, 2 to 3 minutes more. Reheat oil between batches, adding more oil as needed to maintain 1/2-inch depth.\n",
        "picture_link": "su1EA6e3EksoXeakLxzFsd/5/lqHBVe"
    },
    {
        "title": "Creamy Apple Slaw",
        "ingredients": [
            "3/4 cup sour cream ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "2 tablespoons dry ranch dressing mix ADVERTISEMENT",
            "1 (8 ounce) package shredded cabbage and carrot mix ADVERTISEMENT",
            "3 apples - peeled, cored, and diced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "3 green onions, thinly sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk sour cream, sugar, vinegar, and ranch dressing mix together in a large bowl; fold in cabbage mix, apples, celery, and green onion. Toss mixture to coat; season with salt and pepper. Cover bowl tightly with plastic wrap and chill until flavors blend, 20 minutes to 4 hours.\n",
        "picture_link": "rBsNsNFen0gQ7RJn2m2LQ86lCoTfX4C"
    },
    {
        "title": "Au Gratin Potatoes on the Grill",
        "ingredients": [
            "canola oil cooking spray ADVERTISEMENT",
            "8 small red potatoes, cubed ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 pinch seasoned salt, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat. Spray a 24-inch piece of aluminum foil with cooking spray.\nPlace potatoes on the prepared piece of aluminum foil; spray with cooking spray.\nMix bread crumbs, Parmesan cheese, seasoned salt, and pepper together in a bowl; sprinkle over potatoes. Fold aluminum foil over potato mixture and seal edges together.\nCook on the grill until potatoes are tender, 20 to 30 minutes.\n",
        "picture_link": "35/ZNceCm34LFtrPK6.PulZFDeWmMrm"
    },
    {
        "title": "Coconut Flan from GOYA®",
        "ingredients": [
            "1 cup sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 cup GOYA® Cream of Coconut ADVERTISEMENT",
            "1 cup GOYA® Sweetened Condensed Milk ADVERTISEMENT",
            "1 (13.5 ounce) can GOYA® Coconut Milk ADVERTISEMENT",
            "1/4 teaspoon GOYA® Vanilla Extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 325 degrees F. In a small, heavy saucepan over medium-high heat, bring sugar and 1/2 cup water to a boil, stirring until the sugar dissolves. Using a wet pastry brush, wipe off any sugar that sticks to the sides of the pan. Cook, without stirring, swirling the pan, until the syrup turns golden brown, about 10 minutes. Carefully pour the hot caramel into eight 4 oz. ramekins; set aside to cool.\nIn a large bowl, using a whisk, beat the eggs until completely combined. Whisk in the cream of coconut, condensed milk, coconut milk and vanilla until smooth. Divide the egg mixture evenly among ramekins.\nPlace ramekins in a shallow baking dish and place in the middle rack of the oven. Pour in enough hot water to come halfway up the sides of the ramekins; cover with aluminum foil. Bake until the Flan is set but still wiggly in the center, 1 hour - 1 hour 15 minutes. Using tongs, carefully remove the ramekins from the water. Transfer to refrigerator to cool completely.\nWhen ready to serve, gently run butter knife around edges and invert onto serving plates. Garnish with raspberries and mint leaves, if desired.\n",
        "picture_link": "FPWJaVtcA7eiNTxUFrGTVhSG77ZkJum"
    },
    {
        "title": "Buffalo-Style Chicken Wings",
        "ingredients": [
            "1 gallon oil for frying, or as needed ADVERTISEMENT",
            "3 pounds chicken wings and drummettes ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1 (1 ounce) package dry ranch salad dressing mix (such as Hidden Valley Ranch®) ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nFry chicken wings in small batches in hot oil until no longer pink at the bone and the juices run clear, about 15 minutes per batch. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Assure oil reaches 375 degrees F (190 degrees C) between batches.\nMelt butter in a saucepan over low heat. Stir hot sauce, ranch dressing mix, and vinegar into the melted butter.\nPut cooked chicken wings in a large mixing bowl. Ladle sauce over wings and toss to coat.\n",
        "picture_link": "XFBnigZnUFkaGjRTAaXZLG0cj6.7SRG"
    },
    {
        "title": "Horseradish Cheese Spread",
        "ingredients": [
            "1 (16 ounce) jar pasteurized process cheese spread (such as Cheez Whiz®) ADVERTISEMENT",
            "1/2 cup horseradish sauce ADVERTISEMENT",
            "1 (4 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "1/2 teaspoon onion salt ADVERTISEMENT",
            "5 drops hot sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cheese spread, horseradish sauce, cream cheese, butter, prepared horseradish, onion salt, and hot sauce in a microwave-safe bowl. Heat in microwave until melted, stirring every 30 seconds, 3 to 5 minutes.\nRefrigerate until cold, at least 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Big Bunch Punch (Non-Alcoholic)",
        "ingredients": [
            "2 (750 milliliter) bottles club soda ADVERTISEMENT",
            "2 (750 milliliter) bottles ginger ale ADVERTISEMENT",
            "2 (48 ounce) bottles cranberry juice cocktail ADVERTISEMENT",
            "1 (6 ounce) can frozen orange juice concentrate, thawed ADVERTISEMENT",
            "1 (6 ounce) can frozen grapefruit juice concentrate, thawed ADVERTISEMENT",
            "1 (6 ounce) can frozen lemonade concentrate, thawed ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine club soda, ginger ale, cranberry juice, orange juice, grapefruit juice, and lemonade in a large punch bowl. Add ice and stir.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mississippi Vegi Balls",
        "ingredients": [
            "2 cups Italian-seasoned bread crumbs ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/2 cup cottage cheese ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried sage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix bread crumbs, Cheddar cheese, pecans, cottage cheese, onion, eggs, basil, and sage in a bowl; form mixture into 1-inch balls. Place balls on a baking sheet.\nBake in the preheated oven until bottoms turn brown, 20 to 25 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Greek Stuffed Tomatoes and Peppers (Yemista)",
        "ingredients": [
            "8 large ripe tomatoes ADVERTISEMENT",
            "4 large green bell peppers ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 clove garlic, minced, or to taste ADVERTISEMENT",
            "2 pounds ground beef chuck ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon seasoned salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 1/2 cups converted (parboiled) rice (such as Uncle Ben's®) ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut off tops of tomatoes, leaving 1 corner still attached to create a lid. Scoop insides of tomatoes and transfer 'meat' to a large bowl; squeeze juices out of tomatoes. Cut off tops of green peppers and reserve for later use; scoop out seeds and membranes. Arrange tomatoes and bell peppers in a 11x17-inch baking dish.\nPreheat oven to 375 degrees F (190 degrees C).\nHeat butter in a large skillet over medium heat; cook and stir onion and garlic in the melted butter until softened, 5 to 10 minutes. Add ground chuck, soy sauce, seasoned salt, and black pepper to onion mixture; cook until ground chuck is browned and crumbly, 5 to 10 minutes.\nMix squeezed tomato meat and water into browned chuck; bring to a simmer, about 15 minutes. Add rice and bring to a boil; remove skillet from heat. Spoon beef-rice mixture into tomatoes; place tops onto filled tomatoes and arrange them into the baking dish with lid sides down.\nStuff bell peppers with beef-rice mixture and top with reserved lids; lay bell peppers sideways in the baking dish. Pour olive oil over stuffed tomatoes and bell peppers; season with salt and pepper.\nBake in the preheated oven for 30 minutes. Turn bell peppers and continue baking until bell peppers and tomatoes are softened, about 30 more minutes.\n",
        "picture_link": ".RmkcRaFxF8yL0BEvbDx0/EMrMCEK6q"
    },
    {
        "title": "Banana Punch",
        "ingredients": [
            "6 cups water ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "5 bananas ADVERTISEMENT",
            "1 (46 fluid ounce) can pineapple juice ADVERTISEMENT",
            "4 (6 ounce) cans frozen orange juice concentrate ADVERTISEMENT",
            "2 (6 ounce) cans frozen lemonade concentrate ADVERTISEMENT",
            "2 1/2 (2 liter) bottles lemon-lime flavored carbonated beverage (such as 7-Up®) ADVERTISEMENT",
            "2 oranges, sliced for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and sugar in a large pot; bring to a boil. Cook and stir until the sugar dissolves, about 3 minutes. Cool in the refrigerator.\nPut 1 banana and about 1 cup pineapple juice in a blender; blend until smooth. Repeat until all bananas are pureed into pineapple juice; stir into the pot with the simple syrup. Add orange juice concentrate and lemonade concentrate to the pot; stir. Divide the mixture into smaller containers and freeze until mostly solid.\nPut frozen mixture into a large punch bowl. Thaw until slushy, but stirrable. Stir lemon-lime carbonated beverage into the punch bowl. Garnish with orange slices.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Little Traveler's Salad",
        "ingredients": [
            "1 head romaine lettuce, chopped ADVERTISEMENT",
            "1 (10 ounce) package baby spinach leaves ADVERTISEMENT",
            "1 small red onion, thinly sliced ADVERTISEMENT",
            "2 cups cooked macaroni ADVERTISEMENT",
            "12 ounces cooked chicken breast, cut into bite-sized pieces ADVERTISEMENT",
            "1 (12 ounce) jar roasted red peppers, thinly sliced ADVERTISEMENT",
            "8 slices cooked bacon, crumbled ADVERTISEMENT",
            "1/4 cup poppy seed dressing, or to taste ADVERTISEMENT",
            "1/4 cup French-fried onions, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix romaine lettuce, spinach, and red onion together in a bowl; portion lettuce mixture onto serving plates. Top each serving with macaroni, chicken, roasted red peppers, and bacon. Serve with poppy seed dressing and French-fried onions on the side.\n",
        "picture_link": "U7y8XOQXjoTlxatz6M95SHVs4gIfaEy"
    },
    {
        "title": "Amazing Grasshopper Pie",
        "ingredients": [
            "1 (20 ounce) package chocolate sandwich cookies (such as Oreo®), crushed ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/2 gallon mint chocolate chip ice cream, cut into rectangular blocks ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "2 cups hot fudge topping (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix crushed cookies and melted butter in a 9x13-inch baking dish; spread into an even layer. Arrange ice cream blocks atop the cookie layer. Spread whipped topping over the ice cream layer. Drizzle hot fudge topping over the whipped topping.\nStore in freezer until solid, at least 1 hour.\n",
        "picture_link": "ogAL7T05APqf6OnzKMI2NPlFvvbIW1C"
    },
    {
        "title": "Cheeseburger Dip",
        "ingredients": [
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 small sweet onion (such as Vidalia®), minced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "3/4 cup chili sauce ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup pasteurized process cheese spread (such as Cheez Whiz®) ADVERTISEMENT",
            "1 small head iceberg lettuce, finely shredded ADVERTISEMENT",
            "2 tomatoes, chopped (optional) ADVERTISEMENT",
            "2 Kosher dill pickles, chopped (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat. Cook and stir sweet onion and garlic in the hot oil until the onion is tender, about 5 minutes. Break ground beef into the skillet; cook and stir until browned and crumbly, 5 to 7 minutes more.\nReduce heat to medium-low. Stir chili sauce, Worcestershire sauce, garlic powder, chili powder, salt, and pepper into the beef mixture. Pour cheese spread into the skillet; cook and stir until the cheese spread is melted evenly through the beef mixture, 3 to 5 minutes. Transfer beef mixture to a serving dish.\nLayer lettuce, tomatoes, and pickles atop the beef mixture to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fig and Hazelnut Bread Pudding",
        "ingredients": [
            "2 tablespoons butter, divided ADVERTISEMENT",
            "8 slices challah bread, toasted ADVERTISEMENT",
            "1 cup thinly sliced dried Turkish figs ADVERTISEMENT",
            "1/2 cup thinly sliced dried apricots ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1/4 cup coarsely chopped hazelnuts ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 dried figs, sliced, or as needed ADVERTISEMENT",
            "2 dried apricots, sliced, or as needed ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch glass casserole dish with 1 tablespoon butter.\nSoak bread slices in a bowl of water until soggy, about 5 minutes. Remove slices from bowl and squeeze out excess water.\nPlace bread in a separate bowl and mash using your hands; stir in 1 cup figs, 1 cup apricots, raisins, hazelnuts, brown sugar, lemon zest, lemon juice, cinnamon, ginger, and salt until brown sugar is dissolved. Stir egg into bread mixture until evenly mixed. Spoon bread mixture into the prepared casserole dish, smoothing the top with the back of the spoon. Decorate the mixture with 2 sliced figs and 2 sliced apricots; dot with remaining 1 tablespoon butter.\nBake in the preheated oven until edges and top of bread pudding are lightly browned and a knife inserted in the center comes out clean, 25 to 30 minutes.\nBeat cream and honey together in a bowl using an electric mixer until stiff peaks form. Serve bread pudding warm or cold with a few spoonfuls of honey whipped cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Traditional Appalachian Spoon Bread",
        "ingredients": [
            "2 3/4 cups milk ADVERTISEMENT",
            "1 cup white cornmeal ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 large eggs, separated ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an oven-proof cast iron Dutch oven or a deep baking dish.\nHeat milk and cornmeal in the top of a double boiler over simmering water, stirring frequently, until thick and creamy, about 5 minutes. Remove cornmeal mixture from heat and stir in butter and 1 teaspoon salt until well combined.\nBeat egg yolks, sugar, and 1/2 teaspoon cream of tartar together in a bowl until smooth; stir into cornmeal mixture.\nBeat egg whites, 1/8 teaspoon cream of tartar, and 1 pinch salt together in a separate bowl using an electric mixer until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak. Gently fold egg white mixture into cornmeal mixture until well mixed and fluffy; pour into prepared Dutch oven.\nBake in the preheated oven until golden brown with a moist center, about 30 minutes. Allow to rest for 10 to 15 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Walnut Blue Cheese Artichoke Salad",
        "ingredients": [
            "1 head lettuce, shredded ADVERTISEMENT",
            "8 ounces crumbled Gorgonzola cheese ADVERTISEMENT",
            "1 (8 ounce) jar marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "1 cup walnut pieces ADVERTISEMENT",
            "1/4 cup pitted and chopped kalamata olives, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss lettuce, Gorgonzola cheese, artichoke hearts, walnuts, and olives together in a bowl.\n",
        "picture_link": "sdar1wQ0CTBpb.g/hotcgoZud7oi/ky"
    },
    {
        "title": "Paul's Fat Tire® Lamb Chili",
        "ingredients": [
            "1 pound ground lamb ADVERTISEMENT",
            "1 (16 ounce) can tomato sauce ADVERTISEMENT",
            "1 (16 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle amber ale (such as Fat Tire®) ADVERTISEMENT",
            "1 (4 ounce) carton Texas-style chili seasoning kit (such as Carroll Shelby's®) ADVERTISEMENT",
            "1 red onion, finely chopped ADVERTISEMENT",
            "3 jalapeno peppers, ribs removed, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 habanero pepper, ribs removed and chopped (wear gloves) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir lamb until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nCombine tomato sauce, black beans, and amber ale in a large pot. Stir contents of the chili seasoning kit, reserving the masa flour, into the tomato mixture; add onion, jalapeno peppers, garlic, and habanero pepper. Stir in lamb.\nHeat pot on low until lamb mixture begins to lightly simmer, stirring frequently, about 15 minutes. Cover and reduce heat to warm (lowest setting) and cook until chili flavors blend, stirring occasionally, 2 to 4 hours. If the chili is too thin, slowly stir in reserved masa flour. If the chili is too thick, add water.\n",
        "picture_link": "in/wYwY6vAh0Vg5PvbUl4iiI2m07wt."
    },
    {
        "title": "Slow Cooker Garlic and Herb Pork Tenderloin",
        "ingredients": [
            "1 garlic and herb pork tenderloin ADVERTISEMENT",
            "6 large red potatoes ADVERTISEMENT",
            "16 green beans, trimmed, or more to taste (optional) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat, and lightly oil the grate.\nGrill pork tenderloin until seared on each side, 2 to 3 minutes per side. Transfer tenderloin to a slow cooker; add potatoes, green beans, and water.\nCook tenderloin in slow cooker set to Low until pork is slightly pink in the center, about 4 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Season with salt and ground black pepper to taste.\n",
        "picture_link": "xRBbvdGo/vmaavkNMtiKcWR5fmQLUAO"
    },
    {
        "title": "Spicy Tequila Sunrise Chicken Wings",
        "ingredients": [
            "1 (10 ounce) jar prepared jalapeno pepper jelly ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 cup tequila ADVERTISEMENT",
            "2 pounds chicken wings ADVERTISEMENT",
            "1/2 gallon vegetable oil for frying ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup Thai-style chili sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk jalapeno pepper jelly, orange juice, and tequila together in a bowl until smooth; pour into a large resealable plastic bag. Add chicken wings, coat with the marinade, squeeze to remove excess air, and seal the bag. Marinate in the refrigerator 4 hours to overnight.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nRemove chicken wings from the marinade and shake to remove excess moisture. Blot wings dry with paper towel. Discard the remaining marinade.\nFry chicken wings in batches in hot oil until golden brown on the outside and no longer pink on the inside, 10 to 15 minutes per batch. Drain on a wire baking rack.\nMelt butter in a saucepan over medium heat. Stir chili sauce into the melted butter until the color is consistent; pour into a large stainless steel bowl. Add chicken wings and toss to coat in the sauce.\n",
        "picture_link": "7f5g0eSfFzlWfJWxVCkMqQzhdgfuhvO"
    },
    {
        "title": "Halloween JIGGLERS Hands",
        "ingredients": [
            "2 1/2 cups boiling water (do not add cold water) ADVERTISEMENT",
            "3 (3 ounce) packages JELL-O Brand Grape Flavor Gelatin ADVERTISEMENT",
            "1 (3 ounce) package JELL-O Brand Orange Flavor Gelatin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add boiling water to combined gelatin in large bowl, stir 3 min. until completely dissolved. Pour into 13x9-inch pan. Refrigerate 3 hours or until firm.\nTrace outline of hand on piece of paper. Cut out pattern; place on top of gelatin. Cut around pattern with sharp knife, making sure to cut all the way through gelatin to bottom of pan. Repeat with remaining gelatin.\nDip bottom of pan in warm water 15 sec. Carefully remove hand cutouts from pan. Use as a garnish for your favorite Halloween punch or place on individual serving plates. Cut out any remaining gelatin with Halloween cookie cutters. Serve with the JIGGLERS Hands.\n",
        "picture_link": "/0dVeFgktr6SnMjmYjq3I9llkTPL46."
    },
    {
        "title": "David's Favorite Football Dip",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (28 ounce) can vegetarian baked beans ADVERTISEMENT",
            "1 (16 ounce) can vegetarian refried beans ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1/2 cup taco seasoning mix ADVERTISEMENT",
            "2 tablespoons ranch dressing ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "2 teaspoons liquid smoke flavoring ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir ground turkey in the hot skillet until browned and crumbly, 5 to 7 minutes; add onion and bell pepper. Cover skillet and simmer until onion is softened, about 5 more minutes. Transfer turkey mixture to a bowl.\nStir baked beans, refried beans, and coconut oil together in the same skillet used for turkey mixture; cook and stir over medium heat until beans are heated through, 5 to 7 minutes. Mix salsa, taco seasoning, ranch dressing, soy sauce, and liquid smoke into bean mixture and sprinkle with Cheddar cheese and mozzarella cheese. Cover skillet and cook until cheeses melts, 3 to 5 minutes.\nMix bean mixture into ground turkey mixture and stir well; season with salt and pepper.\n",
        "picture_link": "maT1KiH75WQG18Xmh/X7YST1XULvHF2"
    },
    {
        "title": "Alyssa's Mango Peach Salsa",
        "ingredients": [
            "1 cup diced mango ADVERTISEMENT",
            "1 cup diced peaches ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mango, peaches, vegetable oil, and salt together in a bowl.\n",
        "picture_link": "6xLLmwb6oCafot1vbKm5fY05XsKk3B6"
    },
    {
        "title": "Rich Vegetable Chowder",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup cubed potato ADVERTISEMENT",
            "1/2 cup chopped carrot ADVERTISEMENT",
            "1/4 cup sliced green onions ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "3/4 cup frozen corn, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat; stir flour, basil, pepper, and salt into butter and pour in chicken broth. Cook and stir broth mixture until thickened and boiling, 5 to 7 minutes. Stir potato, carrot, and green onions into broth mixture; bring to a boil. Reduce heat and simmer until potatoes are mostly tender, 10 to 15 minutes.\nStir half-and-half and corn into broth mixture; cook and stir until chowder is heated through, about 5 more minutes.\n",
        "picture_link": "ofNUFXC/AG6lg5qXInRrCa2jghfR8Ou"
    },
    {
        "title": "White Bread Corn Pudding",
        "ingredients": [
            "5 slices day-old bread, crusts discarded and bread cubed ADVERTISEMENT",
            "1 (15 ounce) can cream-style corn ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup white sugar, or to taste ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish.\nPlace bread cubes in the prepared baking dish.\nBeat cream-style corn, milk, eggs, and sugar together in a bowl using an electric mixer until evenly combined; pour over bread cubes. Pour melted butter over bread cube mixture. Place dish on a baking sheet and pour enough water into the baking sheet to make a water bath around baking dish.\nBake in the preheated oven until pudding is set in the middle, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caribbean Couscous",
        "ingredients": [
            "1/2 cup chopped pecans ADVERTISEMENT",
            "2 tablespoons oil ADVERTISEMENT",
            "1 (4 ounce) can mushrooms, drained and liquid reserved ADVERTISEMENT",
            "1 large sweet potato, peeled and grated ADVERTISEMENT",
            "1 1/2 cups vegetable stock ADVERTISEMENT",
            "1 orange, zested and juiced ADVERTISEMENT",
            "2 green onions, sliced ADVERTISEMENT",
            "1/4 jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "1/2 teaspoon poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch ground allspice ADVERTISEMENT",
            "3/4 cup couscous ADVERTISEMENT",
            "1/3 cup chopped dried mixed fruit ADVERTISEMENT",
            "1/4 cup shredded coconut ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spread pecans onto a baking sheet.\nBake in the preheated oven until pecans are toasted and fragrant, 3 to 5 minutes. Remove from oven and set aside to cool.\nHeat oil and mushroom liquid together in a large skillet over low heat. Cook and stir sweet potato in the oil mixture until tender, 20 minutes, adding a small portion of the vegetable stock if liquid is needed. Stir mushrooms, vegetable stock, orange zest, orange juice, green onions, jalapeno pepper, poultry seasoning, cumin, and allspice into sweet potato mixture; cover skillet and simmer for flavors to blend, about 5 minutes.\nRemove skillet from heat and stir couscous, dried fruit, and coconut into sweet potato mixture. Cover skillet and let stand until couscous has absorbed all the liquid, about 5 minutes. Fold pecans and cilantro into couscous mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "My Tais",
        "ingredients": [
            "1 cup crushed ice, or as needed ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "1 tablespoon grenadine syrup ADVERTISEMENT",
            "1 1/2 teaspoons lime juice ADVERTISEMENT",
            "1 tablespoon cream of coconut ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger rum ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger spiced rum ADVERTISEMENT",
            "1/4 cup club soda, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill 2 glasses with ice.\nGently stir orange juice, pineapple juice, grenadine, and lime juice together in a small pitcher; stir in cream of coconut.\nMix rum and spiced rum together in a small glass. Pour rum mixture into the 2 glasses and top with orange juice mixture. Top off each glass with club soda.\n",
        "picture_link": "p2EbfaKJfZf02p5DaGJN45FI9qS5/3a"
    },
    {
        "title": "Fresh Mango Pie Dessert",
        "ingredients": [
            "2 cups all-purpose flour, sifted ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 (12 ounce) container whipped topping (such as Cool Whip®) ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "2 envelopes unflavored gelatin ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1/2 cup white sugar, or to taste ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "5 cups diced mango ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix flour and confectioners' sugar together in a bowl. Cut butter into flour mixture using a pastry blender or 2 knives until mixture resembles coarse crumbs; press into a 9x13-inch baking dish.\nBake in the preheated oven until crust is lightly browned, 20 to 25 minutes. Remove from oven and cool completely.\nBeat cream cheese, 1/2 cup white sugar, and vanilla extract together in a bowl using an electric mixer until smooth and creamy. Fold whipped topping into cream cheese mixture and pour over crust. Refrigerate mixture until cream cheese filling is chilled, about 30 minutes.\nPour cold water into a bowl and sprinkle with gelatin; stir well. Pour hot water over gelatin mixture and stir until gelatin is dissolved. Stir 1/2 cup sugar and salt into gelatin mixture until sugar is dissolved; add lemon juice and cool to room temperature. Fold mango into gelatin mixture and refrigerate until gelatin begins to set, 15 to 20 minutes.\nPour mango gelatin over cream cheese filling and refrigerate until completely set, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blackberry Habanero BBQ Sauce",
        "ingredients": [
            "1 quart fresh blackberries ADVERTISEMENT",
            "1 (46 fluid ounce) bottle ketchup ADVERTISEMENT",
            "2 cups blackberry jelly ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup raspberry balsamic vinegar ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/2 cup frozen limeade concentrate ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "2 tablespoons finely ground sea salt ADVERTISEMENT",
            "2 tablespoons bourbon whiskey ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "2 teaspoons liquid smoke flavoring ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "1 tablespoon ground dried chipotle pepper ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "1 tablespoon finely ground black pepper ADVERTISEMENT",
            "1 teaspoon teriyaki sauce ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "3 habanero peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine blackberries, ketchup, blackberry jelly, sugar, raspberry balsamic vinegar, corn syrup, tomato paste, limeade concentrate, cider vinegar, salt, bourbon, garlic powder, liquid smoke, ginger, ground chipotle pepper, red pepper flakes, black pepper, teriyaki sauce, and hot pepper sauce in a large pot and bring to a simmer over medium-high heat.\nReduce heat to medium-low and simmer blackberry mixture for 10 minutes. Add whole habanero peppers and continue to simmer until sauce is thickened, about 20 minutes more. Remove and discard habanero peppers.\nPour barbecue sauce into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\n",
        "picture_link": "iVa97kUKx1wkGarx0KiMtynr4uzJgEC"
    },
    {
        "title": "Korean Pork Curry",
        "ingredients": [
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "1 1/2 pounds boneless pork chops, cut into cubes ADVERTISEMENT",
            "1 large yellow onion, cut into cubes ADVERTISEMENT",
            "2 large russet potatoes, peeled and cut into cubes ADVERTISEMENT",
            "3 large carrots, peeled and cut into cubes ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 tablespoon Korean-style curry powder (such as Assi® mild curry powder), or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a large skillet over medium heat; cook and stir pork in hot oil until completely browned, 5 to 7 minutes.\nHeat 2 tablespoons olive oil in a large pot; cook and stir onion, potatoes, and carrots in the hot oil until the vegetables begin to soften, 5 to 7 minutes. Stir pork into the vegetable mixture.\nPour water into the pot, reduce heat to low, and place a cover on the pot; cook at a simmer until the potatoes are tender, but not yet falling apart, about 20 minutes.\nRemove pot from heat and stir curry powder into the pork mixture until completely dissolves. Return pot to heat and continue cooking until the sauce is thick and the onions are translucent, 20 to 30 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mixed Beans and More",
        "ingredients": [
            "1 1/2 cups dried black beans, rinsed ADVERTISEMENT",
            "1 1/2 cups dried pinto beans, rinsed ADVERTISEMENT",
            "1 1/2 cups dried kidney beans, rinsed ADVERTISEMENT",
            "1 pound andouille sausage, chopped ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 bell pepper, chopped ADVERTISEMENT",
            "2 cloves cloves garlic, minced ADVERTISEMENT",
            "1 cup corn (optional) ADVERTISEMENT",
            "3/4 cup salsa ADVERTISEMENT",
            "3/4 cup tomato-based chili sauce ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place black beans, pinto beans, and kidney beans in a large container and cover with several inches of cool water; let stand for at least 12 hours. Bring beans and water to a boil in a large pot; cook until beans are tender and heated through, 30 minutes. Remove pot from heat to cool and drain beans.\nCook and stir sausage, beef, onion, bell pepper, and garlic in a large skillet over medium-high heat until meat is browned, 5 to 10 minutes. Drain and discard fat.\nStir beans, sausage mixture, corn, salsa, chili sauce, vinegar, and water together in a slow cooker.\nCook on High for at least 4 hours, stirring occasionally. Season with salt and ground black pepper.\n",
        "picture_link": "EDtRuKhQQqDo2yVTlFIlXYafXqSNmgG"
    },
    {
        "title": "Bacon Wrapped Citrus Shrimp",
        "ingredients": [
            "1 (8 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "12 jumbo shrimp, peeled and deveined ADVERTISEMENT",
            "6 slices bacon, halved crosswise ADVERTISEMENT",
            "12 toothpicks ADVERTISEMENT",
            "1/2 cup lime vinaigrette dressing ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a pineapple chunk in the inner curve of each shrimp and wrap shrimp with bacon. Secure by threading a toothpick through the bacon. Arrange wrapped shrimp on a baking sheet and drizzle with lime vinaigrette dressing. Refrigerate for 30 minutes.\nHeat a non-stick skillet over medium heat; arrange shrimp on the skillet and fry until bacon is crispy and browned, 2 to 3 minutes per side. Transfer shrimp to a serving tray and sprinkle with green onion.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pounded Chicken with Sherry-Dijon Sauce",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 cup whole wheat bread crumbs ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 tablespoons dry sherry ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "3/4 pound skinless, boneless chicken breast halves, pounded to 1/8-inch thick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 500 degrees F (260 degrees C). Grease a baking sheet with olive oil.\nMix egg and water together in a wide bowl. Mix bread crumbs and Parmesan cheese together in a separate bowl.\nMelt butter with sherry, Worcestershire sauce, Dijon mustard, and garlic in a small saucepan over medium heat; cook until slightly thickened, about 5 minutes.\nDip chicken breasts into the beaten egg to coat. Press the dipped breasts into bread crumbs and gently toss between your hands so any bread crumbs that haven't stuck can fall away. Arrange onto the prepared sheet. Drizzle sherry-Dijon sauce over the breaded chicken breasts.\nBake on a rack in the top third of the preheated oven until no longer pink in the center and the juices run clear, 5 to 7 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "Y.28nwgFOa/2Sq/4uwjI0v1rj7xmsA."
    },
    {
        "title": "Pumpkin Quinoa Bread",
        "ingredients": [
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup canola oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 cup cooked quinoa ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x5-inch loaf pan.\nWhisk pumpkin, brown sugar, white sugar, canola oil, and eggs together in a bowl until smooth. Sift flour, cinnamon, nutmeg, baking soda, baking powder, salt, allspice, and cloves together in a separate bowl. Stir flour mixture, a little at a time, into pumpkin mixture until batter is smooth; fold in quinoa, walnuts, and cranberries. Pour batter into prepared loaf pan.\nBake in the preheated oven until top of loaf springs back when lightly touched, 50 to 60 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cranberry Cheesecake Bars",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 (18.25 ounce) package butter cake mix ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 (16 ounce) can whole berry cranberry sauce ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat cake mix, butter, and 1 egg together in a bowl using an electric mixer on low speed until mixture is crumbly; stir in pecans. Press mixture into a 9x13-inch baking dish.\nBake in the preheated oven until crust is set, 5 to 8 minutes.\nBeat cream cheese, confectioners' sugar, 1 egg, and vanilla extract together in a bowl using an electric mixer until smooth. Stir cranberry sauce and nutmeg together in a separate bowl. Carefully spread cream cheese mixture onto crust. Spoon cranberry sauce mixture in 3 rows lengthwise over cream cheese mixture. Pull a knife through cranberry sauce mixture into cream cheese mixture to form swirls.\nBake in the preheated oven until cream cheese mixture is set, 30 to 40 minutes. Cool completely before cutting into bars.\n",
        "picture_link": "6Uc.RXyb6nuTPdMPx96CcYMqhk7Q28G"
    },
    {
        "title": "Pear and Apple Coffee Cake with Walnut Topping",
        "ingredients": [
            "1 teaspoon coconut oil, melted ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "3 tablespoons raw honey ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons coconut flour ADVERTISEMENT",
            "1/4 cup cold unsalted butter, cut into cubes ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "2 pears, peeled and thinly sliced ADVERTISEMENT",
            "1 apple, peeled and thinly sliced ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1/4 cup raw honey ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3/4 cup coconut flour ADVERTISEMENT",
            "3/4 cup coconut milk ADVERTISEMENT",
            "1/4 cup arrowroot powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Wrap the bottom of a springform pan in aluminum foil and grease entire pan with coconut oil.\nStir walnuts, 3 tablespoons honey, and cinnamon together in a bowl.\nPour 2 tablespoons coconut flour in a bowl; cut 1/4 cup cold unsalted butter into flour until mixture resembles coarse crumbs. Stir walnut mixture into butter mixture.\nStir pears, apples, and lemon juice together in a bowl.\nBeat 1/2 cup softened unsalted butter, 1/4 cup honey, and eggs together in a bowl. Whisk coconut flour, coconut milk, arrowroot powder, vanilla extract, baking powder, baking soda, and sea salt into egg mixture until a smooth batter.\nPour 1/2 the batter into the springform pan. Spread pears and apples in a layer over the batter. Pour remaining 1/2 the batter over apples and pears; top with walnut mixture.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 50 to 55 minutes. Cool for 10 minutes before running a butter knife around the edge of the cake and loosening the springform. Cool for 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gram Miller's Bread and Butter Pickles",
        "ingredients": [
            "5 cucumbers, thinly sliced ADVERTISEMENT",
            "3 onions, sliced ADVERTISEMENT",
            "1/4 cup salt ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon mustard seed ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "4 1-pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cucumbers and onions together in a bowl. Stir in salt and let sit for 2 hours.\nStir vinegar, water, sugar, celery seed, mustard seed, ginger, and turmeric together in a saucepan over medium-high heat. Bring to a boil; add cucumber mixture and continue to boil until cucumbers and onions are tender, about 5 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the hot cucumber mixture into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool dark area.\n",
        "picture_link": "3G9BHL0rkZKv6q9Nh.lwEgt88zzWxcu"
    },
    {
        "title": "Rum and Raisin Banana Smoothie",
        "ingredients": [
            "1 cup almond milk ADVERTISEMENT",
            "1 frozen banana, cut into chunks ADVERTISEMENT",
            "2 tablespoons rum ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon raisins ADVERTISEMENT",
            "1/8 teaspoon nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend almond milk, banana, rum, honey, raisins, and nutmeg in a blender until smooth, about 30 seconds.\n",
        "picture_link": "8LeQdRs4wA17ERWa0RB6zOfyZP7czce"
    },
    {
        "title": "Creamy Olive Dip",
        "ingredients": [
            "1 (16 ounce) jar mayonnaise ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (6 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "2 teaspoons seasoned salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mayonnaise, sour cream, olives, parsley, dill, minced onion, and seasoned salt together in a bowl; cover with plastic wrap and refrigerate 4 hours to overnight.\n",
        "picture_link": "Kt72WzLwDz5yGn//JzEhh02JqoMJ7ou"
    },
    {
        "title": "Three Cheese Salami Frittata",
        "ingredients": [
            "16 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "6 1/4-inch thick slices Genoa salami ADVERTISEMENT",
            "1 cup chopped fresh parsley, or more to taste ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "1/2 cup grated Romano cheese, divided ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese, divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nWhisk eggs and milk together in a large bowl.\nHeat olive oil in a large oven-proof skillet over medium-high heat. Pour 1/2 the egg mixture into the hot oil; arrange salami over egg mixture and sprinkle with parsley. Add 2/3 the Parmesan cheese, 2/3 Romano cheese, and 2/3 the mozzarella cheese over the salami-parsley layer; season with salt, pepper, and red pepper flakes.\nCook egg-cheese mixture until edges of frittata are browned and middle is set, 10 to 15 minutes. Pour the remaining egg mixture over frittata; sprinkle with remaining Parmesan cheese, Romano cheese, and mozzarella cheese; season with salt, pepper, and red pepper flakes.\nBake in the preheated oven until frittata has risen to about 3 inches and middle is set, 20 to 25 minutes. Carefully turn frittata onto a cutting board; cut into 2-inch squares using a sharp knife. Arrange squares in a bowl and refrigerate until chilled, about 1 hour.\n",
        "picture_link": "42uWyPGanvkRuF/r.YdQBgrAYC1bT3C"
    },
    {
        "title": "Emerald-Drop Snow Tea",
        "ingredients": [
            "3 cups hot water ADVERTISEMENT",
            "2 tablespoons Italian red wine, or more to taste ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "4 fresh spearmint leaves ADVERTISEMENT",
            "1 leaf fresh mint leaf ADVERTISEMENT",
            "1/2 apple, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, red wine, sugar, cinnamon, nutmeg, ginger, spearmint leaves, and mint leaf in a saucepan; bring to a boil. Reduce heat to low and add apple to mixture. Simmer tea until apple breaks easily with a fork, about 5 minutes. Remove apple using a slotted spoon or strainer and pour tea into a mug.\n",
        "picture_link": "/Ps3yiEetovyPgUhKIXg8u6fh7ea7mO"
    },
    {
        "title": "Imperial Cinnamon Red Hot® Cookies",
        "ingredients": [
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "3/4 cup firmly packed brown sugar ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 1/2 cups cinnamon chips ADVERTISEMENT",
            "1 1/2 cups cinnamon candies (such as Red Hots®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix flour, cinnamon, baking powder, baking soda, and salt together in a bowl.\nBeat butter, brown sugar, white sugar, and vanilla with an electric mixer in a large bowl until smooth. Beat in the egg until completely incorporated.\nGradually beat flour mixture into butter mixture until combined. Fold in cinnamon chips and cinnamon candies, mixing just enough to evenly combine.\nDrop spoonfuls of the dough 2 inches apart onto ungreased baking sheets. Bake in the preheated oven until lightly browned, 8 to 11 minutes. Cool on the pans for 2 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "SeAfg.802SRbHjPt8yeafGMNCEsoHte"
    },
    {
        "title": "Thai Coconut Pork Curry",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 1/4 pounds lean pork, cut into cubes ADVERTISEMENT",
            "2 1/2 cups Thai-style coconut curry stir-fry sauce (such as KanTong®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over high heat; cook pork in hot oil until completely browned, about 5 minutes.\nPour stir-fry sauce into the saucepan, bring to a simmer, and cook until the pork is cooked through, 15 to 20 minutes.\n",
        "picture_link": "Zp.7W1glznXWcY6YPiJh5.aU/feYDu."
    },
    {
        "title": "Cranberry Pumpkin Chip Bread",
        "ingredients": [
            "2 teaspoons all-purpose flour, or as needed ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup canned pumpkin ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 8x4x2-inch loaf pans and flour pans using 2 teaspoons flour.\nStir 2 1/4 cups flour, sugar, cinnamon, baking soda, ginger, nutmeg, cloves, and salt together in a bowl. Whisk pumpkin, oil, and eggs together in a separate bowl. Pour pumpkin mixture into flour mixture and stir until just combined; fold cranberries and chocolate chips into batter. Pour batter into prepared loaf pans.\nBake loaves in the preheated oven until a toothpick inserted into the center comes out clean, 50 to 60 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "xdGi.N6sl4z0K70udCfaezyLDUcV/b2"
    },
    {
        "title": "Squashed Lemon Coconut Pie",
        "ingredients": [
            "1 pastry for a 9-inch pie crust ADVERTISEMENT",
            "1 cup grated yellow squash ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "1 teaspoon coconut extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Press pie crust into a pie dish.\nMix squash, sugar, butter, eggs, flour, lemon extract, and coconut extract together in a bowl; pour filling into pie crust.\nBake in the preheated oven until pie is set and lightly browned, 30 to 45 minutes.\n",
        "picture_link": "nlfdPvCzukwr9U4ealkaQWi3kcTciAO"
    },
    {
        "title": "Harrison Muesli",
        "ingredients": [
            "2 cups vanilla soy milk, divided ADVERTISEMENT",
            "1 cup frozen blueberries ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/2 cup sweetened flaked coconut ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 cup vanilla yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend 1 cup soy milk with blueberries in a blender until the mixture has the consistency of a smoothie, about 1 minute.\nStir together the oats, coconut, and pecans in a large bowl. Stir in the blueberry mixture, yogurt, and the remaining soy milk. Cover; refrigerate for at least 4 hours or up to overnight.\n",
        "picture_link": ".221MPy6Wb/cR6ByLeTmsfFQwuLSnpG"
    },
    {
        "title": "Nutty Pumpkin Bars",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup packed dark brown sugar ADVERTISEMENT",
            "2/3 cup solid-pack pumpkin puree ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar, sifted ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nBeat flour, brown sugar, pumpkin, 1/2 cup butter, eggs, cinnamon, vanilla extract, baking soda, nutmeg, ginger, and baking powder together in a large bowl using an electric mixer on medium speed until batter is evenly combined, about 2 minutes. Fold pecans into batter and spread into the prepared baking pan.\nBake in the preheated oven until edges are lightly browned, 20 to 25 minutes. Remove from oven and cool.\nBeat 2 tablespoons butter and confectioners' sugar together in a bowl using an electric mixer until smooth; beat in orange juice and orange zest until frosting is light and spreadable. Spread frosting onto cooled bars.\n",
        "picture_link": "b/sY5P0tf9FhQXOfR5ybfm.DF.SlZhK"
    },
    {
        "title": "Stuffed Fingerling Potatoes",
        "ingredients": [
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1 pound fingerling potatoes ADVERTISEMENT",
            "1 (14 ounce) package cooked bacon, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sour cream and onion soup mix together in a bowl; chill in refrigerator for flavors to blend, 2 hours to overnight.\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain and cool slightly. Slice each potato lengthwise and carefully scoop insides using a melon baller or small spoon, leaving a small border of filling; transfer potato filling to a bowl.\nMash or whip potato filling using an electric mixer, adding 1 to 2 tablespoons sour cream mixture at a time, until desired flavor is reached. About 2/3 the container sour cream will be used. Spoon potato-sour cream mixture into potato skins, forming a mound of filling; top with bacon. Refrigerate stuffed potatoes for filling to set, at least 30 minutes.\n",
        "picture_link": "8KjgKMsFnnG6tH42tJSnhgIIko3YBjq"
    },
    {
        "title": "Pluma Moos",
        "ingredients": [
            "1 (29 ounce) can peaches in light syrup ADVERTISEMENT",
            "1 (29 ounce) can pears in light syrup ADVERTISEMENT",
            "1 (16.5 ounce) can pitted dark sweet cherries in heavy syrup ADVERTISEMENT",
            "1/2 cup dried pitted prunes ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "2 mandarin orange peels ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour peaches, pears, cherries, and all syrups from the canned fruit into a large pot. Stir in prunes, raisins, mandarin orange peels, and cinnamon sticks; bring to a boil. Reduce heat to low and simmer until slightly thick, about 2 hours.\nServe warm. Remove orange peels and cinnamon sticks before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten Free Brown Butter Apple Hand Pies",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "2 1/2 cups gluten-free all-purpose baking flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons xanthan gum ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup cold water, or more as needed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "4 apples, peeled and thinly sliced ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons gluten-free all-purpose baking flour ADVERTISEMENT",
            "4 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "Egg Wash: ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 teaspoon white sugar, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse 2 1/2 cups flour, 2 tablespoons sugar, xanthan gum, and salt together in a food processor; add 3/4 cup butter, 2 eggs, and cold water. Blend until evenly mixed and crumbly but holds together when pinched; add more cold water, 1 tablespoon at a time, if needed. Form dough into a ball, place in a bowl, and chill for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nMix apples, 1/4 cup white sugar, brown sugar, 2 tablespoons flour, lemon juice, vanilla extract, cinnamon, and nutmeg in a large bowl.\nMelt 6 tablespoons butter in a saucepan over medium heat until foamy; continue cooking and stirring until butter is brown with a nutty aroma, 3 to 5 minutes. Pour browned butter over apple mixture; stir to coat.\nRoll dough out on a lightly floured surface to 1/8-inch thickness; cut into 4-inch circles. Whisk 1 egg and 1 tablespoon water together in a bowl; brush egg wash over each circle of dough. Spoon about 2 tablespoons apple filling on 1 half of each circle; fold the other half over the filling. Crimp the edges of each pie together using a fork. Place pies on a baking sheet; brush tops with egg wash and sprinkle with 1 teaspoon white sugar.\nBake in the preheated oven until pies are lightly browned, about 30 minutes.\n",
        "picture_link": "LxEdEueG01bQ.XtJTHjtZEnK1I7viw2"
    },
    {
        "title": "Lekman Cocktail",
        "ingredients": [
            "5 fluid ounces lingonberry juice ADVERTISEMENT",
            "1 1/2 fluid ounces vodka (such as Absolut®) ADVERTISEMENT",
            "1/2 fluid ounce blue Curacao liqueur ADVERTISEMENT",
            "1 cup ice, or as needed ADVERTISEMENT",
            "1 sour key candy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour lingonberry juice, vodka, and blue Curacao into a cocktail shaker. Add ice; shake. Pour into a lowball glass. Garnish with sour key candy.\n",
        "picture_link": "P4mSETVk05LBHpmuAcyY9Hn8qC105sa"
    },
    {
        "title": "Trick or Treat Cheesecake",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "Crust: ADVERTISEMENT",
            "25 chocolate sandwich cookies (such as Oreo®), crushed ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/3 cup melted butter ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "20 mini chocolate-coated caramel-peanut nougat candy bars (such as Snickers®), cut into quarters ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Place a shallow pan 1/2-full with water on the lower oven rack to minimize cracking in the cheesecake. Spray the inside of a 9-inch springform pan with cooking spray and line with parchment paper.\nMix chocolate sandwich cookies, sugar, and butter together in a bowl; press into the bottom of the prepared pan.\nBeat cream cheese and sweetened condensed milk together in a separate bowl using an electric mixer until smooth; beat in eggs, 1 at a time, until just blended. Stir candy bars and vanilla extract into cream cheese mixture; pour over crust.\nBake in the preheated oven until edges are set and center is still slightly soft, about 50 minutes. Turn off oven, leaving door open, and cool cheesecake in oven, at least 1 hour. Run a knife or spatula around the edges to loosen cheesecake; refrigerate in the pan until set, 8 hours or overnight.\n",
        "picture_link": "sDQ21KY6EpD3MBgyGIpv6C3kqzS0XdG"
    },
    {
        "title": "Power-Packed Smoothie ",
        "ingredients": [
            "1 cup cold water ADVERTISEMENT",
            "1 small banana ADVERTISEMENT",
            "1/2 cup spinach, or more to taste ADVERTISEMENT",
            "1 teaspoon spirulina powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cold water, banana, and spinach leaves in a blender; blend to combine, about 5 seconds. Add spirulina powder and blend until smooth, 1 minute more.\n",
        "picture_link": "NymjLHQ4ZIsANjnU0nNHvD09C4K2y2O"
    },
    {
        "title": "Goat's Milk Fudge",
        "ingredients": [
            "1 (10 ounce) bag vegan chocolate chips (such as Enjoy Life®) ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup evaporated goat milk ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line an aluminum loaf pan with waxed paper.\nMelt chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes.\nMix walnuts, goat milk, corn syrup, vanilla extract, and salt into chocolate; stir until glossy. Pour into prepared loaf pan; cool until solidified, 2 hours or overnight.\nInvert loaf pan to remove fudge, peel off waxed paper, and cut into squares. Refrigerate to set, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gingerbread Pizzelle",
        "ingredients": [
            "4 cups whole wheat flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "6 medium eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat pizzelle baker according to manufacturer's instructions.\nMix whole wheat flour, baking powder, cinnamon, ginger, allspice, cloves, and black pepper together in a large bowl.\nMelt butter in a large saucepan over medium heat. Remove from heat. Stir white sugar, brown sugar, molasses, and orange zest into saucepan until well-combined. Add 1/2 of the flour mixture, stirring until smooth. Add eggs; mix until smooth. Stir in remaining flour mixture, mixing until batter is smooth.\nDrop spoonfuls of batter onto the preheated pizzelle baker. Bake until browned, about 1 1/2 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Brownie Trifle",
        "ingredients": [
            "1 (21.5 ounce) package chocolate chunk brownie mix (such as Duncan Hines®) ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 cups cold milk ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "6 ounces chocolate almond bark ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking pan.\nCombine brownie mix, eggs, water, and oil in a large bowl; stir until well blended. Spread mixture evenly into prepared pan.\nBake in preheated oven until top is dry and edges have started to pull away from the sides of the pan, 20 to 25 minutes. Cool completely, about 30 minutes. Cut into 1-inch squares.\nBeat cream cheese in a large bowl with an electric mixer. Add milk and pudding mix; beat until smooth. Fold in whipped topping until well incorporated into filling.\nPlace 1/2 of the brownie squares at the bottom of a trifle bowl or glass serving dish; top with filling. Shave 1/2 of the chocolate bar onto filling using a vegetable peeler. Repeat with remaining brownies, filling, and chocolate bar shavings. Refrigerate until set, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pierogi Pizza ",
        "ingredients": [
            "Pizza Dough: ADVERTISEMENT",
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "6 potatoes, thinly sliced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "8 ounces sour cream ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "1 (8 ounce) package marbled Colby-Monterey Jack cheese, shredded ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1/4 cup bacon bits, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast and sugar in warm water in a small bowl. Let stand until yeast softens and begins to bubble, about 5 minutes.\nCombine flour and salt together in a large bowl. Pour yeast mixture and 1/4 cup olive oil over flour. Mix and knead until a sticky dough forms, about 5 minutes. Place dough in a large, lightly-oiled bowl and turn to coat. Cover with a towel and let rise in a warm place until doubled in volume, about 1 hour.\nPlace potatoes in a large pot and pour in enough water to cover. Bring to a boil; cook until potatoes are just tender, about 10 minutes. Drain.\nHeat 2 tablespoons olive oil in a large skillet over medium-high heat; add potatoes and cook until lightly golden, about 5 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nWhisk sour cream and garlic powder together in a small bowl to make pizza \"sauce\".\nGently pat and stretch pizza dough out to a 12-inch circle on a pizza stone. Spread sauce evenly over dough. Layer potatoes on top to cover dough completely. Sprinkle Cheddar cheese, green onions, and bacon bits on top.\nBake pizza in the preheated oven until crust is golden brown, 15 to 20 minutes.\n",
        "picture_link": "FsJ/xSRCMfHTrWsDdadeUKc42wLlNUa"
    },
    {
        "title": "Purim Hamantaschen with Prune Filling",
        "ingredients": [
            "Prune Filling: ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "20 pitted prunes ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "Cookie Dough: ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine honey, lemon juice, and prunes in a small saucepan. Add enough water to cover. Bring to a boil; reduce heat and simmer until prunes are softened, about 10 minutes. Remove prune filling from heat and let cool.\nPreheat oven to 350 degrees F (175 degrees C). Line 3 baking sheets with parchment paper.\nCombine flour, baking powder, and salt together in a bowl.\nBeat sugar, butter, and shortening together with a wooden spoon until creamy. Add eggs; stir until smooth. Stir in orange juice and vanilla extract. Gently fold in flour mixture, mixing until a dough forms. Divide dough into 3 balls.\nRoll out 1 ball of dough on a floured work surface to 1/4-inch thickness, using a piece of parchment paper under the rolling pin to prevent sticking. Use the rim of a glass to cut dough into circles.\nPlace 1/2 teaspoon prune filling in the center of each circle of dough. Pinch edges together to secure filling and form triangular pockets. Transfer cookies to baking sheet. Repeat rolling, cutting, and filling remaining balls of dough.\nBake cookies in the preheated oven until lightly golden, about 18 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roasted Butternut Squash Soup Infused With Chocolate",
        "ingredients": [
            "1 butternut squash, halved lengthwise and seeded ADVERTISEMENT",
            "1/4 cup olive oil, or more as needed, divided ADVERTISEMENT",
            "1/2 teaspoon ground Saigon cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "kosher salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 ounces dark chocolate, finely chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 small red chile pepper, halved lengthwise ADVERTISEMENT",
            "2 tablespoons pure maple syrup, divided ADVERTISEMENT",
            "1 small yellow onion, chopped ADVERTISEMENT",
            "4 cups chicken stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nRub each half of squash with 1 1/2 tablespoons olive oil and place cut-side up on baking sheet. Sprinkle cinnamon, nutmeg, salt, and pepper on each half. Place chocolate, garlic, chile, and maple syrup into the cavities of each half.\nBake in the preheated oven until flesh is soft and tender, 45 to 55 minutes. Remove from oven to cool.\nHeat 1 tablespoon olive oil in a stock pot over medium heat. Cook and stir onion until translucent, about 5 minutes.\nScoop flesh out of 1 butternut squash half, along with cavity contents, into a blender. Add onion and 2 cups chicken stock; puree until smooth. Pour into stock pot. Scoop flesh out of remaining butternut squash half, along with cavity contents, into blender. Add remaining chicken stock; puree until smooth. Pour into stock pot.\nHeat soup in stock pot over medium heat to desired temperature; add salt and ground black pepper to taste.\n",
        "picture_link": "R/gR9Vn6IZunDQzoxaOSFYEdDa9wlh."
    },
    {
        "title": "Pierogi Stuffed Shells",
        "ingredients": [
            "22 jumbo pasta shells ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup instant mashed potatoes (such as Idahoan® Baby Reds®) ADVERTISEMENT",
            "1 cup French-fried onions ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons bacon bits ADVERTISEMENT",
            "1 jalapeno pepper, diced ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook pasta shells in the boiling water, stirring occasionally until tender yet firm to the bite, about 9 minutes. Drain and arrange at the bottom of the baking dish.\nMeasure 2 cups of water into a microwave-safe bowl. Microwave on high to bring water to a boil, 4 to 5 minutes. Remove water from microwave and immediately add instant mashed potatoes, using a fork to moisten potatoes. Cover and let stand, about 5 minutes.\nStir French-fried onions, Cheddar cheese, bacon bits, and jalapeno into potatoes; mix well to combine. Stuff each pasta shell with a heaping teaspoon of the potato mixture.\nMelt butter in a skillet over medium heat. Add onions; cook and stir until translucent and softened, about 5 minutes. Pour butter and onions over stuffed shells. Cover baking dish with aluminum foil.\nBake stuffed shells in the preheated oven until golden, about 45 minutes.\n",
        "picture_link": "Vtd60k3ChHlahMSdFIu4.071eBBJKpy"
    },
    {
        "title": "Dairy-Free Spelt German Pancake",
        "ingredients": [
            "2 tablespoons coconut oil ADVERTISEMENT",
            "7 eggs ADVERTISEMENT",
            "1 1/4 cups unsweetened coconut milk ADVERTISEMENT",
            "1 cup spelt flour ADVERTISEMENT",
            "1/2 teaspoon Himalayan pink salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Put coconut oil into a 9x13-inch baking dish.\nPlace baking dish in the preheated oven to melt coconut oil, about 3 minutes.\nWhisk eggs and coconut milk together in a large bowl. Whisk in spelt flour and salt to make a smooth batter. Pour batter into the hot baking dish.\nBake in the preheated oven until puffed and golden, rotating the baking dish once halfway through, about 18 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sour Cream Dough for Pierogi",
        "ingredients": [
            "6 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup milk, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, salt, eggs, sour cream, and milk together in a bowl. Add extra flour as needed to make dough less sticky.\n",
        "picture_link": "/ZgxzpdYdUfXR3MB.5mj.JWXUZJmuhu"
    },
    {
        "title": "Chocolate Peanut Butter Brownie Trifle",
        "ingredients": [
            "Brownies: ADVERTISEMENT",
            "1 (18.25 ounce) package brownie mix (such as Betty Crocker®) ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "Chocolate Cake: ADVERTISEMENT",
            "1 (15.25 ounce) package chocolate cake mix (such as Pillsbury ® Moist Supreme®) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "1 (16 ounce) jar peanut butter ADVERTISEMENT",
            "2 (3.5 ounce) packages instant chocolate pudding mix ADVERTISEMENT",
            "2 (8 ounce) containers whipped topping ADVERTISEMENT",
            "12 chocolate-covered peanut butter cups (such as Reese's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x13-inch baking pan and two 9-inch round cake pans.\nCombine brownie mix, 2/3 cup vegetable oil, 2 eggs, and 1/4 cup water in a large bowl. Mix with a wooden spoon until well-blended, about 3 minutes. Pour into 9x13-inch baking pan and spread evenly.\nBake brownies in the preheated oven until a toothpick inserted into the center comes out clean or with a few moist crumbs attached, 28 to 31 minutes. Cool completely, about 30 minutes. Cut into bite-size pieces.\nCombine cake mix, 1 cup water, 3 eggs, and 1/3 cup oil in another large bowl. Beat with an electric mixer on medium speed until well-blended, about 2 minutes. Divide batter between 9-inch round cake pans, smoothing tops.\nBake cakes in the preheated oven until a toothpick inserted into the centers comes out clean, 29 to 33 minutes. Cool in the pans, 10 to 15 minutes, before transferring to wire racks to cool completely, about 20 minutes more. Crumble cakes into large crumbs.\nBeat milk, peanut butter, and pudding mix together with an electric mixer on medium speed until blended, about 2 minutes. Let sit until thickened, about 10 minutes.\nPlace 1/3 of the brownie pieces in the bottom of a large trifle or punch bowl. Top with 1/3 of the cake crumbs, 1/3 of the pudding, and 1/3 of the whipped topping. Continue layering remaining brownie pieces, cake crumbs, pudding, and whipped topping, ending with whipped topping.\nCut each chocolate-covered peanut butter cup into thirds so that you have long strips. Decorate sides and top of the trifle with chocolate strips.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blueberry and Raisin Jam",
        "ingredients": [
            "12 ounces raisins ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "4 pints fresh blueberries ADVERTISEMENT",
            "1 (1.75 ounce) package powdered low-sugar pectin ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend raisins and orange juice in a blender or food processor until smooth; transfer mixture to a pot. Blend blueberries in blender or food processor until pureed; add to raisin mixture. Stir pectin into fruit mixture and bring to a boil. Mix sugar into fruit mixture; boil, stirring often, until sugar is dissolved, about 5 more minutes.\nSterilize the jars and lids in boiling water for 10 minutes. Pack the jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool dark area.\n",
        "picture_link": "5y03QUUl.6FP4pgFf1GBqo6saexmBJq"
    },
    {
        "title": "Ashley and Whitney's Apple-Cherry Cobbler",
        "ingredients": [
            "1 Reynolds® Slow Cooker Liner ADVERTISEMENT",
            "1/2 cup granulated sugar ADVERTISEMENT",
            "4 teaspoons quick-cooking tapioca ADVERTISEMENT",
            "1 teaspoon apple pie spice ADVERTISEMENT",
            "1 1/2 pounds cooking apples, peeled, cored and cut into 1/2-inch slices ADVERTISEMENT",
            "1 (16 ounce) can pitted tart cherries ADVERTISEMENT",
            "1/2 cup dried cherries ADVERTISEMENT",
            "Spiced Triangles: ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1/2 teaspoon apple pie spice ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "Ice cream, such as butter pecan or cinnamon; or half-and-half; or light cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 3-1/2- or 4-quart crockery cooker stir together sugar, tapioca, and apple pie spice.\nStir in the apple slices, undrained canned cherries, and dried cherries until combined.\nCover; cook on low-heat setting for 6 to 7 hours or on high-setting for 3 to 3-1/2 hours.\nSpiced Triangles: In a bowl combine 1 tablespoon sugar and 1/2 teaspoon apple pie spice.\nUnroll 1 package (8) refrigerated crescent rolls. Separate triangles. Brush tops with 1 tablespoon melted butter and sprinkle with sugar-cinnamon mixture.\nCut each triangle into 3 triangles. Place on an ungreased baking sheet.\nBake in a 375 degree F oven for 8 to 10 minutes or until bottoms are lightly browned. Remove to a wire rack to cool.\nTo serve, divide cherry-apple mixture among 6 to 8 shallow dessert dishes.\nTop with Spiced Triangles and ice cream or half-and-half, if desired.\n",
        "picture_link": "8A7UcwBpX2JGMxd1NUnhsohrEC1dWfG"
    },
    {
        "title": "BBQ Chicken Pouches",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "4 boneless, skinless chicken breasts ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "1 (10 ounce) package frozen corn ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Spray 4 sheets aluminum foil with cooking spray.\nCenter 1 chicken breast on each prepared aluminum foil sheet and top each chicken breast with 1/4 cup barbeque sauce. Layer corn and green bell pepper over barbeque sauce layer. Fold the sides of each aluminum foil piece over the top of each chicken breast mixture, double-folding the top and ends to form a seal on each 'pouch'. Leave enough space inside each pouch for circulation. Arrange pouches on a baking sheet.\nBake in the preheated oven until chicken is no longer pink in the center and the juices run clear, 18 to 29 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Open one end of pouch first to let the steam out before opening top.\n",
        "picture_link": "W/hZ8Ladvm.oXswTOZuFOcHsBGTXWc2"
    },
    {
        "title": "Cucumber Soup with Tomatoes",
        "ingredients": [
            "4 cucumbers - peeled, quartered, and seeded ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 cup chopped tomato ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 2 cucumbers in a blender; pour in chicken stock. Blend cucumber mixture until smooth and pureed; pour cucumber puree into a large bowl.\nChop the remaining 2 cucumbers. Stir chopped cucumbers, tomato, lime juice, and cayenne pepper into pureed cucumber until well mixed. Refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "ubydINQXCmq2FoTcv4E3GKhPfzshSZm"
    },
    {
        "title": "Almond Delights",
        "ingredients": [
            "2 cups almond meal ADVERTISEMENT",
            "1 1/2 tablespoons warm honey ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "3 egg whites, beaten stiff ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nStir almond meal, honey, cinnamon, and nutmeg together in a bowl. Mix beaten egg whites into the almond meal mixture; scoop by teaspoonful onto prepared baking sheet.\nBake in preheated oven until browned, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Pineapple Bake",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "10 slices bread, cubed ADVERTISEMENT",
            "2 (8 ounce) cans crushed pineapple, drained ADVERTISEMENT",
            "6 pineapple rings, or as needed ADVERTISEMENT",
            "6 maraschino cherries, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat sugar and butter together in a bowl using an electric mixer until creamy and smooth; add eggs. Beat until batter is fluffy. Fold bread and crushed pineapple into batter; pour into a 9x13-inch baking dish. Arrange pineapple rings and maraschino cherries atop batter.\nBake in the preheated oven until lightly browned and set in the middle, 45 to 50 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pancetta Wrapped Stuffed Chicken Breasts",
        "ingredients": [
            "1/4 cup crumbled goat cheese ADVERTISEMENT",
            "2 tablespoons diced roasted red pepper ADVERTISEMENT",
            "2 tablespoons chopped pecans ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 thin chicken breast cutlets ADVERTISEMENT",
            "8 slices pancetta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil or parchment paper.\nMix goat cheese, red pepper, pecans, and garlic together in a bowl; season with salt and pepper. Lay each cutlet onto two slices of pancetta.\nSandwich each chicken cutlet between two sheets of plastic wrap; pound chicken with a kitchen mallet to about 1/4 inch thick. Spoon goat cheese mixture onto the chicken cutlets. Roll chicken and pancetta around the goat cheese mixture and place onto prepared baking sheet with the seam side down. Season each roll with salt and pepper.\nCook until the chicken is no longer pink in the center and the juices run clear, 20 to 25 minutes. An instant-read thermometer inserted into the center of the rolls should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": ".YdodRMCY0tK0DlAFWFWxuY1bmFydwG"
    },
    {
        "title": "Spicy Egg Cucumber Salad",
        "ingredients": [
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "1/2 small red bell pepper, chopped ADVERTISEMENT",
            "1/2 jalapeno pepper, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 large cucumber, sliced ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh spicy oregano ADVERTISEMENT",
            "1 teaspoon chile-garlic sauce (such as Sriracha®) ADVERTISEMENT",
            "1/2 teaspoon liquid aminos ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir red bell pepper, jalapeno pepper, and garlic in the hot oil until fragrant, 2 to 3 minutes. Remove skillet from heat.\nMix eggs and balsamic vinegar into jalapeno pepper mixture until egg yolks break; return skillet to medium heat. Cook and stir until eggs are scrambled and set, about 5 minutes.\nPlace cucumber in a large bowl; top with egg mixture, green onions, and oregano. Whisk chile-garlic sauce and liquid aminos together in a bowl; pour mixture over eggs. Toss to evenly coat.\n",
        "picture_link": "4DwjZeclRX5QY.SiffEnqd45CQ58i46"
    },
    {
        "title": "Mamie's Blackberry Cake with Caramel Icing",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup solid vegetable shortening (such as Crisco®) ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 cups blackberries, drained ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "3 cups packed brown sugar ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.\nBeat white sugar and shortening together in a bowl using an electric mixer until creamy; add eggs and mix well. Mix cinnamon, cloves, and vanilla extract into creamed butter mixture.\nWhisk buttermilk and baking soda together in a separate bowl; stir into creamed butter mixture until thoroughly mixed. Slowly stir flour into butter-buttermilk mixture until batter is smooth; fold in blackberries. Pour batter into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 40 minutes. Cool in the pan for 10 minutes before removing to a serving plate.\nCombine brown sugar, evaporated milk, and butter in a saucepan; cook and stir mixture over medium heat until a small amount of brown sugar mixture dropped into cold water forms a soft ball. Remove saucepan from heat and stir in vanilla extract. Beat by hand until icing is thick. Spread icing quickly over top and sides of cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cream Cheese Filled Croissants",
        "ingredients": [
            "1 (4 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup vanilla yogurt ADVERTISEMENT",
            "1/8 cup white sugar ADVERTISEMENT",
            "3 large strawberries, diced ADVERTISEMENT",
            "1 (8 ounce) package refrigerated dinner roll dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking dish.\nStir cream cheese, yogurt, and sugar together in a bowl until smooth. Fold strawberries into cheese mixture.\nSeparate crescent roll dough into 8 triangles. Spoon cream cheese mixture into the middle of each triangle and roll dough around the filling, starting at the smallest end. Pinch to seal and place in the prepared baking dish.\nBake in the preheated oven until puffed and golden-brown, 13 to 15 minutes.\n",
        "picture_link": "JDW6fCEyuNeJhhmKl95TBsr5i/Tk5de"
    },
    {
        "title": "Huevos d'Elena (aka Huevostadas)",
        "ingredients": [
            "1 potato, diced ADVERTISEMENT",
            "1/2 pound lean ground beef ADVERTISEMENT",
            "1/2 cup diced yellow onion ADVERTISEMENT",
            "2 tablespoons diced red bell pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 crispy tostada shells, warmed ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potato into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 15 minutes. Drain.\nHeat a large skillet over medium-high heat. Cook and stir beef, onion, red bell pepper, and garlic in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add potato, salsa, chili powder, cumin, seasoned salt, and pepper to ground beef mixture; cook and stir over low heat until heated through, 3 to 5 minutes.\nHeat olive oil in a skillet over medium heat; crack eggs into the hot oil. Cook until lightly browned, about 3 minutes per side.\nPlace tostada shells on a serving plate; top each with beef-potato mixture. Layer 1 egg onto each tostada; sprinkle with cilantro.\n",
        "picture_link": "V2HdaHXKSp8C6EaawOFIgnaJVpZ8N8m"
    },
    {
        "title": "Almond Jell-O® with Lychee",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "2 (.25 ounce) packages unflavored gelatin powder ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons almond extract ADVERTISEMENT",
            "8 lychees, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1 cup water into a bowl; stir in gelatin powder until dissolved. Slowly stir boiling water into gelatin mixture. Mix milk, sugar, and almond extract into gelatin mixture; add lychees. Pour gelatin mixture into a shallow container; refrigerate until set, 3 to 4 hours.\n",
        "picture_link": "XN.0BNGatLzZE6hrpK14zI0Fx4nShva"
    },
    {
        "title": "Summer Fruit Salad with Whipped Cream",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "5 tablespoons white sugar ADVERTISEMENT",
            "1/4 cup raspberry-flavored liqueur (such as Chambord®) ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "Fruit Salad: ADVERTISEMENT",
            "2 cups diced nectarines ADVERTISEMENT",
            "1 cup pitted and halved sweet cherries ADVERTISEMENT",
            "1 cup sliced strawberries ADVERTISEMENT",
            "1 cup fresh raspberries ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "Whipped Cream Topping: ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon raspberry-flavored liqueur (such as Chambord®) ADVERTISEMENT",
            "3 tablespoons toasted slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, 5 tablespoons sugar, 1/4 cup raspberry-flavored liqueur, and lemon juice together in a saucepan over medium-low heat. Bring the mixture to a boil, reduce heat to low, and simmer, stirring frequently, until the sugar dissolves completely, about 8 minutes. Set aside to cool.\nMix nectarines, cherries, strawberries, raspberries, and blueberries in a large bowl. Pour the cooled sugar mixture over the fruit and toss gently to coat.\nBeat heavy whipping cream and 2 teaspoons sugar in a bowl with an electric hand mixer on high until stiff peaks form. Fold 1 teaspoon raspberry-flavored liqueur into the whipped cream; spoon over the fruit salad and sprinkle evenly with almonds.\n",
        "picture_link": "UG7UtEbz6kSM9cQ/Pj8KfF.lx/HMXOC"
    },
    {
        "title": "Rhubarb Pineapple Chutney",
        "ingredients": [
            "4 cups chopped rhubarb ADVERTISEMENT",
            "1 1/2 cups chopped fresh pineapple ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup dried cherries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup cider vinegar ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, peeled and sliced ADVERTISEMENT",
            "1 large clove garlic, crushed ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon fresh ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir rhubarb, pineapple, water, cherries, sugar, cider vinegar, ginger, garlic, cinnamon, salt, red pepper flakes, and black pepper together in a heavy saucepan; bring to a boil, reduce heat to low, and cook at a simmer until the rhubarb is tender to the point of falling apart, 15 to 20 minutes.\n",
        "picture_link": "nhmvOlUKtWlU3nkJqcmc8HLELbdgsKS"
    },
    {
        "title": "Lee's Salmon Baste",
        "ingredients": [
            "3/4 cup Catalina salad dressing ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "1 pinch dried dill weed ADVERTISEMENT",
            "6 (4 ounce) fillets salmon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nWhisk Catalina salad dressing, melted butter, lemon juice, Worcestershire sauce, brown sugar, garlic powder, onion powder, and dill together in a bowl. Brush over the salmon fillets.\nCook salmon on the preheated grill, basting regularly with the sauce, until the flesh flakes easily with a fork, about 15 minutes.\n",
        "picture_link": "jD7hbC4EFi.5BMR8zwdSz5g0jX5DTCe"
    },
    {
        "title": "Primo Pasta Salad",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "1 (16 ounce) package rotini pasta ADVERTISEMENT",
            "3 hard-boiled eggs, chopped ADVERTISEMENT",
            "1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped (reserve marinade) ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "1/2 cup diced fully cooked ham ADVERTISEMENT",
            "1/2 cup diced cooked shrimp ADVERTISEMENT",
            "1/2 cup frozen green peas, thawed ADVERTISEMENT",
            "1/2 cup small Cheddar cheese cubes ADVERTISEMENT",
            "1/2 cup small Monterey Jack cheese cubes ADVERTISEMENT",
            "1/3 cup diced dill pickle ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 (1 ounce) package ranch dressing mix, or to taste (optional) ADVERTISEMENT",
            "1 tablespoon mustard ADVERTISEMENT",
            "1 dash hot pepper sauce (such as Tabasco®), or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook the rotini at a boil until tender yet firm to the bite, about 8 minutes; drain. Rinse with cold water until completely cooled; drain.\nMix pasta, eggs, artichoke hearts, celery, bell pepper, onion, ham, shrimp, peas, Cheddar cheese, Monterey Jack cheese, pickle, and olive together in a large bowl.\nWhisk sour cream, mayonnaise, apple cider vinegar, sugar, ranch dressing mix, mustard, and hot pepper sauce together in a separate bowl; season with salt and black pepper.\nDrizzle dressing over salad and toss to coat. Cover bowl with plastic wrap and chill in refrigerator 3 hours to overnight. Stir enough of the reserved artichoke marinade into the salad so it is just moistened before serving.\n",
        "picture_link": "oXYTZ9FUY2dhyTb5Q67LRxZhlzNAX.W"
    },
    {
        "title": "Aunt Barbara's Strawberry Pie",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 tablespoon unflavored gelatin ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup chopped strawberries ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine graham cracker crumbs, 1/4 cup sugar, and melted butter in a mixing bowl; mix until evenly moistened and press into the bottom and sides of a 9-inch pie pan.\nBake in the preheated oven until the crust is lightly browned and smells toasted, about 12 minutes. Remove from the oven and cool.\nSoak gelatin in cold water for 3 minutes. Heat the water and gelatin in the top of a double boiler set over simmering water, stirring frequently, until gelatin is completely dissolved.\nBeat whipping cream in a chilled glass or metal bowl until soft peaks form.\nStir strawberries and 1/3 cup sugar together in a bowl. Pour gelatin mixture over strawberries. Gently fold in whipped cream until incorporated. Pour filling into baked pie shell and chill in the refrigerator until set, at least 2 hours.\n",
        "picture_link": "rPxmhu6ULSKEkEa.bahtVOjnzbPLtce"
    },
    {
        "title": "Quinoa Pasta Salad with Artichoke Hearts",
        "ingredients": [
            "3 (8 ounce) packages quinoa pasta ADVERTISEMENT",
            "3 cups broccoli florets ADVERTISEMENT",
            "1 1/2 cups chopped carrots ADVERTISEMENT",
            "2 (6.5 ounce) jars marinated artichoke hearts, undrained ADVERTISEMENT",
            "1 (8 ounce) bottle Italian salad dressing ADVERTISEMENT",
            "1 cup grape tomatoes ADVERTISEMENT",
            "1 cup chopped cucumber ADVERTISEMENT",
            "1 (8 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "2 (2.25 ounce) cans sliced ripe olives, drained ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook quinoa pasta in boiling water for 2 minutes; add broccoli and carrots to the water. Continue cooking pasta and vegetables until pasta is cooked through but firm to the bite, 4 to 7 minutes; drain. Rinse with cold water until cool; drain. Transfer pasta mixture to a large mixing bowl.\nToss artichoke hearts with marinade, Italian salad dressing, grape tomatoes, cucumber, feta cheese, olives, and parsley with the pasta mixture. Cover bowl with plastic wrap and refrigerate 2 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken on Rice with Stuffing",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 teaspoons ground mixed peppercorns ADVERTISEMENT",
            "2 cups cooked white rice ADVERTISEMENT",
            "1/2 (1 ounce) package dry onion soup mix, or to taste ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 (6 ounce) package stuffing mix ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nCoat chicken with melted butter in a 9x13-inch baking pan; sprinkle both sides of chicken with pepper.\nSpread cooked rice evenly into a separate 9x13-inch baking pan; sprinkle onion soup mix over rice. Pour 1 1/2 cups water over seasoned rice. Layer onion on rice where the chicken breasts will be placed.\nMix cream of chicken soup, sour cream, milk, celery seed, and garlic powder in a bowl. Drop small spoonfuls of half the soup mixture onto rice; lightly spread mixture evenly over rice.\nArrange chicken breasts, thickest parts toward the pan's edge, on the prepared onion sections atop the rice. Spoon remaining half of soup mixture over chicken.\nMix stuffing mix and 1 cup hot water together in a bowl; spoon stuffing over chicken and rice. Cover pan tightly with aluminum foil.\nBake in the preheated oven until chicken is no longer pink in the center and the juices run clear, about 1 hour. An instant-read thermometer inserted into the thickest piece should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Applejack Brandy Cider",
        "ingredients": [
            "4 fluid ounces apple cider ADVERTISEMENT",
            "1 fluid ounce brandy (such as Laird's® AppleJack) ADVERTISEMENT",
            "1/2 fluid ounce butterscotch schnapps ADVERTISEMENT",
            "1/2 fluid ounce cinnamon schnapps ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix apple cider, brandy, butterscotch schnapps, cinnamon schnapps in a saucepan over low heat until heated through, about 5 minutes. Pour drink into a mug and stir with a cinnamon stick.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Homemade Raspberry Sauce for Pancakes or Crepes",
        "ingredients": [
            "1 cup frozen raspberries ADVERTISEMENT",
            "4 teaspoons white sugar, or more to taste ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine raspberries, sugar, and vanilla extract in a heavy-bottom saucepan; bring to a boil. Lower temperature to medium-low and simmer, stirring often, until sauce is thick and smooth, about 15 minutes.\n",
        "picture_link": "35Ozs2bOruu5uAEILmbXVXySOtCTlAO"
    },
    {
        "title": "Mixed Fruit Smoothie with Goji Berries",
        "ingredients": [
            "1 cup frozen mixed fruit ADVERTISEMENT",
            "1 cup vanilla soy milk ADVERTISEMENT",
            "2 tablespoons dried goji berries ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend fruit, soy milk, goji berries, and honey together in a blender until smooth.\n",
        "picture_link": "XoLpsmhNkuUWLGIWBpi/D4CJW8PmPci"
    },
    {
        "title": "Old-Fashioned Cushaw Pie",
        "ingredients": [
            "1 large cushaw squash - peeled, seeded, and chopped ADVERTISEMENT",
            "3 cups heavy whipping cream ADVERTISEMENT",
            "1 1/2 cups clover honey ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "5 teaspoons ground cinnamon ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "2 teaspoons salt, divided ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/4 teaspoon nutmeg ADVERTISEMENT",
            "2 cups hard white flour, or more as needed ADVERTISEMENT",
            "12 2/3 tablespoons butter, softened ADVERTISEMENT",
            "7 tablespoons ice-cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add squash, cover, and steam until very tender, 15 to 20 minutes.\nBlend squash in a blender until smooth. Pour 6 cups squash puree into a large mixing bowl. Reserve any extra squash puree for a separate use.\nStir cream, honey, eggs, molasses, cinnamon, ginger, 1 teaspoon salt, allspice, and nutmeg into 6 cups squash puree; whisk until smooth. Cover and set aside.\nMix flour and 1 teaspoon salt together in a bowl. Cut butter into flour mixture; add water and mix well. Add more flour to dough if it is too wet. Cut dough in half and roll onto a floured work surface; form into two 10-inch circles. Press dough into 2 pie pans and pour squash filling into each.\nBake in the preheated oven until a knife inserted in the center comes out clean, 40 to 50 minutes. Cool slightly before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sunflower Banana Oatmeal",
        "ingredients": [
            "1 3/4 cups water ADVERTISEMENT",
            "1/4 teaspoon Himalayan pink salt ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "3 large ripe bananas, mashed ADVERTISEMENT",
            "3 tablespoons sunflower seed butter ADVERTISEMENT",
            "2 tablespoons agave nectar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and salt to a boil in a saucepan; add oats and simmer until desired consistency is reached, about 5 minutes. Remove saucepan from heat and stir in bananas, sunflower seed butter, and agave nectar.\n",
        "picture_link": "mReqW1tXGr/tGOZH6kIQ8JV9.nBjdny"
    },
    {
        "title": "Savory Pumpkin Pasta Sauce",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 large green onions, minced ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/2 cup dried parsley, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat; cook and stir green onions and garlic until tender, about 3 minutes. Reduce heat to low and stir in pumpkin puree; cook for 2 minutes.\nMix milk, water, salt, cumin, white pepper, and allspice into pumpkin mixture and simmer over low heat until heated through, about 5 minutes. Remove from heat and stir in parsley.\n",
        "picture_link": "s01xMlq3l918m0/ZAQ0pwCT44R9k2I."
    },
    {
        "title": "Spicy Cranberry Salsa",
        "ingredients": [
            "2 cups chopped cranberries ADVERTISEMENT",
            "1 small apple - peeled, cored, and finely chopped ADVERTISEMENT",
            "1 orange - peeled, sectioned, seeded, and finely chopped ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 shallot, finely chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and finely chopped, or more to taste ADVERTISEMENT",
            "1 green onion, thinly sliced ADVERTISEMENT",
            "1 tablespoon freshly squeezed lime juice ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cranberries, apple, orange, sugar, shallot, jalapeno pepper, green onion, lime juice, and vinegar together in a bowl. Cover bowl with plastic wrap and refrigerate for flavors to blend, 4 to 24 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rosemary Orange Pound Cake",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 teaspoons grated orange zest ADVERTISEMENT",
            "1 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and lightly flour a 9x5-inch loaf pan.\nWhisk flour, baking powder, and baking soda together in a bowl.\nBeat butter in a bowl using an electric mixer until smooth and creamy, about 30 seconds. Gradually beat sugar into butter until light and fluffy; add vanilla extract and beat until incorporated. Beat eggs, 1 at a time, into creamed butter mixture, beating about 1 minute after each addition.\nBeat flour mixture, alternating with sour cream, into creamed butter mixture with the electric mixer on low until batter is just combined. Stir orange zest and rosemary into batter; pour into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 70 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "bZeMDQBKNIrsVyR13hDlvzTsVF/NzX."
    },
    {
        "title": "Butternut Apple Soup",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "2 small apples - peeled, cored, and diced ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/2 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "1 (12 ounce) box frozen butternut squash ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon dried tarragon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a heavy skillet over medium heat. Cook shallot in hot oil until softened; add apples and saute until hot, about 1 minute. Transfer apple mixture to a stockpot.\nPour chicken broth and water into the stockpot; add nutmeg, allspice, cinnamon, and pepper. Bring the mixture to a boil, reduce heat to medium-low, and simmer until the apples are tender, about 15 minutes.\nStir butternut squash into the liquid. Bring mixture to a gentle boil while stirring occasionally. Stir half-and-half, butter, and tarragon into the liquid; cook, stirring continually, until the butter melts and the liquid is about to boil, about 5 minutes.\n",
        "picture_link": "IrX9fnkSuXinHTdJRsuyB5bumIgjt9C"
    },
    {
        "title": "Gluten Free NO-Hassle Holiday Stuffing",
        "ingredients": [
            "2 loaves gluten-free bread, cut into 3/4-inch cubes ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "3 large apples - peeled, cored, and cut into 1/2-inch chunks ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 teaspoons poultry seasoning, or more to taste ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C).\nSpread bread cubes onto 2 baking sheets.\nBake in the preheated oven until completely dry, about 2 hours. Transfer bread cubes to a large bowl.\nMelt 1/2 cup butter in a large saucepan over medium heat; saute onions, apples, and celery, stirring occasionally, until tender, about 10 minutes. Add chicken broth and poultry seasoning and simmer until flavors blend, about 5 minutes. Pour mixture over bread cubes and toss to coat; season with salt and pepper. Cover bowl with plastic wrap and set aside for liquid to absorb, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove cover from bowl and transfer bread cube mixture to a 9x13-inch casserole dish. Drizzle 1/2 cup melted butter over bread cube mixture.\nBake in the preheated oven until golden brown, about 20 minutes.\n",
        "picture_link": "oWKhQC0Hxa3L0l1GQBDCuD4Z3zxM3Ou"
    },
    {
        "title": "Savory Curried Chicken, Wild Rice, and Apple Soup",
        "ingredients": [
            "1/2 cup slivered almonds ADVERTISEMENT",
            "4 cups chopped cooked chicken ADVERTISEMENT",
            "1/2 cup mango chutney ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "3 stalks celery, finely chopped ADVERTISEMENT",
            "3 cloves garlic, minced - or more to taste ADVERTISEMENT",
            "1 (28 ounce) can chopped tomatoes in juice ADVERTISEMENT",
            "1 cup golden raisins ADVERTISEMENT",
            "2 tablespoons Madras curry powder ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "8 cups chicken stock ADVERTISEMENT",
            "2 cups cooked wild rice ADVERTISEMENT",
            "2 apples, cored and chopped ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSpread almonds onto a baking sheet with edges.\nToast almonds in preheated oven, stirring every 2 minutes, until lightly browned, 5 to 10 minutes; transfer to a large bowl. Add chicken and mango chutney to the bowl; stir.\nMelt butter with olive oil in a large stock pot or Dutch oven over medium-high heat. Cook and stir onion, celery, and garlic in melted butter until onions begin to soften, about 5 minutes. Add tomatoes with juice and raisins; continue to cook, stirring frequently, until the raisins plump, about 10 minutes. Season the mixture with curry powder and cayenne pepper; stir.\nPour chicken stock into the pot; add the chicken mixture, wild rice, apples, parsley, and lemon juice. Bring the mixture to a boil, reduce heat to medium-low, and simmer until the apples are tender yet retain some crispiness, about 5 minutes. Season soup with salt and pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mac's Magnificent Meatloaf",
        "ingredients": [
            "Loaf: ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3/4 cup diced yellow onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3/4 cup diced green bell pepper ADVERTISEMENT",
            "2 1/2 pounds ground sirloin ADVERTISEMENT",
            "1 cup seasoned bread crumbs ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 egg, well beaten ADVERTISEMENT",
            "1/2 cup oats (optional) ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/8 teaspoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 9x13-inch baking pan.\nMelt butter in a saucepan over medium heat; saute onion and garlic until onion is translucent, 5 to 10 minutes. Add green bell pepper to onion mixture and saute until bell pepper is softened, about 3 more minutes.\nMix sirloin, bread crumbs, salt, and black pepper together in a large bowl with your hands; add vegetable mixture and loosely mix. Mix egg into sirloin mixture; add oats if mixture is too wet. Transfer sirloin mixture to the prepared baking pan and form into a loaf.\nBake in the preheated oven for 20 minutes. Whisk ketchup, sugar, honey, and hot sauce together in a bowl; brush over meat loaf. Continue baking until no longer pink in the center, about 40 more minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Let stand for 10 minutes before slicing.\n",
        "picture_link": "X6hYdEaXDW9y9LgzadSQB8wow3wiMdS"
    }
]