[
    {
        "title": "Hermits with Wine",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2 cups white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper.\nPlace the raisins or chopped dates in a bowl and cover with white wine. Set aside to soak.\nCream the shortening with the brown and white sugar until light and fluffy. Beat in the eggs and lemon and or vanilla extracts.\nStir the flour, cinnamon and salt together.\nDissolve the baking soda in 1/3 cup of the wine and beat it into the shortening mixture. Stir in the flour. Drain the soaked raisins and stir them and the walnuts into the dough.\nDrop tablespoonfuls of the dough onto the prepared baking sheets. Bake at 375 degrees F (190 degrees C) for about 10 minutes.\n",
        "picture_link": "5qpje2pkezOr5WAbF5hTQCqiSK6uINi"
    },
    {
        "title": "Christmas Orange Rind Cut-Out Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 teaspoons orange zest ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/3 cup finely chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream butter and 1 1/4 cups of the sugar. Add eggs, one at a time, beating well after each.\nSift flour and baking powder together. Add flour mix to the butter mixture alternately with the sour cream. Blend very well and add the orange zest. Wrap tightly and chill overnight.\nPreheat oven to 375 degrees F (190 degrees C). Lightly grease baking sheets.\nTurn chilled dough out on to a floured surface and roll out to 1/4 inch thick. Cut into desired shapes.\nCombine the 1/3 cup white sugar and the finely chopped almonds and sprinkle over the tops of the cookies. Place cookies on the prepared baking sheet and bake at 375 degrees F (190 degrees C) for 10 to 12 minutes. Remove from oven and let cookies cool on rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tunisian Kaftaji",
        "ingredients": [
            "2 zucchinis, thinly sliced ADVERTISEMENT",
            "2 yellow squash, thinly sliced ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "3 potatoes, peeled and cut into strips ADVERTISEMENT",
            "2 hot chile peppers, chopped ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 1/2 tablespoons harissa ADVERTISEMENT",
            "1 tablespoon water, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a nonstick skillet over medium heat. Cook the zucchini, yellow squash, tomatoes, potatoes, and chile peppers, stirring occasionally, until the vegetables are tender, about 20 minutes. Transfer the vegetables to a bowl and set aside.\nReturn the skillet to the burner over medium heat. Crack the eggs into the skillet and fry them until the whites are set but the yolk is still runny, about 5 minutes. Add the eggs to the bowl of vegetables and season with salt and pepper.\nUsing two knives, cut into the eggs and vegetables, mincing the mixture up into small pieces until well blended. It will look mushy.\nIn a separate bowl, mix the harissa with water, one teaspoon at a time, until the mixture is pourable but still thick. Pour the harissa over the kaftaji and serve.\n",
        "picture_link": "iNGvruZI0h/BLNmOkf/jgyCkEv.j0Mm"
    },
    {
        "title": "Funky Monkey",
        "ingredients": [
            "4 cups hot, brewed dark roast coffee ADVERTISEMENT",
            "1 large banana ADVERTISEMENT",
            "1/4 cup fat free sweetened condensed milk ADVERTISEMENT",
            "3 tablespoons chocolate syrup ADVERTISEMENT",
            "1 1/2 scoops vanilla flavored whey protein powder ADVERTISEMENT",
            "20 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the hot coffee, banana, condensed milk, chocolate syrup, and protein powder into a blender. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the coffee moving before leaving it on to puree until smooth. Divide ice cubes into 4 large glasses, and pour coffee mixture over the ice.\n",
        "picture_link": "FZ5kg.48mF6zOPZuQ.lSvZHPr2fOuZa"
    },
    {
        "title": "Delicious Apple Pie Bars",
        "ingredients": [
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup butter, softened but not melted ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/3 cup milk, or as needed ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "6 large apples - peeled, cored, and sliced ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 egg white, beaten until foamy ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 dash almond extract, or to taste ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nWhisk together the flour and salt in a large mixing bowl. Cut in the softened butter with a knife or pastry blender until the mixture resembles coarse crumbs. Whisk together the egg yolks in a liquid measuring cup, then add enough milk to reach 2/3 cup of liquid. Gradually stir into the flour mixture until moistened. Turn the dough out onto a lightly floured surface and knead briefly. Roll about half of the dough out to fit the prepared baking dish. Place the bottom crust in the baking dish. Sprinkle the oats evenly over the crust. Roll out the top crust, and set aside.\nMix the cornstarch and lemon juice together until smooth. Heat the cornstarch mixture in a large skillet with the apples, white sugar, brown sugar, cinnamon, and nutmeg over medium heat until the apples are tender, about 15 minutes. Remove from heat, and allow to cool slightly. Spread the apple filling evenly over the oats. Cover the filling with the top crust. Pinch the edges together to seal the crusts, and brush with egg white. Cut a few slits on the top crust to vent.\nBake in the preheated oven until golden brown and the filling has thickened, about 50 minutes.\nWhile pie is baking, prepare the glaze by beating the confections' sugar with 1 tablespoon of milk in a small bowl. Stir in the almond extract. Drizzle the glaze over the warm pie. Mix 1 teaspoon of sugar and 1/2 teaspoon of cinnamon together in a small bowl, and sprinkle cinnamon sugar over the glaze. Cool completely before cutting into bars.\n",
        "picture_link": "LAM9GGEkBzU7mZ16oF.0qw12TbUwYKq"
    },
    {
        "title": "Apricot Crumble",
        "ingredients": [
            "8 cups fresh apricots, pitted and coarsely chopped ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "4 cups rolled oats ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 cup heavy cream, whipped (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nToss the apricots with the lemon juice in a bowl; set aside. Combine oats, brown sugar, cinnamon, cloves, and nutmeg in a bowl. Cut in the butter with a knife or pastry blender until mixture resembles coarse crumbs. Set 2 cups of the oat mixture aside in a bowl. Mix the water into the remaining oat mixture until well blended; pat mixture into the prepared baking dish to make a crust. Spread the apricots evenly over the crust, and top with the reserved crumble mixture.\nBake in the preheated oven until the topping is lightly browned, 35 to 40 minutes. Served hot with whipped cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Plum Oat Muffins",
        "ingredients": [
            "1 1/2 cups chopped fresh plums ADVERTISEMENT",
            "1/4 cup water, or as needed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1 cup oat bran ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups.\nPlace the plums into a bowl; pour in water just to cover the plums. Stir in egg and molasses until the mixture is well combined. In another bowl, stir together the oat bran, rolled oats, whole wheat flour, baking powder, baking soda, and cinnamon until thoroughly mixed. Pour the plum mixture into the dry ingredients and mix just until moistened. Spoon the batter into the prepared muffin cups.\nBake in the preheated oven until the muffins have risen and a toothpick inserted into the center of a muffin comes out clean, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Limeabalemon Glaciate",
        "ingredients": [
            "1 1/2 cups crushed ice ADVERTISEMENT",
            "1 ripe banana ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon shredded coconut, as garnish (optional) ADVERTISEMENT",
            "2 pitted cherries, as garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the ice and banana together in a blender set to Low until mixed, adding the lime juice and lemon juice as it blends to keep the ice from freezing to the side of the blender. Serve in a tall glass and garnish with coconut or a cherry.\n",
        "picture_link": "6LRRMCIW4I0JHKphbHdk0K2Y.u3nDVS"
    },
    {
        "title": "Summer Fruit Salad",
        "ingredients": [
            "1 fresh pineapple - peeled, cored, and chopped ADVERTISEMENT",
            "1/2 cantaloupe - peeled, seeded, and chopped ADVERTISEMENT",
            "2 fresh peaches, pitted and chopped ADVERTISEMENT",
            "3 plums, pitted and chopped ADVERTISEMENT",
            "2 bananas, chopped ADVERTISEMENT",
            "2 oranges, peeled and cut into bite size pieces ADVERTISEMENT",
            "2 kiwi fruit, peeled and chopped ADVERTISEMENT",
            "2 fresh apricots, pitted and chopped ADVERTISEMENT",
            "10 cherries, pitted and halved ADVERTISEMENT",
            "15 seedless grapes ADVERTISEMENT",
            "7 strawberries, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large salad bowl, lightly stir together the pineapple, cantaloupe, peaches, plums, bananas, oranges, kiwi fruit, apricots, cherries, grapes, and strawberries; chill for 1 hour before serving.\n",
        "picture_link": "CJ3v8WsQsXjMXMGhanPVFXQ4BmdN4US"
    },
    {
        "title": "Sweet and Sour Asparagus",
        "ingredients": [
            "2 pounds fresh asparagus, trimmed ADVERTISEMENT",
            "3/4 cup distilled white vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 cinnamon sticks ADVERTISEMENT",
            "1 teaspoon whole cloves ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add the asparagus, and cook uncovered until slightly tender, about 1 minute. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the asparagus spears are cold, place them on paper towels to dry.\nBring vinegar, water, sugar, cinnamon sticks, cloves, celery seed, and salt to a boil in a saucepan over medium-high heat. Boil for 5 minutes.\nSpread the asparagus spears in a large dish or baking pan. Pour the vinegar mixture over the asparagus. Cover and refrigerate for 8 hours or overnight. Drain and serve cold or at room temperature.\n",
        "picture_link": "ALhSPC2iu7HTTB5BHOW.3eXWa0OqwlC"
    },
    {
        "title": "Beef and Veggie Stew with Dumplings",
        "ingredients": [
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "1 (14 ounce) can whole kernel corn, undrained ADVERTISEMENT",
            "1 (15 ounce) can peas, undrained ADVERTISEMENT",
            "1 (15 ounce) can green beans, drained ADVERTISEMENT",
            "1 (13.5 ounce) can spinach, undrained ADVERTISEMENT",
            "4 cubes beef bouillon ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch garlic and herb seasoning blend (such as Mrs. Dash®), or to taste ADVERTISEMENT",
            "1 (16.3 ounce) can refrigerated biscuits (such as Pillsbury Grands®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the beef with salt and black pepper; heat the margarine in a skillet over low heat, and cook the beef, stirring occasionally, until the meat is browned and tender, about 45 minutes.\nWhile the beef is cooking, place the tomato soup, corn, peas, beans, spinach, beef bouillon cubes, water, garlic powder, and garlic herb seasoning in a large, heavy saucepan, and bring to a boil over medium heat. Reduce heat to a simmer, then add the stew beef. Simmer to blend the flavors, about 30 minutes.\nCut each biscuit into quarters, flatten slightly, and gently stir the dumplings into the stew. Simmer uncovered for 10 minutes, then cover the stew and simmer 10 more minutes.\n",
        "picture_link": "Aao554YklhnEcIoOzgD2aOmEbUNowwy"
    },
    {
        "title": "Brown Rice Belgian Endive Salad",
        "ingredients": [
            "1/2 cup uncooked brown rice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 head Belgian endive, chopped ADVERTISEMENT",
            "1/8 red onion, finely chopped ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the brown rice and water to a boil in a saucepan. Reduce heat to medium-low; cover the saucepan and simmer until the rice is tender and the liquid has been absorbed, 45 to 50 minutes. Allow the rice to cool.\nPlace the rice, endive, and red onion in a large bowl. Drizzle the balsamic vinegar and olive oil on top, and season with salt and pepper. Mix thoroughly.\n",
        "picture_link": "wbC/nUJxB6ohY/y62Tntt1G2BSHx0x6"
    },
    {
        "title": "My Aunt's Banana Bread",
        "ingredients": [
            "3 ripe bananas, mashed ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "1/2 cup chocolate chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\nStir the bananas and vinegar together in a bowl, and set aside. Cream the sugar and butter together in a large bowl until creamy and smooth, then beat in the eggs. Stir in the reserved banana mixture. In a separate bowl, stir the flour, baking soda, baking powder, and salt together until the mixture is free of lumps. Mix the flour mixture into the butter-sugar mixture until well blended, and stir in the chopped walnuts and chocolate chips. Spread the batter into the prepared loaf pan.\nBake in the preheated oven until lightly browned and a toothpick inserted into the center of the loaf comes out clean, 50 to 60 minutes. Let cool in pan about 5 minutes, then turn out onto a wire rack.\n",
        "picture_link": "jcD2869fg5izOIhPfmyl5hgxiy2TaDa"
    },
    {
        "title": "Tangy Plum Liqueur",
        "ingredients": [
            "16 cups black or red plums, pitted and cut into eighths ADVERTISEMENT",
            "3 1/4 cups white sugar, divided ADVERTISEMENT",
            "3 cups 100 proof vodka ADVERTISEMENT",
            "1 1/2 tablespoons vanilla extract, divided ADVERTISEMENT",
            "1 orange peel in pieces, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer half the plums into the bottom of a very large jar with a lid, pressing the plums down as tightly as possible. Pour half the sugar over the plums, then half the vodka over the sugar. Sprinkle on half the vanilla extract, and place about half the orange peel pieces into the jar. Layer the rest of the plums into the jar, pressing them down, and top them with the remaining sugar, vodka, vanilla extract, and orange peel pieces. Screw on the jar lid.\nUsing an unscented candle, drip a coating of wax around the jar lid to prevent leaking. Cover the jar with a dark-colored towel. Place the jar on its side in a dark, cool place, and turn the jar every day for 21 days, replacing the towel to keep out light.\nAfter 21 days, strain out the liqueur from the plums and peel with a fine strainer lined with cheesecloth, and bottle the liqueur in attractive bottles with tight-fitting caps.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fruit Crumble",
        "ingredients": [
            "3 apples - peeled, cored and sliced ADVERTISEMENT",
            "3 fresh peaches - peeled, pitted, and sliced ADVERTISEMENT",
            "3 ripe plums, peeled, pitted and sliced ADVERTISEMENT",
            "4 large strawberries, sliced ADVERTISEMENT",
            "1 tablespoon white sugar (optional) ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup apricot nectar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup quick-cooking rolled oats ADVERTISEMENT",
            "1/2 cup graham cracker crumbs ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nScatter the apples, peaches, plums, and strawberries into the bottom of the prepared baking dish, mixing the fruit well. Sprinkle with 1 tablespoon of sugar and 1/2 teaspoon of cinnamon if desired. Pour the water over the fruit.\nMix together the butter, 1 cup of sugar, the apricot nectar, flour, rolled oats, graham cracker crumbs, and 1 tablespoon of cinnamon in a bowl until the mixture is crumbly and well combined. Sprinkle the crumbly mixture over the pan of fruit.\nBake in the preheated oven until the topping is lightly browned and the fruit is tender, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cucumber Salad with Smoked Salmon",
        "ingredients": [
            "1 cup plain Greek yogurt ADVERTISEMENT",
            "1 cup light sour cream ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "2 tablespoons chopped fresh dill, or to taste ADVERTISEMENT",
            "2 tablespoons capers, chopped ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1/2 teaspoon white vinegar, or to taste ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "2 large cucumbers, peeled and sliced ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "1 (3 ounce) package smoked salmon, flaked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large salad bowl, stir together the yogurt, sour cream, lemon juice, dill, capers, shallot, and white vinegar until smooth. Season to taste with salt and pepper. Lightly toss cucumbers and tomatoes in the dressing until coated, and very gently stir in the smoked salmon. Refrigerate until serving time.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Merry Mango Sauza®-Rita",
        "ingredients": [
            "8 ounces Sauza® Blanco Tequila ADVERTISEMENT",
            "8 ounces Cruzan® Mango Rum ADVERTISEMENT",
            "8 ounces fresh lemon sour (equal parts lemon juice, water and sugar) ADVERTISEMENT",
            "8 ounces diet lemon lime soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour Sauza Blanco Tequila into pitcher with ice. Then add 4 oz Cruzan Mango and 8 oz fresh lemon sour and pour into pitcher. Lastly, add 8 oz (diet) lemon-lime soda, stir and serve over ice. Makes 7 delicious drinks, perfect for any ladies night in.\n",
        "picture_link": "kQ2mfxIxVCCmVAxKDbdXJlqcaePBA5y"
    },
    {
        "title": "Jen's Nine Layer Dip",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 slices lean bacon, chopped ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1 teaspoon taco seasoning mix ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup prepared guacamole ADVERTISEMENT",
            "1 cup diced tomatoes ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons sliced black olives ADVERTISEMENT",
            "2 tablespoons finely sliced green onions ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken, 1 1/2 tablespoons of cilantro, and vegetable oil in a skillet over medium heat, and pan-fry the chicken breasts until lightly golden brown, no longer pink in the middle, and the juices run clear, about 5 minutes per side. Remove the chicken and set aside. When cooled, cut into cubes.\nPlace the bacon in the same skillet, and cook over medium-high heat, stirring often, until evenly browned, about 10 minutes. Mix the refried beans into the skillet with the bacon, and cook, stirring frequently, until the beans are hot and bubbling, 5 to 10 minutes. Mix the taco seasoning and sour cream together in a bowl.\nTo assemble, spread the hot bean and bacon mixture into the bottom of an 8x8-inch glass dish. Sprinkle the chicken cubes over the bean mixture, then follow with these layers: 3/4 cup of Cheddar cheese, guacamole, sour cream mixture, and sliced tomatoes. Sprinkle the top with 1 1/2 tablespoons of cilantro, black olives, green onions, and 1/4 cup of shredded cheddar cheese.\n",
        "picture_link": "C1W4kuHcQVIyFi8DJLnkpL2Tb3LF48G"
    },
    {
        "title": "Basil Puree",
        "ingredients": [
            "1 bunch basil, leaves picked from stems ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 teaspoon balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make a paste by crushing basil leaves and salt with a mortar and pestle. Stir in the olive oil and balsamic vinegar.\n",
        "picture_link": "khvqYzDNB7Dckc/SHgy52HyiFu38J4i"
    },
    {
        "title": "Delish Lime and Corn Pasta Salad",
        "ingredients": [
            "1/2 (16 ounce) package uncooked rotini pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup red onion, finely chopped ADVERTISEMENT",
            "4 ears fresh sweet corn, kernels cut from the cob ADVERTISEMENT",
            "2 limes, zested and juiced ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the rotini, and return to a boil. Cook uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink.\nHeat the butter in a large skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Mix in the corn, lime zest, and lime juice. Season with cayenne pepper, salt, and pepper. Continue cooking until corn is warmed through and tender. Toss pasta with the corn mixture and Cheddar cheese. Serve hot, or cover and refrigerate and serve as a cold salad.\n",
        "picture_link": "SjAUMMb74giTxq1H5hd..fODXoVnD0e"
    },
    {
        "title": "Ginger Snapper",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup soy sauce ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger root, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (2 pound) whole snapper fillet ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a large sheet of aluminum foil with cooking spray.\nThoroughly mix the soy sauce, honey, ginger, and garlic in a large bowl. Dip both sides of the fish into the soy sauce mixture, and place onto the aluminum foil. Spoon a little more sauce over the top of the fish. Roll up the aluminum foil to completely enclose the fillet.\nBake in the preheated oven until the fish is opaque and flakes easily, about 20 minutes.\n",
        "picture_link": "iPmmeKoric95.TxMPw3.l6rAX6Vp1sy"
    },
    {
        "title": "Fizzy Lifting Drink",
        "ingredients": [
            "3 fluid ounces bubblegum-flavored vodka ADVERTISEMENT",
            "1 fluid ounce sweet and sour mix ADVERTISEMENT",
            "1/2 fluid ounce vanilla vodka ADVERTISEMENT",
            "1/2 fluid ounce strawberry vodka ADVERTISEMENT",
            "1 dash maraschino cherry juice ADVERTISEMENT",
            "2 fluid ounces dry champagne ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the bubble gum vodka, sweet and sour mix, vanilla vodka, strawberry vodka, and maraschino cherry juice into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into two chilled glass, and top with champagne to serve.\n",
        "picture_link": "DAAk28AehonvzBR2AJdhgfOnB8zZ5Im"
    },
    {
        "title": "Grilled Game Hens with Blood Orange and Rosemary",
        "ingredients": [
            "2 Cornish game hens ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 blood orange, juiced ADVERTISEMENT",
            "1 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "6 sprigs fresh rosemary ADVERTISEMENT",
            "1 tablespoon Asian chili garlic sauce ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place game hens in a large bowl; drizzle hens with olive oil and blood orange juice. Sprinkle with chopped rosemary and rosemary sprigs. Add Asian chili paste to hens; season with salt and pepper. Stir chickens in the seasonings and juice to coat. Use your fingers to loosen the skin over the breasts and spread a little of the marinade under the skin.\nRefrigerate with breast sides down for 2 hours to marinate.\nPreheat outdoor grill (preferably charcoal) for medium heat (one layer of coals). Drain chickens and discard marinade.\nPlace chickens with breast sides down onto grill and cover with grill lid with the vents open. Cook until breast sides are evenly browned, 7 to 10 minutes. Flip chickens and cook on their backs with cover (vents open) until the juices run clear, hip joints move easily, and meat is no longer pink inside. An instant-read meat thermometer inserted into the thickest part of a thigh reads at least 160 degrees F (70 degrees C), 30 to 35 more minutes.\nClose the grill vents on the lid halfway. Flip chickens back onto breasts, close lid, and cook for 2 to 3 more minutes.\n",
        "picture_link": "h6pXWG7FGlLnlD.NN8fzIO9tyFp45ce"
    },
    {
        "title": "Debbie's Zucchini Skillet Dinner",
        "ingredients": [
            "1 pound ground beef chuck ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 small zucchini, cubed ADVERTISEMENT",
            "2 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 cups seashell pasta ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat; cook and stir beef and garlic in skillet until beef is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease. Stir in zucchini, tomato sauce, oregano, and basil; bring to a boil. Cover, reduce heat to medium-low, and simmer until zucchini is tender, about 15 minutes. Season with salt and black pepper.\nMeanwhile, bring a large pot of lightly salted water to a boil. Cook shell pasta in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nStir pasta and whole tomatoes into zucchini mixture, breaking up tomatoes with a spoon. Continue to simmer until heated through, about 25 minutes more. Toss with Parmesan cheese.\n",
        "picture_link": "BeNghe3mSzGFDubJhgh7LlH2.H5FUzO"
    },
    {
        "title": "Kroppkakor - Swedish Potato Dumplings",
        "ingredients": [
            "1/4 pound salt pork, cubed ADVERTISEMENT",
            "1 small onion, coarsely chopped ADVERTISEMENT",
            "1 1/2 cups cold mashed potatoes ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 gallon water, or as needed ADVERTISEMENT",
            "2 (32 fluid ounce) containers beef broth (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fry salt pork with onion in a skillet until the salt pork is golden brown, about 10 minutes. Drain fat and set salt pork and onion mixture aside.\nMix mashed potatoes, egg, salt, black pepper, and nutmeg together in a bowl; stir 1 cup flour into potato mixture. Sprinkle 1 cup flour onto a work surface and turn the dough out onto the flour. Knead the flour on the work surface into the dough.\nCut dough into 12 equal pieces and roll into balls, dusting your hands and sprinkling work surface with remaining 1/2 cup flour. Press your thumb into each dumpling to make an indentation, and fill with a small amount of salt pork-onion mixture. Pinch the dumplings closed and roll in flour.\nBring water to a boil in a large pot. If desired, replace half the water with beef broth. Drop dumplings into the boiling water and broth and reduce heat to low. Simmer until cooked through, about 25 minutes. Drain and transfer to a serving bowl.\n",
        "picture_link": "Ta6bFuf1uXDN5Tqq2Evk49Wi9IWwi1u"
    },
    {
        "title": "Chef John's Mini Christmas Hams",
        "ingredients": [
            "Brine: ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup kosher salt ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 teaspoon finely ground black pepper ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "1/2 yellow onion, chopped ADVERTISEMENT",
            "3 cloves garlic, peeled ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 quart water, or as needed ADVERTISEMENT",
            "4 (1 1/2 inches thick) boneless center-cut pork loin chops ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "12 whole cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1 1/2 cups boiling water, 3/4 cup brown sugar, 1/2 cup plus 1 tablespoon coarse kosher salt, black pepper, allspice, cloves, and bay leaf together in a large container; stir until the sugar and salt are dissolved. (See Cook's Note to substitute table salt.)\nPlace celery, onion, and garlic in a blender. Add 2 cups cold water and puree until smooth. Pour celery mixture into kosher salt mixture and stir to combine. Add 1 quart of water, or more as needed, to make a total of 2 quarts of brine. Place pork chops in brine, cover, and refrigerate for 2 days.\nCombine 1/4 cup brown sugar, Dijon mustard, and cayenne pepper together in a small bowl and set glaze aside.\nPreheat oven to 325 degrees F (165 degrees C).\nRemove pork chops from brine and pat dry; discard used brine. Cut shallow slits along the sides of each pork chop, about 1/4 inch deep. Cut a crisscross pattern in the top of each pork chop, creating small 1-inch triangles.\nHeat oil in a large, oven-proof skillet over high heat. Cook chops in the hot oil until browned, about 2 minutes on each side. Brush the crisscrossed top of each pork chop with about 1 tablespoon of glaze. Insert 3 whole cloves in the top of each pork chop.\nTransfer skillet to the preheated oven and roast pork chops until golden brown and slightly pink in the center, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove pork chops to a plate and discard cloves.\nUsing a small butane hand torch, brown the tops of the pork chops by making short passes over the tops with the flame not quite touching.\n",
        "picture_link": "IqCaooWokjqCbkFbQYKciuhkkcp/2rS"
    },
    {
        "title": "Creamy Celery Root Mash",
        "ingredients": [
            "2 pounds celeriac (celery root), peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "1/4 cup sour cream, or more to taste ADVERTISEMENT",
            "1/2 teaspoon dried dill weed, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place celeriac into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and transfer to a large bowl.\nMash celeriac, sour cream, and dill together in a large bowl with a potato masher until smooth. Season with salt and pepper.\n",
        "picture_link": "DL2LljYwbucNzmLcn/LtbELtvhIXBCi"
    },
    {
        "title": "Thai Inspired Spicy Curry Butternut Squash Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 chili moritas, or more to taste ADVERTISEMENT",
            "1 large white onion, diced ADVERTISEMENT",
            "5 carrots, peeled and diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons red curry paste, or to taste ADVERTISEMENT",
            "1 tablespoon smoked paprika ADVERTISEMENT",
            "1 large butternut squash - peeled, seeded, and diced ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large heavy-bottom pot over medium-high heat; add olive oil. Cook and stir chili moritas in the hot oil until chili moritas are puffed and softened, 3 to 5 minutes. Stir onion, carrots, celery, garlic, salt, and pepper into chili moritas and cook until onion is translucent, 10 to 15 minutes.\nStir curry paste and paprika into chili-onion mixture until coated. Add butternut squash; cook and stir until squash is lightly browned, about 5 minutes. Pour chicken stock, water, and coconut milk into squash mixture; add bay leaves. Bring mixture to a boil, reduce heat, and simmer until squash is softened, about 1 hour.\nPour squash mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\n",
        "picture_link": "H4GmR8ExQRXKnm8Da16iY3yejCC5xvS"
    },
    {
        "title": "Homestyle Garlic Ranch Dressing",
        "ingredients": [
            "2 cups mayonnaise ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 hard-boiled eggs, diced ADVERTISEMENT",
            "5 tablespoons sour cream ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 pinches kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, buttermilk, onion, vegetable oil, eggs, sour cream, parsley, garlic powder, pepper, and salt together in a bowl until dressing is creamy, about 30 seconds. Store dressing in a 1-quart jar in refrigerator for up to 1 week.\n",
        "picture_link": ".M7ULVit8cdxpcdrJP6nWeLE5JxC8/2"
    },
    {
        "title": "Light and Creamy Zucchini Soup",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 1/2 onion, diced ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "3 large zucchini, chopped small ADVERTISEMENT",
            "1 (14.5 ounce) can fat-free chicken broth ADVERTISEMENT",
            "1/2 (16 ounce) bag baby spinach leaves, chopped ADVERTISEMENT",
            "1 (10.75 ounce) can cream of potato soup ADVERTISEMENT",
            "1 quart fat free half-and-half ADVERTISEMENT",
            "1/2 cup grated Pecorino Romano cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a pot over medium heat. Cook and stir onion and carrots in hot oil until the onion is translucent, about 5 minutes. Add zucchini; continue cooking until the zucchini begins to soften, about 5 minutes more. Pour chicken broth over the zucchini mixture, place a cover on the pot, and bring to a boil and cook for 8 minutes. Stir spinach into the mixture; continue cooking until the zucchini is tender, about 2 minutes more.\nMash the zucchini mixture with a potato masher until a desired texture is achieved. Pour potato soup into the zucchini mixture; bring to a simmer and cook for 5 minutes. Stir half-and-half and Pecorino Romano cheese into the zucchini mixture; stir. Continue cooking until heated through completely, 2 to 3 minutes.\n",
        "picture_link": "hZoznjCwKGSUAakZ6D8J3FOC3BH.pvC"
    },
    {
        "title": "Oriental Spicy Chicken Wings",
        "ingredients": [
            "1/4 cup Asian chile paste (such as sambal oelek) ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 teaspoons chopped garlic ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 1/2 pounds jumbo chicken wings, tips removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk chile paste, fish sauce, soy sauce, garlic, ginger, and lime juice together in a bowl, and pour into a resealable plastic bag. Add chicken wings, coat with the marinade, squeeze out excess air, and seal the bag. Marinate, turning the bag several times, in the refrigerator for 3 hours to overnight.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate. Remove chicken wings from marinade and discard unused marinade.\nGrill chicken on the preheated grill until no longer pink at the bone and the juices run clear, 12 to 14 minutes.\n",
        "picture_link": "mY85WxbqKlznkaOuSnO2S9DL8rOenO2"
    },
    {
        "title": "Honey Vanilla Grilled Sweet Potatoes",
        "ingredients": [
            "2 large sweet potatoes, peeled and thinly sliced ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat.\nArrange sweet potatoes in a 9x13-inch aluminum foil pan. Stir butter and cinnamon together in a bowl and drizzle over potatoes. Cover pan with aluminum foil.\nBake sweet potatoes on the preheated grill, stirring occasionally, for 15 minutes. Stir honey and vanilla extract together in a bowl and drizzle over sweet potatoes. Return aluminum foil to cover pan. Continue cooking on the grill until sweet potatoes are tender, about 10 more minutes.\n",
        "picture_link": "7c97Guk9sIKySmXa3.XX7U4DdApHhR2"
    },
    {
        "title": "Slow Cooker Chili with Beer",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 (29 ounce) can tomato sauce ADVERTISEMENT",
            "1 (29 ounce) can kidney beans, undrained ADVERTISEMENT",
            "1 (29 ounce) can pinto beans, undrained ADVERTISEMENT",
            "2 cups beer ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (4.5 ounce) can chopped green chilies ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Crumble ground beef into the skillet; add onion. Cook and stir until the beef is crumbly and completely browned, 7 to 10 minutes. Drain and discard any excess grease. Transfer beef and onion to a slow cooker.\nStir tomato sauce, kidney beans, pinto beans, beer, diced tomatoes, green chilies, chili powder, cumin, salt, and black pepper into the beef and onion.\nCook on High 4 to 5 hours.\n",
        "picture_link": "uwNTXfpF9vlrF/CV6RRzDPDuxTGWeoi"
    },
    {
        "title": "Easy Buckeye Bars",
        "ingredients": [
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "2 cups creamy peanut butter ADVERTISEMENT",
            "1/2 cup melted margarine ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 (12 ounce) bag chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 10x15-inch jelly roll pan.\nMix confectioners' sugar, peanut butter, margarine, brown sugar, and vanilla together in a bowl. Press peanut butter mixture into the prepared pan.\nMelt chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching.\nPour melted chocolate evenly over the peanut butter layer. Let buckeye bars cool completely before cutting into squares.\n",
        "picture_link": "kj3eoxQoQuPcwo3ozR/hb1j6BbNeJFO"
    },
    {
        "title": "Cinnamon Maple Granola with Coconut",
        "ingredients": [
            "1 cup old-fashioned oats ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "1/4 cup pure maple syrup ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon maple sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C). Grease a 13x9-inch baking dish.\nMix oats and coconut in the prepared baking dish.\nStir maple syrup, honey, maple sugar, and cinnamon together in a small saucepan over medium heat; bring to a boil. Cook at a boil, stirring constantly, for 1 minute. Remove saucepan from heat and stir vanilla into maple syrup mixture; pour over oats and coconut and stir to coat.\nBake in preheated oven, stirring every 10 minutes, until golden brown, 30 to 40 minutes.\nCool completely, stirring regularly, before storing in an airtight container.\n",
        "picture_link": "NryoQkfUmnmU1Ii2PD9FfCZA6skrBs."
    },
    {
        "title": "Creamy Lentil Salad",
        "ingredients": [
            "2 cups water, or as needed ADVERTISEMENT",
            "1/2 cup dry lentils ADVERTISEMENT",
            "1 cucumber, peeled and diced ADVERTISEMENT",
            "1 yellow bell pepper, diced ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil, or more to taste ADVERTISEMENT",
            "1/4 cup crumbled feta cheese, or more to taste ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "1 teaspoon ground sea salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and lentils to a boil in a saucepan; cook until lentils are tender, 15 to 25 minutes. Drain and transfer cooked lentils to a large bowl.\nMix cucumber, yellow bell pepper, cilantro, olive oil, feta cheese, dill, sea salt, and black pepper into lentils until fully incorporated. Refrigerate until completely cooled.\n",
        "picture_link": "Bolpa9GVRhRS2g5EFj1kMxlHHE.lyRu"
    },
    {
        "title": "Game Day Crunch",
        "ingredients": [
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup white corn syrup ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "6 cups crispy wheat cereal squares (such as Wheat Chex®) ADVERTISEMENT",
            "2 cups pretzel sticks ADVERTISEMENT",
            "1 1/2 cups peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix brown sugar, butter, and corn syrup together in a large microwave-safe bowl. Microwave on high until bubbling, 3 1/2 minutes. Stir and microwave for 2 more minutes. Stir baking soda and vanilla extract into brown sugar mixture.\nFold cereal squares, pretzel sticks, and peanuts into brown sugar mixture until well coated. Microwave for 2 minutes. Stir and microwave again for 1 minute; stir well. Spread mixture onto waxed paper and cool completely; break into small pieces.\n",
        "picture_link": "SWgPgRkXMkSwPmtCvTynM9YvPCMIOnK"
    },
    {
        "title": "Brined Thanksgiving Turkey",
        "ingredients": [
            "4 (32 ounce) containers chicken broth ADVERTISEMENT",
            "1 cup apple juice (optional) ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "1 cup kosher salt ADVERTISEMENT",
            "2 tablespoons dried sage ADVERTISEMENT",
            "4 peppercorns ADVERTISEMENT",
            "4 red apples, halved ADVERTISEMENT",
            "5 cloves garlic, crushed ADVERTISEMENT",
            "10 pounds ice cubes, or as needed ADVERTISEMENT",
            "1 (20 pound) turkey whole turkey - thawed, neck and giblets removed ADVERTISEMENT",
            "3 apples, cored and quartered ADVERTISEMENT",
            "1 onion, cut into 8 wedges ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "6 fresh sage leaves ADVERTISEMENT",
            "3 tablespoons olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chicken broth, apple juice, brown sugar, salt, dried sage, and peppercorns together in a large stock pot; add apple halves and crushed garlic cloves. Bring the mixture just to a boil, stirring to dissolve sugar and salt. Remove from heat immediately.\nPour enough ice into a large food-safe container to be about half full. Pour chicken broth mixture over the ice; stir to cool liquid completely and evenly.\nGently lower turkey into the liquid with the breast facing down.\nBrine turkey 24 to 36 hours, adding ice as needed to keep the brine and turkey cold.\nPreheat oven to 500 degrees F (260 degrees C).\nRemove turkey from the brine and rinse well with cold water. Pat turkey dry with paper towels.\nMix apple quarters, onion wedges, whole garlic cloves, and fresh sage leaves in a bowl; loosely stuff into cavity of turkey. Move the turkey to a shallow roasting pan. Lightly coat the turkey's skin with olive oil.\nBake the turkey in the preheated oven until the skin on the breast of the turkey is golden brown, about 30 minutes.\nReduce heat to 350 degrees F (175 degrees C), cover turkey with aluminum foil, and continue roasting the turkey until no longer pink at the bone and the juices run clear, about 6 hours. An instant-read thermometer inserted into the thickest part of the thigh should read 180 degrees F (85 degrees C). Remove the turkey from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 10 to 15 minutes before slicing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Portzelky (New Year's Cookies)",
        "ingredients": [
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 cup lukewarm water ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup lukewarm milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups all-purpose flour, or as needed ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "2 tablespoons confectioners' sugar for dusting, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve sugar in lukewarm water in a large bowl and sprinkle yeast over the top. Let yeast activate until it forms a creamy layer on top of the water, about 10 minutes.\nRinse raisins and pat dry with paper towels. Stir raisins into yeast mixture; beat eggs, lukewarm milk, and salt into yeast mixture. Beat flour into liquid ingredients until dough is smooth. If dough is too sticky, beat in 1/4 cup more flour. Cover dough and set aside in a warm place to rise until doubled, about 1 hour.\nHeat vegetable oil to 375 degrees F (190 degrees C) in a large saucepan or deep fat fryer.\nScoop up dough by tablespoon and drop, a few at a time, into the hot oil. Fry until lightly browned; drain on wire racks set over paper towels. Dust with confectioners' sugar.\n",
        "picture_link": "jaDG/73nnTsb6YL5rMv6Pseboa3idwW"
    },
    {
        "title": "Hot and Tangy German Potato Salad",
        "ingredients": [
            "5 pounds red potatoes, diced ADVERTISEMENT",
            "1 pound bacon ADVERTISEMENT",
            "2 sweet onions, diced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with water; season water with salt and bring to a boil. Reduce heat to medium-low and simmer until potatoes are tender, about 20 minutes; drain. Put potatoes in a slow cooker.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to a plate lined with paper towels. Crumble bacon and add to potatoes.\nReturn skillet to medium heat and reheat bacon drippings. Cook and stir sweet onions in the drippings until translucent, 5 to 7 minutes; add garlic and continue cooking until fragrant, 1 to 2 minutes more. Pour onion mixture over the potatoes and bacon.\nStir vinegar, water, sugar, and salt together in a bowl; pour over the potato mixture. Stir potatoes gently to mix.\nCook on Low, stirring occasionally, 3 to 4 hours.\n",
        "picture_link": "xtUdlxUarQKY/9zJJtegmlM.c6ZHoXu"
    },
    {
        "title": "Potato Latkes from Simply Potatoes®",
        "ingredients": [
            "1 (20 ounce) package Simply Potatoes® Shredded Hash Browns ADVERTISEMENT",
            "1/2 cup Better'n Eggs® ADVERTISEMENT",
            "1/3 cup whole wheat flour* ADVERTISEMENT",
            "1/4 cup finely chopped green onion ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl stir together Simply Potatoes, Better'n Eggs, flour, green onion, pepper, salt, and baking powder.\nHeat 1 tablespoon oil in a 12-inch nonstick skillet over medium heat.\nCook 4 latkes at a time: spread 1/4 cup potato mixture for each latke into 3 1/2-inch circles in skillet.\nCook 4 to 5 minutes, turning once. Repeat with remaining potato mixture and add oil to skillet as needed. Season with salt and pepper if desired.\n",
        "picture_link": "MkQZXqDrdHinI5C6UDrysg30DLfDt4C"
    },
    {
        "title": "Canadian Maple Scones",
        "ingredients": [
            "1 cup coarsely chopped walnuts, divided ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons packed light brown sugar ADVERTISEMENT",
            "2 tablespoons cold butter ADVERTISEMENT",
            "Scones: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons packed light brown sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 cup cold butter ADVERTISEMENT",
            "1/3 cup maple syrup, or as needed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons milk, or as needed ADVERTISEMENT",
            "1 cup whipped cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spread walnuts onto a baking sheet.\nToast walnuts in the preheated oven until nuts turn golden brown and become fragrant, about 5 minutes. Watch carefully; nuts can burn quickly. Set aside to cool to room temperature.\nIncrease oven temperature to 375 degrees F (190 degrees C).\nPlace 3 tablespoons flour, 3 tablespoons brown sugar, and 1/2 cup cooled walnuts in a small bowl. Cut in 2 tablespoons butter using two knives or a pastry blender until mixture resembles coarse crumbs.\nWhisk together 2 cups flour, 2 tablespoons brown sugar, baking powder, and salt. Cut in 1/2 cup butter using two knives or a pastry blender until mixture resembles fine crumbs. Stir in remaining 1/2 cup walnuts.\nWhisk together 1/3 cup maple syrup and egg in a small bowl; stir into flour mixture. Gradually stir in just enough milk for the dough to leave the sides of the bowl and form a ball.\nPlace dough on a lightly floured surface. Roll gently in flour to coat; knead lightly about 10 times. Pat into an 8-inch circle on an ungreased baking sheet. Brush with milk; sprinkle evenly with topping. Score dough circle into 8 wedges with a knife, but do not separate wedges.\nBake in the preheated oven until golden brown, about 15 minutes. Remove immediately from the baking sheet, and separate the scones. Serve warm with whipped cream and maple syrup.\n",
        "picture_link": "ccaq36Cc6qjH3Oywy3Ptb6iCDY49YbS"
    },
    {
        "title": "Honey Bunch Bread",
        "ingredients": [
            "2 3/4 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 tablespoons active dry yeast ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "6 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir warm water and honey together in a bowl until honey dissolves. Sprinkle yeast over water mixture and let stand until the yeast softens and begins to form a creamy foam, about 5 minutes.\nStir oil and salt into yeast mixture. Mix 3 cups of flour into yeast mixture until no dry spots remain. Stir in remaining flour, 1/2 cup at a time, mixing well after each addition, until dough is no longer sticky and pulls together. Continue kneading for 5 minutes in a stand mixer or 10 minutes by hand.\nPlace dough in a large, lightly-oiled bowl and turn to coat. Cover bowl with a towel and let rise in a warm place until doubled in volume, about 1 hour.\nPunch down dough and let rise again until doubled in volume, about 45 minutes.\nGrease three 9x5-inch loaf pans.\nPunch down dough and turn onto a lightly floured surface. Form dough into 3 loaves and place into prepared pans. Cover loaves with a damp cloth and let rise until dough is about 1 inch above the sides of the loaf pans, about 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven until tops are golden brown and the bottoms of loaves sound hollow when tapped, about 40 minutes. Remove loaves from pans and transfer to a cooling rack.\n",
        "picture_link": "nuFzXI/0MCEvZItDFszn41A9/jP8Q3u"
    },
    {
        "title": "Bow-Tie Pasta with Sausage, Peas, and Mushrooms",
        "ingredients": [
            "1/2 cup olive oil, divided ADVERTISEMENT",
            "1 pound Italian sausage, casings removed ADVERTISEMENT",
            "1 (10 ounce) package portobello mushrooms, sliced ADVERTISEMENT",
            "3/4 teaspoon sea salt, or more to taste, divided ADVERTISEMENT",
            "3/4 teaspoon freshly ground black pepper, divided ADVERTISEMENT",
            "1 (10 ounce) package frozen peas, partially thawed ADVERTISEMENT",
            "1 (16 ounce) package farfalle (bow-tie) pasta ADVERTISEMENT",
            "1/2 cup Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a large skillet over high heat; cook and stir sausage in the hot oil, breaking up any large chunks, until browned and crumbly, about 5 minutes. Transfer cooked sausage to a plate.\nHeat 2 more tablespoons olive oil in the same large skillet over medium heat; cook and stir mushrooms, 1/2 teaspoon salt, and 1/2 teaspoon pepper in the hot oil until mushrooms are tender and all the liquid has evaporated, about 8 minutes.\nStir peas into mushroom mixture and cook until peas are warmed, about 2 minutes. Return sausage to mushroom mixture; cook and stir until flavors have blended and sausage is heated, about 3 minutes.\nBring a large pot of lightly salted water to a boil. Cook bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain pasta, reserving 1/2 cup pasta water. Return pasta to pot and stir in sausage-mushroom mixture; cook and stir, adding reserved pasta water as needed, until mixture is evenly mixed, about 5 minutes.\nDrizzle remaining 1/4 cup olive oil over pasta mixture and season with remaining 1/4 teaspoon salt and 1/4 teaspoon pepper; toss to coat. Add Parmesan cheese; toss to combine.\n",
        "picture_link": "FVOan5S17ggqKRK0EJjWmKs/jIt//Tm"
    },
    {
        "title": "Spicy Bacon Cheeseburger Dip",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "2 tablespoons dill pickle juice ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package processed American cheese, cut into cubes ADVERTISEMENT",
            "8 ounces cream cheese ADVERTISEMENT",
            "1 cup shredded part-skim mozzarella cheese ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "6 green onions, thinly sliced ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove bacon to a plate lined with a paper towel, retaining drippings in the skillet.\nBreak ground beef in pieces and add to drippings in the skillet. Cook and stir beef until completely browned, 7 to 10 minutes; drain in a colander. Rinse beef with water to wash away excess fat; drain. Transfer drained beef to a bowl. Stir pickle juice into the beef; season with salt and pepper.\nCombine ground beef mixture, American cheese, cream cheese, diced tomatoes with green chile peppers, green onions, ketchup, Dijon mustard, and cayenne pepper in a slow cooker.\nCook cheese mixture on Low, stirring occasionally, until the cheese is melted completely, about 1 hour. Crumble bacon over the surface of the dip to serve.\n",
        "picture_link": "sUr07SHbTjHYIJDsFrHWYagXWcPR81W"
    },
    {
        "title": "Chia Fresca",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon chia seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, lemon juice, and sugar together in a glass until sugar is completely dissolved; add chia seeds. Let stand until a gel forms around the chia seeds, about 10 minutes; stir.\n",
        "picture_link": "j3ELgH47IM9TvuGv3YtdbrOJXeLKkfG"
    },
    {
        "title": "Freezer Slaw",
        "ingredients": [
            "1 large head cabbage, shredded ADVERTISEMENT",
            "1 green bell pepper, finely chopped ADVERTISEMENT",
            "1 small small onion, finely chopped ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup cider vinegar ADVERTISEMENT",
            "2 teaspoons celery seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cabbage, green bell pepper, onion, and carrots in a large bowl. Mix boiling water and salt together in a bowl and pour over cabbage mixture. Set aside for salt to draw out extra water from vegetables, about 1 hour. Drain well.\nMix sugar, 1 cup water, cider vinegar, and celery seed in a saucepan; bring to a boil. Cook and stir until sugar is dissolved, about 1 minute. Remove saucepan from heat and cool completely.\nPour cooled sugar-vinegar mixture over drained cabbage mixture in a large bowl and toss until slaw is well mixed. Spoon slaw into resealable plastic bags and freeze.\n",
        "picture_link": "qgTu7pMOzIg.IdG9bPcDsC3.YZpk6h."
    },
    {
        "title": "Bacon Wrapped Sweet Chicken Breast",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (16 ounce) bottle French salad dressing ADVERTISEMENT",
            "1 (12 ounce) jar sliced banana peppers, drained ADVERTISEMENT",
            "1 (1 pound) package thick double smoked bacon ADVERTISEMENT",
            "1 (16 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to 1/8-inch thickness.\nTransfer chicken to a large baking dish and add French dressing. Cover and marinate in the refrigerator for 2 hours or overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove chicken from the dressing and shake off excess. Reserve the remaining dressing.\nLay chicken breasts on a flat surface and spread several banana pepper slices down the center. Roll chicken around the peppers. Wrap chicken with 2 slices bacon and secure with toothpicks. Arrange bacon-wrapped chicken in a 9x13-inch baking dish. Pour reserved dressing over chicken.\nBake in the preheated oven for 30 minutes. Sprinkle mozzarella cheese over chicken and continue baking until chicken is no longer pink in the center and the juices run clear, 10 to 15 minutes more.\n",
        "picture_link": "aC27c74XA9Wx40oi9feQ22wG6L0J8em"
    },
    {
        "title": "Easy Apple Rhubarb Crisp",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 cups rolled oats ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "2 cups chopped rhubarb ADVERTISEMENT",
            "2 cups chopped apples ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nStir flour, oats, brown sugar, and cinnamon together in a bowl. Pour melted butter into oat mixture and stir until crumbly. Pat half the oat mixture into the bottom of a 9x13-inch baking dish.\nStir rhubarb and apples together in a bowl; pour on top of oat mixture in baking dish.\nStir cornstarch and 2 tablespoons water together in a bowl until cornstarch is dissolved and mixture is smooth.\nHeat sugar, 1 cup water, and vanilla extract in a saucepan over medium-high heat; bring to a boil, stirring constantly. Pour cornstarch mixture into sugar mixture and continue to boil, stirring constantly, until mixture thickens, 1 to 2 minutes. Drizzle sugar mixture over rhubarb and apples; sprinkle remaining oat mixture over the top.\nBake in the preheated oven until hot and bubbly, 35 minutes.\n",
        "picture_link": "LiRMpbqlf2coPv/hjzrCDzFRExZhDRi"
    },
    {
        "title": "Grandma Drexler's Bavarian Goulash",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pound pork, cut into 1-inch cubes ADVERTISEMENT",
            "1 tablespoon dried marjoram, or to taste ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1 pinch dill seed ADVERTISEMENT",
            "1 pinch mustard powder ADVERTISEMENT",
            "2 1/2 cups water, divided ADVERTISEMENT",
            "1 cup sauerkraut ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium-high heat. Cook and stir onion and garlic in melted butter until the onion is golden brown, 10 to 15 minutes.\nStir pork, marjoram, paprika, salt, basil, dill, and mustard powder into the onion mixture; cook and stir until pork is only slightly pink in the center, 5 to 7 minutes.\nPour about half the water over the pork mixture. Add sauerkraut and sour cream; stir. Bring the mixture to a boil and add remaining water; cook at a boil until thickened, about 15 minutes.\n",
        "picture_link": "Z6m7sV2UrlvjYlPk6eYgpCDp1xpc1R2"
    },
    {
        "title": "Chef John's Sausage and Egg Pizza",
        "ingredients": [
            "6 ounces hot Italian sausage, sliced ADVERTISEMENT",
            "12 ounces unbaked pizza dough, at room temperature ADVERTISEMENT",
            "2 tablespoons cornmeal, or as needed ADVERTISEMENT",
            "3/4 cup pizza sauce ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste (optional) ADVERTISEMENT",
            "6 ounces shredded Fontina cheese, divided ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1/3 cup freshly shredded Parmigiano-Reggiano cheese, divided ADVERTISEMENT",
            "1 cup baby arugula leaves, washed and dried ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 475 degrees F (245 degrees C).\nCook and stir sliced Italian sausage in a skillet over medium heat until some of the fat has rendered out and sausage is no longer pink inside, about 5 minutes. Transfer sausage slices to a paper towel-lined plate to drain.\nRoll pizza dough out to about 12 inches in diameter and about 3/8-inch thick; sprinkle with cornmeal. Flip dough so the cornmeal side is down and transfer to a perforated 14-inch pizza pan.\nSpread pizza sauce in a thin layer on top of the dough. Sprinkle with red pepper flakes and about 3/4 the Fontina cheese. Spread sausage slices onto the pizza, leaving 4 spaces about 3 inches across on the pizza for eggs. Sprinkle remaining Fontina cheese onto sausage slices.\nBake in the preheated oven until dough is hot, edges are starting to brown, and cheese has started to melt, 10 to 12 minutes.\nCrack each egg into a separate ramekin or small bowl. Remove pizza from oven and use a spatula to press the spaces between sausage slices flat. Gently pour an egg onto each space. Grind a little black pepper onto each egg yolk. Lightly sprinkle Parmigiano-Reggiano cheese over entire pizza.\nReturn to oven and bake until eggs are set but yolks are still liquid, about 5 minutes, checking frequently to avoid overcooking eggs. Toss arugula leaves with olive oil in a bowl until coated. Remove pizza from oven, poke egg yolks with a fork, spread them around a little, and sprinkle arugula over the top of the pizza. Cut into 4 quarters, each with an egg, to serve.\n",
        "picture_link": "5.9Roez3E2c.lX8cwprmzYcZ9WcLPrm"
    },
    {
        "title": "Famous Turkey Burgers",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1/3 cup honey barbecue sauce, divided ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "4 hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nMix turkey, 1/4 cup barbeque sauce, green onion, oil, chili powder, and cumin together in a bowl; shape into 4 patties.\nGrill patties on the preheated grill until cooked through, 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read 165 degrees F (74 degrees C). Serve each burger on a bun and smother each burger with remaining barbeque sauce.\n",
        "picture_link": "1zv8Lego5s6nzPS4MOkasfiQZ6wmsSe"
    },
    {
        "title": "Baghdad Beef Stew",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "1 (17 ounce) can figs, drained (reserve juice) and chopped ADVERTISEMENT",
            "1 3/4 cups water, or as needed ADVERTISEMENT",
            "1 cup sliced carrots ADVERTISEMENT",
            "3/4 cup sliced onion ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a heavy pot over medium heat. Cook and stir beef in hot oil until browned completely, about 5 minutes.\nPour reserved liquid from figs into a 2-cup measuring cup. Add enough water so the mixture is 2 cups total; pour into pot with the beef. Stir carrots, onion, green onions, coriander, and cinnamon into the beef mixture. Reduce heat to low and cook at a simmer for 90 minutes.\nStir honey, vinegar, salt, and pepper into the beef mixture; continue cooking on low for 1 hour more.\nStir figs and almonds into the beef mixture. Remove from heat. Cool for 1 hour before reheating to serve.\n",
        "picture_link": "tn13hWdZPbs9GvRxCFg.su0ME1AJSnS"
    },
    {
        "title": "Spicy Vegan Lentil Quinoa Soup",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup dry lentils ADVERTISEMENT",
            "1/2 cup quinoa ADVERTISEMENT",
            "1/2 cup chopped carrots ADVERTISEMENT",
            "1/2 cup mushrooms ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon cumin ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, celery, lentils, quinoa, carrots, mushrooms, chili powder, cumin, and ginger in a saucepan. Cover saucepan and cook soup over medium-low heat until vegetables and lentils are tender, 45 to 60 minutes.\n",
        "picture_link": "ZBAqDMhKl//n6CYoaFSyu/XmeFyoKNW"
    },
    {
        "title": "Stuffed Dates",
        "ingredients": [
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 ounces crumbled Gorgonzola cheese ADVERTISEMENT",
            "36 pitted dates ADVERTISEMENT",
            "36 walnut pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese and Gorgonzola cheese together in a bowl.\nCut a slit into each date so they can be spread flat. Spread cheese mixture into each date; top with a walnut piece.\n",
        "picture_link": "ZB6xi0byd5fKF7DT6FjbLLYDQMqnlIu"
    },
    {
        "title": "Baked Pumpkin Seeds",
        "ingredients": [
            "2 cups raw pumpkin seeds, or to taste ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix pumpkin seeds, oil, and ranch dressing mix together in a bowl until seeds are evenly coated; spread onto a baking sheet.\nBake in the preheated oven until seeds are lightly browned, about 10 minutes.\n",
        "picture_link": "AK0qDJMZPzboU..0try4I6dLKLKHfom"
    },
    {
        "title": "Pear Walnut Wheat Berry Salad",
        "ingredients": [
            "7 cups water ADVERTISEMENT",
            "2 cups wheat berries ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "Raspberry Vinaigrette: ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "1/2 cup raspberry wine vinegar ADVERTISEMENT",
            "1/2 cup raspberry preserves ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "1 firm pear, cored and diced ADVERTISEMENT",
            "1/2 cup crumbled Gorgonzola cheese ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and wheat berries to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the wheat berries are tender, 45 minutes to 1 hour. Drain any excess water and cool.\nPreheat oven to 375 degrees F (190 degrees C). Spread walnuts onto a baking sheet.\nBake walnuts in the preheated oven until toasted and fragrant, 5 to 10 minutes. Remove pan from oven and cool.\nWhisk canola oil, raspberry wine vinegar, raspberry preserves, mustard, oregano, and black pepper together in a bowl until vinaigrette is smooth. Measure 1/2 cup vinaigrette and store remaining vinaigrette in an airtight container in the refrigerator for another use.\nCombine wheat berries, walnuts, pear, Gorgonzola cheese, cranberries, and green onions in a large bowl. Drizzle 1/2 cup vinaigrette over wheat berries mixture; toss to coat. Refrigerate for flavors to blend, about 30 minutes.\n",
        "picture_link": "KxxixVcpqTAS12O3iqogDcPWVP9/0fS"
    },
    {
        "title": "Spicy Pork Curry",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon dried rosemary ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons coconut oil ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1/2 teaspoon ground red pepper (cayenne), or more to taste ADVERTISEMENT",
            "1 pound pork tenderloin, cut into strips ADVERTISEMENT",
            "2 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1/4 cup natural peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat water, dried onion, chicken bouillon, garlic powder, rosemary, thyme, and salt in a microwave-safe bowl for 1 minute in the microwave; let stand until onion is rehydrated and bouillon is dissolved.\nHeat coconut oil, curry powder, and ground red pepper in a large oven-proof skillet over medium heat, stirring constantly, until oil takes on the color of the curry powder, 5 to 6 minutes.\nCook and stir pork tenderloin slices in coconut oil mixture until pork begins to brown. Sprinkle flour over pork; cook and stir until slices cook through; 2 to 3 minutes more.\nStir bouillon mixture, coconut milk, and peanut butter into pork mixture; bring to a boil, stirring constantly. Cover skillet with an oven-proof lid and transfer to oven.\nCook pork in the preheated oven until tender and sauce is bubbling, about 45 minutes. Remove from oven, remove lid, and rest pork for 10 minutes to allow sauce to thicken.\n",
        "picture_link": "tdEWXWT3yDgSqVXs7xPR1BHjx0hOIPS"
    },
    {
        "title": "Angel Food Refrigerator Cake",
        "ingredients": [
            "1 (12 ounce) container whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "2 (6 ounce) containers lemon yogurt ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (9 inch) angel food cake ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk whipped topping, lemon yogurt, and vanilla pudding mix together in a bowl until frosting is smooth and thickened, 2 to 3 minutes. Spread frosting evenly on angel food cake and refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "DScvoXGKCcz02MNUyB.H8mvT9sMWPRu"
    },
    {
        "title": "Smoked Spicy Chicken Wings",
        "ingredients": [
            "3 cups hickory wood chips, divided ADVERTISEMENT",
            "3 pounds chicken wings ADVERTISEMENT",
            "2 tablespoons Cajun seasoning, or as needed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons Cajun seasoning ADVERTISEMENT",
            "16 ounces hot sauce (such as Frank's Red Hot ®) ADVERTISEMENT",
            "4 cups vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat smoker to 200 degrees F (95 degrees C) and add 1 cup wood chips to start the smoke rolling.\nLiberally coat chicken wings with about 2 tablespoons Cajun seasoning.\nPlace wings directly on the grate in the smoker or in an aluminum pan with holes to allow airflow. Add more wood chips as needed to continue smoke. Smoke wings for 2 hours.\nCombine butter, garlic, and 2 tablespoons Cajun seasoning in a large saucepan over medium-low heat; cook and stir until butter is melted, about 1 minute. Stir hot sauce into butter mixture; simmer, stirring occasionally, until sauce has thickened, about 30 minutes.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nPreheat grill to 375 degrees F (190 degrees C).\nCook wings, 10 to 12 at a time, in the deep fryer until no wings are longer pink in the center and are lightly browned on the outside, 5 to 7 minutes. Remove wings from the oil with a slotted spoon, letting excess oil drain from the wings.\nPlace cooked wings on a baking sheet and liberally coat each wing with hot sauce mixture.\nPlace coated wings directly onto the grates of the preheated grill; cook until sauce has caramelized and wings are crisp, 2 to 3 minutes per side.\n",
        "picture_link": "ee4Eybkj.SGSpZH2FKADTmCj0sub1Kq"
    },
    {
        "title": "Spicy Veggie Cabbage Soup",
        "ingredients": [
            "2 (4 ounce) links hot Italian sausage, casings removed ADVERTISEMENT",
            "2 quarts chicken broth ADVERTISEMENT",
            "1 (14 ounce) can crushed tomatoes ADVERTISEMENT",
            "1/2 (8.5 ounce) package coleslaw mix ADVERTISEMENT",
            "3 stalks celery, sliced ADVERTISEMENT",
            "2 large potatoes, diced ADVERTISEMENT",
            "2 large carrots, sliced ADVERTISEMENT",
            "1/2 large onion, diced ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup heavy whipping cream, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a stock pot over medium heat. Crumble sausage into the pot; cook and stir until completely browned, 5 to 7 minutes.\nPour chicken broth into the pot; add tomatoes, coleslaw mix, celery, potatoes, carrots, onion, garlic, bay leaves, salt, and pepper. Bring the liquid to a boil, reduce heat to medium low, and simmer until vegetables are tender, 45 minutes to 1 hour. Stir cream into individual servings.\n",
        "picture_link": "3p4Y1D8WOzV43KzuAYJyWLMuW6zmo4G"
    },
    {
        "title": "Not Just for Brunch Fruit Salad",
        "ingredients": [
            "2 cups green grapes ADVERTISEMENT",
            "2 cups sliced strawberries ADVERTISEMENT",
            "2 cups sliced peaches ADVERTISEMENT",
            "2 cups orange segments ADVERTISEMENT",
            "1 cup peeled sliced kiwi ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup orange-flavored liqueur (such as Cointreau®) ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix grapes, strawberries, peaches, orange segments, and kiwi in a large bowl.\nWhisk orange juice, orange-flavored liqueur, and sugar together in a bowl until sugar dissolves; gently stir into fruit until evenly coated. Cover bowl with plastic wrap and refrigerate up to 8 hours.\n",
        "picture_link": "2H0GEwsG1csCnh92loFijY/FiYeAhEm"
    },
    {
        "title": "Creole Marmalade Sauce",
        "ingredients": [
            "1 cup orange marmalade ADVERTISEMENT",
            "2 tablespoons Dijon mustard (such as Grey Poupon®) ADVERTISEMENT",
            "1 tablespoon horseradish sauce ADVERTISEMENT",
            "1 teaspoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix marmalade, mustard, horseradish sauce, hot sauce, and salt together in a bowl. Refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "oe3uPItxUgPSRwyucNhdOoeD2mgIo7C"
    },
    {
        "title": "Blue Cheese Chipotle Venison Burgers",
        "ingredients": [
            "2 pounds ground venison ADVERTISEMENT",
            "3 chipotle peppers in adobo sauce, chopped ADVERTISEMENT",
            "5 ounces blue cheese crumbles ADVERTISEMENT",
            "1 garlic clove, crushed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "5 banana peppers, chopped ADVERTISEMENT",
            "6 hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nMix venison, chipotle peppers, blue cheese, and garlic in a large bowl. Divide mixture into 6 equal parts and shape into patties.\nGrill on the preheated grill until an instant-read thermometer inserted horizontally into the center registers 160 degrees F, 5 to 7 minutes per side.\nHeat olive oil in a skillet over medium heat; cook and stir onion and banana peppers until onions are lightly golden, about 7 minutes. Top burgers with the onion mixture; serve with hamburger buns.\n",
        "picture_link": "wXg4tJ3UwzTtWGGsWDLBWQiZtjvECaK"
    },
    {
        "title": "Curried Sweet Potato Surprise",
        "ingredients": [
            "1 (29 ounce) can pears, drained and chopped ADVERTISEMENT",
            "1 (29 ounce) can sliced peaches, drained ADVERTISEMENT",
            "1 (15 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "2 cups peeled cubed sweet potato ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon curry powder, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Grease a 9x13-inch baking pan.\nPlace drained pears, peaches, pineapple, and cubed sweet potatoes in a large bowl.\nMelt butter in a saucepan over low heat. Whisk in brown sugar and curry powder until well blended. Pour over the sweet potato mixture and toss to coat. Spread mixture into the prepared pan.\nBake in the preheated oven until sweet potatoes are tender, about 50 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Maurice's Tabbouleh",
        "ingredients": [
            "2 cups coarse bulgur, rinsed and drained ADVERTISEMENT",
            "2 cucumbers, diced small ADVERTISEMENT",
            "2 large tomatoes, diced ADVERTISEMENT",
            "2 bunches fresh parsley leaves, chopped ADVERTISEMENT",
            "2 bunches green onions, finely chopped ADVERTISEMENT",
            "2 yellow onions, cut into small dice ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "3/4 tablespoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bulgur in a large bowl and cover with water by 3 inches; soak for 45 minutes. Drain and squeeze to remove excess water.\nMix cucumbers, tomatoes, parsley, green onions, yellow onions, garlic, olive oil, lemon juice, salt, and ground black pepper together in a bowl.\nStir bulgur into cucumber mixture; toss. Refrigerate tabbouleh at least 5 hours before serving.\n",
        "picture_link": "qmfZfAJSsdftZtIpCK7smcwKPCcEoFC"
    },
    {
        "title": "Simple Cream Cheese and Ham Spread",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 1/2 ounces sliced ham, chopped ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "2 tablespoons prepared English mustard with turmeric ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese, ham, green onions, and English mustard together in a bowl. Cover bowl with plastic wrap and refrigerate 8 hours to overnight.\n",
        "picture_link": "QNAk10yMRI417I8pQ402v70sCH53ELK"
    },
    {
        "title": "Cabbage, Peach, and Carrot Smoothie",
        "ingredients": [
            "1 cup grapes ADVERTISEMENT",
            "1 cup sliced frozen peaches ADVERTISEMENT",
            "3/4 cup chopped cabbage ADVERTISEMENT",
            "1 large carrot ADVERTISEMENT",
            "1/4 cup ice cubes, or as desired ADVERTISEMENT",
            "1/4 cup water, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend grapes, peaches, cabbage, carrot, ice cubes, and water in a high-powered blender (such as a Vitamix(R)) until desired consistency is reached.\n",
        "picture_link": "5NW4nvq0ukyjIuIpga3Q7.quN2u/Tc6"
    },
    {
        "title": "Quick Quinoa Chili",
        "ingredients": [
            "2 cups beef broth, divided ADVERTISEMENT",
            "1 (1.25 ounce) package chili seasoning mix ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "1 cup quinoa, rinsed ADVERTISEMENT",
            "1 (14.5 ounce) can petite diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can tri-bean blend ADVERTISEMENT",
            "1 (7 ounce) can diced green chilies ADVERTISEMENT",
            "1/2 cup frozen corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 1 cup beef broth and chili seasoning mix together in a bowl.\nMelt coconut oil in a pot over medium-high heat. Cook and stir quinoa in hot oil until fragrant and lightly toasted, 1 minute. Pour broth-seasoning mixture, remaining 1 cup beef broth, and tomatoes into quinoa mixture. Bring to a boil, stirring frequently. Reduce heat to low, cover, and simmer until quinoa has absorbed most of the liquid, 20 to 30 minutes.\nStir bean blend, green chilies, and corn into quinoa mixture; simmer until heated through, 5 to 10 minutes.\n",
        "picture_link": "IYmhLrMX4RTZ2Hi5QuhxpKiFhOAwdNq"
    },
    {
        "title": "Mexican-Spiced Pumpkin Seeds",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups pumpkin seeds ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 pinch dried oregano, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; spray with cooking spray.\nSpread pumpkin seeds onto the prepared baking sheet; sprinkle with salt, cumin, chili powder, cayenne pepper, and oregano; toss to coat evenly.\nBake seeds in the preheated oven for 5 minutes; stir seeds. Return to oven and bake until seeds are toasted, about 15 more minutes.\n",
        "picture_link": "gCbytKRB.Smp7JYIuZ.d9dSFBtv.f1e"
    },
    {
        "title": "Pluots and Pork",
        "ingredients": [
            "5 thin boneless pork chops ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "1 tablespoon light brown sugar, or to taste ADVERTISEMENT",
            "4 pluots, stones removed and cut into 12 wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over medium-high heat. Season pork chops on both sides with salt and pepper; cook in skillet until browned, about 3 minutes per side. Remove chops from pan to a plate.\nPour white wine into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Stir brown sugar in to the wine mixture. Add the pluots, place a cover on the skillet, reduce heat to medium, and cook until the pluots break down into a thick sauce, about 10 minutes.\nReturn pork chops to the skillet and continue to cook until pork chops warm and are slightly pink in the center, 3 to 5 minutes more. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\n",
        "picture_link": "QVMIvur..9Sqt2q1bbHOqNUWUrIh7NC"
    },
    {
        "title": "Incredible Edible Fried Pickles",
        "ingredients": [
            "2 cups dried plain bread crumbs ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1/4 cup half and half ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup dill pickle slices, drained ADVERTISEMENT",
            "3 cups peanut oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir bread crumbs, flour, seafood seasoning, garlic powder, salt, and ground black pepper together in a large bowl.\nBeat half-and-half and eggs together in a bowl until completely blended. Stir in 1/2 cup pickles and toss to coat completely.\nPlace coated pickle slices into the bread crumb mixture and toss to coat. Return breaded slices to egg mixture and repeat the entire breading process. Remove slices to a sheet of wax/parchment paper and repeat the entire process for the remaining 1/2 cup of pickle slices.\nHeat oil in a large skillet over medium-high heat. Place 10 to 15 pickles slices in skillet. Cook until golden brown, 3 to 5 minutes. Repeat with remaining slices.\n",
        "picture_link": "WnZ.c9SrLp/ORlDhXRE4Kp8n9QOTeOu"
    },
    {
        "title": "Persian Halva",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup rose water ADVERTISEMENT",
            "3 saffron threads ADVERTISEMENT",
            "1 cup unsalted butter ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring sugar and water to a boil in a saucepan; cook, stirring constantly, until sugar is dissolved, about 5 minutes. Stir rose water and saffron into the sugar mixture; cover saucepan and remove from heat.\nMelt butter in a large saucepan over low heat; stir flour into the melted butter until mixture is a smooth paste. Continue to cook, stirring often, until paste turns golden, about 5 to 10 more minutes.\nSlowly whisk sugar mixture into paste until smooth. Remove saucepan from heat and spread halva evenly onto a plate or platter. Make a pattern on the top of halva using the back of a spoon or a knife. Cover with plastic wrap and refrigerate until set, at least 1 hour.\n",
        "picture_link": "LNlOTUyTPP0Sy/7sUn8IYlagUfUybfG"
    },
    {
        "title": "Vegetarian Bodacious Broccoli Salad",
        "ingredients": [
            "8 vegetarian bacon strips ADVERTISEMENT",
            "1 head fresh broccoli, chopped ADVERTISEMENT",
            "1 small head cauliflower, chopped ADVERTISEMENT",
            "1 1/2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 large red onion, chopped ADVERTISEMENT",
            "1/3 cup light mayonnaise ADVERTISEMENT",
            "1/3 cup plain yogurt ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes. Drain fat and crumble bacon.\nMix broccoli, cauliflower, Cheddar cheese, onion, and crumbled bacon together in a large bowl.\nWhisk mayonnaise, yogurt, red wine vinegar, sugar, ground black pepper, salt, and lemon juice in a bowl until thick and creamy. Pour dressing over broccoli mixture and toss to combine. Cover and refrigerate until serving.\n",
        "picture_link": "zDn3.DEgtOteGo7pQ6OZTTksFz0Eeh2"
    },
    {
        "title": "Tiffany's Apple Crisp",
        "ingredients": [
            "Reynolds Wrap® Non-Stick Aluminum Foil ADVERTISEMENT",
            "8 medium Granny Smith apples, peeled, cored, and sliced ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1 cup flour ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1 cup lightly packed brown sugar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Line 13x9x2-inch baking dish with Reynolds Wrap Non-Stick Foil with the non-stick (dull) side facing up towards the food and the shiny side facing the dish; set aside.\nArrange apples evenly in dish. Sprinkle with cinnamon and sugar; set aside.\nMix flour, oats, brown sugar, walnuts and salt in a medium bowl. Cut in shortening until well blended. Sprinkle flour mixture over apples.\nBake 40 to 45 minutes, until apples are soft and topping is lightly browned. Serve warm with ice cream.\n",
        "picture_link": "vGqXIQ/Nhluu81z/uVYeZ2Bf3fnL1Ya"
    },
    {
        "title": "Spicy and Cheesy Creamed Corn",
        "ingredients": [
            "1 1/2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "4 (12 ounce) cans whole kernel corn, drained ADVERTISEMENT",
            "3 (4 ounce) cans chopped green chilies ADVERTISEMENT",
            "1 (4 ounce) can chopped jalapeno peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir cream cheese, milk, butter, and garlic salt together in a saucepan over low heat. Cook, stirring frequently, until the cheese has melted completely and the sauce is smooth, about 5 minutes. Stir corn, green chilies, and jalapeno peppers into the sauce. Pour corn mixture into a baking dish.\nBake in preheated oven for 30 minutes.\n",
        "picture_link": "o2ZXLZb8jrQUrTsBJbkQVxtjKUC2KtC"
    },
    {
        "title": "Spicy Mango Relish",
        "ingredients": [
            "1/2 mango ADVERTISEMENT",
            "2 teaspoons finely chopped cilantro ADVERTISEMENT",
            "2 teaspoons Asian chile pepper sauce (such as sambal oelek) ADVERTISEMENT",
            "2 teaspoons rice wine vinegar ADVERTISEMENT",
            "1 tiny pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel mango using a vegetable peeler. Continue to use the peeler on the flesh of the mango down to the pit, creating thin slices of mango. Stack the mango strips and slice into thin strips; cut crosswise to make very finely diced mango. Transfer mango to a small bowl.\nStir cilantro, Asian chile pepper sauce, rice vinegar, and salt into mango.\n",
        "picture_link": "1td42I3xiKgiKUPXFIBlLC3NguqOjf6"
    },
    {
        "title": "Toss-Together Broccoli Salad",
        "ingredients": [
            "3 cups fresh broccoli florets ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "8 crispy cooked bacon, crumbled ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "6 tablespoons mayonnaise ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the broccoli, Cheddar cheese, onion, bacon, sunflower seeds, and raisins in a large bowl. Whisk mayonnaise, vinegar, and sugar together in a separate bowl; pour over the broccoli mixture and toss to coat.\nCover bowl with plastic wrap and refrigerate at least 1 hour before serving.\n",
        "picture_link": "l0VdOj1Lg8fp48cKydA3dJVCnsJilTa"
    },
    {
        "title": "Savory Sausage Pancakes",
        "ingredients": [
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "5 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "2 eggs, slightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir sausage and onion in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Set sausage mixture aside to cool.\nSift flour, baking powder, and salt into a bowl. Beat milk and eggs in another large bowl; stir flour mixture into egg mixture until batter is smooth. Add cooled sausage and onion to batter.\nHeat a non-stick griddle or skillet over medium-high heat. Pour about 1/4 cup portions of batter onto hot skillet. Cook until bubbles form and the edges are dry, about 3 minutes. Flip and cook until browned on the other side, about 3 more minutes. Repeat with remaining batter.\n",
        "picture_link": "YeQ2nKXON.G0bMD2WdfbvsuvAiA9Nnq"
    },
    {
        "title": "Blueberry Banana Milkshake",
        "ingredients": [
            "2 cups vanilla ice cream ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 cups blueberries ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place vanilla ice cream and milk in a blender and blend until smooth. Add blueberries, banana, sugar, and vanilla extract; blend until evenly mixed.\n",
        "picture_link": "PITFpIENmRZzcEm/U405vBpd.mwOdry"
    },
    {
        "title": "Brussels Sprouts with Sour Cream",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1 pound Brussels sprouts, trimmed ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 tablespoons bacon bits ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1 dash hot sauce, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir onion until translucent and tender, 2 to 3 minutes. Transfer onion to a large bowl.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add Brussels sprouts, cover, and steam until tender, 10 to 15 minutes. Transfer Brussels sprouts to the same bowl with the onion.\nStir sour cream, bacon bits, butter, and hot sauce into vegetable mixture until evenly coated; season with salt.\n",
        "picture_link": "f7Lf4wzn52q4MzYZhQ/4gRLS1N37/2e"
    },
    {
        "title": "Artichoke and Mussel Bisque",
        "ingredients": [
            "3 whole artichokes ADVERTISEMENT",
            "1 bulb fennel, trimmed and diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "2 quarts water to cover ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "1 pound mussels - cleaned and debearded ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove the hearts and stems from the artichokes and discard the leaves. Chop the hearts and stems and place them in a large pot over low heat with the fennel and onion. Add the cream, just enough water to cover all, and salt and pepper to taste. Let this simmer for 15 to 20 minutes, or until tender.\nMeanwhile, rinse and de-beard the mussels. In a separate large saucepan over medium low heat, sweat the garlic in the butter or margarine for 30 seconds. Add the cleaned mussels and the wine, cover and let simmer for 5 minutes. Remove the mussels and reserve the liquid. (Note: Be careful not to brown the garlic.)\nTransfer the vegetable mixture to a blender and puree until smooth. Add the lemon juice, reserved mussel liquid and season with salt and pepper to taste. Strain this mixture through a fine mesh strainer and top each serving with some mussels. Garnish with chopped fresh parsley.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Snow on the Mountain",
        "ingredients": [
            "1 cup dates, pitted and chopped ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "5 oranges, peeled and cut into 5 or 6 pieces ADVERTISEMENT",
            "3 bananas, cut into 1 inch pieces ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8 inch pan.\nIn a medium bowl, beat together the eggs and 1 cup of sugar. Combine the flour, baking powder and salt, stir into the egg mixture. Then, stir in the dates, walnuts and vanilla. Pour into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven. Cool on the pan on a wire rack. When the cake is cooled, break into bite sized pieces. Stir the cake pieces together with the oranges, bananas and remaining sugar. Press into a medium sized bowl and chill for several hours.\nInvert cake onto a serving plate. Whip the heavy cream with the confectioners' sugar and vanilla until stiff. Spread over the entire cake.\n",
        "picture_link": "O777ivx7/OAXxtVAT2ZDZKAMXSSA/w2"
    },
    {
        "title": "Sam's Kicking Cranberry Sauce",
        "ingredients": [
            "1 (12 ounce) package fresh cranberries ADVERTISEMENT",
            "1 (16 ounce) can whole cranberry sauce ADVERTISEMENT",
            "1 (12 ounce) jar orange marmalade ADVERTISEMENT",
            "1/3 cup diced onion ADVERTISEMENT",
            "1 apple - peeled, cored, and chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/3 cup orange liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, combine the fresh whole cranberries, cranberry sauce, orange marmalade, onion, apple, green bell pepper, salt, jalapeno, lime juice and liqueur.\nCook until cranberries crack open. Reduce heat and simmer until contents reduce by one third (approximately 3 hours). Remove from heat, cover and allow to cool overnight.\n",
        "picture_link": "EZAYp1UJS1Z6LJXo/l36ZwErRz3bczS"
    },
    {
        "title": "Whole Wheat Croissants",
        "ingredients": [
            "2 tablespoons active dry yeast ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 1/2 tablespoons honey ADVERTISEMENT",
            "1 3/4 cups whole wheat pastry flour ADVERTISEMENT",
            "2 cups butter (cut into 1/2 inch cubes) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes. Stir in honey and 3/4 cup flour. Whisk until smooth. Cover bowl and let stand for 1 1/2 hours.\nIn a large bowl, combine butter pieces with remaining cup flour. Pour in yeast batter and stir to moisten. Turn dough onto lightly floured surface, pat dough down and roll into a rectangle. Fold 1/3 of dough toward center then fold other side of dough over first 1/3. Lift dough and scrape work surface clean. Sprinkle area with flour and repeat; rolling and folding 3 more times. Dough must be hard; if not, freeze for 45 minutes.\nPat dough into rectangle. Cut into 3 parts, 1 part for each 4 croissants. Work with one piece at a time, holding others in refrigerator until ready to use. Roll each piece individually into 1/4 inch thick rectangles. Cut into two pieces. Cut each piece crosswise diagonally to form 4 triangles. Roll from wide end to point and curve ends to form a crescent shape. Place on ungreased cookie sheets.\nIn a small bowl, beat together egg and water. Brush croissants with egg wash and set aside to rise for 1 hour. Meanwhile, preheat oven to 375 degrees F (190 degrees C). Glaze croissants with the egg mixture once more before baking.\nBake in preheated oven until puffed and brown, about 15 minutes. Let cool slightly and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Scalloped Oysters II",
        "ingredients": [
            "1 pint shucked oysters ADVERTISEMENT",
            "8 ounces saltine crackers, crushed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 3/4 cups milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 2 quart baking dish and set aside.\nPlace oysters and their liquid in a 4 quart saucepan. Cook over medium heat until oysters curl around the edges. Remove from heat and set aside.\nIn a mixing bowl, whisk together egg and 1/3 cup milk. Add 1/2 of the crushed crackers, oysters and any remaining liquid; mix together well.\nPlace 1/2 of remaining crushed crackers into prepared pan. Pour oyster mixture into pan and cover with the last of the crushed crackers. Add enough milk to almost submerge crackers. Dot top with butter. Sprinkle with salt and pepper to taste.\nBake at 350 degrees F (175 degrees C) for 1 hour.\n",
        "picture_link": "AwciH9iLFjC08Fi4Jso67fcc9wMbZwm"
    },
    {
        "title": "Berry Valentine Pie",
        "ingredients": [
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1 (16 ounce) package frozen strawberries, thawed and drained ADVERTISEMENT",
            "3 (7 ounce) cans whipped cream ADVERTISEMENT",
            "1 (16.5 ounce) can pitted dark sweet cherries ADVERTISEMENT",
            "1 (15 ounce) can blueberries ADVERTISEMENT",
            "2 graham crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "On bottom of pie crust, spread strawberries evenly; cover with whipped cream.\nSpread cherries on whipped cream and cover cherries with whipped cream layer.\nSpread blueberries on top of whipped cream and cover with last layer of whipped cream.\nSprinkle crumbled crackers on top of pie and place in the refrigerator for 45 minutes; serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pineapple and Lemon Pie",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "1 (20 ounce) can unsweetened pineapple chunks, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nRoll out half of pastry to line pie pan, and roll out other half to cut into strips for lattice top.\nIn a medium mixing bowl combine eggs, sugar, flour, salt, lemon juice, and grated lemon rind. Mix well then stir in pineapple. Spread filling into pastry-lined pie pan, make lattice top, and crimp edges. Place in preheated oven and bake 40 minutes or until filling is set and crust is lightly browned. Chill before serving.\n",
        "picture_link": "297VjD1u.5bLq2lZD3CB7EHFtnoeNVS"
    },
    {
        "title": "Sauerkraut and Tomato Stew",
        "ingredients": [
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 (28 ounce) cans stewed tomatoes ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup uncooked long-grain white rice ADVERTISEMENT",
            "1 (20 ounce) can sauerkraut with juice ADVERTISEMENT",
            "1 pound kielbasa sausage, sliced thin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, saute the onion and green bell pepper in the oil for 5 to 10 minutes, or until the onion is translucent.\nPour in the tomatoes, water and rice. Raise heat to high and bring to a boil, then reduce heat to low and simmer for 20 minutes.\nStir in the sauerkraut and sausage, stirring thoroughly, and let simmer for 20 more minutes. Season with salt and pepper to taste.\n",
        "picture_link": "7l51S7oBxri.mON1EbsEyRqD/AP3XbC"
    },
    {
        "title": "Country French Cheese",
        "ingredients": [
            "1/2 pound bacon - cooked and crumbled ADVERTISEMENT",
            "1 pound cream cheese ADVERTISEMENT",
            "1/2 pound shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup French dressing ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nIn a large bowl, combine the bacon, cream cheese, Cheddar cheese and salad dressing. Mix together well and form into a ball.\nIn a shallow dish, mix together the parsley and chopped walnuts. Roll cheese ball in mixture to coat. Refrigerate until chilled.\n",
        "picture_link": "nkXv1BVFhg700Q/Ep/86oGB94DOKLJG"
    },
    {
        "title": "Refrigerator Rolls II",
        "ingredients": [
            "1 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 tablespoon active dry yeast ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine yeast mixture, butter, remaining white sugar, egg, whole wheat flour and salt; beat well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. Cover dough and refrigerate for at least two hours and up to one week.\nBreak off small even pieces of dough, form into rounds and place in greased muffin tins. Let dough rise until nearly doubled, about 90 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\nBake in preheated oven for 15 to 20 minutes, until golden.\n",
        "picture_link": "Z2MkZcOEBt1lRGYYCZ7aOR60Pu7C33S"
    },
    {
        "title": "Sugar Snaps",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nIn a medium bowl, cream together the butter, shortening, and sugar. Beat in the egg yolks one at a time, then stir in the vanilla. Combine the flour, baking soda, and salt; stir into the creamed mixture. Roll dough into walnut size-balls and place 2 inches apart onto an unprepared cookie sheet.\nBake for 20 minutes in the preheated oven. Cool on wire racks.\n",
        "picture_link": "SoEDat0fR0C5G8M64iu0W7bl9rTKiFm"
    },
    {
        "title": "Lime Cilantro Vinaigrette",
        "ingredients": [
            "2/3 cup fresh lime juice ADVERTISEMENT",
            "2/3 cup packed cilantro leaves ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend lime juice, cilantro, vinegar, garlic, cumin, and salt in a blender until smooth. Stream olive oil into the mixture while continuing to blend until emulsified into a smooth, pourable dressing.\n",
        "picture_link": "h6T0PKF5imfFCieNBZQDsUOJ4F4XWIC"
    },
    {
        "title": "Cherry Cream Pie",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 (3 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (12 ounce) can cherry pie filling, divided ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese, sour cream, and milk together in a bowl. Stir pudding mix into the cream cheese mixture. Fold about half the cherry pie filling into the cream cheese mixture; spread into the prepared pie crust and top with remaining pie filling.\nRefrigerate until set and chilled completely, about 2 hours.\n",
        "picture_link": "NqOkG5ca3yTgEnOq/Im1TFps2eT0Csa"
    },
    {
        "title": "Bacon-Wrapped Dates Stuffed with Manchego Cheese",
        "ingredients": [
            "4 ounces manchego cheese, cut into 24 small cubes ADVERTISEMENT",
            "24 dried pitted dates ADVERTISEMENT",
            "8 slices bacon, cut into thirds ADVERTISEMENT",
            "24 wooden toothpicks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nStuff 1 piece manchego cheese into each date and then wrap with 1 piece bacon, securing with a toothpick. Arrange dates in a shallow baking dish with the bacon seam down and 1 inch between pieces.\nBake in preheated oven for 5 minutes, turn dates with tongs, and continue baking until bacon is crisp, 5 to 6 minutes more. Drain on a plate lined with paper towels.\n",
        "picture_link": "pC5dt6cXenDEvwDiiUy82dgXepQcAbm"
    },
    {
        "title": "Hard Lemonade",
        "ingredients": [
            "1 lemon ADVERTISEMENT",
            "4 cups water, or as needed, divided ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "6 large lemons, juiced ADVERTISEMENT",
            "1 1/2 cups vodka ADVERTISEMENT",
            "1 cup ice cubes, or as needed ADVERTISEMENT",
            "1 large lemon, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Zest 1 lemon into large pieces using a knife. Place lemon zest in a saucepan; top with 1 cup water and sugar. Bring lemon zest mixture to a boil, stirring occasionally, until sugar dissolves and liquid is syrupy, 5 to 10 minutes. Remove saucepan from heat and cool; remove and discard lemon zest.\nStir lemon juice and vodka together in a pitcher; pour in lemon syrup. Stir in enough water to fill the pitcher.\nFill glasses with ice; pour hard lemonade into each glass. Garnish each glass with a lemon slice.\n",
        "picture_link": "KucorVtr6/o2jI5E61vHoAsaSd5egXi"
    },
    {
        "title": "Homemade Grape Nuts®",
        "ingredients": [
            "3 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with waxed paper.\nCombine flour, brown sugar, salt, baking soda, and cinnamon in a large bowl. Stir in buttermilk and vanilla extract; mix well. Pour mixture into prepared baking sheet and spread evenly with a spatula.\nBake in the preheated oven until browned and firm, 20 to 25 minutes. Cool patty in the baking sheet for 10 minutes before removing to cool completely on a wire rack.\nPreheat oven to 275 degrees F (135 degrees C).\nBreak cooked patty into chunks and put through a meat grinder, using a coarse blade. Divide crumbs over two baking sheets.\nBake in the oven until dry, stirring every 10 minutes, about 30 minutes. Allow crumbs to cool completely and store in an airtight container.\n",
        "picture_link": "cIOsLLW2fNQbSGWrGADdYQY52Qd/gzG"
    },
    {
        "title": "Classic Beef Stew from Birds Eye®",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound boneless beef sirloin, cubed ADVERTISEMENT",
            "1 (16 ounce) bag Birds Eye® Recipe Ready Stew Blend ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large deep nonstick skillet over medium high heat and brown beef.\nStir in Recipe Ready Stew Blend, tomatoes and beef broth. Reduce heat to low and simmer covered 20 minutes or until beef is tender.* Season, if desired, with salt and black pepper and sprinkle with chopped parsley. For thicker stew, gently mash 2 potatoes using a fork; stir to blend.\n",
        "picture_link": "7uNDDGGt6/R3zI0jQvlPVyC47Njq9tG"
    },
    {
        "title": "Pineapple-Coconut Sauce",
        "ingredients": [
            "3/4 cup crushed pineapple in juice, divided ADVERTISEMENT",
            "1/2 cup cream of coconut, divided ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend 1/2 cup crushed pineapple and cream of coconut in a blender until smooth. Add heavy cream and pulse to blend; pour into a bowl.\nFold remaining crushed pineapple into the blended mixture. Cover bowl with plastic wrap and refrigerate at least 30 minutes.\n",
        "picture_link": "XDeqmhquqS3.IFpBgC7MbeMk7bp3H8G"
    },
    {
        "title": "No-Bake White Chocolate Cheesecake",
        "ingredients": [
            "1/2 cup white chocolate chips ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chocolate chips in a saucepan over medium heat until melted; remove from heat. Whisk cream cheese into the melted chocolate until melted. Fold whipped topping into the chocolate mixture; spread into the graham cracker crust.\nCover pie with plastic wrap and refrigerate until chilled, at least 1 hour.\n",
        "picture_link": "FoTc/gKC9a7ijSShTReO0Lmx7Asf18S"
    }
]