[
    {
        "title": "Bean Soup",
        "ingredients": [
            "1 (16 ounce) package dried navy beans ADVERTISEMENT",
            "7 cups water ADVERTISEMENT",
            "1 ham bone ADVERTISEMENT",
            "2 cups diced ham ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 cup sliced carrots ADVERTISEMENT",
            "1/2 cup sliced celery ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rinsed beans into a large stock pot. Add water and bring to a boil. Boil gently for 2 minutes; remove from heat, cover and let stand for 1 hour.\nAdd ham bone, cubed ham, onion, salt, pepper and bay leaves. Bring to a boil; reduce heat, cover and simmer for 1 hour and 15 minutes or until beans are soft. Occasionally skim service of soup while it is cooking.\nAdd carrots and celery, cook until tender. Remove ham bone, scrape any meat from bone and place back into soup and serve.\n",
        "picture_link": "/MByEetpQ1EjbPQ5USu5YHMH5jXdq86"
    },
    {
        "title": "Bar Cookies from Cake Mix",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Mix in water and egg, then stir in cake mix. Finally, mix in nuts and chocolate chips. Spread mixture into pan.\nBake for 30 to 35 minutes in the preheated oven. Cool completely before cutting into bars.\n",
        "picture_link": "F89TzX0glWVLDnVMMKAbdOUdrA1AXGe"
    },
    {
        "title": "Marinated Greek Chicken Kabobs",
        "ingredients": [
            "1 (8 ounce) container fat-free plain yogurt ADVERTISEMENT",
            "1/3 cup crumbled feta cheese with basil and sun-dried tomatoes ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon crushed dried rosemary ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into 1 inch pieces ADVERTISEMENT",
            "1 large red onion, cut into wedges ADVERTISEMENT",
            "1 large green bell pepper, cut into 1 1/2 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large shallow baking dish, mix the yogurt, feta cheese, lemon zest, lemon juice, oregano, salt, pepper, and rosemary. Place the chicken in the dish, and turn to coat. Cover, and marinate 3 hours in the refrigerator.\nPreheat an outdoor grill for high heat.\nThread the chicken, onion wedges, and green bell pepper pieces alternately onto skewers. Discard remaining yogurt mixture.\nGrill skewers on the prepared grill until the chicken is no longer pink and juices run clear.\n",
        "picture_link": "P4sIFR1P9DkGKmiy7WmbQO7jeCUK75O"
    },
    {
        "title": "Southern Praline Pecan Cake",
        "ingredients": [
            "1 (18.25 ounce) package butter pecan cake mix ADVERTISEMENT",
            "1 (16 ounce) container coconut pecan frosting ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9 or 10 inch Bundt pan with non-stick cooking spray.\nCombine the cake mix with the frosting, eggs, oil, water and 1/2 of the pecan pieces. Mix until combined.\nSprinkle the remaining 1/2 of pecans in the prepared Bundt pan then pour in the cake batter.\nBake at 350 degrees F (175 degrees C) for 50 minutes or until a toothpick comes out clean.\n",
        "picture_link": "Mp0egFxx70ewHb2pd/H07X8.Kjog5Da"
    },
    {
        "title": "Southern as You Can Get Collard Greens",
        "ingredients": [
            "1 bunch collard greens - rinsed, trimmed and chopped ADVERTISEMENT",
            "2 smoked ham hocks ADVERTISEMENT",
            "2 (10.5 ounce) cans condensed chicken broth ADVERTISEMENT",
            "21 fluid ounces water ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the collard greens and ham hocks in a large pot. Mix in the chicken broth, water, and vinegar. Season with salt and pepper. Bring to a boil, reduce heat to low, and simmer 1 hour.\n",
        "picture_link": "z44nXlUQ/QP9pPnkopdbGQsmD3BgAU2"
    },
    {
        "title": "Peach-a-Berry Pie",
        "ingredients": [
            "4 cups fresh peaches - peeled, pitted, and sliced ADVERTISEMENT",
            "1 cup fresh raspberries ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 (9 inch) pie crusts ADVERTISEMENT",
            "2 tablespoons butter, softened and cut into pieces ADVERTISEMENT",
            "1 tablespoon coarse granulated sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace peaches and berries in a colander for about 15 minutes to drain any excess fluid , then transfer to a large bowl. Gently toss with sugar, flour, and cinnamon. Transfer to a pie crust. Dot with butter, and top with remaining crust. Cut vents in top crust, and sprinkle with coarse sugar.\nBake 45 minutes in the preheated oven, until crust is golden brown.\n",
        "picture_link": "5bGWUrRF3HxOpb02Zd8ZVVPfE/M.C8C"
    },
    {
        "title": "Slow Cooker Thai Peanut Pork",
        "ingredients": [
            "2 red bell pepper, seeded and sliced into strips ADVERTISEMENT",
            "4 (8 ounce) boneless pork loin chops ADVERTISEMENT",
            "1/2 cup teriyaki sauce ADVERTISEMENT",
            "1/4 cup creamy peanut butter ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/4 cup chopped roasted peanuts ADVERTISEMENT",
            "2 limes, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat a slow cooker with cooking spray. Place the bell pepper strips and pork chops into the slow cooker. Pour the teriyaki sauce, vinegar, red pepper flakes, and garlic over the pork chops.\nCover and cook on Low until the pork is very tender, 8 to 9 hours. Once tender, remove the pork from the slow cooker, and whisk in the peanut butter until smooth. Return the pork to the slow cooker, and cook 10 minutes more.\nPour into a serving dish and sprinkle with green onions and peanuts to garnish. Decorate with lime wedges to serve.\n",
        "picture_link": "m5PG8oZPOY3SekCDop4fyK/m/4Txo02"
    },
    {
        "title": "Blue Ribbon Sugar Cookies",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 teaspoons lemon extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Sift together the flour, cream of tartar, baking soda and salt; set aside.\nIn a large bowl, cream together the butter, oil, confectioners' sugar and white sugar until well blended. Stir in the eggs, vanilla and lemon extracts. Gradually mix in the dry ingredients until well blended. Roll the dough into walnut sized balls. Place the cookies 2 inches apart onto the cookie sheet. Flatten cookies to 1/8 inch thickness using the bottom of a glass dipped in sugar. Colored sugar may be used if you do not plan to frost cookies later.\nBake for 9 to 12 minutes in the preheated oven, or until the edges are golden brown. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "jpjPK4n.dWjuar0YUFcrryn1tyJL.Gm"
    },
    {
        "title": "Spanish Rice Original",
        "ingredients": [
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup tomato sauce ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "2 onions, diced ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "2 green bell peppers, diced ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon salt and ground black pepper ADVERTISEMENT",
            "1 (10 ounce) can sliced black olives, drained (optional) ADVERTISEMENT",
            "1 (10 ounce) can whole kernel corn, drained (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken broth and tomato sauce to a boil in a small saucepan, about 5 minutes. Reduce heat to medium and maintain a simmer while preparing the remaining ingredients.\nMeanwhile, place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon to a paper towel-lined plate, reserving bacon grease in the skillet. Chop bacon.\nCook and stir onion in reserved bacon grease over medium heat until tender, about 5 minutes. Stir in rice; cook and stir until lightly browned, 3 to 5 minutes. Pour boiling chicken broth and tomato sauce into rice mixture; add diced tomatoes, green peppers, and chopped bacon. Season with chili powder, salt, and pepper. Cover and simmer until rice is tender and liquid is absorbed, 30 to 40 minutes. Stir black olives and corn into rice mixture before serving.\n",
        "picture_link": "5qVB1ETLlanJ/cVKKZzI9CUY3lifCYO"
    },
    {
        "title": "Bread Machine Garlic Bread",
        "ingredients": [
            "1 cup warm water (110 degrees F) ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon dry milk powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 tablespoons dried parsley ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Basic Bread cycle; press Start.\n",
        "picture_link": "sL8a6fp2ur2tEhdY/qmV3dVWkenCX.6"
    },
    {
        "title": "Chinese Pork Chops",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "6 boneless pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the soy sauce, brown sugar, lemon juice, vegetable oil, ginger, and garlic powder. Set aside some of the mixture in a separate bowl for marinating during cooking. Pierce the pork chops on both sides with a fork, place in a large resealable plastic bag, and cover with the remaining marinade mixture. Refrigerate 6 to 8 hours.\nPreheat the grill for high heat.\nLightly oil the grill grate. Discard marinade, and grill pork chops 6 to 8 minutes per side, or to desired doneness, marinating often with the reserved portion of the marinade.\n",
        "picture_link": "DqZGoiRD7lrQSYKhWWiYAmjwlXJgZPu"
    },
    {
        "title": "Chicken Supreme III",
        "ingredients": [
            "4 skinless, boneless chicken breast half - cut into cubes ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "6 ounces dry bread stuffing mix ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a non-stick skillet over medium heat, cook and stir the chicken and onion until the chicken is no longer pink and juices run clear.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a 2 quart casserole dish.\nIn a medium bowl, blend the melted butter, 1 1/3 cups water, and dry stuffing mix. Place 1/2 the chicken and onion mixture in the prepared dish, and cover with the stuffing mixture. Cover with the remaining chicken mixture. In a small bowl, mix the 1/4 cup water and cream of chicken soup, and pour into the dish. Top with the Cheddar cheese.\nBake 30 minutes in the preheated oven, or until bubbly and lightly browned.\n",
        "picture_link": "TfJ1djQ9HaCSEDuo2CL6MfPYK.rXeEO"
    },
    {
        "title": "Glazed Corned Beef",
        "ingredients": [
            "4 1/2 pounds corned beef, rinsed ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup apricot preserves ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCoat a large pan with non-stick cooking spray. Place corned beef in dish and add water. Cover tightly with aluminum foil and bake for 2 hours; drain liquid.\nIn a small bowl combine apricot preserves, brown sugar, and soy sauce. Spread the apricot mixture evenly over the corned beef.\nBake uncovered at 350 degrees F (175 degrees C) 25 to 30 more minutes, or until the meat is tender; basting occasionally with pan drippings.\nSlice corned beef across grain and serve.\n",
        "picture_link": "CpKq1eexDVMT.3HlX.p440I0nfEBEPS"
    },
    {
        "title": "Mom's Baking Powder Biscuits",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "5 tablespoons shortening ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a bowl mix the flour, baking powder and salt. Add the shortening and mix until in little pieces. Add milk a little at a time and mix until it forms a ball.\nRoll out on floured board to 1/4 inch to 1/2 inch thick. Cut out in desired size and dip in melted shortening. Place biscuits on an ungreased baking sheet.\nBake at 450 degrees F (230 degrees C) for 12 to 15 minutes.\nVariation: For shortcakes add 2 tablespoons for sugar to the dough and roll dough out to 1/2 inch thick.\n",
        "picture_link": "WLjo9Fu6cfjCoXU0bRp8Z0Rb//EtCTS"
    },
    {
        "title": "Basic Cheesecake",
        "ingredients": [
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/4 cup finely chopped walnuts ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "5 tablespoons butter, melted ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine graham cracker crumbs, chopped walnuts, brown sugar, cinnamon, nutmeg and melted butter. Mix well and press into the bottom of a 9 inch springform pan. Bake in preheated oven for 10 minutes. Remove from oven and allow to cool.\nIn a large bowl, beat cream cheese and sugar together until smooth. Beat in sour cream and heavy cream. Blend in the flour and vanilla. With mixer on low speed, add eggs one at a time. Pour batter over crust.\nBake in the preheated oven for 60 to 70 minutes, or until center is almost set (filling will be soft). Refrigerate at least 6 hours or overnight before removing from pan.\n",
        "picture_link": "wWiwE.WzpC5ynLZQGG3xD57kVtxU4B2"
    },
    {
        "title": "Chocolate Cheese Frosting",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, beat together the cream cheese, 3 tablespoons milk, confectioner's sugar, butter, vanilla, cocoa, and cinnamon to a spreadable consistency. Beat in additional milk if necessary. For a darker frosting add more cocoa or up to 4 ounces melted chocolate. Spread onto cooled cake.\n",
        "picture_link": "azxPa7XKgFHhNVrA34c1tyEIOKQheFq"
    },
    {
        "title": "Margaritas on the Rocks",
        "ingredients": [
            "2 cups sweet and sour mix ADVERTISEMENT",
            "1 cup triple sec ADVERTISEMENT",
            "1 1/2 cups gold tequila ADVERTISEMENT",
            "1/3 cup brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "2 limes, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Salt the rims of 8 glasses. To do so, pour salt onto a small plate, rub the rims of the glasses with lime, and press them into the salt. Fill the glasses with ice.\nIn a blender, combine sweet and sour mix, triple sec, tequila and Grand Marnier. Blend until smooth. Pour into glasses, squeeze a quarter lime into each glass, and serve.\n",
        "picture_link": "2S7Q4d4f/jtQt3MsdU8TON83kBzB5Hy"
    },
    {
        "title": "Homemade Banana Pudding Pie",
        "ingredients": [
            "2 cups vanilla wafer crumbs ADVERTISEMENT",
            "3 bananas, sliced into 1/4 inch slices ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLine the bottom and sides of a 9-inch pie plate with a layer of alternating vanilla wafer crumbs and banana slices.\nTo Make Pudding: In a medium saucepan, combine 1 1/2 cups sugar with flour. Mix well, then stir in half the milk. Beat egg yolks and whisk into sugar mixture. Add remaining milk and butter or margarine.\nPlace mixture over low heat and cook until thickened, stirring frequently. Remove from heat and stir in vanilla extract. Pour half of pudding over vanilla wafer and banana layer while still hot.\nMake another layer of alternating vanilla wafers and banana slices on top of pudding layer. Pour remaining pudding over second wafer and banana layer.\nTo Make Meringue: In a large glass or metal bowl, beat egg whites until foamy. Gradually add 1/4 cup sugar, continuing to beat until whites are stiff. Spread meringue into pie pan, making sure to completely cover pudding layer.\nBake in preheated oven for 15 minutes, just until meringue is browned. Chill before serving.\n",
        "picture_link": "YUKE4RsWPjSck0fgz.IuUQVI1L0fKsS"
    },
    {
        "title": "Tuna Fish Salad ",
        "ingredients": [
            "1 (5 ounce) can tuna, drained ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/4 cup chopped celery ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "paprika to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the tuna, celery, onion, mayonnaise, lemon juice, parsley, garlic powder, salt and pepper. Mix well and refrigerate until chilled. Sprinkle with paprika if desired.\n",
        "picture_link": "ou2sjOEGzd3V1diKx/ue7zk1Pz4cHmC"
    },
    {
        "title": "Absolutely Sinful Chocolate Chocolate Chip Cookies",
        "ingredients": [
            "2 1/2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup sour cream ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). In the microwave or over a double boiler, melt unsweetened chocolate and butter together, stirring occasionally until smooth. Sift together flour, baking soda, baking powder, and salt; set aside.\nIn a medium bowl, beat sugar, eggs, and vanilla until light. Mix in the chocolate mixture until well blended. Stir in the sifted ingredients alternately with sour cream, then mix in chocolate chips. Drop by rounded tablespoonfuls onto ungreased cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely. Store in an airtight container.\n",
        "picture_link": "Dginf7WLOXU6H7hmDIq2FbKJU.iLIly"
    },
    {
        "title": "Chocolate Banana Bread Pudding",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "4 cups cubed French bread ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.\nIn a large mixing bowl, mix eggs, milk, sugar, and vanilla until smooth. Stir in bread, bananas, and chocolate chips, and let rest 5 minutes for bread to soak. Pour into prepared pan.\nLine a roasting pan with a damp kitchen towel. Place loaf pan on towel inside roasting pan, and place roasting pan on oven rack. Fill roasting pan with water to reach halfway up the sides of the loaf pan. Bake in preheated oven for 1 hour, or until a knife inserted in the center comes out clean.\n",
        "picture_link": "z4wACfbgkmHG60i31BZ2CPNP.9gPJBC"
    },
    {
        "title": "Sausage, Potato and Kale Soup",
        "ingredients": [
            "1 pound bulk Italian sausage ADVERTISEMENT",
            "4 cups half-and-half ADVERTISEMENT",
            "3 cups cubed potatoes ADVERTISEMENT",
            "2 cups low-sodium chicken broth ADVERTISEMENT",
            "2 cups whole milk ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups torn kale leaves (bite-size pieces) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large soup pot over medium-high heat. Crumble sausage into pot; cook and stir until browned, about 10 minutes. Drain and discard grease.\nStir half-and-half, potatoes, chicken broth, milk, onion, oregano, and red pepper flakes into sausage, bring to a boil, and reduce heat to low. Simmer until potatoes are tender, about 30 minutes. Season with black pepper; stir kale into soup. Simmer until kale is tender, 10 to 15 more minutes.\n",
        "picture_link": "XVcjMqFYmig/BVgzOq.AQDPKXau29u."
    },
    {
        "title": "Spicy Beef Curry Stew for the Slow Cooker",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound beef stew meat ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon chopped fresh ginger ADVERTISEMENT",
            "1 fresh jalapeno peppers, diced ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1 onion, sliced and quartered ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat, and brown the beef on all sides. Remove from skillet, reserving juices, and season with salt and pepper. Cook and stir the garlic, ginger, and jalapeno in the skillet for 2 minutes, until tender, and season with curry powder. Mix in the diced tomatoes and juice.\nPlace the onion in the bottom of a slow cooker, and layer with the browned beef. Scoop the skillet mixture into the slow cooker, and mix in the beef broth.\nCover, and cook 6 to 8 hours on Low.\n",
        "picture_link": "X2nUK9lHLQ.0HXxvueIHi6PWbDkxdPu"
    },
    {
        "title": "Spinach and Rice (Spanakorizo)",
        "ingredients": [
            "1/3 cup olive oil ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 pounds fresh spinach, rinsed and stemmed ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup uncooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Saute onions in the oil until soft and translucent. Add spinach, and cook stirring for a few minutes, then pour in the tomato sauce and water. Bring to a boil, and season with parsley, dill, salt and pepper. Stir in rice, reduce heat to low, and simmer uncovered for 20 to 25 minutes, or until rice is tender. Add more water if necessary.\n",
        "picture_link": "i3hXbD0hRk25S65ArXcn6/Si2ZNcXqC"
    },
    {
        "title": "Sea Bass Cuban Style",
        "ingredients": [
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 1/2 cups thinly sliced white onions ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "4 cups seeded, chopped plum tomatoes ADVERTISEMENT",
            "1 1/2 cups dry white wine ADVERTISEMENT",
            "2/3 cup sliced stuffed green olives ADVERTISEMENT",
            "1/4 cup drained capers ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "4 (6 ounce) fillets sea bass ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Saute onions until soft. Stir in garlic, and saute about 1 minute. Add tomatoes, and cook until they begin to soften. Stir in wine, olives, capers, and red pepper flakes. Heat to a simmer.\nPlace sea bass into sauce. Cover, and gently simmer for 10 to 12 minutes, or until fish flakes easily with a fork. Transfer fish to a serving plate, and keep warm.\nIncrease the heat, and add butter to sauce. Simmer until the sauce thickens. Stir in cilantro. Serve sauce over fish.\n",
        "picture_link": "rz17d0R14DrflsZccmH8B.acyMCzShK"
    },
    {
        "title": "Brussels Sprouts Gratin",
        "ingredients": [
            "1 pound Brussels sprouts, cleaned and trimmed ADVERTISEMENT",
            "2 slices bacon, cut into 1/2 inch pieces ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons butter, cut into tiny pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Lightly grease a baking dish.\nBring a large pot of lightly salted water to a boil. Add the Brussels sprouts and cook uncovered until tender, about 8 minutes. Drain in a colander, then immediately immerse in ice water for several minutes until cold to stop the cooking process. Once the Brussels sprouts are cold, drain well, and cut in halves or quarters, depending on size. Set aside.\nMeanwhile, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until limp and lightly browned, about 5 minutes. Reduce heat and stir in the Brussels sprouts. Season with salt and pepper then toss for about 1 minutes to evenly distribute the seasonings. Arrange bacon and Brussels sprouts on the prepared baking dish. Pour cream evenly over the Brussels sprouts, then sprinkle breadcrumbs and Parmesan cheese on top. Distribute pieces of butter over the bread crumbs.\nBake in the preheated oven until golden brown and heated through, 20 to 25 minutes.\n",
        "picture_link": "oH95oNM9Io8bJNGnyT1fHNkb6hEZoOm"
    },
    {
        "title": "Herbed Chicken Nuggets",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup dried bread crumbs, seasoned ADVERTISEMENT",
            "1/2 cup wheat germ ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Spray a baking sheet with non-stick cooking spray.\nTrim any fat from chicken and cut into 1-inch cubes.\nIn a bowl, beat the eggs with the water and add the chicken.\nCombine the parsley, thyme, red pepper, bread crumbs, wheat germ, basil and pepper. Stir in the oil with a fork and mix well to distribute evenly. Pour seasoning mixture into a resealable plastic bag and toss the chicken pieces to coat.\nPlace coated chicken pieces on the prepared baking sheet and bake at 425 degrees F (220 degrees C) for 10 minutes, turn the pieces, and bake for an additional 5 minutes.\n",
        "picture_link": "qWQrKzenm6LijjZ7j6/2K.ao3QriDce"
    },
    {
        "title": "Lemon Cream Cheese Frosting",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "5 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese, butter, lemon juice, lemon rind, and vanilla together until smooth and fluffy. Add confectioners' sugar in 2 additions. Beat until creamy. Add more icing sugar or juice as needed for easy spreading. Makes about 3 2/3 cups.\n",
        "picture_link": "nE6wi722xggJeHX4OIx.ZNErgdSfaUy"
    },
    {
        "title": "Blueberry French Toast",
        "ingredients": [
            "1 (1 pound) loaf Italian bread, cut into 1-inch cubes ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, diced ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/3 cup maple syrup ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place half of the bread cubes in a lightly greased 9x13 inch baking pan. Sprinkle cream cheese on top of bread cubes. Top with 1 cup blueberries and remaining bread. In a large bowl, beat together eggs, milk and maple syrup. Pour egg mixture over bread. Cover pan and refrigerate overnight.\nThe next morning, remove pan from refrigerator 30 minutes before baking. Preheat oven to 350 degrees F (175 degrees C).\nCover pan with aluminum foil and bake in preheated oven for 30 minutes. Uncover pan and bake for an additional 30 minutes, until golden brown and center is set.\nTo make Sauce: In a saucepan, combine sugar and cornstarch, add water. Boil over medium heat for 3 minutes, stirring constantly. Stir in blueberries and reduce heat. Simmer 8 to 10 minutes, or until the berries have burst. Stir in butter until melted. Serve the sauce over squares of french toast.\n",
        "picture_link": "AZGF3UfTe5Lbz2X4PdZwKlKilyrPlqG"
    },
    {
        "title": "Scallops with White Wine Sauce II",
        "ingredients": [
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon minced shallot ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 pound sea scallops ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler.\nIn a skillet over medium heat, mix the chicken broth, wine, lemon juice, shallot, and garlic. Cook and stir until most of the liquid has been reduced. Stir in the butter until melted.\nBrush the scallops with olive oil, and season with salt and pepper. Arrange on a baking sheet.\nBroil the scallops in the preheated oven about 2 minutes on each side, or until opaque. Serve with the wine sauce.\n",
        "picture_link": "Baic3kPGgQD1oqPulN7ba7tJ2GAslCi"
    },
    {
        "title": "Cream Cheese Mints",
        "ingredients": [
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "2 drops peppermint oil ADVERTISEMENT",
            "any color food coloring paste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine cream cheese, butter, and confectioner's sugar. Mix in peppermint oil. Color as desired with food coloring paste, or leave white.\nRoll mixture into small balls, and place on waxed paper. Flatten with a fork dipped in confectioners' sugar. Let dry for about 2 hours on waxed paper, then freeze or refrigerate.\n",
        "picture_link": "Zpixd5J1VhyW0WTCqEhpazbMfO1Wdvm"
    },
    {
        "title": "Chocolate Mint Dessert Brownies",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups chocolate syrup ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 tablespoons creme de menthe liqueur ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nIn a large bowl, cream together 1 cup sugar and 1/2 cup of softened butter until smooth. Beat in eggs one at a time, then stir in the chocolate syrup. Stir in the flour until just blended. Spread the batter evenly into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, or until top springs back when lightly touched. Cool completely in the pan.\nIn a small bowl, beat the confectioners' sugar, 1/2 cup butter or margarine and creme de menthe until smooth. Spread evenly over the cooled brownies, then chill until set.\nIn a small bowl over simmering water, or in the microwave, melt the remaining 6 tablespoons of butter and the chocolate chips, stirring occasionally until smooth. Allow to cool slightly, then spread over the top of the mint layer. Cover, and chill for at least 1 hour before cutting into squares.\n",
        "picture_link": ".Pe962i29ys8nen/T5VsTXxAIzQlTnC"
    },
    {
        "title": "Bada Bing Bada Banged Potatoes",
        "ingredients": [
            "5 pounds small new potatoes ADVERTISEMENT",
            "3/4 cup olive oil ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/2 teaspoon dried rosemary, crumbled ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "3 tablespoons minced fresh parsley ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nPlace the potatoes in a large saucepan of water. Cover; bring to a boil over high heat. Reduce heat; gently cook potatoes until tender but still firm, about 20 minutes. Drain.\nPlace potatoes on a greased, rimmed baking sheet. Smash the warm potatoes with the heel of your hand or a small pan to flatten slightly and break the skin.\nMix together the olive oil, butter, 1 cup Parmesan cheese, basil, oregano, thyme, rosemary, garlic powder, red pepper flakes, salt, and pepper in a large bowl; add the potatoes and toss well. Return coated potatoes to baking sheet, leaving 1/2 inch space between each potato.\nRoast potatoes in the preheated oven until lightly browned and slightly crispy; about 30 minutes. Place hot potatoes on a large platter; sprinkle with parsley and the remaining 1/2 cup Parmesan cheese.\n",
        "picture_link": "0sJXyg2YrgdRsK5xR8L1NnIXqnrwKii"
    },
    {
        "title": "California Chicken Spaghetti",
        "ingredients": [
            "1 (16 ounce) package uncooked angel hair pasta ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "2 tablespoons Cajun-style blackened seasoning ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "10 roma (plum) tomatoes, diced ADVERTISEMENT",
            "2/3 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 5 to 8 minutes or until al dente. Drain.\nHeat olive oil in a large skillet over medium heat. Add chicken pieces, and cook, stirring until browned on the outside. Stir in the garlic, basil, Cajun seasoning, salt, and pepper, then mix in the tomatoes. Cook until tomatoes are semi soft, and chicken is cooked through. Toss with pasta, and serve with crumbled feta cheese on top.\n",
        "picture_link": "k968PFZhi4aAxZ5MCzUhd3xgsVGmWSi"
    },
    {
        "title": "Chocolate Cherry Cake III",
        "ingredients": [
            "1 (18.25 ounce) package devil's food cake mix ADVERTISEMENT",
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F (175 degrees C). Grease a 9 x 13 inch pan.\nIn a large bowl, combine cake mix, cherry pie filling, almond extract, and 2 eggs by hand; stir until well blended. Pour batter into prepared pan.\nBake for 25 to 30 minutes, or until it tests done. Cool.\nIn a small saucepan, combine sugar, butter or margarine, and milk. Boil, stirring constantly, for 2 minutes. Remove from heat, and stir in chocolate chips until smooth. Immediately pour over partially cooled cake.\n",
        "picture_link": "SGQ6T69F7MYzDnfRUNX3zjlST6s49Tm"
    },
    {
        "title": "Honey Balsamic Vinaigrette",
        "ingredients": [
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "2/3 cup extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the vinegar, onion, soy sauce, honey, sugar, garlic, and red pepper flakes into a blender. Puree on high, gradually adding the olive oil. Continue pureeing 2 minutes, or until thick.\n",
        "picture_link": "1eL/YI0YmX2vN/r8UMO.iUceypghTXW"
    },
    {
        "title": "San Francisco Pork Chops",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 (3/4 inch-thick) boneless pork chops, trimmed ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup beef broth ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon vegetable oil in a skillet over medium heat. Brown chops in hot oil, about 5 minutes per side; remove pork to a plate, reserving oil in skillet.\nCook and stir garlic in reserved drippings until fragrant, about 1 minute. Whisk beef broth, soy sauce, brown sugar, 2 teaspoons vegetable oil, and red pepper flakes in a bowl, dissolving brown sugar. Return pork chops to skillet and pour soy sauce mixture over the chops. Bring sauce to a boil, cover skillet, and reduce heat to low. Simmer chops until tender, 30 to 35 minutes, turning once halfway through cooking.\nTransfer chops to a serving platter. Whisk cornstarch and water in a small bowl until smooth; stir into pan juices and simmer until thickened, about 5 minutes. Pour sauce over chops to serve.\n",
        "picture_link": "/sRxSXL0kax.lKsQ9g4FPmVq2Y3ymx."
    },
    {
        "title": "Easy Chicken Casserole",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "32 buttery round crackers ADVERTISEMENT",
            "1/4 cup chopped onion (optional) ADVERTISEMENT",
            "1/4 cup chopped mushrooms (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBoil chicken until cooked through (no longer pink inside), about 20-30 minutes. Chop into bite size pieces and place in a 9x13 inch baking dish.\nCombine soup, sour cream, onion (optional) and mushrooms (optional). Pour mixture over chicken and top with crumbled crackers. Cover and bake at 350 degrees F (175 degrees C) for 30 minutes (or freeze for baking at another time).\n",
        "picture_link": "/kUsXEyVjKYIdCMHuly8LL.hfzMCNOK"
    },
    {
        "title": "Mozzarella-Stuffed Pesto Turkey Meatballs",
        "ingredients": [
            "3 pounds ground turkey ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "4 garlic cloves, minced ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup Italian-style bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "1/2 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "1/4 cup prepared pesto ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 teaspoons fresh ground black pepper ADVERTISEMENT",
            "1 pound fresh mozzarella, cut into small cubes ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 (24 ounce) jars marinara sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nPlace the ground turkey, onion, garlic, egg, bread crumbs, Parmigiano-Reggiano cheese, parsley, pesto, milk, salt, and black pepper in a bowl. Mix until evenly blended, then form into 1 3/4-inch meatballs. Make a hole in the meatball with your finger and place a cheese cube in the hole. Seal the meatball around the cheese and place on a nonstick baking sheet. Drizzle the olive oil over the meatballs.\nBake in the preheated oven until the meatballs are no longer pink in the center, about 30 minutes. Heat the marinara sauce in a saucepan over low heat. Bring to a simmer, and place the baked meatballs in the marinara sauce for about 2 minutes.\n",
        "picture_link": "GwS6Us3rlTBB.6iMN.GSR4znd3RRypq"
    },
    {
        "title": "Honey Crunch Pecan Pie",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "6 tablespoons cold water ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 tablespoon bourbon (optional) ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 1/2 cups pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Crust: In a medium bowl, mix together flour and 1 teaspoon salt. Cut in shortening until mixture is crumbly. Gradually add water and vinegar. Cut together until mixture will hold together. Press dough into a ball and flour each side lightly. Wrap in plastic and chill for 20 minutes. Roll out between wax paper into a circle 1/8 inch thick and press into 9 inch pie pan.\nTo Make Filling: In a large bowl, combine eggs, 1/4 cup brown sugar, white sugar, 1/2 teaspoon salt, corn syrup, melted butter, vanilla extract, and chopped pecans. Add bourbon if desired. Mix well. Spoon mixture into unbaked pie shell.\nBake in preheated oven for 15 minutes. Remove and cover edges of pastry with aluminum foil. Return to oven for 20 minutes.\nTo Make Topping: Combine 1/3 cup brown sugar, butter or margarine, and honey in a medium saucepan. Cook over low heat, stirring occasionally, until sugar dissolves - about 2 minutes. Add pecans. Stir just until coated. Spoon topping evenly over pie.\nKeep foil on edges of pastry and return pie to oven for an additional 10 to 20 minutes, until topping is bubbly and golden brown. Cool to room temperature before serving.\n",
        "picture_link": "2ERbNVfK1CCKuLRsBl5nZPV9bbZ3GMa"
    },
    {
        "title": "Quick Black Forest Cake",
        "ingredients": [
            "1 (18.25 ounce) package devil's food cake mix with pudding ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon almond extract ADVERTISEMENT",
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together: cake mix, beaten eggs, almond extract, cherry pie filling and 1 cup semisweet chocolate chips. Stir until just combined. Pour batter into a greased 9x13 inch pan.\nBake in a 350 degree F (175 degree C) oven for 45 to 50 minutes or until a toothpick inserted in the center comes out clean. Remove cake from oven and let cool.\nTo Make Glaze: Heat 1/2 cup semisweet chocolate chips, butter or margarine, and milk in a saucepan over medium high heat. Once semisweet chocolate chips are melted and mixture is combined stir in confectioners' sugar.\nSpread glaze over cooled cake. Serve cake as is or with whipped cream and a cherry.\n",
        "picture_link": "lN2E8bjCxuYeztHnRmpigwnkwoOBBcq"
    },
    {
        "title": "Mongolian Beef I",
        "ingredients": [
            "1 teaspoon sesame seeds ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound beef round steak, cut into thin strips ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 1/2 teaspoons cornstarch ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "2 carrots, thinly sliced ADVERTISEMENT",
            "1 bunch green onions, cut into 2 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a dry skillet over medium heat, toast sesame seeds for 1 to2 minutes, or until the seeds begin to turn golden brown; set aside.\nIn a medium bowl, mix together 1 tablespoon soy sauce, 1 tablespoon cornstarch, and minced garlic. Stir in beef strips. Let stand for at least 10 minutes.\nIn a separate small bowl, mix together water, 2 tablespoons soy sauce, 2 1/2 teaspoons cornstarch, sugar, sesame seeds, and red pepper flakes; set aside.\nHeat 1 tablespoon of oil in a wok or skillet over high heat. Cook and stir beef in hot oil for 1 minute; remove, and set aside. Heat remaining tablespoon of oil in the same pan. Saute carrots and white part of green onions for 2 minutes. Stir in green parts of the green onion, and saute for 1 minute. Stir in sesame seed mixture and beef. Cook and stir until sauce boils and thickens.\n",
        "picture_link": "q9RVojxC/s3V4..ciD7b5Ml80OwaLSm"
    },
    {
        "title": "Best Ever Crab Cakes",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "4 teaspoons lemon juice ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "1 tablespoon minced green onions ADVERTISEMENT",
            "8 ounces crabmeat ADVERTISEMENT",
            "1/2 cup crushed buttery round crackers ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, whisk together egg, mayonnaise, lemon juice, red pepper flakes, tarragon, and scallions. Gently stir in crabmeat, being careful not to break up meat. Gradually mix in cracker crumbs, adding until desired consistency is achieved.\nHeat butter in a skillet over medium heat. Form crab mixture into 4 patties. Place patties in skillet, and cook until golden brown, about 5 to 6 minutes on each side.\n",
        "picture_link": "hwHp1ijL7wz8CyqvK54hDileniVzmGe"
    },
    {
        "title": "Cajun Appetizer Meatballs",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 1/2 teaspoons hot pepper sauce ADVERTISEMENT",
            "2 tablespoons Cajun seasoning ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/4 cup finely chopped onion ADVERTISEMENT",
            "1/4 cup fresh bread crumbs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "1/2 cup peach preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking sheet.\nIn a large bowl, mix thoroughly the ground beef, hot pepper sauce, Cajun seasoning, Worcestershire sauce, parsley, onion, bread crumbs, milk, and egg.\nForm the mixture into golf ball sized meatballs and place on the prepared baking sheet. Bake in preheated oven for 30 to 40 minutes, or until there is no pink left in the middle.\nIn a small bowl, combine the barbeque sauce and peach preserves.\nWhen meatballs are done, place in a serving dish and cover with the barbeque sauce mixture. Toss to coat.\n",
        "picture_link": "7rFXM0xnSjW.zVFNeQt4p.7WrAv03bK"
    },
    {
        "title": "Gluten-Free Peanut Butter Cookies",
        "ingredients": [
            "2 cups peanut butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 cups semi-sweet chocolate chips (optional) ADVERTISEMENT",
            "1 1/2 cups chopped pecans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheet.\nCombine peanut butter, eggs, and sugar and mix until smooth. Mix in chocolate chips and nuts, if desired. Spoon dough by tablespoons onto a cookie sheet.\nBake for 10 to 12 minutes or until lightly browned. Let the cookies cool on the cookie sheets for 5 to 10 minutes before removing.\n",
        "picture_link": "5jXIba/JzBItUof63AfMenJPmO.jLtu"
    },
    {
        "title": "Crispy Barbequed Tofu Slices",
        "ingredients": [
            "1 (16 ounce) package extra firm tofu ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon barbeque sauce ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain tofu, and slice into strips. Place in a plastic bag or container, and freeze overnight. This will give the tofu a meatier texture. Thaw tofu strips, and blot with paper towels to dry.\nHeat olive oil in a large skillet over medium heat. In a small bowl, whisk together the egg white and 1 tablespoon of barbeque sauce. Combine the flour, salt, and pepper in a separate bowl. Dip the tofu slices into the egg mixture, then into the flour mixture, shaking off excess flour. Fry in the hot oil for about 1 minute on each side, until golden brown. Just fry enough at one time so they are not crowded. Remove from the oil to paper towels to drain and cool.\nPreheat the oven's broiler. Brush tofu slices with additional barbeque sauce, and allow to marinate while the broiler heats up. Arrange them on a broiler pan, or wire rack set over a cookie sheet for best results.\nPosition the oven rack about 6 inches from the heat source. Broil for 5 minutes on each side, or until browned and crisp, watching closely so as not to burn them. Serve warm with the remaining barbeque sauce for dipping.\n",
        "picture_link": "7H5UbQdXv3i8mXFtM.1I7OfcBpqMFQ."
    },
    {
        "title": "Blue Ribbon Overnight Rolls",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 cup warm milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together yeast, milk and sugar. Let stand for 30 minutes.\nMix eggs, butter and salt into yeast mixture. Mix in flour, 2 cups at a time. Cover with wax paper. Let dough stand at room temperature overnight.\nIn the morning, divide the dough in half. Roll each half into a 9 inch round circle. Cut each round into 12 pie shaped wedges. Roll up each wedge starting from wide end to the tip. Place on greased cookie sheets. Let stand until ready to bake.\nBake at 375 degrees F (190 degrees C) for 12 to 15 minutes.\n",
        "picture_link": "QKhkvFuPjNBntSCW4OxoVhZfejU6Qn6"
    },
    {
        "title": "Chicken and Bowtie Pasta with Asiago Cream Sauce",
        "ingredients": [
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "2 1/4 cups heavy cream, divided ADVERTISEMENT",
            "1/4 cube chicken bouillon, crumbled ADVERTISEMENT",
            "3/4 cup grated Asiago cheese ADVERTISEMENT",
            "1/2 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup chopped prosciutto ADVERTISEMENT",
            "1 tablespoon chopped fresh garlic ADVERTISEMENT",
            "1/4 cup sliced mushrooms ADVERTISEMENT",
            "1/2 tablespoon parsley flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook pasta for 8 to 10 minutes, or until al dente. Drain, and set aside.\nHeat 2 tablespoons vegetable oil in a skillet over medium-high heat. Cook and stir chicken cubes, reducing heat if necessary, until no longer pink in center and juices run clear. Set aside.\nIn a medium saucepan, bring 2 cups cream to a simmer, stirring often. Whisk in bouillon and cheese until well blended and bouillon has dissolved completely. Dissolve cornstarch in 2 tablespoons water, and whisk into mixture. Cook and stir 2 minutes more, then remove from heat and set aside.\nMelt butter in a medium skillet over medium high heat. Stir in prosciutto, garlic, and mushrooms and cook until mushrooms are tender, about 3 minutes. Add chicken, reduce heat, and continue cooking until chicken is heated through. Return sauce to the stove and add remaining 1/4 cup cream and parsley flakes. Heat through.\nTo serve, place pasta in a large mixing or serving bowl. Add chicken and mushroom mixture and pour in cream sauce. Toss well, and serve.\n",
        "picture_link": "12e7n6v.Kgkl9SfUscIq1lw72lruUIW"
    },
    {
        "title": "Pistachio Cake III",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "7 drops green food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch tube pan.\nIn a large bowl mix together cake mix and pudding mix. Make a well in the center and pour in eggs, water, oil, almond extract and green food coloring. Blend ingredients, then beat for 2 minutes at medium speed.\nPour into prepared 10 inch tube pan. Bake in the preheated oven for 50 to 55 minutes, or until cake springs back when lightly pressed. Cool in pan 15 minutes. Turn out onto a wire rack and cool completely.\n",
        "picture_link": "/lX9rKx230Bwx9mUqavpOmEHKt9GxT2"
    },
    {
        "title": "Decadent Peanut Butter Pie",
        "ingredients": [
            "1 cup Jif® Creamy Peanut Butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed and divided ADVERTISEMENT",
            "1 prepared chocolate pie crust ADVERTISEMENT",
            "1 (11.75 ounce) jar Smucker's® Hot Fudge Microwaveable Ice Cream Topping, divided ADVERTISEMENT",
            "2 tablespoons Jif® Creamy Peanut Butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat together 1 cup peanut butter, cream cheese and sugar in a medium bowl with an electric mixer on medium, until well combined. Gently mix in 3 cups whipped topping until thoroughly combined. Spoon mixture into pie shell. Using a spatula, smooth mixture to edges of pie.\nReserve 2 tablespoons of hot fudge topping into the corner of a resealable plastic bag. Microwave remaining topping, on HIGH (100% topping), for 1 minute. Stir. Spread topping over pie, covering entire peanut butter layer. Refrigerate until set. Spread remaining whipped topping (1 1/2 cups), over hot fudge layer, being careful not to mix the two layers.\nCut a small corner from bag containing topping. Squeeze bag to drizzle topping over pie. Place remaining 2 tablespoons peanut butter in a resealable food storage bag; cut bag corner and squeeze to drizzle in opposite direction from topping. Refrigerate until ready to serve.\n",
        "picture_link": "XZOpKBkrHl6/UUqEgeM6OuyErfJDyr2"
    },
    {
        "title": "Crab Quiche",
        "ingredients": [
            "1 (9 inch) deep dish frozen pie crust ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "3 dashes hot pepper sauce (e.g. Tabasco™), or to taste ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (8 ounce) package imitation crabmeat, flaked ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Bake the pie crust for about 10 minutes, until just starting to brown. Remove from the oven, and allow to cool.\nIn a large bowl, whisk together the eggs, cream, salt, pepper, and hot sauce. Stir in shredded cheese, onion and imitation crab. Pour into the pie shell.\nBake for 25 to 30 minutes in the preheated oven, then turn off the oven, but leave the door closed. Leave quiche in the oven for an additional 20 to 30 minutes until firm. This will give it a smoother texture.\n",
        "picture_link": "GaXKykKhWWpEKV8YnIWGK1H8d3YcjrO"
    },
    {
        "title": "Stephanie's Freezer Spaghetti Sauce",
        "ingredients": [
            "4 onions, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "16 cups chopped tomatoes ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker saute together the onion, garlic, green pepper, and vegetable oil. Cook until onion is transparent.\nAdd the chopped tomatoes, oregano, basil, parsley, sugar, salt, and ground black pepper. Cook for 2 to 3 hours on low heat. Stir frequently.\nLet sauce cool. Pour sauce into quart size freezer containers. Store in freezer.\nWhen ready to use sauce, stir in can of tomato paste.\n",
        "picture_link": "USyyYbj6LxXApdfuE1xnIwwvNHhn0HK"
    },
    {
        "title": "Sweet and Savory Kale",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "4 cups stemmed, torn and rinsed kale ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Stir in the onion and garlic; cook and stir until the onion softens and turns translucent, about 5 minutes. Stir in the mustard, sugar, vinegar, and chicken stock, and bring to a boil over high heat. Stir in the kale, cover, and cook 5 minutes until wilted.\nStir in the dried cranberries, and continue boiling, uncovered, until the liquid has reduced by about half, and the cranberries have softened, about 15 minutes. Season to taste with salt and pepper. Sprinkle with sliced almonds before serving.\n",
        "picture_link": "jmQXI/mOyx07pCI6gpeYGz4VovKUJLC"
    },
    {
        "title": "Seven-Up® Cake II",
        "ingredients": [
            "1 1/2 cups butter ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons lemon extract ADVERTISEMENT",
            "3/4 cup lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together the butter and sugar for 20 minutes. Add eggs, one at a time. Add flour, lemon extract and fold in the 7UP (TM) soft drink.\nPour into a well-greased 12 cup Bundt pan. Bake at 325 degrees F (165 degrees C) for 60 to 75 minutes.\n",
        "picture_link": "Iw3yjrfNsEE0dI0JX7rmXaqzvoSvwau"
    },
    {
        "title": "Strawberries and Cream Cake",
        "ingredients": [
            "2 3/4 cups cake flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 (3 ounce) package strawberry flavored Jell-O® ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup strawberries, pureed ADVERTISEMENT",
            "1 1/2 cups heavy cream ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups fresh strawberries, sliced ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups quartered strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round cake pans.\nIn a large bowl, beat sugar, gelatin and butter until fluffy. Add eggs one at a time, beating well with each addition. Mix flour and baking powder, and beat alternately with the milk into the sugar mixture. Fold in 1 teaspoon vanilla and pureed strawberries. Divide equally into three 9 inch round cake pans.\nBake 25 minutes in the preheated oven, or until toothpick inserted into cake comes out clean. Cool for 10 minutes in the pans, then remove from pans and cool completely.\nTo make the filling: Beat whipping cream, 2 tablespoons sugar and 1/2 teaspoon vanilla on high until stiff. Fill each layer with 1/3 of the whipped cream and 3/4 cup sliced strawberries.\nTo make the frosting: Beat the margarine, cream cheese, confectioners' sugar, and vanilla until creamy. Spread over the sides of the cake, and pipe an edge of frosting around the top of the cake.\nSpread remaining whipped cream on cake top. Top with quartered strawberries.\n",
        "picture_link": "dG.9yMaVhXzEtaDrm16z9yM6IXIn1G2"
    },
    {
        "title": "Maria's Rice",
        "ingredients": [
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 (10.5 ounce) can condensed French onion soup ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "1/2 cup butter, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a 9x9 inch baking dish combine rice, soup and broth. Place butter slices on top of the mixture.\nCover with foil and bake for 30 minutes. Remove cover and bake 30 minutes more.\n",
        "picture_link": "iNdRH/psViACJj.UGlFaLcTgECbBlxS"
    },
    {
        "title": "Gnocchi Bake",
        "ingredients": [
            "1 (18 ounce) package frozen or fresh gnocchi ADVERTISEMENT",
            "1 pound bulk Italian sausage ADVERTISEMENT",
            "1 (14 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add gnocchi, and cook until tender, 5 to 8 minutes.\nMeanwhile, crumble the sausage into a skillet over medium-high heat. Cook and stir until evenly browned. Drain grease, and stir in the spaghetti sauce. Remove from heat, and carefully mix in the cooked gnocchi and half of the mozzarella cheese. Transfer to a casserole dish. Sprinkle the remaining cheese on top.\nBake for 15 to 20 minutes in the preheated oven, until the cheese is melted and the sauce is bubbly.\n",
        "picture_link": "EP2qppGQKKT519l1baueo05lbiE0qna"
    },
    {
        "title": "Pork Carnitas",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "4 pounds pork shoulder, cut into several large pieces ADVERTISEMENT",
            "3 tablespoons kosher salt ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "3 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "4 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nHeat the vegetable oil in a large Dutch oven over high heat. Season the pork shoulder with salt, then arrange the pork in the Dutch oven. Cook until browned on all sides, about 10 minutes. Add the onion, garlic, lime juice, chili powder, oregano, and cumin. Pour in the chicken broth, and bring to a boil. Reduce heat to medium-low, cover, and continue to simmer until pork is very tender, about 2 1/2 hours.\nTransfer the pork shoulder to a large baking sheet, reserving the cooking liquid. Drizzle with a small amount of the reserved cooking liquid and lightly season with salt.\nBake the pork in the preheated oven until browned, about 30 minutes. Drizzle more of the cooking liquid on the meat every 10 minutes, and use two forks to shred the meat as it browns.\n",
        "picture_link": "m9LkrGgRDS4vFdD3aPdbDjX1PhX1ypS"
    },
    {
        "title": "Unbelievably Awesome Barbeque Chicken Pizza",
        "ingredients": [
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 skinless, boneless chicken breast half ADVERTISEMENT",
            "1/4 cup barbeque sauce, divided ADVERTISEMENT",
            "1/2 cup marinara sauce ADVERTISEMENT",
            "1 (16 ounce) package pre-baked pizza crust ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/3 cup thinly sliced red onion ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the sesame oil in a skillet over medium heat. Place the chicken breast in the skillet, and top with 1 tablespoon barbeque sauce. Cook 10 minutes, turn, and top with 1 tablespoon barbeque sauce. Continue cooking 10 minutes, until juices run clear. Cool slightly, and cut into chunks.\nPreheat oven to 425 degrees F (220 degrees C).\nIn a small bowl, mix the remaining barbeque sauce and marinara sauce. Spread evenly over the pizza crust. Sprinkle with mozzarella cheese. Arrange cooked chicken chunks and red onion slices over the top.\nBake 15 minutes in the preheated oven, or until cheese is melted and bubbly. Remove from heat, sprinkle with cilantro, and let sit 10 minutes before slicing.\n",
        "picture_link": "FJ5RpkCOqIgZZVmojTiHhZbq6oh0Oum"
    },
    {
        "title": "Big Ed's Cajun Shrimp Soup",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup sliced green onions ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 cups tomato-vegetable juice cocktail ADVERTISEMENT",
            "1 (8 ounce) bottle clam juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup uncooked long-grain white rice ADVERTISEMENT",
            "3/4 pound fresh shrimp, peeled and deveined ADVERTISEMENT",
            "hot pepper sauce to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat. Saute green bell pepper, onions, and garlic until tender. Stir in vegetable juice, clam juice, and water. Season with thyme, basil, red pepper, bay leaf, and salt. Bring to a boil, and stir in rice. Reduce heat, and cover. Simmer 15 minutes, until rice is tender.\nStir in shrimp, and cook 5 minutes, or until shrimp are opaque. Remove the bay leaf, and season with hot sauce.\n",
        "picture_link": "5MkGIzENR.HFYDfbv53JHBaZPCobBQO"
    },
    {
        "title": "Spicy Chicken Thai Soup",
        "ingredients": [
            "3 lemongrass stalks, bottom two-thirds of tender inner bulbs only, thinly sliced ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 (4 inch) piece fresh ginger root, chopped ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 1/2 pounds skinless, boneless chicken thighs, cut into chunks ADVERTISEMENT",
            "12 ounces fresh white mushrooms, quartered ADVERTISEMENT",
            "2 teaspoons red curry paste ADVERTISEMENT",
            "3 tablespoons fish sauce ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 (14 ounce) cans coconut milk ADVERTISEMENT",
            "1 red onion, sliced ADVERTISEMENT",
            "1/2 bunch cilantro, roughly chopped ADVERTISEMENT",
            "1 lime, cut into wedges, for serving ADVERTISEMENT",
            "1 fresh jalapeno pepper, sliced into rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir lemon grass, garlic, and ginger together in a large stock pot over medium-high heat. Stir in chicken broth and bring to a boil. Reduce heat to low and simmer for 30 minutes.\nStrain chicken broth and set aside. Discard lemon grass, garlic, and ginger.\nHeat vegetable oil in a large soup pot over medium heat; Stir in chicken; cook and stir for 5 minutes.\nStir in mushrooms and cook for 5 more minutes.\nStir in red curry paste, fish sauce, and lime juice until combined. Stir in chicken broth and coconut milk; return to a simmer and cook on low for 15 to 20 minutes.\nSkim off any excess oil and fat that rises to the top and discard.\nStir red onion into the chicken mixture; cook and stir until onion softens, about 5 minutes.\nRemove from heat and add about 1/2 the cilantro.\nServe with plates of cilantro, lime wedges, and fresh sliced jalapenos.\n",
        "picture_link": "Dkd7sQ95J6edxstis1m6MWsC4TgfJ2C"
    },
    {
        "title": "Egg-Free Low-Fat Oatmeal Cookies",
        "ingredients": [
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3/4 cup applesauce ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F ( 175 degrees C ). Grease a cookie sheet.\nIn a medium bowl, stir together the brown sugar, white sugar, and applesauce. Sift together the flour, baking powder, salt, and cinnamon; stir into the applesauce mixture. Add the rolled oats, raisins and chopped nuts (if desired); stir until combined.\nDrop by rounded teaspoonfuls onto the prepared cookie sheet. Bake for 10 minutes in the preheated oven. Allow cookies to cool slightly before removing from the baking sheet.\n",
        "picture_link": "xy4DbidLAKV22NFd95hAfuD7kmKIvu6"
    },
    {
        "title": "Glazed Ham",
        "ingredients": [
            "1 (8 pound) bone-in shank ham ADVERTISEMENT",
            "4 cups water, or as needed ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 tablespoons liquid smoke flavoring ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 275 degrees F (135 degrees C). Place ham in a roasting pan. Pour in water to a 2 inch depth. Cover with a tight fitting lid.\nBake for 6 to 8 hours in the preheated oven (all day or all night). Remove from the oven, pour off drippings and reserve. Debone ham, removing any excess fat as well, and return to the roasting pan.\nSkim fat from the top of the drippings, and discard. In a small bowl, mix one cup of the drippings with honey, brown sugar, liquid smoke, Worcestershire sauce and cloves. Pour this over the ham, cover and return to the oven. Remaining drippings may be discarded or reserved for other uses.\nBake for another 30 to 40 minutes in the preheated oven. Let stand for 10 minutes before serving.\n",
        "picture_link": "wuHPpGv00DQMHFDoo4uAc9z1qyHdnDO"
    },
    {
        "title": "Mediterranean Stuffed Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - pounded thin ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1/3 cup feta cheese ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2 teaspoons dried dill weed ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTO MAKE FILLING: In a large bowl beat the cream cheese until smooth. Add the feta cheese, dill weed and garlic powder. Beat until smooth and creamy.\nPut a dollop of 1/4 of the filling on each breast, then roll and tie the breasts with cooking string to seal. Brush each breast with melted butter/margarine and sprinkle with salt and pepper to taste. Bake uncovered in the preheated oven for 20 minutes or until the juices run clear.\n",
        "picture_link": "8fIJe28jDPkgwYWf6OC7ukiaFTqywXG"
    },
    {
        "title": "Vegetable Pizza I",
        "ingredients": [
            "2 (8 ounce) packages refrigerated crescent rolls ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 (1 ounce) package dry Ranch-style dressing mix ADVERTISEMENT",
            "1 cup fresh broccoli, chopped ADVERTISEMENT",
            "1 cup chopped tomatoes ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 cup chopped cauliflower ADVERTISEMENT",
            "1 cup shredded carrots ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nRoll out the crescent roll dough onto a 9x13 inch baking sheet, and pinch together edges to form the pizza crust.\nBake crust for 12 minutes in the preheated oven. Once finished cooking, remove crust from oven and let cool 15 minutes without removing it from the baking sheet.\nIn a small mixing bowl, combine cream cheese, mayonnaise, and dry Ranch dressing. Spread the mixture over the cooled crust. Arrange broccoli, tomato, green bell pepper, cauliflower, shredded carrots, and Cheddar cheese over the cream cheese layer. Chill for one hour, slice and serve.\n",
        "picture_link": "wXy7ZP7kXPRlEf53JGnZGFzIaSJu5AS"
    },
    {
        "title": "Steak Salad",
        "ingredients": [
            "1 3/4 pounds beef sirloin steak ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "3/4 cup crumbled blue cheese ADVERTISEMENT",
            "8 cups romaine lettuce - rinsed, dried, and torn into bite-size pieces ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "1 small green bell pepper, sliced ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "1/2 cup sliced red onion ADVERTISEMENT",
            "1/4 cup sliced pimento-stuffed green olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nLightly oil grate. Place steak on grill and cook for 3 to 5 minutes per side or until desired doneness is reached. Remove from heat and let sit until cool enough to handle. Slice steak into bite size pieces.\nIn a small bowl, whisk together the olive oil, vinegar, lemon juice, garlic, salt, pepper and Worcestershire sauce. Mix in the cheese. Cover and place dressing in refrigerator.\nOnto chilled plates arrange the lettuce, tomato, pepper, onion and olives. Top with steak and drizzle with dressing. Serve with crusty grilled French bread. Enjoy!\n",
        "picture_link": "1thCURWbRXYlIC2/WYalR5Ricftp8w2"
    },
    {
        "title": "Banana Cake V",
        "ingredients": [
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1 1/2 cups cake flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x9 inch pan.\nIn a large bowl, cream butter and sugar until light. Add eggs and beat well. Dissolve soda in the sour cream and add it to the butter mixture. Beat well. Add the mashed bananas and mix in. Add cake flour and mix well. Stir in vanilla extract.\nPour batter into a 9x9 inch pan and bake at 350 degrees F (175 degrees C) for 45 minutes or until done.\n",
        "picture_link": "n7hG3w/ci0WNKLSn7kMw4ukM9TJaLFG"
    },
    {
        "title": "Easy Focaccia",
        "ingredients": [
            "1 1/2 cups bread flour ADVERTISEMENT",
            "1 1/2 cups unbleached all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 (.25 ounce) package instant yeast ADVERTISEMENT",
            "1 1/3 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil, divided ADVERTISEMENT",
            "2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stoneware bowl, stir together the flours and salt. Make a well in the center of the flour mixture. Sprinkle the sugar and yeast into that well. Carefully pour the water into the well. Let stand until the yeast begins to act, about 5 minutes. Pour 2 tablespoons of the oil into the well. With a wooden spoon stir the mixture in the center of the bowl. Gradually widen the circle of stirring to take in all of the flour at the sides of the well.\nTurn out on a floured surface, and knead just until smooth. Keep the dough soft. Pour 1/2 teaspoon of the oil into a clean bowl. Place the dough in the bowl, turning once to oil the top. Cover. Let rise until doubled, 30 to 45 minutes.\nPunch the dough down. Use 1 teaspoon of the oil to coat a baking sheet, and place the dough on the baking sheet. Gently press the dough out to about 1/2 inch thickness. Pour the remaining 1 1/2 teaspoons oil over the top of the dough. Use the handle end of a wooden spoon to dimple the dough at 1 1/2 inch intervals. Sprinkle with the rosemary and the cheese. Place in a cold oven on the center shelf. Place a flat pan of hot water on the shelf below the bread. Let rise until doubled, 20 to 25 minutes.\nTurn on the oven to 375 degrees F (190 degrees C). Bake the focaccia for 20 to 25 minutes, or until browned on top. Remove from the pan, and cool on a wire rack. Serve warm.\n",
        "picture_link": "9S3pXgsSISdIMr1WxL1PSltdeTeeUpa"
    },
    {
        "title": "Easy Chocolate Bundt Cake Glaze",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, combine the sweetened condensed milk and chocolate chips. Cook, stirring constantly, until the chips are melted and the mixture is smooth. Do not allow it to bubble. Remove from the heat and stir in vanilla. Cool slightly before drizzling over a cake. If you want to make this ahead, it can be cooled and reheated in the microwave.\n",
        "picture_link": "qe4gBfZmI.17n.W4X7.2w3QHszkw5xi"
    },
    {
        "title": "Hamburger Buns",
        "ingredients": [
            "2 cups warm milk (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/4 cup margarine, melted ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 (.25 ounce) packages instant yeast ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "6 cups all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the milk, margarine, warm water, sugar and yeast. Let stand for about 5 minutes.\nMix in the salt, and gradually stir in the flour until you have a soft dough. Divide into 25 pieces, and form into balls. Place on baking sheets so they are 2 to 3 inches apart. Let rise for 20 minutes.\nPreheat the oven to 375 degrees F (190 degrees C). Bake the rolls for 15 minutes in the preheated oven. Cool slightly, then split them in half horizontally to fill with your favorite burgers.\n",
        "picture_link": "5C0MlCwqVa2QbbNggywfAQewpP.Px7q"
    },
    {
        "title": "Awesome Steak Marinade",
        "ingredients": [
            "1 1/2 cups steak sauce ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/3 cup Italian-style salad dressing ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Into a blender pour in the steak sauce, soy sauce, Italian-style dressing, honey, and garlic powder. Blend for 10 seconds. Pour over any type of steak, cover, and let sit overnight; turning occasionally to coat all sides.\n",
        "picture_link": "tl1IXMr.ywGiQSnV3hDGIopJi1HynsS"
    },
    {
        "title": "Apple Bavarian Torte",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "Cheese Mixture: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Apple Mixture: ADVERTISEMENT",
            "6 apples - peeled, cored, and thinly sliced ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F(230 degrees C).\nCream together butter, 1/3 cup sugar, vanilla, and flour. Press crust mixture into the flat bottom of a 9-inch springform pan. Set aside.\nIn a medium bowl, blend cream cheese and 1/4 cup sugar. Beat in egg and vanilla. Pour cheese mixture over crust.\nCombine 1/3 cup sugar and 1/2 teaspoon cinnamon. Toss the sliced apples with the sugar mixture and spread over the cheese filling.\nBake for 10 minutes. Reduce heat to 400 degrees F (200 degrees C) and continue baking for 25 minutes. Sprinkle almonds over top of torte. Continue baking until almonds are lightly browned and apples are tender. Cool before removing from pan.\n",
        "picture_link": "BTVsJ76LyUVtHFC7MYOpLB/4R1.O4.W"
    },
    {
        "title": "Italian Love Cake",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "2 pints part-skim ricotta cheese ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare cake mix as directed on box. Pour batter into 9 x 13 x 2 inch greased baking dish. Set aside.\nCombine ricotta cheese, sugar, vanilla, and eggs. Blend well. Spread mixture evenly over the top of the cake batter.\nBake at 350 degrees F (175 degrees C) for 75 minutes if using a glass baking dish, 90 minutes if using a metal pan.\nBlend pudding mix and milk until thickened. Blend in whipped topping. Spread over cooled cake.\n",
        "picture_link": "cViwbqLf0IY2cqnhDj0Kp7R/OZeV6hW"
    },
    {
        "title": "Slow Cooker Lentils and Sausage",
        "ingredients": [
            "1 (16 ounce) package dry lentils ADVERTISEMENT",
            "1 (16 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "2 (14 ounce) cans beef broth ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "2 pounds kielbasa (Polish) sausage, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse and drain lentils, but do not soak. In a slow cooker, stir together the lentils, tomatoes, broth, water, carrot, sausage, and celery.\nCover, and cook on High for 3 hours, or Low for 6 to 7 hours. Stir well before serving.\n",
        "picture_link": "ZeqMuPXEae0CO4MQLKUMI.9x9k/QoJ2"
    },
    {
        "title": "Pasta with Asparagus",
        "ingredients": [
            "1 1/2 pounds fresh asparagus, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "8 ounces angel hair pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to package instructions.\nHeat the olive oil in a nonstick skillet. Saute asparagus in the pan over medium heat for about 3 minutes. Add chicken broth and mushroom slices; cook 3 minutes more.\nDrain pasta, and transfer to a serving dish. Gently toss pasta with asparagus mixture; sprinkle with Parmesan and crushed red pepper.\n",
        "picture_link": "ipDOvCNAFpR/FMW6gNMn4Tr7rPziY.m"
    },
    {
        "title": "Slow Cooker BBQ Pork Chops",
        "ingredients": [
            "8 pork chops ADVERTISEMENT",
            "1 (18 ounce) bottle barbecue sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread a thin layer of barbeque sauce on the bottom of a slow cooker. Alternately layer pork chops with barbeque sauce, pouring the remainder of the bottle over the top of the final layer of chops.\nCook on HIGH setting for 3 to 4 hours, or all day on LOW setting.\n",
        "picture_link": "GeibWIKCl8U19FXvIApLsOru1YtLs.6"
    },
    {
        "title": "Parmesan and Basil Chicken Salad",
        "ingredients": [
            "2 whole skinless, boneless chicken breasts ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup chopped fresh basil ADVERTISEMENT",
            "2 cloves crushed garlic ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2/3 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken with salt and pepper. Roast at 375 degrees F (190 degrees C) for 35 minutes, or until juices run clear. Let cool, and chop into chunks.\nIn a food processor, puree the mayonnaise, basil, garlic, and celery.\nCombine the chunked chicken, pureed mixture, and Parmesan cheese; toss. Refrigerate, and serve.\n",
        "picture_link": "FnT3wWl08oM.bUAUp0v1jbN4QO9v05C"
    },
    {
        "title": "Thai Curry Tofu",
        "ingredients": [
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 (12 ounce) package extra-firm tofu, drained and cubed ADVERTISEMENT",
            "1 tablespoon seasoned salt, or to taste ADVERTISEMENT",
            "1 tablespoon butter or margarine ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (10 ounce) can coconut milk ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat. Add tofu cubes, season with seasoned salt and fry until golden on all sides, stirring occasionally, about 15 minutes. Remove to paper towels, and set aside.\nMelt butter or margarine in the same skillet over medium heat. Add the onion and garlic; cook and stir until tender. Stir in coconut milk, curry powder, salt, pepper and cilantro. Return the tofu to the skillet. Simmer over low heat for 15 minutes, stirring occasionally.\n",
        "picture_link": "TBSmRE7kBtiZre4rMKmrmGbm.qPzEsO"
    },
    {
        "title": "Rainbow Cookies",
        "ingredients": [
            "8 ounces almond paste ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "6 drops red food coloring ADVERTISEMENT",
            "6 drops green food coloring ADVERTISEMENT",
            "1/4 cup seedless red raspberry jam ADVERTISEMENT",
            "1/4 cup apricot jam ADVERTISEMENT",
            "1 cup semisweet chocolate chips, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line three 9x13 inch baking pans with parchment paper.\nIn a large bowl, break apart almond paste with a fork, and cream together with butter, sugar, and egg yolks. When mixture is fluffy and smooth, stir in flour to form a dough. In a small bowl, beat egg whites until soft peaks form. Fold egg whites into the dough. Divide dough into 3 equal portions. Mix one portion with red food coloring, and one with green food coloring. Spread each portion into one of the prepared baking pans.\nBake 10 to 12 minutes in the preheated oven, until lightly browned. Carefully remove from pan and parchment paper, and cool completely on wire racks.\nPlace green layer onto a piece of plastic wrap large enough to wrap all three layers. Spread green layer with raspberry jam, and top with uncolored layer. Spread with apricot jam, and top with pink layer. Transfer layers to a baking sheet, and enclose with plastic wrap. Place a heavy pan or cutting board on top of wrapped layers to compress. Chill in the refrigerator 8 hours, or overnight.\nRemove plastic wrap. Top with melted chocolate chips, and refrigerate 1 hour, or until chocolate is firm. Slice into small squares to serve.\n",
        "picture_link": "3cof6NnGRKBld5bxeIqjv4K8QjNr..."
    },
    {
        "title": "Chicken Pot Pie Soup",
        "ingredients": [
            "2 cups cubed cooked chicken breast meat ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables, thawed ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of potato soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "2 cups skim milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium sauce pan combine chicken, mixed vegetables, cream of potato soup, cream of chicken soup and milk. Heat through and serve with crumbled crackers on top.\n",
        "picture_link": "m1WC/XstgyNhnJl94CdqPCPUMfpY6KG"
    },
    {
        "title": "Bacon and Date Appetizer",
        "ingredients": [
            "1 (8 ounce) package pitted dates ADVERTISEMENT",
            "4 ounces almonds ADVERTISEMENT",
            "1 pound sliced bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the broiler.\nSlit dates. Place one almond inside each date. Wrap dates with bacon, using toothpicks to hold them together.\nBroil 10 minutes, or until bacon is evenly brown and crisp.\n",
        "picture_link": "K1arSfgDS1jRjzZElRN7xalmbsnngES"
    },
    {
        "title": "London Broil for the Slow Cooker",
        "ingredients": [
            "1 1/2 pounds London broil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the London broil in a slow cooker; add the garlic, mushroom soup, water, basil, oregano, and salt; cover; cook on low 6 to 7 hours.\n",
        "picture_link": "LPIHVZy186MaWrsBRZKF99jtSSpgic2"
    },
    {
        "title": "Hugh's Dry Rub",
        "ingredients": [
            "1/2 cup paprika ADVERTISEMENT",
            "3 tablespoons cayenne pepper ADVERTISEMENT",
            "5 tablespoons freshly ground black pepper ADVERTISEMENT",
            "6 tablespoons garlic powder ADVERTISEMENT",
            "3 tablespoons onion powder ADVERTISEMENT",
            "6 tablespoons salt ADVERTISEMENT",
            "2 1/2 tablespoons dried oregano ADVERTISEMENT",
            "2 1/2 tablespoons dried thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the paprika, cayenne pepper, ground black pepper, garlic powder, onion powder, salt, oregano, and thyme. Mix well, and store in a cool, dry place in an airtight container.\n",
        "picture_link": "6GAukcl7DtSpiZXoOasjMX4Q2TKqsVW"
    },
    {
        "title": "Spinach Tortellini Soup",
        "ingredients": [
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1 (9 ounce) package cheese tortellini ADVERTISEMENT",
            "1/4 tablespoon dried basil ADVERTISEMENT",
            "1/4 tablespoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over high heat, combine the spinach and chicken broth. Heat to boiling, then reduce heat to low. Stir in tortellini, and simmer for 10 to 15 minutes, or until the tortellini is cooked to desired tenderness. Season with basil, garlic powder, salt, and pepper.\n",
        "picture_link": "bSypG8Rr9M7kk.MZWFn7y20m5Ghz80C"
    },
    {
        "title": "Braided Easter Egg Bread",
        "ingredients": [
            "2 1/2 cups all-purpose flour, divided ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "5 whole eggs, dyed if desired ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine 1 cup flour, sugar, salt and yeast; stir well. Combine milk and butter in a small saucepan; heat until milk is warm and butter is softened but not melted.\nGradually add the milk and butter to the flour mixture; stirring constantly. Add two eggs and 1/2 cup flour; beat well. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.\nLightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal size rounds; cover and let rest for 10 minutes. Roll each round into a long roll about 36 inches long and 1 1/2 inches thick. Using the two long pieces of dough, form a loosely braided ring, leaving spaces for the five colored eggs. Seal the ends of the ring together and use your fingers to slide the eggs between the braids of dough.\nPreheat oven to 350 degrees F (175 degrees C). Place loaf on a buttered baking sheet and cover loosely with a damp towel. Place loaf in a warm place and let rise until doubled in bulk, about 45 minutes. Brush risen loaf with melted butter.\nBake in preheated oven for 50 to 55 minutes, or until golden.\n",
        "picture_link": ".phJ29QbyqNyKcDisvYE7tW0rzoPCwu"
    },
    {
        "title": "Cashew Crusted Chicken",
        "ingredients": [
            "1 (12 ounce) jar apricot preserves ADVERTISEMENT",
            "1/4 cup prepared Dijon-style mustard ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup coarsely chopped cashews ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine the preserves, mustard and curry powder in a large skillet and heat over low heat, stirring constantly, until preserves are completely melted and smooth.\nPlace cashews in a shallow dish or bowl. Dip chicken breasts in skillet sauce, then roll in nuts to coat and place in a lightly greased 9x13 inch baking dish.\nBake at 375 degrees F (190 degrees C) for 20 to 30 minutes. Boil any remaining sauce and serve on the side with the baked chicken.\n",
        "picture_link": "fKF3Lrkmf66w1/7zsVF0JttUWhlN5WK"
    },
    {
        "title": "Kale Chips",
        "ingredients": [
            "1 bunch kale ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil, divided ADVERTISEMENT",
            "1 tablespoon sherry vinegar ADVERTISEMENT",
            "1 pinch sea salt, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 300 degrees F (150 degrees C).\nCut away inner ribs from each kale leaf and discard; tear the leaves into pieces of uniform size. (I made my pieces about the size of a small potato chip.) Wash torn kale pieces and spin dry in a salad spinner or dry with paper towels until they're very dry.\nPut the kale pieces into a large resealable bag (or use a bowl if you don't mind getting your hands oily). Add about half the olive oil; seal and squeeze the bag so the oil gets distributed evenly on the kale pieces. Add the remaining oil and squeeze the bag more, until all kale pieces are evenly coated with oil and slightly 'massaged.' Sprinkle the vinegar over the kale leaves, reseal the bag, and shake to spread the vinegar evenly over the leaves. Spread the leaves evenly onto a baking sheet.\nRoast in the preheated oven until mostly crisp, about 35 minutes. Season with salt and serve immediately.\n",
        "picture_link": "AQSM12nK.cpPIuJrJ.cafwA0ozwW53K"
    },
    {
        "title": "Instant Pistachio Salad",
        "ingredients": [
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1/2 (10.5 ounce) package miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the pineapple and dry pistachio pudding mix. Fold in thawed whipped topping and marshmallows until well mixed. Refrigerate until chilled and serve.\n",
        "picture_link": "w7fRPC0rq8vXm0EecxWlKx93zSH/r.C"
    },
    {
        "title": "Homemade Hamburger Buns ",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast (such as Fleischmann's ActiveDry Yeast®) ADVERTISEMENT",
            "1 pound all-purpose flour, or as needed - divided ADVERTISEMENT",
            "1 cup warm water (105 degrees F/41 degrees C) ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 teaspoon sesame seeds, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with a silicone mat or parchment paper.\nPlace yeast into bowl of a large stand mixer; whisk in 1/2 cup flour and warm water until smooth. Let stand until mixture is foamy, 10 to 15 minutes.\nWhisk 1 egg, melted butter, sugar, and salt thoroughly into yeast mixture. Add remaining flour (about 3 cups).\nFit a dough hook onto stand mixer and knead the dough on low speed until soft and sticky, 5 to 6 minutes. Scrape sides if needed. Poke and prod the dough with a silicone spatula; if large amounts of dough stick to the spatula, add a little more flour.\nTransfer dough onto a floured work surface; dough will be sticky and elastic but not stick to your fingers. Form the dough lightly into a smooth, round shape, gently tucking loose ends underneath.\nWipe out stand mixer bowl, drizzle olive oil into the bowl, and turn dough over in the bowl several times to coat surface thinly with oil. Cover bowl with aluminum foil. Let dough rise in a warm place until doubled, about 2 hours.\nTransfer dough to a floured work surface and pat to flatten bubbles and form into a slightly rounded rectangle of dough about 5x10 inches and about 1/2 inch thick. Dust dough lightly with flour if needed. Cut dough into 8 equal pieces. Form each piece into a round shape, gently tucking ends underneath as before.\nUse your hands to gently pat and stretch the dough rounds into flat disc shapes about 1/2 inch thick. Arrange buns about 1/2 inch apart on prepared baking sheet. Dust buns very lightly with flour. Drape a piece of plastic wrap over the baking sheet (do not seal tightly). Let buns rise until doubled, about 1 hour.\nPreheat oven to 375 degrees F (190 degrees C).\nBeat 1 egg with milk in a small bowl, using a fork, until mixture is thoroughly combined. Very gently and lightly brush tops of buns with egg wash without deflating the risen dough. Sprinkle each bun with sesame seeds.\nBake in the preheated oven until lightly browned on top, 15 to 17 minutes. Buns will stick together slightly where they touch. Let cool completely, tear the buns apart, and slice in half crosswise to serve.\n",
        "picture_link": "MJ1vRZAe0BakUjG3tjm0liKr3vZicfC"
    },
    {
        "title": "Sugar Cookies with Buttercream Frosting",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 pound confectioners' sugar ADVERTISEMENT",
            "5 tablespoons water ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon butter flavored extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together butter, sugar, eggs, and vanilla with an electric mixer until light and fluffy. Combine the flour, baking powder, baking soda, and salt; gradually stir flour mixture into butter mixture until well blended using a sturdy spoon. Chill dough for 2 hours.\nPreheat the oven to 400 degrees F (200 degrees C). On a lightly floured surface, roll out the dough to 1/4 inch thickness. Cut into desired shapes using cookie cutters. Place cookies 2 inches apart onto ungreased cookie sheets.\nBake for 4 to 6 minutes in the preheated oven. Remove cookies from pan and cool on wire racks.\nUsing an electric mixer, beat shortening, confectioners sugar, water, salt, vanilla extract, and butter flavoring until fluffy. Frost cookies after they have cooled completely.\n",
        "picture_link": "dO1vDLtvdsGSZ/ZzLIe8hxx3lJ1NAki"
    },
    {
        "title": "Chicken Tetrazzini for a Crowd",
        "ingredients": [
            "1 pound spaghetti, broken into pieces ADVERTISEMENT",
            "3 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "12 ounces shredded Cheddar cheese ADVERTISEMENT",
            "6 cups shredded boiled chicken breast meat ADVERTISEMENT",
            "1 pound sauteed mushrooms ADVERTISEMENT",
            "1 (4 ounce) jar sliced pimento peppers, drained ADVERTISEMENT",
            "2 cups reserved chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of salted water to a boil. Add uncooked spaghetti (broken into thirds) to the pot and cook for 8 to 10 minutes or until al dente. Drain and set aside.\nIn a large saucepan, heat soup over low heat. Add shredded cheese (reserve some for topping) and stir together. Then add the cooked shredded chicken, mushrooms, pimento peppers and cooked spaghetti and stir all together. Add enough of the reserved broth to make it 'sloppy' and mix all together.\nPour mixture into a 9x13 inch baking dish. Sprinkle reserved shredded cheese on top and bake in the preheated oven for 25 to 35 minutes or until bubbly.\n",
        "picture_link": "3CuqOHf9bTcVClA/YodBoJvGLckOQ5u"
    },
    {
        "title": "Slow Cooker French Onion Soup",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "4 large yellow onions, sliced and separated into rings ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup cooking sherry ADVERTISEMENT",
            "7 cups reduced-sodium beef broth ADVERTISEMENT",
            "1 teaspoon sea salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "8 slices of French bread ADVERTISEMENT",
            "1/2 cup shredded Gruyere cheese ADVERTISEMENT",
            "1/3 cup shredded Emmental cheese ADVERTISEMENT",
            "1/4 cup freshly shredded Parmesan cheese ADVERTISEMENT",
            "2 tablespoons shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a large, heavy pot over medium-high heat; cook and stir onions until they become translucent, about 10 minutes. Sprinkle onions with sugar; reduce heat to medium. Cook, stirring constantly, until onions are soft and browned, at least 30 minutes. Stir in garlic and cook until fragrant, about 1 minute.\nStir sherry into onion mixture and scrape bottom of pot to dissolve small bits of browned food from the pot. Transfer onions into a slow cooker and pour in beef broth. Season to taste with sea salt; stir in thyme and bay leaf. Cover cooker, set on High, and cook 4 to 6 hours. If desired, set on Low and cook 8 to 10 hours.\nAbout 10 minutes before serving, set oven rack about 8 inches from the heat source and preheat the oven's broiler. Arrange bread slices on a baking sheet.\nBroil bread slices until toasted, 1 to 2 minutes per side.\nCombine Gruyere, Emmental, Parmesan, and mozzarella cheeses in a bowl, tossing lightly. Fill oven-safe soup crocks 3/4 full of onion soup and float a bread slice in each bowl. Top with about 2 tablespoons of cheese mixture per serving.\nPlace filled bowls onto a baking sheet and broil until cheese topping is lightly browned and bubbling, about 2 minutes.\n",
        "picture_link": "nvVOg0TCfvwk.0TdBgajqtcvFLP0652"
    },
    {
        "title": "Pot Stickers Traditional",
        "ingredients": [
            "1/2 pound ground pork ADVERTISEMENT",
            "1/2 medium head cabbage, finely chopped ADVERTISEMENT",
            "1 green onion, finely chopped ADVERTISEMENT",
            "2 slices fresh ginger root, finely chopped ADVERTISEMENT",
            "2 water chestnuts, drained and finely chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1 (14 ounce) package wonton wrappers ADVERTISEMENT",
            "5 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 tablespoon chili oil ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon rice vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble pork into a large, deep skillet. Cook over medium high heat until evenly brown. Drain and set aside.\nIn a medium bowl, mix together the pork, cabbage, green onion, ginger, water chestnuts, salt, sugar and sesame oil. Chill in the refrigerator 6 to 8 hours, or overnight.\nPlace a tablespoon of the pork mixture into each of the wonton wrappers. Fold the wrappers, and seal the edges with a moistened fork.\nIn a large, deep skillet, heat 3 tablespoons vegetable oil over medium high heat. Place the pot stickers into the oil seam sides up. Heat 30 seconds to a minute. Pour water into the skillet. Gently boil 7 to 8 minutes, until oil and water begins to sizzle, then add remaining oil. When the bottoms begin to brown, remove pot stickers from heat.\nIn a small serving bowl, mix together the chili oil, soy sauce, and vinegar, adjusting proportions to taste.\n",
        "picture_link": "owwazGMtsOiY3e4lllBONck3vbAnAAi"
    },
    {
        "title": "Potato and Bacon Salad",
        "ingredients": [
            "5 eggs ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "2 tablespoons Dijon mustard, or to taste ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "3 stalks celery, minced ADVERTISEMENT",
            "2 pounds small potatoes ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes in a pot with enough water to cover, and bring to a boil. Cook for about 20 minutes, or until tender. Drain and cool.\nMeanwhile, place eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, and place in a bowl of cold water to cool.\nPeel the eggs, and place 3 of them into a large bowl. Reserve the rest for later. Mash the eggs in the bowl with a fork. Stir in the mustard, mayonnaise, celery, salt and pepper. Set aside.\nCook bacon slices in the microwave for about 4 minutes, until crisp, or fry in a skillet over medium-high heat. Crumble 2 of the bacon slices into the mayonnaise mixture. Reserve the rest for garnish.\nPeel and chop the potatoes, and stir into the bowl until evenly coated. Slice the 2 remaining eggs, and place on top of the salad. Crumble the remaining bacon over the eggs, then sprinkle parsley over the top.\n",
        "picture_link": "iVzKUxNx9HaUKbu/KX6qYlifAZ7lryi"
    },
    {
        "title": "Honey Ginger Carrots",
        "ingredients": [
            "1 pound carrots, sliced ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 1/2 tablespoons honey ADVERTISEMENT",
            "1 pinch ground ginger ADVERTISEMENT",
            "1 tablespoon lemon juice, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Add carrots and cook until tender but still firm, about 5 minutes. Drain.\nIn a large skillet over low heat, melt butter with honey. Stir in ground ginger and lemon juice. Stir in carrots and simmer until heated through.\n",
        "picture_link": "NBAg5G2UJUtTGS8cWZs81K97oRuW/Fi"
    },
    {
        "title": "Hot Cocoa Mix",
        "ingredients": [
            "10 cups dry milk powder ADVERTISEMENT",
            "4 3/4 cups sifted confectioners' sugar ADVERTISEMENT",
            "1 3/4 cups unsweetened cocoa powder ADVERTISEMENT",
            "1 3/4 cups powdered non-dairy creamer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, combine milk powder, confectioner's sugar, cocoa powder, and creamer. Stir till thoroughly combined. Store cocoa mixture in an airtight container. Makes about 15 cups mix, or enough for about 45 servings.\nFor 1 serving, place 1/3 cup cocoa mixture in a coffee cup or mug, and add 3/4 cup boiling water. Stir to dissolve. Top with dollop of whipped cream or a few marshmallows, if desired.\n",
        "picture_link": "VqbZXOk8Ky4KX8TyM2I4TSgz6u.PgDa"
    },
    {
        "title": "Warm Blue Cheese Dip with Garlic and Bacon",
        "ingredients": [
            "7 slices bacon ADVERTISEMENT",
            "2 cloves garlic, peeled and minced ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup half-and-half ADVERTISEMENT",
            "4 ounces blue cheese, crumbled ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Remove bacon from skillet, drain on paper towels and crumble.\nPlace garlic in hot bacon grease. Cook and stir until soft, about 1 minute. Remove from heat.\nPreheat oven to 350 degrees F (175 degrees C). Place cream cheese and half-and-half in a medium bowl. Beat with an electric mixer until blended. Stir in bacon, garlic, blue cheese and chives. Transfer mixture to a medium baking dish.\nBake covered in the preheated oven 30 minutes, or until lightly browned.\n",
        "picture_link": "Ffkdev1IkmesfvE9jDJkqcReHoVJ8LC"
    },
    {
        "title": "Cucumber Sunomono",
        "ingredients": [
            "2 large cucumbers, peeled ADVERTISEMENT",
            "1/3 cup rice vinegar ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut cucumbers in half lengthwise and scoop out any large seeds. Slice crosswise into very thin slices.\nIn a small bowl combine vinegar, sugar, salt and ginger. Mix well. Place cucumbers inside of the bowl, stir so that cucumbers are coated with the mixture. Refrigerate the bowl of cucumbers for at least 1 hour before serving.\n",
        "picture_link": "eIUNxfjs0UiUtXHyGEByWeY0R0teqk2"
    },
    {
        "title": "Cajun Style Meatloaf",
        "ingredients": [
            "2 bay leaves ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon hot pepper sauce ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/2 pound andouille sausage, casings removed ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup dried bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine the bay leaves, salt, cayenne pepper, ground black pepper, ground white pepper, cumin, and nutmeg; set aside.\nMelt the butter or margarine in a saucepan over medium heat. Add the onion, bell pepper, green onions, garlic, hot pepper sauce, Worcestershire sauce, and reserved seasoning mix. Saute until mixture starts sticking to the bottom of the pan, about 6 minutes. Stir in the milk and ketchup; continue cooking for 2 more minutes, stirring occasionally.\nRemove vegetable mixture from heat, and allow to cool to room temperature. Place the beef and sausage in an ungreased 9x13 inch baking dish. Add the eggs, the vegetable mixture, and the bread crumbs. Remove the bay leaves. Mix well by hand, and form into a loaf about 1 1/2 inches high.\nBake uncovered at 350 degrees F (175 degrees C) for 25 minutes. Then raise heat to 400 degrees F (200 degrees C) and bake for another 35 minutes. Let stand for 5 minutes before serving.\n",
        "picture_link": "NsTYPmLz9jB/t1Mjg4wHsp3eg.lfXru"
    },
    {
        "title": "Grilled Flat Iron Steak with Blue Cheese-Chive Butter",
        "ingredients": [
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon cracked black pepper ADVERTISEMENT",
            "1 teaspoon dried rosemary leaves, crumbled ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 1/2 pounds flat iron steak ADVERTISEMENT",
            "3 tablespoons softened unsalted butter ADVERTISEMENT",
            "1 ounce crumbled blue cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1/8 teaspoon cracked black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together vinegar, garlic, 1 tablespoon black pepper, rosemary, oregano, and kosher salt in a bowl along with the olive oil. Place the flat iron steak into a resealable plastic bag, and pour the marinade overtop. Squeeze the excess air from the bag and seal. Marinate in the refrigerator 30 minutes.\nPreheat an outdoor grill for medium-high heat and lightly oil grate. Remove steak from the marinade, shake off excess, and discard the remaining marinade. Allow the steak to stand at room temperature for 15 minutes as the grill warms.\nMash together the butter, blue cheese, chives, and 1/8 teaspoon of black pepper; set aside. Cook the steak on the preheated grill to desired degree of doneness, about 5 minutes per side for medium-rare. Allow the steak to rest in a warm place for 10 minutes before slicing thinly across the grain. Serve with a dollop of blue cheese-chive butter.\n",
        "picture_link": "VS6f0YPBZtLqEBQvhUJZIhStrigTa72"
    }
]