[
    {
        "title": "Gina and Russell's Hot Special K® Breakfast Cereal",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "2 ripe bananas ADVERTISEMENT",
            "3/4 cup high-protein crisp rice and wheat cereal (such as Kellogg's® Special K®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium-high heat. Mash banana into the hot oil; cook until slightly browned, 5 to 7 minutes. Stir cereal into the banana mixture; continue cooking until the cereal softens slightly, about 5 minutes more.\n",
        "picture_link": "knVA2BGVP4/nEc1DSlOJdK.fWhJn0BG"
    },
    {
        "title": "Margaret's Hot Mulled Wine",
        "ingredients": [
            "1 1/2 cups boiling water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 lemon ADVERTISEMENT",
            "8 whole cloves ADVERTISEMENT",
            "1 (3 inch) cinnamon stick ADVERTISEMENT",
            "1 (1.5 liter) bottle red wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan; dissolve sugar in water. Stir in lemon quarter, cloves, and cinnamon into water; boil for 10 minutes. Strain and return to saucepan.\nStir red wine into water-sugar mixture; heat until piping hot, but not boiling, about 5 minutes.\n",
        "picture_link": "K6D9tAisccZSyGfm3oAB0xw0ssDOwIy"
    },
    {
        "title": "Potato Latkes with Caramelized Pears, Goat Cheese, and Sherry Vinegar Drizzle",
        "ingredients": [
            "2 cups peeled and shredded potatoes ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon grated onion ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 cup oil for frying ADVERTISEMENT",
            "1 tablespoon oil ADVERTISEMENT",
            "2 pears, cored and cut into 1/2-inch slices ADVERTISEMENT",
            "1/4 cup brown sugar, divided ADVERTISEMENT",
            "8 ounces goat cheese, sliced into 1/4-inch thick rounds ADVERTISEMENT",
            "1/4 cup sherry vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place shredded potatoes in cheesecloth and wring out any excess moisture.\nMix potatoes, eggs, flour, onion, and salt together in a bowl.\nHeat 1/2 cup oil in a large skillet over medium-high heat until oil shimmers. Working in batches, drop spoonfuls of the potato mixture into the hot oil, pressing each down to form a pancake. Cook latkes until browned and crisp, 3 to 5 minutes per side; transfer to paper towels to drain.\nHeat 1 tablespoon oil in a separate skillet over medium-high heat. Cook pears in hot oil and sprinkle 2 tablespoons brown sugar over pears. Cook pears until browned and sugar is melted, 3 to 5 minutes per side.\nPlace latkes on a serving platter. Top each latke with 1 round of goat cheese and a pear. Sprinkle brown sugar on the pears and drizzle sherry vinegar over the top.\n",
        "picture_link": "p8laZD1itYjHsWi4QGUsYCM56HtfXJe"
    },
    {
        "title": "Spicy Barbecue Beans",
        "ingredients": [
            "3/4 pound ground beef ADVERTISEMENT",
            "1/4 pound bulk spicy pork sausage ADVERTISEMENT",
            "8 slices bacon, or more to taste ADVERTISEMENT",
            "4 (16 ounce) cans pork and beans, drained ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "3/4 cup molasses ADVERTISEMENT",
            "3/4 cup barbeque sauce (such as Sweet Baby Ray's®) ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon dried mint (optional) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon bitters (optional) ADVERTISEMENT",
            "3 dashes hot sauce, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef and bulk sausage in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. Crumble bacon into small pieces and add to beef mixture; transfer to a large casserole dish.\nStir pork and beans, onion, molasses, barbeque sauce, liquid smoke, cayenne pepper, Worcestershire sauce, mint, salt, bitters, and hot sauce into the beef mixture.\nBake in preheated oven until heated through and thick, about 45 minutes.\n",
        "picture_link": "rBSoC1KSe52dw446Oqy5.k4DVb1aUJC"
    },
    {
        "title": "Erin's Fun Turkey Cookies",
        "ingredients": [
            "6 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup candy corn, or as needed ADVERTISEMENT",
            "72 candy-coated milk chocolate pieces (such as M&M;'s®) ADVERTISEMENT",
            "1/4 cup prepared white frosting, or as needed ADVERTISEMENT",
            "4 pieces red string licorice (such as Twizzlers®), cut into 1-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat flour, sugar, buttermilk, eggs, vanilla, salt, and baking powder together in a bowl until dough is thoroughly mixed. Cover bowl with plastic wrap and refrigerate for at least 1 hour.\nPreheat oven to 375 degrees F (190 degrees C). Grease baking sheets.\nDrop about 2 teaspoons of dough per cookie about 2 inches apart onto prepared baking sheets.\nBake cookies in the preheated oven until light golden brown, about 10 minutes. Cool cookies for 8 to 10 minutes before removing to a plate to decorate.\nPress candy corns, point-end first, partway into the top edge of the cookies to resemble feathers. Place 2 candy-coated milk chocolate pieces in the center of each cookie to resemble the turkey's eyes. Use a small amount of frosting to create the turkey's mouth. Press 2 pieces of licorice into the bottom edge of the cookie to make the turkey's legs.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gingerbread Pancakes with Warm Lemon Sauce",
        "ingredients": [
            "1 (14.5 ounce) package gingerbread mix ADVERTISEMENT",
            "1 1/4 cups warm water ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (3.4 ounce) package JELL-O Lemon Flavor Instant Pudding ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix gingerbread mix, water and egg in large bowl until batter is smooth.\nHeat griddle or large skillet sprayed with cooking spray on medium heat. Pour batter onto griddle, using scant 1/4 cup batter for each pancake. Cook until bubbles form on tops, then turn to brown other sides.\nMeanwhile, beat pudding mix and milk in microwaveable bowl with whisk 2 min. Microwave on HIGH 1-1/2 min. or until heated through, stirring after 1 min. Serve pancakes with warm lemon sauce.\n",
        "picture_link": "YpW9y10b7a//7feOipXZ7zbb8IGslUW"
    },
    {
        "title": "Caramel Apple Mini \"Cheesecakes\"",
        "ingredients": [
            "1 (10 ounce) package frozen puff pastry shells ADVERTISEMENT",
            "4 ounces PHILADELPHIA Neufchatel Cheese, softened ADVERTISEMENT",
            "1 cup milk, divided ADVERTISEMENT",
            "1 (3.4 ounce) package JELL-O Vanilla Flavor Instant Pudding ADVERTISEMENT",
            "1 Granny Smith or Red Delicious apple, chopped ADVERTISEMENT",
            "3 tablespoons caramel ice cream topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 425 degrees F.\nBake pastry shells as directed on package; cool.\nMeanwhile, beat Neufchatel and 1/4 cup milk with mixer until blended. Add dry pudding mix and remaining milk; beat 2 min. Refrigerate until ready to use.\nRemove top and doughy center from each pastry shell; discard removed pastry. Fill shells with pudding mixture; top with apples and caramel topping. Serve with pastry tops.\n",
        "picture_link": "LnekXYG1oGAby9eIL38Q3SmS86H95S2"
    },
    {
        "title": "Anton's Zwiebelkuchen (Anton's Onion Pie)",
        "ingredients": [
            "Dough: ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup lukewarm water ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 1/4 pounds onions, cut into thin rings ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 pinch caraway seeds, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, 1 teaspoon salt, and yeast in a large bowl. Stir in olive oil and about 3/4 cup water until mixture comes together in a ball of dough. Turn dough out on a lightly floured surface. Gradually add remaining 1/4 cup water while kneading dough; continue kneading until smooth and elastic, about 10 minutes.\nPlace dough in a large lightly-oiled bowl and turn to coat. Cover with a towel and let rise in a warm place , about 30 minutes.\nMelt butter in a large skillet over medium heat. Cook and stir onions and 1 teaspoon salt until tender and translucent, about 30 minutes; stir often so onions do not brown. Remove from heat and allow to cool.\nPreheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nRoll dough out on a floured surface to create a thin crust; transfer dough to prepared baking sheet. Poke several holes in the dough with a fork and roll edges up slightly to create a rim.\nSpread cooled onions over crust. Whisk sour cream, milk, eggs, and ground black pepper in a bowl; pour over onions. Sprinkle with caraway seeds.\nBake in preheated oven until golden brown and eggs are set, 30 to 45 minutes. Serve warm.\n",
        "picture_link": "4eRNa1JpAFDUgvtVTe/BGa1TkJp5GwS"
    },
    {
        "title": "Individual Servings of Gefilte Fish",
        "ingredients": [
            "2 onions, cut into large chunks ADVERTISEMENT",
            "1 carrot, cut into large chunks ADVERTISEMENT",
            "2 pounds whitefish fillets ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "1/4 cup matzo meal ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace onions into a food processor and pulse a few times to coarsely chop. Transfer onions to a large bowl. Place carrot into food processor and pulse once or twice to chop; process until very finely chopped, about 30 seconds. Add carrot to onions. Place whitefish fillets into food processor and grind until the fish is a fine paste, about 2 minutes. Add fish to bowl.\nCombine onions, carrot, and whitefish with cold water, matzo meal, egg, egg whites, sugar, vegetable oil, nutmeg, salt, and black pepper, stirring to combine well. Spoon whitefish mixture into 16 muffin cups, filling them level with the top edge.\nBake in the preheated oven until gefilte fish cakes are set and a toothpick inserted into the center of a cake comes out clean, about 1 hour. Let cool in muffin cups, remove, cover, and refrigerate until chilled, at least 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Beveritas311",
        "ingredients": [
            "2 cups ice cubes ADVERTISEMENT",
            "1/3 cup triple sec ADVERTISEMENT",
            "1/3 cup tequila (such as Jose Cuervo®) ADVERTISEMENT",
            "1/3 cup freshly squeezed lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill 4 margarita glasses each with 1/2 cup ice.\nBlend triple sec, tequila, and lime juice together in a blender; pour into the prepared margarita glasses.\n",
        "picture_link": "xYNB63675QhmYdKd5pepflEKjDVDON2"
    },
    {
        "title": "Pantry Pasta Salad",
        "ingredients": [
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1 (13.75 ounce) can artichoke hearts, drained and diced ADVERTISEMENT",
            "1 1/2 cups frozen green peas ADVERTISEMENT",
            "1/2 cup diced black olives ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 1/2 cups diced queso blanco cheese ADVERTISEMENT",
            "1 (12 ounce) bottle Italian-style salad dressing (such as Girard's® Olde Venice) ADVERTISEMENT",
            "cracked black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine garbanzo beans, artichoke hearts, frozen peas, black olives, and red onion in a large salad bowl.\nBring a large pot of lightly salted water to a boil. Cook the bow tie pasta at a boil, stirring occasionally, until cooked through but firm to the bite, about 12 minutes; drain.\nMix still-warm pasta into garbanzo bean mixture. Fold queso blanco cheese into salad; add Italian salad dressing and toss to coat. Season to taste with cracked black pepper. Set salad aside until peas thaw and flavors blend, about 5 minutes.\n",
        "picture_link": "fFrAKQyrKPsHUh2WxKIAThgq2fb1j3m"
    },
    {
        "title": "Apple Crumb Pie for a Crowd",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "16 apples - peeled, cored, and thinly sliced ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 (8.5 ounce) boxes apple crisp mix (such as Concord Foods) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 1/2 cups flour and salt in a large bowl. Cut 1/2 cup butter and shortening into flour until the mixture resembles crumbs.\nMix egg, water, and white vinegar together in a separate bowl; pour in the crumb mixture and blend with a fork to form a dough ball. Wrap dough in plastic wrap and refrigerate until ready to use.\nMelt 1/2 cup butter in a saucepan over medium heat. Blend 1/4 cup flour into the melted butter. Stir water and brown sugar into the butter mixture until smooth; remove from heat.\nRoll chilled dough into a large rectangle on a flat surface dusted with flour; press into the bottom of an aluminum foil roasting pan and up the sides about an inch or more.\nDump the sliced apples onto the crust and gently spread into an even layer. Drizzle the butter mixture over the apples.\nPour apple crisp mix into a bowl. Cut 1/2 cup butter into the mix; scatter over the apples.\nBake in preheated oven until golden brown, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Belize Honey BBQ Sauce",
        "ingredients": [
            "1 (16 ounce) can tomato sauce ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 habanero peppers, chopped (wear gloves) ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "1 (16 ounce) can tomato paste ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend tomato sauce, onion, habanero peppers, garlic, and cilantro in a blender until smooth. Add tomato paste, ketchup, honey, brown sugar, and white vinegar; blend again.\nTransfer sauce to a saucepan; cook over medium heat until thick, 30 to 35 minutes. Stir occasionally.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Barbeque Ranch Meatloaf",
        "ingredients": [
            "1 1/2 pounds bulk pork sausage ADVERTISEMENT",
            "1 pound ground beef sirloin ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1/2 cup reduced-fat ranch dressing ADVERTISEMENT",
            "1 pound fingerling potatoes ADVERTISEMENT",
            "1 (16 ounce) package baby carrots ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix sausage and ground sirloin in a large bowl until thoroughly combined; add eggs, bread crumbs, onion, and ranch dressing; mix well. Form into a loaf and place into the center of a 9x13-inch baking dish.\nArrange fingerling potatoes and baby carrots around meatloaf and cover dish with foil.\nBake in the preheated oven for 1 hour; remove foil and brush meatloaf with barbeque sauce. Bake uncovered until an instant-read meat thermometer inserted into the center of the loaf reads at least 160 degrees F (70 degrees C), about 30 more minutes. Let meatloaf rest 5 to 10 minutes before slicing.\n",
        "picture_link": "t/W5O62KBun73veLMtoJkwfKtfmMpMm"
    },
    {
        "title": "Hot Green Chile Corn Dip",
        "ingredients": [
            "1 (15.25 ounce) can whole kernel sweet corn, drained ADVERTISEMENT",
            "2 (4 ounce) cans chopped green chilies, drained ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix corn, green chilies, Monterey Jack cheese, mayonnaise, and Parmesan cheese in a 2-quart baking dish.\nBake in preheated oven until the cheese is melted and the dip is hot in the center, about 30 minutes. Top with olives to serve.\n",
        "picture_link": "y4KcgEGHcC986Yv7oDFZzw63C8gbB7u"
    },
    {
        "title": "Chef James Holiday Prime Rib with Cabernet and Dried Cherry Sauce",
        "ingredients": [
            "4 sprigs fresh rosemary, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (6 pound) standing beef rib roast ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "3 carrots, chopped ADVERTISEMENT",
            "3 ribs celery, chopped ADVERTISEMENT",
            "2 small onions, chopped ADVERTISEMENT",
            "2 cups low-sodium beef broth ADVERTISEMENT",
            "2 cups Cabernet Sauvignon wine ADVERTISEMENT",
            "4 ounces dried cherries ADVERTISEMENT",
            "2 2/3 tablespoons unsalted butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix rosemary, garlic, and olive oil in a bowl. Rub standing rib roast with mixture and season liberally with kosher salt and black pepper.\nHeat an 11-inch cast-iron skillet over medium-high heat until skillet is very hot. Brown standing rib roast on all sides in the hot skillet, 3 to 5 minutes per side. Remove meat from skillet. Cook and stir carrots, celery, and onions in the hot skillet until slightly browned; stir beef broth into vegetables. Place roast on top of vegetables in skillet.\nRoast meat in the preheated oven until an instant-read meat thermometer inserted into the middle reads 120 degrees F (49 degrees C), about 2 1/2 hours.\nTransfer roast from skillet to a serving platter, retaining pan drippings and vegetables; let rest at least 30 minutes before slicing.\nAbout 15 minutes before serving, combine red wine with dried cherries in a saucepan over medium heat; bring to a boil and reduce heat to low. Simmer until cherries have absorbed all the wine, about 10 minutes, stirring occasionally; remove from heat.\nMelt butter in a separate saucepan over medium heat and whisk flour into hot butter to make a paste. Strain reserved pan juices into cherries using a fine mesh strainer. Bring cherry sauce with pan juices to a boil. Stir flour paste into sauce, reduce heat to low, and simmer until thickened, about 5 minutes. Season sauce with salt and black pepper. Serve sauce with roast.\n",
        "picture_link": "A.2LN.P3maPzmXpyI0u9qiyNeyT7sfG"
    },
    {
        "title": "Kalter Milchreis mit Brombeeren (Cold Rice Pudding with Blackberries)",
        "ingredients": [
            "1 quart milk ADVERTISEMENT",
            "2/3 cup short-grain white rice ADVERTISEMENT",
            "2 tablespoons white sugar, or more to taste ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 pound fresh blackberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring milk to a boil in a saucepan; add rice and reduce heat to low. Simmer until rice is tender, about 20 minutes. Stir in sugar and salt. Remove from heat and allow rice to cool.\nBeat heavy cream in a bowl until stiff peaks form. Lift your beater or whisk straight up: the whipped cream will form sharp peaks. Fold whipped cream into cooled rice.\nDivide rice into 4 bowls and garnish with a few blackberries. Serve remaining blackberries on the side.\n",
        "picture_link": "IXGVLCsUVvGNgCPmEgptDZPAjFv3WUK"
    },
    {
        "title": "Giardino Grinder",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "2 eggplants, peeled and sliced into rings ADVERTISEMENT",
            "2 zucchini, peeled and sliced ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "2 tablespoons Marsala wine ADVERTISEMENT",
            "3 ciabatta sandwich rolls, sliced horizontally ADVERTISEMENT",
            "1/4 cup garlic basil spread (see footnote for recipe link) ADVERTISEMENT",
            "1/4 cup garlic roasted tomato spread (see footnote for recipe link) ADVERTISEMENT",
            "1/4 cup artichoke aioli (see footnote for recipe link) ADVERTISEMENT",
            "1 pound shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 500 degrees F (260 degrees C).\nHeat olive oil in a large pot or Dutch oven over medium heat. Cook and stir onion until it begins to soften and turn translucent, about 5 minutes. Add eggplant and cook until they have absorbed some of the oil, about 1 minute. Stir zucchini into eggplant mixture and cook until softened, 1 to 2 minutes. Mix in mushrooms and salt; cook and stir until mushrooms are softened, 3 to 4 minutes.\nPour Marsala wine into eggplant mixture and bring to a boil, scraping up any browned bits from the bottom of the pan. Cook until wine has reduced slightly, 2 to 3 minutes.\nSpread each ciabatta roll with 1 tablespoon garlic basil spread, 1 tablespoon garlic roasted tomato sauce, and 1 tablespoon artichoke aioli. Top with 1/4 pound mozzarella cheese. Evenly distribute the eggplant mixture among the 4 sandwiches.\nPlace sandwiches on a baking sheet and bake in the preheated oven until the cheese is melted and the bread is toasted, 3 to 4 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh and Simple Peach Salsa with Cinnamon Sugar Chips",
        "ingredients": [
            "Salsa: ADVERTISEMENT",
            "8 fresh peaches - peeled, pitted, and diced ADVERTISEMENT",
            "1/2 cup quartered yellow cherry tomatoes ADVERTISEMENT",
            "1/4 red onion, chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/2 jalapeno pepper - seeded, membranes discarded, and pepper chopped ADVERTISEMENT",
            "1/4 teaspoon ground cardamom ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "Chips: ADVERTISEMENT",
            "10 small flour tortillas, cut into 8 wedges ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "2 tablespoons cinnamon sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix peaches, tomatoes, onion, cilantro, and jalapeno pepper together in a bowl; sprinkle with cardamom. Drizzle lime juice and lemon juice over salsa; toss to coat.\nPreheat oven to 350 degrees F (175 degrees C).\nBrush tortilla wedges with melted butter; sprinkle generously with cinnamon sugar. Arrange coated wedges on a baking sheet.\nBake in the preheated oven until chips are crisp, 15 minutes. Serve chips alongside peach salsa.\n",
        "picture_link": "n2r/.Xf.QJMWTYVNb.Qxb/rYH3SvDsS"
    },
    {
        "title": "Shortcut Lasagna",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 (26 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 (12 ounce) container cottage cheese ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "8 lasagna noodles ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble beef and garlic into a 2-quart microwave-safe bowl. Heat in microwave on high until beef is no longer pink, about 6 minutes. Stir and drain beef. Add spaghetti sauce and water.\nCombine cottage cheese, eggs, and black pepper in another bowl.\nSpread about 1/2 cup meat mixture in the bottom of a 9x13-inch baking dish. Arrange half the lasagna noodles over sauce and spread with cottage cheese mixture. Top cottage cheese mixture with half the spinach, half the meat sauce, and half the mozzarella cheese; repeat each layer.\nCover baking dish with heavy-duty plastic wrap and heat in microwave on high for 8 minutes. Continue to heat in microwave on medium until noodles are tender and cheese is melted, 30 to 32 minutes, turning dish occasionally. Sprinkle with Parmesan cheese and allow lasagna to rest for 15 minutes before slicing and serving.\n",
        "picture_link": "w2khcOvuBkJWWOZrVYo/m3Q2GC73Dcq"
    },
    {
        "title": "Meat Pillows",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (4.25 ounce) can chopped black olives, drained ADVERTISEMENT",
            "1 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "4 (2 ounce) packages thinly sliced deli beef (such as Carl Buddig®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese, olives, and garlic powder in a bowl. Spoon 1 tablespoon cream cheese mixture into the middle of each beef slice; fold beef slice over filling to create a pillow. Secure the edges with a dot of cream cheese mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Stinger Seasoning",
        "ingredients": [
            "1 cup garlic powder ADVERTISEMENT",
            "1/2 cup onion powder ADVERTISEMENT",
            "1/3 cup salt ADVERTISEMENT",
            "1/3 cup ground white pepper ADVERTISEMENT",
            "1/4 cup Spanish paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix garlic powder, onion powder, salt, white pepper, and Spanish paprika in a bowl; funnel into a dry, airtight storage container and use as needed.\n",
        "picture_link": "SV/JhAVV.ZYVk/mvOPIWiqwzEeejc3W"
    },
    {
        "title": "Paul's Oyster Stew",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 1/2 cups chopped celery ADVERTISEMENT",
            "1/4 cup chopped fresh onion ADVERTISEMENT",
            "1/4 cup dried minced onion ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon celery salt ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 (12.5 fl oz) cans cream of celery soup ADVERTISEMENT",
            "1 gallon 1% milk ADVERTISEMENT",
            "2 (10 ounce) cans condensed milk (optional) ADVERTISEMENT",
            "8 (8 ounce) cans oysters, drained and liquid reserved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a 10-quart stockpot over medium-high heat. Cook and stir celery, fresh onion, dried onion, black pepper, and celery salt in melted butter until celery and onion are tender, 7 to 10 minutes.\nReduce heat to low. Sprinkle flour over celery and onions; stir gently until flour becomes a smooth paste. Add the cream of celery soup; stir gently. Pour 1% milk, condensed milk, and liquid from the oysters into the mixture; stir. Gently fold oysters into the soup.\nIncrease heat to medium. Cook mixture at a simmer, stirring occasionally, for 1 hour. Remove from heat and allow to cool slightly, about 10 minutes.\nRefrigerate soup for 24 to 48 hours before reheating gently to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Meatballs and Kraut",
        "ingredients": [
            "1 (16 ounce) package frozen cooked meatballs, thawed ADVERTISEMENT",
            "1 (14 ounce) can sauerkraut, drained ADVERTISEMENT",
            "1 (12 ounce) bottle ketchup-style chili sauce (such as Heinz®) ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/4 cup hot water ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix meatballs, sauerkraut, chili sauce, white sugar, brown sugar, hot water, and vinegar in a slow cooker, stirring to dissolve sugar. Cook on High for 1 hour.\n",
        "picture_link": "mXvoYU8.dAygA1WBHz/sqCgmO5BF9rW"
    },
    {
        "title": "Dong'an Chicken",
        "ingredients": [
            "4 quarts water ADVERTISEMENT",
            "1 (3 pound) whole chicken ADVERTISEMENT",
            "2 3/4 inch piece fresh ginger, divided ADVERTISEMENT",
            "1 green onion, white part only, crushed ADVERTISEMENT",
            "2 fresh red chile peppers, seeded and thinly sliced into 1 1/2-inch slivers ADVERTISEMENT",
            "6 dried red chile peppers (optional) ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 cup lard ADVERTISEMENT",
            "4 teaspoons Shaoxing cooking wine ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "5 green onions, green parts cut into even slivers ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 4 quarts water to a boil in a large pot; add whole chicken to the boiling water. Crush half the ginger and add to the boiling water. Add crushed green onion white. Boil chicken until 3/4 cooked, about 10 minutes. Remove from pot and cool; reserve chicken broth.\nRemove skin from cooled chicken and cut meat from the bones. Cut meat into bite-sized pieces and set aside. Discard skin and bones.\nPeel the remaining half ginger piece and slice into 1 1/2-inch slivers. Combine ginger slivers, fresh red chile pepper slivers, dried red chile peppers, and red pepper flakes in a bowl.\nHeat a wok or large skillet over high heat; add lard and swirl around until melted. Cook and stir ginger-chile pepper mixture in the hot lard, continuously moving wok, until fragrant, about 30 seconds. Add chicken meat; splash cooking wine around the edges of the chicken. Pour in vinegar and season with salt.\nPour about 1 cup (or more as needed) leftover chicken broth into the chicken mixture; bring to a boil. Reduce heat and simmer until chicken is no longer pink in the center and liquid is mostly evaporated, 5 to 10 minutes.\nWhisk cornstarch and 1/4 cup cold water together in a small bowl. Stir cornstarch mixture into chicken mixture; stir to coat chicken. Add 5 green onions and stir to combine. Remove from heat and stir in sesame oil.\n",
        "picture_link": "wZakpGc0L123vMuJwpViIrz7ufG7bVC"
    },
    {
        "title": "Warm Fingerling Potato Salad",
        "ingredients": [
            "2 pounds fingerling potatoes, cut into large chunks ADVERTISEMENT",
            "1 (8 ounce) container lowfat plain yogurt ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "1 tablespoon coarse-grained mustard, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 cups torn arugula leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil and add potatoes. Boil until potatoes are tender, 10 to 13 minutes; drain. Let cool until potatoes are warm.\nWhisk yogurt, sour cream, lemon zest, lemon juice, mustard, salt, and black pepper together in a bowl. Gently fold potatoes into dressing. Stir arugula leaves into potato mixture and serve.\n",
        "picture_link": "5bZHd6uaoNptvekEOcR/Pcqi05FLKQO"
    },
    {
        "title": "Kale Cakes with Sweet Hot Peppers",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 bunch kale, stems removed and chopped ADVERTISEMENT",
            "1 teaspoon tamari sauce ADVERTISEMENT",
            "1 cup grated Romano cheese ADVERTISEMENT",
            "1/4 cup whole wheat bread crumbs (optional) ADVERTISEMENT",
            "6 eggs, beaten well ADVERTISEMENT",
            "1 bunch fresh oregano, chopped ADVERTISEMENT",
            "1 pinch sea salt and ground black pepper to taste ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "5 pickled picante peppers (such as Trader Joe's Peri Peri Peppadrops®), chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon olive oil over medium-high heat in large heavy skillet. Add red onion; cook and stir 3 minutes. Add garlic; cook and stir 2 minutes. Add kale and continue to stir until kale is wilted, about 5 minutes. Place kale mixture in a large bowl.\nGently toss kale with tamari sauce, Romano cheese, whole wheat bread crumbs, eggs, oregano, sea salt, and black pepper until well combined.\nLightly coat an 8x8-inch baking pan with 2 teaspoons olive oil; pour in egg and kale mixture. Distribute chopped pickled picante peppers on top.\nBake in the preheated oven until eggs are well set and the top is lightly browned, 20 to 25 minutes. Cut into squares to serve.\n",
        "picture_link": "RrmKqt.JaC7FWYhwe5oGosfsVGLVB5."
    },
    {
        "title": "Atomic Cheese Ball",
        "ingredients": [
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "8 roasted jalapeno peppers, seeded and chopped, or to taste ADVERTISEMENT",
            "1 (4 ounce) jar dried beef, chopped ADVERTISEMENT",
            "1 tablespoon seasoned salt ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese in a medium bowl with an electric mixer until light and fluffy. Mix green onions, jalapeno peppers, beef, seasoned salt, and garlic powder into cream cheese. Form cheese mixture into a ball; refrigerate 8 hours to overnight.\n",
        "picture_link": "BhkRv3u5D8yJ.E5rmmrZZzR4wSxE7RS"
    },
    {
        "title": "Peppermint Crunch Truffles",
        "ingredients": [
            "11 ounces chocolate, chopped ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 1/2 cups chopped peppermint crunch thin mints (such as Andes®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat chocolate and cream in the top of a double boiler over simmering water without stirring for 3 minutes. Whisk chocolate and cream together until smooth. Remove from heat and let mixture cool until thick, 20 to 30 minutes.\nPour chocolate mixture into a flat baking dish, cover with plastic wrap, and chill until fully set, about 3 hours.\nPlace chopped peppermint candies into a shallow bowl. Use a melon baller to scoop about 1 1/2 teaspoon of chocolate mixture; form into a ball-shaped truffle and set aside on a piece of parchment paper on a work surface. Roll truffles in peppermint candy and lightly roll truffles between your hands to press candy pieces into truffles.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange Creamsicle Candied Pecans",
        "ingredients": [
            "2 large egg whites ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "1 teaspoon orange extract ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 teaspoons orange-flavored liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1 1/2 teaspoons coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon finely chopped fresh rosemary ADVERTISEMENT",
            "1 tangerine, finely zested ADVERTISEMENT",
            "1 pound shelled pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Heavily butter a large metal baking sheet.\nBeat egg whites and water together in the bowl of a stand mixer until stiff peaks form. Add orange extract and vanilla extract; beat until incorporated, 1 minute.\nMix sugar, cinnamon, salt, and black pepper together in a separate bowl; fold sugar mixture into egg white mixture until just incorporated. Fold in rosemary and tangerine zest until evenly mixed. Add pecans to the sugar-egg white mixture; toss to coat. Spread coated pecans in one layer onto the prepared baking sheet.\nBake in the preheated oven, turning the baking sheet and stirring the pecans with a metal spoon every 8 to 10 minutes, until crispy and golden brown, 30 to 40 minutes. Transfer to a sheet of parchment paper to cool completely.\n",
        "picture_link": "GYa6To8kkDVH1FJuxG8pA6xlRvAbz96"
    },
    {
        "title": "Sugar Spiced Almonds",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound blanched almonds ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "3/8 teaspoon sweet paprika ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine almonds and olive oil in a bowl; toss to coat. Spread almonds in a single layer on a baking sheet.\nBake in preheated oven until toasted, about 15 minutes. Allow almonds to cool slightly.\nWhile almonds are baking, mix sugar, cinnamon, paprika, and cayenne pepper in a small bowl. Sprinkle spice mixture over almonds and toss again. Spread almonds in a single layer and continue to bake until spices are fragrant, 5 to 10 minutes. Cool before serving.\n",
        "picture_link": "X0jgUeQesMCKKMc46q3wUIXUTgrK/p."
    },
    {
        "title": "Frosted Christmas Wreath Cookies",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1 (10 ounce) package miniature marshmallows ADVERTISEMENT",
            "1 drop green food coloring, or as desired ADVERTISEMENT",
            "3 cups corn flake cereal ADVERTISEMENT",
            "3 cups sugar-frosted corn flake cereal ADVERTISEMENT",
            "2 tablespoons cinnamon red hot candies, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with waxed paper and grease the paper.\nMelt margarine in a large saucepan over medium-low heat; stir marshmallows into melted margarine until mixture is smooth. Mix green food coloring into marshmallow mixture until color is dark green.\nGently stir regular and sugar-frosted corn flakes into marshmallow mixture until coated. Working quickly, drop the warm corn flakes mixture onto prepared waxed paper by tablespoon. Grease your fingers with butter and gently shape the mixture into green wreath-shaped forms. Decorate wreaths with cinnamon candies while still warm. Set wreaths aside to cool and set.\n",
        "picture_link": "7FP/NgBPEy5XmBC9oJQlevM1B2ePhPy"
    },
    {
        "title": "Layered Black Bean Dip",
        "ingredients": [
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1 cup canned black beans, rinsed ADVERTISEMENT",
            "1 (10 ounce) can RO*TEL Diced Tomatoes and Green Chilies, drained ADVERTISEMENT",
            "1 cup KRAFT Mexican Style Finely Shredded Four Cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread cream cheese onto bottom of shallow dish.\nTop with remaining ingredients.\n",
        "picture_link": "yDl.48Xu9Pc4xxi0BKZOlCLxjwzfVIi"
    },
    {
        "title": "Jody's Chilean Pot Pie",
        "ingredients": [
            "1 cup raisins ADVERTISEMENT",
            "4 1/2 cups beef broth ADVERTISEMENT",
            "1 (15 ounce) package pastry for a 9-inch double-crust pie ADVERTISEMENT",
            "3 pounds ground beef ADVERTISEMENT",
            "1/4 cup paprika ADVERTISEMENT",
            "3 tablespoons ground cumin ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 (6 ounce) can sliced olives ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "6 1-cup ramekins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak raisins in beef broth in a bowl for 1 hour.\nPreheat oven to 425 degrees F (220 degrees C). Unroll pie crust and place a ramekin, top side down, onto crust. Press lightly to make a circle. Repeat 5 more times to make 6 circles in all; cut out circles.\nCrumble ground beef into a large skillet, place over medium heat, and cook and stir until beef is browned, 10 to 15 minutes. Stir paprika, cumin, salt, and black pepper into ground beef. Drain raisins, reserving beef broth, and stir raisins and olives into beef mixture.\nMelt butter in a large saucepan over medium heat; stir flour into hot butter until thoroughly combined. Gradually stir reserved beef broth into flour mixture, reduce heat to medium-low, and bring to a simmer. Cook until sauce is thickened, about 5 minutes; season with salt and black pepper. Stir ground beef mixture into beef sauce.\nSpoon beef mixture into ramekins and top each with a pie crust circle, pressing crusts down onto edges of ramekins to seal. Cut several holes into top of each crust with a sharp knife. Set pot pies onto a baking sheet to contain drips.\nBake in the preheated oven until crusts are browned, 20 to 25 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Wizard's Pumpkin Juice",
        "ingredients": [
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "2 cups apple cider ADVERTISEMENT",
            "2 cups sparkling water ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend pumpkin and ice together in a blender on high until ice is finely chopped. Add apple cider, sparkling water, nutmeg, cinnamon, and salt; blend until smooth. Serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Justin and Christine's Hurricane Pork",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons maple syrup ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "2 teaspoons ground mustard ADVERTISEMENT",
            "2 cups ginger ale, divided ADVERTISEMENT",
            "1 pound pork tenderloin ADVERTISEMENT",
            "1 (16 ounce) package baby carrots ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a small saucepan over medium-low heat; stir maple syrup, curry powder, and ground mustard into butter until smooth. Pour 1/4 cup ginger ale into butter mixture. Reduce heat to low and simmer for 2 minutes.\nPlace pork tenderloin into a slow cooker and spread carrots over pork; pour remaining ginger ale over meat and carrots. Pour the butter syrup over the top.\nCover and cook on Low for 8 hours. Season with salt and black pepper.\n",
        "picture_link": "oyzXIaCVOaCQ5EcNt29khp6ivEKVzoC"
    },
    {
        "title": "Deep-Dish Chicken Pot Pie",
        "ingredients": [
            "1 pound boneless skinless chicken breasts, cut into bite-size pieces ADVERTISEMENT",
            "1/4 cup KRAFT Lite Zesty Italian Dressing ADVERTISEMENT",
            "4 ounces PHILADELPHIA Neufchatel cheese, cubed ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "1/2 cup fat-free reduced-sodium chicken broth ADVERTISEMENT",
            "3 cups frozen mixed vegetables (peas, carrots, corn, green beans), thawed, drained ADVERTISEMENT",
            "1/2 (15 ounce) package ready-to-use refrigerated pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F.\nCook chicken in dressing in large skillet on medium heat 2 min. Add Neufchatel; cook and stir 3 to 5 min. or until melted. Stir in flour until well blended. Add broth and vegetables; stir. Simmer 5 min.\nPour into 10-inch deep-dish pie plate; cover with pie crust. Seal and flute edge. Cut slits in crust to permit steam to escape.\nBake 30 min. or until golden brown.\n",
        "picture_link": "hA1zSPCBKO9sHR.YZIgGxDwYpK/k0dy"
    },
    {
        "title": "Jessica's Amazing Chocolate Mousse Pie",
        "ingredients": [
            "6 ounces semisweet baking chocolate, chopped ADVERTISEMENT",
            "3 tablespoons butter, at room temperature ADVERTISEMENT",
            "3 large eggs, separated ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup cold heavy whipping cream ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 (9 inch) prepared chocolate cookie crumb crust ADVERTISEMENT",
            "Chocolate Whipped Topping: ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "2 tablespoons cocoa powder ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chill a large bowl for about 1 hour.\nMelt chocolate and butter in the top of a double boiler over simmering water until smooth, about 5 minutes; remove from heat and allow to cool slightly. Whisk egg yolks into chocolate one at a time, allowing each yolk to blend completely before adding the next.\nBeat egg whites in another bowl until foamy. Beat in cream of tartar. Gradually beat in 1/4 cup white sugar until soft peaks form. Lift your beater or whisk straight up: the tip of the peak formed by the egg whites should curl over slightly.\nBeat 1/2 cup heavy cream in chilled bowl until thickened. Add 2 tablespoons white sugar and 1/2 teaspoon vanilla extract; continue to beat until soft peaks form.\nGently fold egg whites into chocolate mixture. Fold whipped cream into chocolate mixture until mousse is just blended. Spoon chocolate mousse into pie crust. Refrigerate until ready to serve.\nBeat 1 cup heavy cream, 1/3 cup white sugar, 2 tablespoons confectioners' sugar, cocoa powder, 1/4 teaspoon vanilla extract, and salt in bowl until soft peaks form. Spoon over chocolate mousse before serving.\n",
        "picture_link": "QYk7V2pyviuhbdGY8/qK36MlP2KICJy"
    },
    {
        "title": "Carne Asada Sandwich",
        "ingredients": [
            "Chipotle Mayonnaise: ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1/4 cup diced green onions ADVERTISEMENT",
            "1 1/2 tablespoons ground chipotle chile powder ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon garlic basil spread (see footnote for recipe link) ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt and freshly ground black pepper ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "2 pounds beef tri-tip steak, thinly sliced ADVERTISEMENT",
            "2 Anaheim chile peppers, diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground chipotle chile powder ADVERTISEMENT",
            "1 teaspoon smoked paprika ADVERTISEMENT",
            "1 teaspoon Mexican oregano ADVERTISEMENT",
            "1 cup chopped fresh cilantro ADVERTISEMENT",
            "2 jalapeno peppers, sliced (optional) ADVERTISEMENT",
            "Assembly: ADVERTISEMENT",
            "4 Italian-style hoagie buns, split lengthwise ADVERTISEMENT",
            "1/2 pound sliced Asiago cheese, divided ADVERTISEMENT",
            "1 avocado, sliced - divided ADVERTISEMENT",
            "1 cup halved cherry tomatoes, divided ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mayonnaise, sour cream, 1/2 cup cilantro, green onions, 1 1/2 tablespoon ground chipotle peppers, 1 tablespoon lime juice, garlic basil spread, 1 teaspoon cumin, salt, and black pepper in a bowl. Stir until combined. Cover and refrigerate chipotle mayonnaise for at least 1 hour.\nCombine beef tri-tip, Anaheim chile peppers, onion, red bell pepper, green bell pepper, juice of 1 lime, olive oil, garlic, red pepper flakes, 1 teaspoon cumin, 1 teaspoon ground chipotle pepper, smoked paprika, and Mexican oregano in a large bowl; season with salt and black pepper and toss to combine. Cover and refrigerate beef mixture for at least 4 hours.\nPreheat oven to 500 degrees F (260 degrees C).\nHeat a large pot or Dutch oven over medium-high heat. Add beef mixture and cook, stirring constantly, until onions soften and become golden and beef browns, 15 to 20 minutes. Stir in 1 cup chopped cilantro and jalapeno peppers.\nSpread each hoagie bun with 2 tablespoons chipotle mayonnaise. Spoon beef mixture into buns and top each sandwich with 2 ounces Asiago cheese.\nPlace sandwiches on a baking sheet and bake in the preheated oven until cheese is melted and bread is toasted and warm, about 5 minutes. Divide fresh avocado, cherry tomatoes, and 1/2 cup cilantro over the 4 sandwiches.\n",
        "picture_link": "2DXD8JM8ZbK6iDxys2/9SzLos2g2Hqu"
    },
    {
        "title": "Aunt Mary's Cookies",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "3 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sheets of waxed paper onto a work surface.\nStir sugar, cocoa, and evaporated milk together in a large nonstick saucepan over medium heat until mixture comes to a boil; boil for 5 minutes, stirring constantly. Remove from heat and stir butter and marshmallow creme into cocoa mixture. Quickly stir graham cracker crumbs into mixture.\nDrop cookies by the spoonful onto waxed paper; let stand until firm. Store in airtight containers.\n",
        "picture_link": "9GuZNXgvQCXlm.rfi.C37clZt7/DUai"
    },
    {
        "title": "Sour Cream Dark Chocolate Cake",
        "ingredients": [
            "1 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "2 cups unsalted butter, slightly softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch round baking pans.\nDissolve cocoa powder in boiling water in a bowl; set aside to cool completely.\nBeat white sugar and canola oil together in a bowl with an electric mixer until smooth; add eggs, one at time, beating well after each addition. Stir vanilla extract into creamed mixture.\nSift flour, baking soda, baking powder, and salt together in a separate bowl. Mix flour mixture and sour cream alternately into the creamed mixture. Beat cocoa mixture into batter until incorporated. Pour batter into the prepared baking pans.\nBake in the preheated oven until a toothpick inserted in the center of each cake comes out clean, 30 to 35 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack. Wrap cakes in plastic wrap and store in refrigerator.\nBeat butter in a bowl with an electric mixer until creamy and smooth; scrape down sides of bowl with a rubber spatula. Mix confectioners' sugar, 1/2 cup at a time, into the creamed butter until sugar is incorporated. Add salt and beat on medium-high until frosting is light and fluffy, about 5 minutes.\nPlace one cake on a serving plate; spread 1/4 the frosting on the top of cake. Place second cake on the frosting layer; spread 1/4 the frosting on second cake. Place the third cake atop the second cake. Spread the remaining frosting on the top cake and around sides of entire layer cake.\n",
        "picture_link": "7enYVKUvlqOss8pndBNEDqDhj4wJl9e"
    },
    {
        "title": "Dad G's Crab Cakes",
        "ingredients": [
            "2 tablespoons margarine ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1/2 cup minced green bell pepper ADVERTISEMENT",
            "1 tablespoon dry mustard ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 1/4 cups light cream ADVERTISEMENT",
            "1 pound crab meat ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1 cup corn oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt margarine in a skillet over medium heat. Cook and stir onion and green bell pepper in margarine until tender, about 5 minutes. Stir mustard, Worcestershire sauce, seafood seasoning, salt, hot pepper sauce, black pepper, and cayenne pepper into the onion mixture. Sprinkle flour over the mixture; stir to integrate. Pour cream over the mixture; bring to a boil, stirring constantly and cook for 1 minute. Fold crab meat into the mixture.\nSpoon some of the liquid from the skillet into the bowl with the beaten egg yolks to temper the egg; stir. Pour the egg mixture into the skillet and stir. Cook, stirring constantly, until the mixture thickens, about 5 minutes.\nTransfer crab mixture to a bowl; refrigerate until chilled completely, about 1 hour.\nMix bread crumbs, melted butter, and paprika in a shallow bowl.\nDivide the crab mixture into 4 portions; form into patties. Gently press the patties into the bread crumb mixture to coat.\nPour enough corn oil into a flat-bottomed pan to be 1-inch deep; heat to 350 degrees F (175 degrees C).\nCook patties in hot oil until golden brown, 2 to 3 minutes per side.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Cranberry Spread",
        "ingredients": [
            "1 cup cream cheese, softened ADVERTISEMENT",
            "1/2 cup whole berry cranberry sauce ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 cup chopped orange bell pepper ADVERTISEMENT",
            "1/2 cup creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cream cheese, cranberry sauce, feta cheese, almonds, green onions, orange pepper, and creamy salad dressing in a bowl.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Reunion Rum Punch",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 chai tea bag ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "8 cups pineapple juice ADVERTISEMENT",
            "2 cups rum, or as needed ADVERTISEMENT",
            "1 cup dry vermouth (such as Martini®) ADVERTISEMENT",
            "3 tablespoons vanilla-flavored syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan; pour into a mug and brew chai tea for 5 minutes. Remove tea bag and mix brown sugar into the hot tea until dissolved. Allow tea to cool for about 10 minutes.\nMix tea, pineapple juice, rum, vermouth, and vanilla-flavored syrup together in a large punch bowl; stir well. Chill for at least 2 hours before serving.\n",
        "picture_link": "EdZOuXwgNlzejNkm.dfl5MwxqCGIMZG"
    },
    {
        "title": "Minty Eggnog Hot Chocolate",
        "ingredients": [
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup eggnog ADVERTISEMENT",
            "1 (1 ounce) square semi-sweet chocolate ADVERTISEMENT",
            "3/4 cup mint-chocolate baking pieces (such as Andes®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk and eggnog together in a saucepan over medium-low heat until heated through, about 5 minutes. Stir in chocolate and mint-chocolate baking pieces; cook until chocolate is melted and smooth, 5 to 10 more minutes. Pour into 2 mugs.\n",
        "picture_link": "uom8Jr9w.Fr7.FAGvryLgNV8IWEXQXq"
    },
    {
        "title": "Marge's Margaritas",
        "ingredients": [
            "1 (12 ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "12 fluid ounces tequila ADVERTISEMENT",
            "1 cup ice cubes, or as needed ADVERTISEMENT",
            "6 fluid ounces triple sec ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend lemonade, tequila, ice cubes, triple sec, and lemon juice together in a blender until desired consistency is reached.\n",
        "picture_link": "wzAVlvOFCR70v8wssCy0oCrDACbZ2Mm"
    },
    {
        "title": "Flag Pizza",
        "ingredients": [
            "3 small purple potatoes ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 (13.8 ounce) can refrigerated pizza crust ADVERTISEMENT",
            "1 1/2 tablespoons olive oil, divided, or as needed ADVERTISEMENT",
            "25 slices pepperoni, or more as needed ADVERTISEMENT",
            "1 cup Alfredo sauce ADVERTISEMENT",
            "2 cups shredded Italian cheese blend ADVERTISEMENT",
            "5 mini mozzarella balls, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and slice potatoes into 1/4-inch rounds.\nPreheat oven to 400 degrees F (200 degrees C). Spray a large baking sheet with cooking spray.\nUnroll the refrigerated pizza crust and spread it out in the baking sheet to fit to the edges. Brush the crust with about 1 tablespoon olive oil.\nBake in the preheated oven until lightly golden and slightly set, about 7 minutes.\nArrange pepperoni slices on a paper towel-lined, microwave-safe plate. Microwave pepperoni on high until heated through, about 30 seconds.\nSpread Alfredo sauce over the baked crust; top with Italian cheese blend. Arrange potato rounds in the top left corner of the pizza, forming the blue portion of the flag. Brush potatoes with remaining olive oil. Place mozzarella ball halves on top of the potatoes to resemble the stars of the flag. Arrange pepperoni slices, slightly overlapping, in rows across the pizza to resemble the stripes on the flag.\nBake pizza in the oven until the crust is golden brown and cheese is melted, about 10 minutes.\n",
        "picture_link": "CSxsoZycoAc3DzeXhM5B9lcKrCTinty"
    },
    {
        "title": "Caramel Popcorn Brownies",
        "ingredients": [
            "1 (19.8 ounce) package brownie mix ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cups popped popcorn ADVERTISEMENT",
            "1/2 cup peanuts ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "1/2 cup peanut butter chips ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.\nStir brownie mix, water, oil, and egg together in a bowl. Pour brownie batter in a thin layer in the bottom of the prepared baking dish. Spread popcorn over brownie batter and lightly press into batter. Sprinkle peanuts, chocolate chips, and peanut butter chips over the popcorn.\nMelt butter in a small saucepan over medium heat. Whisk brown sugar into butter; bring to a boil, whisking constantly, and cook until mixture has a thin caramel texture, about 3 minutes. Drizzle caramel over popcorn mixture in the baking dish.\nBake in the preheated oven until brownies are set, 30 to 35 minutes. Cool before cutting into bars.\n",
        "picture_link": "mA9tNQsKtjJOCLaM7MUDtLLMGSr.v3u"
    },
    {
        "title": "Feta Burgers",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/3 cup crumbled feta cheese ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "2 tablespoons minced red bell pepper ADVERTISEMENT",
            "2 tablespoons chopped fresh mint ADVERTISEMENT",
            "2 tablespoons minced fresh parsley ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nMix ground beef, feta cheese, minced onion, red bell pepper, mint, parsley, garlic powder, onion powder, seasoned salt, and black pepper together in a large bowl until evenly mixed; shape into 6 patties.\nCook the burgers until they are beginning to firm, and are hot and slightly pink in the center, 4 to 5 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).\n",
        "picture_link": "nghw4shVQqbEc3QK5ooCZ8CqHkDOSHK"
    },
    {
        "title": "Easy Ginger Beef",
        "ingredients": [
            "1 pound round steak, thinly sliced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, peeled and thinly sliced ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "12 mushrooms, sliced ADVERTISEMENT",
            "1/4 cup sweet and sour sauce ADVERTISEMENT",
            "4 cups cooked rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place steak, ginger, and soy sauce in a bowl; turn to coat steak. Cover tightly; marinate in the refrigerator for at least 30 minutes or up to overnight.\nHeat a wok over high heat; pour in beef mixture. Cover wok; cook until beef is browned, about 5 minutes. Remove beef from wok.\nHeat butter in wok over high heat; stir in bell pepper, onion, mushrooms, and sweet and sour sauce. Cover and cook until vegetables begin to soften, about 3 minutes. Stir cooked beef into vegetable mixture; cook until heated through, about 2 minutes. Serve over cooked rice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cake Batter Mousse",
        "ingredients": [
            "1 (15.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "20 chocolate cream-filled sandwich cookies, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cake mix, water, and vegetable oil together in a bowl with an electric mixer on medium speed until smooth. Fold whipped topping and crushed cookies into batter.\nCover the bowl with plastic wrap and refrigerate until cookies are softened and mousse firms, about 24 hours.\n",
        "picture_link": "BtfbGAoUjO/bkIKa7uNExf48b8IYHo6"
    },
    {
        "title": "Firehouse Butter Beans and Sausage",
        "ingredients": [
            "3 (16 ounce) packages dried lima beans ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "2 1/2 pounds fully-cooked pork sausage, cut into 2-inch pieces ADVERTISEMENT",
            "2 tablespoons red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lima beans in a large pot with enough water to cover by 2 inches; bring to a boil. Remove pot from heat and let stand for 2 hours. Drain and rinse beans under cold water.\nTransfer beans back to large pot and pour in enough water to cover; add sausage and red pepper flakes. Bring water to a boil, decrease heat, and simmer, adding water as needed to keep beans from sticking to the bottom, until beans are tender and liquid has thickened, 1 to 2 hours.\n",
        "picture_link": "ARY0h59Q55.QByFwbEC4ydWBewngzZW"
    },
    {
        "title": "Cotton Candy Ice Cream",
        "ingredients": [
            "two 1/2-gallon-size resealable plastic bags ADVERTISEMENT",
            "2 (2.5 ounce) packages cotton candy ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "4 teaspoons vanilla extract ADVERTISEMENT",
            "two 1- gallon-size resealable plastic bags ADVERTISEMENT",
            "6 cups ice ADVERTISEMENT",
            "6 tablespoons rock salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill one 1/2-gallon-size resealable plastic bag with 1 package cotton candy, 1 cup milk, and 2 teaspoons vanilla extract; seal bag.\nFill one 1-gallon-size resealable plastic bag with 3 cups ice and 3 tablespoons rock salt. Place the sealed bag with cotton candy mixture into the filled 1-gallon bag. Seal the 1-gallon bag; shake until a firm ice cream forms, about 20 minutes. Repeat with remaining ingredients and bags.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Key Lime Cupcakes",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 (15.25 ounce) package white cake mix (such as Pillsbury® Classic White) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 tablespoons lime zest ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "3 drops green food coloring (optional) ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons lime zest ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar, sifted ADVERTISEMENT",
            "2 tablespoons pearlized sprinkles, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 24 muffin cups with paper liners or spray with cooking spray.\nMix cake mix, water, eggs, and vegetable oil together in a bowl using an electric mixer until batter is smooth, about 2 minutes. Add 2 tablespoons lime zest, lime juice, and food coloring; mix well. Pour batter into the prepared muffin cups.\nBake in the preheated oven until golden and a toothpick inserted in the center of a cupcake comes out clean, about 18 minutes. Cool cupcakes on a wire rack.\nBeat butter and cream cheese together in a bowl using an electric mixer until smooth and creamy. Add 2 tablespoons lime zest and vanilla extract to creamed butter mixture; mix well. Mix confectioners' sugar, 1/2 cup at a time, into creamed butter mixture until frosting is smooth; chill in refrigerator until frosting is thickened, about 30 minutes.\nSpread frosting onto each cupcake and top with sprinkles.\n",
        "picture_link": "e3ToyvZYZanI2XnX7OGRBfxVal2STzy"
    },
    {
        "title": "Tahitian Spam®",
        "ingredients": [
            "1 (13.5 ounce) can pineapple chunks, drained (juice reserved) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "1 (12 ounce) can fully cooked luncheon meat (such as SPAM®), chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine juice from canned pineapple, water, brown sugar, vinegar, and cornstarch in a saucepan; bring to a boil and cook, stirring constantly, until sauce is thickened and you notice a change in color, about 5 minutes.\nStir pineapple chunks, green bell pepper, and luncheon meat into sauce and simmer until heated through, about 10 minutes.\n",
        "picture_link": "8NHgY3/LucslgUC0kMT0a22qzOiEU2a"
    },
    {
        "title": "Low-Cal Bean Dip",
        "ingredients": [
            "1 (16 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 (7 ounce) jar roasted red bell peppers, drained and rinsed ADVERTISEMENT",
            "1 small avocado, peeled and pitted ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1 1/2 tablespoons minced garlic ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon smoked paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon curry powder ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put cannellini beans, roasted red bell peppers, avocado, basil, garlic, lemon juice, balsamic vinegar, paprika, salt, pepper, and curry powder in a food processor bowl; process until smooth. With the processor running, slowly stream olive oil into the mixture until smooth.\n",
        "picture_link": "ioCWrderEhgJklrCgKBql.vGkbiJR8u"
    },
    {
        "title": "Awesome Green Beans with Kale",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 small shallots, chopped ADVERTISEMENT",
            "2 small garlic cloves, chopped ADVERTISEMENT",
            "1/2 cup chopped kale ADVERTISEMENT",
            "2 tablespoons condensed cream of chicken soup ADVERTISEMENT",
            "1 tablespoon sriracha sauce ADVERTISEMENT",
            "1 tablespoon cream cheese ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "1 (15 ounce) can cut green beans, drained ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat. Fry shallot and garlic in hot oil until golden brown, 2 to 3 minutes; add kale, cream of chicken soup, sriracha sauce, cream cheese, and sour cream to the skillet. Cook and stir the mixture until the cream cheese melts and the liquid is even in color, about 5 minutes.\nStir green beans into the mixture to coat, season with black pepper, reduce heat to medium-low, and simmer until the sauce thickens slightly, 5 to 7 minutes.\n",
        "picture_link": "amEU0Pb.jhdSkxl1qzG0d6PLeenLGWy"
    },
    {
        "title": "Chocolate Chip Sour Cream Cake",
        "ingredients": [
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 pint sour cream ADVERTISEMENT",
            "1 (12 ounce) bag semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch pan.\nBeat sugar and butter together in a large bowl with an electric mixer until light and fluffy; add eggs one at a time, thoroughly beating each egg into the butter mixture before adding the next. Add vanilla with the last egg.\nSift flour, baking powder, and baking soda together in a bowl. Pour flour mixture alternately with the sour cream into the butter mixture, mixing until just incorporated. Fold chocolate chips into the batter. Pour batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, about 30 minutes.\n",
        "picture_link": "HxU5g4Hyy3YxdM7v6P2HaUZq.vlXZli"
    },
    {
        "title": "White Chocolate Vanilla Mashed Potatoes",
        "ingredients": [
            "3 pounds Yukon Gold potatoes, peeled and cut into 1 1/2-inch chunks ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 vanilla bean, split lengthwise ADVERTISEMENT",
            "1/2 cup white chocolate baking discs ADVERTISEMENT",
            "4 ounces shredded extra-sharp white Cheddar cheese ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nCombine milk and vanilla bean in a saucepan over medium-heat. When the milk begins to bubble, remove and discard the vanilla bean. Add chocolate chips to milk; whisk continuously until chocolate is melted.\nMash potatoes in a large bowl. Add milk-chocolate mixture to potatoes and stir until combined. Add cheese and mash together with potatoes; season with salt.\n",
        "picture_link": "YXf6I.tOT8SXiUC7skLPqqZWY.azCFC"
    },
    {
        "title": "Escalloped Pineapple",
        "ingredients": [
            "2 cups bread crumbs ADVERTISEMENT",
            "1 (15 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup margarine, melted ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 1 1/2-quart baking dish.\nStir bread crumbs, pineapple, sugar, margarine, and eggs together in a bowl. Pour mixture into prepared baking dish.\nBake in the preheated oven until hot and bubbling, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grilled Cipollini Onions",
        "ingredients": [
            "2 wooden skewers, or as needed ADVERTISEMENT",
            "12 cipollini onions, peeled ADVERTISEMENT",
            "1/2 cup coarsely chopped fresh basil ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon seasoned salt (such as LAWRY'S®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a shallow dish with water; soak wooden skewers in water for 30 minutes.\nPlace onions, basil, oil, and salt in a bowl; toss to coat onions. Refrigerate until flavors blend, 30 to 60 minutes.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nThread onions onto prepared skewers, weaving basil between onions.\nCook onions on the preheated grill, turning once, until sweet and tender, about 10 minutes.\n",
        "picture_link": "516cJ0laLdLLYgNvYNodmEVjNDwZ8Tm"
    },
    {
        "title": "Riverbank Margaritas",
        "ingredients": [
            "1 (12 fluid ounce) can frozen limeade concentrate ADVERTISEMENT",
            "12 fluid ounces tequila ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle lemon-lime soda (such as Sprite®) ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle Mexican beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix limeade, tequila, lemon-lime soda, and beer together in a pitcher.\n",
        "picture_link": "IbZHR.1uH9w2eVGK9qBR3EwEYMuYPBW"
    },
    {
        "title": "Coffee Brownie Milkshake",
        "ingredients": [
            "1 1/2 cups vanilla ice cream ADVERTISEMENT",
            "1/4 cup strong brewed coffee ADVERTISEMENT",
            "1/4 cup brownie mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cream, coffee, and brownie mix in a blender until smooth.\n",
        "picture_link": "/bcClAvt6i1KAckyU6g4PQIa.fhmqzW"
    },
    {
        "title": "Spicy Watermelon Salsa",
        "ingredients": [
            "6 cups cubed watermelon, divided ADVERTISEMENT",
            "1 serrano chile pepper ADVERTISEMENT",
            "1/2 cup salsa verde (such as Herdez®) ADVERTISEMENT",
            "1 serrano chile pepper, minced ADVERTISEMENT",
            "1 teaspoon taco seasoning mix ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 3 cups watermelon and 1 whole serrano chile pepper in a blender; blend on the liquefy setting until sauce is smooth.\nMix remaining 3 cups watermelon, salsa verde, minced serrano chile pepper, and taco seasoning together in a bowl. Pour watermelon sauce over watermelon mixture; toss to coat. Season salsa with salt.\n",
        "picture_link": "atPGxDnN7HtjsOpjVCTcoCdfcazFGo."
    },
    {
        "title": "Poor Boy Spread",
        "ingredients": [
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 1/2 teaspoons prepared horseradish, or to taste ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir Worcestershire sauce, ketchup, mayonnaise, horseradish, lemon juice, garlic powder, and black pepper together in a bowl. Cover bowl with plastic wrap and refrigerate until chilled, 30 minutes to a full day.\n",
        "picture_link": "8WXFsRrhWq/h2l6qZQg4fhZBXy2ZZIi"
    },
    {
        "title": "Almond Milk from Oster®",
        "ingredients": [
            "1 cup whole blanched or natural almonds ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 tablespoon honey (optional) ADVERTISEMENT",
            "Few pinches kosher salt (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place almonds and water in Oster(R) Versa(R) Performance Blender.\nBlend on HIGH for 1 minute.\nStrain mixture through a fine-mesh sieve lined with several layers of cheesecloth; let stand until completely drained. Pick up edges of cheesecloth; squeeze gently to remove milk.\nIf desired, return strained milk to blender and add honey and salt; PULSE on HIGH 2-3 times to combine.\nTransfer to a covered container; refrigerate until cold. Use within 3 days.\n",
        "picture_link": "CJTdMvY3TdjdDy4RhUe.fAmwklQMmpm"
    },
    {
        "title": "Ultra-Simple and Delicious Red Radish Salad",
        "ingredients": [
            "1 bunch red radishes, coarsely shredded ADVERTISEMENT",
            "1 1/2 tablespoons olive oil, or to taste ADVERTISEMENT",
            "1 tablespoon reduced-sodium tamari, or to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix radishes, olive oil, and tamari together in a bowl; garnish with parsley.\n",
        "picture_link": "Z1fHRNu/xH1hcKFqxXSqpX./AZCsTU."
    },
    {
        "title": "Simple Strawberry Salsa",
        "ingredients": [
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 cup finely chopped strawberries ADVERTISEMENT",
            "1 (8 ounce) can unsweetened crushed pineapple, drained ADVERTISEMENT",
            "3 kiwis, peeled and finely chopped ADVERTISEMENT",
            "1 naval orange, peeled and cut into small pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir lemon juice and sugar together in a bowl to dissolve the sugar; add strawberries, pineapple, kiwis, and orange pieces and stir to coat in the lemon juice mixture.\nCover bowl with plastic wrap and refrigerate at least 30 minutes.\n",
        "picture_link": "7AhZ8g6GLkYQPpllLn2Y0kAl4llXwnm"
    },
    {
        "title": "Garbanzo Bean Mint Tacos",
        "ingredients": [
            "1 (15 ounce) can garbanzo beans, drained and rinsed ADVERTISEMENT",
            "1 cup diced tomatoes ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "2 ounces sliced black olives ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "6 (6 inch) corn tortillas ADVERTISEMENT",
            "3 cups mixed greens ADVERTISEMENT",
            "1 large avocado, sliced ADVERTISEMENT",
            "1/2 cup crumbled queso fresco ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir garbanzo beans, tomatoes, mint, olives, balsamic vinegar, and sea salt together in a bowl.\nHeat a skillet over medium heat. Cook tortillas, one at a time, in hot skillet until warmed through and pliable, 1 to 2 minutes.\nSpoon garbanzo bean mixture into warm tortillas. Top with greens, avocado slices, and queso fresco.\n",
        "picture_link": "gtqtyYbK.ut2GKBhze2NdZJAZ3kCamG"
    },
    {
        "title": "Gehakt Ballen (Dutch Meatballs)",
        "ingredients": [
            "1 pound ground meatloaf mix (beef, pork veal) ADVERTISEMENT",
            "4 slices white bread ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 tablespoon freshly grated nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place meatloaf mix in a large mixing bowl; crumble bread over meat and knead with hands to combine. Add milk and egg to meat mixture. Knead onion, nutmeg, cloves, salt, and pepper into meat mixture until well-combined. Form mixture into six equal-sized balls.\nMelt butter in a Dutch oven over medium-high heat. Cook and stir meatballs in hot butter until browned on all sides, 5 to 10 minutes. Stir water, tomatoes, beef broth, and onion soup mix into Dutch oven; bring to a boil, reduce heat to medium-low, and simmer until meatballs are tender and cooked through, about 1 hour.\n",
        "picture_link": "q3nVomn5vO95h31PSJPZt.lVkdWzAMm"
    },
    {
        "title": "Organic Banana Bread",
        "ingredients": [
            "3 over-ripe bananas, mashed ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 tablespoons canola oil ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 cups whole wheat pastry flour ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup dark chocolate chunks (optional) ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine bananas, eggs, canola oil, and cinnamon in a bread machine; add flour, walnuts, chocolate, sugar, baking powder, baking soda, and vanilla extract.\nFollow manufacturer's instructions for 'quick bread' setting.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Non-Strawberry Milk",
        "ingredients": [
            "4 cubes ice, or as desired ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger amaretto liqueur, or to taste ADVERTISEMENT",
            "1 fluid ounce grenadine syrup ADVERTISEMENT",
            "1/4 cup milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put ice cubes in a tall glass; add amaretto and grenadine. Pour enough milk into the glass to fill; stir.\n",
        "picture_link": "MNIc.t1mW3regWc/tCssbSbnVq3wxyS"
    },
    {
        "title": "Citrus-Ginger Granita",
        "ingredients": [
            "3/4 cup water ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons grated fresh ginger ADVERTISEMENT",
            "2 lemons, zested ADVERTISEMENT",
            "2 limes, zested ADVERTISEMENT",
            "5 cups orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, sugar, ginger, lemon zest, and lime zest together in a saucepan over medium-high heat until sugar dissolves and mixture is bubbling, 5 to 10 minutes; cool slightly.\nStir the ginger mixture an orange juice together in a pitcher; pour into a 9x13-inch baking dish.\nPlace dish in the freezer; scrape and stir orange juice mixture with a fork once every hour until granita is evenly frozen and crystallized, about 6 hours.\n",
        "picture_link": "CGw2R1K13Wn5dIAhDxJ3kZVVuI9PwzK"
    },
    {
        "title": "Gluten-Free, Egg-Free Pumpkin Coconut Flour Pancakes",
        "ingredients": [
            "4 1/2 tablespoons coconut flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "1 teaspoon xanthan gum ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk coconut flour, salt, baking powder, and baking soda together in a bowl.\nStir pumpkin puree, coconut milk, sugar, and xanthan gum together in another bowl until smooth; stir into flour mixture until batter is thick and smooth.\nHeat oil in a griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "0Fl76zfgQ8PWr3VzLKOn/e44iBlrOVG"
    },
    {
        "title": "Pretzel and Peanut Butter Bark",
        "ingredients": [
            "1/2 (12 ounce) package milk chocolate candy wafers, divided ADVERTISEMENT",
            "1/2 (12 ounce) package dark chocolate candy wafers, divided ADVERTISEMENT",
            "1 (12 ounce) bag square-shaped pretzels, divided, or as needed ADVERTISEMENT",
            "1/2 (16 ounce) jar peanut butter, divided ADVERTISEMENT",
            "1/2 cup roasted slivered almonds, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1/4 of the milk chocolate wafers and 1/4 of the dark chocolate wafers in a microwave-safe glass or ceramic bowl. Melt chocolate in a microwave in 30-second intervals, stirring after each melting, until chocolate is completely melted and creamy, 1 to 3 minutes.\nCrumble enough pretzels into melted chocolate until mixture is lumpy but not thick. Spread chocolate mixture into the bottom of a baking dish. Refrigerate or freeze until firm, 10 to 15 minutes.\nPlace peanut butter in a microwave-safe bowl. Soften peanut butter in microwave until easily spreadable, 30 to 60 seconds. Spread peanut butter over hardened chocolate layer. Refrigerate or freeze until firm, 10 to 15 minutes.\nCombine remaining milk chocolate and dark chocolate wafers in the same microwave-safe bowl. Melt chocolate in a microwave in 30-second intervals, stirring after each melting, until chocolate is completely melted and creamy, 1 to 3 minutes.\nCrumble enough pretzels into melted chocolate until mixture is lumpy but not thick. Spread chocolate mixture over peanut butter layer and top with almonds. Refrigerate or freeze until firm. Break bark into pieces.\n",
        "picture_link": "JqcByptHFH4zqCxNtxZR0h3uog6bZ9C"
    },
    {
        "title": "Karen's Fruit Pizza",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "Cream Cheese Layer: ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "Fruit: ADVERTISEMENT",
            "1/2 cup sliced fresh strawberries, or as desired ADVERTISEMENT",
            "1/2 cup diced pineapple, or as desired ADVERTISEMENT",
            "1/2 cup sliced fresh peaches, or as desired ADVERTISEMENT",
            "Fruit Glaze: ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease two 12-inch pizza pans.\nMix cake mix, eggs, and vegetable oil together in a bowl until batter is just mixed; press into the prepared pizza pans.\nBake crust in the preheated oven until lightly browned, about 10 minutes. Remove crusts from oven and cool completely, at least 30 minutes.\nWhisk cream cheese, confectioners' sugar, and almond extract together in a bowl until smooth; spread onto the cooled crusts.\nArrange strawberries, pineapple, and peaches on the cream cheese layer.\nCombine white sugar, orange juice, lemon juice, water, and cornstarch together in saucepan over medium heat; cook and stir until glaze is thickened, 5 to 10 minutes. Remove saucepan from heat and refrigerate glaze until cooled, about 20 minutes.\nDrizzle glaze over fruit and refrigerate pizza until chilled, at least 30 minutes.\n",
        "picture_link": "KV3zvkKlh9QEXyyi/jXODQ/qTXIwaKG"
    },
    {
        "title": "11-Can Chili",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "2 small onions, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "2 (15 ounce) cans red kidney beans, rinsed and drained ADVERTISEMENT",
            "2 (15 ounce) cans pinto beans, rinsed and drained ADVERTISEMENT",
            "2 (15 ounce) cans black beans, rinsed and drained ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 (1.25 ounce) packages chili seasoning mix ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large pot over medium-high heat. Cook and stir beef, onion, and garlic together in the hot skillet until beef is completely browned, 5 to 7 minutes; drain and discard grease.\nStir diced tomatoes, kidney beans, pinto beans, black beans, crushed tomatoes, tomato paste, chili seasoning mix, salt, and black pepper with the beef mixture; bring to a boil, reduce heat to medium-low, place a cover on the pot, and simmer the chili until the beans are tender, about 20 minutes.\n",
        "picture_link": "qtMaExYpYMK7ZnZONt/Pwlucz52m2UW"
    },
    {
        "title": "DIY Cocoa-Hazelnut Spread",
        "ingredients": [
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon kosher salt (optional) ADVERTISEMENT",
            "1 cup unsalted hazelnuts, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients in Oster(R) Versa(R) Performance Blender in order listed; PULSE on HIGH 2 to 3 times, using tamper to press ingredients into blade.\nBlend on HIGH for 1-1/2 to 2 minutes or until creamy; transfer to a covered container.\nStore airtight in refrigerator.\n",
        "picture_link": "Bf//TcL6mHAb7TNGb2SzQ/ttDBv8JRi"
    },
    {
        "title": "Great Chocolate Chocolate Chip Cookies",
        "ingredients": [
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2/3 cup cocoa powder ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat brown sugar, white sugar, margarine, shortening, eggs, and vanilla extract together in a large bowl with an electric mixer until light and fluffy.\nWhisk flour, cocoa powder, baking soda, and salt together in a separate bowl; beat into sugar mixture until you have a dough. Stir chocolate chips and walnuts into dough. Drop rounded teaspoonfuls of dough 2 inches apart onto baking sheets.\nBake in the preheated oven until golden and set, 8 to 10 minutes. Cool briefly on the baking sheets before transferring to wire racks to cool completely.\n",
        "picture_link": "0Hzj6jdZEKT2Ed83.FNfZtijD0qkWsy"
    },
    {
        "title": "Crowd-Pleasing Pea Salad",
        "ingredients": [
            "1/4 pound sharp Cheddar cheese ADVERTISEMENT",
            "2 (15 ounce) cans sweet peas, drained ADVERTISEMENT",
            "1/3 cup diced red onion ADVERTISEMENT",
            "1/2 cup mayonnaise, or to taste ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grate Cheddar cheese into a bowl and refrigerate while draining peas and dicing onion to keep cheese shreds from sticking together.\nMix cheese, peas, onion, mayonnaise, sugar, salt, and pepper together in a bowl.\nCover bowl with plastic wrap and refrigerate 1 hour to overnight.\n",
        "picture_link": "st/Sr8dQINxrKDUr8oaFkWwyYLrPUQS"
    },
    {
        "title": "Mahalabia (Middle Eastern-Style Milk Pudding)",
        "ingredients": [
            "3 cups milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "6 tablespoons cornstarch ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 tablespoon rose water ADVERTISEMENT",
            "2 cardamom pods, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk and sugar together in a saucepan; bring to a boil.\nWhisk water and cornstarch together in a bowl until smooth; stir into boiling milk. Cook milk mixture over medium heat until thickened to the consistency of cake batter, 15 to 20 minutes. Remove saucepan from heat and stir cream, rose water, and cardamom into milk mixture.\nRefrigerate milk mixture until completely cooled, 2 to 4 hours.\n",
        "picture_link": "ZfXYPG065SdAbKLgkT8RfNZfLisC/h2"
    },
    {
        "title": "Great White Cocktail",
        "ingredients": [
            "1 1/2 fluid ounces vodka ADVERTISEMENT",
            "1 fluid ounce white cranberry juice ADVERTISEMENT",
            "1/2 fluid ounce triple sec ADVERTISEMENT",
            "1/4 fluid ounce lime juice ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "3 drops grenadine syrup (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vodka, cranberry juice, triple sec, and lime juice in a cocktail shaker. Add ice; cover and shake. Strain into a cocktail glass. Add grenadine to drink, which will sink to the bottom.\n",
        "picture_link": "oSXHyxan9A1JahSNlhNkNFOmh/EI/e6"
    },
    {
        "title": "Blue Lagoon Margaritas",
        "ingredients": [
            "2 fluid ounces sour mix ADVERTISEMENT",
            "1 1/2 fluid ounces pineapple juice ADVERTISEMENT",
            "1 1/4 fluid ounces tequila ADVERTISEMENT",
            "1 fluid ounce Blue Curacao ADVERTISEMENT",
            "1/2 fluid ounce lime juice ADVERTISEMENT",
            "1 cup ice, or more if desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend sour mix, pineapple juice, tequila, Blue Curacao, lime juice, and ice together in a blender until smooth.\n",
        "picture_link": "V0BNvkfEaOVow2b91h0EagfnYWGetaa"
    },
    {
        "title": "Mama's Goat Cheese Rigatoni",
        "ingredients": [
            "1 pound rigatoni ADVERTISEMENT",
            "1/2 pound Italian sausage, casings removed and broken into chunks ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "1/2 cup minced yellow onion ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "4 cups canned diced tomatoes, undrained ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "4 ounces crumbled goat cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook rigatoni in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 13 minutes; drain.\nHeat olive oil in a large pot over medium heat. Cook and stir sausage in the hot oil until lightly browned, 5 to 7 minutes. Add onion, red bell pepper, and garlic to sausage mixture; cook and stir until peppers are tender, 5 to 10 minutes.\nStir white wine into sausage mixture; bring to a simmer and cook until slightly reduced, 3 to 5 minutes. Add tomatoes, red pepper flakes, salt, and black pepper; bring to a boil, reduce heat to medium-low, and simmer, stirring frequently, until sauce thickens, 10 to 15 minutes.\nMix rigatoni, Romano cheese, and fresh basil into sausage mixture; bring to a simmer and cook until cheese melts and flavors blend, about 3 minutes. Ladle into bowls and top with goat cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Double Chocolate Granola",
        "ingredients": [
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup chopped cashews ADVERTISEMENT",
            "1/3 cup shredded coconut ADVERTISEMENT",
            "1/3 cup chopped dried mixed fruit ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1/4 cup unsweetened cocoa ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "5 tablespoons miniature semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix oats, cashews, coconut, and mixed fruit together in a large bowl.\nMelt butter in a large saucepan over low heat. Stir honey into melted butter until smooth; add oats mixture and stir to coat. Sprinkle cocoa powder over the oats mixture; stir. Drizzle vanilla extract over the mixture; stir. Season mixture with a pinch of salt.\nSpread oats mixture in a single layer onto a baking sheet; toast in preheated oven, stirring once about halfway through, until crisp, about 10 minutes.\nCool oats mixture to room temperature. Transfer to an airtight container, add chocolate chips, and stir.\n",
        "picture_link": "dssRxoPLrSGpXvQImYnW2Qh9DaIHXsW"
    },
    {
        "title": "Sauteed Purple Carrot and Vegetable Medley",
        "ingredients": [
            "2 tablespoons butter, divided ADVERTISEMENT",
            "2 red potatoes, cut into cubes ADVERTISEMENT",
            "2 red carrots, sliced ADVERTISEMENT",
            "1 small yellow onion, chopped ADVERTISEMENT",
            "6 Brussels sprouts, quartered, or to taste ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1/4 cup fresh peas, shelled, or to taste ADVERTISEMENT",
            "4 cloves garlic, halved ADVERTISEMENT",
            "3 sprigs fresh thyme, chopped, or to taste ADVERTISEMENT",
            "1/2 teaspoon sea salt, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or more to taste ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 cups fresh spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon butter in a large skillet over medium heat; cook and stir potatoes and carrots in hot butter until browned, 2 to 3 minutes.\nStir Brussels sprouts, bell pepper, peas, garlic, thyme, sea salt, and black pepper into the potato mixture; cook and stir until vegetables are slightly browned, 2 to 3 minutes.\nPour water into the skillet; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon.\nStir remaining tablespoon butter and spinach into the vegetable mixture; toss to coat spinach in liquid. Cook until spinach wilts, about 5 minutes. Remove skillet from heat and adjust seasoning.\n",
        "picture_link": "k6VOO8pF77cM8tV6M1xLEhnXaG8UwyS"
    },
    {
        "title": "Joey's Mini Cupcakes",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "16 ounces miniature chocolate chips ADVERTISEMENT",
            "Cupcakes: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons white sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease or line 44 miniature muffin cups with paper liners.\nBeat cream cheese, 1/2 cup sugar, egg, and 1/8 teaspoon salt together in a bowl until filling is smooth; fold in chocolate chips.\nSift flour, 1 cup sugar, cocoa powder, baking soda, and 1/2 teaspoon salt together in a bowl. Beat water, vegetable oil, vinegar, and vanilla extract into flour mixture until batter is evenly mixed. Fill muffin cups 1/3-full with batter; top each with about 1 teaspoon cream cheese filling. Sprinkle cupcakes with remaining 2 tablespoons sugar.\nBake in the preheated oven until a toothpick inserted in the sides of a cupcake come out clean, 30 to 35 minutes.\n",
        "picture_link": "QuLuKWbcwXc/YGlQd1c8ihUZSbEkFO2"
    },
    {
        "title": "Kale Tabbouleh with Quinoa",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup quinoa ADVERTISEMENT",
            "1 bunch curly leaf parsley ADVERTISEMENT",
            "1/2 bunch curly leaf kale ADVERTISEMENT",
            "1 pint grape tomatoes, halved ADVERTISEMENT",
            "1/2 English cucumber, diced ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil, or more to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and quinoa to a boil in a small saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes.\nStarting at the leafy top, cut parsley and kale perpendicular to the stems in 1/2- or 1/4-inch cuts until you reach the point where there's nothing left but stems. Discard stems. Chop the pile of greens on your board with a knife or cleaver until the pieces of parsley and kale are no larger than 1/4 inch. It should be pretty fine, but you don't want it to turn into a paste. Transfer parsley and kale to a large mixing bowl. Toss quinoa, grape tomatoes, cucumber, and shallot with the parsley and kale.\nWhisk lemon juice, olive oil, and salt together in a small bowl; drizzle over the salad and toss to coat.\n",
        "picture_link": "ZQe6wALdUNohCIh415oRGToz30n0tla"
    },
    {
        "title": "Tuscan Cheese Potato Bake",
        "ingredients": [
            "5 tablespoons butter ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "3 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh thyme ADVERTISEMENT",
            "5 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 cup shredded fontina cheese ADVERTISEMENT",
            "2 pounds red potatoes, thinly sliced, ends discarded ADVERTISEMENT",
            "1/4 cup Italian-style panko bread crumbs, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 3-quart baking dish.\nMelt butter in a large saucepan over medium-high heat. Saute onion, garlic, and thyme in hot butter until onion is tender, 3 to 5 minutes. Whisk flour, salt, and black pepper into onion mixture.\nGradually whisk milk and cream into onion mixture; bring to a boil, reduce heat to low, and simmer until sauce thickens, about 2 minutes.\nStir sour cream into sauce until smooth; add fontina cheese and stir until cheese melts.\nArrange 1/2 the potatoes in the bottom of the prepared baking dish. Pour 1/2 the cheese sauce over the potatoes. Repeat with remaining potatoes and cheese sauce. Top with bread crumbs to cover potatoes entirely.\nBake in the preheated oven until potatoes are tender and bread crumbs are golden brown, 60 to 70 minutes.\n",
        "picture_link": "N2xZW/mtz/mrTGwJu39FW4kgvkzwJa6"
    },
    {
        "title": "Ida's Passover Popover Rolls",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 cups matzo meal ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBring water, oil, sugar, and salt to a boil in a saucepan. Remove from heat and quickly stir in matzo meal. Beat eggs one at a time into matzo mixture until blended. With wet hands, roll dough into 18 rolls and arrange on a baking sheet. Cut an 'X' into each roll.\nBake in the preheated oven until golden brown, 30 to 45 minutes.\n",
        "picture_link": "29fZiRHT9xxWNJpsNY4vZQxm1tWMzXm"
    },
    {
        "title": "Spin-Off Puppy Chow ",
        "ingredients": [
            "9 cups crispy rice cereal squares (such as Rice Chex ®) ADVERTISEMENT",
            "1 cup white chocolate chips ADVERTISEMENT",
            "1/2 cup sunflower seed butter ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups confectioners sugar, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cereal squares in a bowl.\nCombine white chocolate chips, sunflower seed butter, and butter in a microwave-safe bowl; heat in microwave until melted and smooth, about 1 1/2 minutes. Stir chocolate mixture; add vanilla extract and stir. Pour chocolate mixture over cereal; stir to evenly coat. Add confectioners' sugar and stir until evenly coated.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easter White Borscht",
        "ingredients": [
            "9 cups water ADVERTISEMENT",
            "3 pounds kielbasa sausage ADVERTISEMENT",
            "2 cloves garlic, whole ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 leeks, chopped ADVERTISEMENT",
            "1 white onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "1/4 cup all-purpose flour, or more as needed ADVERTISEMENT",
            "1/4 cup chopped fresh dill ADVERTISEMENT",
            "2 tablespoons white vinegar, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 hard-cooked eggs, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water, kielbasa, and 2 whole cloves garlic to boil in a large pot; reduce heat to medium and simmer for 30 minutes. Remove sausage and pour liquid into a separate bowl. Cut sausage into cubes.\nMelt butter over medium heat in the pot used to boil sausage; cook and stir leeks, onion, and minced garlic until vegetables are tender, about 5 minutes. Transfer vegetables to a blender; add about 1/2 cup reserved sausage water and blend until smooth, adding more water as needed.\nPour vegetable puree and remaining sausage water back into the original pot. Add bay leaves and bring borscht to a simmer over medium heat; remove and discard leaves. Whisk sour cream and flour in a bowl until smooth; gradually whisk into borscht until thickened. Stir dill and vinegar into soup and season with salt and black pepper.\nDivide cubed sausage and chopped eggs into bowls; ladle borscht over sausage and egg.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Amish Breakfast Bake",
        "ingredients": [
            "1 large Anaheim chile pepper ADVERTISEMENT",
            "2 (12 ounce) packages reduced fat pork sausage (such as Jimmy Dean®) ADVERTISEMENT",
            "1 cup chopped sweet onion ADVERTISEMENT",
            "1 cup chopped zucchini ADVERTISEMENT",
            "1 cup chopped bell pepper ADVERTISEMENT",
            "18 eggs, lightly beaten ADVERTISEMENT",
            "1 (2 pound) package frozen southwestern-style hash brown potatoes, thawed ADVERTISEMENT",
            "3 cups shredded reduced-fat Cheddar cheese ADVERTISEMENT",
            "2 cups low-fat small curd cottage cheese ADVERTISEMENT",
            "1 1/2 cups shredded reduced-fat Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nCut the Anaheim pepper into halves lengthwise; remove and discard the stem, seeds, and ribs. Place the pepper, cut-sides down, onto the prepared baking sheet.\nCook under the preheated broiler until the skin of the pepper has blackened and blistered, 5 to 8 minutes. Place the blackened pepper into a bowl and tightly seal with plastic wrap. Allow the pepper to steam as it cools, about 20 minutes. Remove and discard skins; chop pepper.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nCook and stir sausage in a large skillet over medium-high heat until browned and crumbly, 5 to 7 minutes; remove sausage using a slotted spoon to a plate, leaving rendered fat in the skillet.\nReturn skillet to medium-high heat. Saute onion, zucchini, bell pepper, and Anaheim pepper in hot skillet until just tender, about 4 minutes.\nStir eggs, hash browns, Cheddar cheese, cottage cheese, and Swiss cheese together in a large bowl; add sausage and sauteed vegetables and stir. Pour egg mixture into prepared baking dish.\nBake in the preheated oven until eggs are set and mixture is bubbling, about 70 minutes. Let cool for 10 minutes before slicing.\n",
        "picture_link": "YD3xASE5DVsuvJESR4fCc5OtD.bRdCO"
    },
    {
        "title": "Betty's Pineapple Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups crushed pineapple, undrained ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2/3 cup evaporated milk ADVERTISEMENT",
            "9 tablespoons margarine ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix flour, pineapple, 1 1/2 cups white sugar, oil, egg whites, baking soda, and salt together in a bowl; pour into a 9x13-inch baking dish.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 35 to 40 minutes.\nHeat 2/3 cup sugar, evaporated milk, and margarine together in a saucepan; bring to a boil. Stir 1/2 cup sugar mixture into egg yolks until egg yolks are warmed. Stir egg yolk mixture back into saucepan with sugar mixture; bring to a boil and cook, stirring often, until reduced and thickened, at least 7 minutes. Pour hot mixture over cake. Set cake aside to cool until set, at least 4 hours.\n",
        "picture_link": "r6/Ce3GmR0IrCaoOd65z0pTLPH7AXBq"
    },
    {
        "title": "Bok Choy with Carrot",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 small beet, peeled and thinly sliced ADVERTISEMENT",
            "3 ounces carrots, peeled and thinly sliced ADVERTISEMENT",
            "3 1/2 ounces daikon radishes, thinly sliced ADVERTISEMENT",
            "2 crimini mushrooms, thinly sliced ADVERTISEMENT",
            "3 1/2 ounces bok choy ADVERTISEMENT",
            "1/4 teaspoon ground cardamom ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium-high heat; saute beet, carrots, daikon radishes, and mushrooms until slightly tender, about 5 minutes. Cover skillet.\nCut bottom half off bok choy and chop. Slice bok choy leaves into ribbons.\nStir chopped bok choy into beet mixture; cook and stir until bok choy is tender, about 5 minutes. Add cardamom and bok choy leaves; cook and stir for 1 minute more.\n",
        "picture_link": "L.lamxQgabcxTY1rfdCXEq8eQU5ArFy"
    },
    {
        "title": "Baked Spoon Bread",
        "ingredients": [
            "2 1/2 cups light cream ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup cornmeal ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 pinch ground white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Butter a casserole or souffle dish.\nCombine cream, butter, sugar, honey, and salt in a saucepan over low heat; cook and stir until butter melts, 2 to 3 minutes. Slowly stir cornmeal into cream mixture until thickened but not boiling, 3 to 5 minutes. Pour cornmeal mixture into a large bowl.\nBeat egg yolks, 1 at a time, into cornmeal mixture, ensuring egg yolk is fully incorporated before adding the next. Stir baking powder and white pepper into cornmeal-egg yolk mixture.\nBeat egg whites in a glass or metal bowl until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks. Fold egg whites into cornmeal-egg yolk mixture; pour into the prepared dish.\nBake in the preheated oven until golden and puffed, about 35 minutes.\n",
        "picture_link": "m/7uaFhqm/sJhHcIeEFC4muDVWVnBhq"
    },
    {
        "title": "Easy Chicken or Beef Marinade",
        "ingredients": [
            "1 (16 ounce) bottle fat-free Italian salad dressing ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk salad dressing, soy sauce, ground ginger, garlic powder, salt, and pepper together in a bowl.\n",
        "picture_link": ".whj1CzW0mAmb0fH5lW1TJpkoG.t74."
    },
    {
        "title": "Beef and Potato Pie",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "2 pounds beef sirloin, cut into cubes ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "2 cups beef stock ADVERTISEMENT",
            "2 large potatoes, peeled and cubed ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "1 (8 ounce) can tomato paste ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "2 10-inch pie crusts, rolled out to fit a 9x13-inch baking dish ADVERTISEMENT",
            "2 tablespoons milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a baking sheet on rack in the lower third of the oven. Preheat oven to 400 degrees F (200 degrees C).\nHeat oil and butter together in a large saucepan over medium heat; cook and stir onion until softened, about 10 minutes. Add beef; cook and stir until browned on all sides, about 5 minutes. Add garlic; cook and stir until fragrant, about 1 minute.\nStir flour, pepper, and salt into beef mixture; cook and stir until beef is coated, 2 to 3 minutes. Add wine; bring to boil, reduce heat, and simmer, 3 to 5 minutes.\nMix beef stock, potatoes, carrots, tomato paste, and Worcestershire sauce into beef mixture; bring to a boil. Reduce heat and simmer until vegetables are tender, 30 minutes to 1 hour. Remove from heat and cool.\nLine a 9x13-inch baking dish with 1 pie crust. Spoon beef and potato filling into crust; top with remaining pie crust, crimping the 2 crusts together around the edges using a fork or your fingers. Brush top crust with milk.\nPlace baking dish on the baking sheet in the oven and cook until crust is golden brown, 40 to 45 minutes.\n",
        "picture_link": "eBdR/eaxAz8O4A6Xdw3Bjg48nLgrJtK"
    },
    {
        "title": "Savory Sweet Potato Pie",
        "ingredients": [
            "Rosemary Crust: ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon roughly chopped fresh rosemary ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "10 tablespoons cold butter, cut into cubes ADVERTISEMENT",
            "1/3 cup ice water ADVERTISEMENT",
            "Sweet Potato-Parmesan Filling: ADVERTISEMENT",
            "2 pounds sweet potatoes ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon olive oil, or to taste ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse flour, rosemary, salt, and pepper together in a food processor until evenly mixed; add cold butter and pulse until mixture resembles coarse crumbs. Drizzle cold water into mixture and pulse until dough comes together. Transfer dough to a bowl and refrigerate, 1 hour to 2 days.\nPlace sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 50 minutes. Drain and run cold water over sweet potatoes; carefully remove peels.\nStir milk and olive oil together in a bowl.\nBeat sweet potato and softened butter together in a bowl using an electric mixer until smooth. Stir milk-olive oil mixture, eggs, Parmesan cheese, and garlic into sweet potato mixture until smooth; season with salt and pepper.\nPreheat oven to 350 degrees F (175 degrees C).\nRoll dough on a floured surface using a rolling pin. Roll dough around rolling pin and press in a pie dish, trimming edges. Pour sweet potato filling into crust.\nBake in the preheated oven until a knife inserted in the middle of the filling comes out clean, 55 to 60 minutes. Cool pie about 5 minutes before serving.\n",
        "picture_link": "aciyrFEBcTZr89GgqzMUZIV0OAe1zqi"
    },
    {
        "title": "Brussels Sprouts and Apricot Saute",
        "ingredients": [
            "1/2 teaspoon butter ADVERTISEMENT",
            "3 Brussels sprouts, trimmed, halved lengthwise, and thinly sliced ADVERTISEMENT",
            "2 1/2 teaspoons chopped dried apricots ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "3/4 teaspoon maple syrup ADVERTISEMENT",
            "1 teaspoon lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium-high heat. Add sprouts and apricots to the skillet. Drizzle water over the sprouts mixture. Pour syrup over the the mixture. Saute sprouts mixture until sprouts are wilted, 5 to 10 minutes.\nStir lime juice into sprouts mixture just before removing from heat.\n",
        "picture_link": "mrw.mGaZGaedPTTYLYm9U3lzoQSkEYi"
    }
]