[
    {
        "title": "Blackberry Grunt",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup chilled butter, cut into small pieces ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 tablespoon all-purpose flour for dusting ADVERTISEMENT",
            "6 cups blackberries ADVERTISEMENT",
            "1 1/4 cups raw sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon raw sugar, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place a piece of aluminum foil on the bottom rack of the oven to catch any drippings.\nMix 1 cup all-purpose flour, whole wheat flour, baking powder, salt, and baking soda together in a large bowl. Work 1/4 cup butter into flour mixture using your hands until about half the butter has been incorporated and the rest is in pea-sized pieces.\nMake a well in the center of the flour-butter mixture; add buttermilk to the well. Stir with a rubber spatula or wooden spoon until dough just comes together.\nLightly dust a piece of parchment paper with 1 tablespoon all-purpose flour.\nTurn dough onto the prepared parchment paper. Shape dough into a ball; wrap parchment paper around dough. Store in refrigerator while preparing the blackberry filling.\nMix blackberries, 1 1/4 cup sugar, and water together in a large bowl.\nMelt 2 tablespoons butter in a 10-inch cast iron skillet over medium heat. Pour blackberry mixture into the melted butter and bring to a simmer. Decrease heat to medium-low; cook and stir until liquid has reduced and is thick enough to coat the back of a spoon, about 15 minutes.\nGently drop large spoonfuls of dough evenly into the blackberry mixture; sprinkle with 1 tablespoon sugar.\nBake in the preheated oven until lightly browned, 15 to 20 minutes. Remove from oven and allow grunt to cool for 15 to 30 minutes before serving.\n",
        "picture_link": "HSBs2B/7mMtRvF9.O9LuaX7.raTQa4W"
    },
    {
        "title": "Cinnamon Acai Smoothie with Truvia® Natural Sweetener",
        "ingredients": [
            "24 ounces acai juice ADVERTISEMENT",
            "3 tablespoons cocoa powder ADVERTISEMENT",
            "1/4 cup Truvia® natural sweetener spoonable* ADVERTISEMENT",
            "1/2 cup pasteurized liquid egg whites ADVERTISEMENT",
            "2 cups fresh seasonal berries (strawberries, blueberries, whatever you like) ADVERTISEMENT",
            "2 tablespoons cinnamon ADVERTISEMENT",
            "2 teaspoons turmeric ADVERTISEMENT",
            "1 cup apple cider ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix all ingredients in a blender. Serve chilled..\n",
        "picture_link": "NYkqgmOZotopSj5SMS.LNK0.nQ2ywmi"
    },
    {
        "title": "Cinnamon Scented Stuffed Sweet Potatoes",
        "ingredients": [
            "6 medium sweet potatoes ADVERTISEMENT",
            "1 cup Dannon Oikos Plain Greek Nonfat Yogurt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "Kosher salt and cracked pepper to taste ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven 400 degrees F.\nScrub sweet potatoes and then oven roast, skin on for 40-45 minutes or until soft to the touch. Cool slightly. Gently cut the top third off the sweet potatoes and scoop filing into a bowl. Reserve skins if using.\nMash potatoes with a fork. Add yogurt and spices and mix well. Spoon filling back into the skins or into 6 lightly buttered ramekins. Sprinkle each with 1 tsp. brown sugar.\nSet to bake for 15-18 minutes or until heated through.\n",
        "picture_link": "2SfgHIaE4N0Worpq1bK2SIZpMIOcEne"
    },
    {
        "title": "Hot Salmon Salad with Maille® Honey Dijon Mustard",
        "ingredients": [
            "1 (12 ounce) salmon fillet ADVERTISEMENT",
            "1 cup green beans, tails trimmed ADVERTISEMENT",
            "1/4 cup slivered almonds ADVERTISEMENT",
            "1 cup arugula greens ADVERTISEMENT",
            "1 tablespoon white peppercorns ADVERTISEMENT",
            "For the dressing: ADVERTISEMENT",
            "1 teaspoon Maille® Honey Dijon Mustard, or more to taste ADVERTISEMENT",
            "1/2 lemon, juiced and zested ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "Sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently poach salmon in lightly salted water. Drain and reserve. At the same time, cook beans in lightly salted boiling water until just tender. Drain and reserve with salmon, keeping both warm. Lightly toast almonds in a dry non-stick pan and reserve.\nPeel skin from salmon, carefully flake flesh into large pieces and place in a bowl with arugula and cooked green beans. Grind peppercorns coarsely. Mix dressing ingredients together and pour over salad. Toss lightly. Transfer to serving bowls or plates. Top with toasted almonds and white pepper.\n",
        "picture_link": "rP2TVDUvWYzz4nlT2VBU9xVYlxlZqju"
    },
    {
        "title": "Glazed Turkey with Maille® Honey Dijon Mustard",
        "ingredients": [
            "Stuffing: ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 slices lightly smoked bacon, rinded and chopped ADVERTISEMENT",
            "1 onion, peeled and finely chopped ADVERTISEMENT",
            "6 tablespoons fresh white breadcrumbs ADVERTISEMENT",
            "8 dried apricots, snipped ADVERTISEMENT",
            "1 tablespoon finely chopped fresh parsley ADVERTISEMENT",
            "Salt and freshly ground black pepper ADVERTISEMENT",
            "Turkey: ADVERTISEMENT",
            "1 lemon cut into quarters ADVERTISEMENT",
            "1 onion cut into quarters ADVERTISEMENT",
            "1 (10 pound) turkey ADVERTISEMENT",
            "3 tablespoons Maille® Honey Dijon mustard ADVERTISEMENT",
            "Vegetables: ADVERTISEMENT",
            "8 baby beets, trimmed ADVERTISEMENT",
            "1 butternut squash peeled, seeded and chunked ADVERTISEMENT",
            "8 baby red onions, peeled and trimmed ADVERTISEMENT",
            "8 baby turnips, trimmed ADVERTISEMENT",
            "2 celery hearts, quartered ADVERTISEMENT",
            "16 baby zucchini, trimmed ADVERTISEMENT",
            "Olive oil for drizzling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "First make the stuffing. Heat 1 tablespoon oil in a pan and fry bacon. Add remaining oil to pan and gently fry onion over low heat to soften, but not brown. Place breadcrumbs in a bowl and add bacon and onion, apricots and parsley. Season well.\nUsing pastry brush, paint Maille(R) Honey Dijon mustard over turkey. Place lemon and onion in turkey cavity and season. Spoon stuffing into neck end, pressing in tightly. Secure neck flap underneath. Lightly cover with foil. Place in a pre-heated oven at 350 degrees F and roast for 3 1/2 hours, basting every hour and replacing foil. Test for thorough cooking by piercing the thick part of the thigh with a skewer. The juices should run clear with no pink tinge.\nPlace vegetables in a roasting tin, drizzle with olive oil and season. Place in oven 35 minutes before the end of roasting time. Turn occasionally.\n",
        "picture_link": "azjW/37BrlU5bTumylhGgY2I1SOsTgy"
    },
    {
        "title": "Mom G's Cranberry Jell-O® Salad",
        "ingredients": [
            "2 (3 ounce) packages lemon-flavored gelatin mix (such as Jell-O®) ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "2 cups cold water ADVERTISEMENT",
            "1 (12 ounce) package fresh cranberries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup crushed pineapple, drained ADVERTISEMENT",
            "3/4 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve lemon gelatin in boiling water in a bowl; stir in cold water. Chill in refrigerator until partially thickened, 30 to 40 minutes.\nChop cranberries in a food processor and mix sugar into cranberries, pulsing once or twice to combine. Let cranberry mixture stand a few minutes to let sugar dissolve. Stir cranberry mixture, pineapple, celery, and walnuts into gelatin. Pour into a gelatin mold or serving dish. Refrigerate until fully set, about 4 hours.\n",
        "picture_link": "vQk8/InQwt/rsYyLm9rpLm4mX7GLJwu"
    },
    {
        "title": "Holiday OREO Bark",
        "ingredients": [
            "8 ounces semi-sweet baking chocolate, melted ADVERTISEMENT",
            "9 ounces white chocolate, melted ADVERTISEMENT",
            "12 Winter OREO Cookies, roughly chopped ADVERTISEMENT",
            "3 candy canes, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover large baking sheet with foil. Spread semi-sweet chocolate in a thin layer onto pan. Refrigerate 10 minutes.\nSpread white chocolate in a thin layer over semi-sweet chocolate. Sprinkle with remaining ingredients. Refrigerate 4 hours or until firm.\nBreak into pieces or cut with cookie cutters to make Holiday OREO Bark Christmas Trees (see Tip). Store in tightly covered container.\n",
        "picture_link": "9e5xERVoQc.D9YKRNGgq4g5fgerO6Ba"
    },
    {
        "title": "Creamy Jalapeno Ranch Dip",
        "ingredients": [
            "1 cup buttermilk ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "1/2 cup reduced-fat mayonnaise ADVERTISEMENT",
            "1/3 cup seeded and chopped jalapeno pepper ADVERTISEMENT",
            "1/3 cup chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "lime, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend buttermilk, green chilies, mayonnaise, jalapeno pepper, cilantro, garlic, ranch dressing mix, and lime juice in a food processor or blender until mostly smooth.\n",
        "picture_link": "q0CJzoLKnI/FegeU0O4xGmAx9boCJ0G"
    },
    {
        "title": "Orange Pumpkin Gelatin",
        "ingredients": [
            "1 cup boiling water ADVERTISEMENT",
            "1 (3 ounce) package orange-flavored Jell-O® ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 cups pumpkin puree ADVERTISEMENT",
            "2/3 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together 1 cup boiling water and gelatin in a bowl. Whisk in the brown sugar and cinnamon until the brown sugar is dissolved. Add the pumpkin puree and cold water; stir until mixture is smooth. Cover and chill in refrigerator until set, about 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nene's Jalapeno Hot Fries",
        "ingredients": [
            "1 1/2 cups vegetable oil for frying ADVERTISEMENT",
            "2 tablespoons hot jalapeno chili oil ADVERTISEMENT",
            "2 large potatoes, cut into wedges ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "1 fresh jalapeno chile pepper, finely chopped ADVERTISEMENT",
            "1 1/2 teaspoons spicy seasoned salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1/4 cup jalapeno hot sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil and jalapeno oil in a large, deep skillet over medium-high heat. Place potato wedges in the skillet, and cook 10 minutes, stirring occasionally.\nPlace garlic, onion, jalapeno chile pepper, spicy seasoned salt, and black pepper in the skillet. Reduce heat to medium, and carefully pour in the jalapeno hot sauce. Continue cooking 5 minutes, stirring occasionally, until potato wedges are golden brown. Drain on paper towels.\n",
        "picture_link": "6QLMnrvnG9l3VJ3AxfnhAPxUbb9CEba"
    },
    {
        "title": "Nugget Pudding III",
        "ingredients": [
            "1 cup wheat and barley nugget cereal (e.g. Grape-Nuts™) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine cereal, salt, sugar and milk in top of double boiler, over, not in, simmering water. Simmer for 30 minutes, then remove from heat and stir in eggs and vanilla. Pour into 1 quart baking dish.\nLine a roasting pan with a damp kitchen towel. Place baking dish on towel, inside roasting pan, and place roasting pan on oven rack. Fill roasting pan with boiling water to reach halfway up the sides of the baking dish. Bake 30 minutes, until knife inserted in center comes out clean.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rava Laddu",
        "ingredients": [
            "6 cups semolina flour ADVERTISEMENT",
            "7 cups white sugar ADVERTISEMENT",
            "1 1/2 tablespoons ground cardamom ADVERTISEMENT",
            "1/2 cup ghee (clarified butter) ADVERTISEMENT",
            "1/3 cup cashew nuts ADVERTISEMENT",
            "1 cup hot milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large dry skillet over medium to medium-high heat. Add the semolina, and toast, stirring constantly. Stir in the sugar and cardamom while toasting until light brown and fragrant, about 10 minutes.\nHeat a small amount of the ghee in a separate skillet over medium heat. Add the cashews, and cook until lightly toasted, about 10 minutes. Add the cashews to the semolina along with the remaining ghee. Gradually stir hot milk into the semolina until it is thick enough to pack into a ball. Remove from heat, and form palm-sized balls. Let cool and serve.\n",
        "picture_link": ".0eWHCMwsaqEWfT4LFOeb0sZGJFE7gO"
    },
    {
        "title": "Mushroom Bagna Cauda",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 (2 ounce) can anchovy fillets, drained ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "1 (10 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup whipping cream ADVERTISEMENT",
            "2 cups half and half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saute pan over medium heat. Saute garlic and anchovies until the garlic has mellowed, about 2 to 3 minutes. Pour in the mushroom soup, cream, and half and half; turn heat to low and cook for 45 minutes, making sure the mixture does not boil.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "S'mores Nachos",
        "ingredients": [
            "6 ounces Cinnamon Graham Crackers ADVERTISEMENT",
            "5 Mission® Soft Taco Size Flour Tortillas ADVERTISEMENT",
            "1/2 cup Butter, melted ADVERTISEMENT",
            "1 (10 ounce) jar Chocolate sauce ADVERTISEMENT",
            "1 1/2 cups Miniature Marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Using a food processor, process the graham crackers into fine crumbs. Cut each tortilla into 8 equal size wedges. Dip wedges into melted butter and then into cracker crumbs.\nSpread out tortillas onto a baking sheet and bake for 5 minutes. Turn chips over and bake for another 5 minutes or until golden.\nPile chips onto an oven safe platter, drizzle with chocolate sauce and sprinkle with marshmallows.\n(Optional) Return platter to the oven until marshmallows are lightly browned.\n",
        "picture_link": "Q.tKf08OG.CM3/pJpIiUiA5W2XzxHiq"
    },
    {
        "title": "Fraisier",
        "ingredients": [
            "3 cups raspberries ADVERTISEMENT",
            "1 3/4 cups white sugar, divided ADVERTISEMENT",
            "6 egg whites ADVERTISEMENT",
            "11 egg yolks, divided ADVERTISEMENT",
            "1 1/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 quart fresh strawberries, rinsed and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In medium saucepan, cook raspberries and 1 1/4 cups of sugar over medium heat, stirring occasionally. Mixture will boil and then thicken. When thick, remove from heat and put over ice to cool.\nPreheat oven to 400 degrees F (200 degrees C). While berries are cooking, beat egg whites in large mixing bowl with electric mixer until fluffy. Beat in remaining 1/4 cup sugar. Beat in 8 egg yolks and flour, until smooth. Pour mixture into pastry bag and pipe two spiral cakes, slightly smaller than 9 inches, onto baking sheets. Bake 5 to 7 minutes, or until set and golden. Cool.\nIn a large mixing bowl, beat together butter, egg and remaining 3 egg yolks. Add the cooled raspberries and mix thoroughly. Place a 9 inch cake ring or spring form pan on a serving platter. Line the inside of the ring with sliced strawberries. Frost the sides of one of the spiral cakes with raspberry cream, and place it in the ring. Spread more cream on top, and add a layer of strawberries. Repeat with the next layer. Use a kitchen torch to loosen cake ring, or simply remove spring form ring. Serve.\n",
        "picture_link": "XUj.tGxc/J9fRHjIckSeUsXuD57N8ke"
    },
    {
        "title": "Banana Split Cake VI",
        "ingredients": [
            "2 cups cornflakes cereal crumbs ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 cup margarine ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "6 banana ADVERTISEMENT",
            "2 (15 ounce) cans crushed pineapple, drained ADVERTISEMENT",
            "1 (16 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1/2 cup margarine with cornflake crumbs, then press into the bottom of a 13x9 inch pan. Chill in the refrigerator for 30 minutes.\nMix together eggs, vanilla extract, 1 cup margarine and confectioners' sugar until smooth. Pour mixture over the chilled cornflake crust. Slice bananas lengthwise and place over the egg mixture. Spoon pineapple over the bananas, then spread whipped topping over the top to cover. Sprinkle with chopped nuts. Refrigerate overnight before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Smoked Mullet Spread",
        "ingredients": [
            "1 whole large smoked mullet ADVERTISEMENT",
            "2 (12 ounce) containers whipped cream cheese, softened ADVERTISEMENT",
            "1 (5 ounce) bottle sweet hot sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pick the meat off of bones, discard any dark meat (it has a nasty flavor), and make sure you chop the meat up fine afterwards.\nIn a small mixing bowl combine the meat, cream cheese and hot sauce. Mash the mixture well. Refrigerate overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Campagnard Sauce",
        "ingredients": [
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup goat cheese ADVERTISEMENT",
            "1 celery stalk, minced ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, stir together garlic, goat cheese, celery, balsamic vinegar, and olive oil. Season to taste with salt and pepper. Blend well until the sauce is smooth. Cover, and refrigerate. Serve chilled.\n",
        "picture_link": "2yleihRqkNTr.gINFVEMfu/kUNf66PG"
    },
    {
        "title": "Snail Pale",
        "ingredients": [
            "3 gallons water ADVERTISEMENT",
            "8 ounces crystal malt 60L in a grain bag ADVERTISEMENT",
            "1/2 gallon water ADVERTISEMENT",
            "8 pounds liquid malt extract ADVERTISEMENT",
            "3 ounces Perle hops ADVERTISEMENT",
            "2 ounces Willamette hops ADVERTISEMENT",
            "1 teaspoon Irish moss (carrageen) ADVERTISEMENT",
            "1 (.25 ounce) envelope instant ale yeast ADVERTISEMENT",
            "1 1/2 gallons water ADVERTISEMENT",
            "4 ounces corn sugar (dextrose) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 3 gallons of water into a large stainless steel pot. Heat to 150 degrees F (65 degrees C). This works best using an outdoor propane burner from a turkey fryer, but you can also use your stove. When the water reaches temperature, place the crystal malt in its nylon bag into the water. Steep for 30 minutes, maintaining the same temperature.\nAfter the 30 minutes are up, remove the bag from the water and place in a separate pot to drain. Rinse the crystal malt with about a half gallon of water that is at least 150 degrees F (65 degrees C). Pour the water from the grain bag into the main pot and bring to a boil. As soon as the water is boiling, remove from the heat and stir in the malt extract. You do not want to do this over the heat because the malt extract will settle to the bottom and possibly burn.\nReturn the pot to the heat and bring to a boil once again. Add the Perle hops and stir. Set a timer for 30 minutes. This is now wort. Continue to stir occasionally and watch for boil overs. After 45 minutes, add the Willamette hops and Irish moss to the pot and continue to boil until the timer goes off.\nAbout the same time as you add the Irish moss and final hops, prepare an ice bath by filling a sink, large tub or cooler with ice. When the time is up, remove the pot from the heat, cover and place in the ice bath. Be careful not to drop anything into the pot that is not sterilized, including spoons. Cool your wort to 80 degrees F (25 degrees C). You can swirl around the ice bath to help it cool.\nMeanwhile, sprinkle the yeast over 1 cup of warm water (80 degrees F) and let it stand until ready to use. This will help to keep from shocking your yeast and ensure a faster start of the fermentation.\nPour the wort into a sterile fermenter (carbuoy) and add the yeast. Add enough bottled or boiled and cooled water to reach the 5 gallon mark, about 1 1/2 more gallons. Seal with a cap and shake or rotate to mix in the yeast. Replace the cap on the fermenter with an airlock and place in a cool dry place where the temperature remains consistently below 70 degrees F (21 degrees C). Ferment for 5 days or until it stops foaming.\nUse a siphon hose to transfer the beer to a secondary fermenter. Cap with the airlock and ferment for 1 to 4 weeks, until the specific gravity has dropped to 1.005 when tested using a hydrometer.\nSterilize your bottles for bottling. Pour the beer into a new bucket and stir in the corn sugar until dissolved. Siphon into bottles and cap. Let the beer prime in the bottle for at least 7 days in a place where the temperature stays below 70 degrees F (21 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Williamsburg Pork Cake",
        "ingredients": [
            "1/2 cup brandy ADVERTISEMENT",
            "2 1/2 cups raisins ADVERTISEMENT",
            "1 1/2 cups dried currants ADVERTISEMENT",
            "1/2 pound finely ground salt pork ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 cup molasses ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 tablespoon ground allspice ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, combine brandy, raisins and currants. Bring to an boil, then remove from heat. Set aside until all liquid is absorbed and mixture is cooled.\nPreheat oven to 275 degrees F (135 degrees C). Grease and flour a 10 inch tube pan. Sift together the flour, baking powder, allspice, cinnamon, nutmeg and cloves. Set aside.\nIn a large bowl, combine the ground salt pork, boiling water, molasses and sugar. Beat well. Add the flour mixture and beat until incorporated. Stir in the raisin mixture. Pour batter into prepared pan.\nBake in the preheated oven for 90 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool 15 minutes in the pan. Remove from pan and cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spicy Raspberry Jelly Dip",
        "ingredients": [
            "1 jalapeno pepper, seeded and diced ADVERTISEMENT",
            "1/2 red chile pepper, seeded and chopped ADVERTISEMENT",
            "2 cups raspberry preserves ADVERTISEMENT",
            "1 cup raspberry syrup ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the container of a food processor or blender, combine the jalapeno pepper and red chile pepper. Pulse until finely chopped. Transfer to a serving dish, and mix in the raspberry preserves, raspberry syrup and apple cider vinegar. Taste, and adjust amounts to suit your palate.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cabernet Sauvignon Reduction",
        "ingredients": [
            "1 (750 milliliter) bottle dry Cabernet Sauvignon ADVERTISEMENT",
            "1/4 cup ruby port wine ADVERTISEMENT",
            "2 cups beef consomme ADVERTISEMENT",
            "2 tablespoons beef bouillon ADVERTISEMENT",
            "3 tablespoons corn syrup ADVERTISEMENT",
            "white wine vinegar ADVERTISEMENT",
            "1 pinch salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot or saucepan, combine the Cabernet and port wines. Bring to a boil and simmer for 5 minutes. Stir in the beef consomme. Simmer for another 20 minutes. Stir in the beef bouillon and corn syrup. Simmer, stirring occasionally, until the sauce has reduced to about 1 cup. Stir in the vinegar and simmer for 2 more minutes.\n",
        "picture_link": "BruH00zu562QWnCIXNlopKEMFiPrd/C"
    },
    {
        "title": "Martha Washington Pie",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup golden raisins ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2 (9 inch) unbaked pie crusts ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nTo Make Filling: Mix butter, sugar, eggs, vanilla, cocoa and baking powder together until smooth; alternately mix in the milk and flour. Stir in raisins and walnuts.\nPour mixture into pastry shells and bake at 375 degrees F (190 degrees C) for 60 to 70 minutes. Do not underbake.\nTo Make Icing: Combine confectioners' sugar and vanilla. Gradually stir in milk until desired consistency is reached.\nSpread icing on pie once its out of the oven and still warm.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fried Irish Soda Farls",
        "ingredients": [
            "1 prepared soda bread farl ADVERTISEMENT",
            "1 tablespoon olive oil for frying ADVERTISEMENT",
            "1 pinch salt, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Split the soda farl in half horizontally.\nHeat oil in skillet over medium high heat. Gently fry soda bread for 2 to 3 minutes on each side or until crisp and golden brown. Serve hot, seasoned lightly with salt.\n",
        "picture_link": "ZI/9tSbBxQP9aZmZbLjwvCYtZyUFTMe"
    },
    {
        "title": "Frank the Tank's Red Dragon Ale",
        "ingredients": [
            "3 gallons water ADVERTISEMENT",
            "8 ounces crystal malt ADVERTISEMENT",
            "4 ounces roasted barley ADVERTISEMENT",
            "7 pounds pale liquid malt extract ADVERTISEMENT",
            "1 ounce Fuggles hops ADVERTISEMENT",
            "1/2 ounce Fuggles hops ADVERTISEMENT",
            "1/2 ounce East Kent Goldings hops ADVERTISEMENT",
            "1/4 teaspoon Irish moss (carrageen) ADVERTISEMENT",
            "2 gallons cold water ADVERTISEMENT",
            "1 (.4 ounce) packet Irish ale yeast ADVERTISEMENT",
            "3/4 cup corn sugar (dextrose) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, warm 3 gallons of water to 150 degrees F (65 degrees C). Place the roasted barley and crystal malt in a nylon bag and steep in the water at that temperature for 30 minutes.\nRemove grains and discard. Bring the water to a boil, then turn off the heat and stir in the pale liquid malt extract. Return to a boil, add 1 ounce of the Fuggles and set a timer for 30 minutes. When the 30 minutes is up, add the remaining fuggles and set the timer for 15 minutes. When that time is up, stir in the East Kent Goldings hops and Irish moss. Let stand for 15 minutes, then cover, remove from the heat and set in an ice bath, being sure to maintain the sterility inside the pot.\nPour two gallons of cold sterile water into a sanitized carbuoy. Place a large funnel over the top and fit with a sterile sieve to strain out the hops. Pour the wort you have made into the carbuoy. If the temperature is below 80 degrees F (44 degrees C), then stir in the yeast. Seal the carbuoy with a fementation lock. Ferment for 7 days.\nAfter 7 days, siphon the mixture into a secondary fermenter (another sterile carbuoy) using a sterile piece of tubing. Seal with a fermentation lock and ferment for another 14 days.\nPour the beer into a large bucket and stir in corn sugar until dissolved. Siphon into sterilized bottles and cap. Store for at least 3 weeks to condition. Imbibe.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roast Suckling Pig",
        "ingredients": [
            "1 (12 pound) dressed suckling pig ADVERTISEMENT",
            "1/2 cup butter, sliced ADVERTISEMENT",
            "8 ounces sliced bacon ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon blackened seasoning ADVERTISEMENT",
            "2 cups apple cider ADVERTISEMENT",
            "12 cloves garlic, peeled ADVERTISEMENT",
            "1 red apple, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nRinse the pig, and tie the front legs together with heavy string. Tie the back legs together also. Make numerous slits in the skin, and insert slices of butter, followed by cloves of garlic. Generously rub the entire pig with salt first, then the Cajun seasoning, including inside the cavity. Lay strips of bacon across the back and secure to the sides with toothpicks.\nPlace the pig in a large roasting pan and pour in the apple cider. Cover the ears and snout of the pig with aluminum foil to prevent scorching.\nRoast for 7 hours in the preheated oven, basting every hour or so with the drippings. If the pan begins to dry out, add more cider or water. To serve, remove to a platter, and place the apple in the pig's mouth. Discard the aluminum foil from ears and snout.\n",
        "picture_link": "2YapdxyyWv7RRmM1INYng9v284vgcoG"
    },
    {
        "title": "Kai's Crown Pork Ribs",
        "ingredients": [
            "3 pounds baby back pork ribs ADVERTISEMENT",
            "1 (7.2 ounce) package butter and herb rice mix ADVERTISEMENT",
            "1/2 large green bell pepper, seeded and diced ADVERTISEMENT",
            "5 cloves garlic, crushed ADVERTISEMENT",
            "2 tablespoons dried sage ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 tablespoons dry mustard powder ADVERTISEMENT",
            "2 tablespoons Cajun seasoning ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/4 cup fresh orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Prepare the rice mix according to package directions, but adding bell pepper and garlic at the end. Set aside.\nIn a small bowl, mix together the sage, oregano, mustard powder and Cajun seasoning. Rub onto both sides of the ribs. Mix together the honey and orange juice in a separate bowl. Brush half of the sauce onto the meaty side of the ribs.\nSet the ribs in a roasting pan so they are standing in a ring with the meaty side facing outward. Secure with kitchen twine. Spoon the rice mixture into the center.\nRoast the ribs for 40 minutes in the preheated oven, basting with the remaining glaze halfway through. Rib meat should reach 160 degrees F (70 degrees C) when a meat thermometer is inserted in the thickest part. Cool for at least 5 minutes before slicing into rib portions and serving with rice on the side.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Patholi",
        "ingredients": [
            "1 cup split Bengal gram (chana dal) ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "3 green chile peppers ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup cooking oil ADVERTISEMENT",
            "1 teaspoon skinned split black lentils (urad dal) ADVERTISEMENT",
            "1 teaspoon mustard seeds ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "4 dried red chile peppers, broken into pieces ADVERTISEMENT",
            "2 sprigs fresh curry leaves ADVERTISEMENT",
            "1 pinch asafoetida powder ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cups chopped fresh cilantro ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chana dal into a large container and cover with several inches of cool water; let soak 4 to 6 hours. Drain and rinse.\nCombine the chana dal, green chile peppers, and salt in a large bowl; mash into a thick and coarse paste. Add water as needed to help mash, but use as little as possible.\nHeat the oil in a large non-stick skillet. Cook the urad dal, mustard seeds, cumin seeds, dried red chile peppers, curry leaves, and asafoetida powder in the hot oil until the seeds begin to splutter, 2 to 3 minutes. Add the onion and cook until golden brown, about 5 minutes. Stir the chana dal paste into the mixture; cook and stir until the dal is cooked through and tender, about 20 minutes. Sprinkle the cilantro and cayenne pepper over the mixture and stir. Cook another 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nimakayya (Lemon) Pulihora",
        "ingredients": [
            "1/4 cup oil ADVERTISEMENT",
            "1/2 cup peanuts ADVERTISEMENT",
            "2 tablespoons split Bengal gram (chana dal) ADVERTISEMENT",
            "3 tablespoons skinned split black lentils (urad dal) ADVERTISEMENT",
            "3 dried red chile peppers ADVERTISEMENT",
            "1/4 cup raw cashews (optional) ADVERTISEMENT",
            "1 tablespoon mustard seed ADVERTISEMENT",
            "2 sprigs fresh curry leaves ADVERTISEMENT",
            "5 green chile peppers, halved lengthwise ADVERTISEMENT",
            "2 teaspoons ground turmeric ADVERTISEMENT",
            "2 lemons, juiced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 cups cold, cooked basmati rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet. Add, in order, the peanuts, chana dal, urad dal, red chile peppers, cashews, mustard seed, curry leaves, green chile peppers, and turmeric to the hot oil in 30 second intervals, allowing each item to cook briefly before adding the next. Stir the lemon juice and salt into the mixture. Mix the rice into the mixture, breaking up the individual grains with a wooden spoon; cook and stir until no clumps of rice remain and the mixture is thoroughly heated. Serve hot.\n",
        "picture_link": "iP3cTAULZF6efHagSWLxpHYhprdkZCS"
    },
    {
        "title": "Sunset Cooler",
        "ingredients": [
            "1 cup sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 pandan leaves ADVERTISEMENT",
            "1 fresh pineapple - peeled, cored and chopped ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "3 whole cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make the Basic Syrup: Place sugar, 1 cup water and pandan leaves in a deep saucepan. Bring to a boil, lower heat and simmer until sugar is dissolved. Remove pandan leaves and strain the syrup. Allow to cool for use as a basic syrup. Store the syrup in a bottle in the refrigerator.\nTo Make the Cooler: In a blender or food processor, puree the pineapple chunks. Strain and reserve the juice.\nIn a deep saucepan, combine the pineapple pulp, 1 1/2 cups water, cinnamon stick and cloves. Bring to a boil, then reduce heat and simmer for 20 minutes. Remove from heat, strain and discard pulp and spices. Allow the reserved liquid to cool.\nIn a pitcher, combine spiced pineapple syrup and reserved pineapple juice. Stir in enough cooled Basic Syrup to sweeten to your taste. Chill in refrigerator.\nTo serve, pour into glasses full of crushed ice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quite a Peachy Pour",
        "ingredients": [
            "4 cups ice ADVERTISEMENT",
            "1 cup peach schnapps ADVERTISEMENT",
            "2 (6 ounce) cans frozen peach juice concentrate ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine ice, peach schnapps, peach juice concentrate and vanilla. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Annam-Kobbari Parvanam (Rice and Coconut Kheer)",
        "ingredients": [
            "1/3 cup rice ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1/2 cup fresh grated coconut ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup jaggery (palm sugar) ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1 tablespoon ghee ADVERTISEMENT",
            "2 tablespoons cashews ADVERTISEMENT",
            "2 tablespoons raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the rice in a bowl and cover with a few inches of cold water; let soak for 1 hour. Drain in a sieve.\nBring the milk to a boil in a heavy-bottomed saucepan; stir the rice, coconut, white sugar, jaggery, and cardamom into the milk. Reduce heat to low and cook until the rice is tender and the mixture is thick and creamy, 30 to 45 minutes.\nHeat the ghee in a small skillet over medium heat. Fry the cashews and raisins in the ghee until the cashews are lightly browned and the raisins plump; stir the mixture into the rice. Eat right away, or better, chill in the refrigerator for a few hours and serve. If the kheer gets too thick, thin it out with some milk.\n",
        "picture_link": "m/O7Z6qSrCtYE3OehXAw1pBLO9XN8/y"
    },
    {
        "title": "Scallop Stir-Fry with Noodles",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound fresh sea scallops ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 1/2 teaspoons butter ADVERTISEMENT",
            "1 teaspoon capers ADVERTISEMENT",
            "1/2 pound broccoli florets ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (3 ounce) package instant ramen noodles (such as Nissin® Top Ramen®), seasoning packet discarded ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil, salt, and black pepper in a skillet over medium heat. Cook scallops in hot oil just until opaque in the center, about 3 minutes.\nCombine chicken broth, wine, and lemon juice in a saucepan. Bring to a boil; cook until reduced by half, about 5 minutes. Add garlic, butter, and capers; simmer until garlic sauce is fragrant, about 2 minutes.\nPour garlic sauce over scallops in the skillet. Add broccoli. Reduce heat to medium-low, cover, and let steam until broccoli softens, about 7 minutes.\nBring 2 cups of water to boil in a saucepan. Add ramen noodles and cook until soft, about 3 minutes. Drain noodles; stir into scallops. Add cornstarch, mixing well to make sure there are no lumps.\nRemove skillet from heat, cover, and let sit until flavors combine, about 2 minutes.\n",
        "picture_link": "Kfz9tyL79gGMpvQZHHA.2zq/Y.AHohS"
    },
    {
        "title": "ORE-IDA Sweet Heat Corn Casserole",
        "ingredients": [
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup BREAKSTONE'S or KNUDSEN Sour Cream ADVERTISEMENT",
            "1/2 cup whole milk ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon chipotle chile pepper powder ADVERTISEMENT",
            "4 1/2 cups ORE-IDA® Shredded Hash Brown Potatoes, thawed ADVERTISEMENT",
            "1 (14.75 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (14.75 ounce) can cream-style corn ADVERTISEMENT",
            "1 cup KRAFT Shredded Sharp Cheddar Cheese ADVERTISEMENT",
            "1/2 cup chopped red bell peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F.\nMix eggs, sour cream, milk, onion powder and chipotle chile powder in large bowl until blended. Add hash brown potatoes, whole kernel corn, cream-style corn, shredded Cheddar cheese, and chopped peppers; mix well.\nSpoon into 13x9-inch pan sprayed with cooking spray.\nBake 40 to 45 min. or until potato mixture is heated through and top is golden brown.\n",
        "picture_link": "mnQqEtaGOVktS5W0IfoyCArF.73KRqG"
    },
    {
        "title": "Doreen's Pork and Sauerkraut ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (2 pound) boneless pork loin roast ADVERTISEMENT",
            "2 (27 ounce) cans sauerkraut (such as Silver Floss®), undrained ADVERTISEMENT",
            "2 McIntosh apples, cored and cut into wedges ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpray a large roasting pan with cooking spray. Place pork roast in the pan and arrange sauerkraut around it. Place apple wedges on top of the sauerkraut. Sprinkle brown sugar over roast and apples. Cover roasting pan with aluminum foil.\nBake roast in the preheated oven until roast is slightly pink in the center, about 2 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nRemove roast from oven and allow to rest in a warm area before slicing, about 10 minutes.\n",
        "picture_link": "Rh4a/CdWK3qI9XhhOvHZ/MQOCMo39kK"
    },
    {
        "title": "Mint Lime Salmon",
        "ingredients": [
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon coconut sugar ADVERTISEMENT",
            "1 1/2 pounds salmon, skin on ADVERTISEMENT",
            "2 tablespoons water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mint, soy sauce, lime juice, ginger, and coconut sugar together in a baking dish until marinade is evenly combined. Place salmon on top of marinade, skin-side up. Marinate in the refrigerator, at least 2 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nBake in the preheated oven for 20 minutes. Add water if sauce is getting dry. Continue baking until skin peels off easily and fish flakes easily with a fork, about 10 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cajun Rainbow Carrot Fries",
        "ingredients": [
            "4 large rainbow carrots, cut into 1/4-inch-thick strips, or more to taste ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 teaspoons coconut sugar ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "1 pinch paprika, or more to taste ADVERTISEMENT",
            "1 pinch garlic powder, or more to taste ADVERTISEMENT",
            "1 pinch onion powder, or more to taste ADVERTISEMENT",
            "1 pinch ground black pepper, or more to taste ADVERTISEMENT",
            "1 pinch dried oregano, or more to taste ADVERTISEMENT",
            "1 pinch dried thyme, or more to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease a baking sheet.\nPlace carrots in a large bowl; add cornstarch and toss, using your hands, until evenly coated. Sprinkle coconut sugar, cayenne pepper, paprika, garlic powder, onion powder, black pepper, oregano, and thyme over carrots. Drizzle olive oil over seasoned carrots and toss to coat. Spread carrots onto the prepared baking sheet.\nBake in the preheated oven for 15 minutes; flip and continue baking until lightly browned and crispy, 10 to 15 minutes more.\n",
        "picture_link": "klbZoYm6bL.cDwssosFxPhrcJdZN7N."
    },
    {
        "title": "Thai-Italian Fusion - Sweet Chile Chicken Pizza",
        "ingredients": [
            "1 (12 inch) pre-baked pizza crust ADVERTISEMENT",
            "1 cup sweet Thai chile sauce ADVERTISEMENT",
            "1 cooked skinless, boneless chicken breast, cubed ADVERTISEMENT",
            "1 (14.25 ounce) can baby corn, halved lengthwise ADVERTISEMENT",
            "1 (8 ounce) can sliced bamboo shoots ADVERTISEMENT",
            "1/2 red bell pepper, cubed ADVERTISEMENT",
            "1 cup shredded mozzarella cheese, or more to taste ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 cup bean sprouts ADVERTISEMENT",
            "1/2 cup fresh cilantro leaves ADVERTISEMENT",
            "1/2 cup diced green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place crust on baking sheet.\nSpread Thai chile sauce over crust; top with chicken, baby corn, bamboo shoots, red bell pepper, and mozzarella cheese. Brush exposed pizza dough with egg yolk.\nBake in preheated oven until cheese is bubbly and crust is shiny golden brown, about 15 minutes. Remove from oven and top with bean sprouts, cilantro, and green onions.\n",
        "picture_link": "f1nwyN7sySmZ/DYUQaSEJsHBpOxWQQm"
    },
    {
        "title": "Mexican Thai Fusion Chicken",
        "ingredients": [
            "1 large dried ancho chile pepper, torn ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons dark brown sugar ADVERTISEMENT",
            "1 tablespoon lemon grass ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1 pound chicken breast, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ancho chile, soy sauce, brown sugar, lemon grass, ground turmeric, and ground allspice together in a large resealable bag; add chicken and shake until coated. Refrigerate and marinate chicken for at least 1 hour.\nTransfer chicken to a skillet and cook over medium heat until no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "4T6IclJiPaz.VAuWw6gACcK672WHiQ2"
    },
    {
        "title": "Grilled Potato Salad with Crazy Steve's Cajun Cukes",
        "ingredients": [
            "1/2 pound bacon, diced ADVERTISEMENT",
            "1 red onion, diced ADVERTISEMENT",
            "2 tablespoons kosher salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon dried rosemary ADVERTISEMENT",
            "1/4 teaspoon ground thyme ADVERTISEMENT",
            "1/4 teaspoon celery seed ADVERTISEMENT",
            "5 pounds small red potatoes ADVERTISEMENT",
            "1 (16 ounce) jar spicy pickles (such as Crazy Steve's™ Cajun Cukes) ADVERTISEMENT",
            "1/2 cup pickle juice (such as juice from Crazy Steve's™ Cajun Cukes) ADVERTISEMENT",
            "5 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir bacon and red onion together in a skillet over medium heat until bacon is crisp, about 10 minutes. Remove skillet from heat and transfer bacon and onion to a plate, reserving drippings in the skillet.\nStir salt, black pepper, paprika, garlic powder, cumin, rosemary, thyme, and celery seed into bacon drippings. Roll potatoes into seasoned bacon drippings until evenly coated.\nPreheat grill for medium heat and lightly oil the grate.\nCook potatoes on grill until golden brown and tender, about 10 to 15 minutes per side. Cool potatoes slightly; cut into bite-size pieces.\nMix pickles, pickle juice, mayonnaise, and Dijon mustard together in a bowl until smooth. Stir bacon, onion, and potatoes into mayonnaise mixture until evenly coated.\n",
        "picture_link": "zow/A7W6RRQ3xUpY8oUimUCK49kc7Ba"
    },
    {
        "title": "Shrimp Stuffed Eggplant",
        "ingredients": [
            "2 large eggplants, halved lengthwise ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 small onion, grated ADVERTISEMENT",
            "1/2 bell pepper, chopped ADVERTISEMENT",
            "1/2 pound raw shrimp, peeled and deveined ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 pound sharp Cheddar cheese, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nScoop the pulp from each eggplant, reserving the shells. Place pulp into a pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 10 minutes. Drain and transfer eggplant to a large bowl.\nHeat olive oil in a skillet over medium heat; cook and stir onion and bell pepper until tender, 5 to 10 minutes. Add shrimp; cook and stir until cooked through and pink, 3 to 5 minutes. Remove skillet from heat.\nMash eggplant thoroughly; add shrimp mixture, tomatoes, butter, and egg and mix well. Stuff eggplant shells with eggplant-shrimp mixture; season with salt and pepper. Top each stuffed eggplant with Cheddar cheese. Place stuffed eggplant in a baking dish.\nBake in the preheated oven until filling is cooked through and cheese is bubbling, 20 to 30 minutes.\n",
        "picture_link": "kaAJ7A.kbPUR4/UJYn4GpDGLKT7dn.K"
    },
    {
        "title": "Mountain Dew® Strawberry Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) package strawberry cake mix ADVERTISEMENT",
            "12 ounces citrus-flavored soda (such as Mountain Dew®) ADVERTISEMENT",
            "2 tablespoons chocolate chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 48 miniature muffin cups.\nCombine strawberry cake mix and citrus-flavored soda in a bowl until batter is smooth; spoon into prepared muffin cups. Place 1 chocolate chip on top of each cupcake.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 15 to 20 minutes.\n",
        "picture_link": "5bzc3zjo.nCEoBu0uahSuiCJjNTGIna"
    },
    {
        "title": "Tropical Fruit Pops",
        "ingredients": [
            "1 cup guava nectar ADVERTISEMENT",
            "1 cup unsweetened pineapple juice ADVERTISEMENT",
            "1 cup fresh pineapple chunks ADVERTISEMENT",
            "1 cup coarsely chopped or sliced fresh fruit (such as strawberries, kiwifruit, papaya and/or melon) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine guava nectar, pineapple juice, and fresh pineapple chunks. Cover and blend until smooth. Divide chopped or sliced fruit among 12 frozen treat molds or 4- to 6-ounce paper cups. Pour blended mixture over the fruit.\nCover each cup with aluminum foil; make a small hole in the aluminum foil with a knife and insert a wooden stick into each cup through the hole. Freeze about 4 hours or until firm. Remove foil and cup to serve.\n",
        "picture_link": "07wc1NTxJaG6hUIJ0zCnl6K441r4gXu"
    },
    {
        "title": "Pan-Grilled Tilapia with Lemon and Red Onion",
        "ingredients": [
            "1/4 large lemon ADVERTISEMENT",
            "1 (6 ounce) tilapia fillet, patted dry ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 teaspoon butter, divided ADVERTISEMENT",
            "1/4 large red onion, coarsely chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 tablespoon grated fresh Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Squeeze lemon juice over tilapia; season lightly with salt and black pepper.\nHeat olive oil in a nonstick skillet over medium heat. Melt 1/2 teaspoon butter in hot oil. Add chopped onion and minced garlic; cook and stir until onion begins to look translucent, about 5 minutes.\nReduce heat to medium-low. Push onion mixture to sides of the skillet. Melt remaining 1/2 teaspoon of butter in the skillet. Place tilapia in the center of the skillet and cover with onion mixture. Cover skillet and cook tilapia until it starts to turn golden, about 5 minutes. Push onion mixture to the sides again and flip tilapia. Cover and cook until second side is golden and flakes easily with a fork, about 5 minutes more.\nRemove skillet from heat. Top tilapia with grated Parmesan cheese, cover, and let stand until cheese is melted, 2 to 3 minutes.\n",
        "picture_link": "W8B0PczQZ4jF.RtXojGKtoO0Zwcg68O"
    },
    {
        "title": "Pecan Caramel Sauce",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir butter and brown sugar together in a saucepan over medium heat until melted. Stir in heavy whipping cream and salt; bring to a boil. Reduce heat to medium and simmer until thickened, about 5 minutes. Remove from heat to cool slightly, 3 to 5 minutes. Stir in chopped pecans.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolaty Beet Muffins",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 cups spelt flour ADVERTISEMENT",
            "1/4 cup dark cocoa powder ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup shredded beets ADVERTISEMENT",
            "3/4 cup applesauce ADVERTISEMENT",
            "1/4 cup oil ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray 12 muffin cups with cooking spray.\nCombine flour, cocoa powder, baking powder, and cinnamon together in a bowl. Stir beets, applesauce, oil, honey, and egg together in a separate bowl; stir into flour mixture just until batter is combined. Spoon batter into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 18 minutes. Remove muffins from tin immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Creamy Coq au Vin Blanc",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "4 bone-in chicken thighs with skin ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (6 ounce) package portobello mushroom caps ADVERTISEMENT",
            "1 tomato, sliced ADVERTISEMENT",
            "2 tablespoons white cooking wine, or to taste ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/4 cup shredded Gruyere cheese ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 cup chopped sweet onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a nonstick pot over medium heat. Add chicken thighs, Italian seasoning, and garlic; cook until chicken is browned on both sides, about 5 minutes per side. Mix mushrooms and tomato into chicken mixture; reduce heat, cover pot, and cook until mushrooms are softened, about 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease a baking dish.\nDrain accumulated juices from chicken-mushroom-tomato mixture into a separate saucepan and transfer chicken-mushroom-tomato mixture to the prepared baking dish.\nPour wine into saucepan with juices and bring to a boil. Add cream and Gruyere cheese; cook and stir until cheese is melted and sauce is smooth, 3 to 4 minutes.\nStir cornstarch and water together in a small bowl until cornstarch is dissolved; mix into cream sauce until smooth and thickened. Pour sauce over chicken-vegetable mixture; top with onion.\nBake in the preheated oven until chicken is no longer pink in the center, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "8BA00Q1tsCWBcC2Qjorj3869N7EgNI."
    },
    {
        "title": "Florida Sunset Blackened Tilapia",
        "ingredients": [
            "1 1/4 tablespoons paprika ADVERTISEMENT",
            "2 teaspoons mango garlic seafood seasoning ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon minced fresh garlic ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "4 tilapia fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix paprika, mango garlic seasoning, cayenne pepper, dried basil, dried thyme, minced garlic, garlic powder, onion powder, and salt together in a bowl.\nBrush a light coating of olive oil on both sides of fillets. Dredge fillets in seasoning mixture.\nHeat remaining olive oil in an electric skillet to 250 degrees F (120 degrees C). Cook fillets until fish flakes easily with a fork, about 6 minutes per side.\n",
        "picture_link": "fycylZjpz0HAw40PWykcKQuQ4elv1bO"
    },
    {
        "title": "Prosciutto and Figs with Goat Cheese",
        "ingredients": [
            "4 ounces thinly sliced prosciutto ADVERTISEMENT",
            "8 dried figs, or as desired ADVERTISEMENT",
            "3 ounces goat cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLay prosciutto onto a work surface. Place 1 fig on the end of each prosciutto slice. Spread a thin layer goat cheese onto each fig. Roll prosciutto around each fig; arrange on a baking sheet.\nBake in the preheated oven until prosciutto is crisp, 3 to 4 minutes.\n",
        "picture_link": "auV7nIlfQxboRf22mpa.dXcrL8RbcYm"
    },
    {
        "title": "Artichoke Joe's",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 teaspoons olive oil ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "16 ounces frozen artichoke hearts (such as Trader Joe's®), thawed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter and olive oil together in a skillet over medium heat; add garlic, sage, rosemary, thyme, cayenne pepper, salt, and pepper and stir. Mix artichoke hearts into seasoned butter mixture; cover skillet and cook until tender, about 5 minutes.\n",
        "picture_link": "tBF/RYytCzrVRUiDqlVP7kCJuDynjNC"
    },
    {
        "title": "Vanilla Syrup",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "2 cups water, divided ADVERTISEMENT",
            "1/4 vanilla bean ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Microwave vanilla bean and 2 teaspoons water in a small microwave-safe bowl until softened, about 30 seconds.\nBring sugar and remaining water to a boil in a saucepan. Split vanilla bean lengthwise on a work surface; scrape out seeds with the back of a knife. Add seeds and pod to saucepan; boil until syrup is thickened slightly, about 2 minutes. Remove from heat and cool to room temperature.\n",
        "picture_link": "KzokFxqXGfwBuKTUF0fFsjKkb1CCJ66"
    },
    {
        "title": "Green Hornet",
        "ingredients": [
            "3/4 fluid ounce whiskey ADVERTISEMENT",
            "3/4 fluid ounce vodka ADVERTISEMENT",
            "3/4 fluid ounce gin ADVERTISEMENT",
            "3/4 fluid ounce green creme de menthe ADVERTISEMENT",
            "1/2 fluid ounce cola-flavored carbonated beverage (such as Coca-Cola®), or more to taste ADVERTISEMENT",
            "1/2 fluid ounce lemon-lime carbonated beverage (such as 7Up®), or to taste ADVERTISEMENT",
            "1/2 fluid ounce sweet and sour mix, or to taste ADVERTISEMENT",
            "1 cup crushed ice, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix whiskey, vodka, gin, creme de menthe, cola-flavored beverage, lemon-lime flavored beverage, and sweet and sour mix together in a cocktail shake. Fill a glass with ice; pour drink over ice.\n",
        "picture_link": "f788XdVa1/97lTCqICJTTO9C3j/DeRO"
    },
    {
        "title": "Chilled Kale and Potato Soup",
        "ingredients": [
            "1 1/2 cups beef broth ADVERTISEMENT",
            "1 cup water, or more as needed ADVERTISEMENT",
            "1 large red potato, peeled and diced ADVERTISEMENT",
            "1 clove garlic, sliced ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1 fresh red chile pepper, seeded and chopped (optional) ADVERTISEMENT",
            "6 leaves kale, finely chopped, stems included ADVERTISEMENT",
            "1 pinch ground nutmeg, or to taste ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "1 pinch ground allspice, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 slices bacon ADVERTISEMENT",
            "2 dried sage leaves, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine beef broth, water, potato, garlic, onion, and red chile pepper in a dutch oven or large saucepan and bring to a boil over medium-high heat. Stir in the kale, and season with nutmeg, cinnamon, allspice, salt, and pepper. Reduce heat to medium and simmer for 20 minutes, until potato is tender, adding more water if necessary.\nMeanwhile, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until slightly browned, but still tender, about 5 minutes. Drain the bacon slices on a paper towel-lined plate. Chop bacon, and stir into the soup until just incorporated. Simmer no more than 3 minutes. Serve chilled for at least 2 hours, topped with crushed sage leaves. Soup can also be served hot.\n",
        "picture_link": "D4vi859ByxAz0B8vC0/mWp/CCYs5HK6"
    },
    {
        "title": "Pitcha",
        "ingredients": [
            "1 pound beef oxtails ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "6 cloves garlic, halved ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 whole clove ADVERTISEMENT",
            "1/2 teaspoon whole black peppercorns ADVERTISEMENT",
            "1 (.25 ounce) envelope unflavored gelatin ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 hard-cooked eggs, sliced ADVERTISEMENT",
            "Garnish: ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Ask your butcher to chop the calf's foot in several pieces; wash well. (If you're using oxtails, leave the pieces whole and do not remove fat or bones until later.) Place the meat in a stock pot with the bouillon cube. Tie the chopped onion, garlic, bay leaf, clove, and peppercorns into a cheesecloth bag. Add the bag to the pot and pour in water to cover. Bring the water to a boil over high heat. Reduce the heat and simmer for 3 hours.\nStir the gelatin into the 1/2 cup of cold water and set aside for 10 minutes. Remove the meat from the pot and let it cool. Strain the cooking liquid into a bowl; you should have about 8 cups of broth. Discard the spice bag. Pick the meat from the bones and set it aside; discard the bones and gristle.\nSpray a gelatin mold with cooking spray. Add the lemon juice and salt and pepper to the broth. Taste and adjust the seasonings. Transfer the softened gelatin into the warm broth and stir to dissolve. Pour the liquid into the prepared mold and refrigerate. Chill the broth until the gelatin has thickened slightly, about 45 minutes to 1 hour. Stir in the reserved meat and the egg slices. Refrigerate until set, 4 hours or overnight.\nTo unmold the pitcha, dip the gelatin mold into warm water for 15 to 20 seconds. Invert the mold onto a serving plate and serve with parsley and lemon wedges.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Swiss-Style Veal and Mushrooms",
        "ingredients": [
            "1 3/4 cups Swanson® Chicken Stock ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Potato Soup ADVERTISEMENT",
            "1 teaspoon dried thyme leaves, crushed ADVERTISEMENT",
            "1 1/2 pounds veal for stew ADVERTISEMENT",
            "1 (8 ounce) package sliced mushrooms ADVERTISEMENT",
            "8 green onions, sliced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "Hot cooked egg noodles ADVERTISEMENT",
            "Freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the stock, soup, thyme, veal, mushrooms and green onions in a 3 1/2-quart slow cooker. Cover and cook on LOW for 7 to 8 hours or until the veal is fork-tender.\nStir the flour and water in a small bowl until the mixture is smooth. Stir the flour mixture in the cooker. Turn the heat to HIGH. Cover and cook for 5 minutes or until the mixture boils and thickens.\nStir in the cheese. Serve over the noodles. Season with the black pepper.\n",
        "picture_link": "QnWxDNGPwv2e.VgLUD8pfPV0995hZT."
    },
    {
        "title": "Mint Nanaimo Bars",
        "ingredients": [
            "1 cup mint chocolate chips ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 drop green food coloring, or as needed ADVERTISEMENT",
            "1 cup mint chocolate chips ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 cup of mint chocolate chips and 1/4 cup of butter in the top of a double boiler over hot water, stirring to melt the chips and butter together into a smooth mixture. Remove from heat, and beat in 1/4 cup of confectioners' sugar and egg; beat well. Stir in graham cracker crumbs until well combined, and press the mixture into an 8x8-inch dish. Chill the crust in refrigerator for about 1 hour.\nIn a mixing bowl, beat 1/4 cup of butter, 2 cups of confectioners' sugar, and milk with an electric mixer until the mixture is smooth and fluffy. Beat in green food coloring, 1 drop at a time, until filling reaches the desired color. Spread the filling over the chilled crust, and return to refrigerator for 30 minutes.\nMelt 1 cup of mint chocolate chips with 1/4 cup of butter in the top of a double boiler over hot water, stirring until the mixture is warm (not hot), smooth, and spreadable. Spread the topping in an even layer over the filling, and return the dish to the refrigerator. Chill until the topping is firm but not hard, about 15 minutes, cut into squares, and return to refrigerator for about 15 more minutes. Serve cold.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Potato Soup with Gravlax Rosettes",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "3 russet potatoes, peeled and finely diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "6 tablespoons mascarpone cheese ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon lemon juice, or to taste ADVERTISEMENT",
            "4 (1 ounce) slices thinly sliced smoked salmon (gravlax) ADVERTISEMENT",
            "2 tablespoons mascarpone cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over low heat, and cook and stir the potatoes and onion until the onion starts to become translucent, about 3 minutes. Raise heat to medium, pour in the vegetable broth, and bring to a boil. Reduce heat to a simmer, cover, and cook until the potatoes are tender, 10 to 15 minutes. Pour the mixture into a large bowl, and puree through a food mill back into the saucepan. (Discard any fibrous vegetables left in the food mill.)\nBring the pureed soup back to a simmer over medium-low heat, and whisk in 6 tablespoons of mascarpone. Season with salt, pepper, and lemon juice to taste.\nPreheat oven to 200 degrees F (95 degrees C), and warm 4 oven-safe soup plates for about 5 minutes.\nRoll a slice of smoked salmon loosely into a rose shape, pinching the roll at the bottom and fanning the roll out at the top. Place a rosette of salmon into the bottom of each warmed soup plate, gently pour the soup over the rosette, and drizzle each bowl with about 1/2 tablespoon of mascarpone cheese. Sprinkle with chives, and serve.\n",
        "picture_link": "zXXU8wJ3GSmlmAhN7SkcCzTbq5cfF/m"
    },
    {
        "title": "Sauteed Abalone",
        "ingredients": [
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "2 pounds abalone without shell ADVERTISEMENT",
            "3 limes, juiced ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 green bell peppers, sliced ADVERTISEMENT",
            "1 (16 ounce) jar Alfredo sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nSlice abalone into 1/2 inch slices. Place the abalone between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the abalone with the smooth side of a meat mallet to a thickness of 1/4 inch. Mix lime juice and garlic in a large bowl. Toss abalone slices and bell pepper in the lime garlic mixture to coat.\nHeat olive oil in a large skillet over high heat and stir in the abalone and bell pepper, including the juice. Cook and stir until the cooked through, 5 to 10 minutes. Remove the abalone slices and place on a plate and set aside. Continue cooking the peppers, until tender. Meanwhile, pour Alfredo sauce into a saucepan and heat over medium-low heat until hot, stirring occasionally. Serve abalone over a bed of linguine and Alfredo sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick-Does-The-Trick Chocolate Cake",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/2 cup unsweetened cocoa ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1/4 cup chocolate chips, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\nWhisk sugar, margarine, and eggs together in a large bowl until smooth and creamy. Add flour, buttermilk, cocoa, and baking soda and mix. Stir boiling water into mixture just until batter is mixed. Pour batter into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 30 to 35 minutes. Sprinkle chocolate chips over cake and let sit until chocolate begins to melt; spread over cake, creating an instant chocolate frosting.\n",
        "picture_link": "XMuOZjjMvpqZP/HXowruVG7vQJHYR0O"
    },
    {
        "title": "Honey Mustard BBQ Pork Medallions",
        "ingredients": [
            "1 Smithfield® Mesquite Seasoned Loin Filet ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons stone ground mustard ADVERTISEMENT",
            "1 1/2 cups corn flake cereal, slightly crushed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut loin filet diagonally into 1-inch thick slices; flatten with heel of hand.\nCombine honey and mustard in shallow dish; mix well. Dip pork slices into honey mixture then coat both sides with cereal.\nHeat oil in large skillet over medium-high heat. Cook pork medallions about 3 minutes per side until internal temperature reaches 150 degrees F.\n",
        "picture_link": "WSH4RvrRYQdpZ.TVRsKwcQrMXgFPpHe"
    },
    {
        "title": "Easy No-Squeezy Cherry Limeade Pie",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "4 ounces frozen limeade concentrate, thawed ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1/2 cup whipped cream, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese in a bowl using an electric mixer until smooth and creamy. Add limeade concentrate and sugar and beat until light and fluffy, at least 5 minutes. Spoon mixture into graham cracker crust; refrigerate until chilled, at least 4 hours.\nTop pie with cherry pie filling and whipped cream.\n",
        "picture_link": "X90yWR0tF/hhKBsS66gf12YISRYtnNa"
    },
    {
        "title": "Fasolakia",
        "ingredients": [
            "1/2 cup extra-virgin olive oil, divided ADVERTISEMENT",
            "1 white onion, chopped ADVERTISEMENT",
            "2 (15 ounce) cans green beans, drained ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes in juice ADVERTISEMENT",
            "3 red potatoes, cut into bite-size pieces ADVERTISEMENT",
            "1 1/2 tablespoons dried mint ADVERTISEMENT",
            "1 tablespoon parsley flakes ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 tablespoon water, or as needed ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/4 cup olive oil in a skillet over medium heat; cook and stir onion until tender, about 10 minutes. Mix remaining olive oil, green beans, tomatoes, potato, mint, parsley, salt, and pepper into onion, adding enough water to cover the whole mixture. Bring liquid to a boil, reduce heat to medium-low, and simmer until potatoes are tender, about 1 hour.\n",
        "picture_link": "E.e3e/AOfaxtO/gAvRVvM0c/tz9odKi"
    },
    {
        "title": "Simple Feese (Vegan Fake Cheese)",
        "ingredients": [
            "1 cup raw almonds ADVERTISEMENT",
            "2 tablespoons nutritional yeast ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend almonds, nutritional yeast, garlic powder, and salt together in a blender until desired consistency is reached.\n",
        "picture_link": "YW7A4SbQ89snPUqVUQTBchn3rBHYkP6"
    },
    {
        "title": "Pulled Pork Pub Subs",
        "ingredients": [
            "1 (23 ounce) Smithfield® Garlic & Herb Seasoned Pork Sirloin ADVERTISEMENT",
            "1 cup shredded provolone cheese, or as needed ADVERTISEMENT",
            "2 tablespoons chopped fresh oregano ADVERTISEMENT",
            "4 bakery sub rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the meat into a slow cooker with enough water just to cover the top. Cook on med/low for 6 hours (or high for 4 hours). (You can also cook it on a low oven temp., the same way, if you prefer.)\nShred the meat gently with a fork and fill up your rolls.\nTop them with cheese and some oregano (or any spices you like). Bake them on a sheet pan with a sprinkling of spices, at 350 degrees just until the cheese is melted and the subs are warmed through, about 10 minutes. Serve them up nice and warm.\n",
        "picture_link": "OJR0zdNd/fuPFBuMv98yQoBNOZkXdUG"
    },
    {
        "title": "Bananas Foster on the Grill",
        "ingredients": [
            "1/2 banana ADVERTISEMENT",
            "2 tablespoons coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat.\nPlace banana, coffee-flavored liqueur, butter, brown sugar, and ground cinnamon on a large section of heavy aluminum foil. Bring up 2 sides of foil to touch and fold down twice to seal. Double fold ends of packet to securely seal.\nPlace packet on preheated grill and cook until heated through, about 5 minutes.\n",
        "picture_link": "zK6litw.Lu/dmpFnBDzRB5rEnqG5pHi"
    },
    {
        "title": "Pineapple Carrot Smoothie",
        "ingredients": [
            "1 frozen banana, broken into chunks ADVERTISEMENT",
            "1 cup frozen pineapple chunks ADVERTISEMENT",
            "1 carrot, cut into chunks ADVERTISEMENT",
            "1 tablespoon hemp seeds ADVERTISEMENT",
            "1/2 teaspoon finely grated ginger ADVERTISEMENT",
            "1/4 teaspoon finely grated orange zest ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place banana, pineapple, carrot, hemp seeds, ginger, orange zest, cinnamon, coconut milk, and water in a blender in the order listed; blend on high until creamy and smooth.\n",
        "picture_link": "AA/mEIn.oq.MkOLBnB/Db.2xe4lr78K"
    },
    {
        "title": "Cocoa Krispies® Ice Cream Cones",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 (10 ounce) package marshmallows ADVERTISEMENT",
            "6 cups chocolate crisp rice cereal (such as Kellogg's® Cocoa Krispies®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over low heat; add marshmallows and cook and stir until melted. Remove from heat and add chocolate crisp rice cereal and stir until coated.\nSpread marshamallow mixture between two pieces of waxed paper; flatten using a rolling pin. Form the flattened mixture into 3 cone shapes and let set for 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Papaya Soup",
        "ingredients": [
            "2 tablespoons coconut oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "3/4 cup red bell pepper, chopped ADVERTISEMENT",
            "6 fresh chives, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "3 fresh sage leaves, chopped ADVERTISEMENT",
            "2 teaspoons thinly sliced fresh ginger ADVERTISEMENT",
            "1 small hot chile pepper (optional) ADVERTISEMENT",
            "1 (14 ounce) package firm tofu, drained and cut into 3/4-inch cubes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons vegetarian Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon lime juice ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "3 cubes vegetable bouillon ADVERTISEMENT",
            "1 small green papaya, peeled and cut into chunks ADVERTISEMENT",
            "1 bunch fresh spinach, trimmed ADVERTISEMENT",
            "1 tablespoon fried onions, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat coconut oil in a stockpot over medium heat; add onion, red bell pepper, chives, garlic, rosemary, sage, ginger, and chile pepper. Cook and stir until garlic is fragrant, about 1 minute. Add tofu to onion mixture; cook, stirring every 2 minutes, until tofu is golden brown, about 6 minutes. Season with salt.\nMix Worcestershire sauce and lime juice into tofu mixture. Stir water and bouillon together in a bowl until dissolved; pour over tofu mixture. Bring liquid to a simmer, add papaya, loosely cover stockpot, and simmer until papaya is tender yet firm to the bite, about 20 minutes.\nRemove stockpot from heat, stir on spinach, cover, and allow to sit until spinach is wilted, 2 to 3 minutes. Ladle soup into serving bowls and top with fried onions.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grilled Chopped Salad",
        "ingredients": [
            "4 hearts of romaine lettuce, halved lengthwise ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "salt and fresh ground pepper to taste ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "2 Roma tomatoes, diced ADVERTISEMENT",
            "1 avocado, diced ADVERTISEMENT",
            "1 cucumber, chopped ADVERTISEMENT",
            "1 teaspoon reduced-fat balsamic vinaigrette dressing, or to taste ADVERTISEMENT",
            "1 teaspoon crumbled feta cheese, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for low heat and lightly oil the grate.\nBrush romaine heart halves with olive oil and balsamic vinegar; season with salt, ground black pepper, and garlic salt.\nGrill romaine hearts over low heat until tender, about 2 minutes; flip and continue cooking until tender, about 2 minutes.\nTransfer grilled romaine hearts to a cutting board and chop; transfer to a bowl. Top romaine with Roma tomatoes, avocado, cucumber, balsamic vinaigrette, and feta cheese.\n",
        "picture_link": "IbCzfpbTwTnpc0XlNZRBU2XQGP6s7GK"
    },
    {
        "title": "Sweet and Spicy Pork Mini Kabobs",
        "ingredients": [
            "1 Smithfield® Peppercorn & Garlic Seasoned Boneless Pork Sirloin Roast, cut into 32 (1-inch) pieces ADVERTISEMENT",
            "1/2 ripe pineapple, peeled, cored, and cut into 16 (1-inch) pieces ADVERTISEMENT",
            "2 large red bell peppers, cut into 16 (1-inch) pieces ADVERTISEMENT",
            "16 (6 inch) bamboo skewers, soaked in water for 30 minutes, drained ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 teaspoons Caribbean jerk seasoning blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat broiler with rack about 8 inches from heat source.\nThread 2 pieces of pork, 1 pineapple cube and 1 red pepper piece onto each skewer. Wrap exposed end of each skewer with foil to discourage scorching.\nMix honey, vinegar and jerk seasoning together for glaze.\nBroil kabobs, turning occasionally, until pork is done, about 8 minutes. Generously brush kabobs with honey glaze during last 2 to 3 minutes.\n",
        "picture_link": "5qdSjlxaAbXEcRMlWduuvMAiPV.E3Qy"
    },
    {
        "title": "Almond Milk Frappuccino®",
        "ingredients": [
            "1 cup ice ADVERTISEMENT",
            "1 cup vanilla-flavored almond milk ADVERTISEMENT",
            "2 shots brewed espresso, chilled ADVERTISEMENT",
            "1 teaspoon honey, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice, almond milk, espresso, and honey in a blender until smooth.\n",
        "picture_link": "53Ao2msJBErpkxC7DBv7IlCSkC2yL0O"
    },
    {
        "title": "Mini Pork Pot Pie",
        "ingredients": [
            "1 (16.3 ounce) can refrigerated jumbo biscuits ADVERTISEMENT",
            "1 cup diced cooked Smithfield® Garlic & Herb Seasoned Loin Filet or Sirloin Roast ADVERTISEMENT",
            "1 cup chopped frozen broccoli florets, thawed ADVERTISEMENT",
            "1 (10.75 ounce) can condensed broccoli cheese soup ADVERTISEMENT",
            "Shredded Swiss or Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Separate biscuits and press with hands into a 5- to 6-inch circle. Place 1 round in each of 8 regular-size muffin cups. Firmly press in bottom and up sides, forming 1/2-inch rim.\nCombine remaining ingredients; mix well. Spoon filling into each biscuit crust, pushing into crust and mounding on top. If desired, sprinkle top of each with 1 tablespoon shredded cheese.\nBake at 375 degrees F for 25 to 30 minutes until biscuits are golden brown. Cool in pan 5 minutes before removing to serve.\n",
        "picture_link": "HlzBO1Bk/U0ClwZQTpEsRp3X3WCwTyS"
    },
    {
        "title": "Rice Breakfast Bars",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup uncooked brown rice ADVERTISEMENT",
            "1/3 cup peanut butter ADVERTISEMENT",
            "1/3 cup unsweetened applesauce ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup garbanzo bean flour ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1/2 cup dried currants ADVERTISEMENT",
            "1/4 cup sweetened flaked coconut, chopped ADVERTISEMENT",
            "2 tablespoons sunflower seeds ADVERTISEMENT",
            "2 tablespoons chia seeds ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Coat an 8-inch pie pan with cooking spray.\nBring water and brown rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 45 to 50 minutes.\nStir peanut butter, applesauce, honey, and egg together in a bowl; add rice, garbanzo bean flour, oats, currants, coconut, sunflower seeds, chia seeds, baking powder, and ground cinnamon and stir until combined. Spread dough evenly in prepared pie pan.\nBake in preheated oven until edges are golden brown, about 20 minutes.\n",
        "picture_link": "E3A2Iz9WYnz4ESvYQFGadkJJh3plVOu"
    },
    {
        "title": "Garlic Herb Pork Medallions with Apples",
        "ingredients": [
            "1 Smithfield® Garlic & Herb Seasoned Pork Loin Filet, cut into 3/4-inch thick slices ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large cooking apple (like Rome or Granny Smith), cored and thinly sliced ADVERTISEMENT",
            "1 small sweet yellow onion, thinly sliced ADVERTISEMENT",
            "1/4 teaspoon apple pie spice or ground cinnamon ADVERTISEMENT",
            "1/2 cup apple juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute pork slices in oil over medium-high heat until browned. Remove from skillet and keep warm.\nAdd apple, onion and apple pie spice to skillet; saute over medium-high heat until onions are tender.\nReturn pork to skillet; add apple juice. Cover and simmer until internal temperature of pork reaches 150 degrees F., about 5 minutes.\n",
        "picture_link": "6WL2Bs1UcPrq6t677s4blZXSxrlm6Dm"
    },
    {
        "title": "Baked Raspberry Custard",
        "ingredients": [
            "3 cups fresh raspberries ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 1/2 cups whole milk ADVERTISEMENT",
            "6 large eggs ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 1/2 tablespoons unsalted butter, room temperature ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/4 cup coarse sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Butter a deep-dish pie pan.\nSpread raspberries into the prepared pan and top with 1/4 cup white sugar.\nBlend milk, eggs, 1 1/4 cups white sugar, flour, unsalted butter, vanilla extract, and salt together in a blender until smooth and creamy; slowly pour over raspberries. Sprinkle coarse sugar over the floating raspberries.\nBake in the preheated oven until custard is raised in the middle and top is lightly browned, 45 to 50 minutes.\n",
        "picture_link": "LxFP6ANXXNGzOp3qxZDRgXirx8lPGda"
    },
    {
        "title": "Cucumber Water",
        "ingredients": [
            "22 fluid ounces water ADVERTISEMENT",
            "4 slices tangerine ADVERTISEMENT",
            "5 slices cucumber ADVERTISEMENT",
            "2 sprigs thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, tangerine slices, cucumber slices, and thyme sprigs in a 32-ounce mason jar or pitcher. Stir gently.\nCover and refrigerate for at least 1 hour before serving.\n",
        "picture_link": "h/dkiJakf3aZs8RmVOKIGt5Kp.RuX0O"
    },
    {
        "title": "Pizza Oven Dough",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water, yeast, and sugar together in the bowl of a stand mixer until sugar is dissolved. Add bread flour, olive oil, and salt. Knead using the dough hook attachment until dough is smooth and elastic, about 10 minutes.\nCover dough and refrigerate, 8 hours to overnight.\nPunch dough gently to deflate. Divide into 2 pieces on a lightly floured surface. Shape into balls; cover with a damp cloth and let rest, 2 to 3 hours. Flatten or stretch out dough to desired thickness.\n",
        "picture_link": "KrwqboujQaiJTr7jFejF.bQgHuCZ.YO"
    },
    {
        "title": "Mango Coconut Chia Pudding",
        "ingredients": [
            "1 mango, peeled and diced ADVERTISEMENT",
            "2/3 cup unsweetened coconut milk beverage (such as Silk®) ADVERTISEMENT",
            "1 tablespoon maple syrup ADVERTISEMENT",
            "2 tablespoons chia seeds ADVERTISEMENT",
            "2 tablespoons unsweetened coconut flakes (such as Bob's Red Mill®), divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash half of the mango in a bowl with a fork or puree in a food processor to desired consistency.\nWhisk coconut milk beverage and maple syrup into the mashed mango; stir in chia seeds and 1 tablespoon coconut flakes. Cover and refrigerate until thickened, at least 1 hour.\nDivide pudding between 2 bowls and top with diced mango and remaining coconut flakes.\n",
        "picture_link": "MM021iyct156WA4vuZXz2IWTz5c6prK"
    },
    {
        "title": "Sawine (Vermicelli Kheer)",
        "ingredients": [
            "1 teaspoon ghee (clarified butter) ADVERTISEMENT",
            "2 ounces vermicelli, broken into 1/2-inch pieces ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "12 fluid ounces water ADVERTISEMENT",
            "3 tablespoons sweetened condensed milk ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3 tablespoons raisins ADVERTISEMENT",
            "1/2 cup toasted almonds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat ghee in a saucepan over medium heat. Add vermicelli; cook and stir until golden brown, 2 to 3 minutes. Pour evaporated milk and water over vermicelli; bring to a boil.\nStir sweetened condensed milk and cinnamon into vermicelli mixture; cook, stirring occasionally, until vermicelli is cooked and milk is thickened, 5 to 10 minutes.\nStir raisins into vermicelli mixture; cook until raisins are plump and mixture is thickened, about 5 minutes. Remove from heat and cool slightly. Serve garnished with almonds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Breakfast for Dinner Casserole",
        "ingredients": [
            "1 pound ground turkey breakfast sausage ADVERTISEMENT",
            "1 (8 ounce) can refrigerated reduced-fat crescent roll dough ADVERTISEMENT",
            "5 eggs, lightly beaten ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "2/3 red bell pepper, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh spinach ADVERTISEMENT",
            "1 scallion, chopped ADVERTISEMENT",
            "1 tablespoon minced parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13-inch baking dish.\nHeat a large skillet over medium-high heat. Cook and stir turkey in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nUnroll crescent roll dough and spread evenly over the bottom of the prepared baking dish.\nBake in the preheated oven for 10 minutes.\nMix sausage and eggs together in a bowl. Add Cheddar cheese, mozzarella cheese, milk, red bell pepper, spinach, scallion, parsley, salt, and pepper, stirring well after each addition. Pour egg mixture over the baked crescent rolls.\nBake in the oven until eggs are set, 25 to 30 minutes.\n",
        "picture_link": "NclVAKZggMf82YgnGD4rcsqFwv0wkta"
    },
    {
        "title": "Layered Waldorf Salad",
        "ingredients": [
            "1 cup shelled walnut pieces ADVERTISEMENT",
            "1 large head green leaf lettuce, sliced into bite-size chunks ADVERTISEMENT",
            "3 cups chopped celery ADVERTISEMENT",
            "1 pound red seedless grapes, halved ADVERTISEMENT",
            "2 large red apples, cut into small chunks ADVERTISEMENT",
            "1/3 cup blue cheese crumbles ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "3/4 cup plain yogurt ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nSpread walnut pieces on a baking sheet lined with parchment paper.\nToast walnut pieces under the preheated broiler until fragrant, 2 to 3 minutes.\nArrange lettuce at the bottom of a large glass trifle bowl. Layer celery, grapes, and red apples on top. Cover with toasted walnuts and blue cheese crumbles.\nCombine yogurt, mayonnaise, honey, lemon juice, and lemon zest in a jam jar; seal and shake well. Season dressing with salt and pepper. Serving dressing alongside salad.\n",
        "picture_link": "N2h5i9q1dNqwnem2q2W091baj0IegDq"
    },
    {
        "title": "Dominican Chimichurri Burger (Katleti)",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 large green bell pepper, finely chopped ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon yellow mustard ADVERTISEMENT",
            "3 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 slices Cheddar cheese (optional) ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "4 oval-shaped Portuguese rolls, split ADVERTISEMENT",
            "1/2 head cabbage, finely sliced ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "1/2 onion, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground beef, green bell pepper, finely chopped onion, Worcestershire sauce, soy sauce, yellow mustard, garlic, oregano, salt, and pepper together in a large bowl. Form mixture into 4 patties that will fit inside the rolls.\nHeat vegetable oil in a large skillet over medium-high heat. Cook patties until browned on the bottom, about 6 minutes. Reduce heat to medium-low and flip; cook for 4 minutes. Top each patty with a slice of Cheddar cheese; cook until cheese starts to melt, about 2 minutes. An instant-read thermometer inserted into the center of each patty should read 150 degrees F (66 degrees C) for medium-well.\nMix ketchup and mayonnaise together in a small bowl. Spread evenly over both sides of each bun. Transfer a patty to each bun; top with sliced cabbage, tomatoes, and onion.\n",
        "picture_link": "xQ.ke20NJ8rFa1a9epSlyNFLvlipVGy"
    },
    {
        "title": "Cucumber Tea Spritzer",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 black tea bags, or more to taste ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "1 cucumber, cut into 1/4-inch slices ADVERTISEMENT",
            "5 cups sparkling water, or as needed ADVERTISEMENT",
            "1 lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a kettle. Pour into a pitcher. Stir in sugar until it dissolves into a syrup. Add tea bags; let steep, about 5 minutes.\nFill 5 glasses with ice cubes. Add some cucumber slices. Fill glasses 3/4 full of sparking water. Divide sweet tea evenly among glasses. Squeeze some lemon juice into each drink; stir.\n",
        "picture_link": "2KX21M6/ooam64u7GjYB4cigTlhWlSO"
    },
    {
        "title": "Edible Cookie Chip Dough ",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup whole milk ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup chocolate chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, white sugar, brown sugar, and salt together in a large bowl. Add milk, butter, and vanilla extract; stir with a wooden spoon until dough is combined. Fold in chocolate chips.\nTurn dough out on a large piece of plastic wrap; roll into a log and wrap up tightly. Freeze until firm, about 1 hour. Cut dough with a wet knife; it will be sticky.\n",
        "picture_link": "wboBjYrRlCa7.a7zZxlLkEJ3NEYsVHm"
    },
    {
        "title": "Thin Crust Pizza Dough",
        "ingredients": [
            "1 cup warm water (100 to 110 degrees F/40 to 45 degrees C) ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "2 1/2 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix warm water and sugar together in a bowl; add yeast. Set aside until yeast mixture becomes foamy, about 10 minutes.\nPour yeast mixture into a large bowl; add flour, olive oil, and salt. Knead dough for 6 to 8 minutes, adding more flour to keep dough from sticking to your hands if needed. Cover bowl and let sit for 20 to 30 minutes.\nGrease 2 pizza pans or baking sheets.\nDivide dough in half. Make each half into a ball shape and roll each into a flat, circular crust using a rolling pin.\nPlace 1 piece dough over your hands with your knuckles turned upward directly underneath the center of the dough. Using your knuckles and backs of your hands, toss the dough into the air in a circular motion, spinning the dough. This thins the center of the dough and forms the padded edge of the pizza. When the edge of the dough is about 1/4-inch thick, place the dough onto the pan. Pizza diameter will be about 10 inches. Repeat with other piece of dough.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fabienne's Grilled Center Cut Pork Chops",
        "ingredients": [
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons Marsala wine ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "2 center-cut boneless pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, Marsala wine, basil, paprika, garlic powder, Worcestershire sauce, lemon juice, celery salt, and cayenne pepper together in a bowl and pour into a resealable plastic bag. Add pork chops, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 8 hours to overnight.\nPreheat grill to 400 degrees F (200 degrees C) and lightly oil the grates.\nRemove the pork chops from marinade and shake to remove excess moisture.\nCook pork chops on the preheated grill, basting with marinade every 15 minutes, until an instant-read thermometer reads 165 degrees F (74 degrees C), 30 to 40 minutes.\n",
        "picture_link": "df4C8ywgkPjHhrl3FFvsxkOlk7Z1cu."
    },
    {
        "title": "Breakfast For Dinner",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup rice ADVERTISEMENT",
            "2 slices bacon ADVERTISEMENT",
            "1 teaspoon oil, or as needed ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch cinnamon sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble bacon into small pieces.\nHeat oil in a skillet over medium heat; cook and stir eggs until set, about 5 minutes. Season scrambled eggs with salt and pepper.\nLayer rice, eggs, and bacon in a bowl; top generously with cinnamon sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tzatziki Guacamole",
        "ingredients": [
            "4 ripe avocados, peeled and pitted ADVERTISEMENT",
            "1/4 cup minced garlic ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/3 cup plain yogurt ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "1 cup diced English cucumber ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "1/4 cup chopped fresh dill ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 1/2 tablespoons red pepper flakes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine avocados, garlic, and lemon juice in a bowl; mash into a paste using a fork or spoon. Mix in yogurt and sour cream. Stir in cucumber, mint, dill, cilantro, red pepper flakes. Season with salt and pepper. Cover and refrigerate for at least 1 hour before serving.\n",
        "picture_link": "/L1cd4mvR2GynqFjFaMnq66uWAEDxv2"
    },
    {
        "title": "Portuguese Shrimp",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil, or more as needed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (12 fluid ounce) can ale, divided ADVERTISEMENT",
            "5 sprigs parsley, stemmed and chopped ADVERTISEMENT",
            "2 teaspoons tomato paste ADVERTISEMENT",
            "2 teaspoons Portuguese hot pepper sauce (pimenta) ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "2 pounds unpeeled large shrimp, deveined ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Add onion and garlic; cook and stir until softened, about 5 minutes. Stir in parsley, tomato paste, hot pepper sauce, chicken bouillon, and paprika. Pour in half of the ale; simmer until flavors combine, about 5 minutes.\nPour remaining ale into the skillet; add shrimp. Season with salt. Cook until shrimp absorbs the liquid and turns pink, 15 to 20 minutes.\n",
        "picture_link": "Rl9bULS0OMnv4QYVLJixP3uxXKNIVJq"
    },
    {
        "title": "Baek Kimchi (White Kimchi)",
        "ingredients": [
            "1 head napa cabbage ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup thinly grated white (daikon) radish ADVERTISEMENT",
            "2 green onions, sliced diagonally into thin strips ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 slices fresh ginger ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white vinegar ADVERTISEMENT",
            "3 pinches dried Korean red pepper threads ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut cabbage lengthwise into quarters, keeping the leaves attached to the core. Rinse cabbage with cold water and liberally sprinkle 3 tablespoons salt between the leaves. Place cabbage in a large bowl and add just enough water to cover. Set aside until leaves are soft, 4 to 5 hours.\nRinse the salted cabbage 3 or 4 times with cold water and drain in a colander for about 20 minutes.\nCombine 1 cup water, radish, green onions, garlic, ginger, sugar, 1 teaspoon salt, vinegar, and red pepper threads in a bowl. Sprinkle radish mixture between all the cabbage leaves except for the large outer leaf of each quarter. Reserve the liquid from the radish mixture.\nPeel back the large outer leaf of each quarter, without removing it from the core, and fold the inner leaves in half. Wrap the outer leaf around the inner leaves and pack the cabbage quarters into a clean 1/2-gallon jar; pour in the reserved liquid from radish mixture. Seal jars and let sit at room temperature for 1 day. Slice the wrapped cabbage quarters into 1 1/2-inch pieces.\n",
        "picture_link": "ZOvHldtYTXYdedQqNKNHgKO88FVfuY."
    },
    {
        "title": "College Munchies (Edible Chocolate Peanut Butter Cookie Dough)",
        "ingredients": [
            "2/3 cup white sugar ADVERTISEMENT",
            "3 tablespoons peanut butter ADVERTISEMENT",
            "3 tablespoons margarine, at room temperature ADVERTISEMENT",
            "1/3 cup instant milk chocolate drink mix ADVERTISEMENT",
            "1 tablespoon milk, or as needed ADVERTISEMENT",
            "3 cups all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sugar, peanut butter, and margarine in a large bowl; beat until creamy. Mix in chocolate drink mix and milk until blended. Mix in flour until dough comes together and is no longer sticky.\nRoll dough into balls; transfer to a large plate lined with waxed paper. Store in the refrigerator.\n",
        "picture_link": "M/Qcp3./z5Cht7aI45iPhwwwKw.oWGK"
    },
    {
        "title": "Edible Chocolate Chip Cookie Dough",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup chocolate chips ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix butter, milk, and vanilla extract together in a large bowl.\nCombine flour, brown sugar, white sugar, baking soda, and salt in a separate bowl; slowly mix into butter mixture, beating on low speed with an electric mixer until dough is just combined.\nFold chocolate chips and walnuts into dough; drop by rounded tablespoon onto waxed paper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Banana Smoothie",
        "ingredients": [
            "2 frozen bananas, chopped ADVERTISEMENT",
            "3/4 cup vanilla yogurt ADVERTISEMENT",
            "3/4 cup almond milk ADVERTISEMENT",
            "4 ice cubes, or as desired (optional) ADVERTISEMENT",
            "1 tablespoon peanut butter, or more to taste ADVERTISEMENT",
            "1 tablespoon manuka honey, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine bananas, yogurt, almond milk, ice cubes, peanut butter, and honey in a blender or high-speed blender (such as Vitamix(R)); blend until smooth.\n",
        "picture_link": "zLqpxhiMfdT7wX0HcveOXOWXKqilJhm"
    },
    {
        "title": "Layered Salmon Cobb Salad",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "1/2 clove garlic, crushed ADVERTISEMENT",
            "2 teaspoons chopped fresh dill ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 cups fresh green beans, trimmed ADVERTISEMENT",
            "1 pound salmon fillets ADVERTISEMENT",
            "1/2 teaspoon vegetable oil ADVERTISEMENT",
            "4 cups chopped green leaf lettuce ADVERTISEMENT",
            "1 pound tomatoes, cut into bite-sized pieces ADVERTISEMENT",
            "1 (15 ounce) can corn, drained ADVERTISEMENT",
            "2 cucumbers, halved and sliced ADVERTISEMENT",
            "5 hard-boiled eggs, halved ADVERTISEMENT",
            "4 slices cooked bacon, cut into thin strips ADVERTISEMENT",
            "4 spring onions, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine buttermilk, mayonnaise, white wine vinegar, and garlic in a jar. Seal and shake well. Stir in dill, salt, and pepper. Refrigerate dressing.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add green beans, cover, and steam until tender, 4 to 5 minutes. Drain and let cool.\nPreheat grill for medium heat and lightly oil the grate. Brush salmon with vegetable oil; season with salt and pepper.\nCook salmon on the preheated grill until flesh flakes easily with a fork, 6 to 8 minutes per side.\nLayer lettuce, tomatoes, corn, cucumbers, green beans, and hard-boiled eggs in a large glass trifle bowl. Place salmon on top. Garnish with bacon and spring onions. Serve dressing alongside.\n",
        "picture_link": "v7MGjhZfrM066/GeFi62Ejdk6DSHtHC"
    },
    {
        "title": "Pesto-Coated Center-Cut Pork Chop",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "6 tablespoons basil pesto, divided ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 (8 ounce) center-cut boneless pork chops (3/4-inch thick) ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Spray a baking dish with cooking spray. Spread 1/2 of the pesto over into the bottom of the baking dish.\nHeat a cast iron skillet over medium-high heat for 5 minutes. Add olive oil.\nSeason pork chops with salt and pepper. Cook pork chops in the hot oil until browned, about 4 minutes per side. Transfer pork chops to baking dish and top each with remaining pesto. Season with red pepper flakes. Cover baking dish with aluminum foil.\nBake in the preheated oven until an instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C), about 1 1/2 hours. Allow pork chops to rest for 10 minutes.\n",
        "picture_link": "WRHcjAnGGsNZlwnwdMaED6Q5STOS9jW"
    },
    {
        "title": "Zesty Cold Chicken Pasta Salad",
        "ingredients": [
            "1 (8 ounce) package rotini pasta ADVERTISEMENT",
            "1 cup fat-free mayonnaise ADVERTISEMENT",
            "1 teaspoon lemon pepper seasoning ADVERTISEMENT",
            "1/2 teaspoon dried mustard ADVERTISEMENT",
            "24 cherry tomatoes, halved ADVERTISEMENT",
            "1 (15 ounce) can peas, drained ADVERTISEMENT",
            "2 (5 ounce) cans chicken packed in water, drained ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook rotini at a boil until tender yet firm to the bite, about 8 minutes. Drain and rinse with cold water.\nMix mayonnaise, lemon pepper seasoning, and dried mustard together in a large bowl. Mix in cherry tomatoes, peas, and chicken. Fold in rotini. Sprinkle paprika over salad before serving.\n",
        "picture_link": "2MSGBEU4fnVLt.G428t80AqH1eob2Dq"
    },
    {
        "title": "Pesto Chips",
        "ingredients": [
            "1 (8 ounce) bag kettle-cooked potato chips ADVERTISEMENT",
            "1 cup finely grated Parmesan cheese, divided ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "4 leaves fresh basil, minced ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nArrange potato chips in a single layer on a rimmed baking sheet; top with 1/2 cup Parmesan cheese, dried basil, and garlic.\nBake in the preheated oven until cheese is melted and chips are just starting to brown around the edges, about 4 minutes. Top chips with remaining Parmesan cheese and fresh basil. Drizzle olive oil over cheese layer. Cool and transfer to a serving bowl.\n",
        "picture_link": "uCOHOqAj0TMqjW3rAVAczM9jgmcHGSS"
    },
    {
        "title": "Easy Chocolate Chip Cookie Dough Cheesecake",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 (18 ounce) packages chocolate chip cookie dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix cream cheese, sugar, eggs, and vanilla together in a bowl until smooth and well blended.\nSpread 1 roll of cookie dough on the bottom of a 9x13-inch baking pan to form the base. Spread cream cheese mixture evenly on top. Pinch off small pieces of the remaining cookie dough and distribute them on the cream cheese mixture.\nBake in the preheated oven until cream cheese mixture is set and cookies on top are golden brown, 30 to 45 minutes. Let cool before serving, about 30 minutes.\n",
        "picture_link": "7zyR..sL6tG0fnwcZB33suAjyFjSwJG"
    },
    {
        "title": "Mediterranean Lamb Meatball Sandwiches with Yogurt Sauce",
        "ingredients": [
            "Lamb Meatballs: ADVERTISEMENT",
            "1 small onion ADVERTISEMENT",
            "1 cup fresh mint leaves ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 pound ground lamb ADVERTISEMENT",
            "3 tablespoons ground sweet paprika ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1/4 cup vegetable oil, or as needed ADVERTISEMENT",
            "Yogurt Sauce: ADVERTISEMENT",
            "1 (6 ounce) container Greek yogurt ADVERTISEMENT",
            "2 tablespoons tahini ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "4 sheets lavash bread ADVERTISEMENT",
            "1 (4 ounce) package crumbled feta cheese ADVERTISEMENT",
            "1 cup shredded lettuce ADVERTISEMENT",
            "1/2 cup diced fresh tomatoes ADVERTISEMENT",
            "1/2 cup cucumber matchsticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine onion, mint, and garlic in a food processor; process until minced. Add lamb, paprika, cumin, salt, and pepper; process until smooth.\nForm 1 1/2 teaspoon of the lamb mixture into a ball. Repeat with remaining lamb mixture to make 20 meatballs.\nPreheat oven to 375 degrees F (190 degrees C). Grease a baking sheet with cooking spray.\nFill a large skillet with 1/4 inch of oil; heat over medium heat until bubbles form around the end of a wooden spoon dipped into the oil. Add half of the meatballs; cook until browned, 1 to 2 minutes per side. Transfer to the prepared baking sheet. Repeat with remaining meatballs.\nBake meatballs in the preheated oven until center is no longer pink, about 10 minutes.\nMix yogurt, tahini, and lemon juice together in a bowl to make yogurt sauce.\nPlace 2 to 3 tablespoons yogurt sauce in a line down the center of each sheet of lavash. Add 2 to 3 tablespoons of feta cheese, 1/4 cup of lettuce, 2 tablespoons of tomato, 2 tablespoons of cucumber, and 5 meatballs. Fold up one end and sides of the lavash to roll into wraps.\n",
        "picture_link": ".AVsKhvjyRI6gWsXr.eFUM0wkPVZTfW"
    },
    {
        "title": "Boozy Banana Bread",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups all-purpose flour, sifted ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "5 very ripe bananas, mashed ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 drops almond extract ADVERTISEMENT",
            "3 drops amaretto (almond-flavored liqueur) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a loaf pan with cooking spray.\nWhisk flour, salt, and baking soda together in a bowl.\nMix bananas, brown sugar, butter, eggs, almond extract, and amaretto together in a separate bowl. Add flour mixture; mix just until flour is incorporated, about 1 minute. Transfer mixture to the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Let cool before serving, about 30 minutes.\n",
        "picture_link": "eY2x47fUs4bvrERiD4yfQb/EHvP.Pkq"
    }
]