[
    {
        "title": "Beef and Mushroom Stuffed Peppers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 cup fresh mushrooms, sliced ADVERTISEMENT",
            "1/2 white onion, diced ADVERTISEMENT",
            "2 cups beef gravy ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 small red bell peppers, halved and seeded ADVERTISEMENT",
            "3/4 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBrown beef in a large skillet over medium-high heat. Halfway through browning, add mushrooms and onion. Continue cooking until meat is fully browned; drain fat from skillet. Stir in enough gravy to bond mixture without making it soupy. Season with salt and pepper, and set aside.\nMeanwhile, heat a medium saucepan of water until boiling. Place peppers in water, and boil for 2 to 3 minutes, until just tender; remove from water. Place peppers, hollow side up, in a 9x13 inch baking dish, and fill each with beef mixture.\nBake in preheated oven for 15 to 20 minutes, until bubbling. Top with cheese, and bake for an additional 5 to 10 minutes. Serve in a small pool of gravy.\n",
        "picture_link": "lUWaTJoVpdMfruU72adKsuskMOBTA4e"
    },
    {
        "title": "Low Fat Apple Bran Muffins",
        "ingredients": [
            "1 1/2 cups wheat bran ADVERTISEMENT",
            "1 cup low-fat buttermilk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/2 apple, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine bran and buttermilk. Set aside to soak for 10 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease muffin pan, or use paper liners.\nIn a large bowl, mix together flour, brown sugar and baking soda. Stir in bran mixture and egg whites. Fold in grated apple. Divide batter into 12 muffin cups.\nBake in preheated oven for 16 to 18 minutes, or until a toothpick inserted into the center comes out clean. Allow to cool for 5 minutes before removing from the pan.\n",
        "picture_link": "mBwWvM0oZkdmts1YVEKNN1B1zxitWFu"
    },
    {
        "title": "Cheese Filled Triangles",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach - thawed, drained and squeezed dry ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (4 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "1/2 cup cottage cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (16 ounce) package phyllo dough ADVERTISEMENT",
            "1 cup unsalted butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a medium saucepan over medium heat. Slowly cook and stir onion until tender, about 5 minutes. Mix in spinach and salt. Stir in feta cheese, cottage cheese and egg. Cook and stir until thickened, 5 to 10 minutes. Reduce heat to simmer.\nPreheat oven to 400 degrees F (200 degrees C).\nUnroll phyllo dough sheets one at a time on a flat surface. Brush with unsalted butter. Cut into strips approximately 5 inches wide. Place 1 tablespoon of the onion, spinach and feta mixture at one end of each dough strip. Fold the end of the strip over the filling so that it forms a triangle. Continue folding the strip in triangles until a small, triangular stuffed pastry remains. Brush with unsalted butter. Repeat with remaining phyllo dough.\nArrange stuffed triangles on a large baking sheet. Bake in the preheated oven 12 to 15 minutes, until golden brown. Serve warm.\n",
        "picture_link": "OChhWtXl95dh12N/J2KxPmhk9i1K7nK"
    },
    {
        "title": "Easy Red Velvet Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package non-instant chocolate pudding mix ADVERTISEMENT",
            "red food coloring, as desired ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPrepare cake according to package directions, substituting half of the water called for with buttermilk (approximately 1/2 cup). Stir in pudding mix and food coloring.\nPour into cake pan(s) and bake according to package directions.\n",
        "picture_link": "Il9gULMm5j/LODMVb9odbd3uFI1C3/e"
    },
    {
        "title": "Ricotta Fettuccine Alfredo with Broccoli",
        "ingredients": [
            "8 ounces fettuccini pasta ADVERTISEMENT",
            "2 cups fresh broccoli florets ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups skim milk ADVERTISEMENT",
            "2/3 cup part-skim ricotta cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nPlace broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nMelt the butter in a saucepan over medium heat. Add flour and cook for 1 minute, stirring constantly. Gradually add milk, stirring with a whisk until blended. Cook 15 minutes or until thick, stirring constantly. Stir in ricotta cheese, Parmesan cheese, salt, and pepper. Cook 5 minutes or until cheese melts. Stir in steamed broccoli and cooked pasta. Sprinkle with parsley.\n",
        "picture_link": "7KK5UxbxfLe2xZMqvJ12Inyg/m.U5XS"
    },
    {
        "title": "Soy Garlic Steak",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons crushed garlic ADVERTISEMENT",
            "1 1/2 pounds flank steak ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix vegetable oil, soy sauce, vinegar, ketchup, and crushed garlic. Place flank steak in a large resealable plastic bag. Pour the marinade over steak. Seal, and marinate in the refrigerator at least 3 hours.\nPreheat grill for high heat.\nOil the grill grate. Place steaks on the grill, and discard marinade. Cook for 5 minutes per side, or to desired doneness.\n",
        "picture_link": "NMLHV600TtbXPt6TLzLEWgwirLvmZ0u"
    },
    {
        "title": "Caramel Sauce",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large saucepan with water and bring to a boil over medium heat. Place the can of milk, unopened, in the boiling water. Cover and let simmer 3 hours, topping off water as needed and turning the can every half hour to prevent scorching. Carefully open can and serve.\n",
        "picture_link": "sJqDUA29ZKEePZKmijfljXFDuOXRpXi"
    },
    {
        "title": "Red Wine Flavored Beef",
        "ingredients": [
            "1 cup red wine ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "4 pounds beef roast ADVERTISEMENT",
            "1/2 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the red wine, water, and beef roast in a slow cooker. Season with dry onion soup mix.\nCover, and cook 5 hours on Low.\n",
        "picture_link": "O/EX.lH/vA3PMOs5fDRKzUHBxEYR77O"
    },
    {
        "title": "Grandma's Pear Preserves",
        "ingredients": [
            "6 cups peeled, cored, and sliced pears ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 (2 ounce) package powdered fruit pectin ADVERTISEMENT",
            "8 cups white sugar ADVERTISEMENT",
            "2 teaspoons ground allspice ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sterilize jars and lids in boiling water for at least 10 minutes. Let simmer while making jam.\nIn a large saucepan, combine pears, water, and lemon juice. Cover, and simmer for 10 minutes. Stir in pectin, and bring to a full boil. Stir in the white sugar, and continue boiling and stirring uncovered for 1 minute, until sugar is dissolved. Remove from heat, and stir in brown sugar, allspice, and nutmeg.\nQuickly fill jars to within 1/2 inch of the top. Wipe rims clean, and top with lids. Process jars in boiling water for 10 minutes to seal.\n",
        "picture_link": "eyVQVXAY2Q.2NSU7OzTl0t.NQjWy2ii"
    },
    {
        "title": "Lazy Katie's Taco Salad",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (8 ounce) bag corn tortilla chips ADVERTISEMENT",
            "1/2 head romaine lettuce - rinsed, dried, and chopped ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "3/4 cup taco sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium high heat, saute the ground beef for 5 to 10 minutes, or until well browned. Drain excess fat.\nCrumble tortilla chips on a large plate. Layer with the beef, lettuce, tomatoes, cheese, onion and taco sauce.\n",
        "picture_link": "81z9PHMKzp0Blmvfph0VopBVXtjL5hy"
    },
    {
        "title": "Honey Lime Tilapia",
        "ingredients": [
            "1/4 cup honey ADVERTISEMENT",
            "3 tablespoons lime juice ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound tilapia fillets ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 butternut squash - peeled, seeded and sliced ADVERTISEMENT",
            "1 bunch fresh asparagus spears, trimmed and chopped ADVERTISEMENT",
            "poultry seasoning ADVERTISEMENT",
            "1/2 cup mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix the honey, lime juice, and garlic. Season tilapia with salt and pepper, place in the bowl, and marinate 1 hour in the refrigerator.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\nArrange the squash and asparagus in the baking dish. Place tilapia on top of vegetables, and season with poultry seasoning. Discard remaining marinade.\nBake 20 minutes in the preheated oven, until vegetables are tender and fish is easily flaked. Sprinkle with mozzarella, and continue baking 5 minutes, or until cheese is lightly browned.\n",
        "picture_link": "W0WiIDA6nWfpYRsWkMrXf51F5BUmF26"
    },
    {
        "title": "Black Bean and Corn Pasta with Chicken",
        "ingredients": [
            "1 (16 ounce) package jumbo pasta shells ADVERTISEMENT",
            "1 cup fresh corn kernels ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "2 boneless chicken breast halves, cooked and cut into bite-sized pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet over low heat, cook corn and black beans, 2 minutes. Stir in the tomatoes, reserving their juice. Season with salt and pepper, and cook 2 minutes more. Pour in enough tomato juice to cover and season with hot pepper sauce and Worcestershire. Increase heat slightly, stir in chicken, and heat through, 3 to 5 minutes. Spoon over cooked pasta.\n",
        "picture_link": "/IDfAFi03wc5hoROjr.kdKN.3/PKWSm"
    },
    {
        "title": "Pumpkin Pecan Cheesecake",
        "ingredients": [
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup pumpkin butter ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pecans and 1/4 cup brown sugar; cut in butter or margarine with a pastry blender until mixture is crumbly. Set aside.\nBeat cream cheese at high speed of an electric mixer until smooth. Add 1/3 cup brown sugar; beat well. Add eggs one at a time, beating well after each addition. Stir in pumpkin butter. Pour mixture into crust.\nBake at 350 degrees F (175 degrees C) for 40 minutes.\nSprinkle pecan mixture over pie. Bake for 5 additional minutes, or until butter or margarine and sugar melt. Cool on a wire rack. Cover, and chill for at least 4 hours.\n",
        "picture_link": "nN7QvhWQZl08sBWhb/H8Fendz.znRE."
    },
    {
        "title": "Divine Summertime Chicken Sandwich",
        "ingredients": [
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "4 teaspoons dried dill weed, divided ADVERTISEMENT",
            "4 tablespoons minced garlic, divided ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 small tomato, diced ADVERTISEMENT",
            "1 leaf lettuce ADVERTISEMENT",
            "4 thick slices French bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the cream cheese, 2 teaspoons of dill, and 2 tablespoons of garlic. Set aside.\nMelt about half of the butter in a skillet over medium heat. Season chicken breast halves with remaining garlic and dill. Cook for about 8 minutes per side, or until the meat is firm and juices run clear. Remove from the pan, and set aside.\nSpread the remaining butter onto one side of the slices of bread, and toast in the skillet until golden. Spread the cream cheese onto the other sides of the bread, and make sandwiches with the chicken breasts, lettuce, and tomato.\n",
        "picture_link": "wHsgEl3y.NUHut81XyeHdSrfpAo.SWu"
    },
    {
        "title": "Ravishing Red Velvet Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs, room temperature ADVERTISEMENT",
            "1 teaspoon butter flavored extract ADVERTISEMENT",
            "4 tablespoons red food coloring ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 cup buttermilk, room temperature ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "Cream Cheese Frosting: ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, room temperature ADVERTISEMENT",
            "4 cups confectioners' sugar, sifted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round pans.\nBeat shortening and sugar until light and fluffy. Add eggs one at a time, mixing until fully incorporated. Stir in butter flavoring. Make a paste with food coloring and cocoa and add to the shortening mixture.\nMix buttermilk, salt, baking soda and vinegar; add to batter alternating with the flour mixture.\nDivide batter into prepared pans. Bake in preheated oven until cake springs back when touched lightly with a finger or tester comes out clean, 20 to 30 minutes. Cook completely on wire rack.\nTo Make Cream Cheese Frosting: beat butter and cream cheese with an electric mixer until smooth. Gradually beat in confectioners' sugar and 1 teaspoon vanilla. Mix until well blended.\n",
        "picture_link": "8jSa708cj7m.cq.TNXE6eyFH/fq2FkK"
    },
    {
        "title": "Southwest Dipping Sauce",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 teaspoons ketchup ADVERTISEMENT",
            "2 tablespoons cream-style horseradish sauce ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the mayonnaise, ketchup, horseradish, paprika, salt, oregano, black pepper and cayenne pepper. Store covered in the refrigerator until needed.\n",
        "picture_link": "eSo.yuFboLYF1T23MePsMFoQmfmgD9y"
    },
    {
        "title": "Easy Weeknight Tuna Pot Pie",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "2 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "1 (10 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nMelt the butter in a saucepan over medium heat. Add onions and cook until soft and translucent. Mix in the tuna and frozen vegetables, stirring often until the vegetables are heated through, 5 to 10 minutes. Stir in the cream of mushroom soup. Pour the tuna mixture into a 9 inch pie dish and sprinkle with shredded cheese.\nUnroll and separate the crescent rolls. Lay each crescent roll on top of the tuna mixture with the point facing inward, the rolls may overlap slightly. Bake until crescent rolls are golden brown and mixture is bubbly, 11 to 13 minutes. Let the pie sit for 5 to 10 minutes before cutting and serving.\n",
        "picture_link": "hI0hjmM..dt5X7AoaB8Ciadk6NS0dbK"
    },
    {
        "title": "Chinese Spareribs",
        "ingredients": [
            "3 tablespoons hoisin sauce ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon sake ADVERTISEMENT",
            "1 teaspoon rice vinegar ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1/2 teaspoon grated fresh garlic ADVERTISEMENT",
            "1/4 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "1 pound pork spareribs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow glass dish, mix together the hoisin sauce, ketchup, honey, soy sauce, sake, rice vinegar, lemon juice, ginger, garlic and five-spice powder. Place the ribs in the dish, and turn to coat. Cover and marinate in the refrigerator for 2 hours, or as long as overnight.\nPreheat the oven to 325 degrees F (165 degrees C). Fill a broiler tray with enough water to cover the bottom. Place the grate or rack over the tray. Arrange the ribs on the grate.\nPlace the broiler rack in the center of the oven. Cook for 40 minutes, turning and brushing with the marinade every 10 minutes. Let the marinade cook on for the final 10 minutes to make a glaze. Finish under the broiler if desired. Discard any remaining marinade.\n",
        "picture_link": "e4jQd/6KhM/BWdTt/1iiHgr8v4WYEWe"
    },
    {
        "title": "Oatmeal Apple Muffins",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "3/4 cup fat free half-and-half ADVERTISEMENT",
            "3 tablespoons canola or olive oil ADVERTISEMENT",
            "1/3 cup Splenda or sugar ADVERTISEMENT",
            "1 medium apple, peeled and chopped ADVERTISEMENT",
            "3/4 cup dried cranberries or raisins ADVERTISEMENT",
            "1/2 cup walnut pieces ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup quick-cooking oats ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees.\nIn a bowl, beat together egg, half-and-half, oil, and Splenda (or sugar). In a large bowl, combine remaining ingredients. Fold egg mixture into dry mixture, just to moisten.\nFill non-stick muffin tins 3/4 full. Bake 15 to 20 minutes.\n",
        "picture_link": "ep8R/bh4cz5qC5EXhiyf3RiBRnXXc2C"
    },
    {
        "title": "Mini Reubens",
        "ingredients": [
            "1 (1 pound) loaf cocktail rye bread ADVERTISEMENT",
            "1 cup thousand island dressing ADVERTISEMENT",
            "1 1/2 pounds deli sliced corned beef ADVERTISEMENT",
            "1 (16 ounce) jar sauerkraut, rinsed and well drained ADVERTISEMENT",
            "1 pound sliced Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler.\nArrange cocktail rye slices on a baking sheet. Top each one with about 2 teaspoons of thousand island salad dressing, then fold about 1/2 slice of corned beef to fit the bread, and lay over the dressing. Place a small amount of sauerkraut over the meat, then top with 1/4 slice of the Swiss cheese, or a slice about as big as the bread.\nBroil for 3 to 5 minutes, until cheese is melted. Serve warm.\n",
        "picture_link": ".57NI4oz93fmjxKoj.Oqvl2vrITnyPG"
    },
    {
        "title": "Scrumptious Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "4 slices Cheddar cheese ADVERTISEMENT",
            "6 ounces dry bread stuffing mix ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nPlace the chicken breasts in a 9x13 inch baking dish. On top of each breast place a large spoonful of soup and a slice of cheese. Crush the stuffing mix and sprinkle on top of the cheese, then drizzle with the melted butter or margarine. Bake in the preheated oven for 45 minutes to 1 hour (don't overcook the chicken!). Let cool and serve.\n",
        "picture_link": "7E4Y0POta1Hayry3LHw91kH6Kzc060W"
    },
    {
        "title": "Jalapeno Bread I",
        "ingredients": [
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "6 tablespoons fresh chopped jalapeno peppers ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1/2 tablespoon active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add ingredients according to the bread machine manufacturer's directions.\nSet your machine on regular basic bread.\n",
        "picture_link": "wwza7FJuUkQxZcyOQDdqGOyAPPq8mv6"
    },
    {
        "title": "Minute Tomato Soup with Tortellini",
        "ingredients": [
            "2 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 1/2 ounces fresh tortellini pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare soup in a medium saucepan according to package directions. Add the oregano, basil, parsley and ground black pepper, stirring well, over medium heat. Simmer for 5 minutes, reduce heat to low and add the tortellini. Continue to simmer for 5 more minutes, or until tortellini is cooked.\n",
        "picture_link": "WTyf69/vlkJGMQ0DXC1y1M3s6..HQzG"
    },
    {
        "title": "Carrot Cake II",
        "ingredients": [
            "6 egg whites ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "1 cup applesauce ADVERTISEMENT",
            "1/2 cup skim milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "2 cups shredded carrots ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9X13 inch pan with non-fat cooking spray.\nIn large mixing bowl, beat egg whites. Slowly beat in sugar, then applesauce, skim milk, and vanilla. Stir in cloves, nutmeg, cinnamon, baking soda, and flour. Stir in, one ingredient at a time, pineapple (with juice), carrots, walnuts, and raisins. Pour into the prepared pan.\nBake for 35 - 40 minutes in the preheated oven. It is done when toothpick inserted in center comes out clean.\n",
        "picture_link": "WdOI2El0XWzjjCvv4i4qX1eYIG2a8pW"
    },
    {
        "title": "Hearty Meatball Soup II",
        "ingredients": [
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "2 cups chopped carrot ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes, with juice ADVERTISEMENT",
            "1 (14.5 ounce) can green beans, drained ADVERTISEMENT",
            "3 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 cup uncooked alphabet pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium high heat, combine the onion soup mix, carrots and water and bring to a boil, cooking until carrots are tender. Add the tomatoes, green beans, chicken broth and mixed vegetables, and simmer for 15 minutes.\nMeanwhile, in a large bowl, combine the beef, egg, bread crumbs, Parmesan cheese and ground black pepper. Roll into tiny, bite size meatballs and add to the soup.\nSimmer for another 20 minutes, then add the pasta. Simmer for another 15 minutes, or until meatballs and pasta are fully cooked.\n",
        "picture_link": "dQHw.0jYG6cxh.9QpOumhdusKkhYix."
    },
    {
        "title": "Rum Cake II",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 teaspoon rum flavored extract ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 or 10 inch tube pan.\nCream 1 cup of the butter and 2 cups of the white sugar together. Add eggs one at a time mixing well after each one.\nSift the flour, baking powder, baking soda, and salt together and add alternately with the buttermilk to the egg mixture. Stir in the vanilla and rum extracts. Pour batter into prepared pan.\nBake at 350 degrees F (175 degrees C) for 1 hour. Remove cake from oven and pour all of the Rum Butter glaze over cake while still warm. Leave cake in pan for 2 hours before removing to serving dish.\nTo Make Butter Rum Glaze: Melt the remaining 1 cup of the butter and 1 cup of white sugar over low heat. Remove from heat and stir in rum. Use immediately to glaze cake.\n",
        "picture_link": "R5b.wpr.ZaXy8xBSdEvsMX5TkCKhJJ2"
    },
    {
        "title": "Asian Avocado",
        "ingredients": [
            "1 avocado ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together garlic, ginger, and soy sauce; set aside for five minutes to allow the flavors to blend. Cut the avocado in half, and discard the pit; divide the sauce between the avocado halves. Eat with a spoon!\n",
        "picture_link": "KxM3ihqtycM2B/.HWefsJOL2eBugOTC"
    },
    {
        "title": "Santa's Favorite Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 1/3 cups buttermilk ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (9 ounce) package yellow cake mix ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 tablespoons red food coloring ADVERTISEMENT",
            "1 teaspoon cider vinegar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup margarine, softened ADVERTISEMENT",
            "2 (16 ounce) packages confectioners' sugar ADVERTISEMENT",
            "2 teaspoons peppermint extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round cake pans.\nIn a large bowl, combine white cake mix, 3 egg whites, 1 1/3 cups buttermilk, and 2 tablespoons vegetable oil. Mix with an electric mixer for 2 minutes on high speed. In a separate bowl, combine yellow cake mix, 1/2 cup buttermilk, 1 egg, cocoa, red food coloring, and vinegar. Use an electric mixer to beat for 2 minutes on high speed.\nSpoon white batter alternately with red batter into the prepared cake pans. Swirl batter gently with a knife to create a marbled effect.\nBake in preheated oven for 22 to 25 minutes, or until a wooden pick inserted into the centers comes out clean. Let cool in pans for at least 10 minutes before turning out onto a wire rack to cool completely.\nIn a large bowl, beat cream cheese and margarine until smooth. Gradually blend in sugar until incorporated and smooth. Stir in peppermint extract. Spread peppermint cream cheese frosting between layers, and on top and sides of cake.\n",
        "picture_link": "asvmzE.jAmHhR0BkYa5m4SroYXrAiMO"
    },
    {
        "title": "Chef John's Baked Mushroom Risotto",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "3 cups diced mushrooms ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 yellow onion, diced ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 cup carnaroli rice ADVERTISEMENT",
            "2 cups chicken broth, divided ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "2 tablespoons heavy whipping cream ADVERTISEMENT",
            "1/2 cup finely grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in large, oven-proof skillet over medium-high heat. Add mushrooms; season with salt, and cook and stir mushrooms until brown. They will begin browning after the moisture evaporates.\nReduce heat to medium and stir in onion. Sprinkle with black pepper and cayenne pepper. Cook and stir until onions are translucent and soft.\nPour rice into skillet and stir until each rice grain is coated with butter. Season with salt.\nPour 1 cup chicken broth into the rice mixture. Raise heat to medium-high and cook, stirring rice until liquid is completely absorbed by the rice.\nPour another cup chicken stock into the rice and stir until mixture comes to a simmer.\nBake in preheated oven until grains are almost tender but still slightly firm, about 15 minutes. Transfer skillet to stovetop. Season with more salt, if necessary.\nCombine the remaining 1/2 cup chicken broth and cream; pour into the skillet. Cook on medium heat, stirring constantly until rice is tender, 1 or 2 minutes. Remove skillet from heat.\nDrizzle 2 tablespoons cream over rice. Add the grated Parmigiano-Reggiano and chives; stir. Serve immediately.\n",
        "picture_link": "jaCUSBaCkwJ9uGbx/uhmG2g2xOtZfP6"
    },
    {
        "title": "Impossible Coconut Pie I",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1/2 cup baking mix ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch pie plate.\nCombine milk, sugar, biscuit mix, eggs, butter or margarine, and vanilla in blender container. Cover, and blend on low speed for 3 minutes. Pour into prepared pie plate. Let stand about 5 minutes. Sprinkle with coconut.\nBake for 40 minutes. Serve warm.\n",
        "picture_link": "Cy9igim9vtVitLIga17uZPvZxYtIksy"
    },
    {
        "title": "Slow Cooker Cheesy Potatoes",
        "ingredients": [
            "1 (32 ounce) package frozen Southern-style hash brown potatoes ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed Cheddar cheese soup ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 (2.8 ounce) can French fried onions, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease your slow cooker with cooking spray or shortening. In a large bowl, stir together the hash browns, cheese soup, evaporated milk, and half of the French fried onions. Pour into the slow cooker. Cover, and cook on High for 4 hours, or Low for 8 hours. Top with remaining onions just before serving.\n",
        "picture_link": "o2qoix0JiE86.KnFr54KVJaVuOCeQOO"
    },
    {
        "title": "Minute Chocolate Mug Cake ",
        "ingredients": [
            "1 large egg ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/8 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon unsweetened shredded coconut ADVERTISEMENT",
            "2 tablespoons toasted sliced almonds ADVERTISEMENT",
            "1 1/2 tablespoons miniature semisweet chocolate chips ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon unsweetened cocoa powder, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk egg, sugar, salt, 2 tablespoons cocoa powder, butter, vegetable oil, and vanilla extract together in a bowl until smooth. Stir coconut, almonds, and chocolate chips into the mixture; whisk in milk.\nPlace flour into a small bowl or measuring cup and stir baking powder into flour with a mini whisk or fork. Pour flour mixture over batter and whisk just until you can't see visible flour.\nDivide batter evenly between 2 coffee cups. Gently tap the cups on a work surface to eliminate air bubbles.\nPlace cups into microwave oven, one at a time. Microwave each cup on High for 45 seconds. Nothing will happen in the first 30 seconds; in the last 10 to 15 seconds, batter will begin to rise in the cup. Cooked cake will collapse after microwaving. Remove from oven and let cool 2 to 3 minutes.\nLightly dust each serving with confectioners' sugar and 1/8 teaspoon cocoa. Place each coffee cup onto a saucer and serve.\n",
        "picture_link": "T5hf8.7xiAKohNz3K9DukYRuRULU.1m"
    },
    {
        "title": "Tomato Cucumber Salad with Mint",
        "ingredients": [
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 large cucumbers, peeled, seeded, and cut into 1/2-inch slices ADVERTISEMENT",
            "3 large tomatoes, seeded and chopped ADVERTISEMENT",
            "2/3 cup chopped red onion ADVERTISEMENT",
            "1/2 cup chopped fresh mint ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine vinegar, sugar, and salt. Mix in cucumbers, and marinate 1 hour, stirring occasionally.\nGently toss tomatoes, onion, mint, and olive oil with the marinated cucumbers. Season with salt and pepper.\n",
        "picture_link": "ZdoDsJDvg7Ug4EWbBWtQSMfz6q1NDZG"
    },
    {
        "title": "Strawberry Cream Cheese Cobbler",
        "ingredients": [
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups fresh strawberry halves ADVERTISEMENT",
            "1 (4 ounce) package cream cheese, cut into small pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPour melted butter into the bottom of a 9x13-inch glass baking dish.\nMix milk, flour, sugar, baking powder, and salt together in a small bowl; pour over the butter in the baking dish. Arrange strawberry halves in a layer into the baking dish. Dot the strawberries with the cream cheese pieces.\nBake in preheated oven until top is golden brown and edges are bubbling, 30 to 45 minutes.\n",
        "picture_link": "wtF.wblcNARd6NiQV1NW4aSwlGig02y"
    },
    {
        "title": "No Sugar Oatmeal Cookies",
        "ingredients": [
            "2 cups rolled oats ADVERTISEMENT",
            "3 ripe bananas, mashed ADVERTISEMENT",
            "1/3 cup applesauce ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "1/4 cup almond milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir oats, bananas, applesauce, raisins, almond milk, vanilla extract, and cinnamon together in a bowl until evenly mixed; drop by the spoonful onto a baking sheet.\nBake in the preheated oven until the edges are golden, 15 to 20 minutes.\n",
        "picture_link": "HYU0ZzgDkmC6u.IJjtMoPrK8VMzVhAS"
    },
    {
        "title": "Spaghetti Sauce I",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1/4 tablespoon dried basil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute the beef and onion. Drain.\nStir in the tomato sauce, butter and sugar. Add the oregano, basil, salt, pepper and garlic powder to taste. Cook over low heat until hot.\n",
        "picture_link": "j.JbYc7Qamll.OIHV4DupfWrx2UNsEu"
    },
    {
        "title": "Beer Chops I",
        "ingredients": [
            "1 onion, sliced ADVERTISEMENT",
            "2 pork chops butterfly cut ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange onion slices on bottom of slow-cooker. Cut butterfly chops in half and place on top of onions. Pour in beer and add chicken bouillon cubes. Cover and cook and low 6 to 8 hours.\n",
        "picture_link": "WZa28R5f3zAgdJ7VEFgvakbSA7vwzBm"
    },
    {
        "title": "Spaghetti Salad III",
        "ingredients": [
            "1 pound spaghetti ADVERTISEMENT",
            "1 (16 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 cucumber, peeled and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook spaghetti in boiling salted water until al dente. Rinse in cool water, drain.\nIn a large bowl place chopped tomatoes, green bell pepper, onion and cucumber. Add Cheddar cheese, and salad seasoning.\nAdd cooled pasta to large bowl with vegetables and pour salad dressing over top. Toss well to coat. Chill for several hours before serving.\n",
        "picture_link": "aRkurMeHr.UtIlYLIbbtbvZ1dREkhjm"
    },
    {
        "title": "Vegan Split Pea Soup II",
        "ingredients": [
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 cup yellow split peas ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan. Cook and stir carrot, onion, celery and curry for about 5 minutes. Add the water, peas and salt. Simmer, stirring occasionally, for 45 to 50 minutes, or until very thick.\n",
        "picture_link": "BMdqnaC/FBUzntHuH77ExlADdCbuLnG"
    },
    {
        "title": "Angel Hair Pasta Salad",
        "ingredients": [
            "2 (8 ounce) packages angel hair pasta ADVERTISEMENT",
            "1/2 pound cooked bay shrimp ADVERTISEMENT",
            "3/4 cup chopped green onions ADVERTISEMENT",
            "1 1/2 cups ranch-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the pasta according to package directions; drain and rinse under cold water.\nMix together the pasta, shrimp, green onions and ranch dressing, then carefully work the shrimp into the pasta with your hands. (Note: As the salad sits, it will absorb some of the dressing; add a little dressing right before serving).\n",
        "picture_link": "a3tn45oKraZJxjVeJtr0iGIbI4aWPaS"
    },
    {
        "title": "Herbed Chicken Pasta",
        "ingredients": [
            "1 pound uncooked linguine ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 1/2 cups fresh sliced mushrooms ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into 1 inch pieces ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups chopped tomatoes ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in about 4 quarts of boiling salted water until al dente. Drain.\nMeanwhile, heat oil in a large nonstick skillet over medium high heat until hot. Add mushrooms, onions, and garlic; saute 2 minutes. Add chicken, salt, basil, and pepper; saute 5 minutes, or until chicken is done. Add chopped tomato, and saute an additional 2 minutes.\nServe chicken herb sauce over pasta. Sprinkle with Parmesan cheese.\n",
        "picture_link": "afZJdecFNXTXnrO8BLekSs76rFN0eii"
    },
    {
        "title": "Tartar Sauce II",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1/3 cup sweet pickle relish ADVERTISEMENT",
            "1 tablespoon minced capers ADVERTISEMENT",
            "1 hard-cooked egg, chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "salt and white pepper to taste ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, mix together mayonnaise, sweet pickle relish, capers, and egg. Season to taste with salt and white pepper. Add a dash of Worcestershire sauce and a dash hot pepper sauce. Stir. Chill.\n",
        "picture_link": "9doskvlBhy5wqIAqnyPSo254kULF2e6"
    },
    {
        "title": "Lemon Chicken Soup II",
        "ingredients": [
            "3 quarts chicken broth ADVERTISEMENT",
            "5 cups chopped cooked chicken breast ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "3 lemons, juiced ADVERTISEMENT",
            "1 bunch spinach, rinsed and chopped ADVERTISEMENT",
            "2 large carrots, chopped ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, combine chicken broth, cooked chicken, rice, lemon juice, spinach, carrots and pepper. Bring to a boil, then reduce heat and simmer until rice and greens are tender, 20 minutes.\n",
        "picture_link": "pUGqfAi38p.9mzISW2I1T0EcRFFKAwu"
    },
    {
        "title": "Banana Cream Pie V",
        "ingredients": [
            "1 (9 inch) deep dish pie crust, baked and cooled ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "4 egg yolks, beaten ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 large banana, sliced ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan or double boiler combine sugar, cornstarch and salt. Mix well, then stir in milk and egg yolks. Whisk until all ingredients are thoroughly combined. Cook over medium heat, stirring constantly, until mixture is thickened. Remove from heat and stir in butter and 1 tablespoon vanilla.\nPreheat oven to 400 degrees F (200 degrees C.) Pour half of custard into baked pie shell. Cover with sliced banana. Spread remaining custard over banana layer.\nIn a large glass or metal mixing bowl, beat egg whites and cream of tartar until foamy. Gradually add white sugar, continuing to beat until stiff peaks form. Beat in vanilla extract. Spread meringue over pie, covering completely.\nBake in the preheated oven for 10 to 15 minutes, or until lightly browned.\n",
        "picture_link": "FLWQ0nH3Hlep4gdZqew7KZg468e/feC"
    },
    {
        "title": "Casa Dressing",
        "ingredients": [
            "2/3 cup mayonnaise ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, whisk together the mayonnaise, milk, and lime juice. Season with cumin, salt, and pepper. Stir in cilantro just before serving.\n",
        "picture_link": "3/VqH36givHCbKOBQqbw/1QpSN3Wm.q"
    },
    {
        "title": "Pasta Pascal",
        "ingredients": [
            "5 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "4 roma (plum) tomatoes, diced ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pound angel hair pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium skillet over medium-high heat, saute garlic in oil 1 to 2 minutes. Stir in onion and cook 2 minutes more. Stir in tomatoes, oregano, basil, salt and pepper. Reduce heat to medium-low and let simmer.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 3 to 5 minutes or until al dente; drain.\nToss hot pasta with tomato mixture. Serve.\n",
        "picture_link": "/PDO/28iSqmQiBkQG0qldlO7TzeiC9K"
    },
    {
        "title": "Chocolate Chip Cookies for Special Diets",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup granulated artificial sweetener ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 1/8 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl, cream together the butter and sugar substitute. Mix in water, vanilla, and egg. Sift together the flour, baking soda, and salt; stir into the creamed mixture. Mix in the chocolate chips and pecans. Drop cookies by heaping teaspoonfuls onto a cookie sheet.\nBake in the preheated oven for 10 to 12 minutes. Remove from cookie sheets to cool on wire racks. These cookies freeze well.\n",
        "picture_link": "BT6p8dEaaMpUNOGguUEABX/7/vrBssi"
    },
    {
        "title": "Crepes with Spinach, Bacon and Mushroom Filling",
        "ingredients": [
            "1 recipe Basic Crepes ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2/3 cup chicken broth ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare Basic Crepes recipe according to recipe directions. Separate with wax paper and keep warm until ready to serve.\nPlace bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble and set aside. Reserve about 1 tablespoon drippings, add 1 tablespoon butter, and saute mushrooms.\nIn a separate saucepan, melt 3 tablespoons butter over medium heat. Whisk in 1/4 cup flour, stirring constantly, until a smooth paste is formed. Gradually stir in 1 cup milk, stirring constantly until a smooth thick gravy is formed. Add bacon, mushrooms, spinach, parsley, Parmesan cheese, salt and pepper. Let cook until somewhat thick, about 10 minutes.\nIn saucepan bring broth to a boil. In a small bowl, whisk together eggs and lemon juice. Temper eggs and broth together whisking constantly so as to cook, but not to scramble the eggs. (Cooking eggs to 170 degrees F). Again, salt and pepper to taste.\nFill each crepe with spinach and meat filling, roll up, and top with warm egg sauce.\n",
        "picture_link": "mcU9kRHVdVT2eV6LLPQULq.4Qlv.BmC"
    },
    {
        "title": "Orange Spiced Chicken",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "2 tablespoons raisins ADVERTISEMENT",
            "4 (8 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Marinate: Combine soy sauce, orange juice, sugar, garlic, ginger and raisins in a nonporous glass dish or bowl. Mix well, then add chicken and turn to coat. Cover dish or bowl and refrigerate to marinate for 2 to 3 hours, turning once or twice.\nPreheat oven to 400 degrees F (200 degrees C).\nPlace chicken in a 9x13 inch baking dish and pour marinade evenly over all.\nBake in the preheated oven for 45 minutes, basting often.\n",
        "picture_link": "SxE.OC3jsRMWd4zrMjNPsy3jeIfh1Ny"
    },
    {
        "title": "Pasta and Herbs",
        "ingredients": [
            "1/2 pound uncooked pasta ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1 teaspoon ground savory ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons sliced black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to the package directions.\nMeanwhile, melt the butter or margarine over medium heat. Stir in the garlic and cook for a couple of minutes. Stir in the herbs.\nDrain the pasta and transfer to a large bowl. Add the butter mixture and toss. Season with salt and pepper. Sprinkle with black olive slices and serve.\n",
        "picture_link": "w6AgnOgbqzhzCtEnD/N07h0ghPSqtmq"
    },
    {
        "title": "Chow Mein Clusters",
        "ingredients": [
            "2 cups butterscotch chips ADVERTISEMENT",
            "2 cups chow mein noodles ADVERTISEMENT",
            "1 cup salted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a double boiler over simmering water, melt the butterscotch morsels, stirring frequently until smooth. Remove from heat, and stir in the chow mien noodles and peanuts.\nDrop by teaspoonfuls onto waxed paper. Refrigerate until firm.\n",
        "picture_link": "xQGySc3OUvB6jRz6II7d0n2Ib36e5s2"
    },
    {
        "title": "Perogies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2/3 cup cold water ADVERTISEMENT",
            "1 pound bacon ADVERTISEMENT",
            "5 pounds baking potatoes ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 pound bacon ADVERTISEMENT",
            "1 (32 ounce) jar sauerkraut - drained, rinsed and minced ADVERTISEMENT",
            "3 tablespoons sour cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Dough: In a medium bowl combine the flour, salt, egg and water. Mix all together to form dough; cover bowl and set aside.\nTo Make Potato Filling: Place potatoes in a large pot. Add water to cover, bring to a boil, and boil for 25 to 35 minutes or until tender. Remove potatoes from water and mash. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and stir into mashed potatoes. Stir in cheese and season with salt and pepper.\nTo Make Sauerkraut Filling: Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and place in a medium bowl. Stir in sauerkraut, then sour cream. Mix well.\nRoll reserved dough out on a floured surface. Cut circles out of dough, using a small round container. Place a spoonful of potato or sauerkraut filling in the center of each circle and fold over, pinching edges together to seal. Bring a large pot of lightly salted water to a boil; drop perogies in boiling water and cook for 4 to 5 minutes, or until they float.\n",
        "picture_link": "9U3eGgBSiXOarPYQZ5fu707uuwdP3kK"
    },
    {
        "title": "Bar-B-Q",
        "ingredients": [
            "3 pounds lean ground beef ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 (10.5 ounce) can condensed French onion soup ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "10 hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, brown the ground beef; drain fat.\nPour in tomato and French onion soups. Fill each can a quarter full with water to rinse the cans out. Pour into meat mixture. Add ketchup and brown sugar. Mix thoroughly.\nLet simmer for 30 minutes. Serve on hamburger buns.\n",
        "picture_link": "Yzj.cJ.4zXDljrW4va2c4rT0zgNDEWK"
    },
    {
        "title": "Bruschetta with Shallots",
        "ingredients": [
            "12 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 tablespoons minced shallots ADVERTISEMENT",
            "1 cup chopped fresh basil leaves ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1/3 cup extra virgin olive oil ADVERTISEMENT",
            "3 cloves garlic, cut into slivers ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "1 (1 pound) loaf Italian bread, cut into 1/2 inch slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the roma tomatoes, minced garlic, shallots, basil, lemon juice, salt, pepper and 1/3 cup olive oil.\nPlace the slivered garlic and 1/4 cup olive oil in small saucepan over medium heat. Slowly cook and stir 2 to 3 minutes. Discard garlic.\nToast the bread slices, and brush with the olive oil heated with garlic. Top slices with the roma tomato mixture.\n",
        "picture_link": "FrSRIoksqW98ctqv7eNvsNXKO0bMjNK"
    },
    {
        "title": "Spider Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 pound black shoestring licorice ADVERTISEMENT",
            "1 (16 ounce) can white frosting ADVERTISEMENT",
            "48 pieces candy corn ADVERTISEMENT",
            "48 cinnamon red hot candies ADVERTISEMENT",
            "1/4 cup orange decorator sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare cupcakes according to package directions. Let cool completely.\nCut licorice into 3 inch sections. Working with one or two cupcakes at a time, so the frosting doesn't set before decorating, frost the cupcakes with the white frosting. Insert licorice pieces into the outer edges of the cupcakes to make the legs of the spider, 3 legs on each side (4 takes up too much space). Place two pieces of candy corn on the front of the cupcake for fangs and use two red hots as eyes. Sprinkle with decorator sugar. Repeat with remaining cupcakes.\n",
        "picture_link": "lh1p3i/ObtddwotnFGJkEuh.eN85Iqq"
    },
    {
        "title": "Kolachky",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, room temperature ADVERTISEMENT",
            "2 cups unsalted butter, softened ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 pound chopped walnuts ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 (12 ounce) can poppyseed filling ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1/2 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together cream cheese and butter until well blended. I like to use my hands, but you can also use a wooden spoon. Mix in the flour 1 cup at a time. As the dough becomes stiff, turn it out onto the counter and knead in flour until it is no longer sticky. Continue to knead the dough for 5 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Crush the walnuts to a fine consistency in a food processor. Stir in the egg and honey. On a well floured surface, roll the dough out to 1/4 inch thickness. Cut the dough into 3x3 inch squares. Place a teaspoon of filling in the center of each square. Use walnut for some and poppyseed for the rest. Roll the squares up and seal the edges. These can also be formed into triangles. Place the cookies 2 inches apart onto ungreased cookie sheets. Brush with egg white.\nBake for 15 to 17 minutes in the preheated oven, or until lightly browned. When cool, dust with confectioners' sugar.\n",
        "picture_link": "UFKU/pgWE2ek7N34tHAxLStzgYt7GzG"
    },
    {
        "title": "Prosciutto and Parmesan Pinwheels",
        "ingredients": [
            "1 (17.5 ounce) package frozen puff pastry sheets, thawed ADVERTISEMENT",
            "5 ounces prosciutto, thinly sliced ADVERTISEMENT",
            "5 ounces Parmesan cheese, thinly sliced ADVERTISEMENT",
            "2 teaspoons prepared Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a baking sheet with nonstick oil spray.\nRoll the thawed pastry out onto a flat surface. Spread Dijon mustard to taste on the pastry sheets. Cover pastry with a layer of prosciutto, then cheese. Roll the sheets, beginning at the long side. Cut into 1 inch thick sections. Arrange the sections on the prepared baking sheet.\nBake 10 to 12 minutes.\n",
        "picture_link": "4PA.mb0ZKuKVV0AV2LhSEUcwqfn1Oz6"
    },
    {
        "title": "Cincinnati-Style Chili",
        "ingredients": [
            "8 ounces spaghetti ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (12 ounce) package frozen burger-style crumbles ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 cup tomato sauce ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 tablespoon light brown sugar ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "1 cup kidney beans, drained and rinsed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large frying pan. Saute onion until tender. Mix in burger-style crumbles and garlic; cook until the crumbles have browned.\nStir in tomato sauce, water, chopped tomatoes, vinegar, chili powder, cinnamon, paprika, allspice, light brown sugar, cocoa, and hot sauce. Heat over medium-high heat until the mixture begins to boil. Reduce heat to low, cover, and simmer 15 to 20 minutes until sauce thickens.\nWhile the sauce is thickening, bring a large pot of salted water to boil; place spaghetti in the water and bring it to a boil again. Cook until al dente. Drain well.\nStir beans into the chili and mix lightly.\nSpoon cooked spaghetti into bowls and top with chili. Sprinkle with cheese if desired.\n",
        "picture_link": "xhZpmvyb8GdGt4HBV8ZzdotKeOjHl3O"
    },
    {
        "title": "White Fruit Cake",
        "ingredients": [
            "1 1/2 cups candied pineapple chunks ADVERTISEMENT",
            "3 cups golden raisins ADVERTISEMENT",
            "1 1/2 cups candied cherries ADVERTISEMENT",
            "1 cup dried currants ADVERTISEMENT",
            "2 ounces candied orange peel ADVERTISEMENT",
            "2 ounces candied citron peel ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "2 cups butter ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "8 eggs, separated ADVERTISEMENT",
            "4 cups pecans, chopped ADVERTISEMENT",
            "3 cups sifted all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop pineapple, raisins, and cherries. Combine chopped fruit with currants, orange peel, and citron; soak in orange juice overnight.\nPreheat oven to 275 degrees F (135 degrees C). Place a small pan of water in the oven. Line one 5x9 inch loaf pan and two 3x8 inch loaf pans with parchment or doubled waxed paper.\nIn a large bowl, cream butter and confectioner's sugar. Stir in beaten egg yolks. Stir in fruit, juice, and pecans. Mix in sifted flour.\nIn a clean bowl, beat the egg whites to peaks. Fold into batter. Fill pans 2/3 full.\nBake for 2 to 2 1/2 hours until golden brown, or until toothpick comes out clean when inserted.\n",
        "picture_link": ".qw0.D71KAx.tI6kYWAOeGy/R3G9IWK"
    },
    {
        "title": "No Bake Fudge Cookies",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "3 cups quick cooking oats ADVERTISEMENT",
            "6 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine white sugar, milk, and butter in a large saucepan; bring to boil for 1 minute.\nRemove saucepan from heat and add peanut butter, oats, cocoa, vanilla, and raisins.\nStir well. Drop by teaspoon onto waxed paper. Let sit one hour.\n",
        "picture_link": "ePHEYtQN2bPHxRJprhBKiPETbDHUiR."
    },
    {
        "title": "Pineapple Zucchini Bread",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 cup grated zucchini ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon corn syrup ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F (175 degrees C). Grease and flour bottom only of a 9x5 inch loaf pan.\nIn large bowl, cream brown sugar and margarine until light and fluffy. Reserve 1 tablespoon pineapple juice. Stir in pineapple, zucchini, and eggs. Add flour, baking soda, cinnamon, salt, and allspice; blend well. Fold in nuts. Spread evenly in prepared pan.\nBake for 60 to 70 minutes, or until toothpick inserted in center comes out clean. Cool 10 minutes, and then remove from pan.\nTo Make Glaze: Combine confectioners' sugar, reserved pineapple juice, corn syrup and 1/4 teaspoon ground cinnamon. Mix until smooth, and spoon over warm loaf. Cool completely on wire rack. Wrap and store in refrigerator.\n",
        "picture_link": "g8Oda/pmfEw7R9YpzUM9kyQYkJ8ICxC"
    },
    {
        "title": "Simple Banana Bread",
        "ingredients": [
            "4 ripe bananas, mashed ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 8x4 inch loaf pan and set aside.\nIn a large bowl, sift together the flour, baking powder, and salt. Set aside.\nIn another bowl, mash the bananas and stir in the eggs and sugar. Stir in the flour mixture and mix until just combined, then fold in the chopped nuts (optional). Pour the batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 55 to 65 minutes or until bread tests done. Remove from oven and cool on a rack for 10 minute, then remove from pan and cool completely. Slice and serve.\n",
        "picture_link": "8aEU5Q2RvnJB9SLUAk4z5JyhxBIsjvS"
    },
    {
        "title": "Monster Cookies V",
        "ingredients": [
            "9 cups rolled oats ADVERTISEMENT",
            "4 teaspoons baking soda ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup candy-coated milk chocolate pieces ADVERTISEMENT",
            "1 cup peanuts ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 1/2 cups packed brown sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "2 1/2 cups peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together oatmeal, baking soda, chocolate chips, M & M's , and peanuts. Set aside.\nIn a separate bowl, mix together white sugar, brown sugar, butter or margarine, vanilla, eggs and peanut butter.\nCombine the two mixes. Wet your hands. Roll into 1 inch balls.\nBake on a greased cookie sheet for 10 to 12 minutes.\n",
        "picture_link": "mnRhZ2ajg1Cqp8kDaLtb/uxUsm0JJ5S"
    },
    {
        "title": "Poke Cake I",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (3 ounce) package fruit flavored Jell-O® mix ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 cup ice water ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch baking pan.\nCombine cake mix, pudding mix, eggs, 1 cup water and the vegetable oil and blend well. Beat at the medium speed of an electric mixer for 4 minutes. Pour batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 45 to 50 minutes or until the cake springs back when lightly touched. Let cake cool in pan for 15 minutes.\nMeanwhile, dissolve the gelatin in the boiling water, then add the cold water.\nPoke holes in the warm cake with a fork at 1/2 inch intervals. Pour gelatin over cake. Chill cake for 3 to 4 hours then frost with whipped topping. Keep cake refrigerated.\n",
        "picture_link": "fK4GKDxVbgDfnH/CNevAW2BM25dM9Fa"
    },
    {
        "title": "Sara's Pumpkin Pie",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 1/2 cups pumpkin puree ADVERTISEMENT",
            "1 2/3 cups evaporated milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nCombine the sugar, salt, cinnamon, nutmeg, ginger, allspice, cloves, pumpkin puree, evaporated milk and eggs; blending until smooth. Pour batter into the prepared unbaked pie shell.\nBake at 425 degrees F (220 degrees C) for 15 minutes then lower oven temperature to 350 degrees F (175 degrees C). Continue to bake for about another 40 minutes or until pie is firm.\n",
        "picture_link": "axFkMqRUwCEtV8lOQXmFIYXAltutiam"
    },
    {
        "title": "Spicy Red Snapper",
        "ingredients": [
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves crushed garlic ADVERTISEMENT",
            "1/2 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "1 tablespoon minced capers ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 (6 ounce) fillets red snapper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, heat olive oil. Add onion, garlic, red pepper and capers. Saute over medium heat until onion is soft.\nAdd the tomatoes with juice, and the wine. Reduce heat to low and simmer. Break up the tomatoes with a spoon as the sauce cooks.\nOnce sauces begins to thicken add the snapper fillets and push them down into the pan. Cover and cook over low heat until the fish flakes with a fork, about 15 to 20 minutes.\n",
        "picture_link": "jn2nctauzY23.Jg4H.H.r9pyoo9Gf2u"
    },
    {
        "title": "Better Butter Cookies",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 tablespoons vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSift together the flour, and baking soda, set aside. In a medium bowl, cream the white sugar and brown sugar with the butter. Stir in the eggs, one at a time, then the vanilla and peanut butter. Add the dry ingredients to the creamed mixture and stir until combined. Finally, stir in the nuts.\nDrop by heaping teaspoonfuls onto cookie sheets. Bake for 12 to 15 minutes in the preheated oven. Cool on wire racks.\n",
        "picture_link": "ieZIQHo.OEygtR9dVVavXeNepxjcwty"
    },
    {
        "title": "One Bowl Chocolate Cake II",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nSift together the flour, cocoa, baking soda and salt, set aside. In a medium bowl, cream together the sugar and butter until smooth. Stir in the eggs and vanilla. Gradually mix in the dry ingredients, alternately with the milk. Once all of the ingredients have been incorporated, mix on high speed of an electric mixer for 2 to 3 minutes. Pour batter into the prepared pan.\nBake for 30 to 35 minutes in the preheated oven, until a toothpick inserted comes out clean.\n",
        "picture_link": "p.wCP/KjZMea615Bl1TI3U5LVSpo.A6"
    },
    {
        "title": "Candy Cane Cookies I",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup sifted confectioners' sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 teaspoons almond extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nMix well the shortening and butter, sugar, egg, almond and vanilla. In a separate bowl, mix flour and salt and add to shortening mixture. Divide dough in half.\nBlend red food coloring into one half. Roll 1 teaspoon of the red dough and 1 teaspoon of the white dough on lightly floured board into 4 inch strips. Place strips side by side and press lightly together and twist like a rope. Curve top of rope down to look like the handle of a candy cane.\nBake 9 minutes or until lightly browned. Remove while still warm. Sprinkle with 1/2 cup crushed peppermint stick candy and 1/2 cup sugar (optional).\n",
        "picture_link": "vJqfL0COlC4j.T6.9fypj.T8X/dhSj."
    },
    {
        "title": "Building Gingerbread",
        "ingredients": [
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup molasses ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nMelt shortening in a saucepan large enough for mixing the dough. Mix in sugar and molasses. Combine the flour, salt, baking soda, nutmeg, and ginger; gradually stir into the pan, using your hands to work in the last bit. Dough should be stiff.\nOn a floured surface, roll out dough to 1/4 inch thickness, and cut out as desired. Make sure the gingerbread is of uniform thickness, or the edges may burn before the center is done. Place pieces onto cookie sheets.\nBake for 13 to 15 minutes in the preheated oven. Let cool for several minutes on the cookie sheet, then remove to racks to finish cooling.\nWhen the gingerbread has cooled completely, make the frosting cement. In a medium bowl, mix together confectioners' sugar and cream of tartar. Add egg whites and vanilla. Beat on high speed until frosting holds its shape. If necessary, add more confectioners' sugar to thicken the icing. Cover frosting with a damp cloth to prevent drying.\n",
        "picture_link": "NBzyO3M9/i9MOFI2O9pQG.5TLfVgStm"
    },
    {
        "title": "Potato Rosemary Rolls",
        "ingredients": [
            "1 1/8 cups warm water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons nonfat dry milk powder ADVERTISEMENT",
            "1/2 cup dry potato flakes ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon dried rosemary, crushed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1 1/2 teaspoons bread machine yeast ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure and add warm water, olive oil, dry milk, potato flakes, sugar, rosemary, salt, bread flour, and yeast to your bread machine in the order listed by the manufacturer. Select Dough cycle and Start.\nDivide dough into 12 pieces. Roll each into a 10 inch rope; coil rope and tuck in the end so that it comes up through the middle. Place 2 inches apart on a baking sheet dusted with cornmeal. Cover and let rise for 45 minutes.\nBrush tops with egg glaze or melted butter, and lightly sprinkle with kosher salt. Bake at 375 degrees F (190 degrees C) for 15 to 20 minutes.\n",
        "picture_link": "FPvHW5ElUnBdjPJONjC63UXZQb4PREq"
    },
    {
        "title": "Chocolate Orange Cookies",
        "ingredients": [
            "1 (1 ounce) square unsweetened chocolate ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). In a microwave-safe dish, melt the unsweetened chocolate, stirring frequently until smooth. Set aside.\nIn a medium bowl, cream together the butter and sugar until smooth. Beat in the egg and vanilla. Combine the flour, baking powder, and salt; stir into the creamed mixture. Divide dough in two. Mix orange zest into one half, and melted chocolate into the other half. Use a bit of each mixture to form a ball about 1 inch in diameter.\nBake for 8 to 10 minutes in the preheated oven, or until center is set. Cool on wire racks.\n",
        "picture_link": "qAOi0vQgfQBI6vQjqbbEsZhyjJ0TvnO"
    },
    {
        "title": "Raw Vegetable Salad",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "3 cups chopped broccoli ADVERTISEMENT",
            "3 cups chopped cauliflower ADVERTISEMENT",
            "3 cups chopped celery ADVERTISEMENT",
            "1 (10 ounce) package frozen green peas, thawed ADVERTISEMENT",
            "1 cup sweetened dried cranberries (such as Craisins®) ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "1/4 cup Parmesan cheese ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons grated onion ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup Spanish peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large deep skillet. Cook over medium-high heat until evenly brown, 10 to 15 minutes. Drain bacon on a paper towel-lined plate; crumble.\nMix broccoli, cauliflower, celery, peas, and cranberries in a large bowl.\nWhisk mayonnaise, Parmesan cheese, sugar, onion, vinegar, and salt together in a bowl. Pour dressing over the salad; add nuts and bacon and toss well.\n",
        "picture_link": "PnfMPgVoKwEgPAi1hwu5oa5bRV12PIa"
    },
    {
        "title": "Pork Chop and Rice Casserole",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 pork chops ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup uncooked instant rice ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C).\nHeat vegetable oil in a large skillet over medium heat, and brown the pork chops on both sides, 5 to 8 minutes per side. Place the chops into a 9x13-inch baking dish. In a large saucepan, whisk together the cream of chicken soup, cream of celery soup,and milk until smooth. Stir in the rice, and add the butter; bring the mixture to a boil over medium heat, and stir until the butter has melted. Pour the rice mixture over the chops; cover the dish with foil.\nBake in the preheated oven until tender, about 2 hours.\n",
        "picture_link": "R0odK2PoN51jRNBjTObH.lkcrqv9y5K"
    },
    {
        "title": "Stuffed Flank Steak",
        "ingredients": [
            "2 cups dry stuffing mix ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "1 1/2 pounds flank steak, pounded thin for easy rolling ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 (10.5 ounce) can mushroom gravy ADVERTISEMENT",
            "1/4 cup red wine ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, combine the stuffing mix, water and butter or margarine. Mix well and let stand for 5 minutes. Spoon the stuffing onto the steak, leaving a 1 inch border. Add the green onions and the red bell pepper.\nRoll from the long edge of the steak and secure with wooden toothpicks. Place steak seam side down in a 9x13 inch baking dish.\nIn a separate small bowl, combine the gravy, wine OR apple juice, garlic and cheese. Mix well and pour over the steak.\nBake at 350 degrees F (175 degrees C) for 1 hour, remove from oven and let stand before slicing.\n",
        "picture_link": "sm3qzBWHm7oapU7vt.0ZPArVYjWI4mq"
    },
    {
        "title": "Broccoli Ham Ring",
        "ingredients": [
            "1/4 pound cooked ham, coarsely chopped ADVERTISEMENT",
            "1/4 pound fresh broccoli, chopped ADVERTISEMENT",
            "1 bunch fresh green onions, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "2 tablespoons Dijon-style prepared mustard ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "2 (8 ounce) packages refrigerated crescent rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, toss together ham, chopped broccoli, onion, parsley, and Swiss cheese. Stir in lemon juice and Dijon-style mustard.\nOn a 13-inch stone or baking sheet, arrange crescent triangles in a circle with bases overlapping in center and points to the outside. There should be a 3-inch diameter circle in center. Spoon the filling evenly over the crescent rolls. Fold points of triangle over filling and tuck under base at center. Filling will not be completely covered.\nBake for 25 to 30 minutes in the preheated oven, until golden brown. Serve warm.\n",
        "picture_link": "kOvOVh7GP6ygS1ua7RUd3ASO6HRidsG"
    },
    {
        "title": "Easy Vegan Peanut Butter Fudge",
        "ingredients": [
            "3/4 cup vegan margarine ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "3 2/3 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease a 9x9 inch baking dish.\nIn a saucepan over low heat, melt margarine. Remove from heat and stir in peanut butter until smooth. Stir in confectioners' sugar, a little at a time, until well blended. Pat into prepared pan and chill until firm. Cut into squares.\n",
        "picture_link": "xsgQUOgGgHl.pTI8RD7n1/Hgn/ldbbW"
    },
    {
        "title": "Waikiki-Style Meatballs",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2/3 cup plain breadcrumbs ADVERTISEMENT",
            "1/3 cup minced onion ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 (15 ounce) can pineapple chunks, juice reserved ADVERTISEMENT",
            "1/3 cup vinegar ADVERTISEMENT",
            "1/3 cup chopped green bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nThoroughly mix the ground beef, bread crumbs, onion, milk, egg, and salt together in a bowl. Roll the mixture into balls and arrange onto a baking sheet.\nBake in the preheated oven until the meatballs are browned on the bottom, about 25 minutes. Transfer to a slow cooker.\nStir the cornstarch and brown sugar together in the bottom of a saucepan and place over low heat. Add the reserved pineapple juice and vinegar; stir until smooth. Bring the mixture to a boil for 1 full minute before removing from heat; pour over the meatballs in the slow cooker.\nAdd the pineapple chunks and green bell pepper to the slow cooker.\nCook the mixture in the slow cooker on Low until the flavors are thoroughly combined, 3 to 4 hours.\n",
        "picture_link": "Xoz76H6SVxfCGb0mHe5L2s/H96b3R0i"
    },
    {
        "title": "Crusted Salmon with Honey-Mustard Sauce",
        "ingredients": [
            "1 (1.5 pound) skinless center-cut salmon fillet, cut into 4 pieces ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup fine bread crumbs ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Prepare a baking sheet with cooking spray.\nPlace the salmon fillets in a baking dish; pour the milk over the fillets. Allow the salmon to soak in the milk 10 to 15 minutes.\nStir the bread crumbs and Parmesan cheese together in a wide, deep bowl. Beat the egg in a separate bowl until frothy. Remove the salmon fillets from the milk; shake the excess milk off the fish. Dip each fillet into the beaten egg and then gently press into the bread crumb mixture to coat; gently shake to remove the excess.\nBake in the preheated oven, turning once, until the salmon flakes easily with a fork, about 15 minutes.\nWhile the salmon bakes, stir the butter, mustard, and honey together in a bowl; drizzle over the baked salmon to serve.\n",
        "picture_link": "ZbRDkv5jTC/4JhhqAfUAjP0qz2v.Bx2"
    },
    {
        "title": "Savory Spinach Casserole",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 (10 ounce) packages frozen chopped spinach ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, combine cream cheese and milk; mix until blended. Spoon spinach into 1-quart casserole, top with cream cheese mixture and sprinkle with Parmesan cheese.\nBake in a preheated 350 degrees F (175 degrees C) oven for 20 minutes.\n",
        "picture_link": "QcidL0V/3RhjlHwP3fDuomIa2QIjYZS"
    },
    {
        "title": "Asian Cucumber Salad",
        "ingredients": [
            "2 cucumbers - halved lengthwise, seeded, and sliced ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 cup rice vinegar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "4 fresh red chile peppers, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put the cucumber slices in a colander and sprinkle with salt; set aside to drain for 1 hour.\nWhisk the vinegar and sugar together until the sugar is dissolved; add the sesame oil, garlic, ginger, and sesame seeds; stir.\nRinse salt off the cucumber slices by running under cold water; place in a large bowl with the sliced red chile peppers. Drizzle the dressing over the vegetables and toss to coat. Serve immediately.\n",
        "picture_link": "zC0n/8DYA0RU./bEMs6TW7LuzNqY.4."
    },
    {
        "title": "Lettuce with Hot Bacon Dressing",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1/2 cup sliced onion ADVERTISEMENT",
            "1/4 cup white wine vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "8 cups leaf lettuce - rinsed, dried and torn into bite-size pieces ADVERTISEMENT",
            "8 radishes, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place egg in a saucepan and cover with cold water. Bring water to a boil; cover, remove from heat, and let egg stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Reserve excess grease.\nAdd onions to skillet with reserved grease and cook until tender. Add bacon, vinegar, water, sugar and salt. Stir and bring to boil.\nPlace lettuce in a large bowl. Pour hot dressing over and toss well. Garnish with egg and radishes.\n",
        "picture_link": "IMh1WQvOuYX75/FgjF0FIsazD3b9Udu"
    },
    {
        "title": "Sweet Onion Pie",
        "ingredients": [
            "1 1/2 cups buttery round crackers, crumbled ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "2 cups thinly sliced sweet onions ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon minced fresh chives ADVERTISEMENT",
            "3/4 cup whole milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, combine crackers and 4 tablespoons of butter in a bowl until well blended. Press into the bottom and 1 inch up the sides of 8 inch pie plate to form a shell. Refrigerate until needed.\nMelt remaining 2 tablespoons butter in heavy skillet over medium heat. Saute onions and garlic slowly until tender, about 12 minutes. Arrange onions in the cracker crust.\nBeat eggs, whole milk, chives, and salt in a bowl until blended. Pour the mixture over the onions. Sprinkle with cheese and paprika.\nBake in a preheated 350 degrees F (175 degrees C) oven for 35 minutes, or until a knife comes out clean. Garnish with the parsley. Serve hot or at room temperature.\n",
        "picture_link": "5S.FY5GijNp4IBCumEW8OyEkkpqv9fy"
    },
    {
        "title": "Classic Shepherd's Pie",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "4 teaspoons all-purpose flour ADVERTISEMENT",
            "1/4 cup Heinz Tomato Ketchup ADVERTISEMENT",
            "3/4 cup Heinz® Tomato Juice ADVERTISEMENT",
            "2 tablespoons Heinz Worcestershire Sauce ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 cup frozen mixed vegetables (such as peas and carrots) ADVERTISEMENT",
            "3 cups cooked, warm, mashed potatoes ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2/3 cup warm milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet set over medium heat. Add the onion, garlic, thyme, rosemary, and half of the salt and pepper. Cook, stirring often, for 5 to 7 minutes. Preheat the oven to 350 F (180 C).\nCrumble meat into pan and cook until brown all over. Sprinkle with flour. Stir in ketchup, tomato juice, Worcestershire sauce and mustard. Simmer for 5 minutes. Stir in mixed vegetables. Transfer to a 9-inch (23-cm) baking dish.\nWhip the potatoes with the warm milk, remaining salt and pepper, butter and garlic until very fluffy. Spread potatoes evenly over meat mixture. Bake for 35 minutes or until potatoes are golden.\n",
        "picture_link": "KB2E4038KqBn8lgeIGIzx37EsMAV3ZO"
    },
    {
        "title": "Easy Toffee",
        "ingredients": [
            "1 (10 ounce) package saltine crackers ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "1 (12 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "1 cup slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a baking sheet. Line baking sheet with saltine crackers, edges touching.\nIn a medium saucepan, combine butter and brown sugar and cook until mixture reaches 235 degrees F (112 degrees C) or a small amount of mixture dropped into cold water forms a small ball that flattens when placed on a flat surface. Pour mixture over crackers and spread evenly.\nBake in preheated oven 15 minutes. Sprinkle chocolate chips over hot toffee. When chips turn glossy, spread evenly with spatula. Sprinkle with almonds. Freeze 20 minutes before serving.\n",
        "picture_link": "mQa3pYu/ZDAOCXtnSpx2ak3FmR8d.HS"
    },
    {
        "title": "Blueberry, Banana, and Peanut Butter Smoothie",
        "ingredients": [
            "1 tablespoon flax seed meal or wheat germ ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/2 cup frozen blueberries ADVERTISEMENT",
            "1 tablespoon peanut butter ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put ground flax seed meal or wheat germ into blender to grind and further breakdown. This will also eliminate any bitterness from the flax seed.\nPlace the banana, blueberries, peanut butter, honey, yogurt, and milk into the blender. Cover, and puree until smooth. Pour into glasses to serve.\n",
        "picture_link": "AemqABx.Gd6GD02o4B1uWrZWiw6yPZG"
    },
    {
        "title": "Italian Bread Baked on a Pizza Stone",
        "ingredients": [
            "3 cups unbleached flour ADVERTISEMENT",
            "1 tablespoon light brown sugar ADVERTISEMENT",
            "1 1/3 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "2 tablespoons cornmeal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour, brown sugar, warm water, salt, olive oil and yeast in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press Start.\nPlace pizza stone in oven and preheat to 375 degrees F (190 degrees C). Oven must be preheated at least 30 minutes before baking.\nDeflate the dough and turn it out onto a lightly floured surface. Form dough into two loaves. Place the loaves seam side down on a cutting board generously sprinkled with cornmeal. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes.\nIn a small bowl, beat together egg and 1 tablespoon water. Brush the risen loaves with egg mixture. Make a single long, quick cut down the center of the loaves with a sharp knife. Gently shake the cutting board to make sure that the loaves are not sticking. If they stick, use a spatula or pastry knife to loosen. Slide the loaves onto the pizza stone with one quick but careful motion.\nBake in preheated oven for 30 to 35 minutes, or until loaves sound hollow when tapped on the bottom.\n",
        "picture_link": "hrpsdGaF2CIE8DWTAZ2.my6PLYIvZtu"
    },
    {
        "title": "Chocolate Glaze II",
        "ingredients": [
            "2 cups sifted confectioners' sugar ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine butter with sugar and cocoa.\nAdd vanilla. Add milk gradually until smooth.\nDrizzle over cake.\n",
        "picture_link": "Wf2vZUHszufWGUs2gP6FCbM.waj.JBG"
    },
    {
        "title": "Surprise Cake",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch baking pan.\nIn a large bowl, combine sugar, flour and salt. Set aside.\nIn a small saucepan, bring 1 cup butter, water and 3 tablespoons cocoa to a boil. Remove from heat. Add to flour mixture and beat until smooth.\nIn a separate bowl, Mix sour cream, eggs, baking soda and cayenne pepper. Add to the cake batter. Blend well. Pour batter into 9x13 inch pan.\nBake at 350 degrees F (175 degrees C) for 20 to 30 minutes, or until toothpick inserted into center of cake comes out clean. Allow to cool.\nFor the Frosting: Melt 1/4 cup butter, add 1/3 cup cocoa. Add confectioners sugar, milk and vanilla. Mix until smooth and free of lumps.\nSpread frosting on the cooled cake. Cut into squares and serve. Ask your company if they can guess what is in it, they never will.\n",
        "picture_link": "u2bsNNHl7hyKzUPeIncrq7Q7efJP8U6"
    },
    {
        "title": "Sy's Challah",
        "ingredients": [
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 1/4 cups warm water ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon poppy seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sugar, salt, and oil in either a mixing bowl for an electric mixer with a dough hook or any large bowl. Add hot water, and stir to dissolve the sugar and salt. Stir in yeast, and let stand until mixture gets foamy. Add slightly beaten eggs.\nIf using an electric mixer, add 4 1/2 cups of flour to the yeast mixture. Mix until flour is mixed in, and dough gets stringy. This stringiness indicates that the gluten has developed. Continue to add flour until dough is all on dough hook; 1 or 2 cups is usually sufficient. Let hook continue to knead for several minutes. Dough should be smooth and elastic. To knead by hand, stir 4 1/2 cups of flour in to the yeast mixture. Turn soft dough onto lightly floured surface, and work in 1 to 2 cups of flour. Knead until smooth and elastic, about 8 to 10 minutes.\nPlace dough into a greased bowl, and turn several times to coat the surface. Cover bowl with a damp cloth. Let dough rise until doubled in bulk. Punch down after first rising, and allow to rise a second time. The first rising is about 1 hour, the second about 45 minutes. Two risings makes for a better bread, but if time is a problem just do one.\nDivide dough in half, and divide each half into three or four equal parts. Make two braids, and place both breads on a greased baking sheet. Cover, and allow to rise until doubled. Brush with beaten egg. Sprinkle with poppy seeds, if desired.\nBake at 350 degrees F (175 degrees C) for 35 minutes until golden brown. Allow loaves to cool on a wire rack.\n",
        "picture_link": "kkFV18URJkA6FJTMzHpxoD1LZ4wv4y6"
    },
    {
        "title": "Chef John's Cottage Fries",
        "ingredients": [
            "4 baking (russet) potatoes, sliced into 3/8-inch thick rounds ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 pinch herbes de provence, or to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nLine a baking sheet with parchment paper or a silicone baking mat and set aside.\nCombine potatoes, salt, ground black pepper, cayenne pepper, and herbes de provence in a large bowl. Drizzle olive oil over potatoes and stir to evenly coat.\nPlace potatoes on baking sheet, spaced evenly, and bake in the preheated oven for 15 minutes.\nRemove from oven, flip over each potato slice, and return to the oven for another 15 minutes. Continue cooking and flipping until potatoes are well browned, about 30 minutes. Potatoes should be crispy around edges, but still soft in the center.\n",
        "picture_link": "pOQ76zMemCu4JbxDK4Zkqw6QKwWX.46"
    },
    {
        "title": "Easy Chicken Gyro",
        "ingredients": [
            "1 (16 ounce) container Greek yogurt ADVERTISEMENT",
            "1 cucumber, peeled and coarsely chopped ADVERTISEMENT",
            "1 1/2 teaspoons dried dill weed ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "lemon, juiced ADVERTISEMENT",
            "2 teaspoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 1/4 pounds skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "6 (6 inch) pita bread rounds ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "1/2 head iceberg lettuce, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place Greek yogurt, cucumber, dill weed, 2 cloves garlic, white vinegar, 1 teaspoon lemon juice, 1 tablespoon olive oil, salt, and black pepper in a blender. Blend until smooth; set aside.\nWhisk together 4 cloves minced garlic, juice of 1 lemon, red wine vinegar, 2 tablespoons olive oil, and oregano in a large glass or ceramic bowl. Season to taste with salt and black pepper.\nStir in chicken strips and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for 1 hour.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nRemove chicken from the marinade and shake off excess. Discard the remaining marinade. Place chicken on a large baking sheet.\nBroil the chicken in the preheated oven until lightly browned and no longer pink in the center, 2 to 4 minutes per side.\nTransfer cooked chicken to a plate and allow to rest for 5 minutes.\nHeat 1 teaspoon olive oil in a large skillet over medium heat; place each pita bread into the skillet until warm and soft, about 2 minutes per pita.\nServe warmed pita bread topped with chicken strips, yogurt sauce, tomatoes, onion, and lettuce.\n",
        "picture_link": "klxjEdZLIoaGnnzAUpLoRl/j3mDx9Qy"
    },
    {
        "title": "Tomato and Basil Pasta Sauce",
        "ingredients": [
            "3 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "2 (14.5 ounce) cans tomatoes, chopped ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "2 teaspoons balsamic vinegar ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "3/4 cup basil leaves, torn into pieces ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat; cook the onion and garlic in the hot oil until tender, about 5 minutes. Stir the tomatoes, red pepper flakes, vinegar, and sugar into the onion and garlic mixture; bring to a boil, reduce heat to low, and simmer until the flavors blend to your liking, 45 to 60 minutes. Stir the basil into the sauce; season with salt and pepper.\n",
        "picture_link": "QSXGMoZma.u9SEUND5ybn4VWPxzlj.q"
    },
    {
        "title": "Sexy Fish Stew",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 large leek, cleaned and thinly sliced ADVERTISEMENT",
            "1/2 cup sliced shallots ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "3/4 cup white wine ADVERTISEMENT",
            "1 1/4 cups chicken broth ADVERTISEMENT",
            "1/2 cup thinly sliced fennel bulb ADVERTISEMENT",
            "1 pound baby red potatoes, trimmed ADVERTISEMENT",
            "salt and freshly ground pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 pound boneless rockfish filets, cut into 1-inch pieces ADVERTISEMENT",
            "1 tablespoon chopped fresh tarragon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium-low heat. Cook and stir leek, shallots, and 1/2 teaspoon salt in the melted butter until softened, 10 to 15 minutes.\nStir wine into leek mixture, increase heat to medium, and cook for 2 minutes. Add chicken broth and bring to a simmer.\nMix fennel and potatoes into leek mixture and simmer, stirring occasionally, until potatoes are nearly tender, about 10 minutes. Season with salt, black pepper, and cayenne pepper. Add cream and stir to combine.\nStir fish and tarragon into soup, cover and cook for 3 minutes. Stir gently, reduce heat to medium-low and cook until fish flakes easily with a fork, about 5 minutes. Season with salt and black pepper.\n",
        "picture_link": "wpxho9wVqWtD3P5j21NLquRzLuDfUyW"
    },
    {
        "title": "Eggless Chocolate Peanut Butter Cookies",
        "ingredients": [
            "2 cups flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "1/3 cup peanut butter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Sift together flour, baking soda, baking powder, and salt. Set aside.\nCream together butter, sugar, and brown sugar in a large bowl. Mix in vanilla extract and cocoa powder, then add peanut butter, and stir until smooth. Gradually mix in the sifted ingredients until well blended. Pour milk into dough, and stir until fully combined.\nDrop dough by heaping teaspoons onto ungreased baking sheets. Bake in the preheated oven until edges are lightly browned, 11 to 13 minutes. For a crunchier cookie, bake an additional minute or two.\n",
        "picture_link": "itC57OZ.6X0T5eeBZFBKLbkX.sUIsRa"
    },
    {
        "title": "Carol's Baked Ziti Casserole",
        "ingredients": [
            "1 (16 ounce) package ziti pasta ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (28 ounce) jar meatless spaghetti sauce, divided ADVERTISEMENT",
            "2 cups shredded part-skim mozzarella cheese, divided ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13-inch baking dish.\nFill a large pot with lightly salted water and bring to a boil. Stir in ziti pasta and return to a boil. Cook pasta, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes; drain.\nCombine egg, ricotta cheese, and 1/4 cup Parmesan cheese in a bowl. Spread 1/3 the spaghetti sauce in prepared baking dish. Top with 1/2 the pasta, 1/2 the ricotta mixture, 1/3 the spaghetti sauce, 1/2 the mozzarella cheese, and 1/2 the Parmesan cheese; repeat layers. Top with remaining spaghetti sauce and Parmesan cheese; cover baking dish with aluminum foil.\nBake in preheated oven until heated through, 45 to 50 minutes.\n",
        "picture_link": "QNgDdGGeooosW.ECWKFkqqC0ksV3ZM."
    },
    {
        "title": "Blueberry Lemon Breakfast Quinoa",
        "ingredients": [
            "1 cup quinoa ADVERTISEMENT",
            "2 cups nonfat milk ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 tablespoons maple syrup ADVERTISEMENT",
            "1/2 lemon, zested ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "2 teaspoons flax seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse quinoa in a fine strainer with cold water to remove bitterness until water runs clear and is no longer frothy.\nHeat milk in a saucepan over medium heat until warm, 2 to 3 minutes. Stir quinoa and salt into the milk; simmer over medium-low heat until much of the liquid has been absorbed, about 20 minutes. Remove saucepan from heat. Stir maple syrup and lemon zest into the quinoa mixture. Gently fold blueberries into the mixture.\nDivide quinoa mixture between 2 bowls; top each with 1 teaspoon flax seed to serve.\n",
        "picture_link": "z.va8aQgvskhME1m4UY2kcaIMKEB0Ai"
    },
    {
        "title": "Whole Wheat Pancake Mix",
        "ingredients": [
            "5 cups whole wheat flour ADVERTISEMENT",
            "3 cups unbleached all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 1/2 tablespoons baking powder ADVERTISEMENT",
            "4 teaspoons baking soda ADVERTISEMENT",
            "4 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk whole wheat flour, unbleached flour, sugar, baking powder, baking soda, and salt together in a bowl; store in an airtight container.\n",
        "picture_link": "yc.9KdBm0wiHuG0rJQ00C7d8a88.O/m"
    },
    {
        "title": "Chicken Tortilla Soup",
        "ingredients": [
            "1 cup chopped onion ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 envelope taco seasoning ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken breast meat - cubed ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1/4 cup shredded Mexican cheese blend ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine onion, chicken broth, tomatoes, and taco seasoning in a large sauce pan; bring to a boil over medium heat. Stir in chicken; reduce heat to low, cover, and simmer until chicken is no longer pink, 4 to 6 minutes. Mix cornstarch and water in a small bowl until smooth; gradually stir into soup.\nBring soup to a boil over medium-high heat; cook, stirring occasionally, until thickened, about 1 minute. Top with Mexican cheese and cilantro.\n",
        "picture_link": "mrwrU/W/EE5qYYL28mTavmv6B97QFma"
    },
    {
        "title": "Plain Caramel Apples",
        "ingredients": [
            "6 Granny Smith apples ADVERTISEMENT",
            "6 wooden sticks ADVERTISEMENT",
            "1 (14 ounce) package individually wrapped caramels, unwrapped ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Insert wooden sticks 3/4 of the way into the stem end of each apple. Place apples on a cookie sheet covered with lightly greased aluminum foil.\nCombine caramels and water in a saucepan over low heat. Cook, stirring often, until caramel melts and is smooth. Stir in vanilla extract. Dip each apple into the caramel and gently run apples around insides of saucepan to scrape off some of the caramel. Scrape excess caramel from the apple bottoms using the side of the saucepan. Place on the aluminum foil and chill until ready to serve.\n",
        "picture_link": "Ff8jfTw.lBhg5RrKyxq589XQDUVj9.6"
    }
]