[
    {
        "title": "Maine Lobster & Spinach Dip",
        "ingredients": [
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 package McCormick® Spinach Dip Seasoning Mix ADVERTISEMENT",
            "1/2 cup cooked and shredded fresh Maine lobster meat ADVERTISEMENT",
            "2 tablespoons finely chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sour cream, mayonnaise, lemon juice, and seasoning mix in medium bowl until well blended. Add lobster meat; gently stir to blend. Cover.\nRefrigerate at least 1 hour to blend flavors. Stir dip and sprinkle with green onions before serving. Serve with water crackers.\n",
        "picture_link": "AdFEVZluCp4OBHPaneqpzitStQ5..16"
    },
    {
        "title": "Minnesota Hot Dish Dip",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1 package McCormick® Original Country Gravy Mix ADVERTISEMENT",
            "1/2 pound ground breakfast sausage ADVERTISEMENT",
            "1 cup frozen mixed vegetables ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Gradually stir milk into gravy mix with whisk in medium bowl. Set aside.\nBrown sausage in large skillet on medium heat, about 5 minutes. Drain fat. Return sausage to skillet. Stir in gravy mixture and vegetables. Bring to boil on medium heat, stirring frequently. Reduce heat and simmer 2 minutes. Spoon into 9-inch glass pie plate. Sprinkle with cheese.\nBake 10 minutes or until cheese is melted. Serve with potato tots.\n",
        "picture_link": "zur0rhU5RWM1lJTAe/1JzaGeivD258W"
    },
    {
        "title": "Iowa Sloppy Joe Dip",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1 cup Kitchen Basics® Unsalted Beef Stock ADVERTISEMENT",
            "1 (1.31 ounce) package McCormick® Sloppy Joes Seasoning Mix ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 cups shredded Cheddar Jack cheese, divided ADVERTISEMENT",
            "1/2 cup whipped cream cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nBrown ground beef and onion in large skillet on medium-high heat, about 5 minutes. Drain fat. Stir in broth, seasoning mix, vinegar, and Worcestershire sauce. Bring to boil. Reduce heat and simmer 10 minutes or until stock is absorbed, stirring occasionally. Remove from heat.\nStir 1 cup of the shredded cheese and cream cheese into the beef mixture. Spoon into a 2-quart baking dish. Sprinkle with remaining 1 cup shredded cheese.\nBake 10 to 15 minutes or until cheese is melted. Serve with wavy potato chips or mini toasts.\n",
        "picture_link": "78VbXrZkfHeI40AJxYCSCGthklFpw7W"
    },
    {
        "title": "Delaware Scrapple Dip",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 pound scrapple, sliced 1/4-inch thick ADVERTISEMENT",
            "2 (8 ounce) containers whipped cream cheese ADVERTISEMENT",
            "1/2 cup finely shredded white Cheddar cheese ADVERTISEMENT",
            "1 (1.24 ounce) package OLD BAY® Crab Cake Classic® Mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nHeat oil in large skillet on medium-high heat. Add scrapple; cook 3 to 4 minutes or until browned, turning occasionally. Remove from skillet. Coarsely chop scrapple and place in large bowl.\nStir cream cheese and shredded cheese into the scrapple. Spread in 9-inch glass pie plate. Sprinkle with crab cake mix.\nBake 30 minutes or until hot and bubbly. Serve with assorted crackers or sliced French bread.\n",
        "picture_link": "YwGtxXU.lUg5wHs9iLYbYr4UNkKTXpi"
    },
    {
        "title": "Kansas City BBQ Chicken Dip",
        "ingredients": [
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 (1.25 ounce) package McCormick® Slow Cookers Sweet & Smoky Pulled Chicken Seasoning Mix ADVERTISEMENT",
            "1 pound boneless, skinless chicken thighs ADVERTISEMENT",
            "1 (8 ounce) container whipped cream cheese ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons finely chopped red onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ketchup, molasses, water and seasoning mix in 4-quart slow cooker. Add chicken to slow cooker; stir to coat.\nCook 2 hours on High or until chicken is cooked through. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from slow cooker.\nShred chicken using 2 forks. Return chicken to slow cooker. Stir in cream cheese and shredded cheese. Sprinkle with onion before serving.\n",
        "picture_link": "sUuHLS4oZ6nRcDqxqueHRK1HPQqj/Zq"
    },
    {
        "title": "Chocolate-Flaxseed Cake",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "2 teaspoons white vinegar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup ground flax seeds ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup cold-brewed coffee ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nMix milk and vinegar together in a small bowl. Let sit until curdled, about 5 minutes.\nMix flour, sugar, ground flax seeds, cocoa powder, baking soda, baking powder, and salt together in a bowl. Make a well in the center of the flour mixture; add milk-vinegar mixture, coffee, eggs, and vegetable oil. Beat with an electric mixer until batter is well mixed.\nPour batter into the prepared baking pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 25 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quinoa High Protein Muffins",
        "ingredients": [
            "1 teaspoon coconut oil, or as needed ADVERTISEMENT",
            "2/3 cup light coconut milk ADVERTISEMENT",
            "1/2 cup quinoa ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons coconut oil (optional) ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "5 large eggs ADVERTISEMENT",
            "1/3 cup shredded unsweetened coconut (optional) ADVERTISEMENT",
            "1 teaspoon vanilla extract, or to taste ADVERTISEMENT",
            "1/3 cup almonds ADVERTISEMENT",
            "1/4 cup chopped pitted dates ADVERTISEMENT",
            "1/4 cup chia seeds ADVERTISEMENT",
            "1/4 cup walnuts ADVERTISEMENT",
            "1/4 cup ground flax seeds ADVERTISEMENT",
            "1 large carrot, roughly chopped ADVERTISEMENT",
            "1 apple, peeled and roughly chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a muffin tin with 1 teaspoon coconut oil.\nBring coconut milk, quinoa, and pinch of salt to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and milk is absorbed, 20 to 25 minutes. Remove from heat and cool.\nCombine 2 tablespoons coconut oil and honey in a large microwave-safe bowl; heat in microwave until melted and smooth, 20 to 30 seconds. Beat eggs, shredded coconut, and vanilla extract into honey mixture until well combined. Stir cooled quinoa into mixture until well mixed.\nPlace dates, chia seeds, walnuts, and ground flax in a food processor; pulse until roughly chopped. Stir into quinoa batter.\nPlace carrot and apple in food processor and pulse until evenly chopped; stir into quinoa batter. Sprinkle a pinch of salt over batter and stir well. Divide batter into the muffin cups, filling almost full.\nBake in the preheated oven until the tops are golden brown and puffed and a toothpick inserted in the middle comes out clean, 12 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Honey Garlic Chicken Wraps",
        "ingredients": [
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 clove garlic, or to taste, minced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breasts, thinly sliced ADVERTISEMENT",
            "4 cups warm cooked rice ADVERTISEMENT",
            "8 (8 inch) soft flour tortillas ADVERTISEMENT",
            "1/2 cup carrot matchsticks, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix honey, soy sauce, cornstarch, and garlic together in a small bowl.\nHeat oil in a large skillet over medium heat. Cook and stir chicken until no longer pink, 5 to 8 minutes. Pour honey mixture over chicken; cook and stir until sauce thickens and coats chicken, 3 to 5 minutes.\nDivide warm rice among tortillas; spoon chicken on top. Cover chicken with carrots. Roll up wraps.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sopa de Platano - Plantain Soup",
        "ingredients": [
            "1 tablespoon olive oil, or as desired ADVERTISEMENT",
            "1/2 cup chopped white onion ADVERTISEMENT",
            "1 tablespoon sofrito ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 bay (laurel) leaf ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "2 large green plantains, peeled and grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large Dutch oven over medium-high heat; cook and stir onion until tender, 4 to 5 minutes. Add sofrito, garlic, cumin, bay leaf, salt, and pepper; cook and stir until fragrant, 2 to 3 minutes. Add chicken stock and bring to a boil.\nStir plantain into mixture and cook until tender, 10 to 15 minutes. Remove bay leaf and blend mixture with an immersion blender until soup is smooth and thick.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lasagna Soup",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 pound hot Italian sausage ADVERTISEMENT",
            "1 pound mild Italian sausage ADVERTISEMENT",
            "2 sweet onions, chopped ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (48 ounce) can beef broth ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with basil ADVERTISEMENT",
            "1 (14.5 ounce) can crushed tomatoes with basil ADVERTISEMENT",
            "1/2 cup sweet wine (optional) ADVERTISEMENT",
            "2 sprigs fresh basil, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) container ricotta cheese, or more to taste ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, or more to taste ADVERTISEMENT",
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Cook hot and mild sausage, stirring to break up into pieces, until browned, about 5 minutes. Add onions; cook and stir until translucent, about 5 minutes. Stir in garlic, oregano, and red pepper flakes; cook until fragrant, about 2 minutes.\nStir tomato paste into the paste. Fill tomato paste can with water and pour in; mix well. Pour in beef broth, diced tomatoes, crushed tomatoes, and wine. Stir in basil sprigs, salt, and pepper. Bring soup to a boil; reduce heat and simmer until flavors combine, at least 30 minutes.\nMix ricotta cheese, mozzarella cheese, and Parmesan cheese together in a bowl; season with salt and pepper.\nBring a large pot of lightly salted water to a boil. Cook bow-tie pasta at a boil, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain.\nDivide pasta among serving bowls; spoon some of the ricotta cheese mixture on top. Ladle soup over cheese mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Mozzarella Frittata",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 1/2 cups thinly sliced red onion ADVERTISEMENT",
            "1 1/2 cups chopped zucchini ADVERTISEMENT",
            "7 large eggs, beaten ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 ounces BelGioioso Fresh Mozzarella Pearls cheese ADVERTISEMENT",
            "3 tablespoons chopped oil-packed sun-dried tomatoes ADVERTISEMENT",
            "1/4 cup fresh basil, julienned ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Position rack in upper third of oven; preheat broiler.\nHeat oil in a large broiler-safe nonstick or cast-iron skillet over medium-high heat. Add onion and zucchini and cook, stirring frequently until soft, about 5 minutes.\nIn a bowl, whisk eggs, salt and pepper together. Pour over the vegetables in the pan. Cook about 2 minutes until nearly set. While cooking lift the edges to allow uncooked egg from the middle to go underneath. Top with Fresh Mozzarella and sun-dried tomatoes, place under broiler until the eggs are slightly browned, about 2 minutes. Let stand for 3 minutes. Top with basil. Slice and serve.\n",
        "picture_link": "p2qq19yuPetTQ2VHFKpsomX6dL4ddwS"
    },
    {
        "title": "Golden Oatmeal Muffins",
        "ingredients": [
            "1 package Duncan Hines® Golden Yellow Cake Mix ADVERTISEMENT",
            "1 cup quick-cooking oats ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "2 large eggs, slightly beaten ADVERTISEMENT",
            "2 tablespoons butter or margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 F. Grease 24 muffin cups or line with paper baking cups.\nCombine cake mix, oats and salt in large bowl. Add milk, eggs and melted butter; stir until moistened. Fill muffin cups two-thirds full.\nBake 13 minutes or until golden brown. Cool in pan 5 to 10 minutes. Loosen carefully before removing from pan. Serve with honey or your favorite jam.\n",
        "picture_link": "5I9HFQiCucOIvj7XEw2TJTidLc7y7ja"
    },
    {
        "title": "Rustic Red Velvet Cupcakes",
        "ingredients": [
            "Filling ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup granulated sugar ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 teaspoon pure vanilla ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "Batter ADVERTISEMENT",
            "1 package Duncan Hines® Red Velvet Cake Mix ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "Optional Garnish ADVERTISEMENT",
            "powdered sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Place paper baking cups in each of 24 regular-size muffin cups.\nMake Filling - Place cream cheese, sugar, eggs, vanilla and lemon juice in medium bowl. Beat with electric mixer on medium speed until smooth and creamy, about 2 minutes. Set aside.\nMake Batter - Prepare cake mix as described on box using the water, oil and eggs. Fill each muffin cup about 2/3 full with batter. Drop about 2 tablespoons of filling in center of batter.\nBake in center of oven 22 to 25 minutes or until toothpick inserted in center comes out clean. Cool 5 minutes; remove from pan. Place on wire rack; cool completely.\nStore covered in refrigerator.\nGarnish with powdered sugar, if desired.\n",
        "picture_link": ".3JkiyvsN24Gc2txEwLvDMYLJ3sUiVu"
    },
    {
        "title": "Sopa de Albondigas ",
        "ingredients": [
            "3 quarts chicken broth, divided ADVERTISEMENT",
            "1 large tomato, quartered ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 pounds ground chuck ADVERTISEMENT",
            "1 hot pepper, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 (8 ounce) package pepper Jack cheese, cubed ADVERTISEMENT",
            "2 hard-boiled eggs, cut into small chunks (optional) ADVERTISEMENT",
            "2 potatoes, peeled and cubed ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "1/2 cup chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1 cup chicken broth and tomato in a blender; blend until smooth.\nTransfer tomato mixture to a large pot; add remaining 11 cups broth. Bring to a boil, skimming off any foam that rises to the top. Season broth with salt and pepper.\nMix ground chuck, hot pepper, garlic, and cumin together in a bowl. Season with salt and pepper. Scoop ground chuck mixture into a small ball; press 1 cube of pepper Jack cheese and 1 chunk of egg into the center and roll meatball to seal. Repeat with remaining chuck mixture, cheese, and eggs.\nLower meatballs gently into the boiling broth. Add potatoes, onion, white rice, and cilantro. Simmer until meatballs are no long pink and potatoes and rice are tender, 20 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Steak au Poivre ",
        "ingredients": [
            "1 tablespoon whole black peppercorns, or more to taste ADVERTISEMENT",
            "2 (6 ounce) (1 1/4-inch-thick) tenderloin steaks ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon minced shallot ADVERTISEMENT",
            "2 tablespoons cognac ADVERTISEMENT",
            "2 tablespoons red wine ADVERTISEMENT",
            "1/4 cup beef broth ADVERTISEMENT",
            "2 tablespoons heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crack peppercorns in a mortar or pestle or with a rolling pin. Press cracked peppercorns into the steaks.\nHeat butter in a heavy skillet over medium-high heat. Add steaks; cook, turning with tongs, until browned, about 2 minutes per side. Reduce heat to medium and cook steaks, turning often, until they begin to firm up and are hot and slightly pink in the center, about 5 minutes per side. Transfer steaks to a plate and cover to keep warm.\nStir shallot into the skillet. Pour in cognac and red wine; simmer, stirring constantly, until reduced, about 2 minutes. Pour in beef broth and simmer, scraping browned bits off the bottom of the skillet, until sauce is smooth, about 2 minutes. Stir in cream; cook until heated through, 1 to 2 minutes.\nPour cream sauce over steaks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "IPA Ceviche Lettuce Wraps with Bacon",
        "ingredients": [
            "1/2 pound raw shrimp - peeled, deveined, and cut into small pieces ADVERTISEMENT",
            "1/2 pound albacore tuna, cut into small pieces ADVERTISEMENT",
            "3/4 cup lemon juice, divided ADVERTISEMENT",
            "3/4 cup lime juice, divided ADVERTISEMENT",
            "1 mango, peeled and diced ADVERTISEMENT",
            "3/4 cup pale ale (such as Going to the Sun IPA) ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1/2 yellow onion, diced ADVERTISEMENT",
            "1 jalapeno pepper, seeded and diced ADVERTISEMENT",
            "1 teaspoon mango hot sauce ADVERTISEMENT",
            "1 teaspoon sriracha sauce ADVERTISEMENT",
            "2 strips bacon, chopped ADVERTISEMENT",
            "1 head napa cabbage, leaves separated ADVERTISEMENT",
            "1 head radicchio, leaves separated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine shrimp and albacore tuna in a small bowl; cover with 1/2 cup lemon juice and 1/2 lime juice. Cure in the refrigerator for at least 2 hours.\nCombine remaining lemon juice and lime juice, mango, pale ale, tomato, yellow onion, jalapeno pepper, mango hot sauce, and sriracha sauce in a bowl. Refrigerate until flavors combine, at least 1 hour.\nPreheat oven to 225 degrees F (110 degrees C). Line a baking sheet with aluminum foil.\nSpread bacon pieces on the lined baking sheet.\nBake in the preheated oven until bacon is crisp, 20 to 30 minutes.\nDrain shrimp and tuna; toss with mango mixture to combine. Divide mixture among napa cabbage and radicchio leaves. Sprinkle bacon on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Octopus and Shrimp Pasta",
        "ingredients": [
            "2 pounds octopus, head and tentacles separated ADVERTISEMENT",
            "1 pound peeled raw shrimp ADVERTISEMENT",
            "1 large red onion, diced ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "1 pinch freshly ground black pepper to taste ADVERTISEMENT",
            "10 Roma tomatoes, diced ADVERTISEMENT",
            "2 teaspoons sriracha sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut octopus tentacles away from the piece that holds them together; cut into smaller pieces. Cut head in half.\nCombine octopus pieces and shrimp in a skillet over medium-high heat; cover and cook in their juices until octopus is almost tender, about 25 minutes. Transfer octopus and shrimp to a bowl, reserving juices in the skillet.\nStir onion, salt, bay leaves, and black pepper into the skillet; increase heat and cook until juices are reduced and onion takes on the color of the juices, 3 to 5 minutes. Stir in tomatoes and sriracha sauce; cook for 5 minutes.\nReturn octopus and shrimp to the skillet. Reduce heat to a simmer and cook until flavors combine and sauce thickens, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Juanita's Plantain Cake",
        "ingredients": [
            "1 cup oil for frying, or as needed ADVERTISEMENT",
            "3 ripe plantains - peeled, halved, and each half cut into 3 to 4 pieces ADVERTISEMENT",
            "6 eggs, separated ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 splash vanilla extract, or to taste ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "6 ounces queso fresco, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat about 1/2 inch of oil in a large, heavy skillet over medium-high heat; fry plantains until beginning to brown on both sides, 5 to 7 minutes. Transfer to a paper towel-lined plate to cool completely, at least 10 minutes.\nPreheat oven to 300 degrees F (150 degrees C). Heavily grease a 9x13-inch cake pan.\nBeat egg whites in a bowl using an electric mixer until stiff peaks form. Slowly add 1 cup plus 1 tablespoon white sugar; beat on high until completely smooth and thickened. Add vanilla extract and mix well. Add egg yolks, 1 at a time, and beat until completely smooth again.\nSift flour, baking powder, and salt together in a bowl. Gradually mix flour mixture into egg mixture until batter is just mixed.\nSpread 1/2 of the batter into the bottom of prepared cake pan. Place cooled plantains in an even layer on top of batter; top with enough queso fresco to lightly coat. Add 1 more layer plantain and cover with remaining batter, carefully working out any air bubbles with a spatula.\nPlace pan on the middle rack of preheated oven and bake until the center starts to firm up, 40 to 50 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rosca de Reyes",
        "ingredients": [
            "Bread: ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 tablespoon warm water ADVERTISEMENT",
            "2 (.25 ounce) packages dry yeast ADVERTISEMENT",
            "1 orange, zested ADVERTISEMENT",
            "1 lime, zested ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "20 candied citrus peels ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix 4 cups flour, eggs, egg yolks, 2/3 cup white sugar, water, dry yeast, orange zest, lime zest, and salt in the bowl of an electric mixer fitted with a dough hook. Add 1/2 cup plus 1 tablespoon butter; mix until dough is elastic and shiny, about 5 minutes.\nForm dough into a ball. Cover and let rise in a warm place for 45 minutes.\nPunch down dough gently; roll into a long cylinder. Join the ends of the cylinder together in the shape of an oval ring. Place ring on a greased baking sheet; cover and let rise in a warm place for 45 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nWhisk eggs whites in a small bowl. Brush egg whites evenly over dough.\nMix 1/2 cup white sugar and 1/4 cup butter in a small bowl with your fingers to form a paste. Add enough flour to give paste the consistency of Play-Doh(R); divide into 5 or 6 balls. Place each ball between two 3-inch squares of parchment paper. Press with the bottom of a 1-cup measuring cup to make a circle about 1/8 inch thick.\nSpace circles evenly around the dough ring. Arrange candied citrus peels on top of the dough.\nBake in the preheated oven until golden brown, about 20 minutes. Cool for 20 minutes before slicing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roasted Vegetable Panini Bites",
        "ingredients": [
            "2 slices rustic Italian bread ADVERTISEMENT",
            "4 ounces BelGioioso Fresh Mozzarella cheese, sliced ADVERTISEMENT",
            "Roasted tomatoes ADVERTISEMENT",
            "Roasted zucchini ADVERTISEMENT",
            "Roasted asparagus ADVERTISEMENT",
            "Roasted mushrooms ADVERTISEMENT",
            "Fresh basil leaves ADVERTISEMENT",
            "2 ounces prosciutto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients between the two pieces of bread and press while grilling to create a delicious panini sandwich. Cut into bite-size servings.\n",
        "picture_link": "jTOvdkbBI4Yy05TfrlAdwS2euAVsrQu"
    },
    {
        "title": "Lentil Bolognese",
        "ingredients": [
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "2 cloves garlic, crushed and finely chopped ADVERTISEMENT",
            "1/2 red bell pepper, thinly sliced ADVERTISEMENT",
            "1 carrot, cut into small cubes ADVERTISEMENT",
            "1/2 cup thinly sliced mushrooms ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "1 (15 ounce) can green lentils, drained ADVERTISEMENT",
            "1 teaspoon ground paprika, or more to taste ADVERTISEMENT",
            "1 teaspoon dried basil, or more to taste ADVERTISEMENT",
            "1 teaspoon dried oregano, or more to taste ADVERTISEMENT",
            "1 teaspoon mixed dried herbs, or to taste ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Cook and stir onion and garlic until soft, about 5 minutes. Stir in red bell pepper and carrot; cook for 4 to 5 minutes. Add mushrooms; cook and stir until softened, about 2 minutes.\nPour wine into the pot; simmer until slightly reduced, about 1 minute. Stir in diced tomatoes and vegetable broth. Bring sauce to a boil; reduce heat and simmer until flavors combine, 10 to 15 minutes. Stir in lentils, paprika, basil, oregano, dried herbs, and nutmeg; cook until lentils are heated through, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dark Chocolate Mint Energy Bites",
        "ingredients": [
            "2/3 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1 1/2 cups pitted dates ADVERTISEMENT",
            "2 tablespoons flax seeds ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "3/4 teaspoon peppermint extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients in the bowl of a food processor.\nBlend until ingredients form a sticky ball.\nWith slightly wet hands, form about a tablespoon each into a tight ball.\nRefrigerate, covered, until chilled. Store leftovers in refrigerator, covered.\n",
        "picture_link": "p2SSc21oO0qzLjD5Y1RJzeX.kkmp2Eq"
    },
    {
        "title": "Cocoa-Nut Almond Butter Energy Bites",
        "ingredients": [
            "3/4 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "2/3 cup almond butter ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup shredded coconut ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients in the bowl of a food processor. Blend until ingredients form a sticky ball. If desired, add salt to taste preference.\nWith slightly wet hands, shape into 12 (about 1-inch diameter) balls.\nRefrigerate, covered, until chilled.\nStore leftovers in refrigerator, covered.\n",
        "picture_link": "/r1jqhn7C01dT6ktMmPR6tJfI1WI2gu"
    },
    {
        "title": "Chocolate Almond Banana Overnight Oats",
        "ingredients": [
            "1/2 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1/2 cup low-fat milk ADVERTISEMENT",
            "1/4 cup plain yogurt ADVERTISEMENT",
            "1 tablespoon almond butter ADVERTISEMENT",
            "1/2 banana, sliced ADVERTISEMENT",
            "1 tablespoon chopped dark chocolate ADVERTISEMENT",
            "1 teaspoon chia seeds ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 pinch sea salt (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add Quaker(R) Oats to a container of your choice and pour in milk.\nAlternate between layers of yogurt, almond butter, and banana.\nTop with dark chocolate, chia seeds, and honey.\nRefrigerate overnight and enjoy in the morning!\nTop with additional dark chocolate, sliced almonds, and maple syrup if desired.\n",
        "picture_link": "skxya/nEgcLkHgNGXouUPxOHabaZV0K"
    },
    {
        "title": "Peanut Butter Banana Berry Oat Smoothie",
        "ingredients": [
            "1/4 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1/2 frozen banana ADVERTISEMENT",
            "1/2 cup blueberries ADVERTISEMENT",
            "2 tablespoons peanut butter ADVERTISEMENT",
            "1/2 cup low-fat milk ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/2 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients in a blender and blend until smooth.\nGarnish with additional sliced bananas and oats, if preferred.\n",
        "picture_link": "lKykmy2.uBW4BNoizB8V53foFX25wVC"
    },
    {
        "title": "Sfouf (Lebanese Turmeric Cake)",
        "ingredients": [
            "1 tablespoon tahini ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "2 teaspoons whole anise seeds ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground turmeric ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/4 teaspoons anise seed powder ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "2 tablespoons pine nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking pan with tahini.\nCombine boiling water and anise seeds in a glass measuring cup; let steep, about 5 minutes. Strain into a bowl; stir in sugar until dissolved. Discard anise seeds.\nMix flour, turmeric, baking powder, and anise seed powder together in a bowl. Make a well in the center; mix in oil and butter. Stir in sweetened anise water until batter is the consistency of thick yogurt.\nPour batter into the prepared baking pan. Score top into diamond shapes with the tip of a knife; place 1 pine nut in the center of each diamond.\nBake in the preheated oven until top is lightly browned, about 30 minutes.\n",
        "picture_link": "f8i/RholWtBmib/l3b/txkhMj0sc7Xy"
    },
    {
        "title": "Southwest Chicken and Corn Bread Salad ",
        "ingredients": [
            "1 cup ranch dressing ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "6 stale corn bread muffins, coarsely crumbled ADVERTISEMENT",
            "1 (16 ounce) can pinto beans, rinsed and drained ADVERTISEMENT",
            "1/2 cup canned corn ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers (such as Ortega®) ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/2 cup diced bell pepper ADVERTISEMENT",
            "2 cups shredded cooked chicken ADVERTISEMENT",
            "2 tablespoons crumbled cooked bacon ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "1/2 cup diced tomatoes ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ranch dressing and salsa together in a small bowl.\nLayer 1/2 of the corn bread crumbles, pinto beans, corn, green chile peppers, and olives in a large bowl; cover with 1/2 of the dressing mixture. Layer bell pepper, chicken, bacon, onion, and tomatoes over dressing. Top with remaining corn bread crumbles and dressing mixture. Sprinkle Cheddar cheese on top. Cover with plastic wrap and refrigerate until flavors combine, 3 to 4 hours.\n",
        "picture_link": "8YlZopJJvIrBRUA3hbcEanPEOI2I45S"
    },
    {
        "title": "Rye Bread Boat Dip",
        "ingredients": [
            "3 cups sour cream ADVERTISEMENT",
            "3 cups mayonnaise ADVERTISEMENT",
            "2 (2 ounce) packages dried chipped beef ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "2 teaspoons seasoned salt (such as Spice Islands® Beau Monde Seasoning) ADVERTISEMENT",
            "2 teaspoons chopped fresh dill ADVERTISEMENT",
            "1 (1 pound) loaf rye bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sour cream, mayonnaise, chipped beef, parsley, onion, seasoned salt, and dill in a bowl until dip is well mixed; chill in refrigerator for 24 hours.\nCut the top off the rye bread and scoop out the bread, breaking into bite-size pieces. Fill bread \"boat\" with dip. Place bread \"boat\" on a serving tray and arrange the bread pieces around it.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Guinness® Anniversary Cheesecake ",
        "ingredients": [
            "1 1/2 cups crushed digestive biscuits ADVERTISEMENT",
            "1/4 cup unsalted butter, cubed ADVERTISEMENT",
            "2 1/3 cups Irish stout beer (such as Guinness®) ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 (8.8 ounce) containers mascarpone cheese ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "8 sheets gelatin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix digestive crumbs and butter together in a bowl. Pour into an 8-inch cake pan and press into an even layer over the bottom using the back of a spoon. Chill until firm, about 30 minutes.\nCombine stout beer and sugar in a saucepan over medium heat. Cook, stirring occasionally, until syrupy and the consistency of caramel, about 40 minutes. Remove from heat and let cool.\nBeat heavy cream in a chilled glass or metal bowl with an electric mixer until soft peaks form.\nWhisk mascarpone cheese and honey together in a bowl. Fold in whipped cream and lemon juice.\nCombine water and gelatin sheets in a microwave-safe bowl. Let gelatin soften, about 5 minutes. Drain. Heat in the microwave until melted, about 10 seconds.\nPour cooled beer mixture over the mascarpone mixture; add gelatin. Beat well until smooth. Spread over the digestive biscuit crust. Chill until set, at least 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mom's Smoked Salmon Salad",
        "ingredients": [
            "2 cups mayonnaise ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "3 tablespoons chopped fresh dill ADVERTISEMENT",
            "2 tablespoons chopped capers ADVERTISEMENT",
            "2 Granny Smith apples, cored and sliced ADVERTISEMENT",
            "1 1/2 cups sweet corn ADVERTISEMENT",
            "1 (3 ounce) package smoked salmon, flaked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mayonnaise, lemon juice, dill, and capers together in a large bowl until smooth. Add apples, corn, and smoked salmon; toss gently until evenly coated. Chill before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blueberry Banana Pecan Overnight Oats",
        "ingredients": [
            "1/2 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1/2 cup low-fat milk ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup Greek yogurt ADVERTISEMENT",
            "1/4 cup blueberries ADVERTISEMENT",
            "1/2 banana, sliced ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1/4 cup pecans, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add Quaker(R) Oats to a container of your choice and pour in milk.\nMix in vanilla extract and cinnamon.\nAlternate between layers of Greek yogurt, blueberries, and banana, then drizzle on honey.\nRefrigerate overnight and enjoy in the morning!\nTop with additional blueberries and pecans, if desired.\n",
        "picture_link": "FZntlhu8GvmOqzXNJHO7N.p9LD5vWfW"
    },
    {
        "title": "Berry Overnight Oats",
        "ingredients": [
            "1/2 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1/2 cup non-fat milk ADVERTISEMENT",
            "1/2 cup non-fat plain Greek yogurt ADVERTISEMENT",
            "1 teaspoon chia seeds (optional) ADVERTISEMENT",
            "1 cup fresh mixed berries and fruit ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add Quaker(R) Oats to your container of choice and pour in milk.\nLayer Greek yogurt, chia seeds and mixed fruit and berries.\nRefrigerate overnight and enjoy in the morning!\n",
        "picture_link": "R7ReraTqu2yUY3qKnqI8GOXGgoa0AMe"
    },
    {
        "title": "Chai Pomegranate Overnight Oats",
        "ingredients": [
            "1/2 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1 chai tea bag ADVERTISEMENT",
            "1/4 cup low-fat vanilla Greek yogurt ADVERTISEMENT",
            "1/2 cup low-fat milk ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/4 cup pomegranate seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add Quaker(R) Oats to a container of your choice and pour in Chai Tea Latte.\nLayer on yogurt and top with honey and pomegranate seeds.\nRefrigerate overnight and enjoy in the morning!\n",
        "picture_link": "8/XZuQZoWOUD1w1DTu8fEIO3bBWClKO"
    },
    {
        "title": "Peanut Butter & Banana Energy Bites",
        "ingredients": [
            "2 1/2 cups Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/4 cup creamy or chunky peanut butter ADVERTISEMENT",
            "1 cup ripe mashed banana ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place oats and cinnamon in large bowl; stir to blend well. Add mashed banana, peanut butter and honey. Stir until ingredients are well blended.\nShape into 24 (about 1-inch diameter) balls. Refrigerate, covered, until chilled. Store leftovers in refrigerator, covered.\n",
        "picture_link": "MbxmLovtiXpNmjI1y3ymNZQCmLuBWOC"
    },
    {
        "title": "Apple Cinnamon Walnut Energy Bites",
        "ingredients": [
            "1 1/2 cups Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1 1/2 cups pitted dates ADVERTISEMENT",
            "2 teaspoons flax seeds ADVERTISEMENT",
            "1 cup apple, peeled and chopped fine ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "1/2 cup walnuts ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 pinch sea salt (optional) ADVERTISEMENT",
            "1/4 cup finely chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place oats, dates, flax seeds, apple, cinnamon, 1/2 cup walnuts, and honey in the bowl of a food processor.\nBlend until ingredients form a sticky ball. If desired, add salt to taste preference.\nWith slightly wet hands, form about a tablespoon each into a tight ball.\nRoll in additional chopped walnuts.\nRefrigerate, covered, until chilled. Store leftovers in refrigerator, covered.\n",
        "picture_link": "e.xMiwWSrj9.XXfYSi0/s3gubQJ/2g."
    },
    {
        "title": "Salted Almond Sunflower Energy Bites",
        "ingredients": [
            "2/3 cup Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1 1/3 cups pitted dates ADVERTISEMENT",
            "2 tablespoons flax seeds ADVERTISEMENT",
            "3 tablespoons sunflower seeds, roasted and salted ADVERTISEMENT",
            "1/2 cup almonds, roasted and salted ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients in the bowl of a food processor and mix until a sticky ball forms without over processing.\nWith slightly wet hands, roll a tablespoon of mixture into a tight ball.\nShape into 24 (about 1-inch diameter) balls.\nRefrigerate, covered, until chilled.\nStore leftovers in refrigerator, covered.\n",
        "picture_link": "8..plWEhk2Cxr25Uy30bWt.xusD8r1e"
    },
    {
        "title": "My Man's Cheesy Smoked Meatloaf",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 red onion, coarsely chopped ADVERTISEMENT",
            "3/4 cup Italian-seasoned bread crumbs ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "1 (8 ounce) package shredded smoked mozzarella cheese ADVERTISEMENT",
            "1 teaspoon vegetable oil, or as needed ADVERTISEMENT",
            "4 slices hardwood smoked bacon ADVERTISEMENT",
            "1 1/2 teaspoons Dijon mustard, divided ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce, divided ADVERTISEMENT",
            "1 red bell pepper, sliced into strips ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 (8 ounce) package crumbled aged feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground beef, red onion, bread crumbs, eggs, salt, and pepper together in a large bowl. Divide mixture in half. Press half of the mixture in the bottom of a loaf pan.\nRun 2 fingers lengthwise down the center of the beef mixture. Fill hollowed space with mozzarella cheese. Mold remaining beef mixture around cheese, pressing down firmly.\nHeat oil in a large skillet over medium-high heat. Cook bacon slices until lightly browned, about 5 minutes. Arrange bacon slices over beef mixture.\nCook and stir 3/4 teaspoon mustard and 3/4 teaspoon Worcestershire sauce in the bacon grease in the skillet for 1 minute. Add bell pepper; cook until softened, 3 to 4 minutes. Spread bell pepper over bacon.\nPlace remaining mustard, Worcestershire sauce, and mushrooms in the skillet; cook and stir until soft, about 5 minutes. Spread evenly over bell pepper. Scatter feta cheese over mushrooms.\nCover loaf pan with aluminum foil; place on top of a baking sheet.\nBake in the preheated oven until an instant-read thermometer inserted into the beef reads at least 160 degrees F (71 degrees C), 60 to 90 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gooey Lobster Mac and Cheese",
        "ingredients": [
            "1 (16 ounce) package cavatappi (corkscrew pasta) ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "2 (8 ounce) packages shredded Swiss cheese, divided ADVERTISEMENT",
            "2 (8 ounce) packages shredded sharp Cheddar cheese, divided ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "12 ounces chopped cooked lobster meat ADVERTISEMENT",
            "1/4 cup lobster cooking liquid ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook cavatappi in the boiling water, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain.\nPreheat oven to 375 degrees F (190 degrees C).\nMelt butter in a saucepan over medium-low heat. Stir in flour until a paste forms, about 2 minutes. Stir in heavy cream slowly; cook until heated through, 3 to 5 minutes. Add 1 package Swiss cheese and 1 package Cheddar cheese; stir until melted, about 2 minutes. Season sauce with nutmeg, salt, and pepper.\nCombine cooked pasta, sauce, lobster, and lobster cooking liquid in a large bowl. Stir in half of the remaining Swiss cheese and Cheddar cheese. Transfer to a 9x13-inch baking dish. Sprinkle remaining Swiss cheese and Cheddar cheese on top.\nBake in the preheated oven until cheeses are melted and bubbly, 20 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pork Chops with Apple Mustard Sauce and Colcannon",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 boneless pork chops ADVERTISEMENT",
            "1/4 cup beer ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 large apple, peeled and sliced ADVERTISEMENT",
            "Colcannon: ADVERTISEMENT",
            "4 potatoes, peeled ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "4 ounces chopped curly kale ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium-high heat. Cook chops until browned, about 3 minutes per side. Reduce heat to low; stir in beer, soy sauce, honey, Dijon mustard, and garlic. Add apple slices; simmer until tender, about 10 minutes.\nPlace potatoes in a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer potatoes until tender, about 20 minutes. Drain and return potatoes to the pot.\nCombine butter and milk in a saucepan over medium heat; heat until butter is melted, 3 to 5 minutes. Add kale and simmer until softened, 5 to 10 minutes. Pour over warm boiled potatoes; mash well. Season colcannon with salt and pepper.\nServe pork chops and apple slices over colcannon.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lemon Cinnamon Pancakes ",
        "ingredients": [
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 lemon, halved ADVERTISEMENT",
            "1 tablespoon confectioners' sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat, about 1 minute.\nPour melted butter into a bowl. Add milk, egg, and honey; blend well. Stir in flour and cinnamon until batter is just combined.\nDrop spoonfuls of batter into the buttered skillet. Cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\nSqueeze lemon juice over pancakes. Sprinkle confectioners' sugar on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Boxty with Liver and Bacon",
        "ingredients": [
            "1 cup self-rising flour ADVERTISEMENT",
            "5 tablespoons milk ADVERTISEMENT",
            "1 pound potatoes, peeled and coarsely grated ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons butter, divided ADVERTISEMENT",
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon dried mixed herbs ADVERTISEMENT",
            "8 ounces lamb's liver, cut into thin strips ADVERTISEMENT",
            "8 slices bacon ADVERTISEMENT",
            "6 ounces shredded cabbage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift self-rising flour into a bowl; stir in milk. Squeeze excess moisture from the grated potatoes and mix in. Season with salt and pepper.\nMelt 1 1/2 teaspoon butter with 1 teaspoon oil in a large skillet over medium heat. Spread a quarter of the potato mixture in the skillet; cook until golden brown, 3 to 4 minutes per side. Repeat 3 times with remaining butter, oil, and potato mixture. Stack potato pancakes on a plate and keep warm.\nMix all-purpose flour, mixed herbs, salt, and pepper in a bowl. Roll liver strips in the flour mixture until evenly coated.\nHeat remaining 2 teaspoons oil in the skillet. Cook and stir liver strips in the hot oil until golden brown, 2 to 3 minutes.\nCook bacon slices in the same skillet, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels.\nBring a large pot of lightly salted water to a boil. Add cabbage; cook until wilted, about 3 minutes. Drain.\nServe warm potatoes pancakes topped with liver, bacon, and cabbage. Season with black pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate and Guinness® Cake",
        "ingredients": [
            "1 cup Irish stout beer (such as Guinness®) ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 splash vanilla extract ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9-inch cake pan with parchment paper; grease parchment paper.\nCombine stout beer and butter in a large saucepan over medium-low heat; heat until butter melts and beer looks glossy, 3 to 5 minutes.\nRemove beer mixture from heat; whisk in sugar and 3/4 cup plus 2 tablespoons cocoa powder until dissolved and smooth. Whisk in 1/2 cup plus 2 tablespoons sour cream. Mix in eggs and vanilla extract until well blended. Add baking soda; mix in flour gradually until batter thickens and no lumps remain, about 5 minutes.\nPour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 40 minutes. Cool cake before serving, at least 4 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Jalapeno-Spiked Lobster",
        "ingredients": [
            "Jalapeno-Cilantro Cream: ADVERTISEMENT",
            "1 cup light mayonnaise ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/4 cup coarsely chopped fresh cilantro ADVERTISEMENT",
            "3 tablespoons fresh lime juice ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon grated lime zest ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Lobsters: ADVERTISEMENT",
            "12 cups water, or as needed ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "6 jalapeno peppers, seeded and sliced ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "1 lime, halved ADVERTISEMENT",
            "4 (2 pound) lobsters ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mayonnaise, minced jalapeno pepper, cilantro, lime juice, sugar, lime zest, cumin, and 1/2 teaspoon salt in a bowl; stir until smooth. Chill until serving.\nCombine water, chicken broth, sliced jalapeno peppers, 3 tablespoons salt, and lime in a large Dutch oven; bring to a boil. Add lobsters; cook until bright red, 8 to 10 minutes. Drain and cool until easily handled, 5 to 10 minutes.\nRemove meat from lobster shells, tails, and claws. Serve with mayonnaise-cilantro mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spanish Farro",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup finely diced onions ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt, or to taste ADVERTISEMENT",
            "2 teaspoons cumin ADVERTISEMENT",
            "2 teaspoons ancho chile powder ADVERTISEMENT",
            "1 teaspoon chipotle chile powder ADVERTISEMENT",
            "3 tablespoons tomato paste ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1 cup pearled farro, rinsed, drained well ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt butter in a heavy skillet with a tight-fitting lid over medium heat. Add onions and salt; cook and stir until onions have softened up and turned translucent, about 5 minutes. Add cumin, ancho chili powder, and chipotle chili powder; cook and stir about 1 minute. Add tomato paste; cook and stir about 2 minutes over medium heat. Add oregano and drained farro. Stir until farro is completely coated with the spice/butter mixture, about 2 minutes.\nPour in chicken broth. Raise heat to high and bring to a simmer. As soon as mixture starts to bubble, stir, and cover. Remove from heat.\nPlace pan in preheated oven and bake until farro is tender, 50 to 60 minutes. Fluff grains with a fork.\n",
        "picture_link": "/So7iVl3rs09jRQ.oVhvfbSl7ui2.QG"
    },
    {
        "title": "Squid Ink Pasta with Calamari",
        "ingredients": [
            "1 tablespoon avocado oil, or as needed ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "5 squid, cleaned and cut into 1/2-inch rings ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "10 cups water, divided ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "1 (16 ounce) package uncooked black squid ink pasta ADVERTISEMENT",
            "1 shallot, chopped ADVERTISEMENT",
            "2 scallions, sliced diagonally ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 splash white wine ADVERTISEMENT",
            "1 teaspoon lemon juice, or to taste ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon sweet paprika ADVERTISEMENT",
            "1/4 teaspoon dried roasted garlic ADVERTISEMENT",
            "1/4 teaspoon Parisian herb blend ADVERTISEMENT",
            "1 pint heavy whipping cream, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat avocado oil in a deep skillet over medium heat; cook and stir minced garlic until fragrant, about 1 minute. Stir in squid and a pinch of salt. Pour 2 cups water and 1 cup wine over squid, ensuring squid is fully submerged. Cover skillet and bring liquid to a boil; reduce heat and simmer until squid is tender, about 40 minutes.\nBring 8 cups generously salted water to a boil in a pot. Cook squid ink pasta at a boil until tender yet firm to the bite, about 11 minutes. Drain, reserving pasta water.\nRemove squid from skillet and place in a bowl. Add shallot and scallions to skillet; cook and stir in the remaining liquid for about 3 minutes. Stir in butter, a splash of white wine, lemon juice, basil, paprika, dried roasted garlic, Parisian herb blend, salt, and pepper. Slowly pour in cream until sauce reaches desired color and consistency.\nMix squid into the sauce and cook until sauce reduces and thickens, about 5 minutes. Add some of the reserved pasta water if sauce gets too thick. Add pasta to sauce; toss to coat lightly with sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ossobuco alla Milanese",
        "ingredients": [
            "4 veal shanks, sliced for ossobuco ADVERTISEMENT",
            "1 dash all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter, or to taste ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1 tablespoon chopped carrot ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 tablespoon tomato puree ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup beef stock ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 lemon, zested ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slit the skin around the veal shanks in 2 or 3 places so that slices do not curl when cooked. Dust veal shanks with flour.\nHeat butter and olive oil in a large skillet over medium heat. Add onion and carrot; cook and stir until softened, about 5 minutes. Add veal shanks; cook until browned, 3 to 5 minutes per side. Pour in white wine and simmer until reduced, about 5 minutes.\nStir tomato puree, salt, and pepper into the skillet. Pour in beef stock gradually, stirring between each addition. Reduce heat to medium-low, cover, and cook, turning veal shanks occasionally, until tender, about 55 minutes.\nMix parsley and lemon zest together in a small bowl. Stir into the skillet. Cook until flavors combine, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Banana Almond Pancakes",
        "ingredients": [
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup ground almonds ADVERTISEMENT",
            "1/4 cup ground flax seeds ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 cup almond milk ADVERTISEMENT",
            "2 bananas, mashed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix whole wheat flour, ground almonds, ground flax seeds, sugar, baking powder, salt, and baking soda together in a bowl.\nWhisk almond milk, bananas, egg, vegetable oil, and vanilla extract together in a separate bowl. Mix into the whole wheat flour mixture until batter is just combined.\nMelt butter on a griddle over medium heat. Drop 1/3 cup batter onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate and Baileys® Two-Tier Cheesecake",
        "ingredients": [
            "1 3/4 cups crushed digestive biscuits ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons hot water ADVERTISEMENT",
            "1 1/4 cups heavy whipping cream, divided ADVERTISEMENT",
            "5 ounces dark chocolate, melted and cooled ADVERTISEMENT",
            "14 ounces cream cheese, softened, divided ADVERTISEMENT",
            "1 1/2 tablespoons white sugar, divided ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix crushed digestive biscuits with melted butter in a bowl; press into the bottom of a 7-inch cake pan. Refrigerate until firm, about 30 minutes.\nDissolve cocoa powder in hot water in a small bowl.\nPour half of the heavy cream into a bowl; whisk with an electric mixer until soft peaks form. Fold in cocoa powder mixture and melted chocolate until well blended.\nBeat half of the cream cheese and 2 1/2 teaspoons sugar together in a bowl. Fold in chocolate mixture until thoroughly combined. Spread over digestive biscuit crust. Chill until set, 2 to 3 hours.\nCombine remaining cream cheese, remaining sugar, and Irish cream liqueur in a bowl; beat until blended.\nWhisk remaining heavy cream in a separate bowl with an electric mixer until soft peaks form. Fold into the cream cheese mixture. Spread gently over chocolate layer in the pan.\nChill until set, 2 to 3 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Honey Bun Cake from Scratch",
        "ingredients": [
            "3/4 cup butter, softened, divided ADVERTISEMENT",
            "2 cups white sugar, divided ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon clear imitation vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups sour cream ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nGrease a fluted tube pan (such as Bundt(R)) with 2 tablespoons butter. Add 1/4 cup sugar; shake pan gently until sides are evenly coated with sugar.\nCombine remaining 2/3 cup butter and 1 3/4 cup sugar in a large bowl; beat with an electric mixer until light and fluffy. Add eggs one at a time, beating well after each addition. Mix in vanilla extract.\nMix flour, baking powder, and salt together in a bowl. Beat flour mixture into the butter mixture alternately with sour cream, beginning and ending with flour mixture and beating batter well after each addition.\nMix brown sugar and cinnamon together in a small bowl.\nPour 1/3 of the batter into the prepared pan. Sprinkle 1/2 of the brown sugar-cinnamon mixture over the batter. Repeat once more. Pour remaining batter on top. Swirl batter with a butter knife.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pan for 5 minutes; invert onto a wire rack to cool completely.\n",
        "picture_link": "iJ74CDLUE3n.gYjesds0x5UTVQm3WHO"
    },
    {
        "title": "Chicken and Mushroom Crepes ",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "5 tablespoons butter, divided ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "3 boneless, skinless chicken breasts, cut into chunks ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1/3 cup finely chopped onion ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "3 tablespoons dry sherry ADVERTISEMENT",
            "2 teaspoons dried parsley, divided ADVERTISEMENT",
            "Crepes: ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon butter and oil in a large skillet over medium heat. Cook and stir chicken until no longer pink in the center, about 5 minutes. Transfer to a plate.\nMelt remaining 1/4 cup butter in the same skillet over medium heat. Add mushrooms and onion; cook and stir until softened, about 5 minutes. Stir in 1/4 cup flour and cook for 2 minutes. Reduce heat to low. Add 2 cups milk, chicken bouillon cubes, salt, and pepper; cook and stir until thickened into a sauce, about 5 minutes. Stir in sour cream and sherry.\nScoop 1 cup sauce into a bowl; keep warm. Stir chicken and 1 teaspoon parsley into remaining sauce in the skillet. Simmer until chicken is heated through, about 5 minutes.\nBeat 1 cup milk, 3/4 cup flour, egg, 1 tablespoon melted butter, sugar, vanilla extract, and baking powder together in a bowl to make crepe batter.\nGrease a 7-inch skillet lightly; heat over medium heat. Pour 2 tablespoons batter into the skillet, swirling to spread evenly. Cook crepe until golden brown, about 30 seconds per side. Transfer crepe to a plate. Repeat with remaining batter, separating crepes with waxed paper and covering to keep warm.\nScoop 1/4 cup chicken mixture onto each crepe and roll up. Spoon reserved 1 cup sauce over filled crepes. Garnish with remaining 1 teaspoon parsley.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Salmon in Orange Dijon Cream Sauce",
        "ingredients": [
            "3 cups heavy whipping cream ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "6 (4 ounce) fillets salmon ADVERTISEMENT",
            "1 lemon, sliced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine heavy cream, milk, water, orange juice, butter, mustard, honey, and salt in a pot; bring to a boil. Reduce heat and simmer, stirring frequently, until sauce thickens, 20 to 25 minutes.\nHeat olive oil in a large skillet over medium heat; cook salmon until fish flakes easily with a fork, about 10 minutes per side.\nTransfer salmon to a serving plate and top with sauce. Squeeze lemon slices over salmon.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Italian Smoked Sausage Sandwich",
        "ingredients": [
            "1 (14 ounce) package Hillshire Farm® Smoked Sausage, cut into 1-inch pieces ADVERTISEMENT",
            "1/2 cup thinly sliced yellow onion ADVERTISEMENT",
            "1 cup thinly sliced red bell pepper ADVERTISEMENT",
            "1 cup tomato sauce ADVERTISEMENT",
            "4 hoagie buns ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven at 425 degrees F.\nHeat a large skillet over medium-high heat. Cook the sausage, onions and peppers in the tomato sauce for 8-10 minutes, stirring often. Spoon the mixture into buns and place on a baking sheet, top with shredded cheese. Bake for 3-5 minutes, just until the cheese has melted.\n",
        "picture_link": "hg7djPzEMcEdcXaeRl.siJ1ptOMlFiq"
    },
    {
        "title": "Stewed Chicken and Sausage",
        "ingredients": [
            "1 (2 to 3 pound) chicken, cut into 8 pieces ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper, or to taste, divided ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 pinch dried sage, or to taste ADVERTISEMENT",
            "1 pinch dried thyme, or to taste ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 pound smoked sausage, cut into 1/2-inch slices ADVERTISEMENT",
            "2 cups sliced onions ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "4 bay leaves ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken pieces with salt, pepper, and 1/4 teaspoon of cayenne pepper.\nMix remaining 1/4 teaspoon of cayenne pepper with flour, sage, and thyme in a bowl. Dredge chicken pieces in the flour mixture, coating each side completely.\nHeat oil in a Dutch oven over medium heat. Cook chicken in the hot oil, turning occasionally, until evenly browned, 5 to 6 minutes. Stir in sausage; cook until browned, 5 to 6 minutes. Add onions; cook until softened, 5 to 6 minutes.\nStir chicken stock, garlic, and bay leaves into the Dutch oven; cover and cook until chicken is very tender, about 3 hours. Stir in green onions before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mashed Purple Sweet Potato",
        "ingredients": [
            "1 purple sweet potato ADVERTISEMENT",
            "1 teaspoon coconut oil ADVERTISEMENT",
            "3 tablespoons boiled peanuts ADVERTISEMENT",
            "1 tablespoon peanut butter ADVERTISEMENT",
            "1 tablespoon coconut cream, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sweet potato into a pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain.\nPeel sweet potato; mash in a bowl.\nHeat coconut oil in a skillet over medium heat; cook and stir mashed sweet potato until moisture evaporates, about 5 minutes.\nPlace sweet potato in a bowl and top with boiled peanuts, peanut butter, and coconut cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Purple Yam Jam",
        "ingredients": [
            "1 pound purple yam root, unpeeled ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (10 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Cook yam in the boiling water until tender, about 30 minutes. Drain and cool until easily handled. Peel and thinly grate the flesh.\nMelt butter in a wok over medium heat. Stir in condensed milk and vanilla extract. Add grated purple yam. Reduce heat to low and cook, stirring constantly, until mixture is sticky but not dry, about 30 minutes. Pour in evaporated milk; cook and stir for 15 minutes. Remove from heat.\nTransfer yam mixture to a container and cool to room temperature, about 30 minutes. Chill before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Stewed Chicken",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "4 chicken leg quarters ADVERTISEMENT",
            "3 cups water, or more as needed ADVERTISEMENT",
            "1/4 cup tomato paste, or more as needed ADVERTISEMENT",
            "2 tablespoons ground paprika ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon saffron threads, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a Dutch oven or a large heavy pot over medium-high heat; saute onion until browned, 5 to 7 minutes. Add chicken and cook until browned, 2 to 3 minutes per side.\nMix water, tomato paste, paprika, cinnamon, turmeric, salt, pepper and saffron together in a bowl; pour over chicken. Add more water if chicken isn't completely covered in liquid. Cover Dutch oven and cook over medium-low heat until chicken falls off the bone, about 1 1/2 hours.\nCarefully transfer chicken to a glass serving dish. If sauce is not the consistency of gravy, add 1 to 2 tablespoons tomato paste and simmer over medium-low until it reduces to a thick gravy, about 5 minutes. Pour sauce over chicken.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Garlic Shrimp and Asparagus Risotto",
        "ingredients": [
            "1 (32 ounce) container chicken broth ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/3 onion, chopped ADVERTISEMENT",
            "1/2 clove garlic, minced ADVERTISEMENT",
            "3 cups Arborio rice ADVERTISEMENT",
            "1 pound raw shrimp, peeled and deveined ADVERTISEMENT",
            "1 pound fresh asparagus, cut into thirds ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour chicken broth into a pot; bring to a simmer over medium-low heat.\nHeat olive oil in a large saucepan over medium heat. Cook and stir onion and garlic in the hot oil until slightly softened, about 2 minutes. Add Arborio rice; cook, stirring frequently, until coated with oil, about 4 minutes.\nStir 1 cup of the hot chicken broth into the saucepan; cook and stir until the rice has absorbed the broth, about 2 minutes. Repeat this process 4 more times, stirring constantly, until rice is creamy and tender yet firm to the bite, about 15 minutes.\nStir shrimp and asparagus into the remaining hot broth. Cook until shrimp turns pink, 2 to 3 minutes. Remove broth from heat.\nStir shrimp and asparagus into the rice; cook for 1 minute. Stir Parmesan cheese and butter into the rice; cook until melted, about 1 minute. Remove rice from heat. Season with salt and pepper. Sprinkle parsley over each serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Una Grant's Wheaten Bread",
        "ingredients": [
            "3 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups buttermilk ADVERTISEMENT",
            "1 tablespoon sesame seeds, or more to taste (optional) ADVERTISEMENT",
            "1 tablespoon pumpkin seeds, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly flour a 2-pound loaf pan.\nSift whole wheat flour, baking soda, and salt into a large bowl. Stir in buttermilk gently. Bring dough together using your hands. Sprinkle sesame seeds and pumpkin seeds over the dough; toss dough around the bowl a few times to coat with seeds. Transfer to the prepared loaf pan.\nBake in the preheated oven until top is browned and the loaf sounds hollow when tapped on the bottom, about 40 minutes. Wrap loaf in a clean dish towel and let cool completely, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Oh-So-Good Chicken Vegetable Soup",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "6 bone-in chicken thighs ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 (32 ounce) carton chicken broth ADVERTISEMENT",
            "1 head broccoli, trimmed and chopped ADVERTISEMENT",
            "1/4 head cauliflower, trimmed and chopped ADVERTISEMENT",
            "1 zucchini, trimmed and chopped (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water and chicken thighs in a pot. Bring to a boil; reduce heat and simmer until chicken is tender, about 30 minutes. Occasionally skim off scum as it forms.\nHeat olive oil in a large pot over medium heat. Cook and stir carrots and onions until they begin to soften, 3 or 4 minutes. Stir in garlic and salt; cook for 1 minute.\nTransfer chicken and cooking water to large pot. Add chicken broth. Bring mixture to a boil; reduce heat to low. Cover, leaving lid slightly ajar, and simmer at least 1 hour or up to 4 hours. Remove from heat.\nTransfer chicken to a work surface. Remove skin, bones, and cartilage. Shred chicken meat using 2 forks. Return chicken to pot. Add broccoli, cauliflower, and zucchini. Bring back to a simmer over medium-high heat. Reduce heat so soup gently simmers. Cook until vegetables are tender, 20 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Smoked Haddock Chowder",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 large carrot, peeled and diced ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh thyme ADVERTISEMENT",
            "3 1/4 cups fish stock ADVERTISEMENT",
            "14 ounces smoked haddock ADVERTISEMENT",
            "2 large potatoes, quartered ADVERTISEMENT",
            "1/3 cup light cream ADVERTISEMENT",
            "salt and freshly ground pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat. Add onion and carrot; cook and stir until slightly softened, about 5 minutes. Stir in thyme. Pour in fish stock.\nStir smoked haddock into the saucepan; cook for 5 minutes. Transfer to a plate using a slotted spoon. Add potatoes to the saucepan; cook until tender, about 15 minutes. Return the haddock to the saucepan. Pour in cream and cook until heated through, about 5 minutes.\nSeason chowder with salt and pepper. Garnish with parsley.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Purple Sweet Potato Whole Wheat Bun",
        "ingredients": [
            "2 1/4 cups bread flour ADVERTISEMENT",
            "1 1/2 cups cooked and mashed purple sweet potatoes ADVERTISEMENT",
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "3/4 cup cake flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "6 tablespoons brown sugar ADVERTISEMENT",
            "1/3 cup water, or more as needed ADVERTISEMENT",
            "5 1/2 tablespoons butter, melted ADVERTISEMENT",
            "2 tablespoons milk powder ADVERTISEMENT",
            "2 1/2 teaspoons instant dry yeast ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix bread flour, sweet potatoes, whole wheat flour, cake flour, eggs, brown sugar, water, butter, milk powder, yeast, and salt together in a bowl until dough holds together, adding more water if dough is too dry. Transfer dough to a floured surface and knead until smooth and elastic, 6 to 8 minutes.\nPlace dough in an oiled bowl and cover with plastic wrap or a damp towel. Place bowl in a warm place and let sit until doubled in size, about 1 hour.\nPunch dough down and cut into 16 pieces, rolling them into balls. Place dough balls on oiled baking sheets, cover, and let rise until doubled in size, about 40 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Remove cover from dough.\nBake in the preheated oven until golden brown on top, 12 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roasted Veggie Buddha Bowl",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup bulgur ADVERTISEMENT",
            "1 sweet potato, peeled and cut into 1-inch cubes ADVERTISEMENT",
            "4 teaspoons olive oil, divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 pound fennel bulb, trimmed and cut into 1-inch cubes ADVERTISEMENT",
            "1 small red onion, cut into 1-inch pieces ADVERTISEMENT",
            "1 red bell pepper, cut into 1-inch strips ADVERTISEMENT",
            "1 (8 ounce) package tempeh, cut into 1-inch pieces ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "2 teaspoons coconut oil ADVERTISEMENT",
            "Orange-Curry Dressing: ADVERTISEMENT",
            "1/4 cup fresh squeezed orange juice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 teaspoons red wine vinegar ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons raw pumpkin seeds (pepitas) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nBring water and bulgur to a boil in a saucepan; cover and reduce heat to medium-low. Simmer until water is absorbed and bulgur is soft, about 12 minutes. Keep warm.\nPlace sweet potato in a bowl and drizzle 1 teaspoon olive oil over it; season with salt and pepper. Toss to coat. Transfer sweet potato to the prepared baking sheet, placing in 1 row. Place fennel in the same bowl, add 1 teaspoon olive oil, and season with salt and pepper. Toss to coat and place fennel next to sweet potato, keeping each separate.\nRoast in the preheated oven for 10 minutes. Place red onion in the same bowl; add 1 teaspoon olive oil, and season with salt and pepper. Toss to coat and place on the baking sheet with sweet potato and fennel, keeping them separate. Place red bell pepper in the same bowl; add 1 teaspoon olive oil, and season with salt and pepper. Toss to coat and place on the baking sheet next to the onion.\nRoast in the oven until all the vegetables are cooked to desired doneness, 10 to 15 minutes.\nPlace tempeh in a bowl and season with 1/2 teaspoon curry powder, tossing to coat.\nHeat coconut oil in a skillet over medium-high heat; saute tempeh, turning occasionally, until all sides are evenly browned, about 10 minutes.\nWhisk orange juice, 2 tablespoons olive oil, red wine vinegar, 1/2 teaspoon curry powder, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a small bowl until dressing is smooth.\nDivide bulgur between 2 bowls. Place half of sweet potato, fennel, red onion, and red bell pepper around bulgur; top each with 1 tablespoon pumpkin seeds. Drizzle dressing over each bowl.\n",
        "picture_link": "D20/YrS1jjOVAdHAg4T4IQ8Cyr7tXE6"
    },
    {
        "title": "Haupia and Purple Sweet Potato Pie",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3/4 cup butter, cubed ADVERTISEMENT",
            "Sweet Potato Layer: ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups cooked and mashed Japanese purple sweet potatoes ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Haupia Layer: ADVERTISEMENT",
            "1 1/4 cups cold water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "2 (14 ounce) cans coconut milk ADVERTISEMENT",
            "2 cups shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nMix flour and 1/3 cup white sugar together in a large bowl. Rub in butter with your fingers until mixture is sandy. Press into the greased baking pan.\nBake crust in the preheated oven until golden brown around the edges, about 10 minutes.\nBeat 1/2 cup butter and 1/2 cup white sugar in a bowl with an electric mixer until creamy. Beat in eggs one at a time. Mix in mashed sweet potatoes, milk, and vanilla extract until batter is the consistency of pancake batter. Pour over the crust.\nBake in the preheated oven until sweet potato layer is firm, about 30 minutes.\nWhisk water, 1/2 cup white sugar, and cornstarch together in a small bowl until smooth.\nPour coconut milk into a 5-quart saucepan. Bring to a simmer over low heat, about 5 minutes. Pour in water mixture, whisking constantly until coconut milk thickens, 3 to 5 minutes. Stir in shredded coconut; cook and stir until mixture thickens, about 5 minutes more.\nPour coconut mixture over sweet potato layer. Refrigerate until firm, 4 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Stewed Chicken and Garlic with Noodles",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 pounds chicken legs and thighs on the bone, cut into large chunks ADVERTISEMENT",
            "4 heads garlic, cloves separated and peeled ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon dried tarragon ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 (16 ounce) package egg noodles ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 ounce dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a heavy skillet over medium-high heat. Place chicken pieces in the hot oil. Add garlic cloves, parsley, tarragon, cinnamon, bay leaves, salt, and pepper. Pour in wine and bring to a simmer. Reduce heat to medium-low. Cover and simmer, stirring occasionally, until chicken is tender, about 1 hour.\nPreheat oven to 375 degrees F (190 degrees C). Butter a large baking dish or casserole.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in the egg noodles and bring back to a boil. Cook until tender but slightly firm, about 5 minutes. Drain well.\nStir noodles into chicken in the skillet. Transfer chicken and noodles to prepared baking dish. Mix melted butter and breadcrumbs together and sprinkle on top.\nBake in preheated oven until chicken and noodles are tender, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pizza Rustica",
        "ingredients": [
            "1 (12 ounce) package Italian sausage, casings removed ADVERTISEMENT",
            "2 (8 ounce) packages grated Parmesan cheese ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 1/2 cups ricotta cheese ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (3 ounce) package prosciutto, chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 (9 inch) prepared pie crusts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCook and stir sausage in a large skillet over medium heat until browned, 5 to 8 minutes. Drain.\nMix Parmesan cheese, mozzarella cheese, ricotta cheese, and eggs together in a bowl. Stir in sausage, prosciutto, and parsley.\nRoll 1 pie crust into an 11-inch circle on a lightly floured work surface. Transfer to a pie plate, leaving a 1/2-inch overhang. Pierce crust all over with a fork. Spread cheese and sausage mixture over crust. Roll second pie crust into a 12-inch circle; place on top. Seal and flute edges. Cut several slits in the top crust to permit steam to escape.\nBake in the preheated oven until center is set and crust is browned, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baked Coconut French Toast with Pineapple-Rum Sauce",
        "ingredients": [
            "French Toast: ADVERTISEMENT",
            "6 large eggs ADVERTISEMENT",
            "1 (13.5 ounce) can light coconut milk ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "16 (1 1/4-inch thick) diagonal slices French bread ADVERTISEMENT",
            "1 cup packed sweetened flaked coconut ADVERTISEMENT",
            "Pineapple-Rum Sauce: ADVERTISEMENT",
            "1 (6 ounce) can unsweetened pineapple juice ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "4 1/2 cups frozen pineapple chunks ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons dark rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 13x18-inch sheet pan with parchment paper. Whisk eggs in a deep bowl, then whisk in coconut milk, sugar, vanilla, and salt until sugar is dissolved. Submerge each slice of bread in egg mixture, turning over several times, until saturated, then transfer to prepared sheet pan. Pour remaining egg mixture over bread and chill, covered with plastic wrap, at least 8 hours or up to 24 hours.\nPreheat oven to 350 degrees F (175 degrees C). Press coconut evenly into bread. Bake in upper third of oven until cooked through and golden, 30 to 35 minutes.\nMeanwhile, bring pineapple juice and brown sugar to a simmer over medium heat, stirring. Add pineapple chunks and bring to a boil, stirring, then cook over medium-high heat, stirring occasionally, 10 minutes. Add butter and rum and simmer, stirring, until butter is melted. Keep warm, covered, off heat.\nServe French toast with warm pineapple-rum sauce.\n",
        "picture_link": "o5Dw/0e3pdCLxybRIN92ObM9pgj81Ua"
    },
    {
        "title": "Beef Loc Lac",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "2 tablespoons grated fresh ginger ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 pound beef tenderloin, cut into 1/2-inch cubes ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons peanut oil ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "Rice: ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "3 cups cooked long-grain white rice ADVERTISEMENT",
            "2/3 cup plain tomato sauce ADVERTISEMENT",
            "Lemon Sauce: ADVERTISEMENT",
            "6 tablespoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 large sweet onion, coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix 1/4 cup soy sauce, fish sauce, ginger, and garlic together in a large bowl. Stir in beef cubes. Marinate in the refrigerator for at least 1 hour and up to overnight.\nPreheat oven to 275 degrees F (135 degrees C).\nPlace flour in a shallow bowl. Strain beef into the flour; toss to coat. Reserve marinade.\nHeat peanut oil and 1 teaspoon sesame oil in a large wok or skillet over medium-high heat. Add beef cubes; saute until browned, 3 to 4 minutes. Transfer to an oven-safe plate and place in the oven to keep warm.\nCook eggs in the same wok until scrambled, about 2 minutes. Stir in reserved marinade, 2 tablespoons soy sauce, 1 teaspoon sesame oil, and Chinese five-spice powder; cook for 1 minute. Stir rice gradually into the wok until evenly distributed. Pour in tomato sauce; cook and stir until heated through, about 4 minutes.\nWhisk lemon juice, salt, and pepper together in a bowl. Divide evenly among 4 dipping cups.\nServe beef with rice, lemon juice, and chopped onion.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Potato and Orange Salad",
        "ingredients": [
            "1 (6 ounce) sweet potato ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 orange - peeled, segmented, and seeded ADVERTISEMENT",
            "1 tablespoon raisins ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 walnut halves, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sweet potato into a microwave steamer with a rack; add water. Cook in the microwave until sweet potato is soft but not mushy, about 8 minutes. Set aside until cool enough to handle, about 5 minutes.\nPeel cooled sweet potato and cut into 1/2-inch cubes.\nCut each orange segment into 3 pieces. Place sweet potato and orange pieces in a bowl; add raisins.\nMix lemon juice and honey together in a bowl; pour over potato-orange mixture. Add a pinch of salt and sprinkle walnuts over salad.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Oven-Roasted Lamb Ribs",
        "ingredients": [
            "4 pounds lamb ribs ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "3 tablespoons molasses ADVERTISEMENT",
            "3 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons mustard ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "2 small tomatoes, quartered ADVERTISEMENT",
            "2 small thin-skinned sweet peppers, cored and seeded ADVERTISEMENT",
            "1 cup finely chopped parsley ADVERTISEMENT",
            "9 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash ribs thoroughly. Soak in a large bowl of water, changing the water every 30 minutes, to remove excess fat, about 2 hours. Drain and pat dry with paper towels.\nMix lemon juice, molasses, vinegar, mustard, ketchup, cinnamon, curry powder, cumin, salt, and pepper in a large, deep bowl.\nCombine onion, tomatoes, sweet peppers, parsley, garlic, and cayenne pepper in a food processor; pulse to form a paste.\nStir onion paste into the lemon juice mixture in the bowl. Add lamb ribs; turn to coat. Cover with plastic wrap. Marinate in the refrigerator, at least 10 hours.\nPreheat oven to 300 degrees F (150 degrees C).\nLine a large baking sheet with aluminum foil and set a rack on top. Arrange ribs on the rack.\nBake ribs in the preheated oven until fat has rendered and meat is tender, 1 1/2 to 2 hours. Cover ribs with aluminum foil and let rest for 5 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Khao Man Gai Thai Chicken and Rice (Healthy Version)",
        "ingredients": [
            "5 skinless, boneless chicken breasts ADVERTISEMENT",
            "Rice: ADVERTISEMENT",
            "3 cups uncooked jasmine rice ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup sliced ginger ADVERTISEMENT",
            "2 tablespoons crushed garlic ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup water, or as needed ADVERTISEMENT",
            "5 pandan leaves ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 cup chopped ginger ADVERTISEMENT",
            "1/2 cup coarsely chopped garlic ADVERTISEMENT",
            "15 Thai bird chile peppers ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "1/4 cup dark soy sauce ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup salted soybean paste ADVERTISEMENT",
            "10 sprigs fresh cilantro ADVERTISEMENT",
            "1 tablespoon chicken bouillon granules (optional) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts in a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until no longer pink in the center, about 20 minutes. Drain and cool until easily handled.\nPour rice into a strainer. Rinse with cold water and drain. Repeat once more.\nHeat oil in a large saucepan over high heat. Add 1/2 cup sliced ginger and 2 tablespoons crushed garlic; saute until fragrant, 1 to 2 minutes. Stir in rice; reduce heat to medium. Season rice with 1 tablespoon sugar and 1/4 teaspoon salt. Cook and stir until rice turns white, adding water to prevent it from burning, about 10 minutes.\nRemove rice from heat and add pandan leaves. Transfer to a rice cooker. Pour in chicken stock. Cook rice according to manufacturer's instructions until tender. Fluff lightly with a rice paddle.\nCombine 1 cup chopped ginger, 1/2 cup chopped garlic, chile peppers, 6 tablespoons sugar, dark soy sauce, soy sauce, lime juice, vinegar, soybean paste, cilantro, chicken bouillon granules, and 1 teaspoon salt in a blender; blend into a smooth sauce.\nPour sauce into a pot over medium heat. Simmer for 5 minutes.\nSlice chicken and serve over rice, with sauce alongside.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sicilian Pizza Crust",
        "ingredients": [
            "1 cup warm water (95 to 110 degrees F/35 to 43 degrees C) ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine warm water and yeast in a small bowl; stir until yeast is dissolved. Let stand until yeast forms a creamy foam, about 10 minutes.\nPour yeast mixture into a large bowl; add shortening, salt, sugar, and Italian seasoning. Stir in flour by hand until dough comes together.\nTurn dough out on a floured work surface and knead until smooth, 5 to 8 minutes. Transfer to a large greased bowl. Cover with a moist towel and let rise in a warm place until doubled in size, about 45 minutes.\nPunch dough down gently. Let stand for 3 to 5 minutes for air to release. Roll into a ball; spread and stretch over the bottom of a pizza pan. Let rise for 15 minutes before topping and baking.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chow Fun",
        "ingredients": [
            "1/4 cup extra-virgin olive oil, divided ADVERTISEMENT",
            "1 teaspoon Hawaiian sea salt, or to taste ADVERTISEMENT",
            "2 (16 ounce) boxes fettuccine ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (12 ounce) can cooked luncheon meat (such as SPAM®), cut into tiny pieces ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon crushed garlic ADVERTISEMENT",
            "1/4 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "2 (8 ounce) packages bean sprouts ADVERTISEMENT",
            "1 (10 ounce) can sliced mushrooms, drained (optional) ADVERTISEMENT",
            "1 bunch scallions, cut into 1/4-inch pieces ADVERTISEMENT",
            "2 carrots, grated ADVERTISEMENT",
            "1 bunch cilantro, chopped, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with water, 2 tablespoons olive oil, and sea salt; bring to a rolling boil. Stir in fettuccine and cook over medium heat until tender yet firm to the bite, about 8 minutes. Drain and transfer to a large bowl. Toss with butter and black pepper.\nHeat remaining 2 tablespoons olive oil in a large skillet over medium heat. Add ground beef, luncheon meat, Worcestershire sauce, garlic, and liquid smoke; cook and stir until beef is browned, 8 to 10 minutes. Transfer beef mixture to a plate lined with paper towels using a slotted spoon.\nStir bean sprouts, mushrooms, scallions, carrots, and half of the cilantro into the grease in the skillet. Cook and stir until bean sprouts are wilted, 3 to 4 minutes. Return beef mixture to the skillet; stir until reheated, about 2 minutes.\nMix beef and bean sprout mixture into the fettucine in the bowl. Garnish with remaining cilantro.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Millionaire's Shortbread Bars (Vegan and Gluten Free)",
        "ingredients": [
            "Shortbread Layer: ADVERTISEMENT",
            "1 1/2 cups almond flour ADVERTISEMENT",
            "1/4 cup grapeseed oil ADVERTISEMENT",
            "3 tablespoons agave syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "Caramel Layer: ADVERTISEMENT",
            "11 Medjool dates, pitted ADVERTISEMENT",
            "1/4 cup hot water ADVERTISEMENT",
            "1/4 cup almond butter ADVERTISEMENT",
            "Chocolate Layer: ADVERTISEMENT",
            "6 1/2 tablespoons raw cacao powder ADVERTISEMENT",
            "1/3 cup coconut oil, melted ADVERTISEMENT",
            "2 tablespoons agave syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a loaf pan with parchment paper.\nMix almond flour, grapeseed oil, 3 tablespoons agave syrup, vanilla extract, and salt together in a bowl. Press evenly into the bottom of the loaf pan to create the crust.\nBake in the preheated oven until pale golden, about 20 minutes. Let cool.\nProcess dates into a paste in a food processor. Add hot water and almond butter; process until very smooth. Spread mixture evenly over the crust.\nWhisk cacao powder, coconut oil, and agave syrup together in a bowl. Pour over date layer.\nRefrigerate until cacao layer is firm, 8 hours to overnight. Cut into squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lasagne Alla Bolognese Saporite",
        "ingredients": [
            "Bolognese Sauce: ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "3 1/2 ounces prosciutto, chopped ADVERTISEMENT",
            "11 ounces ground pork ADVERTISEMENT",
            "11 ounces ground beef ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "6 fluid ounces red wine ADVERTISEMENT",
            "21 ounces peeled San Marzano tomatoes ADVERTISEMENT",
            "White Sauce: ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "3 1/4 cups milk ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "Lasagna Layers: ADVERTISEMENT",
            "11 ounces lasagna noodles ADVERTISEMENT",
            "2 1/2 cups grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium heat; cook and stir onion, carrot, shallot, and prosciutto until onion is translucent and prosciutto releases some fat, about 10 minutes. Add pork and beef; season with 1 teaspoon nutmeg, cinnamon, and salt to taste. Cook and stir over medium-high heat until browned and crumbly, about 10 minutes.\nPour red wine over meat mixture; increase heat and cook until wine evaporates, about 3 minutes. Add tomatoes and mix well; bring to a boil, cover, reduce heat, and simmer, stirring occasionally, until tomatoes break down and flavors of Bolognese sauce have combined, 1 1/2 to 2 hours.\nMelt butter in a saucepan over medium-low heat; add flour. Whisk vigorously until mixture is smooth. Pour in milk and cook, stirring occasionally, over medium heat until white sauce thickens enough to cover the back of a spoon, about 10 minutes; season with 1/2 teaspoon nutmeg, salt, and pepper.\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Drain and run under cold water to stop the cooking process. Lay noodles on a clean towel and pat dry.\nPreheat oven to 350 degrees F (175 degrees C).\nPour a ladleful of Bolognese sauce and a ladleful of white sauce over the bottom of a 9x13-inch baking dish; top with 3 or 4 lasagna noodles. Cover noodles with 1/3 of the white sauce and 1/3 of the Bolognese sauce. Sprinkle some of the Parmesan cheese on top; cover with lasagna noodles. Repeat layers, ending with white sauce and Parmesan cheese.\nBake in the preheated oven until bubbling and top is golden brown, 30 to 40 minutes. Let stand 3 to 4 minutes before slicing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lemon Pie with Rice Chex® Crust",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "3 1/2 cups crispy rice cereal squares (such as Rice Chex®), finely crushed ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1/2 cup freshly squeezed lemon juice ADVERTISEMENT",
            "1/2 cup butter, cut into pieces ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup heavy cream, chilled ADVERTISEMENT",
            "1 tablespoon grated lemon zest, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir cereal, sugar, and cinnamon together in a bowl; stir in melted butter until mixture is thoroughly moistened. Press mixture onto bottom and up sides of a 9-inch pie plate using a small, dry measuring cup. Bake in preheated oven until crust is browned and crisp, about 17 minutes. Transfer to a wire rack and let cool 15 minutes.\nWhisk whole eggs, yolks, lemon juice, butter, and sugar together in a heat-proof bowl set over a pan of simmering water. Whisk until egg mixture is as thick as honey, 5 to 8 minutes. Remove from heat and strain mixture through a fine-mesh sieve into a bowl. Let cool 30 minutes.\nBeat heavy cream in a bowl with an electric mixer at medium speed until stiff peaks form; gently fold into lemon mixture. Spoon into pie crust and chill 1 hour. Sprinkle with lemon zest.\n",
        "picture_link": "Zwh646QcPbziK5GF/rs6aSUmF5jDaCC"
    },
    {
        "title": "Pepperoni Pizza Pasta Salad",
        "ingredients": [
            "12 ounces penne pasta ADVERTISEMENT",
            "1 small green bell pepper, chopped ADVERTISEMENT",
            "1 small red bell pepper, chopped ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1 (4 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1/4 cup sliced black olives ADVERTISEMENT",
            "1 (3 ounce) package pepperoni slices, cut into quarters ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup Italian-style salad dressing ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain. Transfer to large serving bowl.\nPlace green and red bell peppers, tomato, mushrooms, olives, and pepperoni in the bowl of pasta.\nWhisk mayonnaise, Italian dressing, garlic, oregano, salt, and pepper together in a bowl. Pour over pasta mixture and toss to coat evenly. Top with mozzarella cheese and grated Parmesan cheese. Refrigerate at least 1 hour to chill before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kelli's Chicken Lasagna Rolls",
        "ingredients": [
            "10 uncooked lasagna noodles ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella, divided ADVERTISEMENT",
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 green bell pepper, chopped (optional) ADVERTISEMENT",
            "1/2 (8 ounce) package sliced fresh mushrooms (optional) ADVERTISEMENT",
            "1 (28 ounce) jar spaghetti sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally, until tender yet firm to the bite, about 8 minutes. Drain and pat dry with a paper towel.\nMix ricotta cheese, spinach, and half of the mozzarella cheese together in a bowl.\nPreheat oven to 375 degrees F (190 degrees C).\nHeat oil in a large skillet over medium heat. Add chicken breasts; cook until they turn white, 2 to 3 minutes per side. Add green bell pepper and mushrooms; cook and stir until softened, 3 to 4 minutes.\nCut chicken breasts into small pieces. Transfer to a large bowl; mix in bell pepper, mushrooms, and spaghetti sauce.\nLay 1 noodle on a flat work surface. Spread some of the ricotta cheese mixture on top. Roll up and place seam-side down in a baking dish. Repeat with remaining noodles and ricotta cheese mixture. Pour chicken and sauce mixture over noodles. Cover baking dish with aluminum foil.\nBake in the preheated oven until sauce is bubbly, about 25 minutes. Remove foil and sprinkle remaining mozzarella cheese on top. Continue baking, uncovered, until cheese is melted, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chickpea \"Tuna\" Salad Sandwiches",
        "ingredients": [
            "Chickpea \"Tuna\" Salad: ADVERTISEMENT",
            "1/2 sheet nori (dried seaweed), torn into small pieces ADVERTISEMENT",
            "1 (15 ounce) can no-salt-added chickpeas, drained and rinsed ADVERTISEMENT",
            "1/4 cup vegan mayonnaise ADVERTISEMENT",
            "1/3 cup minced or finely grated carrot ADVERTISEMENT",
            "1/3 cup finely diced celery ADVERTISEMENT",
            "2 tablespoons dried minced onion ADVERTISEMENT",
            "2 tablespoons fresh dill ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "Sandwiches: ADVERTISEMENT",
            "8 slices whole wheat bread, toasted ADVERTISEMENT",
            "1/4 cup vegan mayonnaise ADVERTISEMENT",
            "8 lettuce leaves ADVERTISEMENT",
            "8 tomato slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse nori in a blender until it's a fine powder. Set aside to let dust settle.\nMash chickpeas with a sturdy fork or a small-holed potato masher (chickpeas slip through larger, zigzag-type mashers) in a large bowl until most are broken up. Do not overmash--they should retain some texture.\nStir in mayo and mash a little more. Stir in nori powder, carrot, celery, onion, dill, salt, and pepper. Cover and chill at least 15 minutes or up to 3 days.\nFor the sandwiches, slather toast with mayo (about 1 1/2 teaspoons per slice). Layer salad, lettuce, and tomato between toast slices. Cut sandwiches in half diagonally.\n",
        "picture_link": "gRE/PL8yfn9WkkCa0Mo74KjZuikc6AW"
    },
    {
        "title": "Daeji Bulgogi (Pork Bulgogi)",
        "ingredients": [
            "3 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons Korean barbeque sauce ADVERTISEMENT",
            "2 tablespoons Korean hot pepper paste ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon minced ginger root ADVERTISEMENT",
            "2 teaspoons red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon sesame seeds ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 pounds boneless pork shoulder, thinly sliced ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk soy sauce, barbeque sauce, hot pepper paste, sugar, ginger root, red pepper flakes, sesame seeds, and black pepper together in a small bowl.\nPlace pork in a large bowl. Pour soy sauce mixture over pork; toss to coat. Marinate in the refrigerator, at least 3 hours and up to overnight.\nPreheat a large skillet or grill pan over medium-high heat. Add pork, discarding marinade. Cook, stirring frequently, until pork begins to brown, about 5 minutes. Stir in onion; cook until soft, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gnocchi Alla Romana (Baked Semolina Gnocchi)",
        "ingredients": [
            "1 quart milk ADVERTISEMENT",
            "5 tablespoons butter, divided ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 1/2 cups fine semolina flour ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 1/4 cups grated Grana Padano cheese, divided ADVERTISEMENT",
            "1/3 cup grated Gruyere cheese ADVERTISEMENT",
            "1 (3 ounce) package pancetta bacon, diced ADVERTISEMENT",
            "1 pinch ground nutmeg, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk, 1/4 cup butter, and a pinch of salt in a saucepan; bring to a boil. Whisk semolina into boiling milk, mixing well to prevent lumps. Reduce heat and cook, stirring often, until thickened, 3 to 4 minutes. Remove saucepan from heat. Add egg yolks, 1 cup Grana Padano, and Gruyere cheese; stir well.\nHeat a nonstick skillet over medium heat; cook and stir pancetta until crisp, 7 to 10 minutes. Stir pancetta into semolina mixture.\nPreheat oven to 350 degrees F (175 degrees C). Grease 2 baking sheets with 1 1/2 teaspoon butter.\nSpread semolina mixture onto 1 of the prepared baking sheets, about 1/2-inch thick. Allow to cool to room temperature, about 15 minutes.\nCut small disks out of cooled semolina using a juice glass or cookie cutter. Place the disks onto the other prepared baking sheet, slightly overlapping the disks. Sprinkle the remaining Grana Padano cheese over disks and dot with remaining 1 1/2 teaspoon butter.\nBake in the preheated oven until gnocchi are nicely crisp and golden, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pretty Darn Quick Potato Gratin",
        "ingredients": [
            "4 ounces Gruyère or Comté cheese ADVERTISEMENT",
            "4 large Yukon Gold potatoes, peeled ADVERTISEMENT",
            "1 1/2 cups half-and-half ADVERTISEMENT",
            "1 large garlic clove, peeled and very finely minced ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 pinch freshly grated nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Butter an 8x8-inch baking dish.\nFit a food processor with shredding disk and use it to shred cheese. Transfer to a small bowl. Fit processor with slicing disk and use it to slice potatoes.\nPut potatoes in a large saucepan with half-and-half, garlic, salt, and nutmeg; stir gently to combine. Bring to a boil over medium-high heat, stirring occasionally. Cook at a gentle boil, stirring often with a heat-safe spatula to prevent sticking, until half-and-half has reduced and thickly coats potatoes, about 8 minutes.\nSpoon into prepared baking dish. Smooth top and sprinkle evenly with cheese.\nBake in preheated oven until potatoes are tender when pierced with a knife and top is golden brown, 25 to 30 minutes. Let stand 5 to 10 minutes before serving.\n",
        "picture_link": "6TzO6vugKUVdhrgx2HdzT6M4KOvJyD."
    },
    {
        "title": "Chopped Power Salad",
        "ingredients": [
            "3 cups cauliflower florets ADVERTISEMENT",
            "3 cups broccoli florets ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 clove garlic, peeled ADVERTISEMENT",
            "2/3 cup lightly packed fresh cilantro leaves ADVERTISEMENT",
            "1/3 cup lightly packed fresh parsley leaves ADVERTISEMENT",
            "1/2 cup extra-virgin olive oil ADVERTISEMENT",
            "1/3 cup golden raisins ADVERTISEMENT",
            "1/3 cup toasted pumpkin seeds ADVERTISEMENT",
            "1/3 cup apple cider vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse cauliflower in a food processor until finely chopped, about 15 to 20 pulses. Scrape into a large bowl. Pulse broccoli until finely chopped, about 15 to 20 pulses. Scrape into bowl. Process carrots until finely chopped, about 10 seconds. Scrape into bowl.\nWith food processor running, drop garlic through feed tube to chop. Scrape down sides. Add cilantro and parsley and pulse until finely chopped. Scrape mixture into bowl with vegetables. Add oil, raisins, pumpkin seeds, vinegar, salt, and pepper to bowl and stir until well combined. Let stand 10 minutes.\n",
        "picture_link": "sXcQNvHZ.aQEuurQeB8UYKqoDRWWTQC"
    },
    {
        "title": "Flourless Double Chocolate Chip Zucchini Muffins",
        "ingredients": [
            "1/2 cup almond butter ADVERTISEMENT",
            "1 ripe banana, mashed ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 tablespoons ground flax seeds ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup finely grated zucchini, excess moisture squeezed out ADVERTISEMENT",
            "1/4 cup semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup bittersweet chocolate chips, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line muffin cups with aluminum foil liners.\nMix almond butter, banana, cocoa powder, ground flax seeds, honey, vanilla extract, and baking soda together in a bowl until batter is well blended; fold in zucchini and semisweet chocolate chips. Scoop batter into the prepared muffin cups. Top each with bittersweet chocolate chips.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 25 minutes. Place muffins on a wire rack to cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cassava Flour Pita Chips",
        "ingredients": [
            "3/4 cup warm water (100 to 105 degrees F/38 to 41 degrees C) ADVERTISEMENT",
            "3/4 teaspoon coconut sugar ADVERTISEMENT",
            "3/4 teaspoon active dry yeast ADVERTISEMENT",
            "1 1/2 teaspoons olive oil (such as Kasandrino's®) ADVERTISEMENT",
            "1/2 teaspoon sea salt (such as Redmond® Real Salt) ADVERTISEMENT",
            "1/4 teaspoon Italian seasoning (optional) ADVERTISEMENT",
            "2/3 cup cassava flour (such as Otto's®), or more as needed ADVERTISEMENT",
            "1/4 cup arrowroot starch ADVERTISEMENT",
            "3/4 teaspoon unflavored gelatin ADVERTISEMENT",
            "1 tablespoon arrowroot starch, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper.\nCombine warm water, coconut sugar, and yeast in a large glass measuring cup; let stand until yeast softens and begins to form a creamy foam, about 4 to 6 minutes. Stir olive oil, sea salt, and Italian seasoning into yeast mixture.\nWhisk cassava flour, 1/4 cup arrowroot starch, and gelatin together in a bowl; pour into the yeast mixture and stir with a wooden spoon. Add more cassava flour, a few tablespoons at a time, if dough is too sticky. Divide dough into 4 portions and roll into balls, gently kneading each one as you form it.\nDust a piece of parchment paper with about 1/4 tablespoon arrowroot starch and place 1 dough ball on it. Dust with more arrowroot and place a second piece of parchment on top. Roll dough into a 4-inch circle. Roll it to a 5-inch circle for crisper pita chips. Transfer dough to the prepared baking sheet. Repeat with remaining dough and arrowroot starch.\nBake in the preheated oven for 5 minutes. Remove from oven and carefully cut each circle into 8 wedges. Return to the oven and bake for 5 minutes. Flip each wedges and bake until edges are golden and chips are crisp, 5 to 8 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "BUSH'S® Baked Avocado Stuffed with Sriracha Beans",
        "ingredients": [
            "3 medium ripe avocados ADVERTISEMENT",
            "1 (21 ounce) can BUSH'S® Sriracha Beans ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "Optional: ADVERTISEMENT",
            "Sour cream ADVERTISEMENT",
            "Mexican crema ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nCut avocados in half, remove pit. Scoop out small portion of each avocado with teaspoon.\nFill each avocado half with 1 to 2 tablespoons of BUSH'S(R) Sriracha Beans; top with 2 tablespoons of shredded cheese.\nPlace avocados on baking sheet; bake for 15 minutes or until cheese is melted.\nServe immediately. Garnish avocados with Mexican crema or sour cream, if desired.\n",
        "picture_link": "FWzvTZkeZxCOsdGwdQ70czxMBYPgEMi"
    },
    {
        "title": "Southwestern Stuffed Bell Peppers (Low Carb)",
        "ingredients": [
            "Bell Peppers: ADVERTISEMENT",
            "3 large green bell peppers - halved, seeded, and membranes removed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves, cut into strips ADVERTISEMENT",
            "2 tablespoons taco seasoning mix, divided ADVERTISEMENT",
            "1 small red onion, diced ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup cauliflower rice ADVERTISEMENT",
            "1 cup shredded reduced-fat Cheddar cheese ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1/2 cup nonfat plain Greek yogurt ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon lime juice, or to taste ADVERTISEMENT",
            "1/2 teaspoon taco seasoning mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nBring a large pot of salted water to a boil; cook peppers until just soft, 6 to 7 minutes. Drain and transfer to the prepared baking sheet.\nHeat oil in a skillet over medium heat; add chicken and 1 1/2 teaspoon taco seasoning mix. Cook and stir until chicken is no longer pink in the center, about 8 minutes. Chop or shred chicken and transfer to a bowl.\nCook and stir onion and garlic in the same skillet over medium heat until tender, 5 to 10 minutes.\nMix onion mixture, black beans, tomato sauce, and cauliflower rice into the bowl of chicken. Stir in 1 1/2 tablespoons taco seasoning. Fill the bell pepper halves with the chicken mixture.\nBake in the preheated oven until heated through, 10 to 15 minutes. Top chicken mixture with Cheddar cheese and continue baking until cheese is melted, about 5 minutes more.\nMix Greek yogurt, cilantro, lime juice, and 1/2 teaspoon taco seasoning together in a bowl; serve over stuffed peppers.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Flourless Crepe Tortillas",
        "ingredients": [
            "2 tablespoons water ADVERTISEMENT",
            "2 teaspoons ghee (clarified butter), melted ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup tapioca flour ADVERTISEMENT",
            "2 teaspoons coconut flour ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water and ghee together in a bowl; beat in eggs until mixture is frothy. Add tapioca flour, coconut flour, and sea salt; whisk until batter is smooth.\nHeat an 8-inch nonstick skillet over medium-low heat. Spoon 2 tablespoons batter into the hot skillet, swirling the skillet to cover the bottom evenly. Cook for about 30 seconds; flip and cook other side for 30 seconds. Transfer to a plate and repeat with remaining batter.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "BUSH'S® Game-Day Cheese Ball",
        "ingredients": [
            "1/2 cup BUSH'S® Sriracha Beans, pureed with sauce ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup chopped green onions, divided ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup walnuts, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In medium bowl, combine bean puree, cream cheese, 1/2 cup green onions and cheese. Form into ball.\nRoll cheeseball in remaining green onions and walnuts until coated.\nRefrigerate or serve at room temperature.\n",
        "picture_link": "YGqHvsQS2QLGxgkAW9CK0WzWY1uX0um"
    },
    {
        "title": "Lentil Tacos",
        "ingredients": [
            "Spice Mix: ADVERTISEMENT",
            "2 teaspoons ground ancho chile powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground fennel seed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 1/2 cups cooked brown or green lentils ADVERTISEMENT",
            "3 tablespoons tomato paste ADVERTISEMENT",
            "2 tablespoons water, or as needed ADVERTISEMENT",
            "2 canned chipotle chiles in adobo sauce, seeded and minced ADVERTISEMENT",
            "adobo or hot sauce (optional) ADVERTISEMENT",
            "Tacos: ADVERTISEMENT",
            "8 (6 inch) vegan corn or flour tortillas ADVERTISEMENT",
            "1 cup shredded lettuce ADVERTISEMENT",
            "1 cup chopped tomatoes ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 cup guacamole ADVERTISEMENT",
            "1 lime, cut into 8 wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ancho chile powder, cumin, coriander, oregano, salt, and fennel in a small bowl.\nHeat oil in a large skillet over medium-high heat. Cook onion and garlic, stirring occasionally, until lightly browned, about 3 minutes. Add spice mixture and cook, stirring, until toasted, about 30 seconds.\nReduce heat to medium and add lentils, tomato paste, a few splashes of water, and chipotle peppers. Cook, mashing lightly with a fork and adding water if necessary, until lentils are heated through and hold together, about 5 minutes. Season with additional salt if needed and adobo or hot sauce.\nLightly toast tortillas in a cast-iron skillet over medium heat. Spread about 1/3 cup filling down center of each tortilla. Top with lettuce, tomatoes, and cilantro. Serve with guacamole and lime wedges.\n",
        "picture_link": "aTBlfa/4uXbKOIO2nYfJnneCeuWBR5e"
    },
    {
        "title": "Breakfast Burrito Bites",
        "ingredients": [
            "1 (12 ounce) package Johnsonville® Original, Brown Sugar & Honey, or Vermont Maple Syrup Breakfast Sausage links ADVERTISEMENT",
            "4 (6 inch) Mission® Super Soft Flour Tortillas ADVERTISEMENT",
            "1/4 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "3 tablespoons red pepper jelly ADVERTISEMENT",
            "2 tablespoons sliced green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nArrange sausage in an 8-in. square nonstick baking pan. Bake sausage according to package directions.\nRemove sausage from baking pan; set aside.\nCut tortillas into four equal quarters; cover with plastic wrap.\nPlace one tortilla wedge on a work surface; place one sausage link on wide end of wedge. Brush pointed end of tortilla with water; roll up and press to seal. Place in pan, seam side down.\nRepeat with remaining sausage links.\nBake for 5 minutes.\nTurn seam side up and sprinkle with cheese. Bake 3 minutes longer or until cheese is melted. Cool slightly.\nTop with red pepper jelly and green onions.\n",
        "picture_link": "NOhw9c7yA4rSD/R9Yu1ypFCEGXNlOju"
    },
    {
        "title": "French Toast Sausage Sticks",
        "ingredients": [
            "1 (12 ounce) package Johnsonville® Brown Sugar & Honey, Vermont Maple Syrup, or Original Breakfast Sausage links ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "14 slices white bread, crusts removed ADVERTISEMENT",
            "Cinnamon sugar ADVERTISEMENT",
            "1/2 cup brown sugar and cinnamon spreadable cream cheese ADVERTISEMENT",
            "Maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F.\nCook sausage according to package directions.\nIn a bowl, combine the brown sugar and cinnamon; mix well. Add the eggs, milk and vanilla; whisk until combined.\nUsing a rolling pin, roll out bread to flatten.\nPlace one breakfast link on the edge of a bread slice; roll up jelly roll style.\nDip in egg mixture to coat.\nPlace on a greased baking sheet and sprinkle with cinnamon sugar.\nRepeat for remaining sausage.\nBake for 15 to 20 minutes or until crisp and lightly browned.\nPlace cream cheese in a resealable plastic bag. Cut the corner off and pipe cream cheese onto the top of each French Toast Sausage Stick.\nServe with maple syrup.\n",
        "picture_link": "2wCc1tgv3fKywsD7eXF8Oe.hrqIHQbO"
    },
    {
        "title": "Easy Sweet and Sour Sauce",
        "ingredients": [
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons turbinado sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine honey, soy sauce, vinegar, ketchup, and sugar in a small saucepan over medium heat. Cook and stir until sugar dissolves and sauce is heated through, about 5 minutes.\n",
        "picture_link": "oJVAkpy5eniZ40K2gztRbHz3i/pJQyi"
    },
    {
        "title": "Spicy Mezcal Margarita",
        "ingredients": [
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 lime wedge ADVERTISEMENT",
            "1 jalapeno pepper, seeded and roughly chopped ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1/2 cup freshly squeezed orange juice ADVERTISEMENT",
            "1/4 cup mezcal ADVERTISEMENT",
            "3 tablespoons freshly squeezed lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix 1 tablespoon sugar with salt on a shallow, rimmed plate. Use lime wedge to wet rims of two 6- to 8-ounce glasses. Dip rims into sugar mixture.\nCombine jalapeno and 1 1/2 teaspoons sugar in a cocktail shaker and muddle until sugar is dissolved and jalapeno is juiced. Add orange juice, mezcal, and lime juice to shaker, then fill with ice. Cover and shake until chilled, about 30 seconds. Strain into glasses to serve.\n",
        "picture_link": "YCd7ZIemX7CKIJlPtsgtCfXdhAgi/Mu"
    },
    {
        "title": "Meat Lovers' Vegan Potstickers",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "1 cup vegetarian beef crumbles ADVERTISEMENT",
            "1 leaf napa cabbage, chopped ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 green onion, diced ADVERTISEMENT",
            "2 teaspoons chili garlic sauce ADVERTISEMENT",
            "1/2 teaspoon sesame oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "12 potsticker wrappers ADVERTISEMENT",
            "2 tablespoons peanut oil ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix vegetarian beef crumbles, napa cabbage, soy sauce, green onion, chili garlic sauce, sesame oil, salt, and pepper together in a bowl to make filling.\nPlace a spoonful of the filling in the center of each pot sticker wrapper. Brush edges of each wrapper with water; fold over to enclose filling. Squeeze edges and crimp together to seal.\nHeat peanut oil in a nonstick skillet over medium-high heat. Place potstickers flat-side down in the skillet; cook until golden brown, about 3 minutes. Flip potstickers. Pour in 1/4 cup water; cover and simmer for 5 minutes. Remove the lid and continue cooking until water evaporates, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peach Mango Sangria  ",
        "ingredients": [
            "1 pint fresh raspberries ADVERTISEMENT",
            "1 (750 milliliter) bottle Pinot Grigio wine, divided ADVERTISEMENT",
            "3/4 cup peach-flavored vodka (such as Absolut®), divided ADVERTISEMENT",
            "1/2 (11.5 ounce) can peach nectar (such as Kern's®) ADVERTISEMENT",
            "1/4 cup frozen lemonade concentrate, thawed ADVERTISEMENT",
            "1/4 cup peach schnapps ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 (16 ounce) bag frozen mango chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place fresh raspberries in a bowl; pour in enough wine and peach-flavored vodka to cover. Let soak, at least 1 hour.\nCombine remaining wine, remaining peach-flavored vodka, peach nectar, lemonade concentrate, peach schnapps, and sugar in a large pitcher. Stir in soaked raspberries and mango chunks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Layered Deviled Egg Pasta Salad",
        "ingredients": [
            "Deviled Eggs: ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "2 1/2 tablespoons mayonnaise ADVERTISEMENT",
            "2 teaspoons prepared yellow mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 sprigs fresh dill ADVERTISEMENT",
            "Pasta Salad: ADVERTISEMENT",
            "3 cups farfalle (bow-tie) pasta ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 pound cherry tomatoes, halved ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "2 cups diced cooked ham ADVERTISEMENT",
            "4 cups chopped lettuce ADVERTISEMENT",
            "4 spring onions, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a large saucepan and cover with cold water. Bring water to a boil. Remove saucepan from heat; let eggs stand in hot water for 10 minutes. Immerse eggs in a bowl of ice water and let cool, 1 to 2 minutes.\nPeel eggs and halve them lengthwise. Scoop yolks into a bowl. Arrange egg whites cut-side up on a plate.\nMash egg yolks into a crumbly paste with a fork. Mix in 2 1/2 tablespoons mayonnaise and mustard with the fork. Season with salt and pepper. Spoon egg yolk mixture into a small piping bag; pipe into the egg whites. Garnish with fresh dill.\nBring a large pot of lightly salted water to a boil. Cook bow-tie pasta at a boil, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain and let cool, about 15 minutes.\nMix cooled pasta with 2 tablespoons mayonnaise in a bowl. Season with salt and pepper.\nSpoon pasta into the bottom of a large glass trifle bowl. Layer tomatoes, celery, ham, and lettuce on top. Arrange deviled eggs on top before serving. Garnish with spring onions.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "One-Step Chicken Noodle Soup",
        "ingredients": [
            "1 pound skinless, boneless chicken breast, cut into bite-size pieces ADVERTISEMENT",
            "1/2 cup fusilli (corkscrew) pasta ADVERTISEMENT",
            "1/3 cup finely minced onions ADVERTISEMENT",
            "1 carrot, very thinly sliced ADVERTISEMENT",
            "1 stalk celery, thinly sliced ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "cayenne pepper, to taste ADVERTISEMENT",
            "2 teaspoons ketchup ADVERTISEMENT",
            "1 sprig fresh thyme (optional) ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 tablespoons freshly chopped Italian parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken pieces in a saucepan. Add fusilli, onions, celery, and carrots, ketchup, thyme, salt, and cayenne pepper. Pour chicken broth into pan.\nPlace pan over medium-high heat and bring to a simmer. Reduce heat to medium-low and cook until vegetables soften and pasta is thoroughly cooked, stirring occasionally, 25 to 35 minutes. Stir in parsley before serving.\n",
        "picture_link": "OKhTHAP7cwesxc4WNbSfSgcnRxszA0u"
    },
    {
        "title": "Easy Skinless Fried Chicken Thighs ",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "8 skinless chicken thighs ADVERTISEMENT",
            "1 cup corn oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, salt, pepper, paprika, and garlic powder in a large resealable plastic bag; mix well.\nPat chicken thighs dry with paper towels. Add to the flour mixture in the plastic bag; shake until thoroughly coated.\nHeat oil in a large, deep skillet to 350 degrees F (175 degrees C). Add chicken thighs and cover skillet with a spatter guard. Cook, turning occasionally, until chicken thighs are a deep golden brown, about 20 minutes. Drain on a plate lined with paper towels.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegetarian Shepherd's Pie with Mashed Cauliflower",
        "ingredients": [
            "1/2 head cauliflower ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons fat-free half-and-half, or as needed ADVERTISEMENT",
            "2 1/2 cups low-sodium vegetable broth, divided ADVERTISEMENT",
            "2 large carrots, peeled and chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 small red bell pepper, chopped ADVERTISEMENT",
            "8 ounces sliced fresh mushrooms, chopped if very large ADVERTISEMENT",
            "1/2 cup frozen peas ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "1 teaspoon ground thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cauliflower into a large pot and cover with water. Bring to a boil; reduce heat and simmer until fork-tender, 8 to 12 minutes. Drain and allow to steam dry for 1 to 2 minutes.\nCoarsely chop cauliflower and place in a food processor. Pulse until cauliflower is mashed, 7 or 8 pulses. Add 1/4 cup grated Parmesan cheese; pulse 2 or 3 times until blended. Pour in 2 tablespoons half-and-half and pulse 2 or 3 times until cauliflower mixture is the consistency of mashed potatoes. Add 1 tablespoon half-and-half if mixture is too thick.\nPour 1/2 cup vegetable broth into a skillet; bring to a simmer over medium-high heat. Add carrots, celery, onion, and red bell pepper. Reduce heat to medium; cover. Cook until vegetables begin to soften, 3 to 5 minutes. Add mushrooms; cover and cook for 1 minute.\nStir peas, garlic, thyme, salt, and pepper into the skillet. Add more broth if needed. Stir in tomato paste and flour until well combined. Pour in the remaining vegetable broth. Raise heat to medium-high. Cook and stir until liquid has thickened and coats the back of a spoon, about 5 minutes. Remove from heat.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Spray a glass pie plate or baking dish with nonstick cooking spray.\nTransfer carrot mixture to the prepared baking dish. Gently spread the mashed cauliflower mixture over the top. Sprinkle with 2 tablespoons grated Parmesan cheese.\nBroil until cauliflower is light brown, 3 to 4 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nut-Crusted Chicken Thighs",
        "ingredients": [
            "1/2 cup chicken stock ADVERTISEMENT",
            "1/4 cup salt ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 bunch fresh thyme ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "2 skinless, boneless chicken thighs ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup finely chopped salted mixed nuts ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chicken stock, salt, sugar, thyme, and cayenne pepper together in a bowl to make marinade.\nPlace chicken thighs in a resealable plastic bag. Pour marinade over chicken. Squeeze out most of the air and seal. Place plastic bag on a plate. Refrigerate 4 hours or overnight.\nPlace flour on a plate. Beat eggs in a bowl. Place chopped nuts on a separate plate.\nRemove chicken thighs from the bag; discard marinade. Dredge thighs in flour, coating all sides. Transfer to bowl with eggs and coat on all sides with eggs. Roll thighs in chopped nuts.\nHeat olive oil in a skillet over medium heat. Fry thighs until golden brown and no longer pink in the center, about 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]