[
    {
        "title": "Queso Blanco",
        "ingredients": [
            "1 gallon whole milk ADVERTISEMENT",
            "3 tablespoons sea salt (optional) ADVERTISEMENT",
            "1/3 cup cider vinegar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a colander with a damp piece of muslin or cheesecloth. Place colander over a bowl or in the sink.\nPour milk into a large saucepan; bring to 185 degrees F (85 degrees C), stirring frequently. Stir in salt.\nPour vinegar into milk, a little at a time, stirring well after each addition until curds begin to separate from the whey.\nSpoon curds into the muslin-lined colander using a slotted spoon. Fold the muslin over the top of the curds. Fill a smaller container with water and place on top of the muslin to press down on the cheese. Let rest for 1 to 3 hours, allowing the liquid to drain from the cheese (the longer you allow the cheese to drain, the drier the cheese will be).\n",
        "picture_link": "u3qj31R2Lj5wjcfkyMQv9AYu8LMDAhu"
    },
    {
        "title": "Mediterranean Frittata",
        "ingredients": [
            "3 sun-dried tomato halves ADVERTISEMENT",
            "2 teaspoons extra-virgin olive oil ADVERTISEMENT",
            "1/4 yellow onion, minced ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup frozen chopped spinach ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms with pieces, drained ADVERTISEMENT",
            "3 ounces crumbled reduced-fat feta cheese ADVERTISEMENT",
            "6 egg whites ADVERTISEMENT",
            "1/4 cup skim milk ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "2 tablespoons shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch round pan.\nPlace sun-dried tomatoes into a bowl of warm water until rehydrated, about 10 minutes. Drain and chop.\nHeat olive oil in a small skillet over medium heat; cook and stir onion and garlic until onion is translucent, about 10 minutes. Add spinach; cook and stir until thawed and water is evaporated, about 5 minutes. Stir in mushrooms, sun-dried tomatoes, and feta cheese until well mixed.\nWhisk egg whites, skim milk, salt, pepper, and basil together in a bowl until very frothy. Carefully stir spinach mixture and 1 tablespoon Parmesan cheese into egg mixture. Pour into the prepared pan; top with remaining Parmesan cheese.\nBake in the preheated oven until frittata is set and browned on top, about 25 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Stained Glass Gelatin Cake",
        "ingredients": [
            "5 (3 ounce) packages sweetened gelatin mix (such as Jell-O®), 5 different colors ADVERTISEMENT",
            "3 1/2 cups boiling water, divided ADVERTISEMENT",
            "3 1/2 cups cold water, divided ADVERTISEMENT",
            "1 (1 ounce) package unflavored gelatin powder ADVERTISEMENT",
            "1 (10 ounce) can sweetened condensed milk ADVERTISEMENT",
            "10 fluid ounces double cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place each gelatin mix in a separate bowl; stir 1/2 cup boiling water into each until completely dissolved, about 2 minutes. Stir 1/2 cup cold water into each gelatin mix; refrigerate until completely set, 4 hours to overnight.\nGrease a 9-inch cake pan or use a silicone mold. Slice the chilled gelatin into cubes and gently toss together; tip into the prepared cake pan.\nPour 1 cup cold water into a bowl and sprinkle unflavored gelatin over water; let sit until dissolved, 2 to 3 minutes. Add 1 cup boiling water and stir until gelatin is dissolved.\nPour sweetened condensed milk into a blender or food processor. Fill the condensed milk can with double cream and add to the blender with the unflavored gelatin mixture and vanilla extract. Blend mixture until well combined; pour over gelatin cubes in the cake pan. Evenly distribute milk mixture using a spatula.\nRefrigerate until set, 4 hours to overnight. Run a knife along the sides of the mold and invert cake onto a plate.\n",
        "picture_link": "IeQ0hj7d3.02maDQVdwQuNC91N3ygYm"
    },
    {
        "title": "Zucchini Cinnamon Cobbler",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "Cobbler Mix: ADVERTISEMENT",
            "8 cups (1/2-inch) pieces peeled and seeded zucchini ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon apple pie spice ADVERTISEMENT",
            "3/4 teaspoon cream of tartar ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "Cake Mix: ADVERTISEMENT",
            "1 1/4 cups cake flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with cooking spray.\nBring a pot of water to a boil; add zucchini. Cook until tender, about 5 minutes; drain. Place in a bowl of cold water until cool, about 5 minutes; drain. Transfer to a large bowl.\nMix 1 cup white sugar, all-purpose flour, lemon juice, apple pie spice, cream of tartar, and salt into the zucchini gently until combined. Pour batter into the prepared baking dish.\nCombine cake flour, 1/2 cup white sugar, brown sugar, baking powder, and salt in a bowl. Sprinkle over batter. Drizzle melted butter on top.\nBake in the preheated oven until top is golden brown, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grilled Chicken Hatch Chile Chili",
        "ingredients": [
            "6 boneless chicken thighs ADVERTISEMENT",
            "4 Hatch chile peppers ADVERTISEMENT",
            "2 cups water, divided ADVERTISEMENT",
            "1 large white onion, diced ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans (chickpeas), drained ADVERTISEMENT",
            "1 (1.25 ounce) package white chicken chili seasoning mix (such as McCormick®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nGrill chicken thighs until browned, about 5 minutes per side. Transfer to a cutting board; dice.\nGrill Hatch chile peppers, turning frequently, until blackened and blistered, 2 to 3 minutes. Cool until easily handled, about 5 minutes. Peel off skin and dice flesh into small pieces.\nPlace diced chile peppers in a large pot. Add 1 tablespoon of water and onion; cook and stir until onion softens, about 5 minutes. Stir in diced chicken, remaining water, garbanzo beans, and chili seasoning mix. Simmer until flavors combine, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spaghetti Squash Beef Casserole ",
        "ingredients": [
            "2 teaspoons butter, melted ADVERTISEMENT",
            "1 spaghetti squash, halved and seeded ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1/2 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "1/4 cup diced green bell pepper ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "2 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 cup crushed buttery round crackers (such as Ritz®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBrush butter lightly over squash halves. Cover with aluminum foil.\nBake in the preheated oven until easily pierced with a fork, about 40 minutes. Cool until easily handled, about 15 minutes.\nPreheat a large skillet over medium heat. Add ground beef; cook and stir until browned, about 5 minutes. Stir in tomatoes, mushrooms, red onion, green bell pepper, garlic, oregano, basil, salt, pepper, and thyme; cook, stirring occasionally, until flavors combine, 6 to 8 minutes.\nScrape squash flesh into the skillet; mix into the beef mixture. Spoon into a large casserole dish. Fold in mozzarella cheese; top with crushed crackers.\nBake in the preheated oven until golden brown, about 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mango, Coconut, and Chia Seed Pots",
        "ingredients": [
            "1/2 (13.5 ounce) can coconut milk ADVERTISEMENT",
            "1/4 cup chia seeds ADVERTISEMENT",
            "3 1/3 tablespoons almond milk ADVERTISEMENT",
            "2 tablespoons maple syrup, divided ADVERTISEMENT",
            "2 small mangoes - peeled, pitted, and cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk coconut milk, chia seeds, almond milk, and 1 tablespoon maple syrup together in a bowl for 1 to 2 minutes. Cover with plastic wrap.\nChill until thickened, stirring occasionally, about 1 hour.\nCombine remaining 1 tablespoon maple syrup and mangoes in a food processor or blender; puree until smooth.\nSpoon coconut milk mixture into serving glasses. Top with pureed mango.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "French Onion Soup",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "3 onions, thinly sliced ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "6 1/3 cups chicken stock ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "1 tablespoon white wine ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "6 (1/2 inch) slices French baguette ADVERTISEMENT",
            "1/2 cup shredded Gruyère cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over low heat. Add onions; cook, stirring constantly, until golden, 15 to 30 minutes. Add water; cover and cook until onions are very tender, about 15 minutes.\nSprinkle flour into the saucepan; cook, stirring constantly, until onions are coated, about 5 minutes. Pour in chicken stock and 1/3 cup plus 1 tablespoon white wine; season with salt and pepper. Bring to a boil; reduce heat and simmer gently until flavors combine, about 20 minutes.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nToast baguette slices until very crisp, 3 to 5 minutes. Divide slices among 6 oven-safe soup bowls. Ladle soup on top. Sprinkle Gruyère cheese over each bowl.\nTransfer bowls to the preheated oven; broil until cheese is melted and bubbly, 3 to 5 minutes.\n",
        "picture_link": "HylOlCm6jBaa48U6vXaI.BM/ZyGrYxe"
    },
    {
        "title": "Sweet and Spicy Cranberry Chutney",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 cups fresh cranberries ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup dates, pitted and chopped ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "1/2 cup chopped fresh ginger ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 large garlic clove, chopped ADVERTISEMENT",
            "8 cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, brown sugar, and white sugar in a large pot; stir until sugars dissolve. Add cranberries, onion, dates, raisins, vinegar, ginger, cinnamon, salt, garlic, and cloves. Bring to a boil, stirring occasionally.\nReduce heat and simmer, stirring occasionally, until most of the cranberries have burst and sauce begins to thicken, about 15 minutes.\nPour into a large bowl and refrigerate until set, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Homemade Pear and Gorgonzola Ravioli",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 ripe pears - peeled, cored, and cubed ADVERTISEMENT",
            "3 sprigs fresh thyme ADVERTISEMENT",
            "7 ounces Gorgonzola cheese, crumbled ADVERTISEMENT",
            "1 pound fresh pasta dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Add pears and thyme; cook, stirring often, until pears have softened, about 10 minutes. Crumble Gorgonzola cheese over pears; cook and stir until melted, 2 to 3 minutes. Remove skillet from heat and cool filling completely.\nCut pasta dough into 3 equal pieces. Flatten the first piece of dough on a floured work surface; roll with a rolling pin 5 or 6 times. Turn the dough 45 degrees and roll again, 5 to 6 times. Keep rolling and turning in the same direction until dough has a consistent thickness of about 1/16-inch. Repeat with remaining 2 pieces of pasta dough.\nGently transfer 1 pasta sheet to a floured surface and cut in half to form 2 evenly sized rectangles. Drop about 1 teaspoon filling onto 1 rectangle, spacing the filling about 1-inch apart. Brush the spaces around the filling with water.\nLay the second rectangle on top of the first. Gently squeeze out the air around the filling and press firmly with your hands to seal the edges and all dough around the filling.\nCut square ravioli shapes using a ravioli cutter. Transfer the ravioli to a floured plate or board. Repeat with the remaining dough and filling. Let the ravioli stand for about 30 minutes.\nBring a saucepan of lightly salted water to the boil; gently add ravioli, working in batches. Cook until ravioli float to the top, about 3 minutes. Remove using a slotted spoon and transfer to a warm bowl.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Maddog's Venison Sloppy Joes",
        "ingredients": [
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 jalapeno pepper, diced ADVERTISEMENT",
            "1 pound ground venison ADVERTISEMENT",
            "1 pinch ground black pepper, or to taste ADVERTISEMENT",
            "1 pinch ground cayenne pepper, or to taste ADVERTISEMENT",
            "1 pinch grill seasoning (such as Montreal Steak Seasoning®), or to taste ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "1 vine-ripened tomato, diced ADVERTISEMENT",
            "2 tablespoons barbeque sauce, or more to taste ADVERTISEMENT",
            "2 tablespoons ketchup (such as Heinz®), or more to taste ADVERTISEMENT",
            "2 teaspoons tomato paste, or more to taste ADVERTISEMENT",
            "2 teaspoons hot sauce, or more to taste ADVERTISEMENT",
            "4 hamburger buns, split ADVERTISEMENT",
            "1 (8 ounce) package shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 1/2 tablespoon oil in a large skillet over medium heat. Add onion, red bell pepper, and jalapeno; cook and stir until softened, 5 to 8 minutes.\nHeat remaining 1 1/2 tablespoon oil in another skillet over medium heat. Add venison; cook and stir until lightly browned, 4 to 5 minutes. Stir in black pepper, cayenne pepper, grill seasoning, garlic salt, and Worcestershire sauce; cook until venison is browned, 4 to 5 minutes.\nCombine tomato, barbeque sauce, ketchup, tomato paste, and hot sauce in a food processor; pulse until sauce is combined.\nCombine onion mixture, venison mixture, and sauce in a saucepan. Simmer until flavors combine, 10 to 15 minutes. Divide among buns; top with Cheddar cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cold Beer Cheese Dip with Wonton Chips",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup finely shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup beer ADVERTISEMENT",
            "1/2 (1 ounce) package ranch dip mix ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "12 wonton wrappers, cut into triangles ADVERTISEMENT",
            "1 pinch sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix cream cheese, Cheddar cheese, beer, ranch dip mix, and Worcestershire sauce together in a bowl until well blended.\nSpray cooking spray into wonton wrappers and place them on a baking sheet.\nBake wrappers in the the preheated oven until chips are crispy, about 4 minutes. Serve chips with dip.\n",
        "picture_link": "fR5lWQ1qXAZ8juXxJO/I8Jo.1yim.Si"
    },
    {
        "title": "Vegan Pumpkin Pie",
        "ingredients": [
            "1 cup vanilla-flavored almond milk ADVERTISEMENT",
            "1/2 cup raw sugar ADVERTISEMENT",
            "2 tablespoons arrowroot powder ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (9 inch) vegan pie shell (such as Wholly Wholesome®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine almond milk, sugar, and arrowroot powder in a blender; blend until sugar and arrowroot are completely dissolved. Add pumpkin puree, pumpkin pie spice, and salt; blend until smooth. Pour into the pie shell. Cover edges of the pie shell with aluminum foil.\nBake in the preheated oven until center is set, about 40 minutes.\nCool pie to room temperature, about 1 hour. Refrigerate until firm, 8 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quinoa and Dill Flatbread",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 cups quinoa ADVERTISEMENT",
            "2 cups water, or more as needed ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons chopped fresh dill ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9-inch round pans with cooking spray.\nPulse quinoa in a food processor until ground into flour, 3 to 5 minutes.\nCombine quinoa flour, water, olive oil, dill, rosemary, salt, and pepper in a bowl. Whisk, adding more water if needed, until combined. Divide dough evenly between the prepared cake pans.\nBake in the preheated oven until tops are golden, about 20 minutes. Cut into wedges.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken Afritada (Filipino Stew)",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 cloves garlic, crushed and chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup seeded and chopped tomatoes ADVERTISEMENT",
            "1 (3 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup tomato sauce (optional) ADVERTISEMENT",
            "3 potatoes, quartered ADVERTISEMENT",
            "1 green bell pepper, seeded and cut into matchsticks ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large wok over medium heat; add garlic. Cook and stir until fragrant, about 3 minutes. Add onion; cook and stir until translucent, about 5 minutes. Stir in tomatoes; cook, mashing with a fork, until flesh and skin separate, about 5 minutes.\nPlace chicken in the wok; cook and stir until lightly browned, about 5 minutes. Pour in water. Cover and bring to a boil. Stir in tomato sauce; simmer until flavors combine, about 15 minutes.\nMix potatoes into the wok; simmer until tender, about 10 minutes. Stir in bell pepper and carrot; simmer until softened, about 5 minutes. Season with salt and pepper.\n",
        "picture_link": "L8SA8HxCT/KC2RrSTa5hYwz14UZm4AK"
    },
    {
        "title": "Budae Jjigae (Korean Army Base Stew)",
        "ingredients": [
            "1 (12 ounce) can fully cooked luncheon meat (such as SPAM®), sliced ADVERTISEMENT",
            "14 ounces smoked sausage (such as Eckrich®), sliced ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "6 ounces kimchi ADVERTISEMENT",
            "1/4 cup Korean red pepper powder ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons gochujang (Korean hot pepper paste) ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "2 (32 ounce) containers chicken broth ADVERTISEMENT",
            "7 3/4 ounces ramen noodles (such as Ottogi Ramyonsari®) ADVERTISEMENT",
            "1 slice American cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Divide luncheon meat into 2 piles on either side of a stock pot. Layer sausage, onion, and kimchi on top, leaving an empty space in the center of the pot.\nMix red pepper powder, soy sauce, gochujang, garlic, and black pepper together in a small bowl; pour into the center of the pot. Sprinkle in green onion. Pour in chicken broth; bring to a boil. Reduce heat and simmer stew, stirring occasionally, until flavors combine, about 10 minutes.\nBring a pot of water to a boil; add ramen noodles. Cook and stir until partially cooked and softened, about 2 minutes. Drain; stir into stew. Cook and stir until ramen noodles are tender but firm to the bite, about 5 minutes. Top stew with American cheese.\n",
        "picture_link": "4crBGMXAz857yH4BB6RYxDDV7LwWtE."
    },
    {
        "title": "BUSH'S® Spicy Sriracha Layered Dip",
        "ingredients": [
            "1 (21 ounce) can BUSH'S® Sriracha Beans ADVERTISEMENT",
            "1 (16 ounce) can BUSH'S® Cocina Latina™ Refried Beans, Fat Free Vegetarian ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes and green chiles, drained ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "2 cups shredded cheese (colby, Monterey Jack, or sharp Cheddar) ADVERTISEMENT",
            "Sliced black olives (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nDrain BUSH'S(R) Sriracha Beans through strainer and save sauce and beans, separately.\nIn large bowl, add BUSH'S Cocina Latina(R) Refried Beans and drained sriracha sauce; mix together.\nUsing 9x9 baking dish, first layer combined refried beans and sriracha sauce.\nSecond layer, top with drained BUSH'S(R) Sriracha Beans.\nIn separate bowl, combine sour cream and diced tomatoes with green chilies.\nThird layer, top beans with the sour cream and tomato mixture.\nFourth layer, cover with shredded cheese.\nOptional: Add desired amount of olives on top of cheese.\nCover dish, and bake for 15 minutes. Uncover, and bake until hot and bubbly, about 15 additional minutes.\nServe with tortilla chips.\n",
        "picture_link": "M7b.5/b9DMZgsGRpTM.gFnziPwpsvRm"
    },
    {
        "title": "Apple Brie Bites",
        "ingredients": [
            "1 sheet frozen puff pastry, thawed ADVERTISEMENT",
            "5 ounces Brie cheese ADVERTISEMENT",
            "1/2 cup MUSSELMAN'S® Apple Butter ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F.\nPress seams of puff pastry sheet together. Cut sheet into quarters and then each quarter into six pieces. Use a rolling pin to flatten each piece of pastry into a square shape. Place the squares into 24 greased mini muffin cups.\nPut about 1/2 teaspoon of Brie, 1 teaspoon of apple butter and 1/2 teaspoon of chopped pecans into each muffin cup.\nBake for 13-15 minutes. Serve warm.\n",
        "picture_link": "lTc9YA8Hxyo41mVNpe76rc7H9uqFSuW"
    },
    {
        "title": "Spice Cake Whoopie Pies",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 (15.25 ounce) package spice cake mix (dry) ADVERTISEMENT",
            "1 1/2 cups MUSSELMAN'S® Apple Butter ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "Filling (see Note): ADVERTISEMENT",
            "8 ounces cream cheese, softened ADVERTISEMENT",
            "4 tablespoons unsalted butter, softened ADVERTISEMENT",
            "3 cups powdered sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper or a silpat liner.\nIn a large bowl, mix together the cake mix, apple butter, oil and eggs until smooth. Let stand for 3-4 minutes.\nSpoon the batter onto the prepared baking sheet, a heaping rounded tablespoon at a time. Space them about 2 inches apart. (Using a small scoop will keep the size consistent.)\nBake for about 14 minutes and let them cool completely.\nFrost the flat side of each \"pie\" half with either the marshmallow fluff (see Note below) or the cream cheese frosting, and place halves together.\nTo make the cream cheese frosting, beat the cream cheese, butter and powdered sugar until fluffy. Add the milk and vanilla, and beat for another 1-2 minutes.\nStore whoopie pies in sealed container in refrigerator.\n",
        "picture_link": "GVmUcIIUT/MaoybHR/VzGX.0D.B8fam"
    },
    {
        "title": "Mediterranean Spaghetti Squash",
        "ingredients": [
            "1 spaghetti squash, halved ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 pound chicken tenders, cut into bite-sized pieces ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon hot sauce, or to taste ADVERTISEMENT",
            "1 (15 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace spaghetti squash cut-side down in a baking pan. Pour water around squash.\nBake in the preheated oven until tender when pierced with a fork, about 45 minutes. Cool until easily handled, 5 to 10 minutes. Scrape out and discard seeds. Scrape flesh into strands with a fork.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Add chicken; cook and stir until lightly browned, about 3 minutes per side.\nHeat remaining 1 tablespoon olive oil in a saucepan over medium heat. Add onion, garlic, and hot sauce; cook and stir until softened, about 5 minutes. Stir in squash strands, artichoke hearts, and red bell pepper. Season with oregano, basil, and thyme.\nStir chicken and Parmesan cheese into the saucepan. Cover and cook over low heat, stirring occasionally, until flavors combine, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Tea (Peruvian Style)",
        "ingredients": [
            "2 quarts water ADVERTISEMENT",
            "1 large Granny Smith apple, cubed ADVERTISEMENT",
            "10 Wuyi tea bags ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon whole black peppercorns ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 coffee filter ADVERTISEMENT",
            "1 (4-inch piece) kitchen string ADVERTISEMENT",
            "1 cup anisette liqueur ADVERTISEMENT",
            "2 (1 gram) packets sucralose sweetener (such as Splenda®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan. Remove from heat. Add apple and tea bags. Let stand, about 5 minutes.\nPlace cinnamon, peppercorns, allspice, and cloves in the coffee filter. Tie securely with kitchen string and add to the saucepan. Steep until flavors combine, about 10 minutes. Discard apple. Steep tea for 5 minutes more.\nStrain tea into serving cups. Add 2 tablespoons anisette liqueur and some sweetener to each cup.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Seeded Flatbread",
        "ingredients": [
            "1 cup bread flour ADVERTISEMENT",
            "1 cup spelt flour ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "1 tablespoon quinoa ADVERTISEMENT",
            "1 tablespoon sunflower seeds ADVERTISEMENT",
            "1 tablespoon millet ADVERTISEMENT",
            "1 tablespoon oats ADVERTISEMENT",
            "1 tablespoon flax seeds ADVERTISEMENT",
            "3/4 cup warm milk ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons bread machine yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix bread flour, spelt flour, brown sugar, sesame seeds, quinoa, sunflower seeds, millet, oats, and flax seeds together in a bowl.\nCombine milk and oil in the bread pan of a bread machine; add flour mixture. Make a well in the center of the flour mixture; pour in yeast. Knead dough according to manufacturer's instructions.\nTurn out dough on a floured work surface. Punch down and separate into 16 pieces. Flatten into 5-inch diameter flatbreads.\nPlace flatbreads on 2 baking sheets; cover with plastic wrap. Let sit in a warm place until risen, about 1 hour. Remove plastic wrap.\nPreheat oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until golden brown, about 15 minutes. Cool slightly; slice in half.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Japanese-Style Meatloaf",
        "ingredients": [
            "1 teaspoon corn oil, or to taste ADVERTISEMENT",
            "1 teaspoon sesame oil, or to taste ADVERTISEMENT",
            "2 carrots, finely chopped ADVERTISEMENT",
            "1 green bell pepper, finely chopped ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 tablespoon sake (rice wine) ADVERTISEMENT",
            "1 tablespoon mirin (Japanese sweet wine) ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon fish soup stock (such as HonDashi®) ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 1/2 cups panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat corn oil and sesame oil in a large skillet. Add carrots, green bell pepper, and onion; cook and stir until softened, about 5 minutes. Stir in soy sauce, sake, mirin, sugar, and fish soup stock. Mix in garlic and ginger. Let cool, 5 to 10 minutes.\nMix turkey, pork, and eggs together in a large bowl until blended. Stir in cooled carrot mixture and bread crumbs until well combined. Press evenly into a loaf pan.\nBake in the preheated oven until browned, about 30 minutes. Increase oven temperature to 400 degrees F (200 degrees C); continue baking until an instant-read thermometer inserted into the center reads at least 160 degrees F (70 degrees C), about 30 minutes more.\nLet stand before serving, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "BUSH'S® Asian Banh Mi Sandwich",
        "ingredients": [
            "1 (21 ounce) can BUSH'S® Sriracha Beans ADVERTISEMENT",
            "1 pound teriyaki-marinated pork tenderloin, thinly sliced ADVERTISEMENT",
            "1 loaf whole wheat baguette, cut into four 6-inch lengths and split ADVERTISEMENT",
            "4 tablespoons sriracha mayonnaise ADVERTISEMENT",
            "8 teaspoons hoisin sauce ADVERTISEMENT",
            "1 cup seedless cucumber, chopped into matchstick pieces ADVERTISEMENT",
            "1 cup cilantro leaves, loosely packed ADVERTISEMENT",
            "1 cup carrots, chopped into matchstick pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat grill to high heat. Grill pork slices 5-10 minutes, turning once, until cooked through or internal temperature is at least 145 degrees F.\nSpread each baguette with 1 tablespoon sriracha mayo and 2 teaspoons hoisin sauce.\nTop each baguette with 2 slices pork, and 1/4 cup of each: cucumber, cilantro and carrots.\nServe with BUSH'S(R) Sriracha Beans.\n",
        "picture_link": "DwihNovXq4.WIslwLuhJvaevIBFB7Ai"
    },
    {
        "title": "Apple Butter Gooey Butter Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 cup flour ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup unsalted butter, melted ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1 cup MUSSELMAN'S® Apple Butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup unsalted butter, melted ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup powdered sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "Whipped cream, for serving ADVERTISEMENT",
            "Ground cinnamon, for serving ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Lightly grease an 8x8-inch square pan.\nIn a large mixing bowl, whisk together the flour, sugar, baking powder and salt. Whisk in the egg, melted butter, milk and vanilla until moistened. Spread evenly in the pan (mixture will be slightly sticky).\nMake the filling:\nIn a large bowl with an electric mixer, beat together the cream cheese and apple butter until smooth. Beat in the egg, then beat in the melted butter and vanilla. Scrape down the bowl, then beat in the powdered sugar, cinnamon and nutmeg.\nSpread the filling over the cake layer, then bake 45-50 minutes or until the center is set (do not overbake as the center should be slightly gooey). Cool completely before serving. Garnish with whipped cream and dust with cinnamon. For best results, let cake sit at room temperature for 15-30 minutes before serving.\nRefrigerate any leftovers in an airtight container for up to 4 days.\n",
        "picture_link": "O9JIXwv6wMCUHWWPIiPdvrpz304Tmr2"
    },
    {
        "title": "Bul Dak (Korean Fire Chicken)",
        "ingredients": [
            "2 skinless, boneless chicken breasts, cut into small pieces ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons rice wine ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 pinch ground black pepper to taste ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/2 cup chopped Asian pear ADVERTISEMENT",
            "1/4 onion ADVERTISEMENT",
            "2 jalapeno peppers, stemmed ADVERTISEMENT",
            "3 tablespoons red pepper flakes ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 teaspoon spicy yellow mustard ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "1 green onion, sliced ADVERTISEMENT",
            "1 teaspoon roasted sesame seeds, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken, 2 tablespoons soy sauce, rice wine, 1 tablespoon honey, 1 tablespoon sugar, and black pepper in a large bowl. Marinate in the refrigerator for 30 minutes.\nCombine Asian pear, onion, jalapeno peppers, red pepper flakes, 2 tablespoons soy sauce, 1 tablespoon honey, 1 tablespoon sugar, sesame oil, garlic, and mustard in a blender; puree into a smooth sauce.\nHeat olive oil in a large skillet over medium heat. Add chicken; cook until browned, about 5 minutes. Increase heat to medium-high; pour in sauce. Cook until flavors combine, 3 to 4 minutes. Garnish with green onion and sesame seeds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spaghetti Squash and Polish Sausage Slow Cooker Soup",
        "ingredients": [
            "1 (2 pound) spaghetti squash ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 sweet onion, chopped ADVERTISEMENT",
            "6 green onions, white parts only, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 Granny Smith apple, peeled and chopped ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "14 ounces Polish sausage, sliced ADVERTISEMENT",
            "6 cups no-salt-added chicken stock ADVERTISEMENT",
            "1/2 cup white cooking wine ADVERTISEMENT",
            "2 potatoes, peeled and diced ADVERTISEMENT",
            "1/2 (5 ounce) package frozen cut spinach ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 teaspoons sea salt ADVERTISEMENT",
            "1 teaspoon hot sauce (such as Cholula®) ADVERTISEMENT",
            "1/2 teaspoon ground thyme ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground sage ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCut ends off spaghetti squash; pierce skin in several places with a sharp knife. Transfer to a glass baking dish.\nBake in the preheated oven until interior can be easily pierced with a fork, about 1 hour. Cool until easily handled, at least 20 minutes. Cut in half. Scoop out seeds and discard. Scrape flesh into strands with a fork.\nHeat olive oil in a slow cooker on High. Add onion, green onions, and garlic; cook and stir in the open cooker until tender, about 10 minutes. Stir in apple and butter. Add sausage; cook and stir for 5 minutes.\nPour chicken stock and white cooking wine into the slow cooker. Cook until heated through, about 20 minutes. Stir in potatoes; cook, covered, on Low for 20 minutes.\nStir spaghetti squash strands and spinach into the slow cooker. Mix in heavy cream, Parmesan cheese, salt, hot sauce, thyme, pepper, sage, and red pepper flakes. Cover and cook on Low until flavors combine, about 8 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "BUSH'S® Sriracha Breakfast Eggs",
        "ingredients": [
            "1 (15 ounce) can fire-roasted diced tomatoes ADVERTISEMENT",
            "1 (21 ounce) can BUSH'S® Sriracha Beans ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "4 tablespoons crumbled queso fresco, or to taste ADVERTISEMENT",
            "Tortillas or tostadas ADVERTISEMENT",
            "Sour cream (optional) ADVERTISEMENT",
            "Sliced black olives (optional) ADVERTISEMENT",
            "Shredded cheese of choice (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In 10-inch skillet, simmer tomatoes for 5 minutes.\nWith potato masher or back of spoon, crush tomatoes.\nAdd BUSH'S(R) Sriracha Beans and bring up to a simmer.\nUsing back of spoon or bottom of mug, make four wells in bean mixture and crack eggs into individual wells.\nCover and cook until egg whites are set, and yolks are still runny, about 5-8 minutes.\nTo serve, plate each egg and top with queso fresco. Serve with tortillas or on top of tostadas.\n",
        "picture_link": "mcxMF257NDvbmlcEKtBmnM.WtW4/f5."
    },
    {
        "title": "Apple Pie Refrigerator Oatmeal",
        "ingredients": [
            "2 cups rolled oats (old fashioned or quick-cooking) ADVERTISEMENT",
            "2 cups diced apple ADVERTISEMENT",
            "4 (6 ounce) containers vanilla Greek yogurt ADVERTISEMENT",
            "1/2 cup MUSSELMAN'S® Apple Butter ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "8 tablespoons chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together all ingredients (oats through walnuts).\nFill 4 jars or plastic containers and seal with lids. (Optional: garnish the top with additional walnuts or apples.)\nRefrigerate overnight. Oats can be prepared up to four days in advance (great for planning ahead for a busy week).\n",
        "picture_link": "mnsDl5Gms2j0wvarVtc0M/YoKANVrdC"
    },
    {
        "title": "Game Day Asian Chicken Wings",
        "ingredients": [
            "Wings: ADVERTISEMENT",
            "3 pounds chicken wings ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "3/4 cup MUSSELMAN'S® Apple Butter ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon toasted sesame oil ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "2 green onions (green tops only), sliced ADVERTISEMENT",
            "2 tablespoons cilantro, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F.\nRinse chicken wings and pat dry. Add vegetable oil, salt, garlic and ginger to a large bowl and whisk to combine.\nToss chicken wings in oil and seasoning mixture until well coated. Place on a foil-lined or greased baking sheet, separating them so that they are not touching. Bake for 50 minutes or until crispy and cooked through.\nAbout 10 minutes before wings are finished baking, prepare sauce.\nTo a medium skillet, add apple butter, orange juice, soy sauce, sesame oil, garlic and ginger. Place over medium-low heat and keep stirring until heated through. Set aside until wings are baked.\nRemove wings from baking sheet, add to the skillet, and toss to coat. Place on a serving tray and sprinkle with green onion tops and cilantro. Serve immediately.\n",
        "picture_link": "yxixVJ28DldjDnicvqo5A64Um5wAbCW"
    },
    {
        "title": "Sinigang na Isda sa Miso (Fish Stew with Miso)",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger, sliced ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "3 tablespoons miso paste, or more to taste ADVERTISEMENT",
            "1 teaspoon patis (fish sauce), or to taste ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "2 pounds red snapper fillets ADVERTISEMENT",
            "1 white (daikon) radish, sliced ADVERTISEMENT",
            "3 green chile peppers, or more to taste ADVERTISEMENT",
            "1 bunch Chinese mustard greens with stalks ADVERTISEMENT",
            "2 tablespoons kalamansi (Filipino lemon) juice, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a pot over medium heat. Add onion, garlic, and ginger; cook and stir until onions are translucent, about 5 minutes. Add tomatoes; cook and stir until mushy, about 5 minutes. Stir in miso paste and fish sauce; simmer until flavors combine, about 2 minutes.\nPour water into the pot; bring to a boil. Add fish fillets and radish; simmer until radish softens slightly, about 2 minutes. Stir in chile peppers, mustard greens, and kalamansi juice. Simmer, uncovered, until greens are wilted, 1 to 2 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Breakfast Bake from Musselman's®",
        "ingredients": [
            "1 pound breakfast sausage ADVERTISEMENT",
            "2 (8 ounce) packages refrigerated crescent rolls ADVERTISEMENT",
            "7 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "3/4 cup MUSSELMAN'S® Apple Butter ADVERTISEMENT",
            "1/2 cup shredded sharp white Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F. Lightly spray a 3-quart casserole dish (or a 13x9-inch pan) with nonstick cooking spray.\nBrown the sausage in a skillet and crumble it as it cooks. Remove to a paper towel to drain any excess grease.\nRoll up the crescent rolls according to your package instructions and line them up in the casserole dish (it is okay if they touch).\nWhisk together the eggs, milk, apple butter and optional cheese.\nScatter the cooked sausage over the top of the crescent rolls in the dish. Pour the egg mixture over the top.\nBake for 35-40 minutes or until the eggs have completely set in the center.\n",
        "picture_link": "vYytZ507L62hC9GolMqUXTLfedWsgki"
    },
    {
        "title": "Beef Bowl (Gyudon)",
        "ingredients": [
            "4 cups cooked rice ADVERTISEMENT",
            "6 tablespoons mirin (Japanese sweet wine) ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons sake ADVERTISEMENT",
            "1 onion, cut into wedges ADVERTISEMENT",
            "10 ounces beef, thinly sliced ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon pickled ginger (beni shoga), or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Divide rice evenly between 4 donburi bowls.\nBring mirin, soy sauce, and sake to a boil in a pot over medium heat. Add onion; cook and stir until onion is translucent, about 5 minutes. Stir in beef; simmer until no longer pink and cooked through, about 5 minutes. Spoon beef and onion over rice using a slotted spoon.\nPlace eggs in the pot; bring to a boil. Cook until soft boiled, 5 to 7 minutes. Peel; add to bowls. Garnish with pickled ginger.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Red Snapper (Chinese-French Fusion)",
        "ingredients": [
            "2 (5 ounce) red snapper fillets ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "4 thin slices lemon, or more to taste ADVERTISEMENT",
            "1 large tomato, seeded and finely chopped ADVERTISEMENT",
            "3 shallots, chopped ADVERTISEMENT",
            "3 cloves garlic cloves, finely chopped ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "1 teaspoon grated ginger ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCoat red snapper fillets with paprika, salt, and pepper.\nHeat olive oil in a large skillet over medium-high heat. Add red snapper; cook until browned, 1 to 2 minutes per side. Transfer to a large baking dish; top with lemon slices.\nCombine tomato, shallots, garlic, lemon zest, and ginger in the skillet; cook and stir until fragrant, about 1 minute. Stir in white wine. Season with salt and pepper. Add butter; reduce heat and simmer for 2 to 3 minutes. Pour mixture over red snapper.\nBake in the preheated oven until red snapper flakes easily with a fork, 15 to 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Halloween Shortbread Poppy Seed Cookie Fingers",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon poppy seeds ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, at room temperature ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon whiskey ADVERTISEMENT",
            "1 tablespoon fruit jam ADVERTISEMENT",
            "30 almond slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nWhisk flour, poppy seeds, baking powder, and salt together in a bowl.\nBeat butter and sugar together in a stand mixer until light and fluffy, 3 to 5 minutes. Beat in vanilla extract and whiskey. Add the flour mixture; beat until dough is just combined and crumbly.\nChill dough in the refrigerator until set, about 10 minutes.\nDivide dough into 4 portions. Roll 1 portion of dough into a tube on a floured work surface; cut into 1-inch pieces. Place onto prepared baking sheet. Repeat with remaining dough. Flatten dough pieces to about 2 inches long and 3/4-inch wide.\nPress the flat side of a butter knife into 1 end of the dough pieces to make a small dent; dot with jam. Place almond slivers onto jam. Score 2 sets of slits with a knife to create knuckles.\nBake in the preheated oven until golden, about 7 minutes. Cool for 10 minutes before transferring to a wire rack to cook completely, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tas Kebab (Persian Lamb and Vegetable Stew)",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 onions, sliced 1/2-inch thick ADVERTISEMENT",
            "1 pound lamb, cut into 1-inch cubes ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger, sliced (optional) ADVERTISEMENT",
            "1/2 cup pitted prunes ADVERTISEMENT",
            "2 carrots, peeled and sliced ADVERTISEMENT",
            "1 quince, cored and sliced ADVERTISEMENT",
            "1 large eggplant, peeled and cut into 1-inch slices ADVERTISEMENT",
            "1 tomato, sliced ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup tomato juice ADVERTISEMENT",
            "2 tablespoons lemon juice (optional) ADVERTISEMENT",
            "3 potatoes, peeled and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour oil into a pot. Cover the bottom of the pot with onions; add lamb. Season with 1/2 teaspoon salt, pepper, turmeric, and cinnamon.\nLayer garlic, ginger, prunes, carrots, quince, eggplant, and tomato onto the seasoned lamb. Sprinkle with 1 pinch of salt. Pour in water, tomato juice, and lemon juice.\nCook, covered, over low heat, until lamb is tender, 2 to 2 1/2 hours. Add potatoes and cover. Cook until potatoes are soft, about 30 minutes.\n",
        "picture_link": "/Y7nK7XtMKbF6AIr.IEW2wOVlHmPR7e"
    },
    {
        "title": "Originals Oven Roasted Turkey Cucumber Roll-Ups",
        "ingredients": [
            "1 cucumber ADVERTISEMENT",
            "5 slices Dietz & Watson Originals Oven Roasted Turkey Breast ADVERTISEMENT",
            "3 slices Dietz & Watson Originals Cheddar Cheese ADVERTISEMENT",
            "4 ounces ranch veggie dip ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using a vegetable peeler or mandolin, peel the cucumber into thin sliced strips.\nSlice Dietz & Watson Originals Turkey breast into thin sliced strips.\nSlice Dietz & Watson Originals Cheddar Cheese into 1/2 inch sliced strips.\nLayer one slice of D&W Turkey, folded in half, and two D&W Cheese pieces onto cucumber slices.\nRoll cucumber and place toothpick in the middle to hold the roll together.\nServe with Ranch Veggie Dip for dipping.\n",
        "picture_link": "8yU736karKkVOPyFB14yomamgFN.p5."
    },
    {
        "title": "Originals Oven Roasted Chicken Salad Mason Jar",
        "ingredients": [
            "6 ounces Dietz & Watson Originals Oven Roasted Chicken Breast, diced ADVERTISEMENT",
            "1/8 cup Greek yogurt ADVERTISEMENT",
            "1/4 red onion, diced ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "1 green apple, chopped ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "1 cup spring mix greens ADVERTISEMENT",
            "1/4 cup pecans ADVERTISEMENT",
            "1/2 tablespoon freshly squeezed lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In small bowl, combine Originals Oven Roasted Chicken Breast, Greek yogurt, red onion, celery and lemon juice.\nDivide chicken mixture, spring mix, cranberries, apples and pecans in half.\nTo assemble, begin by placing chicken and dressing mixture into the bottom of 2 jars.\nNext add lettuce then finish by topping with cranberries and pecans and tighten lids.\nOnce ready to eat, empty jar into a bowl, mix and enjoy!\n",
        "picture_link": "w0nF9jYzN.mWlMOruSegBnn.1F8UO4i"
    },
    {
        "title": "Dr Pepper® Bacon Brownies",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (12 fl oz) can caffeinated pepper-type soda (such as Dr Pepper®) ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "12 strips bacon, chopped ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 (12 ounce) bag milk chocolate chips ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 12x18-inch pan with cooking spray.\nCombine 1 cup pepper-type soda and 1 cup butter in a saucepan over medium-low heat; heat until butter is melted, 3 to 5 minutes. Remove from heat and let cool.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 8 minutes. Drain on paper towels.\nMix flour, white sugar, 1/4 cup cocoa powder, cinnamon, and salt together in a large bowl.\nWhisk buttermilk, vanilla extract, and baking soda together in a small bowl. Pour flour mixture; mix until batter is blended. Add butter mixture, 1/3 of the bacon, and chocolate chips; mix thoroughly. Spread in the prepared pan.\nBake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, 25 to 30 minutes.\nCombine 6 tablespoons pepper-type soda, 1/2 cup butter, and 3 tablespoons cocoa powder in a saucepan; bring to a boil. Remove from heat. Add 1/2 of the remaining bacon and confectioners' sugar; whisk until frosting is smooth.\nSpread frosting over brownies. Garnish with remaining bacon. Cool until frosting sets, about 20 minutes. Cut into squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Three Cheese Organic Turkey Quesadilla",
        "ingredients": [
            "4 Dietz & Watson Whole Wheat Wraps ADVERTISEMENT",
            "2 slices Dietz & Watson Originals rBGH Free Yellow Cheddar, shredded ADVERTISEMENT",
            "8 slices Dietz & Watson Originals Organic Turkey Breast, shredded ADVERTISEMENT",
            "1/8 cup chopped fresh sage ADVERTISEMENT",
            "2 slices Dietz & Watson Originals rBST Free Picante Provolone, shredded ADVERTISEMENT",
            "1/2 cup Dietz & Watson Cranberry Honey Mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray skillet with olive oil and heat over medium heat.\nPlace one wrap on the bottom of the skillet.\nTop wrap with 2 slices of cheese, shredded; 4 slices of Dietz & Watson Originals Organic Turkey, shredded; half of chopped sage; and 1 slice of cheese, shredded. Top with the second wrap.\nGrill for about 5 minutes, then flip to the other side and grill for another 5 minutes or until cheese has melted.\nServe with 1/2 cup of Dietz & Watson Cranberry Honey Mustard, for dipping.\nTake off heat and cut into fourths to serve.\nRepeat for second quesadilla.\n",
        "picture_link": "9vo.E6HyPy/t66cKqfCVilKH3uQQsQa"
    },
    {
        "title": "Lei's Maple Pecan Bacon Rolls",
        "ingredients": [
            "1 (16 ounce) package bacon, halved crosswise ADVERTISEMENT",
            "1/4 cup maple syrup, divided, or to taste ADVERTISEMENT",
            "1 cup crushed pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nPour 2 tablespoons maple syrup into a shallow bowl. Dip bacon slices in maple syrup and roll up. Arrange rolls seam-side down on the baking sheet.\nBake in the preheated oven until browned, about 20 minutes.\nCombine remaining 2 tablespoons maple syrup and pecans in a bowl. Drizzle over bacon rolls.\nContinue baking until bacon is crisp and pecans are browned, about 30 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Prosciutto Bites with Mustard Creme Fraiche",
        "ingredients": [
            "8 ounces Dietz & Watson Prosciutto, thinly sliced ADVERTISEMENT",
            "1/4 cup Dietz & Watson Whole Grain Dijon Mustard ADVERTISEMENT",
            "1/2 cup creme fraiche (or sour cream) ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "Salt and cracked pepper to taste ADVERTISEMENT",
            "12 whole grain crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the creme fraiche, Dietz & Watson Whole Grain Dijon Mustard, parsley (leaving some leftover for garnish), lemon zest, and salt and pepper.\nSpread 1/2 tablespoon of mixture on each cracker.\nTop with a small slice of Dietz & Watson Prosciutto.\nGarnish with parsley and lemon zest.\n",
        "picture_link": "MVggjFIvueGNkY9Y6ffCBK4.whBseC."
    },
    {
        "title": "French-Style Stuffed Portobellos with Green Beans",
        "ingredients": [
            "2 tablespoons butter, divided ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 small shallot, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 portobello mushroom caps ADVERTISEMENT",
            "1/2 pound haricots verts (French green beans), trimmed ADVERTISEMENT",
            "1/4 cup Sauvignon blanc ADVERTISEMENT",
            "3 slices Paris ham, or more to taste ADVERTISEMENT",
            "1/2 cup shredded Gruyère cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nHeat 1 tablespoon butter and oil in an oven-proof skillet over medium heat until butter is melted. Add shallot and garlic; cook and stir until shallot is wilted, about 5 minutes.\nPlace mushrooms, gill side up, into the skillet. Cook, flipping once, until liquid is absorbed, 2 to 3 minutes per side. Return mushrooms to gill side up.\nArrange green beans around the mushrooms. Pour in wine; simmer until absorbed, 5 to 10 minutes. Reduce heat to low; cover. Cook until mushrooms release their juices and green beans are tender, about 10 minutes.\nTop mushrooms with ham slices; sprinkle evenly with Gruyère cheese. Add remaining 1 tablespoon butter to the green beans.\nBake in the preheated oven until cheese is melted and bubbly, about 5 minutes.\n",
        "picture_link": ".OgoHaR6J4vmd53c9O78p44WwJZZvqu"
    },
    {
        "title": "Chicken and Rice Taco Salad",
        "ingredients": [
            "2 pounds skinless, boneless chicken breast halves - cut into bite size pieces ADVERTISEMENT",
            "1 tablespoon taco seasoning mix, or to taste ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Fiesta Sides™ - Yellow Rice ADVERTISEMENT",
            "1 cup corn ADVERTISEMENT",
            "1 cup no-salt-added black beans ADVERTISEMENT",
            "1 (8 ounce) package shredded lettuce ADVERTISEMENT",
            "1 medium tomato, diced ADVERTISEMENT",
            "2 cups shredded reduced-fat Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups crushed tortilla chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken breasts with your favorite taco seasoning and cook in a large skillet until well done.\nOnce chicken is cooked, remove from the skillet and add 2 cups of water and bring to a boil. Add contents from Knorr(R) Fiesta Sides(TM) - Yellow Rice in skillet and follow package directions.\nLayer a large bowl with tortilla chips (optional), cooked chicken, Knorr(R) Fiesta Sides(TM) - Yellow Rice, corn, black beans, lettuce, tomato and cheddar cheese. Mix well and serve with sour cream or salsa if desired.\n",
        "picture_link": "lacufARF8u7jnjCOcXtCuXOkIT/dHKS"
    },
    {
        "title": "Apple Fritter Bread",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 2/3 cups white sugar ADVERTISEMENT",
            "1 pound butter ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "4 cups cubed apple pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 fluted tube pans (such as Bundt(R)) with cooking spray.\nBeat sugar and butter together in a stand mixer until light and fluffy; mix in eggs and vanilla extract until just incorporated. Scrape down bowl with a rubber spatula. Mix in flour and baking soda until just incorporated. Add milk while mixer is running, beating until batter is smooth.\nFold apple pie filling into the batter by hand. Divide between the prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Turkey Garbanzo Rice",
        "ingredients": [
            "1 tablespoon grapeseed oil ADVERTISEMENT",
            "1 pound boneless, skinless turkey breast, chopped into bite-size pieces ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Fiesta Sides™ - Yellow Rice ADVERTISEMENT",
            "2/3 cup canned garbanzo beans, drained ADVERTISEMENT",
            "2/3 cup chopped tomato ADVERTISEMENT",
            "1 avocado - peeled, pitted, chopped ADVERTISEMENT",
            "2 tablespoons finely chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season turkey with salt and pepper. Heat oil in a large, non-stick skillet over medium-high heat and cook turkey, turning the pieces carefully to cook evenly. Add lime juice, stir and set aside.\nPrepare Knorr(R) Fiesta Sides(TM) Yellow Rice according to package instructions.\nStir in turkey, garbanzo beans and tomato and cover. Cook for 1 minute. Add avocado and parsley, remove from heat and serve. Enjoy!\n",
        "picture_link": "CAKHDndwhKqqzkqV.v9X/xLNoVhFnkm"
    },
    {
        "title": "Grandma Lou's Cheese Boereg",
        "ingredients": [
            "4 (8 ounce) packages farmer cheese ADVERTISEMENT",
            "1 pound shredded Muenster cheese ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 tablespoons chopped Italian parsley ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 (16 ounce) package phyllo dough ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine farmer cheese, Muenster cheese, eggs, and parsley in a bowl. Add salt; mix well.\nArrange phyllo dough lengthwise on a flat work surface; cut into 3 strips. Brush some butter lightly over 1 strip of phyllo. Cover remaining strips to keep them from drying out.\nSpoon 1 teaspoon of the farmer cheese mixture on the edge closest to you; fold over 2 sheets of phyllo to make a triangle. Fold again to form another triangle; continue folding to the end of the strip. Brush top with butter. Repeat with remaining phyllo strips, butter, and cheese mixture. Transfer triangles to baking sheets.\nBake in the preheated oven until golden brown, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Turkey Club Skewer",
        "ingredients": [
            "4 slices Dietz & Watson Gourmet Smoked Bacon ADVERTISEMENT",
            "2 slices multigrain bread ADVERTISEMENT",
            "6 slices Dietz & Watson Originals Herbed Turkey ADVERTISEMENT",
            "4 slices Dietz & Watson Originals Cheddar Cheese ADVERTISEMENT",
            "2 leaves lettuce ADVERTISEMENT",
            "4 cherry tomatoes ADVERTISEMENT",
            "2 ounces Dietz & Watson Hoagie Dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook Bacon in a cold pan on low until crisp.\nWhile bacon is cooking, cut bread, D&W Originals Cheddar, D&W Originals Herbed Turkey, and lettuce into 2 inch squares. Cut slices of cooked bacon into thirds.\nOn a 10- to 12-inch skewer, layer bread, lettuce, cheese, bacon and cherry tomato. Repeat once more, then top with last piece of bread.\nServe with a side of D&W Hoagie Dressing for dipping.\n",
        "picture_link": "tTMf4gsukZJPsjMJZNPJOPPSbaWFCTq"
    },
    {
        "title": "Karanga Soup",
        "ingredients": [
            "14 skinless chicken thighs ADVERTISEMENT",
            "1/3 cup curry powder ADVERTISEMENT",
            "6 tablespoons olive oil, or more to taste ADVERTISEMENT",
            "3 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "2 (14.5 ounce) cans corn ADVERTISEMENT",
            "3 small potatoes, or to taste ADVERTISEMENT",
            "2 red onions, chopped ADVERTISEMENT",
            "1 (8 ounce) package mushrooms, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "4 green onions, chopped, or to taste ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat chicken thighs with curry powder.\nHeat 2 tablespoons olive oil in a large skillet. Add 1/3 of the chicken thighs in a single layer; cook until browned, about 3 minutes per side. Transfer to a large pot. Repeat with remaining olive oil and chicken thighs.\nPour stewed tomatoes, diced tomatoes, corn, potatoes, onions, mushrooms, green bell pepper, green onions, Worcestershire sauce, and pepper into the pot. Cover and cook over very low heat until potatoes are tender and flavors combine, about 4 hours. Season with black pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Maple Bacon Icing",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 1/2 cups butter, softened ADVERTISEMENT",
            "1 teaspoon maple flavoring ADVERTISEMENT",
            "2 tablespoons milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on paper towels.\nTransfer bacon to a food processor; pulse until finely chopped.\nCombine confectioners' sugar and butter in a stand mixer; beat until light and fluffy, about 2 minutes. Add maple flavoring. Mix in milk a little at a time until icing is spreading consistency. Fold in bacon.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tunisian Grilled Salad (Selata Mishwiya) ",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 1/2 teaspoons harissa (North African red pepper paste) ADVERTISEMENT",
            "1 1/2 teaspoons ras el hanout (North African spice mix) ADVERTISEMENT",
            "1 1/2 teaspoons ground red chile pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 large tomatoes ADVERTISEMENT",
            "2 green bell peppers ADVERTISEMENT",
            "1 large onion ADVERTISEMENT",
            "2 green chile peppers ADVERTISEMENT",
            "1 (5 ounce) can tuna packed in olive oil ADVERTISEMENT",
            "2 hard-boiled eggs, halved ADVERTISEMENT",
            "1/2 cup whole black olives ADVERTISEMENT",
            "1 small lemon, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine olive oil, garlic, harissa, ras el hanout, ground chile pepper, salt, and pepper in a mortar; mash into a paste with a pestle.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nPlace tomatoes, green bell peppers, onion, and green chile peppers on the baking sheet.\nCook under the preheated broiler, turning occasionally, until skins have blackened and insides are soft, about 10 minutes. Cool until easily handled, about 5 minutes. Peel, seed, and chop into small pieces.\nPlace tomato mixture in a large bowl. Stir in garlic paste mixture slowly with a wooden spoon. Spoon onto a serving platter. Garnish with tuna, eggs, and olives. Squeeze 1 lemon wedge over platter. Arrange remaining wedges on the sides.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quinoa and Turkey Stuffed Tomatoes",
        "ingredients": [
            "4 large tomatoes ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 zucchini, chopped ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "2 cups cooked quinoa ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut the tops off each tomato and scoop out a small amount of the insides. Discard tops and insides.\nHeat olive oil in a skillet over medium heat; cook and stir zucchini, green bell pepper, garlic, and salt until tender, about 10 minutes. Add ground turkey; cook and stir until turkey is browned and crumbly, 5 to 7 minutes. Stir quinoa and 1/2 of the tomato sauce into the ground turkey mixture.\nArrange tomatoes in a baking dish. Fill each tomato with turkey-quinoa mixture. Pour remaining tomato sauce over each stuffed tomato. Pour a 1/2 inch of water into the bottom of the baking dish.\nBake in the preheated oven until tomatoes are tender, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ghorayebah (Butter Biscuits for Eid)",
        "ingredients": [
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 cup ghee (clarified butter) ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 cups all-purpose flour, or as needed ADVERTISEMENT",
            "30 whole cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nMix sugar and ghee together until creamy; stir in vanilla extract and baking powder. Add flour in small batches until dough is thickened and combined.\nRoll dough into walnut-size balls and place 2 inches apart onto baking sheets. Flatten slightly and press a clove into the center.\nBake in the preheated oven until ivory, 10 to 20 minutes. Cool on the sheets for 10 minutes, before transferring to a wire rack to cool completely, about 10 to 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simply Best Beef Stroganoff",
        "ingredients": [
            "3 cups chicken broth ADVERTISEMENT",
            "1 tablespoon beef bouillon granules ADVERTISEMENT",
            "1/4 pound pork sausage ADVERTISEMENT",
            "1/2 pound beef top sirloin, thinly sliced ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "1/4 white onion, thinly sliced, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons soy sauce, divided ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 cup sour cream, or more to taste ADVERTISEMENT",
            "5 cups egg noodles, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth and beef bouillon in a bowl.\nCook sausage in a skillet over medium heat until brown and crumbled, about 5 minutes. Add beef, green onions, white onion, cumin, coriander, salt, and pepper. Stir in 1 tablespoon of soy sauce; cook and stir until flavors combine, 2 to 4 minutes.\nSprinkle flour onto the beef mixture; stir until absorbed, about 1 minute. Stir in broth mixture; bring to a boil. Add remaining 1 tablespoon of soy sauce. Reduce heat; simmer until beef is cooked through and onions are tender, 8 to 10 minutes.\nRemove beef mixture from heat; stir in sour cream.\nFill a pot with lightly salted water and bring to a rolling boil. Stir in egg noodles and return to a boil. Cook, uncovered, stirring occasionally, until tender yet firm to the bite, 8 to 10 minutes; drain. Transfer to a serving plate; top with beef mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Best Roast Beef Dinner Ever!",
        "ingredients": [
            "4 pounds chuck roast, or more to taste ADVERTISEMENT",
            "3 shallots, sliced 1/4-inch thick ADVERTISEMENT",
            "6 tablespoons chopped garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "8 sprigs fresh thyme ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "6 carrots, or more to taste, cut into thirds ADVERTISEMENT",
            "8 stalks celery, cut into thirds ADVERTISEMENT",
            "1 1/2 pounds baby red potatoes, halved ADVERTISEMENT",
            "3 tablespoons rosemary ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut 1/2-inch incisions into the meaty parts of the roast; stuff with shallots and garlic. Season roast with salt and pepper; top with thyme sprigs.\nCenter roast in a large roasting pan. Pour in water and beef broth. Spread carrots and celery around the roast. Cover and marinate in the refrigerator, 8 hours to overnight.\nPreheat oven to 300 degrees F (150 degrees C).\nPlace potatoes in a large bowl; cover with water. Let soak, 10 to 15 minutes. Drain and pat dry. Add rosemary and olive oil; toss to coat. Spread potatoes around the roast.\nBake in the preheated oven until potatoes are very tender, about 3 hours.\nReduce oven temperature to 250 degrees F (120 degrees C). Continue baking until an instant-read thermometer inserted into the center of the roast reaches 145 degrees F (65 degrees C), about 1 hour more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cuban Roasted Pork Crostini",
        "ingredients": [
            "1 baguette ADVERTISEMENT",
            "Olive oil cooking spray ADVERTISEMENT",
            "1 tablespoon Dietz & Watson Stone Ground Mustard ADVERTISEMENT",
            "8 slices Dietz & Watson Cuban Roast Pork ADVERTISEMENT",
            "8 slices Dietz & Watson Swiss Cheese ADVERTISEMENT",
            "8 fresh Dietz & Watson Dill Pickles, quartered or halved ADVERTISEMENT",
            "Salt and cracked pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nUsing a serrated knife cut baguette into 16 slices. Lightly spray both sides with olive oil cooking spray and place on baking sheets.\nBake for 8 minutes, or until light golden brown. Remove from oven and let cool.\nCoat each crostini with Dietz & Watson Stone Ground Mustard.\nPlace 2 strips of roast port and 1 slice of Swiss cheese on top of crostini and top with a few slices of dill pickles. Season with salt and pepper.\n",
        "picture_link": "FIvFMx31pJuqU6zB6IdQE.97v1Eo8hm"
    },
    {
        "title": "Pumpkin Spice Healthy Bran Muffins",
        "ingredients": [
            "1 cup raisins (optional) ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups wheat bran cereal (such as Kellogg's® All-Bran™) ADVERTISEMENT",
            "1 (15 ounce) can canned pumpkin ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "2 apples, cored and grated ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons pumpkin spice ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line 2 muffin tins with paper liners.\nPlace raisins in a microwave-safe bowl; cover with water. Microwave on high until plump, about 70 seconds. Drain.\nBeat milk and eggs together in a bowl; mix in bran cereal. Let stand until cereal softens, about 5 minutes.\nMix raisins, canned pumpkin, honey, apples, and butter gently into the cereal mixture. Add flour, baking soda, pumpkin spice, and baking powder; mix batter gently until combined.\nSpoon batter into the lined muffin cups.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes. Transfer muffins to a cooling rack; let cool for 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken, Sweet Potato, and Mushroom Stew",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "1 (8 ounce) package baby bella mushrooms, halved ADVERTISEMENT",
            "1 chicken breast, cut into small pieces, or more to taste ADVERTISEMENT",
            "5 sweet potatoes, quartered, or more to taste ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a 5-quart pot over medium heat. Add onion; cook and stir until translucent, about 5 minutes. Add carrots; cook and stir until softened, 3 to 4 minutes. Stir in mushrooms; cook until browned, 4 to 5 minutes.\nStir chicken breast into the pot; cook and stir until juices run clear, 5 to 7 minutes. Mix in sweet potatoes and garlic. Pour in broth. Season with salt and pepper. Cook until sweet potatoes are tender, about 25 minutes. Stir in kidney beans; cook until heated through, about 3 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Italian Cream Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup lard ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "5 eggs, separated ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 (3.5 ounce) can sweetened flaked coconut ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3 1/2 cups confectioners' sugar, or more to taste ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped pecans, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease three 9-inch round cake pans and line with waxed paper.\nMix flour and baking soda together in a small bowl.\nBeat 1/2 cup butter and lard together in a bowl with an electric mixer until creamy. Add sugar; beat until smooth. Add egg yolks one at a time, beating well after each addition. Add flour mixture in 3 batches, alternating with buttermilk, beating batter briefly after each addition.\nFold 1 cup pecans, coconut, and 1 tablespoon vanilla extract into the batter.\nBeat egg whites with clean beaters in a glass, metal, or ceramic bowl until stiff peaks form. Fold into batter. Divide batter among prepared pans.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 25 minutes. Cool in pans, about 5 minutes. Invert cakes onto cooling racks; let cool completely, 25 to 30 minutes.\nBeat cream cheese and 1/4 cup butter in a bowl with an electric mixer until creamy. Add confectioners' sugar and 1 tablespoon vanilla extract; beat frosting until smooth.\nSpread a thin layer of frosting between cooled cake layers. Frost sides and top of cake. Sprinkle 1/2 cup pecans on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bulgur Chili ",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup bulgur ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cups shredded carrots ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/2 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "2 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "5 cups reduced-sodium tomato juice ADVERTISEMENT",
            "2 (16 ounce) cans kidney beans ADVERTISEMENT",
            "2 (16 ounce) cans black beans ADVERTISEMENT",
            "1 (28 ounce) can petite diced tomatoes, undrained ADVERTISEMENT",
            "1 (8 ounce) can low-sodium tomato sauce ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons taco seasoning ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water and bulgur into a saucepan. Bring to a boil; cover and simmer until tender, 12 to 15 minutes. Drain off excess water.\nHeat olive oil in a large pot over medium heat. Add carrots, onions, green bell pepper, red bell pepper, and jalapeno pepper; cook and stir until softened and starting to brown, 5 to 10 minutes. Stir in garlic; cook and stir until fragrant, 1 to 2 minutes.\nStir cooked bulgur, tomato juice, kidney beans, black beans, diced tomatoes, tomato sauce, chili powder, taco seasoning, cumin, cayenne, and pepper into the pot. Bring to a boil; reduce heat and simmer until flavors combine, 20 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Savory Oatmeal for One",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup old-fashioned oats ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "1 teaspoon butter, or more to taste ADVERTISEMENT",
            "1/8 teaspoon seasoning blend (such as Vegeta®), or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water, oats, and a dash of salt together in a microwave-safe bowl. Microwave on 50% power until oatmeal is chewy and tender, about 5 minutes. Stir. Mix in butter, seasoning blend, salt, and pepper. Let stand for 1 minute before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Momma's Best Chicken and Dumplings",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 ribs celery, quartered ADVERTISEMENT",
            "1 large carrot, quartered ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 teaspoon mashed garlic ADVERTISEMENT",
            "2 large bay leaves ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon poultry seasoning ADVERTISEMENT",
            "2 pounds bone-in chicken breasts ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "2 tablespoons self-rising flour (such as White Lily®) ADVERTISEMENT",
            "2 cups self-rising flour (such as White Lily®) ADVERTISEMENT",
            "1/4 cup cold shortening ADVERTISEMENT",
            "1/4 cup chicken broth, slightly chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a stock pot over medium-high heat. Add celery, carrot, onion, garlic, bay leaves, thyme, salt, pepper, and poultry seasoning; cook and stir until flavors combine, about 5 minutes. Push vegetable mixture to the sides and add chicken; cook until browned, 3 to 5 minutes per side.\nPour enough water over the chicken to cover by 3 inches; bring to a boil. Stir, scraping the browned bits off of the bottom of the pot. Reduce heat; simmer until chicken is tender, about 1 hour. Transfer chicken and carrots to a serving plate with a large slotted spoon; let cool.\nLadle 1/4 cup cooking liquid into a bowl; cool slightly, about 5 minutes. Mix in 2 tablespoons flour. Stir back into the pot.\nPlace 2 cups flour in a large bowl; cut in shortening with 2 knives until mixture forms pea-sized bits. Mix in chilled chicken broth until dough is combined.\nTurn dough out onto a floured work surface. Knead 5 to 6 times; pat down to 1-inch thickness. Sprinkle lightly with flour; roll out to about 1/8-inch thickness. Cut dough into squares with a sharp knife.\nDrop squares, in batches, into simmering cooking liquid, moving squares to the side with each addition. Partially cover pot; simmer until dumplings are firm, about 12 minutes. Separate any dumplings that stick together. Remove from heat; keep covered.\nBone chicken; cut into bite-sized pieces and return to the pot. Chop carrot; return to the pot. Cool chicken and dumplings, about 30 minutes, before serving.\n",
        "picture_link": "zvgVyJm93hnIp91g1IBF3KML9NH0Yf."
    },
    {
        "title": "Santa Fe Turkey Crostini",
        "ingredients": [
            "1 French baguette ADVERTISEMENT",
            "Olive oil cooking spray ADVERTISEMENT",
            "8 teaspoons Dietz & Watson Chipotle Mayo ADVERTISEMENT",
            "8 slices Dietz & Watson Provolone Cheese, cut into 1-inch strips ADVERTISEMENT",
            "8 slices Dietz & Watson Santa Fe Turkey Breast, cut into 1-inch strips ADVERTISEMENT",
            "2 ripe avocados - peeled, pitted, and cubed ADVERTISEMENT",
            "8 cherry or pear tomatoes, halved or quartered ADVERTISEMENT",
            "Salt and cracked pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nUsing a serrated knife cut baguette into 16 slices. Lightly spray both sides with olive oil cooking spray and place on baking sheets.\nBake for 8 minutes, or until light golden brown. Remove from oven and let cool.\nCoat each crostini with Dietz & Watson(TM) Chipotle Mayo.\nPlace 2 strips of turkey and provolone on top of crostini and top with a few pieces of avocado and tomato.\nSeason with salt and pepper.\n",
        "picture_link": "VSGMgOBpvIGLdwMkAq2Oc7dtrA8aoC2"
    },
    {
        "title": "Jan's Copycat Version of Pizza Hut®'s Stuffed Crust Pizza",
        "ingredients": [
            "5 cups bread flour, divided, or as needed ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle warm beer ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "3 tablespoons shortening ADVERTISEMENT",
            "1 tablespoon instant yeast ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste, divided ADVERTISEMENT",
            "2 tablespoons cornmeal, or as needed ADVERTISEMENT",
            "16 sticks string cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 4 cups bread flour, beer, water, shortening, yeast, brown sugar, salt, garlic powder, and onion powder in the bowl of a stand mixer fitted with a dough hook attachment. Mix, adding remaining flour a little at a time, until dough pulls away from the sides of the bowl and forms into a ball, about 2 minutes.\nLightly grease a large bowl with 1 teaspoon olive oil. Add dough. Cover with a clean towel and let rise until doubled in size, about 1 hour.\nGrease 2 pizza pans with remaining 2 teaspoons olive oil; dust with cornmeal.\nPunch dough down gently and divide into 2 portions. Place dough on the prepared pans. Cover and let rest, about 5 minutes. Stretch dough out 1 inch past the edge of the pans.\nArrange 8 sticks of cheese, ends touching, around the edge of 1 pan. Fold overhang over cheese and press dough to seal. Repeat with second pan.\n",
        "picture_link": "aTtmNC.rVGOeW9/6pWoJYuVJb2GXfA2"
    },
    {
        "title": "Bacon, Tomato & Triple Cheese Grilled Cheese",
        "ingredients": [
            "1/2 pound Dietz & Watson Gourmet Smoked Bacon ADVERTISEMENT",
            "1/2 pound Dietz & Watson Chicken Bacon ADVERTISEMENT",
            "4 slices sourdough bread ADVERTISEMENT",
            "1 (8 ounce) bottle Dietz & Watson Sandwich Spread ADVERTISEMENT",
            "1/4 pound Dietz & Watson Picante Provolone Cheese, sliced ADVERTISEMENT",
            "1/4 pound Dietz & Watson Peppadew NY State Cheddar Cheese, sliced ADVERTISEMENT",
            "1 pound Dietz & Watson Smoked Gouda Cheese, sliced ADVERTISEMENT",
            "4 slices tomato ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon and chicken bacon as required.\nStart with 2 slices of sourdough bread. Squirt both pieces with the Sandwich Spread.\nLayer 2 ounces Provolone Cheese, 2 ounces Peppadew Cheese and 2 ounces Smoked Gouda Cheese onto bread.\nAdd 4 slices either Bacon or Chicken Bacon and 2 tomato slices per sandwich.\nTop with second slice of bread.\nCan be cooked on a griddle or in a panini press. Cook just until the cheese starts to melt. Serve warm.\n",
        "picture_link": "lr3d6Ygs5mC2hBknVn7wL1qocHvSJBC"
    },
    {
        "title": "Chicken Gumbo Over Rice",
        "ingredients": [
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "1/2 pound Italian sausage, cut into 1/4-inch slices ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts, cut into 1/2-inch strips ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup diced green bell pepper ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "2 tablespoons minced jalapeno peppers ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "1 1/2 cups 1/4-inch fresh okra slices ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 cups cooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons oil in a large skillet over medium heat. Add sausage; cook and stir until browned, about 10 minutes. Transfer to a plate lined with paper towels using a slotted spoon.\nHeat remaining 2 tablespoons oil in the skillet. Add flour; cook, whisking constantly, until dark brown, 8 to 10 minutes. Add chicken, onion, green bell pepper, celery, jalapeno peppers, and paprika; cook and stir until onion softens, 7 to 8 minutes.\nPour chicken mixture into a slow cooker. Stir in cooked sausage, okra, chicken broth, and white wine.\nCover and cook on Low until flavors combine, 7 to 8 hours. Serve over rice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nana's Italian Holiday Cream Cake",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "5 eggs, separated ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 (3.5 ounce) can flaked coconut ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup margarine, softened ADVERTISEMENT",
            "1 pound confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch baking pans.\nBeat 1/2 cup margarine and shortening in a bowl with an electric mixer until creamy. Beat in sugar. Beat in egg yolks until smooth.\nCombine flour and baking soda in a bowl. Add to the margarine mixture in batches, alternating with buttermilk, until batter is smooth. Mix in 1 teaspoon vanilla extract; add pecans and coconut.\nBeat egg whites with clean beaters in a glass, metal, or ceramic bowl until stiff peaks form. Fold into the batter. Pour into prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 25 to 30 minutes. Cool in the pans for 10 minutes; invert onto a cooling rack. Cool completely, about 30 minutes.\nBeat cream cheese and 1/4 cup margarine in a bowl until smooth; stir in confectioners' sugar. Beat in 1 teaspoon vanilla extract until frosting is combined.\nSpread frosting onto the cooled cake layers. Stack cakes; frost top and sides.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spelt and Quinoa Bread",
        "ingredients": [
            "3 1/2 cups spelt flour ADVERTISEMENT",
            "1/2 cup toasted, hulled sunflower seeds ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 cups almond milk ADVERTISEMENT",
            "1 cup cooked quinoa ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\nCombine flour, sunflower seeds, chia seeds, salt, and baking soda in a bowl; mix in almond milk, quinoa, and molasses. Spread into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Low-Carb Mayo Chicken",
        "ingredients": [
            "10 cucumbers, diced ADVERTISEMENT",
            "1 1/2 teaspoons salt, divided ADVERTISEMENT",
            "1 whole chicken ADVERTISEMENT",
            "1/2 piece cassia cinnamon, broken into small pieces ADVERTISEMENT",
            "black peppercorns ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "4 cardamom pods ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons light mayonnaise ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumbers in a bowl; sprinkle with 1 teaspoon of salt.\nFill a pot with water; add remaining 1/2 teaspoon salt, chicken, cinnamon, peppercorns, cloves, cardamom, and bay leaf. Bring to a boil; cook until chicken is no longer pink in the center and an instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C), about 35 minutes.\nTransfer chicken to a cutting board; cool until easily handled, about 15 minutes. Remove skin and bone; cut chicken into small pieces. Transfer to a bowl.\nStir mayonnaise, light mayonnaise, and garlic into the cucumbers. Pour over chicken and mix until combined.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peach Cobbler (Celiac-Friendly)",
        "ingredients": [
            "1 cup buckwheat flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup vanilla-flavored almond milk ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "1 (28 ounce) can sliced peaches, drained ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9-inch baking dish.\nCombine flour, brown sugar, white sugar, baking powder, vanilla extract, and salt in a bowl; mix in almond milk and butter.\nPour flour mixture into the prepared baking dish. Top with peaches. Sprinkle cinnamon on top.\nBake in the preheated oven until the top is lightly browned and the peaches are bubbling, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rhubarb Breakfast Oatmeal",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 pinch salt, or more to taste ADVERTISEMENT",
            "1/4 cup diced rhubarb ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons ground flax seeds ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, salt, and rhubarb in a saucepan; bring to a boil. Add oats and cinnamon. Reduce heat to low; cover and cook, stirring occasionally, 5 to 8 minutes. Remove from heat; stir in flaxseed meal, honey, coconut oil, and chia seeds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Insalata di Riso (Italian Rice Salad)",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 1/2 cups long-grain rice ADVERTISEMENT",
            "1 large carrot, diced ADVERTISEMENT",
            "1/2 cup frozen peas ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "3/4 cup cubed prosciutto cotto (cooked ham) ADVERTISEMENT",
            "3/4 cup diced Swiss cheese ADVERTISEMENT",
            "1/2 cup button mushrooms in oil, drained ADVERTISEMENT",
            "1/3 cup canned corn, drained ADVERTISEMENT",
            "1/3 cup sliced green olives ADVERTISEMENT",
            "1/3 cup sliced black olives ADVERTISEMENT",
            "1/3 cup diced pickle ADVERTISEMENT",
            "1/3 cup sliced marinated artichoke hearts, drained ADVERTISEMENT",
            "1 1/2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 teaspoon thyme ADVERTISEMENT",
            "1 teaspoon oregano ADVERTISEMENT",
            "1 (3 ounce) can tuna, drained ADVERTISEMENT",
            "4 hard-boiled eggs, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, rice, carrot, peas, and salt in a saucepan. Bring to a boil; reduce heat and simmer until rice is tender but still firm to the bite, about 14 minutes. Drain excess water; let cool, 10 to 15 minutes.\nMix prosciutto cotto, Swiss cheese, button mushrooms, corn, green olives, black olives, pickle, artichoke hearts, olive oil, thyme, and oregano together in a large bowl. Stir in cooled rice mixture. Fold tuna into the salad.\nDivide salad among 4 serving plates; garnish with hard-boiled eggs. Chill before serving, at least 30 minutes.\n",
        "picture_link": "tRz0V6kh.MClJIfQE6SuJOtzvgnxycK"
    },
    {
        "title": "Chunky Monkey Grilled Cheese",
        "ingredients": [
            "2 slices raisin bread ADVERTISEMENT",
            "peanut butter ADVERTISEMENT",
            "1/2 banana, sliced ADVERTISEMENT",
            "2 tablespoons chocolate chips, or to taste ADVERTISEMENT",
            "1/4 cup ricotta cheese ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 dash ground cinnamon (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast raisin bread in a toaster oven until lightly brown, 2 to 3 minutes.\nSpread peanut butter onto toasted bread. Top 1 slice with banana; top other slice with chocolate chips. Cover banana and chocolate chips with ricotta cheese. Sprinkle sugar and cinnamon on top.\nToast in the toaster oven just until cheese is melted, 3 to 5 minutes. Sandwich slices together.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rosie's Persimmon Pudding",
        "ingredients": [
            "1 serving cooking spray ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "2 cups persimmon pulp ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10x16-inch baking pan.\nCombine flour, 2 1/2 cups sugar, persimmon pulp, milk, butter, eggs, baking powder, and baking soda in a large bowl; beat with an electric mixer on high speed until smooth, about 1 minute. Pour into the prepared pan.\nBake in the preheated oven until set, about 1 hour. Increase oven temperature to 400 degrees F (200 degrees C). Continue baking until top is browned, 10 to 15 minutes more. Let cool, about 10 minutes; pudding will sink in the center.\nCombine 1 cup sugar, water, and vanilla extract in a small saucepan over medium heat. Cook until sugar has dissolved into a clear glaze, 3 to 5 minutes. Pour over warm pudding; let stand until set, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Slow Cooker White Chicken Chili ",
        "ingredients": [
            "3 (15.5 ounce) cans great Northern beans, undrained ADVERTISEMENT",
            "2 (15.5 ounce) cans pinto beans, undrained ADVERTISEMENT",
            "2 (15.25 ounce) cans corn, undrained ADVERTISEMENT",
            "3 onions, diced ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "1 rotisserie chicken, boned and cubed ADVERTISEMENT",
            "2 (4 ounce) cans diced green chile peppers, undrained ADVERTISEMENT",
            "1 tablespoon hot pepper sauce ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine great Northern beans, pinto beans, corn, onions, chicken broth, rotisserie chicken, green chile peppers, hot pepper sauce, oregano, cumin, garlic powder, salt, and pepper in a slow cooker.\nCook on Low until flavors combine, about 8 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Paleo Yam Dish",
        "ingredients": [
            "2 yams, thinly sliced ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil; add yams. Cook until very soft, about 8 minutes. Drain; peel off skins.\nHeat coconut oil in a large skillet over medium heat. Add yams; cook and stir until browned, 5 to 10 minutes. Sprinkle cinnamon on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dragon Eye Muffins",
        "ingredients": [
            "1 1/4 cups brown sugar ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/3 cup peeled, seeded, and minced dragon eyes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 muffin tins or line with paper liners.\nMix brown sugar and butter together in a bowl until creamy. Add eggs, one at a time, beating well after each one.\nCombine flour, baking powder, and salt in a bowl.\nStir flour mixture, milk, and dragon eyes into the sugar mixture. Spoon batter into the prepared muffin tins.\nBake in preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Falafel-Crusted Cauliflower",
        "ingredients": [
            "1 head cauliflower, cut into florets ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup dry falafel mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a rimmed baking sheet with aluminum foil.\nPlace cauliflower onto the prepared baking sheet. Drizzle with oil, salt, and pepper; toss until coated. Sprinkle on falafel mix; toss until combined. Spread out evenly on the baking sheet.\nBake in the preheated oven, tossing once, until browned and cooked through, 20 to 25 minutes.\n",
        "picture_link": "d5aNybl0muMBqEIDlNni1kJyhgGY4A2"
    },
    {
        "title": "Vegan Banana and Oat Cookies",
        "ingredients": [
            "3 large ripe bananas, mashed ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "1 cup chopped dates ADVERTISEMENT",
            "2 tablespoons applesauce ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons natural peanut butter ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "1 teaspoon raw sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with waxed paper.\nMix bananas, oats, dates, applesauce, vegetable oil, and vanilla extract together in a bowl with your hands. Stir in peanut butter until blended; mix in chocolate chips. Let dough stand until oats soften slightly, about 10 minutes.\nDrop 1-inch scoops of dough 2 inches apart onto the prepared baking sheet; flatten lightly. Sprinkle raw sugar on top.\nBake in the preheated oven until bottoms are golden, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pawpaw Bread",
        "ingredients": [
            "1 serving cooking spray ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups pawpaw pulp ADVERTISEMENT",
            "1/3 cup tepid water ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease the bottom of an 8-inch loaf pan with cooking spray.\nCombine sugar and butter in a bowl; beat together until smooth. Beat in eggs. Add pawpaw pulp and water; beat until combined, about 30 seconds. Stir in flour, walnuts, baking soda, salt, and baking powder. Pour into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour 15 minutes. Allow to cool before slicing, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Yogi Oat Cookies",
        "ingredients": [
            "3 cups rolled oats ADVERTISEMENT",
            "1 tablespoon rolled oats ADVERTISEMENT",
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "1 tablespoon whole wheat flour ADVERTISEMENT",
            "3/4 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 cup milled flax seeds ADVERTISEMENT",
            "1/2 cup coarsely chopped almonds ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "3/4 cup canola oil ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "3/4 cup water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nMix 3 cups plus 1 tablespoon oats, 3/4 cup plus 1 tablespoon whole wheat flour, brown sugar, flax seeds, almonds, raisins, cinnamon, ginger, baking powder, and nutmeg together in a large bowl.\nStir 3/4 cup plus 2 tablespoons canola oil into the oat mixture. Add water; stir until dough is firm. Let rest about 5 minutes.\nDrop tablespoonfuls of dough about 4 inches apart onto the prepared baking sheet. Flatten with a fork to a 3-inch diameter.\nBake in the preheated oven until golden around the edges, 10 to 13 minutes. Cool for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Addictive Spicy Dill Avocado Pickles",
        "ingredients": [
            "1 1/4 cups distilled white vinegar ADVERTISEMENT",
            "1 cup filtered water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon rock salt ADVERTISEMENT",
            "1 teaspoon brown mustard seeds ADVERTISEMENT",
            "1 teaspoon chopped fresh dill ADVERTISEMENT",
            "1/2 teaspoon whole black peppercorns ADVERTISEMENT",
            "1/2 teaspoon habanero pepper flakes ADVERTISEMENT",
            "2 habanero peppers ADVERTISEMENT",
            "1 clove garlic, lightly smashed and halved ADVERTISEMENT",
            "2 underripe avocados, peeled and sliced into eighths ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vinegar and water in a saucepan. Stir in sugar and salt; add mustard seeds, dill, peppercorns, and habanero pepper flakes. Bring to a boil; stir until sugar and salt are dissolved. Remove from heat; cool to room temperature, about 15 minutes.\nDivide habanero peppers and garlic clove between 2 canning jars. Divide avocado slices evenly between jars.\nStir vinegar mixture to evenly disburse seasoning; pour into jars. Close lids and place in the refrigerator. Chill until flavors combine, about 24 hours.\n",
        "picture_link": "dF9CjGgi5hm8BWIE3pXhMS.8TVj3YRy"
    },
    {
        "title": "Eastern North Carolina Barbecue Sauce with a West Coast Twist",
        "ingredients": [
            "1 tablespoon honey, or other sweetener to taste ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon hot red pepper flakes ADVERTISEMENT",
            "3/4 teaspoon kosher salt ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/2 cup white distilled vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk honey, black pepper, red pepper flakes, salt, apple cider vinegar, and white distilled vinegar together in a bowl. Let sauce sit overnight to blend flavors together.\n",
        "picture_link": "J7qhqmjXrUoWqVV21UjMG87wY3dM8zS"
    },
    {
        "title": "Gummy Fruit Pops",
        "ingredients": [
            "1 (2 liter) bottle lemon-lime soda (such as Sprite®) ADVERTISEMENT",
            "1 liter orange juice ADVERTISEMENT",
            "1 (5 ounce) bag gummy bears ADVERTISEMENT",
            "1 apple, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine soda and orange juice in a pitcher.\nDivide gummy bears and apple evenly between 12 small paper cups. Fill cups with soda mixture; place 1 ice pop stick into each cup.\nFreeze until solid, 2 1/2 to 3 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raspberry Orange Muffins (Gluten Free, Dairy Free, Vegan)",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "7 1/2 tablespoons water ADVERTISEMENT",
            "3 tablespoons flaxseed meal ADVERTISEMENT",
            "1/3 cup frozen raspberries, crumbled ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1/3 orange, zested and juiced ADVERTISEMENT",
            "3 tablespoons coconut oil, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup gluten-free all-purpose baking mix ADVERTISEMENT",
            "2/3 cup gluten-free oat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon xanthan gum ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a muffin tin with cooking spray.\nWhisk water and flaxseed meal together in a small bowl to make flax \"eggs\". Let stand until thickened, about 5 minutes.\nPlace raspberries in a microwave-safe bowl. Heat in the microwave until thawed, 10 to 15 seconds. Stir in flax eggs, maple syrup, orange zest, orange juice, coconut oil, and vanilla extract.\nWhisk baking mix, oat flour, baking soda, baking powder, xanthan gum, and salt together in a bowl. Add raspberry mixture; mix quickly with a spatula until batter is combined.\nScoop batter into the muffin tin, filling each cup 3/4 full.\nBake in the preheated oven until browned, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spiced Paleo Cranberry Sauce",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "8 cups whole fresh cranberries ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon orange zest ADVERTISEMENT",
            "1 orange, juiced ADVERTISEMENT",
            "3 cups raw honey ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1/4 cup tart cherry juice concentrate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a large pot. Add cranberries. Simmer over medium heat, stirring regularly, until cranberries burst, about 10 minutes. Stir in ginger, cloves, and orange zest. Pour in orange juice.\nMicrowave honey in a microwave-safe bowl until runny, about 30 seconds. Scrape into the pot with a spatula. Add blueberries. Simmer until flavors combine, about 20 minutes. Remove sauce from heat and stir in cherry juice concentrate.\nTransfer cranberry sauce to small bowls and chill until set, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roasted Cauliflower with Kale Chips and Citrus",
        "ingredients": [
            "1 bunch kale, stemmed and torn into pieces ADVERTISEMENT",
            "3 tablespoons olive oil, divided, or to taste ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon ground red chile pepper ADVERTISEMENT",
            "1 teaspoon ground oregano ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "1 head cauliflower ADVERTISEMENT",
            "1 teaspoon chipotle spice rub, or to taste ADVERTISEMENT",
            "1 orange, peeled and cubed ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nSpread kale on the baking sheet. Drizzle 1 tablespoon olive oil on top. Coat with Parmesan cheese, red chile pepper, oregano, and salt.\nBake in the preheated oven until crisp, 15 to 20 minutes. Transfer to a plate.\nHeat butter in a small skillet until melted and starting to brown, about 5 minutes. Stir in bread crumbs. Remove from heat.\nSlice cauliflower into 1/2-inch \"steaks\". Rub 1 tablespoon olive oil and chipotle spice rub on top.\nHeat a large skillet over medium heat. Add cauliflower; cook and stir until browned, about 2 minutes per side. Transfer to the baking sheet.\nBake in the preheated oven until just tender, about 15 minutes.\nPlace cauliflower steaks on a large serving platter; top with crisp kale and orange.\nWhisk remaining 1 tablespoon olive oil and vinegar together in a small bowl. Drizzle over orange. Sprinkle bread crumbs on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baek Kimchi (Korean White Non-Spicy Kimchi)",
        "ingredients": [
            "1/2 cup coarse salt ADVERTISEMENT",
            "1 napa cabbage, cut into chunks ADVERTISEMENT",
            "2 jujube (Chinese dates), or more to taste (optional) ADVERTISEMENT",
            "5 1/2 cups water, divided ADVERTISEMENT",
            "3 tablespoons salted fermented shrimp (saewujeot) ADVERTISEMENT",
            "2 scallions, cut into 1-inch pieces ADVERTISEMENT",
            "6 cloves garlic, sliced ADVERTISEMENT",
            "2 tablespoons sliced fresh ginger ADVERTISEMENT",
            "1/2 Korean radish, cut into matchsticks ADVERTISEMENT",
            "5 chestnuts, cut into thin strips ADVERTISEMENT",
            "1/2 pear, cut into matchsticks ADVERTISEMENT",
            "2 carrots, cut into matchsticks ADVERTISEMENT",
            "1 red chile pepper, seeded and thinly sliced, or more to taste ADVERTISEMENT",
            "1 green chile pepper, seeded and thinly sliced, or more to taste ADVERTISEMENT",
            "4 teaspoons brown sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve 1/2 cup coarse salt in a large bowl of water. Submerge cabbage in the salted water and let soak, 12 to 24 hours. Drain. Rinse well and drain, squeezing out excess water.\nSoak jujube in a small bowl of water for 10 to 15 minutes. Drain, pit, and cut into thin slices.\nCombine 1/2 cup water, salted shrimp, scallions, garlic, and ginger in a food processor; puree until smooth.\nPour puree into a large bowl; add jujube, radish, chestnuts, pear, carrots, red chile pepper, green chile pepper, brown sugar, and 2 teaspoon salt. Stir in remaining 5 cups water. Mix in cabbage until well coated.\nPack cabbage mixture into an airtight jar. Pour in any liquid left in the bowl.\nSeal and let sit at room temperature until starting to ferment, 1 to 2 days. Transfer to the refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Maudie's Persimmon Pie ",
        "ingredients": [
            "1 prepared pie crust ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups whole milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon butter, softened ADVERTISEMENT",
            "1/2 cup persimmon pulp ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Press pie crust into an 8-inch pie pan; trim edges.\nMix sugar, flour, and salt together in a bowl.\nBeat milk, egg, vanilla extract, and butter together with an electric mixer on medium speed until smooth. Add persimmon pulp; beat until blended. Pour into the pie crust.\nBake in the preheated oven until crust is golden brown and persimmon filling is set, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Danish Beer Soup (Ollebrod)",
        "ingredients": [
            "8 slices pumpernickel bread, torn into small pieces ADVERTISEMENT",
            "2 cups dark ale, or more to taste ADVERTISEMENT",
            "1 cup water (optional) ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "1 pinch white sugar, or to taste ADVERTISEMENT",
            "1/4 cup heavy whipping cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bread in a large saucepan; cover with dark ale and water. Let soak, at least 3 hours.\nBring bread mixture to a simmer over low heat; cook until thickened, 15 to 20 minutes. Puree with an immersion blender until smooth. Stir in lemon zest, lemon juice, and sugar; bring to a boil. Ladle into bowls; top each bowl with 1 tablespoon whipping cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken and Peppers Egg Drop Stew",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (8 ounce) boneless chicken breast, cut into bite-size pieces ADVERTISEMENT",
            "2 links hot chicken sausage, cut into 1-inch slices ADVERTISEMENT",
            "1 yellow onion, sliced ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "1 poblano pepper, sliced ADVERTISEMENT",
            "1 jalapeno pepper, seeded and thinly sliced ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "4 cups low-sodium chicken broth ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1 tablespoon arrowroot powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium-high heat. Add chicken and sausage; cook and stir until evenly browned, about 7 minutes. Add onion, red bell pepper, poblano pepper, jalapeno pepper, salt, and black pepper; cook, stirring often, until softened, 5 to 7 minutes.\nPour chicken broth into the pot; bring to a boil. Reduce heat to medium and stir in butter and arrowroot powder to thicken the stew.\nWhisk eggs in a small bowl.\nIncrease heat to medium-high to bring stew to an active simmer. Remove from heat. Drizzle eggs in slowly, stirring with a wooden spoon until cooked through, about 1 minute. Stir in parsley.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Almond Joy® Bark",
        "ingredients": [
            "2 cups roughly chopped almonds ADVERTISEMENT",
            "1 cup unsweetened flaked coconut ADVERTISEMENT",
            "1/4 cup chia seeds ADVERTISEMENT",
            "1/4 cup flax seeds ADVERTISEMENT",
            "2 tablespoons evaporated cane juice ADVERTISEMENT",
            "1/4 teaspoon Himalayan pink salt ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 1/2 tablespoons coconut oil, melted ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 (4.23 ounce) packages extra-large dark chocolate bars (such as Hershey's® Special Dark®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nCombine almond, coconut, chia seeds, flax seeds, evaporated cane juice, and salt in a bowl.\nWhisk honey, coconut oil, and vanilla extract together in a bowl. Pour into the almond mixture; mix well.\nPour mixture onto the prepared baking sheet; press down with a piece of parchment paper until flattened.\nBake in the preheated oven until light golden brown, 10 to 14 minutes. Let bark cool, about 5 minutes.\nBreak chocolate bars into the top of a double boiler over simmering water; heat, stirring every 30 seconds, until melted, about 5 minutes. Spread evenly over bark.\nChill in the refrigerator until set, about 20 minutes. Cut into 32 pieces. Place pieces in a resealable storage container; chill in the refrigerator until hardened.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ezogelin Soup (Vegan Turkish Soup with Lentils and Bulgur)",
        "ingredients": [
            "2 tablespoons olive oil, or more to taste ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "3/4 cup red lentils ADVERTISEMENT",
            "1/4 cup white rice ADVERTISEMENT",
            "1/4 cup fine bulgur ADVERTISEMENT",
            "1 clove garlic, minced (optional) ADVERTISEMENT",
            "2 teaspoons crushed dried mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Add onion and salt; cook and stir until softened, about 5 minutes. Reduce heat and add cayenne; stir for 30 seconds. Stir in tomato paste for 20 seconds. Pour in water.\nIncrease heat to high and stir lentils, rice, bulgur, garlic, and mint into the pot. Bring to a boil; reduce heat to medium-low. Cover partially and cook, stirring occasionally, until lentils are very soft, about 35 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Best Vegan Chocolate Oatmeal Waffles",
        "ingredients": [
            "3 cups white whole wheat flour ADVERTISEMENT",
            "2 cups quick-cooking oats ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup chia seeds ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "4 1/2 cups almond milk, or more to taste, divided ADVERTISEMENT",
            "1/2 cup coconut oil, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, oats, sugar, cocoa powder, chia seeds, baking powder, and salt together in a large bowl. Add 3 cups almond milk and coconut oil; stir with a wooden spoon until batter is just combined. Cover and refrigerate, 8 hours to overnight.\nPreheat a Belgian waffle iron according to manufacturer's instructions.\nStir 1 1/2 to 2 cups almond milk into the batter to thin it to the consistency of cake batter.\nScoop 1/2 cup batter onto the preheated iron and spread to the edges. Close iron and cook until iron stops steaming, about 5 minutes. Repeat with remaining batter.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pickled Sliced Mango",
        "ingredients": [
            "7 raw green mangoes, peeled and sliced 1-inch thick ADVERTISEMENT",
            "1/4 cup salt, divided ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mango slices and 3 tablespoons salt in a large bowl. Let sit, about 15 minutes.\nCombine remaining 1 tablespoon salt, 3 cups plus 3 tablespoons water, and sugar in a large pot; bring to a boil. Stir until sugar is dissolved. Remove from heat; pour in vinegar. Remove brine from heat and let cool, about 15 minutes.\nDrain mango slices and place in large jars. Cover with cooled brine. Seal and refrigerate until mango turns yellow, about 2 days.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Skillet Chickpeas and Broccoli Rice",
        "ingredients": [
            "12 ounces broccoli florets ADVERTISEMENT",
            "4 tablespoons extra-virgin olive oil, divided ADVERTISEMENT",
            "1 cup chopped kale leaves ADVERTISEMENT",
            "2 (15.5 ounce) cans chickpeas (garbanzo beans), drained ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 large clove garlic, minced ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "3 Eggland's Best Eggs, large ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nAdd broccoli florets to a food processor and pulse until it resembles rice.\nHeat 2 tbsp extra virgin olive oil in a large cast iron skillet over medium heat.\nAdd greens, broccoli, chickpeas, and tomato paste. Stir to combine.\nAdd in garlic, salt, pepper, lemon juice, and remaining olive oil. Stir to combine.\nCook for about ten minutes or until broccoli is tender.\nBreak three Eggland's Best eggs over mixture. Do so carefully so that the yolk stays in tact to the membrane.\nPlace skillet in the oven and bake for 15 minutes.\nRemove and garnish with fresh herbs of choice - I used cilantro.\n",
        "picture_link": "szxc3I1nQOnar5nRqZ61NrB8SVUpN3a"
    },
    {
        "title": "Ginger-Pear Upside-Down Cake",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "3/4 teaspoon ground ginger ADVERTISEMENT",
            "20 ounces canned pear halves, drained ADVERTISEMENT",
            "Cake Batter: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace 1/3 cup butter in a 9-inch square pan and set in the preheating oven to melt, about 5 minutes.\nStir molasses, brown sugar, and ginger into the melted butter. Arrange pears cut-side down over mixture.\nSift flour, sugar, baking powder, and salt into a bowl. Add milk, 1/3 cup butter, and vanilla extract. Beat with an electric mixer until smooth, about 2 minutes. Beat in egg until combined, about 2 minutes. Pour batter over pears.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 40 to 50 minutes. Cool in the pan for 5 minutes.\nRun a knife around the edge of the pan; place a plate on top of the cake and flip carefully.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Warm Thai Kale Salad",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "2 teaspoons red pepper flakes ADVERTISEMENT",
            "4 carrots, thinly sliced ADVERTISEMENT",
            "3 stalks celery, thinly sliced ADVERTISEMENT",
            "8 leaves kale, stemmed and torn into pieces ADVERTISEMENT",
            "5 sprigs fresh cilantro, roughly chopped ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 teaspoons fish sauce ADVERTISEMENT",
            "1/2 teaspoon lime zest, or to taste ADVERTISEMENT",
            "1 small cucumber, cut into matchstick-size pieces (optional) ADVERTISEMENT",
            "1/4 cup roasted peanuts (optional) ADVERTISEMENT",
            "4 sprigs fresh mint, roughly chopped (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a heavy-bottom skillet over medium heat; add olive oil and swirl around in skillet. Cook and stir onion in the hot oil until softened, 3 to 4 minutes. Add garlic, ginger, and red pepper flakes; cook and stir until garlic and ginger are slightly browned and fragrant, about 1 minute.\nStir carrots and celery into onion mixture; cook and stir for 1 minute. Add kale and cilantro; cook and stir until kale is slightly wilted, about 45 seconds. Stir lime juice, fish sauce, and lime zest into kale mixture until kale is evenly coated in lime juice.\nServe kale salad topped with cucumber, peanuts, and mint.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Apple Berry Crumble Pie",
        "ingredients": [
            "1 1/2 cups Quaker® Oats (Quick or Old Fashioned, uncooked) ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "10 tablespoons butter or margarine, melted ADVERTISEMENT",
            "1 (21 ounce) can apple pie filling ADVERTISEMENT",
            "3/4 cup dried cranberries ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Lightly spray 8- or 9-inch glass pie plate with nonstick cooking spray.\nIn medium bowl, combine oats, flour, brown sugar and baking soda. Add melted butter; mix well.\nSet aside 3/4 cup oat mixture for topping.\nPress remaining oat mixture firmly onto bottom and sides of pie plate.\nBake 10 to 12 minutes or until light golden brown. Cool slightly on wire rack.\nUsing same bowl, stir together pie filling, cranberries, lemon juice and cinnamon.\nSpoon filling over hot crust, spreading evenly. Sprinkle reserved oat topping evenly over filling.\nBake 18 to 22 minutes or until topping is golden brown.\nServe warm or at room temperature.\n",
        "picture_link": "jYiDaL2F2.E3N5fmx9GNPNQ6VE1isna"
    },
    {
        "title": "Pumpkin Upside-Down Cake",
        "ingredients": [
            "1 (16 ounce) can pumpkin puree ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 (15.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "12 ounces nondairy whipped topping ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking pan with parchment paper.\nMix pumpkin puree, evaporated milk, 1 cup sugar, eggs, and cinnamon together in a bowl; pour into the prepared baking pan. Sprinkle cake mix over pumpkin mixture and top with pecans. Drizzle butter over pecan layer.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool cake in the pan, at least 30 minutes. Invert cake onto a flat plate.\nMix whipped topping, cream cheese, and 1 cup white sugar together in a bowl; spread over the cake. Chill in the refrigerator, 1 to 2 hours. Cut into 1-inch squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]