[
    {
        "title": "Crunchy Bok Choy Salad",
        "ingredients": [
            "1 tablespoon canola oil ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "1 large head bok choy, trimmed and cut into bite-size pieces ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "2 (3 ounce) packages ramen noodles, broken into pieces ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup balsamic vinaigrette salad dressing ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon canola oil in a small frying pan over medium-high heat. Cook and stir almonds in the hot oil until lightly browned, 2 to 3 minutes. Transfer almonds to a large salad bowl.\nToss bok choy, green onions, and ramen noodles with the almonds.\nWhisk 1/2 cup canola oil, sugar, balsamic vinaigrette dressing, and soy sauce in a separate bowl until combined.\nPour dressing over vegetables and toss to mix.\n",
        "picture_link": ".2P54BYEaF9NcgeyB2grwZCjQOkeWGK"
    },
    {
        "title": "Deborah's Slow-Cooker Collard Greens",
        "ingredients": [
            "2 (10.75 ounce) cans beef stock ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chiles ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup diced fully cooked ham ADVERTISEMENT",
            "2 teaspoons red wine vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 bunches collard greens, thinly sliced ADVERTISEMENT",
            "2 bunches mustard greens, thinly sliced ADVERTISEMENT",
            "2 bunches turnip greens, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beef stock, diced tomatoes with green chiles, onion, ham, vinegar, sugar, garlic powder, seasoned salt, red pepper flakes, and bay leaf in a slow cooker. Add collard greens, mustard greens, and turnip greens in order listed to slow cooker.\nCook on Low until greens are very tender, 4 to 6 hours.\n",
        "picture_link": "7Zsi8HXDPa6shmbAzJM2uDjkoST8uH2"
    },
    {
        "title": "Oven Brown Rice with Carrots and Mushrooms",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "1 cup uncooked brown rice ADVERTISEMENT",
            "1 cup finely diced carrots ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 (4 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1/2 cup condensed cream of chicken soup ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpray a 2-quart casserole dish with cooking spray.\nStir beef broth, brown rice, carrots, milk, mushrooms, cream of chicken soup, and butter in a bowl until well combined.\nPour mixture into prepared casserole dish.\nBake uncovered in preheated oven until liquid is absorbed and rice is tender, about 1 hour.\n",
        "picture_link": "r3bUH9wNxNJIy.PZ5IGPup9kSanaHS6"
    },
    {
        "title": "Red-Neck Turtle Burgers",
        "ingredients": [
            "2 pounds ground beef round ADVERTISEMENT",
            "2 teaspoons minced fresh chives ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "4 slices sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup chopped sweet onion (such as Maui) ADVERTISEMENT",
            "12 regular-sized hot dogs, halved crosswise ADVERTISEMENT",
            "12 slices bacon, cut in half crosswise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix ground beef, chives, salt, Worcestershire sauce, and ground mustard thoroughly in a bowl; divide in fourths and make 4 thick oval-shaped burgers. Top each burger with a slice of sharp Cheddar cheese and about 2 tablespoons of chopped sweet onion.\nPoke 2 holes in the long ends of each burger with your fingers for the heads and tails. Insert half a hot dog into the head and tail holes, letting the rounded ends of the hot dogs poke out about 1 1/2 inches. Press to secure. Poke 2 more holes on each side of the burger and insert 2 more hot dog halves on each side for legs. Cut 2 small slits, about 3/4 inch long, into the ends of the legs to make toes. Repeat with remaining ground beef, hot dogs, cheese slices, and onion to make 4 turtle burgers topped with cheese and onion. If desired, cut tails to small sharp points for more realism.\nPlace 3 halved bacon slices onto a work surface, sides touching. Weave 3 more bacon slices into the first ones, facing 90 degrees to the first slices, to make a woven bacon piece; lay the woven bacon onto a burger, arranging bacon between heads, legs, and tails. Secure with toothpicks. Repeat with remaining bacon to make 3 more woven bacon pieces and cover remaining burgers with bacon.\nPlace a baking rack into a large roasting pan; lay the bacon-wrapped turtle burgers onto the rack and cover lightly with foil.\nBake in the preheated oven until the burgers are no longer pink in the middle and hot dog ends are browned, 20 to 30 minutes. An instant-read meat thermometer inserted into the thickest part of a burger should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "6cxvxx9wN1SWFYENlOU6O/q4cMHyNgi"
    },
    {
        "title": "Too Cool For School Pumpkin Spice Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (14.5 ounce) can pure pumpkin ADVERTISEMENT",
            "3/4 cup light brown sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "1/2 cup chopped pecans, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a fluted tube pan (such as a Bundt(R)).\nPlace cake mix into a large mixing bowl. Beat in pumpkin, 3/4 cup brown sugar, vegetable oil, cinnamon, allspice, and nutmeg with an electric mixer until cake mix is moistened, about 1 minute. Beat in eggs; continue beating batter for 2 more minutes. Pour batter into prepared tube pan.\nMelt butter with 1/2 cup brown sugar in a saucepan over low heat until brown sugar has dissolved; stir in pecans. Spoon half the pecan mixture over the cake batter.\nBake cake in the preheated oven until lightly browned at the edges and a toothpick inserted into the center of the cake comes out clean, about 1 hour.\nCool cake in pan for 15 to 20 minutes, then invert cake onto serving platter. Allow cake to cool completely before drizzling the remaining half of the pecan topping over the cake.\n",
        "picture_link": "YkyM1C9b0qPFqM62E.Hv9YjPxCP3vVa"
    },
    {
        "title": "20 Second Salad",
        "ingredients": [
            "1 cup vegetable oil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "2 tablespoons grated onion ADVERTISEMENT",
            "2 teaspoons dry mustard powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 (16 ounce) packages coleslaw mix ADVERTISEMENT",
            "2 (10 ounce) packages frozen green peas, thawed ADVERTISEMENT",
            "1 cup dry-roasted peanuts ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk vegetable oil, sugar, vinegar, grated onion, dry mustard, and salt in a bowl, stirring until sugar has dissolved.\nToss coleslaw mix, peas, peanuts, and poppy seeds together in a large salad bowl until thoroughly combined; pour dressing over coleslaw and stir to coat. Let stand 10 minutes before serving.\n",
        "picture_link": "XDK1ssVzzbdqG4X2xVd6ToisRrHB2IO"
    },
    {
        "title": "Summer Chickpea Salad",
        "ingredients": [
            "2 (19 ounce) cans chickpeas (garbanzos), drained and rinsed ADVERTISEMENT",
            "1 pint small cherry tomatoes, halved ADVERTISEMENT",
            "3 tablespoons finely shredded basil leaves ADVERTISEMENT",
            "1/2 cup crumbled goat-milk feta cheese ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "3 large cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "3 tablespoons cider vinegar ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss chickpeas, tomatoes, feta cheese, and basil together in a large mixing bowl.\nPut honey in a small glass bowl; heat in microwave 30 seconds. Stir garlic, red wine vinegar, cider vinegar, olive oil, black pepper, cayenne pepper, and salt with the honey to make a dressing; pour over the chickpea salad and toss to coat.\nCover the mixing bowl with plastic wrap. Refrigerate salad for 1 hour before serving.\n",
        "picture_link": "VSvMEB.4f2yx/JitnbtfdR8oEQjRqAa"
    },
    {
        "title": "Lamb Shank Vindaloo",
        "ingredients": [
            "4 lamb shanks ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon tamarind concentrate ADVERTISEMENT",
            "1 1/2 tablespoons garam masala ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "8 cloves garlic, peeled ADVERTISEMENT",
            "1/3 cup sliced fresh ginger ADVERTISEMENT",
            "1 cup cherry tomatoes ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "1 1/2 teaspoons paprika ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground mustard ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "3 tablespoons ghee (clarified butter) ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 teaspoons brown sugar ADVERTISEMENT",
            "1/2 cup fresh cilantro, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lamb shanks in a large resealable plastic bag. Whisk together cider vinegar, oil, salt, tamarind concentrate, and garam masala in a bowl, and pour into the bag. Squeeze out excess air and seal the bag. Marinate in the refrigerator for 8 hours or overnight.\nPreheat an oven to 450 degrees F (230 degrees C). Grease a foil-lined baking sheet.\nRemove marinated lamb shanks and place on the prepared baking sheet. Season all sides with salt. Roast in the preheated oven until well-browned, 15 to 20 minutes. Reserve marinade in the bag.\nCombine 1 onion, garlic, ginger, cherry tomatoes, and water in a blender and pulse on and off until smooth. Set aside.\nCombine cayenne pepper, paprika, cinnamon, cumin, dried mustard, and black pepper in a small bowl.\nMelt clarified butter in a large stockpot over medium-high heat. Cook and stir 1 onion until softened and well-browned, about 30 minutes. Reduce heat to medium and pour in cayenne pepper mixture. Cook and stir until spices are aromatic, about 2 minutes.\nPour marinade from the bag into the stockpot, and stir in tomato-onion mixture and brown sugar. Bring mixture to a simmer. Place lamb shanks in the pan and reduce heat to low. Cover and cook, turning occasionally, until meat is tender and easily pierced with a fork, 3 to 4 hours.\nRemove lamb from the pot and cover with foil. Increase heat and simmer the sauce for a few minutes, skimming the fat from the top. Taste and add salt if needed. Serve lamb shanks with sauce spooned over the top. Garnish with cilantro.\n",
        "picture_link": "PjXg7BnFdAWMSg37D1/i5o3BPW.oiXy"
    },
    {
        "title": "Greek Hamburgers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (4 ounce) container crumbled feta cheese ADVERTISEMENT",
            "2 ounces goat cheese ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup Greek yogurt ADVERTISEMENT",
            "1/4 cup diced cucumber ADVERTISEMENT",
            "3 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground beef, feta cheese, goat cheese, 2 tablespoons lemon juice, olive oil, oregano, and garlic together in a large bowl using your hands. Form meat into 4 patties.\nStir Greek yogurt, cucumber, and 3 tablespoons lemon juice together in a bowl.\nHeat a frying pan over medium heat for about 2 minutes; cook burgers to desired degree of doneness, about 5 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Serve with yogurt sauce.\n",
        "picture_link": "Ni4hOAG/J3VjzVQJdliDUcGg.UjwhGy"
    },
    {
        "title": "Green Lemonade",
        "ingredients": [
            "1 head romaine lettuce ADVERTISEMENT",
            "4 leaves kale ADVERTISEMENT",
            "1 (1/2 inch) piece ginger ADVERTISEMENT",
            "2 apples, quartered ADVERTISEMENT",
            "1 lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process romaine lettuce, kale, ginger, apples, and lemon through a juicer. Stir before drinking.\n",
        "picture_link": "4KKFwxym5.JaB7KHU27YEy5Jjl12KjC"
    },
    {
        "title": "Mango Tofu Tacos",
        "ingredients": [
            "3 tablespoons coconut oil, or more as needed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 serrano chile pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "2 (14 ounce) packages tofu, cut into chunks ADVERTISEMENT",
            "1 bunch fresh cilantro, finely chopped (stems and leaves separated) ADVERTISEMENT",
            "1/4 (1 ounce) package taco seasoning mix, or more to taste ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "2 mangos, peeled and cut into small chunks ADVERTISEMENT",
            "1/4 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "1 pinch chili powder, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon ground cumin, or to taste (optional) ADVERTISEMENT",
            "1 teaspoon ground coriander, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover the bottom of a skillet with coconut oil; warm over medium heat. Add onion, serrano pepper, and garlic; cook and stir until onion is lightly browned, about 10 minutes. Add tofu; stir to coat.\nStir cilantro stems, 1/4 package taco seasoning, 1 teaspoon cumin, and 1 teaspoon coriander into tofu mixture; cook and stir until fragrant and tofu is cooked through, about 5 minutes. Add mangos and 1/4 package taco seasoning; cook, waiting 3 to 5 minutes before stirring. Add chili powder and salt; stir to coat. Season with more cumin and coriander if desired.\nSimmer tofu-mango mixture until most of liquid has evaporated, about 10 more minutes. Stir in cilantro leaves 1 minute before serving.\n",
        "picture_link": "RTnGFHfzKgvFI0sUdzvWAvavoc310ly"
    },
    {
        "title": "Quinoa and Black Bean Bliss",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup quinoa ADVERTISEMENT",
            "1 (15 ounce) can reduced-sodium black beans, drained and rinsed ADVERTISEMENT",
            "2 ears corn, kernels cut from cob ADVERTISEMENT",
            "4 cups fresh salsa ADVERTISEMENT",
            "2 avocados, cut into cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and quinoa to a boil in a small saucepan. Reduce heat to medium-low and cook at a simmer until the water is absorbed, about 15 minutes.\nMix black beans and corn kernels in a large bowl; add cooked quinoa and stir. Spoon quinoa mixture into 4 bowls; top each with salsa and avocado.\n",
        "picture_link": "O3s3BEhnOxyqFF/8.H47R8RR0ttUjP6"
    },
    {
        "title": "Meyer Lemon and Blueberry Cheese Tart",
        "ingredients": [
            "4 1/2 ounces thin lemon tea cookies (such as Trader Joe's® Meyer Lemon Cookies), crushed ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 pound fresh blueberries ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 (8 ounce) container mascarpone cheese ADVERTISEMENT",
            "3 tablespoons lemon curd ADVERTISEMENT",
            "1/2 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thoroughly mix crushed lemon cookies and butter together in a bowl.\nPress cookie mixture into the bottom of an 8-inch springform pan.\nPlace blueberries and sugar in a saucepan over medium-low heat; simmer until sugar has dissolved and a thin sauce forms, 10 minutes.\nStir cornstarch into blueberry sauce; simmer until sauce has thickened, about 10 minutes. Remove from heat and cool for 10 minutes.\nStir mascarpone, lemon curd, and whipped topping together in a bowl until well blended and smooth.\nSpread mascarpone mixture over the crust in the springform pan. Cover with waxed paper and freeze until semi-firm, about 10 minutes.\nSpread blueberry sauce over mascarpone layer; cover with waxed paper and refrigerate until set, at least 1 hour.\n",
        "picture_link": "of4kKmYw89UWk3jfOqqTcj8wh.MHWDq"
    },
    {
        "title": "Caramel Apple Crunch Bars",
        "ingredients": [
            "1 (16 ounce) tub Marzetti's® Old Fashioned Caramel Dip ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 3/4 cups quick cooking oats ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "4 1/2 cups peeled and chopped favorite apples ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F.\nIn a mixing bowl, combine flour, oats, salt and baking soda.\nIn a large mixing bowl, blend together butter, shortening and sugar with an electric mixer on medium speed until smooth. Add dry mixture and blend to form a crumbly mixture.\nMeasure and set aside 2 cups crumbs. Press remaining crumbs into a 9x13 inch pan. Spread apples into an even layer over crust.\nTransfer Marzetti Old Fashioned Caramel Dip to a microwave safe bowl and microwave for 30 to 40 seconds or until warm. Stir until smooth. Pour over apples and sprinkle remaining crumbs over all.\nBake on middle rack of oven for 25 to 30 minutes or until top is golden brown and apples are tender. Cut into desired size bars while slightly warm and serve.\nStore remaining bars covered in refrigerator.\n",
        "picture_link": "NJtrjP9BXcF.rjKjh1E0SjfSn57LLMC"
    },
    {
        "title": "Spicy Catfish Chowder",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 yellow onions, diced ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 zucchini, diced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer (golden ale-style) ADVERTISEMENT",
            "3 tablespoons seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "3 tablespoons dried parsley ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon chile-garlic sauce (such as Sriracha®) ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "4 (6 ounce) fillets catfish ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes with juice ADVERTISEMENT",
            "1 (14.5 ounce) can water ADVERTISEMENT",
            "1 (12 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large soup pot over medium heat; cook and stir onions and carrots until onions are slightly softened, about 2 minutes. Melt butter with onions and carrots; cook and stir zucchini and garlic in the melted butter until onions are translucent, about 7 more minutes.\nStir beer, seafood seasoning, parsley, garlic powder, chile-garlic sauce, sea salt, oregano, and black pepper into the vegetable mixture and gently lay catfish fillets over top of vegetables. Pour tomatoes with their juice over the vegetables and catfish. Cover pot and bring to a simmer; cook until catfish are cooked through, about 10 minutes. Break the catfish fillets apart into bite-size chunks.\nPour in a tomato can of water and stir in corn; simmer the chowder covered until vegetables are tender and flavors have blended, at least 30 more minutes.\n",
        "picture_link": "MbpR1DyimtGPU2phuMBW8X7zAIP5mSu"
    },
    {
        "title": "Braunschweiger Potato Hash",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "4 russet potatoes, peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "8 ounces braunschweiger (liverwurst), sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large skillet over medium heat. Stir potatoes into hot oil to coat; season with garlic powder and onion powder. Place a cover on the skillet and cook, stirring occasionally, until the potatoes are browned and tender, about 15 minutes. Drain excess oil.\nMash braunschweiger into the potato mixture. Cook and stir until the braunschweiger is hot and slightly crisp, about 5 minutes.. Season with salt and pepper to serve.\n",
        "picture_link": "2e13VhbO5MzdKZwZxRwykmuJJCzCK4y"
    },
    {
        "title": "Easy Sweet Potato Fries with Curry Ketchup",
        "ingredients": [
            "2 (1 pound) sweet potatoes, peeled and cut into 1/2-inch thick wedges ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 teaspoon mild curry powder ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nToss sweet potato wedges with 1 tablespoon olive oil in a large bowl; season with sea salt and paprika and toss again. Spread sweet potatoes in a single layer onto a baking sheet.\nBake sweet potatoes in the preheated oven until soft, about 20 minutes.\nHeat 1 tablespoon olive oil in a small skillet over medium-high heat. Cook and stir green onions with curry powder in the hot oil until softened and fragrant, about 1 minute. Stir ketchup into the mixture and transfer to a bowl. Serve sweet potatoes with curry ketchup for dipping.\n",
        "picture_link": "BOo5oglzgIKE2aXUIwmD9feFFGZaWQ6"
    },
    {
        "title": "J's Horseradish Deviled Eggs",
        "ingredients": [
            "12 hard cooked eggs ADVERTISEMENT",
            "2/3 cup mayonnaise ADVERTISEMENT",
            "1/4 cup Dijon mustard ADVERTISEMENT",
            "2 tablespoons prepared horseradish ADVERTISEMENT",
            "1/2 cup finely chopped shallots ADVERTISEMENT",
            "3/4 teaspoon seasoned salt ADVERTISEMENT",
            "1/4 cup fresh cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut eggs in half lengthwise; remove yolks and set whites aside.\nMix egg yolks, mayonnaise, mustard, horseradish, shallots, and seasoned salt in a bowl until smooth. Pipe or spoon yolk mixture into egg whites; top each with a leaf of cilantro.\n",
        "picture_link": "QSpHyEPm5bjDrYgaLy2iFT4Ijhex7Xe"
    },
    {
        "title": "Brie's Spicy Sweet Tangy Barbecue Sauce",
        "ingredients": [
            "2 cups ketchup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "5 tablespoons light brown sugar ADVERTISEMENT",
            "1/2 cup white wine vinegar ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1/2 tablespoon black pepper ADVERTISEMENT",
            "1 1/2 teaspoons cornstarch ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir ketchup, water, brown sugar, white wine vinegar, sugar, honey, orange juice, soy sauce, Dijon mustard, garlic powder, black pepper, cornstarch, and cayenne pepper together in a saucepan; bring to a boil, whisking frequently. Reduce heat to low and simmer sauce until thickened, about 40 minutes.\n",
        "picture_link": "LcJydAOcOAptKmeJq6LYlH0UTrqQ2Be"
    },
    {
        "title": "Simple Fruit Pizza",
        "ingredients": [
            "1 (18 ounce) package refrigerated sugar cookie dough ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 pint fresh strawberries, sliced ADVERTISEMENT",
            "1 pint fresh blueberries ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "2 kiwis, peeled and sliced ADVERTISEMENT",
            "1/2 cup orange marmalade ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 12-inch pizza pan.\nPress cookie dough into pizza pan; prick holes in dough with a fork.\nBake in preheated oven until golden, 10 to 15 minutes. Allow cookie crust to cool.\nBeat cream cheese, sugar, and vanilla extract until smooth; spread over cooled crust. Arrange strawberries, blueberries, bananas, and kiwi decoratively over cream cheese mixture.\nMix orange marmalade and water in a small bowl; spoon mixture over fruit. Chill for 1 hour before serving.\n",
        "picture_link": "oZpGGjsVEi8iGf.fjGcBiGUk94xnh1i"
    },
    {
        "title": "Bacon Chili Cheeseburger Meatloaf",
        "ingredients": [
            "1 (12 ounce) package center-cut smoked bacon, diced ADVERTISEMENT",
            "1 sweet onion (such as Vidalia®), chopped ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons ancho chile powder ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2 pounds ground sirloin ADVERTISEMENT",
            "4 ounces shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "4 ounces shredded pepper jack cheese ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 serving cooking spray ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon ground ancho chile pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir bacon in a large skillet over medium heat until bacon is translucent and beginning to brown, about 5 minutes; stir in onion and continue cooking and stirring until bacon is browned and sweet onion is translucent, about 5 more minutes.\nMix 1/2 cup ketchup, 2 tablespoons chili powder, 2 tablespoons ancho chile powder, 1 tablespoon Worcestershire sauce, cumin, salt, black pepper, and garlic powder in a large bowl. Mix in ground sirloin, bacon-onion mixture, Cheddar cheese, pepper jack cheese, eggs, and bread crumbs until thoroughly combined. Form the mixture into a loaf shape and refrigerate 1 hour.\nPreheat oven to 425 degrees F (220 degrees C). Line a 9x13-inch baking pan with aluminum foil and spray the foil with cooking spray.\nPlace loaf into the prepared baking dish. Mix 1/2 cup ketchup, 1 tablespoon Worcestershire sauce, 1 teaspoon chili powder, and 1 teaspoon ground ancho chile in a bowl. Spread the mixture over the loaf.\nBake in the preheated oven until the loaf is no longer pink inside and the juices run clear, 1 hour and 5 minutes to 1 hour and 15 minutes. An instant-read meat thermometer inserted into the center of the loaf should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "akBh3W52dKl.07dKvkVticqBz0eSpG."
    },
    {
        "title": "Farro, Sausage, and Spinach Dinner",
        "ingredients": [
            "1/2 cup farro ADVERTISEMENT",
            "1 cup pitted and sliced black cherries ADVERTISEMENT",
            "1/4 cup red wine ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 jalapeno chicken sausages, chopped ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "5 cups baby spinach leaves ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 ounces goat cheese, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook farro in the boiling water until tender, 20 to 30 minutes. Drain.\nCook and stir cherries in a small saucepan over medium-low heat until liquid is released, 5 to 7 minutes. Add red wine and 1 pinch salt; simmer until cherries soften and sauce is slightly reduced, 15 to 20 minutes. Remove from heat.\nHeat olive oil in a frying pan; cook and stir sausage until browned, 5 to 10 minutes. Add mushrooms and a pinch salt. Cook and stir until liquid is released from mushrooms, about 5 minutes. Stir farro and white wine into mushroom mixture; cook until wine has evaporated, about 5 minutes.\nRemove pan from heat. Add spinach, parsley, and cherry sauce; stir until spinach is slightly wilted. Stir in goat cheese until melted; toss well.\n",
        "picture_link": "nK/LLk3xkgmfNPO1.K7Y65LNK7h2OlC"
    },
    {
        "title": "Blue Cheese and Bacon Potato Salad",
        "ingredients": [
            "5 cups iced water, or as needed ADVERTISEMENT",
            "1 pound small red potatoes ADVERTISEMENT",
            "1/2 pound fresh green beans, cut into 1-inch pieces ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "1/4 cup white wine vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon stone-ground mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 ounces crumbled blue cheese ADVERTISEMENT",
            "4 green onions, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large bowl with iced water. Line a baking sheet with a dish towel.\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 18 to 20 minutes. Add green beans to the boiling water; blanch for just 1 minute. Drain potatoes and green beans; transfer to bowl of iced water to stop cooking process, about 5 minutes. Remove from iced water with a slotted spoon and place on prepared baking sheet to dry. Cut potatoes into quarters.\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain and cool bacon slices on paper towels; crumble.\nWhisk vinegar, olive oil, mayonnaise, and mustard together in a large bowl. Season with salt and black pepper. Add potatoes and green beans; stir to coat. Top with bacon, blue cheese, and green onions; stir once to incorporate.\n",
        "picture_link": "RRvSuWCvy0mDOQKTEVO9w1xqBfBZgey"
    },
    {
        "title": "Pressure Cooker Tortilla Soup",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "1 (12 ounce) jar roasted red peppers, drained and chopped ADVERTISEMENT",
            "1 (4 ounce) can roasted jalapeno peppers, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "4 cups diced tomatoes ADVERTISEMENT",
            "1 (32 fluid ounce) container chicken stock ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 cup chopped fresh cilantro ADVERTISEMENT",
            "1 (14.5 ounce) package tortilla chips ADVERTISEMENT",
            "1 cup sour cream (optional) ADVERTISEMENT",
            "1 (8 ounce) package shredded queso quesadilla (white Mexican cheese) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in pressure cooker over medium heat; cook and stir onions until slightly softened, 5 to 8 minutes. Add red peppers, jalapeno peppers, garlic, black pepper, and salt; cook until garlic is fragrant and onions are softened, about 5 more minutes. Stir tomatoes into onion mixture and cook until warmed, about 1 minute.\nTransfer tomato mixture to a blender. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Transfer tomato puree back to pressure cooker.\nStir chicken stock into tomato puree; cook and stir over high heat until just boiling, about 5 minutes. Cover and lock pressure cooker. Cook over high heat until steam begins to build and steadily escapes. Lower heat to medium-low; cook for 20 more minutes. Remove from heat; allow all the steam to naturally release. Remove lid.\nBring soup to a boil; stir in cream and cilantro. Remove from heat. Let cool for 5 minutes.\nCrush tortilla chips into serving bowls; pour soup over tortilla chips. Top with sour cream and queso quesadilla.\n",
        "picture_link": "zZV9H5au3QD29QlOFgU0zvAKqC3zBJu"
    },
    {
        "title": "Strawberry Peach Smoothie",
        "ingredients": [
            "3/4 cup vanilla-flavored soy milk ADVERTISEMENT",
            "1 (1/2 cup) scoop vanilla ice cream ADVERTISEMENT",
            "1/4 cup frozen sliced strawberries ADVERTISEMENT",
            "4 sliced fresh strawberries ADVERTISEMENT",
            "1 small fresh peach, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour soy milk into a blender and add vanilla ice cream, frozen strawberries, fresh strawberries, and peach slices. Blend until smooth and pour into a large glass.\n",
        "picture_link": "BdQWbsJ15n1/D1oAKrfc4UeKHt.nTCK"
    },
    {
        "title": "Mom's Pie Crust for a Double Crust Pie",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour and salt together in a bowl. Cut in shortening until it looks like coarse crumbs. Add water until dough forms.\n",
        "picture_link": "SEg.tg8ReNRTkwWH8c7AF2MhCjNe7lK"
    },
    {
        "title": "Fruity Cream Cheese Spread",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1/2 cup sliced fresh strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine cream cheese, pineapple, and strawberries. Stir until well blended.\n",
        "picture_link": "tGLZFBeQVzGHpdC39YGZJEapyGNwNVO"
    },
    {
        "title": "Veggie Oven Chicken",
        "ingredients": [
            "6 chicken thighs ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "2 onions, peeled and cut into chunks ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "3 carrots, coarsely chopped ADVERTISEMENT",
            "4 potatoes, peeled and quartered ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nAdd 1 tablespoon vegetable oil to a 9x13 inch baking dish. Season chicken pieces with garlic powder, allspice, parsley, paprika, salt and pepper. Place seasoned chicken pieces in baking dish.\nAdd the green bell pepper, onion and tomatoes to the chicken. Place the carrots and potatoes around the chicken and drizzle 2 tablespoons olive oil over all. Cover dish with aluminum foil and bake in the preheated oven for 1 hour, basting chicken with juices, until chicken is no longer pink inside and potatoes are cooked through and tender.\n",
        "picture_link": "Jqttg5fINezz5M8JMEg4mIlJKRIM76O"
    },
    {
        "title": "Farm Apple Pie",
        "ingredients": [
            "5 pounds apples - peeled, cored and sliced ADVERTISEMENT",
            "4 teaspoons lemon juice ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 cups shortening ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/4 cup water, or as needed ADVERTISEMENT",
            "2 cups sifted confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place apples in a bowl, and toss with lemon juice.\nMix 3/4 cup white sugar and 3/4 cup brown sugar with cinnamon, set aside.\nIn a large bowl, mix flour, 4 teaspoons sugar, salt, and baking powder. Cut in shortening. Beat egg yolks in a 1 cup measuring cup, add water to make 1 cup. Stir into flour mixture to form the pastry.\nDivide pastry in about half. Use the larger portion for the bottom crust. Roll out bottom crust to fit the bottom and extended up and over the sides of jelly roll pan (pan is about 10 X 15 inches). Place crust in the pan.\nAlternate layers of apples and sugar mixture on the bottom crust.\nRoll out the top crust slightly larger than the jelly roll pan, and place on top of the apple filling. Turn the extended top crust under the bottom crust at the edges and pinch to seal. Make small slits in top crust to allow steam to escape.\nBake at 400 degrees F (200 degrees C) for 50 minutes or until the top crust is browned.\nTo make glaze, combine confectioners sugar, vanilla, butter, and milk until mixture has consistency of a glaze. Drizzle glaze over the top of the pie while it is still warm. Cut into squares to serve.\n",
        "picture_link": "mYDRuWoRQZhJoBJ4ZKHjmTFTlDqfy8u"
    },
    {
        "title": "Fish Supreme",
        "ingredients": [
            "2 (6 ounce) fillets cod ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup tomato sauce ADVERTISEMENT",
            "3 potatoes, peeled and sliced paper-thin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace fish fillets in a 8x12 inch baking dish and season with salt and pepper. Pour tomato sauce over fillets and layer sliced potatoes on top. Season to taste with salt and pepper. Loosely cover dish with foil.\nBake in the preheated oven for 15 to 20 minutes or until fish flakes with a fork and potatoes are tender.\n",
        "picture_link": "qBtYBZk6idDG.lP0.rhY9QIXxu.yNSi"
    },
    {
        "title": "Italian Riboletta Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "3 cups shredded cabbage ADVERTISEMENT",
            "1 potato, peeled and diced ADVERTISEMENT",
            "2 1/2 cups cooked white beans ADVERTISEMENT",
            "6 slices French or Italian-style bread ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, heat the olive oil over medium heat. Cook the onions, garlic, celery and carrot until the onion is soft.\nStir in bay leaf, parsley, chicken stock, water, tomatoes, thyme, cabbage, potato, and cooked beans. Bring to a simmer and cook for about 40 minutes, or until beans are tender. Season with salt and pepper to taste.\nPreheat oven to 350 degrees F(1175 degrees C). In a 4 quart casserole dish, place 1/3 of the mixture over the bottom. Layer 3 of the stale pieces of bread over the top. Place another 1/3 of the soup mixture over the bread followed by remaining 3 slices of bread. Top with remaining 1/3 of soup.\nSprinkle with Parmesan cheese and bake for 30-40 minutes, or until soup is bubbling and cheese is light golden.\n",
        "picture_link": "Qx4ohF6OY4j59Hx.T1.pA22wQ96RV9S"
    },
    {
        "title": "Cheesy Vegetable Soup II",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cups fresh sliced mushrooms ADVERTISEMENT",
            "5 potatoes, peeled and cubed ADVERTISEMENT",
            "2 cups chopped carrots ADVERTISEMENT",
            "6 cups milk ADVERTISEMENT",
            "2 (11 ounce) cans condensed cream of Cheddar cheese soup ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "1/2 cup frozen green peas ADVERTISEMENT",
            "1/2 cup frozen corn kernels ADVERTISEMENT",
            "1 cup broccoli florets ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium high heat, combine the olive oil, garlic to taste, onions and mushrooms. Saute for about 5 minutes, or until the onions are tender. Remove from heat and reserve for later.\nIn a large pot over high heat, combine the potatoes and carrots and add water to cover. Bring to a boil and reduce heat to low. Cover and simmer until vegetables are tender. Drain the water and add the milk. Continue to cook over low heat until milk starts to simmer.\nStir in the cheese soup, then stir in the flour slowly, until mixed. Add 1 1/2 cups of the cheese, the reserved mushroom mixture, peas, corn and broccoli and heat through. Garnish with remaining 1/2 cup of cheese.\n",
        "picture_link": "...l533wI07744o7e7sWey.uIcAk.FG"
    },
    {
        "title": "Carrot Spice and Walnut Pie",
        "ingredients": [
            "1 (9 inch) deep dish pastry shell, partially baked ADVERTISEMENT",
            "1 pound baby carrots ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "5 tablespoons unsalted butter, softened ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup finely chopped walnuts ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSteam carrots until soft but not mushy. Cool slightly.\nPlace carrots in food processor and puree until smooth. Add honey, eggs, butter or margarine, salt, cinnamon, nutmeg, vanilla, and walnuts. Blend until smooth. Pour mixture into a large bowl.\nIn a separate bowl combine brown sugar and white sugar, mixing well to get all lumps out. Fold sugar mixture gradually into carrot mixture until well incorporated. Pour mixture into partially baked pie shell.\nBake in preheated oven for 60 to 70 minutes, until toothpick inserted in center comes out clean. Serve pie warm or cold. Refrigerate any leftovers.\n",
        "picture_link": "Jes5O2Z6sruDKEHyDy19WCxJdKlKLyy"
    },
    {
        "title": "Rub Noodle Potato Soup",
        "ingredients": [
            "4 potatoes, peeled and diced ADVERTISEMENT",
            "8 cups water to cover ADVERTISEMENT",
            "1 onion, finely diced ADVERTISEMENT",
            "1/4 teaspoon celery salt ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes, onion, water, celery salt, salt, and pepper in Dutch oven and bring to boil. Reduce heat and let simmer till potatoes are fork tender.\nMeanwhile, mix rub noodles. Place flour in small bowl, break egg over flour, and mix with fingertips, rubbing mixture together until all flour is absorbed and small lumps form.\nDrop the dough mixture slowly into boiling potatoes, stirring constantly, and reduce heat. Let simmer 20 minutes, stirring frequently. Add additional salt and pepper to taste.\n",
        "picture_link": "Rd1S1oHKRWp2HL4QifXg9Y/ofEaxHFC"
    },
    {
        "title": "Teri-Chester Chicken",
        "ingredients": [
            "2 skinless, boneless chicken breast halves, cut into bite size pieces ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon fresh oregano ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 lemon, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Generously sprinkle chicken with soy sauce and Worcestershire sauce. Sparingly sprinkle with oregano leaves and garlic salt. Place into a cooking dish on top of the lemon slices. Cook in microwave on high for 5 minutes. Stir and cook on high for another 5 minutes. Repeat until done.\nTo Prepare In Conventional Oven: Preheat oven to 350 degrees F (175 degrees C). Prepare chicken. Bake in preheated oven for 15 to 20 minutes, stirring after 7 minutes.\n",
        "picture_link": "MUpd1xyq07xs6EIeD8627n.9WVWnTSi"
    },
    {
        "title": "Corn Pudding I",
        "ingredients": [
            "1 1/2 teaspoons olive oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1/2 cup red bell pepper, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "2 cups whole kernel corn, drained ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup cornmeal ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 cup crushed tortilla chips ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 2 quart casserole dish.\nSaute the onions, red bell peppers and garlic in the olive oil. Add the corn and continue to cook.\nIn a another saucepan bring the milk to a simmer and slowly stir in the cornmeal. Simmer for 2 to 3 minutes, constantly stirring until thick. Remove from the heat and add salt and pepper to taste.\nWhisk the egg and egg whites together and slowly add them to the cornmeal mixture. Stir in the onion mixture, shredded cheese and parsley into the cornmeal mixture. Spoon mixture into the prepared casserole dish. Sprinkle top with more grated cheese and crushed corn tortilla chips.\nBake for 40 to 45 minutes or until firm.\n",
        "picture_link": "e9QooHup6Csr7QbvUYPqCKc8.18CSyu"
    },
    {
        "title": "Helen's Raisin Drop Cookies",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 cups raisins, soaked in water and drained ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets or line with parchment paper.\nIn a medium bowl, cream together the shortening and sugar. Stir in the eggs, one at a time, and then the vanilla. Mix in the flour and baking soda until combined. Then stir in the raisins just enough to distribute evenly.\nDrop by heaping teaspoonfuls onto the prepared cookie sheets. Bake for 8 to 10 minutes in the preheated oven. Cool on wire racks.\n",
        "picture_link": "qqQ2vcy9ximr34d7kO3.Hi0m4H3KQGe"
    },
    {
        "title": "Porcini Mushroom Pasta",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 red onion, minced ADVERTISEMENT",
            "1/2 cup red bell pepper, julienned ADVERTISEMENT",
            "1/2 cup julienned carrots ADVERTISEMENT",
            "1/2 cup dry red wine ADVERTISEMENT",
            "1 cup rehydrated porcini mushrooms ADVERTISEMENT",
            "1 1/2 cups crushed tomatoes ADVERTISEMENT",
            "2 teaspoons chopped fresh basil ADVERTISEMENT",
            "1 teaspoon dried rosemary, crushed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 cups tagliatelle ( wide noodles) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat. Add garlic and onions and saute for 4 minutes, then add red bell pepper and carrots and saute for 4 more minutes. Add red wine, raise heat and boil for 1 minute; then reduce heat to medium low, add mushrooms and cook for 3 minutes.\nAdd tomatoes, basil and rosemary and season with salt and pepper to taste. Simmer for 10 minutes and serve sauce over cooked noodles.\n",
        "picture_link": "Hr0CrbF.uadEVQzg9cJEYNr9wfqr0nW"
    },
    {
        "title": "Chicken Vegetable Soup",
        "ingredients": [
            "1 boneless skinless chicken breasts, cut into 1 inch pieces ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 (10 ounce) package frozen diced carrots ADVERTISEMENT",
            "4 cups tomato-vegetable juice cocktail ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 1/2 cups farfalle pasta ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium high heat, combine the chicken, onion, garlic and butter or margarine. Saute for about 5 minutes, or until the onions are tender. Add the carrots, tomato vegetable juice, water, macaroni and seasoning.\nBring to a boil, then reduce heat to low. Cover and simmer for about 20 minutes. Add the spinach and cook 5 more minutes. Serve hot with the crackers.\n",
        "picture_link": "7JRrxmM0jt/b3Wx.1/bnFt7IwVetE36"
    },
    {
        "title": "Beef and Cheese Ball",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "5 ounces dried beef ADVERTISEMENT",
            "1 small white onion, chopped ADVERTISEMENT",
            "1 small finely chopped green bell pepper ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon onion juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium-sized mixing bowl, combine cream cheese, 2/3 of the beef, onion, green bell pepper, Worcestershire sauce, and onion juice. Mix well and shape mixture into a ball. Using the reserved beef, coat the rest of the ball with beef.\n",
        "picture_link": "OhMiKA6RskyZNopAZKPk4REFWgr9f9u"
    },
    {
        "title": "Smoky Roll Ups",
        "ingredients": [
            "3 skinless, boneless chicken breast halves - pounded thin ADVERTISEMENT",
            "12 slices smoked beef ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup apricot jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTrim the fat from the smoked meat, place a piece on each chicken breast slice and roll. Fasten with toothpicks and place seam side down in a 9x13 inch baking dish.\nMix together ketchup, mayonnaise and jam. Pour mixture over chicken and bake uncovered in the preheated oven for 20 to 25 minutes.\n",
        "picture_link": "Z40BSeZA4CqK/QgQ8D93nc13ekhLAT."
    },
    {
        "title": "Spicy Roll-ups",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup black olives, pitted and minced ADVERTISEMENT",
            "3 teaspoons hot pepper sauce ADVERTISEMENT",
            "4 (10 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl mix cream cheese, chopped olives and pepper sauce.\nSpread a thin layer of the mixture on each tortilla. Starting at one end, gently roll tortilla into a tight tube. Wrap with plastic wrap and chill until ready to serve. To serve, slice into 1 inch slices. Serve slices on their side.\n",
        "picture_link": "BfFhSduo19lXq.g0Pu5w399m1F4zj6G"
    },
    {
        "title": "Lydia's Cranberry Salad",
        "ingredients": [
            "1 pound fresh cranberries ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 pounds seedless red grapes, quartered ADVERTISEMENT",
            "1 (16 ounce) package miniature marshmallows ADVERTISEMENT",
            "2 cups chopped pecans ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, grind cranberries. Transfer to a medium bowl, and mix with sugar. Chill overnight in the refrigerator.\nIn a large bowl, mix together cranberry mixture, marshmallows, pecans, and grapes. Fold in nondairy whipped topping 1 hour before serving.\n",
        "picture_link": "Sb6OauPjP6roO1DMLdWRwozQ/EdGcCS"
    },
    {
        "title": "Whole Wheat Rigatoni and Cauliflower, Wilted Arugula, Feta & Olives",
        "ingredients": [
            "1 pound bite-size whole wheat pasta, such as rigatoni or penne ADVERTISEMENT",
            "1 tablespoon Salt ADVERTISEMENT",
            "1 medium head cauliflower, trimmed and cut into bite-size florets ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/2 red bell pepper, cut into medium dice ADVERTISEMENT",
            "1/2 yellow bell pepper, cut into medium dice ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 cup canned crushed tomatoes ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/4 cup coarsely chopped pitted kalamata olives ADVERTISEMENT",
            "4 cups factory-washed arugula or spinach ADVERTISEMENT",
            "3/4 cup crumbled feta cheese, divided ADVERTISEMENT",
            "1 pinch Freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a generous 2 quarts of water and salt to a boil in a large soup kettle; add pasta and cook, partially covered, for 4 minutes. Add cauliflower and cook, partially covered, until pasta and cauliflower are tender, about 6 minutes longer. Reserve 1 cup of cooking liquid, drain pasta and return top pot.\nMeanwhile, heat oil in a 10-inch skillet. Add peppers, and saute until tender, about 4 minutes. Add garlic; continue to saute until golden and fragrant, about 1 minute longer. Add tomatoes, seasoning and olives; simmer sauce about 5 minutes. Add sauce to pasta, along with reserved cooking liquid, arugula and 1/2 cup feta. Toss, seasoning to taste with pepper. Serve with additional feta.\nFor lunch, pack pasta and extra feta in leakproof containers. Warm pasta in microwave and top with feta.\n",
        "picture_link": "mkBYGWafUykcV4hUCSn/Io9BdsixEbq"
    },
    {
        "title": "Bruschetta with Hummus",
        "ingredients": [
            "1 (14 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "3 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/4 teaspoon chopped fresh garlic ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "12 slices ciabatta bread ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "24 slices roma (plum) tomatoes ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For the hummus, place the drained garbanzos, lemon juice, garlic, cumin, and olive oil in a food processor. Process until blended, about 1 minute. Refrigerate overnight. Bring to room temperature before making the bruschetta.\nSpread a teaspoon of butter on each slice of ciabatta; sprinkle with a teaspoon of Parmesan cheese. Place under broiler until slices are golden, about 3 minutes. Remove from oven and spread with a generous tablespoon of hummus. Sprinkle with a dusting of paprika.\nTo serve, top with tomato slices, feta cheese, and a sprinkle of the oregano and garlic powder.\n",
        "picture_link": "gC4T42qNSTUH0oj.HrHIDZQbne.NODq"
    },
    {
        "title": "Vegetarian Black Bean Chili",
        "ingredients": [
            "1/2 cup applesauce ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon ground coriander ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1 pinch asafoetida powder (optional) ADVERTISEMENT",
            "1 (15 ounce) can black beans ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 yellow squash, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 sweet potato, peeled and diced ADVERTISEMENT",
            "1 cup chopped fresh mushrooms ADVERTISEMENT",
            "1 quart water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium-low heat, mix the applesauce, brown sugar, coriander, cayenne pepper, cumin, oregano, cloves, rosemary, sage, thyme and asafoetida powder. Cook just until heated through. Stir in black beans and tomato paste. Mix in garlic, onion, squash, carrots, sweet potato and mushrooms. Pour in enough water to cover. Bring to a boil, reduce heat to low and simmer 45 minutes, stirring occasionally.\n",
        "picture_link": "op15lN/9IQDOXRpCHHlBheBQaA52FMG"
    },
    {
        "title": "Grilled Sherry Pork Chops",
        "ingredients": [
            "1/4 cup Holland House® Sherry Cooking Wine ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "4 pork chops, 1-inch thick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In plastic bowl, combine sherry, molasses and soy sauce; pour over pork chops. Cover; refrigerate 30 minutes.\nPrepare grill. Drain pork chops; save marinade.\nGrill pork chops over medium-high heat 20 to 30 minutes or until pork is no longer pink in center, turning once and brushing frequently with marinade. Do not baste during last 5 minutes of grilling. Discard any remaining marinade.\n",
        "picture_link": "22HCsl/7DKbn/qAEVh5ah64J3z9260y"
    },
    {
        "title": "Apple Pie Ham",
        "ingredients": [
            "1 (4 pound) fully-cooked, bone-in ham ADVERTISEMENT",
            "1 (20 ounce) can apple pie filling ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "2 tablespoons barbeque sauce ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Place the ham in a baking dish or roasting pan and cover tightly with aluminum foil.\nRoast for 30 minutes in the preheated oven. While the ham roasts, mix together the apple pie filling, mustard, barbeque sauce and honey. Coat ham with the mixture when the 30 minutes are up.\nReturn to the oven uncovered and cook for an additional 30 minutes or until ham is heated through.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Welsh Rarebit",
        "ingredients": [
            "1 (10.75 ounce) can condensed Cheddar cheese soup ADVERTISEMENT",
            "1 1/4 cups 2% low-fat milk ADVERTISEMENT",
            "1 (12 ounce) can beer ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the cheese soup and milk into a saucepan and warm over low heat, stirring to blend. Mix in the beer, Worcestershire sauce and cayenne pepper. Serve over toasted bread.\n",
        "picture_link": "qGruGDPaHfjDbngEFKAedcgn8FJyF3m"
    },
    {
        "title": "Tilapia and Mizithra Pasta",
        "ingredients": [
            "2 ounces dry spaghetti ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "1 tilapia fillet ADVERTISEMENT",
            "1/2 cup cherry tomatoes ADVERTISEMENT",
            "1 portobello mushroom cap, chopped ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 lemon ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/2 cup torn romaine lettuce ADVERTISEMENT",
            "1/4 cup grated Mizithra cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of lightly salted water to a boil. Add spaghetti, and cook until tender, about 8 minutes. Drain.\nMeanwhile, heat the oil in a skillet over medium heat. Place the tilapia fillet in the center, and add the tomatoes and mushroom. Season with pepper, and then squeeze the lemon juice over everything. Place the squeezed lemon half into the skillet.\nCover, and cook for about 10 minutes, turning the fish once, or until fish flakes easily with a fork. Toss with pasta and romaine lettuce. Serve over spaghetti, and garnish with Mizithra cheese.\n",
        "picture_link": "OOZTXoj71SfPDTq3hybIdR.n.nM6MJi"
    },
    {
        "title": "Harvest Beef Stew",
        "ingredients": [
            "4 tablespoons bacon drippings ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "2 1/2 pounds beef stew meat, cut into 1 inch cubes ADVERTISEMENT",
            "5 tablespoons olive oil ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "6 cloves garlic, thinly sliced ADVERTISEMENT",
            "1 pound carrots, peeled and sliced ADVERTISEMENT",
            "1 pound celery, sliced ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "4 cups beef broth ADVERTISEMENT",
            "2 (12 fluid ounce) cans or bottles ale ADVERTISEMENT",
            "1 parsnip, peeled and sliced ADVERTISEMENT",
            "1 turnip, peeled and chopped ADVERTISEMENT",
            "1 pound baby red potatoes, washed ADVERTISEMENT",
            "3/4 cup parsley, chopped ADVERTISEMENT",
            "4 whole bay leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat bacon grease in a large pot over medium heat.\nCombine flour with salt and pepper. Coat beef cubes.\nBrown meat in the bacon grease until nicely browned. Remove to a paper towel, and set aside.\nHeat olive oil in the same pot. Cook onions, garlic, carrots, and celery over low heat. Add the vinegar and sugar. Pour in the broth and bring to a boil. Deglaze the pan by scraping off the food stuck on the bottom of the pot.\nReturn meat to pot. Pour in beer, then stir in parsnips, turnips, red potatoes, parsley, and bay leaves. Reduce heat to medium low. Cover and simmer for 90 minutes, stirring occasionally.\n",
        "picture_link": "z.nNYUr8bccXVSmmgU3UR22XZoiCpKy"
    },
    {
        "title": "Fresh Summer Fruit Salad",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "2/3 cup sugar ADVERTISEMENT",
            "3 cups thinly sliced rhubarb ADVERTISEMENT",
            "15 seedless grapes, halved ADVERTISEMENT",
            "1/2 orange, sectioned ADVERTISEMENT",
            "10 fresh strawberries, hulled and halved ADVERTISEMENT",
            "1 apple, cored and diced ADVERTISEMENT",
            "1 peach, sliced ADVERTISEMENT",
            "1 plum, pitted and sliced ADVERTISEMENT",
            "15 pitted Bing cherries ADVERTISEMENT",
            "1/4 cup fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and sugar to a boil in a medium saucepan over medium heat. Stir in the rhubarb, turn heat to low, cover, and simmer until rhubarb is soft, 10 to 15 minutes. Mash and chill in the refrigerator, about one hour.\nTo serve, mix the grapes, orange, strawberries, apple, peach, plum, cherries, and blueberries with 2/3 cup of the rhubarb sauce. Stir gently, but thoroughly to coat. Refrigerate for at least two hours to allow the flavors to blend.\n",
        "picture_link": "gNqRZImLe4swP0SCY690lx9C3/oxE.i"
    },
    {
        "title": "Saffron-Scented Lobster Paella",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "16 head-on medium shrimp ADVERTISEMENT",
            "1 red onion, diced ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 cups Arborio rice ADVERTISEMENT",
            "5 1/2 cups hot fish stock ADVERTISEMENT",
            "1/4 teaspoon saffron threads ADVERTISEMENT",
            "1 1/2 teaspoons smoked paprika ADVERTISEMENT",
            "1 teaspoon lemon or lime zest ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "16 mussels, scrubbed and debearded ADVERTISEMENT",
            "1 pound red snapper fillets, cut into 1 inch pieces ADVERTISEMENT",
            "1/4 pound medium shrimp, peeled and deveined ADVERTISEMENT",
            "1 (10 ounce) cooked lobster tail, cut into 1/2-inch thick slices ADVERTISEMENT",
            "2 tomatoes, seeded and diced ADVERTISEMENT",
            "2 lemons, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a very large skillet or paella pan over medium-high heat. Add the head-on shrimp and sear on each side until they turn orange and have lightly browned (they should still be raw on the inside). Remove the shrimp and set aside.\nReduce heat to medium and stir in red onion and garlic. Cook for a few minutes until the onion has softened and turned translucent. Stir in Arborio rice until coated with oil. Pour in the fish stock and season with saffron, paprika, lemon zest, and oregano. Bring to a simmer over medium-high heat then stir in sea salt to taste. Reduce heat to medium-low and gently simmer uncovered for 15 minutes, stirring occasionally.\nDecoratively nestle the mussels and head-on shrimp into the rice, cover, and simmer for 5 minutes. Next, push the red snapper and deveined shrimp into the rice, recover and simmer an additional 10 minutes. Finally, add lobster and sprinkle with diced tomatoes. Cover and simmer until the mussels have opened, the rice is tender, and the lobster is hot; about 5 minutes more.\nServe in the paella pan garnished with lemon wedges.\n",
        "picture_link": "Ci6V6VhJjkL5Oe0Jc48KxavpsiNvyZW"
    },
    {
        "title": "Carrot-Bean Sprouts Salad",
        "ingredients": [
            "2 cups grated carrots ADVERTISEMENT",
            "1/2 cup bean sprouts ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon grated fresh coconut ADVERTISEMENT",
            "1 tablespoon finely chopped cilantro ADVERTISEMENT",
            "1 tablespoon sunflower seed oil ADVERTISEMENT",
            "1 teaspoon mustard seed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, gently toss the carrots, bean sprouts, sugar, lemon juice, coconut, and cilantro.\nHeat the oil in a small saucepan over medium heat. Stir in the mustard seed, and cook until golden brown. Mix into the salad. Season with salt.\n",
        "picture_link": "Wuwu6OX.9h0mzvaSkxx9F.IXCMu/Gfa"
    },
    {
        "title": "Cindy's Ritzy Eggplant",
        "ingredients": [
            "1 (8 ounce) package buttery round crackers ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1 eggplant, peeled and sliced into 1/2 inch rounds ADVERTISEMENT",
            "3/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray baking sheet with cooking spray or lightly grease with olive oil.\nCrumble crackers into a large bowl. Stir in onion powder, black pepper, garlic powder, and salt.\nIn a separate bowl, stir together eggs and lime juice.\nDip eggplant slices into egg mixture, then dredge in cracker mix, and place on baking sheet.\nBake in preheated oven for 15 minutes. Turn eggplant pieces, top with grated cheese, and cook an additional 15 minutes.\n",
        "picture_link": "uTxDvS2kOet3Qt4Bn/dX9brj3dJd5EO"
    },
    {
        "title": "Zesty Dip for Chips",
        "ingredients": [
            "1 (16 ounce) package shredded Monterey Jack cheese ADVERTISEMENT",
            "2 (4 ounce) cans sliced black olives, drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "4 (4.5 ounce) cans diced green chiles, drained ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 (10 ounce) can white corn, drained ADVERTISEMENT",
            "1 (16 ounce) bottle Italian salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 2 quart bowl or larger, combine the Monterey Jack cheese, black olives, tomatoes, chilies, onions and corn. Pour in salad dressing, and stir to coat. Dressing may be adjusted to suit your taste.\n",
        "picture_link": "ZuIbPXo8.yFqPgj5ftg6o2NL5Lezsf."
    },
    {
        "title": "Macaroni and Cheese with Sausage, Peppers and Onions",
        "ingredients": [
            "1 recipe Creamy Macaroni and Cheese ADVERTISEMENT",
            "1 pound Italian sausage, removed from casings ADVERTISEMENT",
            "1 medium-large onion, thinly sliced ADVERTISEMENT",
            "1 bell pepper, thinly sliced ADVERTISEMENT",
            "1/4 cup fresh basil, torn in pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Follow the recipe for Creamy Macaroni and Cheese.\nHeat a 10-inch skillet over medium-high heat. Cook sausage, breaking it up as it fries, until it loses its raw color, 3 to 4 minutes. Add onion and pepper slices, and saute until soft, about 5 minutes. Add basil, then stir mixture into macaroni. Serve hot.\n",
        "picture_link": "2zNSO17ZgIjp143kc70qWxEAgIchKmq"
    },
    {
        "title": "Nicole's Tailgate Party Chicken Salad",
        "ingredients": [
            "2 cups shredded cooked chicken meat ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "2 cups sliced almonds ADVERTISEMENT",
            "2 cups small seasoned croutons ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "4 hard-cooked eggs, peeled and chopped ADVERTISEMENT",
            "2 cups creamy salad dressing, e.g. Miracle Whip ™ ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the chicken, celery, almonds, croutons, Cheddar cheese and eggs. Mix in salad dressing until the ingredients are evenly coated. Cover and refrigerate overnight before serving for best flavor.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Jumpin' Java Cookies",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "1 cup strong brewed coffee ADVERTISEMENT",
            "1 cup raisins (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 baking sheets.\nIn a large bowl, cream the shortening, brown sugar and eggs. Stir in the coffee. Gradually blend in flour, baking soda, cinnamon and salt. Stir in raisins if using. Drop by spoonfuls 2 inches apart on cookie sheets.\nBake 10 to 12 minutes. Let cool on wire racks.\n",
        "picture_link": "Bnv4KEQ/JcaX9TQ3UTedwbvSPUjtR/C"
    },
    {
        "title": "Thai-Style Chicken Satay",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "6 (6 ounce) skinless, boneless chicken breast halves, cut into chunks ADVERTISEMENT",
            "6 (10 inch) skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir soy sauce, lemon juice, peanut butter, garlic, curry powder, brown sugar, and hot pepper sauce together in a large bowl until marinade is well-combined. Place chicken in the marinade and stir to coat. Cover the bowl with plastic wrap and refrigerate 2 hours to overnight.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nRemove chicken from marinade; discard marinade and thread chicken onto skewers.\nCook chicken on the preheated grill until juices run clear and chicken is cooked through, about 5 minutes per side.\n",
        "picture_link": "hy1XR6k208YikD/ru0VlyHguguPw9ny"
    },
    {
        "title": "Low-Cal Roasted Sweet Potato Bites",
        "ingredients": [
            "1 cup peeled and cubed sweet potato ADVERTISEMENT",
            "1/2 teaspoon coconut oil, melted ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh rosemary ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace sweet potato cubes in a bowl. Drizzle coconut oil over potatoes and toss, using your hands, until each cube is coated. Spread sweet potato cubes onto a baking sheet; season with rosemary, thyme, salt, and pepper.\nBake in the preheated oven until potatoes are softened, about 20 minutes.\n",
        "picture_link": "ZvtWHaBtOVEEcusdgdx6nEtElqffvHS"
    },
    {
        "title": "Slow Cooker Vegetarian Chili",
        "ingredients": [
            "2 cubes vegetable bouillon, crumbled ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon ground red pepper ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can dark red kidney beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can vegetarian baked beans ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 cup diced carrot ADVERTISEMENT",
            "1 cup fresh green beans, trimmed and cut into 3/4-inch pieces ADVERTISEMENT",
            "1 cup coconut milk (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir vegetable bouillon, cumin, garlic, chili powder, turmeric, oregano, basil, and red pepper together in a small saucepan; heat over low heat until aromatic, 1 to 2 minutes. Add water, bring to a simmer, and remove from heat.\nStir black beans, red kidney beans, vegetarian baked beans, tomatoes, onion, celery, carrot, and green beans together in a slow cooker; add spice mixture and stir.\nCook on High for 6 to 8 hours.\nStir coconut milk into the chili, reduce heat to Low, and cook at least 30 minutes more.\n",
        "picture_link": "x6yzKq9xP0yyvprz7Ey6wIP0Gww7FTS"
    },
    {
        "title": "Simple Pina Colada Muffins",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 bananas, mashed ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon rum-flavored extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 (20 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "3/4 cup shredded unsweetened coconut, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line with paper muffin liners.\nSift flour, baking soda, baking powder, and salt together in a bowl.\nStir bananas, sugar, butter, egg, rum-flavored extract, and vanilla extract together in a bowl. Fold flour mixture into banana mixture 1 cup at a time. Add pineapple chunks and 1/2 cup coconut; fold gently into batter. Pour batter into prepared muffin cups and top each with about 1 teaspoon shredded coconut.\nBake in the preheated oven until golden brown and a toothpick inserted into the center of a muffin comes out clean, 25 to 30 minutes. Cool for 10 minutes in the pan before removing to a wire rack.\n",
        "picture_link": "Y3EHomHF76.SV.tvDZzOiro1vPSdQ52"
    },
    {
        "title": "Greek Cream Cheese-Stuffed Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breast halves, or more to taste ADVERTISEMENT",
            "1 (8 ounce) container whipped cream cheese ADVERTISEMENT",
            "3/4 cup crumbled feta cheese ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1 (6 ounce) can chopped black olives ADVERTISEMENT",
            "1/4 onion, chopped ADVERTISEMENT",
            "1/4 cup chopped fresh spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCut each chicken breast from one side through the middle horizontally to within one-half inch of the other side. Open the two sides and spread them out like an open book.\nMix cream cheese, feta cheese, tomato, olives, onion, and spinach together in a large bowl. Spoon cheese mixture onto 1 side of each opened chicken breast. Fold each chicken breast closed and place on a piece of aluminum foil.\nCook the chicken breasts on the preheated grill until no longer pink in the center and the juices run clear, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "jS0OVkNsel1rqMk9qmFOoa4dC2/dV4i"
    },
    {
        "title": "Japanese Deviled Eggs",
        "ingredients": [
            "9 eggs ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "2 teaspoons wasabi paste ADVERTISEMENT",
            "2 teaspoons rice wine vinegar ADVERTISEMENT",
            "2 tablespoons thinly sliced green onions ADVERTISEMENT",
            "4 tablespoons panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan; cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nPlace sesame seeds in a dry skillet over medium heat; cook and stir until lightly browned, about 3 minutes. Remove to cool on a plate lined with a paper towel.\nCut each egg in half lengthwise; place egg yolks into a food processor with mayonnaise, soy sauce, wasabi paste, and rice vinegar. Process until smooth; place green onion and panko bread crumbs into yolk mixture and pulse just enough to mix evenly.\nArrange egg white halves on a serving platter; spoon yolk mixture into whites. Sprinkle with toasted sesame seeds.\n",
        "picture_link": "zNvDJGtV9A4IhmjIPsTgbCvJoHGdfde"
    },
    {
        "title": "Garden Club Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup caffeinated citrus-flavored soda ADVERTISEMENT",
            "1 cup chopped pecans (optional) ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 cups frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 F (165 degrees C) and grease the 9 x 13 inch glass baking dish or pan.\nIn a large bowl, combine the cake mix and pudding mix. Add oil, eggs and lime flavored soda. Blend well, then stir in nuts. Pour into greased pan.\nBake at 325 degrees F (165 degrees C) for 35 to 45 minutes or until tooth pick inserted into center of cake comes out clean. Allow cake to cool completely then frost with Green Thumb Frosting.\nGreen Thumb Frosting: Beat pudding mix and cold milk for 2 minutes. Stir in whipped topping until blended. Spread over cake and refrigerate until served. Cake taste improved when refrigerated a few hours before serving. Best if refrigerated overnight!\n",
        "picture_link": "VjSvZxYMbmZa0IzVOqVTdQ17XRFLXVi"
    },
    {
        "title": "Chicken Oriental",
        "ingredients": [
            "2 pounds chicken wings ADVERTISEMENT",
            "1 cup all-purpose flour, for dredging ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2/3 cup orange juice ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon garlic salt (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F(175 degrees C).\nDredge chicken wings in flour and brown slowly in butter or margarine over medium heat. Place browned chicken in a 9x13 inch baking dish.\nAdd the onion, orange juice, ketchup, brown sugar, soy sauce, ground ginger and garlic powder/salt to the frying pan. Bring to a boil. Pour mixture over chicken and bake in preheated oven for 30 minutes. Turn chicken and continue baking for 30 additional minutes or until very tender.\n",
        "picture_link": "TXem/NIJfypclORINt8nL7XEsNzL0c6"
    },
    {
        "title": "White Chocolate Mocha Frosting",
        "ingredients": [
            "2 ounces white chocolate ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "5 teaspoons instant coffee granules ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the instant coffee with the milk, and let it stand until coffee is dissolved.\nMelt the butter and chocolate together, and beat until smooth, then add vanilla.\nBeat in 1 cup of confectioners sugar. Add half the milk mixture, then 1 cup confectioners sugar, then the other half of the milk, then 1 cup confectioners sugar.\n",
        "picture_link": "WGUCH8UKQYqjU0t1vZUQpEApjR1TSEK"
    },
    {
        "title": "Seven-Up™  Mud, Fruit Slide Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/2 cup crushed pineapple, drained ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 teaspoon ground allspice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl, combine cake mix, lemon-lime soda, oil, pineapple, chocolate chips, eggs and allspice. Mix well. Pour batter into 9x13 inch pan.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes. Cake will stay moist, but top should be slightly browned.\n",
        "picture_link": "ezYGhoA9ME55ijVTkhaZQYxIf7/ZJI6"
    },
    {
        "title": "French Fruitcake",
        "ingredients": [
            "3/4 cup candied orange peel ADVERTISEMENT",
            "1/2 cup coarsely chopped walnuts ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 1/2 tablespoons honey ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 tablespoons light cream ADVERTISEMENT",
            "2 tablespoons dark rum ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the candied orange peel, walnuts, and raisins with 2 tablespoons flour. Set aside.\nIn a large bowl, cream the butter with the sugar and honey. Beat in the egg, then the cream or milk, rum, and vanilla. Stir together the remaining 1 1/2 cups flour and the baking powder; beat into the creamed mixture. Stir in the fruits and nuts. Turn the batter into a greased and floured 9 x 5 inch loaf pan.\nBake in a preheated 350 degrees F (175 degrees C) oven for 10 minutes. Lower the heat to 325 degrees F (165 degrees C). Bake the cake 45 minutes longer, or until it tests done with a toothpick. Transfer to a rack to cool.\n",
        "picture_link": "6bKsO.K5C95snq1pbDwc6fqk7tufEua"
    },
    {
        "title": "Fudgey Peanut Butter Chip Muffins",
        "ingredients": [
            "1/2 cup applesauce ADVERTISEMENT",
            "1/2 cup quick cooking oats ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup Dutch process cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup peanut butter chips ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F (175 degrees C). Line muffin cups with paper bake cups.\nIn small bowl, stir together applesauce and oats; set aside. In large bowl, beat butter, sugar, brown sugar, egg and vanilla until well blended. Add applesauce mixture; blend well. Stir together flour, cocoa, baking soda and cinnamon, if desired. Add to butter mixture, blending well. Stir in peanut butter chips. Fill muffin cups 3/4 full with batter.\nBake 22 to 26 minutes or until wooden pick inserted in center comes out clean. Cool slightly in pan on wire rack. Sprinkle muffin tops with confectioners' sugar, if desired. Serve warm.\nVariation: Omit peanut butter chips, add one cup of semi-sweet chocolate chips.\n",
        "picture_link": "kWQJjZuU85SNhcMaBtZ6M9mtCrqhuRK"
    },
    {
        "title": "Orange Glaze I",
        "ingredients": [
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon frozen orange juice concentrate, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix all ingredients together well. Add more confectioner's sugar or orange juice to make the proper consistency for a barely pourable glaze.\n",
        "picture_link": "Hc4nK8B5wMSJW0STGOqBmaPQ04jDv.a"
    },
    {
        "title": "Beer Cake II",
        "ingredients": [
            "2/3 cup butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "8 ounces cherries, pitted and halved ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 cup beer ADVERTISEMENT",
            "1/4 cup cherry juice ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "4 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "4 cups sifted confectioners' sugar ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift flour, baking soda and salt. Set aside.\nIn a large bowl, cream 2/3 cup butter and white sugar until light and fluffy. Add 2 eggs and 2 squares melted chocolate. Add flour mixture alternately with beer, buttermilk and cherry juice. Mix until smooth, then fold in cherries and chopped nuts. Pour batter into a 9x13 inch pan.\nBake at 350 degrees F (175 degrees C) for 45 to 60 minutes, or until a toothpick inserted into the center of cake comes out clean.\nTo make frosting: in a large bowl, combine 2/3 cup butter, 1 egg, 4 squares melted chocolate, confectioners sugar and milk. Beat until smooth. Spread on top of cooled cake.\n",
        "picture_link": "g6tyBOY/wMGZb1t554HwSNgfypkafxW"
    },
    {
        "title": "Basic Fruit Bread Recipe",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup shredded apple ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 4 1/2 x 8 1/2 inch loaf pan.\nMix flour, baking powder, soda, salt, sugar, oil, eggs, apple, walnuts, and vanilla only until dry ingredients are moistened.\nBake in greased 4 1/2 x 8 1/2 inch loaf pan at 350 degrees F (175 degrees C) for 35 to 40 minutes.\n",
        "picture_link": "7ap0/awtJfC/8YAuasafYZy8yk1yQ6C"
    },
    {
        "title": "Caramel Cream Frosting",
        "ingredients": [
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 2 tablespoons sugar in a saucepan. Cook over medium heat until sugar is dissolved and becomes golden brown in color. Set aside.\nCombine remaining 1 cup sugar, butter, and cream in a medium saucepan. Cook over medium heat, stirring constantly, until mixture comes to a boil. Stir in caramelized sugar, and return to a boil. Cook for 2 minutes, stirring constantly. Remove from heat. Beat until frosting has a good spreading consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar Free Applesauce Cake",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup unsweetened applesauce ADVERTISEMENT",
            "1 cup frozen apple juice concentrate, thawed ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 1/2 cups ground almonds ADVERTISEMENT",
            "2 Macintosh apples - peeled, cored and finely chopped ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "3 tablespoons unsweetened apple butter ADVERTISEMENT",
            "2 tablespoons frozen apple juice concentrate, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 inch square baking pan.\nBeat the eggs until they drop like ribbons from the beaters. Continue beating and add the oil in a thin stream. Beat in the 1 cup applesauce and the 1 cup unsweetened apple juice concentrate.\nBeat in the flour gradually until well blended. Add the baking soda, ground ginger, ground almonds and apples, mix to combine.\nPour the batter into the prepared pan and bake at 350 degrees F (175 degrees C) for about 40 minutes or until the cake tests done. Let cake cool on a rack for 15 minutes before turning out of pan. Cool completely before frosting.\nCarefully slice the cake in half horizontally with a long serrated knife. Fill and frost with Apple Butter Frosting.\nTo Make Apple Butter Frosting: Beat the cream cheese until soft and fluffy. Gradually beat in the apple butter and remaining 2 tablespoons apple juice concentrate.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lefse II",
        "ingredients": [
            "1 cup buttermilk ADVERTISEMENT",
            "6 tablespoons light corn syrup ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon ground cardamom ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix by hand sour milk or buttermilk, corn syrup, sugar, soda, cardamom, and flour until mixture becomes a soft pliable dough.\nDivide the dough into 12 or so pieces. Roll out each piece until about 1/8 inch thick.\nBake on a lightly floured griddle over very low heat for 12 to 15 minutes per side. Serve warm with your favorite cheese or jam.\n",
        "picture_link": "Y5PRF60sbDgbyg6QOHNsP8EWNW6c4hy"
    },
    {
        "title": "Poor Mans Cake III",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C) grease and flour a 9x13 inch pan.\nIn a saucepan mix brown sugar, raisins, water and shortening. Bring to a boil and boil 3 minutes. Remove from heat and let cool.\nIn a large bowl, combine flour, baking soda, salt, cinnamon, nutmeg and cloves. When raisin mixture is cool, add to dry ingredients and mix well to combine.\nBake at 350 degrees F (175 degrees C) for 30 or 40 minutes. Do not over bake or it will be too dry. Test after 30 minutes. A toothpick inserted into the center of cake should come out clean.\n",
        "picture_link": "5fifLBKad..OBd6naftE/1KvKV7rY9u"
    },
    {
        "title": "Christmas Stollen II",
        "ingredients": [
            "3 tablespoons raisins ADVERTISEMENT",
            "3 tablespoons dried currants ADVERTISEMENT",
            "3 ounces candied mixed citrus peel ADVERTISEMENT",
            "3 tablespoons chopped candied cherries ADVERTISEMENT",
            "4 tablespoons rum ADVERTISEMENT",
            "3/4 tablespoon active dry yeast ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 tablespoons warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup blanched slivered almonds ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1/2 tablespoon grated lemon zest ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "6 tablespoons butter, diced and softened ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the fruit in a bowl with the rum, and soak for at least 1 hour. Sprinkle 1 1/2 tablespoons flour into the fruit, together with the almonds. Stir until the flour is completely absorbed.\nIn a small bowl, stir the yeast and 1 teaspoon sugar into the water. Let stand for 15 minutes.\nWarm the milk until it is lukewarm, and stir in the remaining sugar until it has dissolved. Stir in the almond extract and lemon rind.\nPlace all but 1/4 cup of the flour in a large bowl with the salt, and make a well in the center. Pour in the yeast mixture, and stir in a little of the flour from the edge of the well. Add egg and the milk and sugar mixture. Beat in softened butter. Mix together to form a dough.\nTurn dough onto a floured work surface. Knead, using the rest of the flour, for 15 minutes, or until no longer sticky. Knead in fruit and almonds. Clean and dry the bowl, and brush the inside with 1 tablespoon melted butter. Brush the top of the dough with another 2 teaspoons melted butter or margarine, and place it in the bowl. Cover the dough with a clean cloth. Let rise for 2 hours, or until doubled in size.\nPunch down the dough, and let it rest for 10 minutes. Roll it out into a 8 x 12 inch rectangle. Brush with remaining melted butter or margarine. Bring one long side across it, overlapping it in place with seam by about 1 inch. Press the edge gently to keep it in place. With floured hands, taper the ends of the loaf slightly and push the sides gently together to mound it in the center. The finished loaf should be about 3 1/2 inches wide and 14 inches long. Place the loaf on a floured baking sheet, and brush it with any remaining melted butter or margarine. Leave it in a warm place for 1 hour, or until doubled in size.\nBake at 375 degrees F (190 degrees C) for 45 minutes, or until golden and crusty. Cool on a wire rack. Just before serving the stollen, sift the confectioners' sugar over the top.\n",
        "picture_link": "8xHR7cNUawzVDWmRnKjfFaouitK8eJC"
    },
    {
        "title": "Burnt Sugar Chiffon Cake",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "7 egg yolks ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup egg whites ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Burnt Sugar Mixture: Melt 1 cup white sugar in a pan till medium brown. Slowly stir in 1/2 cup boiling water.\nPreheat oven to 325 degrees (165 degrees C).\nSift together into mixing bowl the flour, 1 1/2 cups white sugar, baking powder, and salt. Form a well in the dry ingredients and add the vegetable oil, egg yolks, burnt sugar mixture, cold water and vanilla. Beat with wooden spoon until smooth.\nBeat egg whites and cream of tartar in large bowl until they hold very stiff peaks. Pour egg yolk mixture in a thin stream over egg whites. Fold in gently. Pour batter into an ungreased tube pan.\nBake at 325 degrees F (165 degrees C) for 65 to 70 minutes.\n",
        "picture_link": "KZ./LYl5YOlLtPmoEXmwO3pljbDm/iy"
    },
    {
        "title": "Baked Chicken Thermidor",
        "ingredients": [
            "2 cups cooked, cubed chicken meat ADVERTISEMENT",
            "1 cup diced celery ADVERTISEMENT",
            "1 cup frozen green peas ADVERTISEMENT",
            "1 (5 ounce) can water chestnuts, drained and chopped ADVERTISEMENT",
            "1/2 cup toasted and sliced almonds ADVERTISEMENT",
            "2 cups chopped red bell pepper ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 tablespoons chopped pimento peppers (optional) ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "2 slices white bread, cut into cubes ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large heat-resistant bowl combine the chicken, celery, peas, water chestnuts, 1/4 cup of the almonds, bell pepper, onion, pimiento, wine and lemon juice. Mix all together.\nIn a saucepan heat the milk and soup over low heat, stirring. Pour soup/milk mixture into bowl containing chicken mixture and mix well. Pour this mixture into a lightly greased 9x13 inch baking dish. Top with bread crumbs.\nBake casserole in the preheated oven for 20 minutes, until bubbly. Sprinkle cheese on top and bake for 5 to 6 minutes more. Sprinkle remaining 1/4 cup almonds on top and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grilled Chicken Wraps",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 links pork sausage ADVERTISEMENT",
            "2 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "12 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slit open each chicken breast. Cut each sausage link in half lengthways, then cut to the length of the chicken breast. Place a halved sausage link inside each chicken breast, then add jalapeno peppers to taste, onion and garlic and seal the chicken with toothpicks.\nSeason the outside of each chicken breast with Cajun spices/seasoning. Wrap each breast with 2 slices of bacon and secure with toothpicks. Place on a barbecue grill over medium coals and grill until done, about 30 minutes each side. Enjoy!\n",
        "picture_link": "w.nCFz2Uj0C9aR4focpP9mDERQcB75O"
    },
    {
        "title": "Hot Cross Buns II",
        "ingredients": [
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "1 1/4 cups warm milk (110 degrees F) ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "4 cups whole wheat flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup currants ADVERTISEMENT",
            "3 ounces candied mixed fruit peel ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, sprinkle the yeast over half the warm milk. Let stand until creamy, about 15 minutes.\nIn another bowl, mix two eggs and butter into the remaining warm milk.\nPlace the whole wheat flour in a mixing bowl and add the salt, nutmeg, currants, and candied citrus peel. Make a well in the center and put in the yeast mixture, butter and egg mixture, and honey. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.\nLightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour. Meanwhile, make the crosses for the buns: Mix together 1 cup flour and 1/2 cup shortening to make a pastry. Roll out the pastry and cut in thin strips, set aside.\nDeflate the dough and turn it out onto a lightly floured surface. Divide into 16 equal pieces and form into round buns. Place them on lightly greased baking sheets\nHanging the prepared strips of dough over the buns loosely so that they touch the baking sheets on each side. This allows for the expansion of the buns. Preheat oven to 400 degrees F (200 degrees C).\nBeat together one egg and 1/4 cup plus 2 tablespoons milk. Brush the buns with this mixture and leave them in a warm place for 20 minutes to rise.\nPlace a tray of hot water in the bottom of the oven to make it steamy. This gives the buns a thin, soft crust. Bake the buns at 400 degrees F (200 degrees C) for 20 minutes, or until they are golden-brown. Cool them on wire racks and serve them split and buttered.\n",
        "picture_link": "IvMdr.kw5cZ.olhltKRTj6ymVjGx6ym"
    },
    {
        "title": "Watergate Cake II",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1 cup lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "3/4 cup flaked coconut ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "2 (1.3 ounce) envelopes whipped topping mix ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (3 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cake mix, oil, eggs, soda drink, and 1 package pudding well, about 5 minutes. Fold in coconut and nuts. Pour into greased and floured 9 x 13 inch pan.\nBake at 350 degrees F (175 degrees C) for 45 minutes. Cool.\nTo Make Icing: Combine dream whip, milk, and 1 package pudding. Beat until thick. Spread over cake. Sprinkle nuts and coconut on top.\n",
        "picture_link": "NjwjiQ0so5DXyhdQpwsAUiGaCMoCUb2"
    },
    {
        "title": "Fruit Cocktail Cake with Sweet, Buttery Sauce",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 cup fruit cocktail, drained ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9-inch square pan.\nWith an electric mixer, mix egg, fruit cocktail, 1 cup sugar, flour, soda, and salt in order given. Pour into prepared pan.\nBake at 350 degrees F (175 degrees C) for 30 minutes.\nTo make sauce: bring to a boil 1 cup sugar, evaporated milk, and butter or margarine. Serve hot on cake.\n",
        "picture_link": "fFJw7XzuKcqIs/XMPSRSJQNLqxEVURq"
    },
    {
        "title": "Reuben Rollups",
        "ingredients": [
            "8 (12 inch) flour tortillas ADVERTISEMENT",
            "1 cup Russian-style salad dressing ADVERTISEMENT",
            "2 pounds prepared coleslaw ADVERTISEMENT",
            "2 cups chopped cooked corned beef ADVERTISEMENT",
            "2 cups shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm tortillas in microwave to soften; keep covered with a damp towel.\nSpread one side of each tortilla with 2 tablespoons Russian-style salad dressing. Arrange equal amounts of the cole slaw in the center of each tortilla. Sprinkle equal amounts corned beef over the cole slaw. Top with equal amounts of Swiss cheese. Tightly roll tortillas around the fillings. Chill in the refrigerator until serving.\n",
        "picture_link": "mZFoLgiLTkKdCCtjW/MzBWLDH5Z2cqG"
    },
    {
        "title": "The Best Sweet and Sour Pork Meatballs",
        "ingredients": [
            "5 pounds bulk Italian sausage ADVERTISEMENT",
            "2 (8 ounce) cans water chestnuts, drained and chopped ADVERTISEMENT",
            "2 bunches green onion, chopped ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 1/2 cups fine dry bread crumbs ADVERTISEMENT",
            "Sweet and Sour Sauce ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "6 tablespoons cornstarch ADVERTISEMENT",
            "2 cups white vinegar ADVERTISEMENT",
            "1 cup pineapple juice ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "soy sauce to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the sausage in a large bowl and mix in the chestnuts, green onion, 1/2 cup of soy sauce, eggs, garlic powder, and breadcrumbs. Roll the mixture into 1 to 1 1/2 inch balls and place on a broiler pan. Bake in the oven for 1 hour. When done, place the meatballs in a slow cooker.\nWhile meatballs are cooking, prepare the sweet and sour sauce by stirring together the sugar and cornstarch in a large saucepan. Pour in vinegar, pineapple juice, ketchup, and soy sauce to taste. Bring to a boil over medium-high heat, then reduce heat to low, and simmer until thickened. Pour sauce over meatballs, and keep warm in the slow cooker.\n",
        "picture_link": "i8D7lkMO2ll9DjU9T9vwZbXz2yf.jUe"
    },
    {
        "title": "Greek Stuffed Tomatoes",
        "ingredients": [
            "4 large ripe tomatoes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cucumber, peeled and diced ADVERTISEMENT",
            "1/2 cup yogurt ADVERTISEMENT",
            "8 ounces black Greek olives, pitted and sliced ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "2 cups crumbled feta cheese ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSlice tomatoes in half, scoop out seeds, and place in a baking dish sliced-side up. Sprinkle with and salt and pepper . Bake for 5 minutes. Remove tomatoes from oven, drizzle with olive oil, and bake an additional 10 minutes.\nWhile baking tomatoes, mix together cucumber, yogurt, olives, basil, and sugar. Stir in feta cheese. Season to taste with salt and pepper.\nRemove tomatoes from oven, fill with cucumber mixture, and sprinkle with parsley. Serve immediately.\n",
        "picture_link": "RNplBL6hY9GHGF20jUxhdPmq5wuRwkm"
    },
    {
        "title": "Slow Cooker Turkey Stew",
        "ingredients": [
            "1 (28 ounce) can canned stewed tomatoes ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "6 cubes chicken bouillon ADVERTISEMENT",
            "1/4 cup dried onion flakes ADVERTISEMENT",
            "1/2 teaspoon lemon pepper seasoning ADVERTISEMENT",
            "1/2 teaspoon dried Italian seasoning ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon dried thyme leaves ADVERTISEMENT",
            "3 pounds turkey thigh meat, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour tomatoes and wine into slow cooker. Stir in bouillon cubes, onion flakes, lemon pepper, Italian seasoning, garlic powder, and thyme; add turkey.\nCover and cook on Low for 8 to 10 hours until the turkey meat pulls apart easily.\n",
        "picture_link": "2ghvkyQrs277RejjFipAzi9hJWG2Abu"
    },
    {
        "title": "Macadamia Nut Pie",
        "ingredients": [
            "1 cup dark corn syrup ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1 (6.5 ounce) jar macadamia nuts, coarsely chopped ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 (9 inch) unbaked pie shell ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the dark corn syrup, sugar, and eggs. Stir in macadamia nuts and melted butter. Pour into pie shell.\nBake in preheated oven for 50 to 60 minutes, or until filling is set. If necessary, cover edge with foil to prevent overbrowning.\n",
        "picture_link": "VZwJ4XqcOjaEDQgoEdbvGlxg69kDy5e"
    },
    {
        "title": "Eggnog Coffee Punch",
        "ingredients": [
            "1 1/2 cups coffee ice cream ADVERTISEMENT",
            "1 1/2 cups eggnog ADVERTISEMENT",
            "1 cup hot strongly brewed coffee ADVERTISEMENT",
            "4 tablespoons frozen whipped topping, thawed ADVERTISEMENT",
            "4 pinches ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scoop the ice cream into a pan over low heat. Stir in the eggnog and coffee; and heat until warm, about 3 minutes. Pour into four glass or ceramic mugs. Top each with 1 tablespoon whipped topping and sprinkle with nutmeg. Serve immediately.\n",
        "picture_link": "0C3cL4jRHl/bzWMiNqtNF.oU45ao3Ve"
    },
    {
        "title": "Chicken Gizzards",
        "ingredients": [
            "1 pound chicken gizzards ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place gizzards in a saucepan with enough water to cover by 1 inch. Bring to a boil over medium heat, cover, and cook for 1 1/2 hours. Drain and chop into bite size pieces.\nMelt butter in a large skillet over medium-high heat. Fry gizzards in butter for about 15 minutes. Season with salt and pepper to taste.\n",
        "picture_link": "5i79X5vCupbXKiyJc9C68vx8OzX50oq"
    },
    {
        "title": "Kenulia's Carrot Casserole",
        "ingredients": [
            "2 pounds carrots, shredded ADVERTISEMENT",
            "1 (8 ounce) package reduced fat cream cheese, softened ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup French fried onions ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, mix the carrots, cream cheese, Cheddar cheese, butter, 1/2 cup French fried onions, and garlic salt. Scoop into a 2 quart casserole dish. Top with remaining French fried onions and dried parsley.\nBake 25 minutes in the preheated oven, until bubbly and lightly browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Marinated Red Peppers",
        "ingredients": [
            "4 cups distilled white vinegar ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups vegetable oil ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "6 cloves garlic, crushed ADVERTISEMENT",
            "1 (2 ounce) can anchovy fillets ADVERTISEMENT",
            "10 red bell peppers, seeded and thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, mix distilled white vinegar, white sugar, vegetable oil and water. Bring to a boil. Remove from heat and stir in salt, garlic and anchovy filets.\nPlace red bell peppers in a large bowl. Cover with the vinegar mixture. Cover and chill in the refrigerator 8 hours, or overnight, before serving.\n",
        "picture_link": "JbbBEUp4P0WzXIUKe2dp/A4XUUvoSeG"
    },
    {
        "title": "Braccialoni",
        "ingredients": [
            "1 (2 pound) boneless round steak ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "8 ounces thinly sliced prosciutto ADVERTISEMENT",
            "2 hard-cooked eggs, chopped ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (32 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1 (16 ounce) package uncooked spaghetti ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound meat as thin as possible, hopefully 1/4 inch thick. Drizzle or brush with 1 tablespoon of olive oil, then sprinkle with a thin layer of bread crumbs. Layer the prosciutto over the crumbs, and sprinkle with remaining bread crumbs, and chopped hard-cooked eggs. Roll the meat up into a tight spiral, and secure with kitchen twine.\nHeat 2 tablespoons of olive oil in a large saucepan, or stock pot over medium-high heat. Sear the outside of the roast on all sides. Pour spaghetti sauce over the roast, and reduce heat to medium-low. Cover and simmer for 2 to 3 hours, stirring occasionally.\nRemove meat from the sauce to a serving platter, and let stand for 15 minutes. Bring a large pot of lightly salted water to a boil. Add spaghetti, and cook until tender, about 7 minutes. Drain.\nCarve the meat into slices about 1/2 inch thick. Serve with spaghetti and sauce.\n",
        "picture_link": "L.h1f4pRmicSnlgNY99jzgNtGLEFQCW"
    },
    {
        "title": "Oyster Dressing II",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1/2 sweet onion, chopped ADVERTISEMENT",
            "1/2 yellow onion, finely chopped ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 pint shucked oysters, chopped ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "3/4 (1 pound) loaf Italian bread, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nMelt butter in a medium saucepan over medium heat. Stir in celery, sweet onion and yellow onion. Cook until tender, about 5 minutes. Mix in poultry seasoning and ground black pepper. Stir in oysters and chicken broth, and remove from heat.\nPlace Italian bread in a large bowl. Pour oyster mixture over the bread and mix to coat.\nTransfer mixture to the prepared baking dish. Cover with foil and bake in the preheated oven 2 hours.\nTurn off oven. Remove foil and allow stuffing to remain in oven about 10 minutes, until surface is crisp.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lusty Lime Virgin",
        "ingredients": [
            "1 (6 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "1 cup diet cola flavored carbonated beverage ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "10 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the limeade concentrate, carbonated beverage, orange juice, water and ice in the container of a blender. Cover, and blend until slushy. If you want to add liquor, add it last, and just blend for a few seconds more.\n",
        "picture_link": "y5Mj/9bgXAFuYx.qTry/33oeFUUpcFK"
    },
    {
        "title": "Vietnamese Beef Noodle Soup",
        "ingredients": [
            "4 ounces dried rice noodles ADVERTISEMENT",
            "6 cups cold water ADVERTISEMENT",
            "3 (10.5 ounce) cans condensed beef broth ADVERTISEMENT",
            "1 teaspoon chopped fresh ginger root ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1 Thai chile, chopped ADVERTISEMENT",
            "1/2 pound boneless top round steak, sliced very thin ADVERTISEMENT",
            "1/4 pound fresh basil ADVERTISEMENT",
            "4 tablespoons snipped fresh cilantro ADVERTISEMENT",
            "1/4 pound mung bean sprouts ADVERTISEMENT",
            "4 green onions, thinly sliced ADVERTISEMENT",
            "4 wedges lime ADVERTISEMENT",
            "hot pepper sauce (optional) ADVERTISEMENT",
            "oyster sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak noodles in cold water for 30 minutes. Drain. Bring water to a boil in large pot. Add noodles, and boil 3 to 5 minutes - don't overcook. Drain, and rinse with cold water. Set aside.\nMeanwhile, combine beef broth, ginger, salt, and Thai pepper in a saucepan. Bring to a boil, and simmer for 15 minutes.\nPlace equal portions of noodles into 4 large soup bowls, and place raw beef on top. Ladle hot broth over noodles and beef. Garnish with lime wedges, basil leaves, cilantro, mung beans, and green onions, and serve with hot pepper sauce and oyster sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mojito Cocktail",
        "ingredients": [
            "2 leaves fresh mint ADVERTISEMENT",
            "1 tablespoon simple syrup ADVERTISEMENT",
            "2 cubes ice ADVERTISEMENT",
            "1 1/4 fluid ounces rum ADVERTISEMENT",
            "1 fluid ounce carbonated water ADVERTISEMENT",
            "1 sprig fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a cocktail glass, muddle (crush) mint leaves with simple syrup. Add ice and rum. Top with carbonated water. Garnish with a sprig of fresh mint.\n",
        "picture_link": "DFXZp4/ffJTHR0Hu6W3ViltpvgPjXRi"
    },
    {
        "title": "Lentil Soup IV",
        "ingredients": [
            "1 pound dry lentils ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 large onion, grated ADVERTISEMENT",
            "4 large tomatoes, grated ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "3 potatoes, diced ADVERTISEMENT",
            "3 carrots, sliced ADVERTISEMENT",
            "2 plantains, sliced ADVERTISEMENT",
            "5 bay leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse and pick through lentils, then place in a bowl with water to cover and let soak while you prepare the other ingredients.\nFill a large pot with 2 quarts of water, and stir in the olive oil and salt. Bring to a boil.\nDrain the lentils, and carefully pour into the boiling water. Add the onions, tomatoes, garlic, potatoes, carrots and plantains into boiling water. Drop in bay leaves and season with salt and pepper. Reduce heat, cover and simmer until lentils and plantains are tender, 45 to 60 minutes.\n",
        "picture_link": "V5nC/.AhnCIS2mFVq/FohLN2nybzHPa"
    }
]