[
    {
        "title": "Nasu Dengaku",
        "ingredients": [
            "4 Japanese eggplants, cut in half lengthwise and stems removed ADVERTISEMENT",
            "1 tablespoon apple juice ADVERTISEMENT",
            "1 tablespoon cranberry juice ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1/4 cup white miso paste ADVERTISEMENT",
            "3 tablespoons agave nectar ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "2 teaspoons sesame seeds ADVERTISEMENT",
            "1 green onion, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nWarm the apple juice, cranberry juice, and vinegar in a small saucepan over medium heat. Stir in miso paste and agave nectar until smooth. Reduce heat to low to keep warm, stirring occasionally. Brush the cut side of the eggplants with sesame oil. Place the eggplants cut side down in a shallow baking pan.\nBroil in the preheated oven for 3 minutes, checking occasionally to ensure they do not burn. Turn eggplants over and broil until they become golden brown and tender, about 3 minutes. Spoon miso sauce onto each eggplant and continue broiling until miso becomes bubbly, about 1 minute. Garnish with sesame seeds and green onion. Serve hot.\n",
        "picture_link": "MMJanpBHGk0pl3ARHME5MtXib8HFQXe"
    },
    {
        "title": "IndoCook's Indonesian-Style Ketchup",
        "ingredients": [
            "1 1/4 cups soy sauce ADVERTISEMENT",
            "1 cup molasses (such as Grandma's®) ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 cube chicken bouillon (such as Knorr®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine soy sauce, molasses, brown sugar, and chicken bouillon in a saucepan. Slowly heat until a slow boil is reached. Remove from heat and cool completely. Store, refrigerated, in an airtight container.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lamb Chops with Preserved Lemon (Moroccan Style)",
        "ingredients": [
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup chopped Moroccan preserved lemon ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (7 bone) rack of lamb, trimmed and frenched ADVERTISEMENT",
            "1/4 cup slivered kalamata olives ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cilantro, parsley, and mint together in a small saucepan. Remove half of the herb mixture, and set aside. Stir the garlic, lemon, olives, olive oil, and black pepper into the remaining herbs. Spread 2 tablespoons of this mixture onto the lamb rack. Wrap the exposed bones with aluminum foil to keep them from burning. Stir the olives and bell pepper into the reserved mixture and keep warm over low heat.\nPreheat an outdoor grill for medium heat.\nCook the lamb rack on the preheated grill until cooked to desired degree of doneness, about 4 minutes per side for medium-rare. Baste occasionally with the warmed relish. Once cooked, remove from grill, and allow to rest for 5 minutes before slicing into individual chops.\nTo serve, arrange lamb chops on a platter, spoon some of the warmed relish over them, and sprinkle with the reserved chopped herbs.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Red Hot Sugar Cookies",
        "ingredients": [
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (2.25 ounce) package cinnamon red hot candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nWhisk together flour, baking soda, and baking powder in a small bowl. Using an electric mixer, beat butter and sugar in a large bowl until smooth. Beat in egg and vanilla. Stir in the dry ingredients.\nRoll dough out on lightly floured surface. Cut into heart shapes and place on ungreased baking sheets. Dot cookies with red hot candies.\nBake until golden, 8 to 10 minutes. Let stand on cookie sheet for 2 minutes before removing to cooling racks.\n",
        "picture_link": "jgmnJK3D8MbFyQ.i45aYop3hunXl40u"
    },
    {
        "title": "Tempura Fried Ice Cream",
        "ingredients": [
            "2 scoops vanilla ice cream ADVERTISEMENT",
            "4 slices pound cake (1/2 inch thick) ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place each scoop of ice cream between two pieces of pound cake like a sandwich. Wrap each tightly in plastic wrap, pressing on the sandwich to squeeze the corners around the ice cream. Place into the freezer, and freeze until solid, 1 to 2 hours.\nHeat oil in deep-fryer to 375 degrees F (190 degrees C).\nWhisk together the egg and water, then whisk in the flour until no lumps remain. Unwrap the frozen sandwiches, and dip into the tempura batter. Allow the excess batter to drip off, then place the sandwiches into the hot oil. Fry 20 to 30 seconds until golden brown. Drain briefly on a paper towel-lined plate before cutting in half to serve.\n",
        "picture_link": "rXRjtjXphpM/Tvx7OFs4XnNd2zL90Sq"
    },
    {
        "title": "Awadi Dahi Murg (Chicken in Yogurt Gravy)",
        "ingredients": [
            "1 (1 1/2 inch) piece fresh ginger root, chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 tablespoons ground turmeric ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "1/2 cup ground coriander ADVERTISEMENT",
            "1/2 cup corn oil ADVERTISEMENT",
            "1/2 teaspoon fenugreek seeds ADVERTISEMENT",
            "1 (32 ounce) container plain yogurt ADVERTISEMENT",
            "2 1/2 cups chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons chopped green chiles ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "3 pounds skinless, boneless chicken breast halves - cut into cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ginger, garlic, turmeric, chili powder, and coriander in a blender; blend into a smooth paste.\nHeat the oil in a large skillet over medium heat. Cook the fenugreek seeds in the oil until fragrant, 2 to 3 minutes; stir in the paste; cook until the oil separates from the mixture, about 20 minutes. Mix in the yogurt, cilantro, chilies, and salt; cook until thick, 5 to 6 minutes. Add the chicken; cook for 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mel's Blender Pie",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup sweetened flaked coconut ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon, for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch pie pan.\nPlace the eggs, flour, milk, sugar, coconut, and vanilla extract into a blender. Blend on high speed until the coconut has been finely chopped. Pour this mixture into the prepared pie pan; sprinkle with cinnamon.\nBake in the preheated oven until a knife inserted into the center comes out clean, about 45 minutes. Cool on a wire rack to room temperature; refrigerate until cold before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Special Italian Meat",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon paprika, or to taste ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1/4 cup sherry, or to taste (optional) ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "3/4 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "3/4 teaspoon dried oregano ADVERTISEMENT",
            "3/4 teaspoon dried thyme ADVERTISEMENT",
            "3/4 teaspoon ground dried rosemary ADVERTISEMENT",
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 300 degrees F (150 degrees C). Whisk together the flour, salt, pepper, and paprika in a large bowl; set aside.\nDissolve the bouillon cube in the water in a 2 quart casserole dish, then whisk in the sherry, tomato soup, garlic powder, sugar, oregano, thyme, rosemary until blended; set aside. Heat the vegetable oil in a large skillet over medium-high heat. Toss the beef in the flour mixture to coat, and shake off excess. Cook the beef in the hot oil, turning occasionally, until browned on all sides. Remove the beef to the casserole dish, and reduce heat to medium. Stir in the onion, and cook until the onion has softened and turned translucent, about 5 minutes. Stir the onion into the beef mixture.\nCover, and bake in the preheated oven until the meat is very tender, 2 to 2 1/2 hours.\n",
        "picture_link": "SuT27xMUs5CCvT84ow1587yErDLGmom"
    },
    {
        "title": "Blueberry Chill",
        "ingredients": [
            "24 vanilla wafers, crushed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 (21 ounce) can blueberry pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread the crushed vanilla wafers evenly into the bottom of a square baking dish. Beat the cream cheese, heavy cream, and confectioners' sugar in a bowl until smooth; spread in a layer over the vanilla wafers. Spread the blueberry pie filling over the cream cheese layer. Freeze at least 2 hours before serving.\n",
        "picture_link": "1kX8IKv3oQQVY/DPx5N7gwG1vCc7D7."
    },
    {
        "title": "Minh-ai's Bitter Melon Soup",
        "ingredients": [
            "1/2 pound ground pork ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 bitter melon ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 teaspoon soy sauce, or to taste ADVERTISEMENT",
            "1 teaspoon fish sauce, or to taste ADVERTISEMENT",
            "1 green onions, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pork, 2 tablespoons of soy sauce, garlic powder, and pepper in a bowl. Cover the bowl with plastic wrap and refrigerate for 30 minutes to 1 hour. Slice the bitter melon into 1 to 1 1/2 inch thick rounds. Using the tip of a small knife, remove the spongy, seeded interior. Fill each bitter melon ring with the pork mixture, making sure to that each ring is fully stuffed. Form similar sized meatballs with any remaining pork.\nBring the water to a boil in a saucepan. Drop in the stuffed bitter melon rings and any meatballs. Simmer over medium heat until the bitter melon is tender and easily cut with a spoon, 30 to 45 minutes. Remove from heat. Season with 1 teaspoon of soy sauce and fish sauce. Stir in green onions.\n",
        "picture_link": "UeK1Uv55xsP12H94g77yLNpC/QapZ46"
    },
    {
        "title": "Melody's Famous Beer Cheese",
        "ingredients": [
            "1 (1 pound) loaf rye bread ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 pounds processed cheese food, cubed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 tablespoons prepared horseradish ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon garlic salt, or to taste ADVERTISEMENT",
            "1/2 (12 ounce) can beer, room temperature ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut a thin slice off the top of bread loaf; hollow out a bowl in the loaf. Slice the removed bread into small pieces and assemble around the bread bowl on a platter.\nMelt the butter in a saucepan over medium-low heat. Add the cheese food, cream cheese, horseradish, mustard, and garlic salt to the melted butter and stir to combine. Slowly add the beer while stirring until you reach your desired consistency. Continue heating and stirring until all the cheese has melted, 10 to 15 minutes. Pour the mixture into the bread bowl while hot to serve.\n",
        "picture_link": "qsbb/WN6Q37NrVRz4rlXo6IxONhUD52"
    },
    {
        "title": "Hunan Chicken",
        "ingredients": [
            "1 teaspoon chili bean sauce ADVERTISEMENT",
            "2 teaspoons rice wine ADVERTISEMENT",
            "1 teaspoon light soy sauce ADVERTISEMENT",
            "1 teaspoon dark soy sauce ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1 tablespoon chopped green onion ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "3/4 pound skinless, boneless chicken breast halves, cut into 2-by-1/2-inch strips ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the chile bean sauce, rice wine, light soy sauce, dark soy sauce, ginger root, green onion, and sugar. Place chicken strips in a large bowl and pour sauce over; refrigerate and allow to marinate for 30 to 40 minutes.\nHeat oil in a deep-fryer or large wok to 375 degrees F (190 degrees C).\nRemove the chicken strips from the marinade and sprinkle with the flour. Deep fry chicken strips until crispy and no longer pink in the center, about 8 minutes. Drain cooked chicken on paper towels; serve hot.\n",
        "picture_link": "JizYQS8AZTLfHNQDKylO.69PSRC3/kC"
    },
    {
        "title": "Hazelnut Irish Cream",
        "ingredients": [
            "2 (14 ounce) cans can sweetened condensed milk (save the can) ADVERTISEMENT",
            "1 (13 ounce) jar chocolate hazelnut spread ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "2 cups half-and-half cream ADVERTISEMENT",
            "1 (750 milliliter) bottle Irish whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk together the sweetened condensed milk and hazelnut spread until well blended. Gradually whisk in the vanilla, evaporated milk, cream, half-and-half and Irish whiskey. Pour into containers and store in the refrigerator for at least 1 day before serving. Shake or stir before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Luscious Lucy",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger strawberry liqueur ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger Blue Curacao ADVERTISEMENT",
            "4 fluid ounces prepared lemonade ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour strawberry liqueur and Blue Curacao into a glass with ice. Fill with lemonade. Stir.\n",
        "picture_link": "vO/9LoYrYlr3o4lqGSsnGUCej6dewtK"
    },
    {
        "title": "Heloise's Toffee Cookies",
        "ingredients": [
            "2 cups sifted cake flour ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the flour, cream of tartar, baking soda and salt; set aside.\nIn a large bowl, cream together the sugar and oil. stir in the egg, vanilla and water; blend well. Gradually blend in the sifted ingredients. Stir in the chopped nuts last. Roll dough into 2 logs, wrap in waxed paper and chill for several hours or overnight.\nPreheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Cut the dough into thin slices and place 1 to 2 inches apart onto the prepared cookie sheet.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sunday Lunch Soup",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 green chile pepper, seeded and diced ADVERTISEMENT",
            "4 potatoes, chopped ADVERTISEMENT",
            "1 zucchini, chopped ADVERTISEMENT",
            "8 mushrooms, sliced ADVERTISEMENT",
            "1 (10.75 ounce) can tomato puree ADVERTISEMENT",
            "1 (11 ounce) can sweet corn, drained ADVERTISEMENT",
            "1/4 medium head cabbage, finely chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "2 tablespoons mixed spice ADVERTISEMENT",
            "1 1/4 cups heavy cream ADVERTISEMENT",
            "paprika, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, boil the chicken in 5 cups water for approximately 30 minutes. Drain, retaining liquid, and chop the chicken.\nIn the saucepan over medium heat, place approximately 2 tablespoons reserved liquid, onions, garlic and green chile pepper. Slowly cook and stir 5 minutes, or until tender. One at a time, while gradually adding the remaining liquid, mix in the chopped chicken, potatoes, zucchini, mushrooms, tomato puree, sweet corn, cabbage, carrots and celery. Pour in any remaining liquid, and stir in the chicken bouillon and mixed spice. Bring to a boil. Reduce heat and simmer 1 to 2 hours, stirring occasionally.\nBefore serving, stir in the heavy cream, mixing thoroughly. Serve with a sprinkling of paprika.\n",
        "picture_link": "ooSZqPzVKz8dJ.ZRoJTc.6FxH2k1s1."
    },
    {
        "title": "Lime Daiquiri",
        "ingredients": [
            "1 cup ice ADVERTISEMENT",
            "1 cup light rum ADVERTISEMENT",
            "1/2 (6 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "1 cup carbonated water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine ice, rum, limeade concentrate and carbonated water. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "kz87kfaeHLFsZ56sH4cVYEjwNIItKUG"
    },
    {
        "title": "Orange Johnny Cake",
        "ingredients": [
            "1 (8.5 ounce) package dry corn muffin mix ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "3 tablespoons grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 8x8 inch baking pan.\nIn a large bowl, stir together muffin mix, egg, milk and orange zest. Pour batter into prepared pan.\nBake in preheated oven for 20 to 25 minutes, until golden brown.\n",
        "picture_link": "8BSUAAqrwEh4Yav01kK772jxN0klqx."
    },
    {
        "title": "Smoked Bluefish Pate I",
        "ingredients": [
            "1/2 pound smoked bluefish ADVERTISEMENT",
            "4 ounces mascarpone cheese ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "1 teaspoon prepared Dijon-style mustard ADVERTISEMENT",
            "1 pinch ground cayenne pepper ADVERTISEMENT",
            "2 tablespoons finely chopped red onion ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble the smoked bluefish. Place bluefish and mascarpone cheese into a food processor. Blend well using the pulse setting.\nTransfer bluefish mixture to a medium bowl. Mix in the lemon juice, horseradish, Dijon-style mustard, cayenne pepper, red onion and salt.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Fruit Vinaigrette",
        "ingredients": [
            "1 small banana, thinly sliced ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1/2 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/4 teaspoon sesame oil ADVERTISEMENT",
            "1 teaspoon rice wine vinegar ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 pinch salt and pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine banana, orange juice, lime juice, jalapeno, oil, vinegar, ginger and salt and pepper in a blender or food processor and puree until smooth. Transfer to a container with a tight lid, cover, and refrigerate until ready to serve. Shake before serving.\n",
        "picture_link": "Q9H71cdUgfawaA02WSKl0SY0nCLGFoO"
    },
    {
        "title": "Marsala Marinade",
        "ingredients": [
            "1/2 cup Marsala wine ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish combine Marsala wine, honey and garlic.\nMarinate chicken for at least 3 hours, or overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick Vegan Spaghetti Sauce",
        "ingredients": [
            "1 (29 ounce) can tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1 tomato, quartered ADVERTISEMENT",
            "1 large orange, quartered ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, heavy saucepan combine tomato sauce, mushrooms, celery, red onion, raisins, walnuts, tomato, orange and garlic. Cook on medium-high until vegetables are tender, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sam's Original Sauce",
        "ingredients": [
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 pound cubed beef stew meat ADVERTISEMENT",
            "4 tablespoons tomato paste ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 pinch dried parsley ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1 pinch fennel seed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more. Add the garlic during the last 3 minutes of cooking.\nTransfer the onions and garlic to a bowl and set aside. Turn the heat up to medium high and add the beef cubes. Cook, stirring occasionally, until browned on all sides, about 5 minutes. Drop in the tomato paste and reduce the heat to medium; allow the tomato paste to cook about 2 minutes, or until it begins to brown, before stirring.\nPour in the crushed tomatoes and return the onions and garlic to the pan. Mix in the parsley, basil, fennel, and salt and pepper. Reduce the heat to low and simmer, stirring occasionally, until the sauce is thick and the meat is tender, 6 to 7 hours.\n",
        "picture_link": "OZDV7btioLNopmdaKJrnn2cZ3rW9ITi"
    },
    {
        "title": "Maureen's Mocha Cake",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/2 cup unsweetened cocoa ADVERTISEMENT",
            "3/4 cup strong brewed coffee, cold ADVERTISEMENT",
            "3/4 cup coffee flavored liqueur ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa ADVERTISEMENT",
            "3 tablespoons coffee flavored liqueur ADVERTISEMENT",
            "2 tablespoons hot brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round cake pans. Sift together the flour, baking soda, and cocoa. Set aside.\nCombine the coffee and coffee liqueur. Set aside. In a large bowl, cream together the shortening and brown sugar until light and fluffy. Beat in the egg yolks one at a time. Beat in the flour mixture alternately with the coffee and coffee liqueur, mixing just until incorporated. In a separate bowl, beat egg whites until soft peaks form, add 1/4 cup sugar, then continue beating until whites form stiff peaks. Gently fold egg whites into the coffee mixture.\nPour batter into prepared pans. Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool 10 minutes in pans, then turn out on wire racks to cool completely before frosting.\nFor the coffee frosting: In a medium bowl, cream butter until fluffy. Beat in confectioners' sugar and cocoa. Mix in coffee liqueur and hot coffee. Beat frosting until it thickens to spreading consistency.\n",
        "picture_link": "tnqyqE4IF9ZDksR9QAiSZ0asWw3ErBO"
    },
    {
        "title": "Graham Cracker Pudding",
        "ingredients": [
            "1/4 cup shortening ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease six, 6 ounce, ovenproof custard cups.\nCream together shortening, sugar and vanilla. Beat in egg yolk. Stir in raisins and nuts. In a separate bowl, combine graham cracker crumbs, baking powder and salt. Add to batter alternately with milk, stirring until smooth. Whip egg white until stiff. Fold into batter. Pour into prepared custard cups.\nBake in preheated oven 25 to 30 minutes, until set.\n",
        "picture_link": "2PpwCSdQacdJjzXVLcuLkFyzucAZw9a"
    },
    {
        "title": "Wild Rice Soup V",
        "ingredients": [
            "1 cup uncooked wild rice ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "2 large carrots, shredded ADVERTISEMENT",
            "3 cups cubed cooked ham ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/4 cup sweet vermouth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, boil rice in water 30 minutes. Drain, rinse, and set aside.\nMeanwhile, in a large soup pot, melt butter over medium heat. Cook onion in butter until translucent. Stir in flour all at once to form a roux. Stir in broth, a little at a time, and cook until slightly thickened. Stir in carrots, ham, milk, parsley and reserved rice. Reduce heat and simmer 15 minutes.\nStir in vermouth and simmer 30 minutes more. Serve.\n",
        "picture_link": "V19EA1MLHDDbMo3yWnBm6YmfwIgI/ge"
    },
    {
        "title": "Chicken Brunswick Stew",
        "ingredients": [
            "2 1/2 pounds chopped, cooked chicken ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 tomatoes, sliced ADVERTISEMENT",
            "1 1/2 onions, chopped ADVERTISEMENT",
            "1 (16 ounce) package frozen lima beans, thawed ADVERTISEMENT",
            "1 (16 ounce) package frozen corn kernels, thawed ADVERTISEMENT",
            "1 (16 ounce) package frozen okra, thawed ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, microwave safe bowl, combine chicken, water, pepper and salt. Microwave on high 15 minutes. Stir in tomatoes, onions, limas, corn, okra and bay leaf. Microwave 7 minutes. Remove bay leaf and microwave 15 minutes more, stirring occasionally, until tender.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Macaroni and White Clam Sauce",
        "ingredients": [
            "1 (10 ounce) can whole baby clams ADVERTISEMENT",
            "1 (6.5 ounce) can minced clams ADVERTISEMENT",
            "1 1/4 cups White clam sauce ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 (16 ounce) package macaroni ADVERTISEMENT",
            "4 cups hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine in a large saucepan: whole baby clams, minced clams, clam sauce, butter and garlic. Bring to boil. Add macaroni and hot water and return to boil. Cook until macaroni is al dente.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Butterscotch Breakfast Ring",
        "ingredients": [
            "1 (6 ounce) package butterscotch chips, divided ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 (10 ounce) can refrigerated crescent roll dough ADVERTISEMENT",
            "7 teaspoons corn syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMelt butterscotch chips and butter in the top of a double boiler or in a bowl in the microwave. Stir until smooth. Remove from heat and whisk in flour, salt and pecans. Set aside.\nSeparate crescent roll triangles. On greased cookie sheet, arrange crescent rolls overlapping edges to form a circle. Long pointed ends of each roll should point outwards. Spread 2 rounded teaspoons of butterscotch mixture on each triangle. Roll up triangles, beginning with pointed end of roll. Slash inside half of each roll.\nBake in preheated oven for 15 minutes, until golden. Remove from oven and let cool.\nWhile rolls bake, melt remaining butterscotch morsels and corn syrup; mix well. Drizzle over cooled rolls.\n",
        "picture_link": "AbnJHRSwBiCU6gPo18LnoevdbXZdfO."
    },
    {
        "title": "Run For The Roses Pie I",
        "ingredients": [
            "1 cup chopped walnuts ADVERTISEMENT",
            "3 tablespoons bourbon ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a small bowl, pour bourbon over walnuts; set aside.\nIn a large bowl, beat sugar, corn syrup and eggs. Stir in butter, chocolate chips and vanilla. Add bourbon and nuts. Pour filling into pie shell.\nBake in the preheated oven for 45 minutes, or until golden brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "French Market Soup in a Jar",
        "ingredients": [
            "1 pound dried navy beans ADVERTISEMENT",
            "1 pound dried pinto beans ADVERTISEMENT",
            "1 pound dried great Northern beans ADVERTISEMENT",
            "1 pound split peas ADVERTISEMENT",
            "1 pound yellow split peas ADVERTISEMENT",
            "1 pound dried black-eyed peas ADVERTISEMENT",
            "1 pound lentils ADVERTISEMENT",
            "1 pound dried baby lima beans ADVERTISEMENT",
            "1 pound dried lima beans ADVERTISEMENT",
            "1 pound dried soybeans ADVERTISEMENT",
            "1 pound pearl barley ADVERTISEMENT",
            "1 pound dried red beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a very large container, combine navy beans, pinto beans, great Northern beans, split peas, yellow split peas, black-eyed peas, lentils, baby limas, limas, soybeans, barley and red beans; mix well. Divide evenly into 14 (1 pint) lidded jars.\nAttach a card to each jar with the following recipe: ADDITIONAL INGREDIENTS: 2 quarts water; 1 ham hock; 1 1/4 teaspoon salt; 1/4 teaspoon pepper; 1 (10 ounce) can diced tomatoes with green chiles; 1 large onion, chopped; 1 clove garlic, minced. TO PREPARE: Soak 2 cups French Market Bean Mix in water to cover, 8 hours or overnight. In a large soup pot, bring 2 quarts water and ham hock to a boil. Reduce heat and simmer 20 minutes. Remove ham hock. Stir in soaked beans, salt, pepper, diced tomatoes and green chiles, onion and garlic. Bring to a boil again, skimming foam off the top. Reduce heat, cover and simmer about 1 hour, until beans are tender.\n",
        "picture_link": "Esf9As0hdDngwF8OyRWwX4UCqJY7fqy"
    },
    {
        "title": "Homemade Candy Bars",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2/3 cup chopped almonds ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (16 ounce) container prepared chocolate frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a medium bowl, cream together the butter and white sugar. Beat in the eggs one at a time, then stir in the flour and cocoa powder. Press the dough evenly into the bottom of the prepared pan.\nBake for 15 to 20 minutes in the preheated oven, then remove from the oven and sprinkle the almonds and coconut over the crust. Drizzle the sweetened condensed milk over the whole pan. Return to the oven.\nBake for 15 additional minutes in the preheated oven, or until golden. Allow to cool completely before frosting with the prepared frosting and cutting into squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shrimp de Jonghe II",
        "ingredients": [
            "1/2 gallon water ADVERTISEMENT",
            "1 small onion, quartered ADVERTISEMENT",
            "1 strip celery, roughly chopped ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "3 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 pounds unshelled raw shrimp ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon steak sauce ADVERTISEMENT",
            "1 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "1 1/2 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a large pot, combine water, onion, celery, bay leaves, and 3 tablespoons of fresh lemon juice. Bring the liquid to a boil and add the unshelled shrimp. Simmer for 5 minutes, then remove the pot from the heat. Let shrimp cool in the liquid. Drain the shrimp and shell and devein them.\nIn a mixing bowl, cream the butter with an electric hand mixer or whisk, and thoroughly blend in the bread crumbs and sour cream. Slowly beat in the parsley, crushed garlic, salt, Worcestershire sauce, steak sauce, black pepper and juice of 1/2 lemon.\nArrange the shrimp in the bottom of 6 (5 ounce) ramekins and cover them with the butter mixture.\nBake in preheated oven until tops are lightly browned, about 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Oatmeal Raisin Cookies X",
        "ingredients": [
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup egg substitute ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2 1/2 cups rolled oats ADVERTISEMENT",
            "1/4 cup oat bran ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease cookie sheets.\nIn a large bowl, cream together the margarine, oil, brown sugar and white sugar until smooth. Beat in the egg substitute, vanilla and water. Combine the flour, baking soda, cinnamon and nutmeg; stir into the sugar mixture. Stir in the oats, oat bran, wheat germ, raisins and walnuts. Drop by teaspoonfuls onto the prepared cookie sheets.\nBake for 18 to 20 minutes in the preheated oven, or until the edges are lightly browned. Remove from cookie sheets to cool on wire racks.\n",
        "picture_link": "n5Eoeyes3Irqrx4p4qJ5IsVYkxKICyy"
    },
    {
        "title": "Naughty Chocolate and Peanut Butter Chip Cookies",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/4 cup port wine ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup peanut butter chips ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a medium bowl, cream together the margarine and white sugar until smooth. Beat in the egg yolks, vanilla and port wine. Combine the flour and salt; stir into the creamed mixture. Roll the dough into walnut sized balls. Dip each ball in the remaining egg whites. Place cookies 2 inches apart onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven. Remove from the oven and immediately place 4 or 5 of the chocolate and/or peanut butter chips into the center of each cookie. Return to the oven for 2 more minutes to melt the chips. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "vsF3Wh2UVU4BxwhRlbg4sVL4RcmD05G"
    },
    {
        "title": "Chewy Cereal Cookies",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups high protein crisp rice and wheat cereal ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets or line with parchment paper.\nIn a clean and dry glass or metal bowl, beat egg whites until soft peaks form. Gradually add sugar while continuing to whip until stiff peaks form. Fold in cereal, coconut and vanilla. Drop by heaping spoonfuls onto the prepared cookie sheets.\nBake for 15 to 20 minutes in the preheated oven, until firm. Allow to cool completely before removing from cookie sheets.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Flying Saucers",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "2 cups whole wheat flake cereal ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the shortening, white sugar and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the baking powder, baking soda and oats; stir into the sugar mixture. Fold in the wheat cereal, and coconut. Drop dough by teaspoonfuls onto the prepared cookie sheets. Flatten slightly with a fork.\nBake for 10 to 12 minutes in the preheated oven, or until light brown.\n",
        "picture_link": "Hm5bLri6NMTTMlVfgZqjxNWOWLy4bIe"
    },
    {
        "title": "Cough Syrup",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger creme de menthe liqueur ADVERTISEMENT",
            "1 teaspoon maraschino cherry juice ADVERTISEMENT",
            "1 maraschino cherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill an 8 fl. ounce rocks glass with crushed ice. Pour in the shot of creme de menthe and cherry juice, and stir. Toss in the cherry.\n",
        "picture_link": ".MIeuJIljRjTBh5w.2Xozf/RTQKUaeG"
    },
    {
        "title": "Chocolate Pineapple Squares",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9 inch square pan. In the microwave or in a metal bowl over a pan of simmering water, melt chocolate chips, stirring frequently until smooth. Set aside.\nCream together the shortening and sugar until smooth. Beat in the eggs one at a time then stir in the vanilla. Combine the flour, baking powder, salt and cinnamon; blend into the creamed mixture. Divide batter into separate bowls. Mix the melted chocolate into one half and the drained crushed pineapple to the other. Spread the chocolate batter evenly into the prepared pan, then spread the pineapple batter over the top of that.\nBake for 30 to 35 minutes in the preheated oven. Cool in the pan on a wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Linzer Cookies",
        "ingredients": [
            "DOUGH: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "5/8 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup finely chopped almonds ADVERTISEMENT",
            "FILLING: ADVERTISEMENT",
            "1/4 cup chopped dried apricots ADVERTISEMENT",
            "1/2 cup apricot preserves ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "GLAZE: ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "2 tablespoons finely chopped almonds ADVERTISEMENT",
            "1 tablespoon coarse granulated sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the flour, baking powder and salt; set aside. In a medium bowl, cream together the butter, brown sugar and cinnamon until light and fluffy. Beat in the lemon zest, egg and vanilla. Mix in 1 cup of chopped almonds, then stir in the sifted ingredients. Press 2/3 of the dough into the bottom of a greased or parchment lined 8x8 inch baking pan. Roll the remaining portion between two pieces of waxed paper, out to an 8 inch square. Refrigerate all of the dough for at least 2 hours.\nWhile the dough is chilling, place the apricots into a small saucepan with water to cover. Bring to a boil and cook for three minutes. Remove from heat and set aside to cool. Drain the excess liquid from the apricots and mix in the preserves and lemon juice.\nPreheat oven to 350 degrees F (175 degrees C). Spread the apricot filling evenly over the chilled crust, leaving a 1/4 inch border on edges. Cut the chilled square of dough into 1/2 inch strips. Place the strips over the filling in a lattice design. Trim edges to fit and press the edges into the border. Brush the top with egg white then sprinkle with remaining chopped almonds and coarse sugar.\nBake for 15 to 20 minutes in the preheated oven, until filling is bubbly and the crust is golden brown. Allow to cool completely before cutting into squares.\n",
        "picture_link": "jHi016K4r5./EOTYT344hLsICL1wa1W"
    },
    {
        "title": "Thin Wandies",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "4 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/4 cup baking powder ADVERTISEMENT",
            "12 cups all-purpose flour ADVERTISEMENT",
            "1 quart oil for frying ADVERTISEMENT",
            "2 cups confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in deep-fryer or large heavy skillet to 375 degrees F (190 degrees C).\nIn a large bowl, whisk together eggs, vanilla and melted butter until well blended. Mix in the salt and baking powder. Gradually stir in flour with a wooden spoon until dough is stiff. Turn out onto a floured surface and knead in as much flour as necessary to make a smooth stiff dough. Dough should not be sticky. Roll the dough out paper thin and cut into 3 inch squares.\nFry in the hot oil, turning once until golden. Drain in colander and place them into a waxed paper lined bushel basket. Dust with confectioners' sugar when cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grecian Lamb Caesar Salad",
        "ingredients": [
            "1 pound boneless lamb meat, cut into bite-sized pieces ADVERTISEMENT",
            "5 cups romaine lettuce - washed, dried and torn into bite-sized pieces ADVERTISEMENT",
            "1 cup canned garbanzo beans, drained ADVERTISEMENT",
            "1/2 cup sliced red onion ADVERTISEMENT",
            "1/2 cup bottled Caesar salad dressing ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler.\nArrange lamb meat on a medium baking sheet, and broil 8 to 12 minutes, turning once, to an internal temperature of 160 degrees F (63 degrees C). Remove from heat, and cool.\nIn a large bowl, toss cooked lamb with romaine lettuce, garbanzo beans, red onion, and Caesar salad dressing. Top with feta cheese.\n",
        "picture_link": "Eu3jfdroLNWjqPdxQrSffZWTlD.mose"
    },
    {
        "title": "Diane's Almond Tarts",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/2 cup raspberry jam ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup rice flour ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "24 maraschino cherries with stems ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream 1 cup butter and 1/2 cup confectioners' sugar until light and fluffy. Beat in 2 cups all-purpose flour and 1/4 cup cornstarch. Shape into a ball and refrigerate for 1 hour. Roll out to 1/4 inch thickness, cut into appropriate size circles with a glass or cookie cutter and press into tart shells. Spoon 1 teaspoon jam into bottom of each shell.\nIn a large bowl, cream 1/2 cup butter and 1/2 cup white sugar until light and fluffy. Beat in rice flour and cocoa powder. Beat in eggs and 2 teaspoons almond extract. Fill tarts 2/3 full.\nBake in the preheated oven for 10 to 15 minutes, or until golden brown and filling is set. Allow to cool.\nIn a small bowl, Stir together 1 cup confectioners' sugar, 2 tablespoons butter and 1/2 teaspoon almond extract. Spread on tarts. Garnish each tart with a maraschino cherry.\n",
        "picture_link": "/GtKTeYIXQSI2AqCsD2QWSSY1KvqSJy"
    },
    {
        "title": "Springerle VI",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon anise extract ADVERTISEMENT",
            "4 cups cake flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat eggs with sugar until thick and pale, about 10 minutes. Stir in the anise extract. Sift together the flour and baking powder; fold into the egg mixture. Cover and let rest for 15 minutes.\nDivide dough into 3 parts. On a lightly floured surface, roll the dough out to 1/4 inch thickness. Flour a springerle mold or rolling pin, and press the design into the dough. Cut apart the cookies and place them 1 inch apart onto a greased cookie sheet. Cover with a towel and let stand overnight.\nPreheat the oven to 300 degrees F (150 degrees C). Dust excess flour from cookies.\nBake for 15 to 18 minutes in the preheated oven, until bottoms are lightly browned. Cool and store in an airtight container for up to 2 months.\n",
        "picture_link": "VHhnoqLDN3pHvOHPKVvF/xrxAjYhjRC"
    },
    {
        "title": "Australian Federation Biscuits",
        "ingredients": [
            "2/3 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup hot water ADVERTISEMENT",
            "1 1/2 cups chopped pitted dates ADVERTISEMENT",
            "1 1/2 cups golden raisins ADVERTISEMENT",
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). In a small bowl, dissolve baking soda in hot water. Stir in the dates and raisins; set aside.\nIn a medium bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the date and raisin mixture. Combine the flour and cinnamon; mix into the batter until just blended. Finally stir in the walnuts. Drop dough by tablespoonfuls onto the prepared cookie sheet. Cookies should be at least 1 inch apart.\nBake for 8 to 10 minutes in the preheated oven, or until lightly browned. Allow cookies to cool on baking sheet for 2 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "XmqJn9DYiOLRGcMprbEJXtMYuIoTEtq"
    },
    {
        "title": "Choconut Macaroons",
        "ingredients": [
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons almond paste ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1/2 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line cookie sheets with parchment paper or grease lightly.\nIn a medium bowl, blend together the sugar and almond paste using your fingers until the paste is completely worked into the sugar. Stir in the coconut and chocolate chips. In a clean dry glass or metal bowl, Whip egg whites and cream of tartar to stiff peaks. Fold half of the egg whites into the coconut mixture to lighten the batter. Gently fold in the remaining whites, being careful not to deflate. Drop by rounded teaspoonfuls onto the prepared cookie sheets.\nBake for 20 minutes in the preheated oven, or until tops are lightly browned. Allow cookies to cool on baking sheet for a few minutes before removing to a wire rack to cool completely.\n",
        "picture_link": ".Cc7IOq9JIV79EfGo0RX3.2NhzG/ciO"
    },
    {
        "title": "Chocolate Squares II",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "15 arrowroot biscuits, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter an 8x8 inch baking dish.\nIn a saucepan over medium heat, melt together the butter, brown sugar and cocoa, stirring frequently until smooth. Remove from heat and stir in the egg and vanilla. Mix in the crushed cookies and walnuts. Press the mixture into the prepared pan and refrigerate until firm.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ajo Blanco con Uvas",
        "ingredients": [
            "1/8 cup ground almonds ADVERTISEMENT",
            "1/2 cup toasted bread crumbs ADVERTISEMENT",
            "5 cloves garlic ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "6 cubes ice ADVERTISEMENT",
            "1 pound seedless green grapes, skinned ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound almonds, bread crumbs, garlic and salt together in a mortar to form a paste. Gradually mix in oil. Stir in vinegar. Place mixture in a soup tureen. Stir in water, ice and grapes. Let rest in a cool place 30 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick Turkey Taco Salad",
        "ingredients": [
            "1/2 pound ground turkey ADVERTISEMENT",
            "1 (1 ounce) packet taco seasoning mix ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "4 cups mixed salad greens and fresh herbs ADVERTISEMENT",
            "2 cups tortilla chips ADVERTISEMENT",
            "1/2 cup shredded Mexican cheese blend ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1/2 cup fresh salsa ADVERTISEMENT",
            "1 tablespoon sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook turkey in a skillet over medium heat until completely browned, 5 to 7 minutes; season with taco seasoning mix. Add green bell pepper; cook and stir until pepper is tender, about 5 minutes.\nArrange salad greens onto 2 plates. Top greens with tortilla chips, cheese, and onion. Spoon turkey over the each salad. Top with salsa and sour cream.\n",
        "picture_link": "A/30k8gl45xvNpjr1W5yxPqvCjZsxn2"
    },
    {
        "title": "Lemon-Dill Tuna Melt Sandwiches",
        "ingredients": [
            "6 slices white bread ADVERTISEMENT",
            "2 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "1/4 cup mayonnaise, or to taste ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon finely chopped lemon zest ADVERTISEMENT",
            "1 tablespoon finely chopped fresh dill ADVERTISEMENT",
            "1 large tomato, thinly sliced ADVERTISEMENT",
            "6 slices Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Arrange bread in a single layer on a baking sheet.\nToast bread lightly on both sides in preheated oven, about 1 minute per side.\nMix tuna, mayonnaise, lemon juice, lemon zest, and dill in a bowl. Spread tuna mixture evenly over each slice of bread. Arrange tomato slices over tuna mixture and top with Swiss cheese.\nReturn baking sheet to oven and broil until cheese is melted, 3 to 5 minutes more.\n",
        "picture_link": "/HK6F7fYkgvVI4Xhg8fpAbGaS0I8b9W"
    },
    {
        "title": "Crunchy Chicken Salad",
        "ingredients": [
            "1 1/2 cups cubed cooked chicken ADVERTISEMENT",
            "3 tablespoons chopped onion ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons chopped water chestnuts ADVERTISEMENT",
            "4 teaspoons sweet pickle relish ADVERTISEMENT",
            "1 tablespoon chopped pecans ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "4 lettuce leaves ADVERTISEMENT",
            "1 hard-boiled egg, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chicken, onion, mayonnaise, water chestnuts, sweet pickle relish, pecans, salt, and black pepper together in a bowl. Serve on lettuce leaves and garnish each serving with a slice or 2 of hard-boiled egg.\n",
        "picture_link": "0PeQRYKi62GU3vnEzeygZ.6QvxRkx4S"
    },
    {
        "title": "Family Favorite Raisin-Filled Cookies",
        "ingredients": [
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons cream of tartar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk 3 1/2 cups flour, 1 cup sugar, cream of tartar, and baking soda together in a bowl. Mix vegetable shortening, milk, egg, and vanilla extract into dry ingredients to make a dough. Roll the dough out 1/4-inch thick on a floured work surface. Cut dough into 2 1/2-inch rounds using a biscuit cutter or glass.\nCombine raisins, 1/2 cup sugar, and 1 tablespoon flour in a bowl; stir to coat raisins. Spoon 1 rounded teaspoon of raisin mixture into center of a cookie round and top with another round. Use a fork to crimp the edges together to make little pies. Place cookies onto a baking sheet.\nBake in the preheated oven until cookies are lightly golden brown, about 11 minutes. Watch carefully to prevent burning.\nGather cut scraps of dough, gently form into a ball, and roll out again. Repeat steps as before until all dough and filling are used up.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Little Gasparilla Jalapeno Cheddar Potatoes",
        "ingredients": [
            "1 pound red potatoes, cut into large chunks ADVERTISEMENT",
            "2 tablespoons peanut oil ADVERTISEMENT",
            "1/4 cup chopped green onion (optional) ADVERTISEMENT",
            "1 jalapeno pepper, chopped ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 cup shredded white Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot of salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 10 minutes; drain.\nHeat peanut oil in a large skillet over medium-high heat. Cook and stir potatoes in hot oil until lightly golden, about 5 minutes. Add green onion and jalapeno pepper to the potatoes; cook and stir together until the pepper is tender, 1 to 2 minutes. Season potato mixture with kosher salt and black pepper. Remove skillet from heat and sprinkle cheese over potatoes.\n",
        "picture_link": "l0n3xbKvsmEQzVhjEW7.2QPYNuRulWG"
    },
    {
        "title": "Whole Wheat Peanut Butter Banana Bread",
        "ingredients": [
            "2 cups mashed bananas ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons reduced-fat peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup whole wheat pastry flour ADVERTISEMENT",
            "1 cup whole wheat bread flour ADVERTISEMENT",
            "3/4 cup wheat germ ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\nBeat bananas, honey, oil, eggs, peanut butter, and vanilla extract in a bowl until smooth.\nCombine pastry flour, bread flour, wheat germ, salt, and baking soda in a large bowl; make a well in the flour mixture. Pour banana mixture into well and stir wet ingredients into dry ingredients until batter is just moistened. Pour batter into prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "3Ov73HeNHUNztRtNMMRj9KD.7hD1YtC"
    },
    {
        "title": "Ali's Potato Casserole",
        "ingredients": [
            "1 (2 pound) package frozen Southern-style hash brown potatoes ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (1 pound) loaf processed cheese food (such as Velveeta®), cubed ADVERTISEMENT",
            "1 (10.5 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "2 cups corn flakes cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 13x9-inch baking dish.\nMix potatoes, sour cream, cheese cubes, and cream of mushroom soup in a bowl; spread into prepared baking dish.\nMix corn flakes cereal and butter in a bowl spread over the potato mixture.\nBake in preheated oven until hot and bubbling, about 1 hour.\n",
        "picture_link": "qhWLGopzGMAeCjXxC2eoQ7Gkcg9c1Pa"
    },
    {
        "title": "Grilled Tuna Patties",
        "ingredients": [
            "2 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 (6 ounce) package dry stuffing mix (such as Stove Top®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tuna, mushroom soup, milk, eggs, salt, and black pepper in a large mixing bowl. Stir stuffing mix into tuna mixture until thoroughly combined. Form mixture into patties. Refrigerate patties for 10 minutes to firm up.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nGrill patties until heated through and the outsides show grill marks, about 7 minutes per side.\n",
        "picture_link": "i/OHF4kZCRgtY4p7YmH.e8tGuQVMb6y"
    },
    {
        "title": "Healthy Egg Salad",
        "ingredients": [
            "6 hard-boiled eggs ADVERTISEMENT",
            "1/4 cup fat-free mayonnaise ADVERTISEMENT",
            "1 celery stalk, chopped ADVERTISEMENT",
            "1 carrot, shredded ADVERTISEMENT",
            "2 tablespoons minced red onion ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash hard-boiled eggs using a fork in a large bowl; add mayonnaise, celery, carrot, red onion, Dijon mustard, vinegar, salt, and hot pepper sauce. Mix well. Refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "FaFhrCGc9O7niXCADHtjsyrHCsJlp4m"
    },
    {
        "title": "Blue Cheese and Garlic Bread",
        "ingredients": [
            "1 (12 ounce) loaf French bread ADVERTISEMENT",
            "1/2 cup butter at room temperature (divided) ADVERTISEMENT",
            "4 teaspoons garlic powder, divided ADVERTISEMENT",
            "1 (8 ounce) bottle blue cheese salad dressing ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 (3 ounce) package grated Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nCut French bread loaf in half lengthwise and spread butter on both cut sides. Sprinkle each side with 2 teaspoons garlic powder. Place halves on prepared baking sheet.\nBake in the preheated oven until butter has melted and bread is hot but not toasted, about 5 minutes. Remove bread from oven.\nTurn on oven's broiler.\nSpread half the bottle of blue cheese salad dressing over each half; sprinkle each piece of bread with mozzarella cheese and Parmesan cheese.\nBroil until mozzarella cheese has melted and is slightly browned, 1 to 4 minutes. Watch carefully to prevent burning. Let bread cool 2 to 3 minutes before cutting into serving pieces.\n",
        "picture_link": "bHDPVhYRBtgpjIN68xlzrc4CY80oF0a"
    },
    {
        "title": "Cinnamon Hot Chocolate Mix",
        "ingredients": [
            "1 3/4 cups non-fat dry milk powder ADVERTISEMENT",
            "1 cup granular no-calorie sucralose sweetener (such as Splenda®) ADVERTISEMENT",
            "1/2 cup non-dairy creamer ADVERTISEMENT",
            "1/2 cup baking cocoa ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk powder, sweetener, creamer, cocoa, and cinnamon in a bowl; add marshmallows and mix. Store in an airtight container in a cool dry place for up to 3 months.\n",
        "picture_link": "u0R2yIK5AQOMacVv3GOLyDXxoSSYbCy"
    },
    {
        "title": "Irish Potato Nachos",
        "ingredients": [
            "3 russet potatoes, sliced 1/8-inch thick ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese, divided ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese, divided ADVERTISEMENT",
            "4 green onions, chopped, divided ADVERTISEMENT",
            "2 cooked chicken breasts, thinly sliced, divided ADVERTISEMENT",
            "1/2 cup jalapeno peppers cut into rings, divided ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "1/4 cup salsa, or to taste ADVERTISEMENT",
            "1/4 cup sour cream, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes and garlic in a bowl and cover with several inches of cool water; let soak for 4 hours or overnight.\nPreheat oven to 400 degrees F (200 degrees C). Drain potatoes and pat dry.\nCombine potatoes and vegetable oil in a bowl and toss to coat. Spread potatoes slightly apart in a single layer on a baking sheet.\nBake potatoes in the preheated oven until golden brown, about 25 minutes.\nSprinkle salt over potatoes. Spread 1/2 the Cheddar cheese, 1/2 the Monterey Jack cheese, and 1/2 the mozzarella cheese over the potatoes. Sprinkle 1/2 the onions, 1/2 the chicken, and 1/2 the jalapeno peppers respectively over the cheese. Repeat layering with remaining cheeses, onion, chicken, and jalapenos.\nBake nachos in the oven until cheese melts and chicken is hot, 10 to 15 minutes. Top nachos with tomato, salsa, and sour cream.\n",
        "picture_link": "Mc14MQ5J5HdvcFC8vjsEa/VhB.cm8mK"
    },
    {
        "title": "Coconut Cream Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (15 ounce) can cream of coconut (such as Coco Lopez®) ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping (such as Cool Whip®), thawed - divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cream cheese and coconut cream in the work bowl of a large stand mixer. Beat with paddle attachment until mixture is smooth. Reserve 3/4 cup of whipped topping for the top of the dip; fold remaining whipped topping into cream of coconut mixture.\nPack reserved 3/4 cup whipped topping into a pastry bag fitted with a decorative tip. Spoon dip into a serving bowl and pipe remaining whipped topping onto the dip in a decorative pattern. Chill at least 1 hour or up to overnight.\n",
        "picture_link": "mRQNXh1cIbF77gsUxZM2aKGWUC.YogW"
    },
    {
        "title": "Betsy's Best Gluten-Free Muffins ",
        "ingredients": [
            "Dry Ingredients: ADVERTISEMENT",
            "1 cup white rice flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup oat flour ADVERTISEMENT",
            "1/2 cup all-purpose gluten-free flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "Wet Ingredients: ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/3 cup yogurt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Optional Additions: ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup pumpkin puree ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line muffin cups with paper liners.\nMix rice flour, sugar, oat flour, all-purpose flour, baking powder, and cinnamon together in a large bowl.\nBeat egg, milk, vegetable oil, yogurt, and vanilla together in a separate bowl until smooth; add to the dry ingredients and mix by hand until mostly smooth with only small lumps and you cannot see any patches of dry material in the batter. Gently stir walnuts, raisins, and pumpkin puree into the batter; spoon into prepared muffin cups to about 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes.\n",
        "picture_link": "4W87BsfejF0oVb5XDru7v9JDhGhD.GK"
    },
    {
        "title": "Quick Brazilian Lemonade",
        "ingredients": [
            "6 cups cold water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 limes ADVERTISEMENT",
            "6 tablespoons cream of coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water and sugar together in a bowl until sugar dissolves; chill in refrigerator.\nCut ends off of each lime and cut each lime into 8 segments.\nWorking in batches, pulse sugar-water and lime wedges together in a blender several times. Pour mixture through a strainer into a pitcher.\nStir cream of coconut into lime mixture.\n",
        "picture_link": "7mGRcUEb110a45464fcOSZKdXV.Awp2"
    },
    {
        "title": "Brittany's Best Guacamole",
        "ingredients": [
            "2 large avocados, flesh removed and mashed ADVERTISEMENT",
            "2 (10 ounce) baskets cherry tomatoes, quartered and seeded ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "1 large clove garlic, minced ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "2 teaspoons salt, or to taste ADVERTISEMENT",
            "2 teaspoons ground black pepper, or to taste ADVERTISEMENT",
            "1 teaspoon cayenne pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix avocado, tomatoes, onion, jalapeno pepper, and garlic together in a bowl. Stir lime juice into the avocado mixture. Season with salt, black pepper, and cayenne pepper.\n",
        "picture_link": "eqkLWBliVbyRVJ8Zc39Y7zRRBOniGlK"
    },
    {
        "title": "Chicken Wing Soup",
        "ingredients": [
            "2 (12 ounce) cans chicken chunks, drained ADVERTISEMENT",
            "1/2 cup hot sauce ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 small onions, diced ADVERTISEMENT",
            "5 stalks celery, diced ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "6 ounces processed cheese (such as Velveeta®), cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Shred chicken with a fork in a bowl and add hot sauce; stir to combine.\nMelt butter in a small skillet over medium heat; cook and stir onions and celery in melted butter until tender, about 10 minutes.\nMix water, flour, milk, and chicken bouillon in a large pot until smooth. Add processed cheese, shredded chicken, and onion mixture.\nHeat soup over low heat until cheese is melted, about 30 minutes. Stir often.\n",
        "picture_link": "MVfNJCG.LwvW13xHAj2VTI40mMvsARK"
    },
    {
        "title": "Creamy Ham and Bean Soup (Gluten Free)",
        "ingredients": [
            "1 Yukon Gold potato, peeled and diced ADVERTISEMENT",
            "1/2 head cauliflower, chopped ADVERTISEMENT",
            "12 baby carrots ADVERTISEMENT",
            "1/4 cup warm milk ADVERTISEMENT",
            "1 tablespoon butter, divided ADVERTISEMENT",
            "1/4 cup diced onion ADVERTISEMENT",
            "1/4 cup diced celery ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3/4 cup diced ham ADVERTISEMENT",
            "1 (14 ounce) can navy beans, undrained ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 (14 ounce) can navy beans, drained ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add potato, cauliflower, and carrots; cover and steam until very tender, about 20 minutes. Transfer potato mixture to a bowl and add milk and 1 1/2 teaspoons butter. Mash with a potato masher or hand mixer until smooth.\nMelt 1 1/2 teaspoons butter in a large saucepan over medium heat; saute onion, celery, thyme, salt, and pepper until fragrant, about 2 minutes. Add ham and cook and stir until ham is warmed, about 2 more minutes. Stir undrained navy beans and chicken broth into ham mixture, increase heat to high, and bring to a boil. Reduce heat and simmer.\nBlend drained navy beans and garlic together in a blender until smooth. Stir bean mixture into soup; simmer, stirring often, until soup thickens, about 10 minutes. Stir potato mixture into soup and simmer, stirring often, until thickened, about 5 minutes.\n",
        "picture_link": "I4nim1mIQ.5ArvlOU4KH0LOnIOGQvNC"
    },
    {
        "title": "Paloma",
        "ingredients": [
            "2 fluid ounces tequila ADVERTISEMENT",
            "1 1/2 tablespoons lime juice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 cubes ice, or as desired ADVERTISEMENT",
            "6 fluid ounces diet grapefruit soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the tequila, lime juice, and salt in a tall glass. Add ice, top off with diet grapefruit soda, and stir.\n",
        "picture_link": "1QVKNIHPigqv1IeGzjqjvJaAZa2O6xW"
    },
    {
        "title": "Peanut Butter Sesame Seed Balls",
        "ingredients": [
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup oats ADVERTISEMENT",
            "3 tablespoons ground flax seed ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt (optional) ADVERTISEMENT",
            "2/3 cup crunchy peanut butter ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, oats, ground flax seed, cinnamon, and salt together in a bowl; add peanut butter and honey and mix until thoroughly combined. Shape mixture into teaspoon-size balls.\nPour about 1/2 the sesame seeds into a large frying pan and cook over low heat, stirring or shaking the pan every minute until fragrant and toasted, 3 to 5 minutes. Transfer toasted seeds to a bowl and toast remaining sesame seeds.\nSpread toasted seeds into a wide, shallow bowl. Roll peanut butter balls in the toasted sesame seeds to evenly coat.\n",
        "picture_link": "bvcm.IclveIxHK3E/YtPQec.Yy.hzJS"
    },
    {
        "title": "Sour Cream Sugar Cookies",
        "ingredients": [
            "Cookies: ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk, or more as needed ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat white sugar and 1 cup butter together with an electric mixer in a large bowl until creamy. Add eggs 1 at a time, beating well after each addition. Beat sour cream and 2 teaspoons vanilla extract into butter mixture.\nStir flour, baking powder, and baking soda together in a bowl. Add flour mixture to sour cream mixture and stir well. Cover bowl with plastic wrap and refrigerate for at least 2 hours or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease 2 baking sheets.\nRoll cookie dough out on a floured surface to 1/4-inch thick. Cut into 3-inch round cookies and place onto prepared baking sheets.\nBake in the preheated oven until cookies spring back when lightly touched in the center, 10 to 12 minutes; transfer to wire racks to cool completely.\nBeat 1/3 cup butter, confectioners' sugar, milk, 1 1/2 teaspoons vanilla extract, and salt together in a bowl until smooth. Spread frosting over cooled cookies.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Beef Paprika and Noodles",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 pounds round steak, cut into bite-size pieces ADVERTISEMENT",
            "2 cups water, or more as needed ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "1 cup sliced onion ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "2 tablespoons dry mustard ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Cook and stir steak in hot oil until browned completely, about 5 minutes.\nStir water, ketchup, onion, Worcestershire sauce, brown sugar, paprika, mustard, garlic, salt, and pepper with the beef in the pot; bring to a boil, reduce heat to low, and cook at a simmer until meat is tender and the sauce thickens, 2 to 3 hours.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 5 minutes; drain.\nLadle beef mixture over noodles to serve.\n",
        "picture_link": "pYjQkjhJ9wCAgYO1Vd5J44Zb0FHODVS"
    },
    {
        "title": "Creamy and Tasty Eggnog Fudge",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup eggnog ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 1/2 cups miniature marshmallows ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 (6 ounce) package butterscotch chips ADVERTISEMENT",
            "2 tablespoons cold butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line 9-inch square pan with aluminum foil and spray foil with cooking spray. Prepare insides of a large saucepan with cooking spray.\nStir eggnog and sugar together in prepared saucepan over medium-high heat; bring to a rolling boil while stirring constantly with a wooden spoon. Boil mixture for 2 minutes.\nFold marshmallows and nutmeg into the eggnog mixture. Bring mixture again to a boil, stirring continually; boil for 6 minutes, remove immediately from heat, and add butterscotch chips and butter. Beat the mixture rapidly with a whisk or a hand mixer until thoroughly mixed and loses its gloss; pour into the prepared saucepan.\nSet fudge aside at room temperature until set, at least 15 minutes.\n",
        "picture_link": "LErGSiAUnChCJGMbddWb4mdZdyzYiwa"
    },
    {
        "title": "Burien Bisquit and Baked Bean Bowl",
        "ingredients": [
            "1 1/2 pounds ground pork ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 (16 ounce) cans baked beans (such as Bush's® Country Style) ADVERTISEMENT",
            "1 cup barbeque sauce (such as KC Masterpiece® Hot 'n Spicy) ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 1/2 cups baking mix (such as Bisquick ®) ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1/2 cup shredded medium Cheddar cheese ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 tablespoon barbeque sauce (such as KC Masterpiece® Hot 'n Spicy) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a Dutch oven or heavy oven-proof pot over medium heat. Cook and stir pork in the hot skillet until browned and crumbly, 5 to 7 minutes. Stir onion, garlic, salt, cayenne pepper, and black pepper into pork; cook until onions are translucent, 5 to 10 minutes.\nMix baked beans, 1 cup barbeque sauce, raisins, and Worcestershire sauce into pork mixture.\nWhisk baking mix, buttermilk, and egg together in a bowl until smooth; pour evenly over pork mixture.\nBake in the preheated oven until biscuit topping is golden brown, 40 to 45 minutes. Sprinkle Cheddar cheese and mozzarella cheese over topping and drizzle 1 tablespoon barbeque sauce over cheese. Bake until cheese is melted, 3 to 5 minutes.\n",
        "picture_link": "TVOd6lm27MbO3dPK.r5DqSn7xdyG/0C"
    },
    {
        "title": "Coconut Key Lime Ice Pops",
        "ingredients": [
            "1 avocado, peeled and pitted ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "1/4 cup agave nectar ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend avocado, coconut milk, agave nectar, lime juice, vanilla extract, and salt in a blender until smooth, about 1 minute. Pour mixture into ice pop molds and freeze until solid, 2 to 3 hours.\n",
        "picture_link": "IEyC5xdxkxy8D1f1AEducwi5QrhSKS."
    },
    {
        "title": "Buttermilk Smashed Potatoes",
        "ingredients": [
            "2 pounds red potatoes ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "1 pinch salt to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 15 to 20 minutes. Drain water from pot and mash potatoes with a potato masher or potato ricer.\nHeat buttermilk and butter together in a saucepan over medium-low heat until butter is melted and mixture is smooth, about 2 minutes. Stir buttermilk mixture and chives into potatoes until smooth; season with salt.\n",
        "picture_link": "2x83TyqNPDZ0354oQ1ghtvfuVH7Ur12"
    },
    {
        "title": "Shirley's Ice Box Fruit Cake",
        "ingredients": [
            "1 pound chopped pecans ADVERTISEMENT",
            "1 (15 ounce) package raisins ADVERTISEMENT",
            "1 (14 ounce) package sweetened flaked coconut ADVERTISEMENT",
            "1 (13.5 ounce) package graham cracker crumbs ADVERTISEMENT",
            "1 (4 ounce) jar maraschino cherries, drained and chopped ADVERTISEMENT",
            "1 (14 ounce) can low-fat sweetened condensed milk (such as Eagle Brand®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9x9-inch dish or decorative container with waxed paper.\nMix pecans, raisins, coconut, graham cracker crumbs, and cherries together in a bowl using your hands; stir in sweetened condensed milk. Press mixture into the prepared dish. Cover dish with plastic wrap or a tight-fitting lid. Refrigerate for 1 day.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sylvia's Pork Tamales",
        "ingredients": [
            "3 pounds pork butt roast ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "5 cloves garlic ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "3 ounces California chile pods, seeds and veins removed ADVERTISEMENT",
            "3 ounces New Mexico chile pods, seeds and veins removed ADVERTISEMENT",
            "1 cup pork broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 cup lard ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 (8 ounce) package dried corn husks ADVERTISEMENT",
            "5 pounds masa harina ADVERTISEMENT",
            "1 pound lard ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork butt, onion, 5 cloves garlic, and 1 tablespoon salt in a large pot; cover with water. Simmer mixture over medium heat until pork is very tender, about 3 hours. Discard onion and garlic. Strain and shred meat, reserving liquid.\nHeat a skillet over medium-high heat. Cook and stir California chile pods and New Mexico chile pods in the hot skillet until toasted and fragrant, 2 to 3 minutes. Rinse chile pods. Bring a pot of water to a boil and add chile pods; boil until chile pods are slightly softened, about 3 minutes. Drain and cool chile pods.\nBlend 1 cup pork broth, 1 cup water, chile pods, 1 tablespoon salt, 3 cloves garlic, and cumin together in a blender until smooth. Stir pork meat and chile sauce together in a bowl.\nMelt 1/2 cup lard in a large pot over medium heat. Stir flour into melted lard until browned and fragrant, about 5 minutes. Stir pork-chile sauce mixture into flour mixture, adding more salt if needed.\nRemove silk and debris from corn husks and soak in boiling water, 30 minutes to 1 hour. Drain and place on a work surface; cover with a clean, damp towel.\nMix masa, 1 pound lard, 1 cup reserved pork broth, baking powder, and salt in a large pan until mixture is fluffy and holds together.\nSelect 1 wide corn husk or 2 small ones. Spread about 2 tablespoons masa mixture onto corn husk, spreading to the sides and about 2 inches from the bottom and 1/4 inch from the top. Spoon 1 to 2 tablespoons pork mixture down the center of masa mixture. Fold sides of husk together, 1 over the other. Fold the bottom of husk over seam of 2 folded sides. Repeat with remaining husks and filling.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add tamales and cook until filling is heated through and set, 1 to 2 hours. Let tamales rest for 30 minutes before serving.\n",
        "picture_link": "KT0IPfIp96qUUWx9lAUk5rissdF5H0y"
    },
    {
        "title": "Hamballs",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (18 ounce) bottle barbeque sauce (such as Sweet Baby Ray's®) ADVERTISEMENT",
            "1 (10.75 ounce) can tomato soup ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 13x9-inch baking dish.\nMix ground beef, ground pork, and egg in a large bowl; shape into small balls. Arrange meatballs in the prepared baking dish.\nStir barbeque sauce, tomato soup, milk, and vinegar together in a separate bowl.\nBake meatballs in preheated oven until the juices run clear, about 30 minutes. Drain fat from baking dish and pour sauce over the meatballs. Continue baking until the sauce is hot, about 15 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Delicious Popcorn Crunch",
        "ingredients": [
            "15 cups plain popped popcorn ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/2 cup candy-coated milk chocolate pieces (such as M&M;'s®) ADVERTISEMENT",
            "Syrup: ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup light corn syrup (such as Crown® Lily White) ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line baking sheets with aluminum foil.\nCombine popcorn, cranberries, pecans, and chocolate pieces together in a bowl.\nStir sugar, butter, corn syrup, and vanilla extract together in a heavy saucepan; cook and stir over medium-high heat until boiling, about 5 minutes. Boil mixture for 2 minutes. Remove saucepan from heat and stir in vinegar.\nPour sugar mixture over popcorn mixture; mix until evenly coated. Spread coated popcorn mixture onto prepared baking sheets; cool. Break into pieces and store in an airtight container.\n",
        "picture_link": "KF7c7huG4h9wQCan1Z8k.h4C7DQCS9u"
    },
    {
        "title": "Slow Cooked Barbeque Pulled Pork",
        "ingredients": [
            "1 (7 pound) pork shoulder roast ADVERTISEMENT",
            "3/4 cup molasses ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 (18 ounce) bottle barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork in a slow cooker. Add molasses, chili powder, salt, paprika, cumin seeds, and ground coriander. Pour enough water into slow cooker to cover pork.\nCook on High for 6 to 8 hours. Drain liquid from slow cooker and shred pork with 2 forks. Add barbeque sauce. Reduce heat the Low and continue cooking for 1 hour more.\n",
        "picture_link": "g9tt8N6oyT58ASUqX/BEnPMeJsBnA2a"
    },
    {
        "title": "Hard Cider Pulled Pork",
        "ingredients": [
            "8 pounds pork picnic roast ADVERTISEMENT",
            "2 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "2 (12 fluid ounce) bottles hard cider ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nScore fat layer on pork shoulder by making shallow cuts in a diamond pattern. Spread garlic, parsley, sage rosemary, and thyme over pork. Place pork in a large roasting pan, fat side up. Pour cider over pork.\nBake in the preheated oven for 8 hours. Transfer pork to a large platter; remove and discard any large pieces of fat and skin. Pour pan drippings into a separate pot. Shred meat and return to the roasting pan.\nWhisk flour into water in a bowl.\nBring drippings to a boil and stir in flour mixture; cook and stir until gravy is thickened, about 5 minutes. Pour gravy over pork.\n",
        "picture_link": "HN0.LWGqHnai1TMh0kq/DkqQUWHyF/6"
    },
    {
        "title": "Easy Twinkie® Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1/2 cup butter, melted and slightly cooled ADVERTISEMENT",
            "4 large eggs, lightly beaten ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (5.1 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "3 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter and flour two 8-inch round cake pans.\nBeat 1/2 cup melted and cooled butter and eggs together in a bowl with an electric mixer. Add yellow cake mix, water, and pudding mix; beat on medium speed until batter is smooth and thick, about 1 minute. Divide batter between prepared cake pans.\nBake cakes in the preheated oven until a toothpick inserted in the center comes out clean, 20 to 25 minutes. Cool cakes for 5 minutes in the pans before transferring to wire racks to cool completely.\nBeat 1/2 cup softened butter and vanilla extract together in a bowl with an electric mixer. Add marshmallow creme and beat until smooth. Gradually beat in confectioners' sugar until just combined. Pour whipping cream into marshmallow creme mixture, increase speed to high, and beat until frosting is smooth and fluffy, about 1 minute.\nPlace one cooled cake round on a plate. Spread about 1/3 of the frosting over the top of the cake. Place second cake on top of frosting layer. Spread frosting on top and sides of cakes.\n",
        "picture_link": "9xglV7ElFsGsUotcUWEtEk3ZGViuwBS"
    },
    {
        "title": "Sweet and Sour Beef",
        "ingredients": [
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "3 cups cold water ADVERTISEMENT",
            "3/4 cup vinegar ADVERTISEMENT",
            "9 tablespoons soy sauce ADVERTISEMENT",
            "9 tablespoons brown sugar ADVERTISEMENT",
            "5 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a deep skillet over medium heat. Cook and stir beef in hot skillet until completely browned, 7 to 10 minutes. Transfer beef to a slow cooker.\nWhisk water, vinegar, soy sauce, brown sugar, and cornstarch together until smooth; pour over the beef.\nCook on Low until the beef is tender and the sauce is thick, 6 to 8 hours.\n",
        "picture_link": "H5Mh1u70t/P/r8pWp5BRfSjF5KCkGGK"
    },
    {
        "title": "Peanut Butter Lover's Peanut Butter Pudding",
        "ingredients": [
            "1/3 cup white sugar ADVERTISEMENT",
            "4 1/2 teaspoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sugar, cornstarch, and salt together in a saucepan. Stream milk and half-and-half into the saucepan while stirring to dissolve the sugar mixture.\nBring the mixture to a boil, reduce heat to medium, and cook, stirring continually, for 2 minutes. Remove saucepan from heat; stir peanut butter and vanilla extract into the milk mixture until smooth.\nDivide the mixture into 4 small serving dishes and refrigerate until firm, at least 30 minutes.\n",
        "picture_link": "8TmllUI5wvaba6EoxEhd7c2CTNS7Z8G"
    },
    {
        "title": "Kathy's Peanut Butterfinger® Oatmeal Cookies",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup old-fashioned oats ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups extra crunchy peanut butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "18 fun size bars chocolate-covered crispy peanut butter candy (such as Butterfinger®), crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nProcess flour, oats, baking soda, and salt in a food processor until blended.\nBeat peanut butter, brown sugar, white sugar, shortening, and unsalted butter together in a bowl with an electric mixer until creamy. Beat in eggs, one at a time, until well-blended. Add vanilla.\nStir flour mixture into peanut butter mixture; add crushed peanut butter candy and stir until just combined. Drop 1-inch spoonfuls of the dough, 2 inches apart, onto baking sheets.\nBake cookies in the preheated oven until light brown, about 15 minutes.\n",
        "picture_link": "XBiQGm1rV11Y3qScNh03C3toMPuo/HS"
    },
    {
        "title": "Apple Galette",
        "ingredients": [
            "1 sheet puff pastry, rolled to 1/8-inch thickness ADVERTISEMENT",
            "4 baking apples - peeled, cored, and cut into 1/3-inch thick slices ADVERTISEMENT",
            "1 tablespoon freshly squeezed lemon juice ADVERTISEMENT",
            "1/3 cup superfine sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1 egg, well beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nLay puff pastry onto a round pizza pan.\nMix apples and lemon juice together in a bowl until evenly coated; add sugar, cornstarch, cinnamon, nutmeg, and cloves. Toss to evenly coat apples. Spread apple mixture into the center of the puff pastry and fold edges of pastry toward the center. Brush the folded pastry edges with about 1/2 the egg.\nRefrigerate pastry-apple mixture for flavors and pastry to settle, about 10 minutes. Brush pastry with remaining 1/2 egg.\nPlace pan on the top rack of preheated oven and bake for 20 minutes. Give galette a 1/4 turn and lower heat to 350 degrees F (175 degrees C). Continue baking until pastry is lightly browned, 8 to 10 minutes. Cool slightly before serving, about 10 minutes.\n",
        "picture_link": "bT6Y0oy7ZAsVVnUM8fn5lZ8z/eBxmK2"
    },
    {
        "title": "Chef John's Simple Spinach Toasts",
        "ingredients": [
            "4 thick slices bread, toasted ADVERTISEMENT",
            "1 tablespoon olive oil, divided ADVERTISEMENT",
            "1 1/2 cups leftover creamed spinach, divided ADVERTISEMENT",
            "1 tablespoon freshly shredded Parmigiano-Reggiano cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil.\nBrush the lighter sides of the toast with olive oil. Place the toast pieces onto the prepared baking sheet with oiled sides down.\nSpoon leftover creamed spinach onto the toast slices, spreading the spinach all the way to the edges. Top each with a sprinkle of Parmigiano-Reggiano cheese.\nBake in the preheated oven for 10 minutes. Turn on the oven's broiler and broil spinach toasts until the cheese is lightly browned, about 2 more minutes.\n",
        "picture_link": "kByKGMTQf6AAxsEIl93IRgiXqVTd86a"
    },
    {
        "title": "Microwave Hot Fudge Peanut Butter Pudding",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking powder, or as needed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups hot water ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, white sugar, milk, peanut butter, 2 tablespoons cocoa powder, vegetable oil, vanilla extract, baking powder, and salt together in a bowl until batter is smooth; spread into an 8x8-inch microwave-safe dish.\nMix water, brown sugar, and 1/4 cup cocoa powder together in a bowl until dissolved; pour over batter.\nCook at 50% in microwave for 9 minutes. Rotate dish 1/2 turn and microwave on high until set, about 6 more minutes.\n",
        "picture_link": "owvYP8dhrtT0elMksCnpvU0q4N5kvCS"
    },
    {
        "title": "Northwest Fried Razor Clam Fillets",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 tablespoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 cups panko bread crumbs ADVERTISEMENT",
            "1 1/2 teaspoons dried tarragon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "8 razor clams, cleaned and dried ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs, hot pepper sauce, salt, and pepper together in a bowl. Mix together the panko and tarragon in a second bowl. Place the flour in a third bowl. Dip a razor clam into the egg, then into the flour, then back into the egg, then press the clam into the panko. Gently toss between your hands so any breading that hasn't stuck can fall away. Place the breaded clams onto a plate while breading the rest; do not stack.\nHeat butter in a skillet over medium-high heat. Fry clams until lightly browned, about 1 minute on each side. Do not overcook or they will become tough. Serve immediately.\n",
        "picture_link": "plnVgUvOLeScb5VEbhxOdgForrqfjdy"
    },
    {
        "title": "Georgia's Famous Holiday Cheese Ball",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup dried minced onion ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 (8 ounce) can mushroom stems and pieces, drained and chopped ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together cream cheese, onion, and Worcestershire sauce. Fold in the chopped mushrooms. Shape the mixture into a ball and pat the parsley around the outside of the ball. Refrigerate for 1 to 3 hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baked Quince with Cinnamon",
        "ingredients": [
            "3 quince, unpeeled, washed, halved and cored ADVERTISEMENT",
            "18 whole cloves ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 cup port wine ADVERTISEMENT",
            "3 cinnamon sticks ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/3 cup heavy cream, whipped (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nPress three cloves into each quince half. Place the fruit in a roasting pan cut-side down. Add the water, wine, and cinnamon sticks to the pan; sprinkle the sugar over the quince.\nBake the fruit in the preheated oven until lightly browned, about 35 to 40 minutes. Turn the quince right-side up and bake until tender, about 10 more minutes.\nRemove the pan from the oven and let the quince cool slightly. Transfer each quince half to a plate and drizzle with a tablespoon of juices from the roasting pan and a dollop of whipped cream.\n",
        "picture_link": "wrlWXxMWSgneVBhbowQQtP5h0zqcJx6"
    },
    {
        "title": "Uncle Bo's Hot Sandwiches",
        "ingredients": [
            "20 slices bacon ADVERTISEMENT",
            "3 pounds chipped chopped ham, shredded ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1/2 cup barbecue sauce (such as Heinz® Original BBQ Sauce) ADVERTISEMENT",
            "1/2 cup bottled sweet chili sauce (such as Heinz® Premium Chili Sauce) ADVERTISEMENT",
            "1/2 cup sweet pickle relish (such as Heinz® Sweet Relish) ADVERTISEMENT",
            "1/2 cup chopped sweet pickle slices (bread-and-butter type) ADVERTISEMENT",
            "32 slices Cheddar cheese* ADVERTISEMENT",
            "32 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Allow the bacon to cool, and chop.\nCook and stir the onion in the bacon grease left in the skillet until onion is translucent, about 10 minutes. Stir in the bacon, chipped ham, barbecue sauce, and chili sauce until the mixture is well combined. Transfer the ham mixture to a large bowl, and stir in the pickle relish and chopped pickle.\nPlace about 1/4 cup of ham mixture on a bun, and top with a slice of Cheddar cheese. Close the sandwiches, wrap each in foil, and bake in the preheated oven until hot and the cheese has melted, 15 to 20 minutes. Serve hot.\n",
        "picture_link": "HDh6wSXsPtYE.rcU08qeP9wU.OWegWa"
    },
    {
        "title": "Potato Chapati Bread",
        "ingredients": [
            "1 cup mashed potatoes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 tablespoon fresh cilantro, finely chopped ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "3/4 cup vegetable oil for frying ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the mashed potatoes, salt, cayenne, turmeric, cilantro, and 3 tablespoons vegetable oil in a bowl and mix well. Add the whole wheat flour a little at a time, kneading the mixture until it forms a stiff but pliable dough. (If the dough becomes too stiff, add a few drops of water.) Transfer the dough to an oiled bowl, turning to coat; cover with plastic and set aside for 10 minutes.\nPreheat a nonstick griddle to medium heat.\nDivide the dough into lemon-sized portions and roll them out on a lightly floured surface to 1/4-inch thickness. Fry the chapatis using up to 1 teaspoon of oil for each side. Cook until brown spots have started to form on the bread and the dough is cooked through. Brush with melted butter and serve hot.\n",
        "picture_link": "vNHs.kcu8bJnkuk1H3bjuYkP.Mn0naC"
    },
    {
        "title": "Chocolate Salami",
        "ingredients": [
            "1/2 cup raisins ADVERTISEMENT",
            "1/4 cup cognac ADVERTISEMENT",
            "2 (7 ounce) packages plain tea biscuits, broken into small pieces ADVERTISEMENT",
            "1 cup whole blanched almonds ADVERTISEMENT",
            "2 cups unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 cups melted butter ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 tablespoon confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak the raisins in the cognac in a small dish for 10 minutes. Combine the tea biscuits, almonds, and cocoa powder in a large mixing bowl. Pour the cognac and raisins into the mixture along with the butter and condensed milk. Mix well with your hands until a stiff, dark, and moist dough is formed.\nRoll a double layer of plastic wrap onto a clean work surface and place one third of the dough into the center of it. Shape the dough into a log about 2 to 3 inches in diameter. Place log towards the end of the plastic wrap and start rolling the plastic tightly around the log. Twist the ends of the plastic like a candy wrapper and tuck them under the log. Repeat with remaining dough. Refrigerate overnight.\nWhen ready to serve, use a small sieve to sprinkle the outside of the logs with confectioner's sugar, or, if you prefer, sprinkle the confectioner's sugar on a kitchen towel and roll the log on it. Slice with a sharp knife to serve.\n",
        "picture_link": "aCA3gWT9mJbzQYZLSutIdCdE7Iu6bdK"
    },
    {
        "title": "Grande Ravioli Salmone e Vedure",
        "ingredients": [
            "For the Ravioli: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1 eggplant, peeled and cubed ADVERTISEMENT",
            "sea salt and pepper to taste ADVERTISEMENT",
            "1 1/4 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 cup fresh spinach ADVERTISEMENT",
            "1 cup cooked salmon, flaked ADVERTISEMENT",
            "3 tablespoons ricotta cheese ADVERTISEMENT",
            "3 tablespoons cottage cheese ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons finely chopped fresh parsley ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 pound fresh pasta sheets ADVERTISEMENT",
            "For the Roasted Vegetables: ADVERTISEMENT",
            "4 cups cauliflower florets ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "sea salt and pepper to taste ADVERTISEMENT",
            "olive oil cooking spray ADVERTISEMENT",
            "8 ounces cherry tomatoes, halved ADVERTISEMENT",
            "1 zucchini, grated ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon finely chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon of olive oil in a skillet over medium-high heat. Add the minced garlic and the chopped green onion and cook for 2 minutes. Stir in the eggplant, salt, and pepper and cook until the eggplant begins to brown, about 7 minutes.\nMix in the mushrooms and cook until the mushrooms are soft and have given off all of their liquid. Reduce the heat to low and add the spinach. Cook until the spinach wilts, about 1 to 2 minutes. Remove the pan from the heat. Stir in the salmon, ricotta, cottage cheese, Parmesan cheese, chopped parsley, and the dried basil. Mix well and set aside.\nOn a lightly floured surface, roll out the pasta dough into a long thin rectangle; the dough should be about 1 millimeter thick. Slice the dough in half, width-wise, to make two rectangles. Spoon half the salmon mixture onto one side of each rectangle. Fold the other side of the rectangle over the filling and press to seal the dough around the filling. Trim the edges to make a nice shape and crimp edges to seal. Repeat with remaining ravioli. Refrigerate ravioli for 1 hour.\nCoat the cauliflower with 1 tablespoon of olive oil. Mix together the minced garlic, Parmesan cheese, bread crumbs, and salt and pepper to taste. Pour the garlic-bread crumb mixture over the cauliflower and toss to combine.\nPreheat an oven to 400 degrees F (200 degrees C).\nSpray a baking sheet with olive oil cooking spray. Place the ravioli in the center of the tray. Surround the ravioli with the seasoned cauliflower. Arrange the cherry tomatoes over the cauliflower and top with grated zucchini and sprinkle with salt and pepper to taste.\nBake the ravioli and vegetables in the preheated oven until the cauliflower and zucchini begin to brown, about 20 minutes. Remove the baking sheet from the oven. Use a spatula to transfer each ravioli to the center of a dinner plate. Spoon cauliflower mixture around the ravioli. Spread 1/2 tablespoon butter on each ravioli, sprinkle with the remaining chopped parsley, and serve.\n",
        "picture_link": "6foWHskqvDdTkNtZhJuKe1miIKRs9y."
    },
    {
        "title": "Baby Blintz Stacks",
        "ingredients": [
            "1 (24 ounce) carton cottage cheese ADVERTISEMENT",
            "2 fresh peaches - peeled, pitted and chopped ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 fresh peaches, pitted and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the cottage cheese, chopped peaches, 3 tablespoons white sugar, 1/4 teaspoon salt, and the almond extract in a bowl until evenly combined. Stir together the sour cream and brown sugar in a separate bowl. Refrigerate both fillings until ready to use.\nWhisk together the flour, 1 tablespoon of white sugar, the baking powder, 1/2 teaspoon salt, and the nutmeg in a bowl. Beat the eggs, milk, butter, and vanilla extract in a separate bowl until smooth. Stir in the flour mixture until no lumps remain.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle to form silver dollar-sized blintzes. Cook until bubbles form and the edges are dry, about 2 minutes. Flip, and cook until browned on the other side. Repeat with remaining batter.\nTo assemble, spread 1 tablespoon of peach filling on top of each blintz. Stack together 5 blintzes to make a serving portion, and spoon the sweetened sour cream overtop. Garnish with peach slices.\n",
        "picture_link": "tF0n1/TYDgCZHKJBAy1jNnFCC3IRRou"
    },
    {
        "title": "Minty Mint Chutney",
        "ingredients": [
            "1 onion, quartered ADVERTISEMENT",
            "2 fresh green chile peppers ADVERTISEMENT",
            "1/2 cup fresh mint leaves ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the onion, green chile peppers, mint, lemon juice, and salt together in a blender until smooth.\n",
        "picture_link": "fs4UZW7cHDQdzGNt/TWKUkT0HLVD31y"
    },
    {
        "title": "Atsara (Papaya Relish)",
        "ingredients": [
            "4 cups grated fresh green papaya ADVERTISEMENT",
            "1/4 cup salt ADVERTISEMENT",
            "1 carrot, peeled and sliced ADVERTISEMENT",
            "1 red bell pepper, sliced into long strips ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger root, peeled and sliced ADVERTISEMENT",
            "2 green chile peppers, sliced into thin rings ADVERTISEMENT",
            "1 (1.5 ounce) box raisins ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the grated papaya with 1/4 cup salt together in a large bowl; allow to sit for 1 hour. Drain the liquid from the papaya and rinse thoroughly. Place the papaya in the middle of a large piece of cheesecloth and squeeze to drain as much liquid from the papaya as possible.\nCombine the papaya, carrot, red bell pepper, ginger, green chile peppers, and raisins together in a clean large bowl; mix. Transfer the mixture to clean, dry jars with lids.\nStir the vinegar, water, sugar and 1 teaspoon salt together in a small saucepan; bring to a boil for 5 minutes. Pour the vinegar mixture into the jars, making sure the vegetables are completely submerged in liquid. Allow the vegetables to marinate in the liquid at least 1 day before using. Store in refrigerator between uses.\n",
        "picture_link": "J6ENa1eO1d46WFL8sdaXq3yDeOKk6Ny"
    },
    {
        "title": "Blintz Souffle I",
        "ingredients": [
            "3/4 cup unsalted butter, at room temperature ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (8 ounce) container cottage cheese ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "5 eggs, at room temperature ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, at room temperature ADVERTISEMENT",
            "1 (16 ounce) package cottage cheese ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 pound strawberries, hulled and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\nBeat butter with 1/3 cup sugar in a mixing bowl with an electric mixer until light and fluffy. In a separate bowl, stir together flour, baking powder, salt, and 1 teaspoon cinnamon until well combined. In a third bowl, beat 8 ounces of cottage cheese with 1/4 cup sour cream, 5 eggs, 1 1/2 teaspoons of vanilla extract, and the heavy cream until the mixture is smooth. Alternate adding flour mixture and cottage cheese mixture with the creamed sugar and butter to make a fluffy batter.\nTo make the filling, beat the cream cheese in a bowl with an electric mixer on high speed until fluffy, and add 16 ounce container of cottage cheese, 1/3 cup sugar, 2 eggs, 1/4 cup of sour cream, and 1 1/2 teaspoons of vanilla extract. Reduce mixer speed to medium, and beat until very smooth and creamy, about 5 minutes.\nPlace half the batter into the bottom of the prepared baking dish, and spread the filling over it in an even layer. Spread the rest of the batter over the cheese layer.\nBake in the preheated oven until the top is golden brown and a toothpick inserted into the center of the dish comes out clean, 50 minutes to 1 hour. Turn off the oven, open the door, and let the casserole cool in the oven for about 5 minutes before removing.\nMake a sauce by whisking together the orange juice, cornstarch, water, 1/8 teaspoon of cinnamon, and 1/2 cup of sugar in a saucepan over medium-low heat until the mixture boils. Stir in the strawberries, cover, reduce heat, and let the sauce simmer, stirring occasionally, until the strawberries are cooked and the sauce has thickened, about 15 minutes. Spoon sauce over casserole to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kheema Pulao",
        "ingredients": [
            "3 cups basmati rice ADVERTISEMENT",
            "1/4 cup cooking oil ADVERTISEMENT",
            "2 large onions, minced ADVERTISEMENT",
            "1 tablespoon garlic paste ADVERTISEMENT",
            "1 tablespoon ginger paste ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup frozen green peas (optional) ADVERTISEMENT",
            "4 green chile peppers, halved lengthwise ADVERTISEMENT",
            "1 tablespoon ghee (clarified butter) ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "1 black cardamom pod ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the basmati rice in a large container and cover with several inches of cool water; let stand 30 minutes. Drain.\nHeat the oil in a large pan with a heavy bottom; fry the onion, garlic paste and, ginger paste in the hot oil until the onions are caramelized and golden brown, about 10 minutes. Stir the turmeric, garam masala, and cumin into the mixture; allow to cook together for 30 seconds. Add the tomatoes and cook until the oil separates, about 10 minutes. Crumble the ground beef into the tomato mixture; season with salt and cook until the beef is no longer pink, about 15 minutes. Mix the frozen peas and the green chile peppers into the beef.\nHeat the ghee in a large skillet over medium heat. Cook the cinnamon stick, cardamom pod, bay leaves, and cloves in the ghee until fragrant, about 1 minute. Add the rice to the spice mixture; cook until the rice smells nutty, 1 to 2 minutes more. Spread the rice with the spices over the beef mixture, but do not stir. Gently pour the water over the rice and season with salt; bring the mixture to a boil for 2 minutes. Cover, reduce heat to low, and continue cooking until the rice is tender, 12 to 15 minutes. Remove from heat completely and allow to sit covered another 20 minutes. Garnish with cilantro to serve.\n",
        "picture_link": "RIHvtQfrEUmptP5Vc2Z4B7I6xSzd7w6"
    },
    {
        "title": "Rabri (Barley-Yogurt Drink)",
        "ingredients": [
            "6 cups water ADVERTISEMENT",
            "1 cup barley flour ADVERTISEMENT",
            "1 cup uncooked whole barley ADVERTISEMENT",
            "2 cups nonfat plain yogurt ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 6 cups of water, barley flour, and whole barley to a boil in a large saucepan. Reduce heat to medium-low, cover, and simmer 1 hour. Remove from the heat and refrigerate until cold.\nWhisk the yogurt with 1/4 cup of water; stir into the cooked barley. Season to taste with salt. Serve chilled as a cool drink.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]