[
    {
        "title": "Tonkatsu Shoyu Ramen (Pork Cutlet Soy Sauce Ramen)",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 1/2 teaspoons spicy sesame oil ADVERTISEMENT",
            "2 (1x3-inch) boneless pork chop slices ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 tablespoon black sesame seeds, divided ADVERTISEMENT",
            "2 leaves fresh basil, chopped, divided ADVERTISEMENT",
            "1 leaf fresh sage, chopped, divided ADVERTISEMENT",
            "1 (3 ounce) package instant ramen noodles (such as Shirakiku®), seasoning packet discarded ADVERTISEMENT",
            "3 tablespoons shredded dried kombu ADVERTISEMENT",
            "1 3/4 tablespoons bonito soup stock (such as Hondashi®) ADVERTISEMENT",
            "1 3/4 tablespoons soy sauce (shoyu) ADVERTISEMENT",
            "1/2 teaspoon white miso paste with dashi ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "4 1/3-inch slices fish paste stick (naruto) ADVERTISEMENT",
            "1 tablespoon tonkatsu sauce ADVERTISEMENT",
            "1 tablespoon sushi ginger (shoga), finely chopped ADVERTISEMENT",
            "1 green onion, thinly sliced ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a small pot halfway with water. Bring to a boil; add egg and cook for 15 minutes. Drain. Run cold water over egg and let cool.\nPour sesame oil into a large skillet. Add pork slices. Cover pork with half the olive oil, sesame seeds, basil, and sage. Flip and cover pork with remaining olive oil, sesame seeds, basil, and sage.\nCook pork, covered, over medium-low heat, until evenly browned on the bottom, about 5 minutes. Flip and continue cooking until second side is browned, about 5 minutes more. Remove from heat.\nBring a large pot of water to a boil. Add ramen noodles; cook for 3 minutes. Drain in a colander set in the sink; rinse noodles until water runs clear. Return noodles to the pot.\nStir kombu, bonito stock, soy sauce, and miso paste into the noodles. Cook, stirring with chopsticks, over medium heat, until miso paste is dissolved, 3 to 5 minutes. Transfer noodles to a bowl.\nPeel and cut egg in half lengthwise. Top noodles with egg, pork slices, and fish paste slices. Garnish with tonkatsu sauce, ginger, green onion, and black pepper.\n",
        "picture_link": "ucXZTgnrSwsJJ6xPYiNtNAOnQYDCKzi"
    },
    {
        "title": "Mexican Fiesta with Sorghum Grain",
        "ingredients": [
            "1 cup whole grain sorghum, uncooked ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 cups cooked, shredded chicken ADVERTISEMENT",
            "1 tablespoon Mexican seasoning blend ADVERTISEMENT",
            "1 avocado, halved and sliced ADVERTISEMENT",
            "1 cup pico de gallo ADVERTISEMENT",
            "1 cup roasted corn salsa ADVERTISEMENT",
            "1 cup black beans ADVERTISEMENT",
            "Lime wedges ADVERTISEMENT",
            "Sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, boil 4 cups of water and add 1 cup of whole grain sorghum to make 3 cups of cooked sorghum. Cover with a tight-fitting lid, reduce heat to medium and simmer for 45 minutes or until tender. Fluff with a fork.\nIn a large bowl combine chicken and Mexican seasoning. Add in the cooked sorghum, avocado, pico de gallo, corn salsa, and black beans. Season to taste with salt and pepper. Serve with lime wedges and sour cream.\n",
        "picture_link": "y19KiZx78TVLGudfl3IQyi2z8RbSX9y"
    },
    {
        "title": "Sorghum Pilaf with Roasted Asparagus",
        "ingredients": [
            "1/2 cup whole grain sorghum, uncooked ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 pound asparagus ADVERTISEMENT",
            "1 medium shallot ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons champagne vinegar ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, boil 2 cups of water and add 1/2 cup of whole grain sorghum to make 1 1/2 cups of cooked sorghum. Cover with a tight-fitting lid, reduce heat to medium and simmer for 45 minutes or until tender. Fluff with a fork.\nPreheat oven to 400 degrees F. Trim ends from the asparagus and cut into 1/2 inch pieces. Cut the shallots into thin slices and place the asparagus and shallots in a roasting pan. Toss with olive oil and salt. Roast for 20 minutes or until the asparagus is cooked and starts to char.\nOnce the asparagus is cooked, toss the sorghum with the asparagus, feta and parsley (use more or less sorghum if needed). Whisk together the dressing ingredients, pour over the sorghum mixture and toss until well combined. Toss and add more salt as desired.\nPair with white fish (cook however desired).\n",
        "picture_link": "yNk7k2kRpc9cRO5UdeY6A7uvCeWoFXu"
    },
    {
        "title": "Reddi-wip Filled Cupcakes",
        "ingredients": [
            "PAM® Baking Spray ADVERTISEMENT",
            "1 (18.25 ounce) package extra moist cake mix, any flavor ADVERTISEMENT",
            "1 (6.5 ounce) can Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "Topping Suggestions: ADVERTISEMENT",
            "Reddi-wip, prepared frosting, ice cream toppings (optional) ADVERTISEMENT",
            "'Sprinkle' Suggestions: ADVERTISEMENT",
            "Candy sprinkles, chopped nuts, toasted coconut, fresh fruit, candy pieces (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Spray 24 medium muffin cups with baking spray. Do NOT use cupcake liners. Prepare cake mix according to package directions. Spoon batter evenly into prepared muffin cups. Bake according to package directions.\nCool cupcakes in pan 5 minutes. Remove from pan and cool completely on wire rack.\nAssemble selected toppings and sprinkles, if desired. When ready to serve, fill each cupcake to be eaten immediately with Reddi-wip according to the Cook's Tips. Immediately 'frost' with a topping and 'sprinkle' if desired. Serve immediately.\n",
        "picture_link": "SRh1paJRRAE/MZD.MlbLcdDXOKmjZn."
    },
    {
        "title": "Asian Veggies, Chicken and Sorghum Grain Bowl",
        "ingredients": [
            "1 cup pearled sorghum, uncooked ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "12 ounces cooked, sliced chicken breast ADVERTISEMENT",
            "2 cups shredded cabbage ADVERTISEMENT",
            "1 1/2 cups sugar snap peas ADVERTISEMENT",
            "1 cup carrot ribbons ADVERTISEMENT",
            "1 cup daikon radish ribbons ADVERTISEMENT",
            "2 tablespoons furikake (Japanese nori seasoning) ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons toasted sesame oil ADVERTISEMENT",
            "3 tablespoons rice vinegar ADVERTISEMENT",
            "1 tablespoon reduced-sodium soy sauce ADVERTISEMENT",
            "2 teaspoons sugar ADVERTISEMENT",
            "1/2 teaspoon sesame seeds ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, boil 4 cups of water and add 1 cup of whole grain sorghum to make 3 cups of cooked sorghum. Cover with a tight-fitting lid, reduce heat to medium and simmer for 45 minutes or until tender. Fluff with a fork.\nCombine all salad ingredients in a large bowl. Whisk together all dressing ingredients. Drizzle dressing over salad and toss to coat. Sprinkle with additional furikake, if desired.\n",
        "picture_link": "IOUJ/.FwVOtbWJskLHujtwKxSc54uhC"
    },
    {
        "title": "Apple Water",
        "ingredients": [
            "22 fluid ounces water ADVERTISEMENT",
            "8 slices Granny Smith apple ADVERTISEMENT",
            "5 slices fresh ginger ADVERTISEMENT",
            "2 1-inch pieces lemongrass ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, Granny Smith apple, ginger, and lemongrass in a 32-fluid ounce Mason jar or pitcher. Stir gently, cover, and refrigerate until flavors combine, at least 1 hour.\n",
        "picture_link": "d2RWP9zGjQmujsn53Xt9ibVOEBpycxG"
    },
    {
        "title": "Whips!® Fruit Shortcakes",
        "ingredients": [
            "6 shortcake dessert shells ADVERTISEMENT",
            "2 (4 ounce) containers Yoplait® Greek 100 Whips!® Vanilla Cupcake yogurt ADVERTISEMENT",
            "3/4 cup fresh fruit (such as blueberries, sliced bananas and sliced strawberries) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place dessert shells on serving platter. Spoon yogurt evenly into dessert shells (about 3 tablespoons per shell). Top with fruit.\n",
        "picture_link": "xBvsroLcx02yWrJX3G60SOL6ZJdiWQS"
    },
    {
        "title": "Mighty Fine Turkey Brine",
        "ingredients": [
            "5 cups water, divided ADVERTISEMENT",
            "1 cup salt ADVERTISEMENT",
            "1 gallon water ADVERTISEMENT",
            "1 cup packed dark brown sugar ADVERTISEMENT",
            "2 quarts apple juice (not from concentrate) ADVERTISEMENT",
            "1 pint whiskey (such as Jack Daniel's®) ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 large Gala apple, quartered and chopped ADVERTISEMENT",
            "1 navel orange, quartered, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 1/2 cups water and salt in a small saucepan. Bring to a boil, stirring constantly, until salt is dissolved, about 3 minutes.\nPour water and salt mixture into a 5-gallon bucket. Add 1 gallon of water.\nCombine 2 1/2 cups water and brown sugar in a small saucepan. Bring to a boil, stirring constantly, until sugar is dissolved, about 3 minutes. Pour into the bucket.\nStir apple juice, whiskey, and lemon juice into the bucket. Add chopped apple. Squeeze in orange juice and add in rinds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Brown Sugar Chicken Brine",
        "ingredients": [
            "3/4 cup kosher salt ADVERTISEMENT",
            "3/4 cup light brown sugar ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 1/2 teaspoons ground cayenne pepper ADVERTISEMENT",
            "1 gallon warm water ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix salt, brown sugar, garlic, and cayenne pepper together in a large bowl. Pour in water; stir until dissolved. Mix in molasses and soy sauce. Let stand until brine comes to room temperature, about 50 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grilled Gazpacho Bloody Mary",
        "ingredients": [
            "1 pound tomatoes ADVERTISEMENT",
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "1 teaspoon salt, divided ADVERTISEMENT",
            "1 red bell pepper ADVERTISEMENT",
            "1 small onion, quartered ADVERTISEMENT",
            "1 poblano pepper ADVERTISEMENT",
            "3 cloves garlic, unpeeled ADVERTISEMENT",
            "1 lemon, halved ADVERTISEMENT",
            "1 1/2 teaspoons grated fresh horseradish ADVERTISEMENT",
            "1 teaspoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "1 dash hot sauce (such as Tabasco®), or to taste (optional) ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "6 fluid ounces vodka, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nToss tomatoes with 2 tablespoons olive oil and 1/2 teaspoon salt in a bowl. Place on 2 sheets of aluminum foil; tent the edges to contain the juices.\nToss red bell pepper, onion, poblano pepper, and garlic with remaining 2 tablespoons olive oil and 1/2 teaspoon salt in the bowl.\nPlace tented aluminum foil with tomatoes on the grill. Place red bell pepper mixture and lemon halves directly on the grill. Cover and cook, turning occasionally, until browned, 12 to 15 minutes.\nWrap grilled red bell pepper and poblano pepper in aluminum foil. Allow peppers to steam as they cool, about 10 minutes. Remove and discard skins and seeds.\nTransfer peeled peppers to a blender. Add grilled tomatoes, with their juices, and 3/4 of the onion to the blender. Squeeze in juice from grilled lemon and garlic from the skins. Cover and blend until smooth. Stir in horseradish, seafood seasoning, celery salt, Worcestershire sauce, and hot sauce. Refrigerate until cooled, about 30 minutes.\nFill 6 glasses with ice. Pour 1 fluid ounce vodka into each. Top with blended mixture. Garnish with remaining 1/4 onion.\n",
        "picture_link": "ZF4cIzYtzRJOuBC9UTURP0ElF6xwT0m"
    },
    {
        "title": "Grilled Lemon Limeade",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "8 lemons, halved ADVERTISEMENT",
            "8 limes, halved ADVERTISEMENT",
            "4 cups water, divided, or to taste ADVERTISEMENT",
            "1 lemon, sliced ADVERTISEMENT",
            "1 lime, sliced ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nPour sugar into a saucepan; press halved lemons and limes cut-side down into the sugar.\nSet the saucepan with remaining sugar on grill; stir in 2 cups of water and whisk over the heat until dissolved into a syrup. Let cool.\nPlace lemon and lime halves sugared-side down on grill and cook until browned, about 5 minutes.\nPlace lemon and lime slices on the grill; cook until browned, 30 to 60 seconds on each side.\nJuice halved lemons and limes into a large pitcher. Add syrup and 2 cups water to the juice, 1/2 cup at a time, until the limeade achieves desired sweetness. Pour limeade into glasses filled with ice; garnish each glass with a grilled citrus slice.\n",
        "picture_link": "DUQKQurkmJAhR3S0SI7A.l0mikY0/fS"
    },
    {
        "title": "White Chicken Chili with Rice",
        "ingredients": [
            "2 pounds roasted chicken, cut into bite-size pieces ADVERTISEMENT",
            "2 (14 ounce) cans fat-free chicken broth ADVERTISEMENT",
            "4 cups hot water ADVERTISEMENT",
            "1 (15 ounce) can navy beans ADVERTISEMENT",
            "2 (5.6 ounce) packages creamy chicken-flavored rice mix (such as Knorr® Rice Sides™) ADVERTISEMENT",
            "1/2 head broccoli, coarsely chopped ADVERTISEMENT",
            "2 large carrots, sliced 1/4 inch thick ADVERTISEMENT",
            "1 red bell pepper, cut into 1-inch chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken, chicken broth, water, navy beans, chicken-flavored rice mix, broccoli, carrots, and red bell pepper in a large Dutch oven. Bring to a boil; reduce heat to low and simmer until broccoli and carrots are tender, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bacon SPAM® and Potato Pancakes",
        "ingredients": [
            "4 cups mashed potatoes ADVERTISEMENT",
            "1 (12 ounce) can fully cooked luncheon meat with bacon (such as SPAM® with Bacon), diced ADVERTISEMENT",
            "1 cup buttermilk pancake mix ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mashed potatoes, luncheon meat, pancake mix, and eggs together gently in a bowl.\nHeat oil in a skillet over medium heat. Spoon potato mixture into hot oil and press with a spatula to flatten evenly. Cook, covered, until bottom is crispy, 3 to 5 minutes. Flip and continue cooking until second side is golden and crispy, 3 to 4 minutes more.\n",
        "picture_link": "PlCkYfqFdAIboad/rEQvsEitPbJqX5m"
    },
    {
        "title": "Candied SPAM® with Bacon",
        "ingredients": [
            "1/4 cup dark brown sugar ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (12 ounce) can fully cooked luncheon meat with bacon (such as SPAM® with Bacon), sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix dark brown sugar and pepper together in a shallow bowl.\nCoat both sides of luncheon meat slices with brown sugar mixture; arrange in a single layer on a nonstick baking sheet.\nBake in the preheated oven, turning halfway, until golden brown, about 15 minutes. Allow to cool slightly before serving.\n",
        "picture_link": "Da0nHv8UifHj4aostPxiDr3C6rB3iHK"
    },
    {
        "title": "Grilled Peach Bourbon Smash",
        "ingredients": [
            "1 large peach \u0096 halved, stone removed, and skin on ADVERTISEMENT",
            "1/2 lemon ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "5 leaves fresh mint ADVERTISEMENT",
            "2 fluid ounces simple syrup ADVERTISEMENT",
            "3 fluid ounces bourbon (such as Bulleit®) ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "4 fluid ounces ginger ale, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate. When the grill is hot, close lid and allow to heat, 5 minutes.\nPlace peach halves and lemon, cut-side down, in sugar until coated. Place on the grill; cook until fruits are soft, about 5 minutes. Cool on a cutting board, about 1 minute. Cut peach into slices with a knife; reserve 2 for garnish.\nPlace remaining peach, mint leaves, and simple syrup into a cocktail shaker; juice lemon into the shaker. Gently muddle with a cocktail muddler. Pour in bourbon and ice, cover, and shake until the outside of the shaker has frosted. Strain into a chilled glass; top off with ginger ale, and garnish with grilled peach slices and lemon.\n",
        "picture_link": "XiipBzB65LtQDFGy4WYZZjDUDivFJoO"
    },
    {
        "title": "Kid Friendly Fondue",
        "ingredients": [
            "2 cups fresh blueberries, raspberries and/or blackberries ADVERTISEMENT",
            "1 cup Annie's™ Bunny Grahams™ honey snacks ADVERTISEMENT",
            "3/4 cup mini pretzel twists ADVERTISEMENT",
            "2 (6 ounce) containers Yoplait® Original Strawberry or Mixed Berry yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in small separate containers, and place on a tray for serving. Serve immediately.\n",
        "picture_link": "tkOYMgKHUZTP/D0mi6pwR/5F9Eml4eW"
    },
    {
        "title": "Grilled Pineapple Mai Tai",
        "ingredients": [
            "1/4 cup white sugar ADVERTISEMENT",
            "1 lime, halved, or more to taste ADVERTISEMENT",
            "1/4 pineapple, cut into wedges ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "1 fluid ounce gold rum ADVERTISEMENT",
            "1/2 fluid ounce silver rum ADVERTISEMENT",
            "1/2 fluid ounce triple sec ADVERTISEMENT",
            "1/2 fluid ounce orgeat almond syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nPlace sugar in a shallow bowl. Dip lime halves in sugar to coat.\nGrill lime and pineapple wedges, turning occasionally, until lightly browned, 5 to 10 minutes. Remove from grill and let cool.\nFill a cocktail shaker and Old Fashioned glass with ice.\nSqueeze 1/2 fluid ounce lime juice and 1 fluid ounce pineapple juice into the shaker. Add gold rum, silver rum, triple sec, and orgeat syrup. Cover and shake until the outside of shaker has frosted. Strain into the glass and garnish with a grilled pineapple wedge.\n",
        "picture_link": "1Q.WUFSR91NzBfTQn9ZIbIH.s3gYZYK"
    },
    {
        "title": "Easy Corn Souffle",
        "ingredients": [
            "1 teaspoon butter, softened ADVERTISEMENT",
            "1 teaspoon all-purpose flour ADVERTISEMENT",
            "1 (16.5 ounce) can cream-style corn ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 4-cup souffle dish with butter. Dust dish with flour; tap out excess.\nBeat cream-style corn, egg yolks, and cayenne pepper in a large bowl with an electric mixer until smooth.\nBeat egg whites with cream of tartar in another bowl with an electric mixer until stiff peaks form. Fold a large spoonful of whipped egg whites into corn mixture until incorporated.\nFold corn mixture into remaining egg whites. Pour into the prepared souffle dish.\nBake in the preheated oven until souffle is golden brown and center is set, 25 to 30 minutes.\n",
        "picture_link": "eHMKvM49EkntGTpLQoPwfRYLIy3wJCW"
    },
    {
        "title": "Easy Cheeseburger Quiche",
        "ingredients": [
            "1 tablespoon oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 teaspoon meat seasoning, or to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch herbes de Provence, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup skim milk ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons all purpose flour ADVERTISEMENT",
            "1 1/4 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 pastry for a 9-inch deep dish pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat oil in a skillet over medium heat; cook and stir onion until tender and browned, 15 to 20 minutes. Add ground beef and season with meat seasoning, garlic powder, herbes de Provence, salt, and pepper. Cook and stir until beef is browned and crumbly, about 5 minutes. Drain excess fat from skillet.\nBeat eggs together in a bowl. Whisk in milk, mayonnaise, and flour; sprinkle with salt. Stir in beef mixture and 1 cup of Cheddar cheese. Pour into the pie shell.\nBake in preheated oven until a knife inserted into the center of quiche comes out clean, about 45 minutes. Sprinkle remaining cheese on top of the quiche. Allow to stand for 5 minutes before cutting.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blueberry Vanilla Graham Protein Smoothie",
        "ingredients": [
            "1 cup coconut water, or to taste ADVERTISEMENT",
            "1 banana, frozen ADVERTISEMENT",
            "3/4 cup fresh blueberries ADVERTISEMENT",
            "1/4 cup kale (optional) ADVERTISEMENT",
            "1/4 cup spinach (optional) ADVERTISEMENT",
            "2 medjool dates, pitted and chopped ADVERTISEMENT",
            "1 tablespoon almond butter ADVERTISEMENT",
            "1 tablespoon hemp seed hearts ADVERTISEMENT",
            "1 tablespoon flax seeds ADVERTISEMENT",
            "1 tablespoon oats ADVERTISEMENT",
            "1 scoop vanilla protein powder (optional) ADVERTISEMENT",
            "2 tablespoons graham cracker crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine coconut water, banana, blueberries, kale, spinach, dates, almond butter, hemp seed hearts, flax seeds, oats, and protein powder in a blender. Cover and puree until smooth. Top with graham cracker crumbs.\n",
        "picture_link": "x2wDLxTUMgebmQgRos9c72MUm6rX6Gm"
    },
    {
        "title": "Grilled Grapefruit Paloma Cocktail",
        "ingredients": [
            "2 limes ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 red grapefruit, halved widthwise ADVERTISEMENT",
            "1/4 cup kosher salt ADVERTISEMENT",
            "1 cup ice cubes, or as needed ADVERTISEMENT",
            "4 fluid ounces tequila ADVERTISEMENT",
            "2 tablespoons simple syrup, or to taste ADVERTISEMENT",
            "4 fluid ounces club soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCut limes in half widthwise. Cut 1 half into 3 wheels.\nPour sugar into a shallow bowl. Dip lime halves, 2 of the lime wheels, and grapefruit into sugar to coat thoroughly.\nPlace limes and grapefruit cut-side down on the hot grill. Cook, turning lime wheels occasionally, until browned and grill marks form, 5 to 10 minutes. Transfer to a rimmed baking sheet to cool.\nRub remaining lime wheel over the rim of 2 highball glasses. Dip rims in kosher salt. Fill glasses with ice.\nJuice grilled lime halves and grapefruit into a small pitcher. Pour in any juices that accumulated on the baking sheet. Stir in tequila and simple syrup. Divide mixture between glasses and top off with club soda. Garnish with grilled lime wheels.\n",
        "picture_link": "CaKqPTEjool6MDmcTT23cG.IwHAafIu"
    },
    {
        "title": "Homemade Mascarpone Cheese",
        "ingredients": [
            "4 1/2 cups light cream ADVERTISEMENT",
            "1/8 teaspoon tartaric acid ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour cream into a double boiler fitted with a thermometer. Heat cream until the thermometer reads 185 degrees F (85 degrees C), about 10 minutes. Add tartaric acid; cook, stirring constantly, until cream thickens and curds start to form, about 5 minutes\nScoop curds into a sieve lined with several layers of cheesecloth using a slotted spoon. Fold the edges of the cheesecloth over the curds and let drain over a bowl at room temperature, about 1 hour.\n",
        "picture_link": "eXyyroJmDF3n3heO.VhzLq5CDT7jd9u"
    },
    {
        "title": "Chocolate Peanut Butter Banana Smoothies",
        "ingredients": [
            "2 (3.25 ounce) cups Snack Pack® Chocolate Pudding ADVERTISEMENT",
            "2 tablespoons Peter Pan® Creamy Peanut Butter ADVERTISEMENT",
            "2 large ripe bananas, cut into pieces ADVERTISEMENT",
            "3/4 cup reduced fat (2%) milk ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "Reddi-wip® Chocolate Dairy Whipped Topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients, except Reddi-wip, in blender container; blend until smooth.\nDivide evenly among 4 glasses; top each with 1 serving Reddi-wip. Serve immediately.\n",
        "picture_link": ".4TVleNvhPikJNMIuTsqrZaTOAwpHKu"
    },
    {
        "title": "Spiralized Carrot Ambrosia Salad",
        "ingredients": [
            "1/2 cup yogurt ADVERTISEMENT",
            "1/2 cup pineapple tidbits in pineapple juice, undrained ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup coconut ADVERTISEMENT",
            "2 tablespoons honey, or to taste ADVERTISEMENT",
            "4 cups spiral-sliced carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir yogurt, pineapple, raisins, coconut, and honey together in a bowl; add carrots. Stir until ingredients are thoroughly combined. Refrigerate until chilled, about 30 minutes. Stir again before serving.\n",
        "picture_link": "POxkKU1e5iGkTVaGESPrdgSh5Nnuf5e"
    },
    {
        "title": "Chocolate Strawberry 'Shortcake'",
        "ingredients": [
            "1 chocolate graham cracker square ADVERTISEMENT",
            "1 tablespoon crushed pretzels ADVERTISEMENT",
            "Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "1/4 cup cut-up fresh strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine crushed graham cracker and pretzels in serving dish. Top with one serving (2 tablespoons) Reddi-wip, strawberries and another serving Reddi-wip. Serve immediately.\n",
        "picture_link": "XZiNzYzDZEZF8bKJC.jzE/kjhLc4qZy"
    },
    {
        "title": "Grilled Zucchini with Feta",
        "ingredients": [
            "2 zucchini, quartered ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 pinch Greek seasoning, or to taste ADVERTISEMENT",
            "1/3 cup crumbled reduced-fat feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nTrim a little skin off each zucchini piece so it will lay flat on the grill. Brush olive oil on top and sprinkle with Greek seasoning. Top with feta cheese. Grill to preferred level of doneness, about 10 minutes.\n",
        "picture_link": "oJGFgvNSkltRcrYS4CGDfIOdsrd9pF."
    },
    {
        "title": "Brown Sugar Caipirinha",
        "ingredients": [
            "1/2 lime, cut into wedges ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "crushed ice ADVERTISEMENT",
            "2 fluid ounces cachaca (Brazilian rum) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lime wedges and brown sugar in a lowball cocktail glass; mash with a cocktail muddler to release lime juice. Top glass with ice. Pour in cachaca and stir.\n",
        "picture_link": "XHSqKaeE6njMdFE7M8t0gW4p0B3LYxm"
    },
    {
        "title": "Roasted Bell Pepper Dressing",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 red bell peppers ADVERTISEMENT",
            "1 cup water, or as needed ADVERTISEMENT",
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "3 tablespoons canola oil ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 tablespoon cilantro ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon sea salt, or to taste ADVERTISEMENT",
            "1 tablespoon cracked black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Spray a baking sheet with cooking spray; place red bell peppers onto baking sheet.\nBake in the preheated oven, turning with tongs every 10 minutes, until skin is evenly blackened and blistered, about 30 minutes. Remove from oven; cover with a heat-proof bowl. Let stand until skin peels off easily, about 20 minutes.\nRemove skin, stem, and seeds from red bell peppers with a sharp knife.\nCombine roasted red peppers, water, vinegar, oil, honey, garlic, cilantro, basil, salt, and pepper in a food processor; blend until smooth.\n",
        "picture_link": "HPLd1PvSBuD3Aotle4b38H.Fnvvpwwy"
    },
    {
        "title": "Sesame Parmesan Popcorn",
        "ingredients": [
            "1/3 cup popcorn kernels ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "3 tablespoons sesame oil ADVERTISEMENT",
            "1/4 cup finely grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pop popcorn in a hot air popper or microwave popper according to manufacturer's instructions. Pour into a large bowl.\nMix butter and sesame oil together in a small bowl. Drizzle over popcorn. Add Parmesan cheese, salt, and pepper; toss well to coat.\n",
        "picture_link": "2PtItwH.yaGDgqGDmH1wl5UbSo8L3Me"
    },
    {
        "title": "Kicked Up Mac & Cheese",
        "ingredients": [
            "1 (14.5 ounce) package macaroni and cheese mix ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup butter, divided ADVERTISEMENT",
            "1 (15 ounce) can Libby's® Sweet Peas, drained ADVERTISEMENT",
            "1 (15 ounce) can Libby's® Whole Kernel Sweet Corn, drained ADVERTISEMENT",
            "1 (4 ounce) jar diced pimentos, drained ADVERTISEMENT",
            "1 1/2 cups panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare macaroni and cheese with milk and 1/4 cup butter, following package directions. Gently stir in peas, corn and pimentos.\nPlace in 3-quart casserole dish.\nMelt remaining 1/4 cup butter, mix with breadcrumbs, and sprinkle evenly over casserole. Place under broiler about 2 minutes or until top is lightly browned.\n",
        "picture_link": "j6L.MbVR8QGMzvDNz.mLqTBD0lBvzi6"
    },
    {
        "title": "Scrambled Peanut Butter Eggs",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 tablespoons peanut butter ADVERTISEMENT",
            "2 teaspoons minced fresh ginger ADVERTISEMENT",
            "2 teaspoons minced fresh garlic ADVERTISEMENT",
            "1 teaspoon seasoning sauce (such as Maggi®) ADVERTISEMENT",
            "1 teaspoon sriracha sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk eggs, peanut butter, ginger, garlic, seasoning sauce, and sriracha sauce together in a small bowl.\nHeat a nonstick skillet over medium heat. Pour in egg mixture; cook and stir until scrambled and firm, about 5 minutes.\n",
        "picture_link": "MurvDFeX.OVfVVG1Fu/o.7C1JMM40si"
    },
    {
        "title": "Bambam Basil Butter",
        "ingredients": [
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "2 tablespoons finely chopped onion ADVERTISEMENT",
            "2 tablespoons Parmesan cheese ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "3 cloves garlic, or to taste ADVERTISEMENT",
            "10 fresh basil leaves ADVERTISEMENT",
            "1/4 teaspoon salt (optional) ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine butter, onion, Parmesan cheese, mayonnaise, garlic, basil leaves, salt, and pepper in a food processor; pulse until smooth.\n",
        "picture_link": "Mx5xNFTLtjWXJMdyTHfwTFhMfrhDhHm"
    },
    {
        "title": "Strawberry Quinoa Salad",
        "ingredients": [
            "1 cup quinoa ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "4 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "2 cups baby spinach, or to taste ADVERTISEMENT",
            "2 cups walnuts ADVERTISEMENT",
            "1 (4 ounce) container feta cheese, crumbled ADVERTISEMENT",
            "1/2 cup thinly sliced strawberries, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place quinoa in a saucepan. Pour 2 cups water over quinoa; bring to a boil. Reduce heat; cover. Simmer until quinoa is tender, 12 to 15 minutes. Drain; cool.\nCombine lemon juice and olive oil in a small bowl; stir until dressing is combined.\nPour half of the quinoa into a large salad bowl. Add 1 handful of baby spinach; stir together. Add 1 handful of walnuts, feta cheese, and strawberries; stir until mixed. Repeat layering and stirring quinoa, spinach, feta cheese, and strawberries until all ingredients are mixed together. Top with dressing.\n",
        "picture_link": "9OK9o..r47j7H0/bFXg764QuxKuRwMW"
    },
    {
        "title": "Oat and Quinoa Breakfast Cake",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 cup almond flour ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "2 tablespoons cold water, or as needed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 cups vanilla soy milk ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2/3 cup maple syrup ADVERTISEMENT",
            "1/3 cup hemp powder ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 apples, peeled and diced ADVERTISEMENT",
            "1 1/2 cups rolled oats, divided ADVERTISEMENT",
            "1 cup uncooked quinoa ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/4 cup flax seeds ADVERTISEMENT",
            "1 banana, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13-inch baking dish.\nMix almond flour and coconut oil together in a bowl. Add enough water to form a thick dough. Press into the bottom of the baking dish to form a crust.\nBeat eggs in a large bowl until smooth. Add soy milk, milk, maple syrup, hemp powder, cinnamon, and nutmeg; beat until combined. Stir apples, 1 1/4 cup oats, quinoa, pecans, raisins, and flax seeds into the batter.\nSpread banana slices over crust. Pour batter evenly over banana slices. Sprinkle remaining 1/4 cup oats on top.\nBake in the preheated oven until cake is mostly set but retains some moisture, about 1 hour. Let cool to room temperature, about 30 minutes. Cover and chill before serving.\n",
        "picture_link": "9RU5xBRnMdVUVX4AdiDA.Bf.PDriXDO"
    },
    {
        "title": "Pineapple Sticky Ribs",
        "ingredients": [
            "3 pounds pork back ribs, separated and fat trimmed ADVERTISEMENT",
            "1 (12.5 ounce) can pineapple tidbits, drained ADVERTISEMENT",
            "1 cup apricot jam ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Arrange ribs in a single layer in a roasting pan.\nStir pineapple, jam, soy sauce, vinegar, brown sugar, garlic, ginger, salt, black pepper, and cayenne pepper together in a bowl; pour over ribs.\nBake in the preheated oven, basting every 15 minutes, until ribs are glazed and pull away easily from the bone, about 1 1/2 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "VBdG4sbwhc4POPPlT0aA22h5wPdtUnK"
    },
    {
        "title": "Dinner Rolls Made With Healthy Coconut Oil",
        "ingredients": [
            "5 cups bread flour, divided ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "4 (.25 ounce) packages instant yeast ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup coconut oil ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 1/2 cups flour, sugar, yeast, and salt in the bowl of a stand mixer fitted with a paddle attachment.\nHeat milk, water, and 1/3 cup coconut oil in a saucepan until a thermometer inserted into the mixture reads 120 degrees F (49 degrees C), 2 to 3 minutes.\nPour milk mixture over flour; beat together on high speed until combined, about 2 minutes. Stir in remaining 2 1/2 cups flour until a soft, sticky dough forms.\nTurn dough out onto a lightly floured surface and knead until smooth and elastic, about 10 minutes.\nPlace dough in a bowl; cover with a towel and let rise in a warm place until doubled in volume, about 30 minutes.\nGrease 24 muffin cups. Divide dough into 48 equal-sized balls; place 2 balls into each prepared muffin cup. Cover with a towel and let rise in a warm place until doubled in volume, about 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake in the preheated oven until golden brown, about 20 minutes. Brush tops with 1 tablespoon coconut oil.\n",
        "picture_link": "y3pJoDXpdSBNzzrs6riNxY8cA6M/7Rm"
    },
    {
        "title": "Zoodle Vegetable Bake",
        "ingredients": [
            "1/4 cup avocado oil ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "2 zucchini ADVERTISEMENT",
            "1 large head broccoli, broken into florets ADVERTISEMENT",
            "10 mushrooms, stemmed and sliced, or more to taste ADVERTISEMENT",
            "6 mini bell peppers, sliced ADVERTISEMENT",
            "15 leaves basil, or to taste, divided ADVERTISEMENT",
            "1 large tomato, diced ADVERTISEMENT",
            "1/4 cup tomato sauce ADVERTISEMENT",
            "1/2 teaspoon oregano, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "10 slices fresh mozzarella cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking pan with avocado oil.\nMelt butter in a skillet over medium heat, about 2 minutes. Stir in garlic.\nCut zucchini into noodle shapes with a spiralizer.\nCombine zucchini noodles, broccoli, mushrooms, bell peppers, and half of the basil leaves in a large bowl. Stir in butter mixture until well combined.\nPour vegetable mixture into the prepared baking pan; layer on tomatoes. Top with tomato sauce, oregano, salt, and pepper. Arrange remaining basil leaves in the pan; layer on mozzarella cheese. Cover with aluminum foil.\nBake in the preheated oven until cheese is just melted, 20 to 30 minutes. Remove aluminum foil with an oven mitt or heatproof gloves. Continue baking until vegetables are tender and cheese is bubbly, 15 to 30 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Refried Bean Avocado Toast",
        "ingredients": [
            "1 slice whole wheat bread ADVERTISEMENT",
            "1/4 cup canned fat-free refried beans ADVERTISEMENT",
            "1/2 avocado ADVERTISEMENT",
            "1/2 teaspoon lime juice ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "1 dash chili powder ADVERTISEMENT",
            "1 dash ground cumin ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon pico de gallo ADVERTISEMENT",
            "1 teaspoon crumbled queso fresco ADVERTISEMENT",
            "1 dash hot sauce (such as Cholula®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast whole wheat bread until golden brown. Spread refried beans on top.\nMash avocado in a small bowl; stir in lime juice, garlic powder, salt, chili powder, and cumin. Spread avocado over refried beans.\nHeat a small nonstick skillet over medium heat. Crack egg into the skillet; cook until white is set, about 2 minutes. Cover skillet and cook until yolk is set, about 2 minutes more. Place egg over mashed avocado. Garnish with pico de gallo, queso fresco, and hot sauce.\n",
        "picture_link": "hs3al3AsagpMe3LShza008zl06DgH3S"
    },
    {
        "title": "Jumbo Bacon Avocado Horseradish Cheeseburgers",
        "ingredients": [
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon seasoned salt (such as Johnny's®) ADVERTISEMENT",
            "2 pounds ground chuck ADVERTISEMENT",
            "4 teaspoons canola oil ADVERTISEMENT",
            "8 slices Monterey Jack cheese ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "4 Mexican telera rolls, split ADVERTISEMENT",
            "2 avocados, sliced into 1/4-inch wedges ADVERTISEMENT",
            "8 small butter lettuce leaves ADVERTISEMENT",
            "1 beefsteak tomato, cut into 4 thick slices ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "12 strips cooked bacon ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons creamed horseradish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix kosher salt, black pepper, and seasoned salt together in a small bowl to make seasoning mixture.\nShape ground chuck into four 6-inch patties that are 3/4-inch thick. Press your thumb into the center of each patty to make an indentation. Brush 1/2 teaspoon oil over each side. Sprinkle 1/2 teaspoon seasoning mixture over each side.\nPlace seasoned patties on a plate lined with waxed paper and freeze until firm, about 15 minutes.\nFill a barbeque starter chimney with lump charcoal and ignite in an outdoor briquette barbecue grill; heat until charcoal turns white. Spread charcoal evenly on lower grate. Add upper grate, cover grill, and let heat for 5 minutes. Lightly oil the grate.\nGrill patties, covered, until browned, about 5 minutes. Flip and cook until second side is browned, about 4 minutes. Place 2 slices Monterey Jack cheese over each patty; cook until melted, about 1 minute. Transfer patties to a plate and tent with aluminum foil.\nBrush 1 tablespoon melted butter over insides of each roll. Place roll halves buttered-side down on the grill; toast until golden, 30 seconds to 1 minute. Transfer to a flat work surface.\nTop the bottom half of each roll with 1/4 of the avocados, 2 lettuce leaves, 1 tomato slice, 1/4 of the red onion slices, and 3 slices of bacon.\nWhisk mayonnaise and horseradish together in a bowl until smooth. Spread a thin layer of mayonnaise mixture on each burger patty and place over bacon slices. Cover with top halves of rolls.\n",
        "picture_link": "Bm.LpEo0rIFPmkffikMvN1hLSDUJDbq"
    },
    {
        "title": "Bacon Cider Chili",
        "ingredients": [
            "3 slices thick-cut bacon, chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "4 garlic cloves, minced ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon smoked Spanish paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes ADVERTISEMENT",
            "1 1/2 cups hard apple cider (such as Samuel Smith®) ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 (14.5 ounce) can pinto beans, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large pot over medium-high heat; cook until starting to brown, about 5 minutes. Add onion; reduce heat to medium and cook, covered, stirring occasionally, until translucent, about 5 minutes. Stir in garlic; cook until fragrant, about 1 minute.\nIncrease heat to medium-high and add ground beef to the pot; cook and stir until no longer pink, about 5 minutes. Stir in chili powder, smoked paprika, salt, and cayenne pepper; cook for 1 minute.\nPour diced tomatoes, apple cider, tomato sauce, and Worcestershire sauce into the pot. Bring to a boil; reduce heat to medium-low and simmer, covered, until flavors combine, about 30 minutes.\nStir pinto beans into the pot. Simmer, uncovered, until beans are heated through, about 10 minutes.\n",
        "picture_link": "IXDUWET8x17hWSnghujMzFv3cwp069K"
    },
    {
        "title": "Molasses Grilled Peaches",
        "ingredients": [
            "4 peaches, halved and pitted ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nPlace peaches cut-side down on the grill; cook until browned, 4 to 5 minutes. Flip peaches, dust with cinnamon, and fill each half with 1 tablespoon molasses. Cook until browned on the bottom, about 3 minutes.\nLet peaches rest before serving, 3 to 5 minutes.\n",
        "picture_link": "ZtSKZ77DEjDVwePLSqCzGkLbyH/t2v6"
    },
    {
        "title": "Paleo Skillet Chocolate Chip Cookie",
        "ingredients": [
            "2 tablespoons coconut oil, melted ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1 cup coconut sugar ADVERTISEMENT",
            "3 cups almond flour ADVERTISEMENT",
            "1 cup tapioca flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "2 large eggs at room temperature ADVERTISEMENT",
            "1 1/2 teaspoons pure vanilla extract ADVERTISEMENT",
            "2 cups chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Brush a cast iron skillet with melted coconut oil.\nPlace butter into a large mixing bowl; spread with the back of a wooden spoon. Add coconut sugar; mix together with a fork until well incorporated. Pour in almond flour, tapioca flour, baking soda, and sea salt; stir, first with a fork then switch to a wooden spoon, until combined.\nWhisk eggs and vanilla extract together in a bowl until evenly blended. Make a well in the center of the flour mixture. Pour egg mixture into well and stir until dough is combined. Fold in chocolate chips. Pour into skillet; spread evenly with a wooden spoon.\nBake in the preheated oven until golden brown and a toothpick inserted into the center comes out clean, about 30 minutes.\n",
        "picture_link": "P27R.wWlDlhuEdjxIRbzPMTHidaNKby"
    },
    {
        "title": "Kabocha Squash Filled with Shrimp",
        "ingredients": [
            "4 pounds kabocha (Japanese winter squash) ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil, divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 pound medium raw shrimp, peeled and deveined ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 cup cream cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut top off kabocha squash like a lid; reserve. Scoop out seeds and discard. Carve all but 1 inch of the flesh out of the squash.\nMicrowave hollowed kabocha on medium power in 5-minute intervals until tender but not too soft, about 15 minutes.\nHeat 1 tablespoon oil in a saucepan. Add squash flesh; season with salt and pepper. Pour in enough water to cover and cook, uncovered, until squash is soft, about 15 minutes. Drain off most of the water. Puree with an immersion blender until creamy.\nPreheat oven to 325 degrees F (165 degrees C). Line a rimmed baking pan with aluminum foil.\nHeat remaining 1 tablespoon oil in a skillet. Add onion and garlic; cook and stir until softened, about 5 minutes. Add shrimp; season with salt and cayenne pepper; cook until shrimp turns pink, 5 to 6 minutes. Fold in pureed squash.\nSpread most of the cream cheese inside the hollowed squash with a spoon. Ladle shrimp mixture in carefully. Top with remaining cream cheese. Cover with reserved top.\nBake in the preheated oven until heated through, 20 to 25 minutes.\n",
        "picture_link": "25RSlbJkJubxWEadW8paaDpYJw0/elC"
    },
    {
        "title": "Little Ears Pasta with Peas, Mint & Ricotta",
        "ingredients": [
            "1/2 cup ricotta cheese ADVERTISEMENT",
            "1 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "2 tablespoons grated lemon zest, divided ADVERTISEMENT",
            "Salt and pepper, to taste ADVERTISEMENT",
            "1 (16 ounce) package orecchiette pasta ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "4 (4 ounce) Libby's® Sweet Peas Vegetable Cups ADVERTISEMENT",
            "2 tablespoons chopped fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ricotta, 1/2 cup Parmesan and 1 tablespoon lemon zest in a small bowl. Season mixture with salt and pepper.\nMeanwhile, bring medium pot of generously salted water to boil. Add pasta and cook according to package directions until al dente. Drain pasta and reserve 1 cup of water.\nHeat butter in skillet over medium heat. Drain peas and cook 1 to 2 minutes. Add pasta to peas and cook for 1 minute.\nPour pasta and peas into large bowl. Mix in ricotta mixture and 1/4 cup of pasta water.\nStir until ricotta is evenly incorporated with pasta. If it is too dry, add reserved water. Add remaining Parmesan cheese and lemon zest and remove from heat.\nAdd chopped mint and additional pepper.\n",
        "picture_link": "7NR78t4vAmG58vC9WHdqH2xAXy3wmRy"
    },
    {
        "title": "Homemade Spinach Pasta",
        "ingredients": [
            "3 ounces spinach ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons extra-virgin olive oil ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "2 cups all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and ice in a bowl. Preheat a skillet over medium heat; add spinach. Cook, stirring continuously, until spinach turns bright green, about 30 seconds. Plunge into ice water bath; remove when spinach is lukewarm. Squeeze out excess moisture with cheese cloth.\nCombine spinach, eggs, olive oil, and salt in a food processor; blend until smooth. Add flour; blend until dough no longer sticks to the blades, adding flour as needed.\nRoll dough into a ball; wrap in plastic wrap. Rest at room temperature for 20 minutes.\nRemove plastic wrap from dough. Transfer to a work surface generously dusted with flour; cut dough into 4 pieces with a sharp knife. Roll out dough with a rolling pin to 1/4-inch thickness; shape into rectangles.\nDust pasta maker rollers with flour. Run the dough rectangles through a pasta maker on the widest setting. Repeat rolling dough through rollers, gradually reducing the setting to desired thickness. Change pasta maker's attachment to preferred noodle shape; cut pasta with pasta maker.\nBring a large pot of water to a boil. Lower pasta gently into water; use a spoon to keep noodles from sticking together. Cook until pasta is firm but soft, 3 to 6 minutes. Remove from the water with tongs; transfer to a bowl.\n",
        "picture_link": "IuCZqa/3RR3vvvSec.OnIanDDGfgT1e"
    },
    {
        "title": "Soft Milk Chocolate Chip Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 cups milk chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter, white sugar, brown sugar, eggs, and vanilla extract in a bowl with an electric mixer until light and fluffy.\nMix flour, salt, and baking powder together in a bowl. Stir the flour mixture slowly into the butter mixture until well combined; fold in chocolate chips. Place spoonfuls of dough onto a nonstick baking sheet about 2 inches apart.\nBake in the preheated oven until tops are golden brown, about 10 minutes.\n",
        "picture_link": "GJUF4NVJTxX3QEqI3EvEsRRMTc7qZ2C"
    },
    {
        "title": "Becky's Gluten-Free Slow Cooker Chicken Vegetable Soup",
        "ingredients": [
            "1 (32 ounce) carton gluten-free chicken broth ADVERTISEMENT",
            "1 pound skinless, boneless chicken thighs ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 teaspoon dried basil leaves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes (optional) ADVERTISEMENT",
            "1 cup frozen mixed vegetables ADVERTISEMENT",
            "1/4 cup uncooked long-grain rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, chicken thighs, diced tomatoes, onion, carrots, water, celery, garlic, basil leaves, salt, pepper, and red pepper flakes in a slow cooker. Stir well and cover.\nCook on Low until chicken is tender and flavors combine, about 7 hours. Stir to break up chicken. Add frozen vegetables and rice. Cover and cook on High until rice is tender, about 1 hour.\n",
        "picture_link": "dnw1.l9jS6OLTqWYdjCqtGdHDAHZpGa"
    },
    {
        "title": "Cheesy Tex Mex Chicken Penne",
        "ingredients": [
            "3 cups penne pasta, uncooked ADVERTISEMENT",
            "1 pound boneless skinless chicken breasts, cut into bite-size pieces ADVERTISEMENT",
            "1 1/4 cups salsa ADVERTISEMENT",
            "1 large green pepper, cut into thin strips ADVERTISEMENT",
            "1 cup frozen corn ADVERTISEMENT",
            "2 cups CRACKER BARREL Shredded Tex Mex Cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta as directed on package, omitting salt.\nMeanwhile, cook chicken in large nonstick skillet on medium-high heat 2 min. Add salsa, peppers and corn; stir. Bring to boil; simmer on medium-low heat 10 min. or until chicken is done, stirring occasionally.\nDrain pasta. Add to chicken mixture; mix lightly. Sprinkle with cheese. Remove from heat; cover. Let stand 1 min. or until cheese is melted.\n",
        "picture_link": "q3zBEwdzkj/F6JCkdiGzwEHWRHjoo3i"
    },
    {
        "title": "Nigerian Suya",
        "ingredients": [
            "1 tablespoon finely ground roasted peanuts ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1 1/2 pounds beef tri-tip steak, cut into bite-size pieces ADVERTISEMENT",
            "1 red bell pepper, cut into bite-size pieces ADVERTISEMENT",
            "1/4 onion, cut into bite-size pieces ADVERTISEMENT",
            "4 mushrooms, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground peanuts, cayenne pepper, paprika, salt, ginger, garlic powder, and onion powder together in a bowl.\nCombine spice mixture and beef in a resealable plastic bag; shake until well coated. Marinate in the refrigerator, about 30 minutes.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nPlace beef, bell pepper, onion, and mushrooms in alternating order onto skewers.\nCook on the preheated grill, flipping once, until meat is browned and vegetables are soft, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Better than Cracker Barrel® Chicken 'n Dumplings",
        "ingredients": [
            "1 whole chicken ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 lemon, halved ADVERTISEMENT",
            "2 stalks celery, sliced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 carrots, sliced, or more to taste ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken and 1 pinch salt in a large pot; cover with water. Bring to a boil, skimming any scum off the surface with a slotted spoon. Add lemon, celery, onion, and carrots. Simmer broth over medium heat until chicken starts to fall off the bone, about 1 hour.\nDiscard lemon. Remove chicken from the pot; let cool.\nPlace flour, salt, and pepper in a large bowl. Make a well in the center. Ladle in 2 to 3 scoops of hot broth. Mix in flour with a spoon until dough comes together into a ball.\nTurn dough out onto a floured surface. Knead carefully until smooth. Roll out into a large rectangle; cut into small rectangular dumplings.\nDrop dumplings one at a time into the simmering broth. Cook, stirring occasionally, until tender, about 30 minutes.\nBone chicken and chop into pieces. Add to the pot; cook until heated through, about 5 minutes.\n",
        "picture_link": "NVusjpKs5AM3mQc8dEcifX9QzvPrDRa"
    },
    {
        "title": "Simple Meatballs with Zoodles",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/4 white onion, chopped ADVERTISEMENT",
            "1 1/2 teaspoons garlic salt ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 zucchini ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 tablespoon oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine ground beef, onion, garlic salt, salt, and pepper in a bowl; mix well. Shape into 1 1/2-inch balls. Arrange meatballs in a glass baking pan.\nBake in the preheated oven until meatballs are browned, about 20 minutes.\nCut zucchini into noodle shapes with a spiralizer.\nHeat tomato sauce in a saucepan over medium heat; add meatballs. Reduce heat to low. Cook, covered, until sauce and meatballs are evenly warmed, about 5 minutes. Remove from heat; keep covered.\nHeat oil in a skillet over medium heat. Add zucchini, salt, and pepper; cook and stir until tender but firm to the bite, about 5 minutes. Transfer zucchini to a serving plate; top with tomato sauce and meatballs.\n",
        "picture_link": "0UhZdBahN9W7JliQbrh7jN7gAL5Nhi."
    },
    {
        "title": "Savory Oregano Salami",
        "ingredients": [
            "1 pound salami, cut into bite-size pieces ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese, or more to taste ADVERTISEMENT",
            "1 1/2 teaspoons chopped oregano ADVERTISEMENT",
            "4 sprigs parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place salami in a grill pan or skillet over medium-high heat. Drizzle with olive oil; season with salt and pepper. Cook until grill marks appear, 5 to 7 minutes. Flip; cook until second side is browned, 5 to 7 minutes.\nPlace salami in a small bowl; mix in Parmesan cheese and oregano. Garnish with parsley.\n",
        "picture_link": "yPkd47Ddw1g6tzlsb7JEbjbol8vCmNm"
    },
    {
        "title": "Chin Chin",
        "ingredients": [
            "8 cups all-purpose flour ADVERTISEMENT",
            "1 cup butter, at room temperature ADVERTISEMENT",
            "3 tablespoons butter, at room temperature ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, 1 cup plus 3 tablespoons butter, and nutmeg together in a large bowl until well incorporated. Stir in 1/2 cup plus 2 tablespoons milk until dough comes together.\nRoll dough 1/4-inch thick on a floured work surface and cut into small pieces.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry dough pieces in batches until they turn golden brown and float to the surface, 3 to 5 minutes.\n",
        "picture_link": "4G79JDtl0gQNSNwEGpIbDMQ5QqR5XqK"
    },
    {
        "title": "Chicken Zoodle Pho",
        "ingredients": [
            "10 cups vegetable broth ADVERTISEMENT",
            "12 ounces boneless chicken breasts ADVERTISEMENT",
            "1 1/2 cups sliced white onion, separated into rings ADVERTISEMENT",
            "2 tablespoons oyster sauce ADVERTISEMENT",
            "1 1/2 teaspoons coconut sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "1/2 teaspoon minced ginger ADVERTISEMENT",
            "2 whole star anise pods ADVERTISEMENT",
            "9 cups bean sprouts ADVERTISEMENT",
            "6 cups coarsely chopped bok choy cabbage ADVERTISEMENT",
            "4 zucchini ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vegetable broth, chicken breasts, onions, oyster sauce, coconut sugar, salt, pepper, cloves, ginger, and star anise in a slow cooker.\nCook on High until chicken breasts can be easily flaked with a fork, about 1 1/2 hour. Stir in bean sprouts and bok choy. Continue cooking soup until bean sprouts are tender, about 1 hour.\nCut zucchini into thin noodles using a spiralizer.\nDivide soup among 6 serving bowls. Top with zucchini noodles.\n",
        "picture_link": "Qx1st8hLDdzbYbmjB3OEiGTfWycR/tW"
    },
    {
        "title": "Pancake Poppers",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1/4 cup vinegar ADVERTISEMENT",
            "1/4 cup oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray 2 mini muffin tins with cooking spray.\nMix milk and vinegar together in a bowl; let stand until milk curdles, about 5 minutes. Beat in oil and egg.\nCombine flour, sugar, baking powder, baking soda, and salt in a bowl; stir into milk mixture until smooth. Spoon batter into the prepared muffin tins with a tablespoon or a small batter scoop.\nBake in the preheated oven until batter is risen and still pale, about 8 minutes. Remove from muffin cups with a silicone scraper.\n",
        "picture_link": "iflCaRJOKOLhLPsK5nBKchhoLK4fZIm"
    },
    {
        "title": "Spiralized Roasted Vanilla Sweet Potatoes and Apples",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/3 vanilla bean ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 large sweet potato, peeled and halved ADVERTISEMENT",
            "1 large Red Delicious apple, unpeeled ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil; spray with nonstick spray.\nSplit vanilla bean lengthwise with the tip of a sharp knife. Holding the pod open, scrape seeds from each half using the flat side of your knife.\nCombine vanilla bean, scraped seeds, and olive oil in a small saucepan over very low heat. Warm the oil until fragrant, about 5 minutes. Remove from heat and let cool, about 5 minutes.\nCut sweet potato and apple into noodles using a spiralizer. Place in a large bowl.\nWhisk 2 tablespoons olive oil, brown sugar, cinnamon, salt, nutmeg, and ginger together in a small bowl. Drizzle over sweet potato and apple; toss well to coat.\nSpread sweet potato and apple in an even layer on the prepared baking sheet.\nBake in the preheated oven, turning once, until golden, about 10 minutes. Increase oven temperature to 425 degrees F (218 degrees C). Roast until ends of sweet potato start to brown and toast, 5 to 10 minutes more.\n",
        "picture_link": "LQyTzi5gvQpjVhPI8kwlSuS7yKcfJBW"
    },
    {
        "title": "Strawberry Goat Cheese Pretzel Bites",
        "ingredients": [
            "16 thin pretzel crackers (such as Snack Factory® Pretzel Crisps®) ADVERTISEMENT",
            "1 (4 ounce) log goat cheese ADVERTISEMENT",
            "2 tablespoons balsamic glaze, or to taste, divided ADVERTISEMENT",
            "1/2 cup sliced fresh strawberries ADVERTISEMENT",
            "4 leaves fresh basil, cut into strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange pretzel crackers on a serving platter. Spread goat cheese over crackers. Drizzle half of the balsamic glaze on top. Place 3 sliced strawberries on each cracker; scatter basil over strawberries. Drizzle remaining balsamic glaze on top.\n",
        "picture_link": "YqjZccXLNZp0dKEfpLwCvrGEA2FLA5i"
    },
    {
        "title": "Fabulous Gluten-Free Fried Pork Chops",
        "ingredients": [
            "1/2 cup coconut flour ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 tablespoon granulated garlic ADVERTISEMENT",
            "1 tablespoon ground paprika ADVERTISEMENT",
            "1 tablespoon flaxseed meal ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 1/2 pounds bone-in center-cut pork chops ADVERTISEMENT",
            "2 tablespoons coconut oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix coconut flour, cornstarch, granulated garlic, paprika, flaxseed meal, parsley, baking powder, sugar, onion powder, salt, and pepper together in a shallow bowl.\nDredge pork chops in the coconut flour mixture until coated on both sides.\nHeat coconut oil in a large skillet over medium-high heat until melted. Cook pork chops, covered, until browned, about 5 minutes. Flip and continue cooking until browned on the second side, about 3 minutes more.\n",
        "picture_link": "PiPXnSpw5YAUcQnIfibr9/gmbdwb55u"
    },
    {
        "title": "Apricot Date Smoothie",
        "ingredients": [
            "2 peeled bananas, frozen ADVERTISEMENT",
            "3 apricots - halved, pitted, and frozen ADVERTISEMENT",
            "5 dates, pitted and frozen ADVERTISEMENT",
            "1 cup unsweetened almond milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Break bananas into pieces; place into blender. Add apricots and dates; pour in almond milk. Blend until smooth.\n",
        "picture_link": "e1Cc2J89RrX0mHy5PjTnDIovcFwqlXu"
    },
    {
        "title": "Chef John's Lemon Ice",
        "ingredients": [
            "4 cups cold water ADVERTISEMENT",
            "7/8 cup white sugar ADVERTISEMENT",
            "2 tablespoons lemon zest ADVERTISEMENT",
            "1 cup freshly squeezed lemon juice ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve sugar in water in a pot over medium heat, whisking while water heats up. As soon as sugar dissolves and water is clear, remove pan from heat. While water is still warm, add lemon zest. Allow to cool to room temperature before adding lemon juice.\nWhisk in lemon juice and lemon extract. Pour into a baking pan about 9x13 inches. Place in freezer until ice starts to form around the edges, about 40 to 45 minutes. Use a fork to stir up ice. Do this every 20 to 30 minutes until lemon ice reaches your preferred texture, 2 1/2 to 3 hours.\n",
        "picture_link": "LoqjJANwTvbbwPbO1BW0XkjLd5CmD9C"
    },
    {
        "title": "Hatch Chile Dirty Rice",
        "ingredients": [
            "1 pound mild Hatch chile peppers - halved, stemmed, and seeded ADVERTISEMENT",
            "1 pound mild breakfast sausage ADVERTISEMENT",
            "1/2 pound bacon, sliced into small strips ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "1 1/2 cups uncooked jasmine rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil; arrange chile peppers cut-side down on top.\nRoast under the preheated broiler until the skin of the peppers has blackened and blistered, 5 to 8 minutes.\nPlace blackened peppers into a bowl and seal tightly with plastic wrap. Allow peppers to steam as they cool, about 20 minutes. Remove and discard skins. Chop flesh.\nHeat a large skillet over medium heat. Add sausage and bacon; cook and stir until browned, 5 to 8 minutes. Drain excess grease. Add onion; cook and stir until golden, 3 to 5 minutes.\nPour water into the skillet; bring to a boil. Add rice. Reduce heat; simmer until water is absorbed and rice is tender, 15 to 20 minutes. Fluff with a fork. Fold in chopped peppers before serving.\n",
        "picture_link": "W/cJFIKnNPRp4zcL494YQmZR1rIMuVO"
    },
    {
        "title": "Chicago Hot Dog-Style Salmon",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "4 (6 ounce) salmon fillets ADVERTISEMENT",
            "1/4 lemon, juiced, or more to taste ADVERTISEMENT",
            "2 teaspoons dried dill weed ADVERTISEMENT",
            "1/4 cup Dijon mustard ADVERTISEMENT",
            "2 large dill pickles, diced ADVERTISEMENT",
            "1/2 white onion, diced ADVERTISEMENT",
            "1 tomato, seeded and diced ADVERTISEMENT",
            "4 sport peppers, chopped, or to taste (optional) ADVERTISEMENT",
            "1 dash celery seed, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nSpray four 6x6-inch pieces of aluminum foil with cooking spray. Place salmon fillets on top.\nDrizzle lemon juice over salmon fillets; sprinkle 1/2 teaspoon of dill weed over each one. Spread 1 tablespoon mustard onto each salmon fillet; top with dill pickle and onion. Wrap aluminum foil around salmon, sealing the edges. Place packets onto a baking sheet.\nBake in preheated oven until fish flakes easily with a fork, about 15 minutes.\nPlace packets in shallow bowls; open with heatproof gloves. Top with diced tomatoes and sport peppers; season with celery seed.\n",
        "picture_link": "8yvLJA4Kv6UMAFLADHbp6sh0TC9FYaC"
    },
    {
        "title": "Paleo Blueberry Cast Iron Pancake",
        "ingredients": [
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "8 eggs, room temperature ADVERTISEMENT",
            "1 cup unsweetened vanilla-flavored almond milk ADVERTISEMENT",
            "1/2 cup tapioca flour ADVERTISEMENT",
            "2 tablespoons coconut flour ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "2 tablespoons maple syrup, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace butter in a cast iron skillet. Place skillet in the preheating oven until butter melts, about 5 minutes.\nCombine eggs and milk in a bowl; whisk until combined. Whisk in tapioca flour, coconut flour, lemon juice, lemon zest, and sea salt until combined. Fold blueberries into the batter.\nRemove skillet from oven using a pot holder or kitchen towel. Spread melted butter with a pastry brush to coat skillet evenly; pour in batter.\nBake in the preheated oven until middle is firm and top is golden brown, 18 to 20 minutes. Slice and drizzle with maple syrup.\n",
        "picture_link": "Ok/cuV7NkWnTINHxT6cipbvHpq4tRJi"
    },
    {
        "title": "Summer Crunch Smoothie",
        "ingredients": [
            "1 cup frozen mixed fruit ADVERTISEMENT",
            "1/2 cup pomegranate seeds ADVERTISEMENT",
            "1 cup lukewarm water ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/4 cup vanilla yogurt ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine frozen fruit and pomegranate seeds in a blender. Add water, orange juice, vanilla yogurt, and milk; blend until smooth, about 2 minutes.\n",
        "picture_link": "tRB9UnZC2mpS1LOpoQp3mpSpnQPy6Uy"
    },
    {
        "title": "Mac 'n Cheese Bites",
        "ingredients": [
            "2 teaspoons butter ADVERTISEMENT",
            "1 cup cooked macaroni ADVERTISEMENT",
            "2 slices American cheese, diced ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "16 thin pretzel crackers (such as Snack Factory® Pretzel Crisps®) ADVERTISEMENT",
            "1 (4 ounce) precooked smoked sausage, cut into sixteen 1/4-inch slices ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium-low heat. Add macaroni and American cheese; stir until cheese is mostly melted, about 2 minutes. Reduce heat to low; mix in milk.\nSet oven rack about 6 inches from the heat source and preheat the oven on the low broil setting. Line a baking sheet with parchment paper.\nSpread pretzels crackers on the prepared baking sheet; top each with a slice of sausage. Spoon 1 tablespoon macaroni and cheese mixture over sausage. Sprinkle black pepper on top.\nBake under the preheated broiler until American cheese and pretzels start to brown, 1 to 2 minutes.\n",
        "picture_link": "9P.W76otve9KCIz.gK2xkxmcR0S/BIu"
    },
    {
        "title": "Uncle Bill's Hot Water Cornbread",
        "ingredients": [
            "3 tablespoons oil ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup yellow cornmeal ADVERTISEMENT",
            "1 dash seasoned salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a cast iron skillet over medium heat. Bring water to a boil in a saucepan.\nPlace cornmeal in a bowl. Slowly pour boiling water into the cornmeal; stir until smooth. Mix seasoned salt into the batter.\nDrop batter with a spoon into the hot oil. Fry until edges are brown, about 5 minutes; flip over bread. Flatten with spatula; fry until bread is cooked through and edges are brown, about 5 minutes. Drain on a paper towel.\n",
        "picture_link": "/429/hH9xbOC0JRKzugKyM0TK/AQ9HO"
    },
    {
        "title": "Apple-Cranberry Tart",
        "ingredients": [
            "1/4 cup dried cranberries ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "2 Granny Smith apples, peeled ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 (9 inch) prepared pie crust ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "1 tablespoon turbinado sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cranberries in a small bowl. Cover with boiling water. Let soak until plump, about 15 minutes. Drain.\nPreheat oven to 350 degrees F (175 degrees C). Grease a baking sheet lightly with cooking spray.\nCut a deep vertical slice into both sides of each apple, being sure not to cut through to the core. Attach 1 apple to a spiralizer fitted with the straight-flat blade and cut into thin half-slices. Repeat with second apple.\nCombine cranberries, apple slices, lemon juice, and vanilla extract in a bowl; toss to coat.\nMix white sugar, cornstarch, cinnamon, nutmeg, and salt together in a bowl. Stir into the apple mixture.\nRoll pie crust out into a 10-inch round on a floured work surface. Transfer to the baking sheet.\nSpoon apple mixture into the center of the crust, leaving a 2-inch border. Lift up edges of crust and fold around apple mixture. Brush edges with egg white. Sprinkle turbinado sugar all over tart.\nBake in the preheated oven until apples are tender and crust is golden brown, 38 to 40 minutes. Transfer to a serving plate and slice.\n",
        "picture_link": "vkXdIIDdFQT662s8RXXW9Xsb6LHsKYG"
    },
    {
        "title": "Keto Avocado Dessert",
        "ingredients": [
            "1 ripe avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "1/2 teaspoon liquid stevia ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash avocado in a bowl. Add heavy cream, stevia, vanilla, and cinnamon; mix thoroughly.\nRefrigerate avocado mixture for 1 hour before serving.\n",
        "picture_link": "3ZLM8x5T05be52fq9HTHmVboT0Zakg6"
    },
    {
        "title": "Spiced Peanut Butter Apples",
        "ingredients": [
            "4 Granny Smith apples ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "6 tablespoons peanut butter ADVERTISEMENT",
            "1/8 teaspoon ground cardamom ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSlice tops off apples with a sharp knife. Core apples with an apple corer, leaving the bottoms intact.\nSplash vanilla extract into the cored apples; spoon 1 1/2 tablespoons of peanut butter into each one. Place apples in a baking pan; sprinkle with cardamom and cloves.\nBake in the preheated oven until apples are softened and fragrant, about 30 minutes.\n",
        "picture_link": "4hozRxpzMrexfplWctCMdxL.G.qivae"
    },
    {
        "title": "Caramel Pecan Sticky Buns",
        "ingredients": [
            "Prepared wheat bread dough ADVERTISEMENT",
            "Caramel Pecan Topping: ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup firmly packed brown sugar ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/4 cups chopped pecans ADVERTISEMENT",
            "Cinnamon Filling: ADVERTISEMENT",
            "3/4 cup firmly packed brown sugar ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "3 tablespoons White Lily® All Purpose Wheat Flour ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare bread dough according to recipe directions. Place in large greased bowl. Cover and let rise in warm place until doubled in size, about 30 to 45 minutes (see Note).\nFor Caramel Pecan Topping: Melt 1 cup butter in medium saucepan over medium heat. Add 1 cup brown sugar and corn syrup; stir until smooth. Remove from heat. Stir in vanilla. Spread evenly in 13 x 9-inch baking pan. Sprinkle evenly with pecans.\nFor Cinnamon Filling: Mix 3/4 cup brown sugar, 6 tablespoons butter, flour and cinnamon in small bowl with fork until blended. Roll dough to 16 x 10-inch rectangle on lightly floured surface. Crumble filling mixture evenly over dough. Beginning at long side, roll up tightly, pressing seam to seal. Cut evenly into 15 slices. Place cut side down in prepared pan. Cover loosely with plastic wrap. Let rise in warm place (80 degrees to 90 degrees F) 30 to 45 minutes or until doubled in size.\nHeat oven to 350 degrees F. Bake buns 30 to 35 minutes or until golden brown. Cool 10 minutes to allow caramel to thicken. Invert onto serving plate. Serve warm or at room temperature.\n",
        "picture_link": "jQR4L4jmuspUuYo0DzZkdN4P6EFwKDy"
    },
    {
        "title": "Baked Mexican Chips on a Stick",
        "ingredients": [
            "nonfat cooking spray ADVERTISEMENT",
            "2 russet potatoes, unpeeled ADVERTISEMENT",
            "2 teaspoons taco seasoning mix, or to taste ADVERTISEMENT",
            "6 bamboo skewers ADVERTISEMENT",
            "2 teaspoons sriracha sauce, or to taste ADVERTISEMENT",
            "1 pinch sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil and grease with cooking spray.\nSlice each potato into long spirals using a spiralizer fitted with the straight-flat blade. Cut each spiral into 3 shorter pieces.\nThread a skewer through the middle of each potato spiral. Gently push down to fan out spiral.\nSet skewers on the prepared baking sheet; spray generously with cooking spray. Sprinkle taco seasoning on top.\nRoast in the preheated oven until browned and crisp, 17 to 18 minutes. Season with sriracha sauce and sea salt.\n",
        "picture_link": "N.TJNHJ8QKMK0k6fXOWnWa9ykR2rjGa"
    },
    {
        "title": "Sri Lankan Potato & Cashew Curry",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, peeled and chopped ADVERTISEMENT",
            "1 tablespoon mustard seed ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "6 red potatoes, chopped ADVERTISEMENT",
            "1 cup vegetable stock ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/4 cup cashews ADVERTISEMENT",
            "1 tablespoon chopped cashews, for garnish ADVERTISEMENT",
            "Chopped fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute onions, garlic, and ginger in olive oil for 15 minutes or so. Then add in mustard seeds, green pepper and potatoes and saute a couple minutes. Add in vegetable stock, coconut milk and spices and let simmer for 20 minutes. Then, add in cashews and let cook another five minutes.\nGarnish with parsley and cashews - enjoy with rice or naan.\n",
        "picture_link": "EC97rlHa66m53BeCaTCTGbUWY6UACiW"
    },
    {
        "title": "California Bounty Beef and Vegetable Noodles",
        "ingredients": [
            "1/2 pound beef sirloin steak ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "2 Mexican squash ADVERTISEMENT",
            "1/3 large carrot ADVERTISEMENT",
            "2 radishes ADVERTISEMENT",
            "1/2 avocado, diced ADVERTISEMENT",
            "1/2 cup grape tomatoes, halved ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "1/2 cup sour cream (optional) ADVERTISEMENT",
            "1 tablespoon sriracha sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season steak with garlic salt and black pepper.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Add steak; cook until browned, 4 to 5 minutes per side. Transfer steak to a cutting board and let rest, about 5 minutes. Slice into thin strips.\nCut Mexican squash, carrot, and radishes into noodles using a spiralizer.\nHeat remaining 2 tablespoons oil in the skillet over medium heat. Add carrot noodles; cook and stir until lightly browned, about 3 minutes. Add squash noodles; cook, stirring constantly, until tender, about 5 minutes.\nDivide carrot and squash noodle mixture between 2 serving plates. Top with sliced steak. Garnish with radish noodles, avocado, grape tomatoes, and cilantro.\nWhisk sour cream and sriracha sauce together in a small bowl. Drizzle over serving plates.\n",
        "picture_link": "8J4WNmKwPX32uzCHpx4vk2ht21ksCBi"
    },
    {
        "title": "Arizona Cactus and Beans",
        "ingredients": [
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "2 potatoes, cut into small rectangles ADVERTISEMENT",
            "1 cup shredded carrots ADVERTISEMENT",
            "2 1/2 (15 ounce) jars nopalitos cactus, drained ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons fenugreek seeds ADVERTISEMENT",
            "2 teaspoons ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 (15 ounce) can pinto beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat. Add potatoes and carrots; cook and stir until potatoes are tender, about 10 minutes.\nStir cactus, chili powder, garlic, fenugreek seeds, coriander, and cumin into the potato mixture. Cook, stirring frequently, until cactus is softened, about 5 minutes. Add pinto beans; cook, stirring gently, until just heated through, about 3 minutes.\n",
        "picture_link": ".SPjU3FRkqn28Zr7udeaD8UE9FHVUYS"
    },
    {
        "title": "Sweet Potato Quinoa Bake",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "4 sweet potatoes, peeled and cubed ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 (8 ounce) jar pesto ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nHeat water in a small saucepan over high heat until hot but not boiling; reduce heat to medium-low. Whisk in flour until thickened. Add milk; whisk until flour mixture is thick.\nCombine sweet potatoes, green onions, pesto, quinoa, mushrooms, salt, and pepper in a large bowl. Pour in flour mixture; stir until well combined. Transfer to a 9x13-inch casserole dish; top with Cheddar cheese.\nBake in the preheated oven until bubbly and sweet potatoes are cooked through, about 50 minutes.\n",
        "picture_link": "X83oaSI./gD0o.j8FZiJe.5/mVTe9R."
    },
    {
        "title": "Quick and Easy Apple Pie Cookies",
        "ingredients": [
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "6 tart apples, grated, or more to taste ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSift flour, cornstarch, baking soda, and baking powder together in a bowl.\nMix brown sugar and egg together in a bowl; stir in apples, cinnamon, and cloves. Blend softened butter into the apple mixture with a fork. Slowly stir flower mixture into the apple mixture until combined. Spoon batter onto a baking sheet.\nBake in the preheated oven until lightly brown, about 12 minutes.\n",
        "picture_link": "iqYhF0wq0LG3LQBfD3VpLaJEOHh1q6a"
    },
    {
        "title": "Blackberry Pomegranate Quinoa Parfait",
        "ingredients": [
            "1/2 cup Santa Cruz Organic® Blackberry Pomegranate Fruit Spread ADVERTISEMENT",
            "1 tablespoon truRoots® Organic Chia Seeds ADVERTISEMENT",
            "1 (6 ounce) container fresh blackberries ADVERTISEMENT",
            "1 (6 ounce) container fresh raspberries ADVERTISEMENT",
            "1 cup cooked truRoots® Accents® Organic Sprouted Quinoa Trio ADVERTISEMENT",
            "1 1/3 cups vanilla Greek yogurt ADVERTISEMENT",
            "1/2 teaspoon grated fresh lemon peel ADVERTISEMENT",
            "4 lemon slices, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine fruit spread and chia seeds in medium bowl. Stir in berries and quinoa. Combine yogurt and lemon peel in small bowl.\nDivide half of quinoa mixture evenly into 4 parfait glasses. Reserve 2 tablespoons yogurt for garnish. Top quinoa mixture with 1/3 cup yogurt. Divide and spoon remaining quinoa mixture over yogurt. Top with dollop of yogurt and lemon slice. Chill.\n",
        "picture_link": "O8K4QkF8zEUN0pYFrBop0Bqc/pYyDRC"
    },
    {
        "title": "Vegan Mashed Potatoes (Low-Fat)",
        "ingredients": [
            "6 baby red potatoes, halved, or more to taste ADVERTISEMENT",
            "1/4 cup unsweetened almond milk, or more to taste ADVERTISEMENT",
            "1/2 lemon, juiced, or more to taste ADVERTISEMENT",
            "1 tablespoon soy-free buttery spread (such as Earth Balance®), melted, or more to taste ADVERTISEMENT",
            "1 teaspoon minced garlic, or more to taste ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add potatoes. Reduce heat to medium-low and simmer until potatoes fall apart with pierced with a fork, about 15 minutes. Drain.\nPlace potatoes in a deep bowl; mix lightly. Add almond milk, lemon juice, buttery spread, garlic, and salt. Mash to desired consistency.\n",
        "picture_link": ".A5s54ftcarPlsYXIceibykVLnD8whO"
    },
    {
        "title": "Cheese and Vegetable Noodle Medley",
        "ingredients": [
            "2 tablespoons garlic-infused olive oil ADVERTISEMENT",
            "1 Mexican squash, cut into noodle shapes ADVERTISEMENT",
            "1 yellow squash, cut into noodle shapes ADVERTISEMENT",
            "3 broccoli stems, cut into 3-inch noodle shapes ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 Fresno chile peppers, sliced into rounds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat; add Mexican squash, yellow squash, broccoli stems, garlic salt, and pepper. Cook, stirring constantly, until vegetables are tender but still firm to the bite, about 5 minutes.\nMix in Cheddar cheese; cook and stir until melted, 3 to 5 minutes. Transfer to a serving plate; garnish with Fresno chile peppers.\n",
        "picture_link": "BEM6KtcrMjVADHv.PES.u2pVICAsq9y"
    },
    {
        "title": "Low-Fat Whole Wheat Cranberry Pecan Scones ",
        "ingredients": [
            "2 cups whole wheat pastry flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup skim milk, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.\nWhisk whole wheat flour, brown sugar, baking powder, baking soda, and salt together in a large bowl. Cut in butter with a pastry blender until coarse crumbs form. Stir in cranberries and pecans. Mix in skim milk until dough comes together and is the consistency of cookie dough.\nTurn dough out onto a lightly floured surface. Pat into a 1-inch thick round. Cut into 8 wedges with a greased knife. Arrange 2 inches apart on the baking sheet.\nBake in the preheated oven until golden brown, 12 to 15 minutes. Transfer to a wire rack to cool, about 15 minutes.\n",
        "picture_link": "2VNhykX.qiTGR2LdQtwus4l/y4jvbta"
    },
    {
        "title": "Dirty Sauce",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mayonnaise, sour cream, salt, and pepper together in a small saucepan over low heat; cook and stir until warm, about 3 minutes.\n",
        "picture_link": "xP4WNfbpSo86vyee95hW4TLWSmZeF0i"
    },
    {
        "title": "Apple Pie Cookies ",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "6 ounces cream cheese, softened ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "5 teaspoons white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (15.25 ounce) can apple pie filling, or as needed ADVERTISEMENT",
            "2 tablespoons sugar, or to taste ADVERTISEMENT",
            "1 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.\nBeat butter, cream cheese, and vanilla extract together in a large bowl until smooth. Add flour, 5 teaspoons sugar, baking powder, and 1 teaspoon cinnamon; mix until dough comes together.\nRoll dough into a 1/4-inch thick round on a floured work surface. Cut out 48 circles with a cookie cutter.\nTop 24 dough circles with a teaspoon of apple pie filling. Cover with remaining 24 dough circles. Crimp edges with a fork to seal. Arrange cookies on lined baking sheets.\nBake in the preheated oven until cookies are golden brown, 23 to 29 minutes. Cool for 5 minutes.\nMix 2 tablespoons sugar and 1 teaspoon cinnamon together in a shallow bowl. Roll warm cookies in sugar and cinnamon mixture until coated. Transfer to a wire rack to cool, about 10 minutes.\n",
        "picture_link": "Xei2RFAh1h4WHHjLQN41eNECiaJlUBC"
    },
    {
        "title": "Potato Breakfast Tacos",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "5 potatoes, peeled and shredded ADVERTISEMENT",
            "1 (12 ounce) can lite luncheon meat (such as Spam®), diced ADVERTISEMENT",
            "1/2 (15 ounce) can tomato sauce ADVERTISEMENT",
            "8 (8 inch) flour tortillas, or more if needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Add garlic powder, onion powder, chili powder, ground cumin, and red pepper flakes; stir until mixed. Add potatoes; cook and stir until softened, about 12 minutes.\nStir luncheon meat into the potato mixture; cook and stir until lightly browned, about 5 minutes. Stir in tomato sauce. Remove from heat.\nHeat tortillas in a toaster oven or conventional oven on warm setting until warmed, about 2 minutes.\nPlace large spoonfuls of the potato mixture into warmed tortillas; season with salt and pepper.\n",
        "picture_link": "XDVh6.qDF93Er7Yulvm717p0wNVQNvO"
    },
    {
        "title": "Lemon Crinkles ",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix brown sugar, shortening, egg, and lemon zest together in a bowl until creamy. Stir in flour, baking soda, cream of tartar, ginger, and salt until dough comes together.\nPour white sugar onto a plate. Roll dough into 1-inch balls; dip 1 side in white sugar. Arrange balls, sugared-side up, on 2 baking sheets.\nBake in the preheated oven until edges are pale golden and tops look dry, 10 to 12 minutes.\n",
        "picture_link": "6p0hHqEsOMAwGM30s5E4qMH7lcZvpvK"
    },
    {
        "title": "Rainbow Roasted Potato Salad",
        "ingredients": [
            "2 red potatoes, cut into 1-inch pieces ADVERTISEMENT",
            "2 purple potatoes, cut into 1-inch pieces ADVERTISEMENT",
            "4 tablespoons olive oil, divided ADVERTISEMENT",
            "1/2 teaspoon salt, divided ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, divided ADVERTISEMENT",
            "2 cups fresh green beans, trimmed and halved ADVERTISEMENT",
            "1 cup halved zucchini slices ADVERTISEMENT",
            "1 cup halved yellow squash slices ADVERTISEMENT",
            "1 cup fresh corn kernels ADVERTISEMENT",
            "1/2 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1 cup grape tomatoes, halved ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "2 teaspoons sugar ADVERTISEMENT",
            "1/4 cup sliced shallots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F.\nIn a large bowl, combine red and purple potatoes and toss with 1 tablespoon of the oil. Sprinkle with 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper. Roast in the oven for about 30 minutes, until tender and browned. Set aside and let cool to room temperature.\nIn a large pan set over medium heat, add green beans and 3 tablespoons water. Saute until beans are bright green and water has evaporated, about 3 minutes. Add 1 tablespoon of the oil to the pan. Add zucchini, yellow squash, and corn to the pan. Cook until crisp-tender, 5 to 7 minutes.\nAdd thyme and remaining 1/4 teaspoon of the salt and 1/4 teaspoon of the pepper to the pan. Cook for 1 to 2 minutes longer, until fragrant. Remove from heat and add the tomatoes. Cool to room temperature. Once cool, add the potatoes to the other vegetables.\nIn a small bowl, whisk together lemon juice and sugar. Continue whisking constantly and slowly drizzle in the remaining 2 tablespoons oil. Add the shallots and stir.\nDrizzle the vinaigrette over the potato salad and gently toss to coat. Add more salt and pepper to taste, if desired. Serve at room temperature or chill.\n",
        "picture_link": ".5ofeu3rSfo0ISdCWW8Qsu6z0eXJELG"
    },
    {
        "title": "Unbelievable Vegan Mashed Potatoes",
        "ingredients": [
            "3 russet potatoes, peeled and cut into chunks ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 cup soy milk (such as Silk®) ADVERTISEMENT",
            "2 tablespoons vegan mayonnaise (such as Vegenaise®) ADVERTISEMENT",
            "2 tablespoons vegan margarine (such as Earth Balance®) ADVERTISEMENT",
            "1 tablespoon vegan grated Parmesan-style topping (such as Go Veggie® ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potato chunks and bay leaf into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, 10 to 15 minutes. Drain and transfer to a large bowl.\nCombine soy milk, vegan mayonnaise, vegan margarine, Parmesan-style topping, salt, and pepper in a microwave-safe bowl. Heat in 30-second intervals until margarine is melted, 1 to 2 minutes.\nPour soy milk mixture over potatoes in the bowl; mash until smooth with a potato masher.\n",
        "picture_link": "R57Fsi/dukBCev2V59R64/ycnDViYAe"
    },
    {
        "title": "Easy Popsicle® Floats",
        "ingredients": [
            "1/4 cup ice cream, divided ADVERTISEMENT",
            "1 fluid ounce root beer, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spoon 2 tablespoons ice cream into the bottom of an ice pop mold. Pour in root beer to slightly over half-full; top with 1 tablespoon ice cream. Freeze until firm, 8 hours to overnight.\nRemove ice pop mold from the freezer; add remaining 1 tablespoon of ice cream to the top of the mold. Freeze until firm, 4 to 6 hours.\n",
        "picture_link": "OQD/DKyv4Zn0jhJzNsex8S92/BlA06C"
    },
    {
        "title": "Fried Plantains With Avocado Dip",
        "ingredients": [
            "2 Hass avocado, peeled and pitted ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "2 green plantains, peeled and sliced into fifths ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine avocados, lemon juice, mayonnaise, and salt together in a bowl; sprinkle in garlic. Mash using a potato masher until dip is creamy.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Drizzle about 1 teaspoon oil onto a clean work surface and the bottom of a coffee cup.\nFry the plantains in the hot oil until golden brown, 8 to 10 minutes. Remove from fryer and place on the work surface; flatten with the bottom of the coffee cup. Re-fry until browned and tender, about 5 minutes. Place on a paper towel-covered plate; sprinkle with salt. Serve plantains alongside the dip.\n",
        "picture_link": ".9U9lJPFS3znZ/f04c4cSoTlpgdNylq"
    },
    {
        "title": "Barley Corn Salad",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 cup barley ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil, divided ADVERTISEMENT",
            "1 1/2 cups corn kernels ADVERTISEMENT",
            "1 cup cherry tomatoes, halved ADVERTISEMENT",
            "2 scallions, sliced ADVERTISEMENT",
            "2 cups mixed greens ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and barley to a boil in a saucepan. Reduce heat to low, cover, and simmer until barley is tender, about 30 minutes.\nDrain any excess water from barley and transfer to a large bowl; stir in 2 tablespoons olive oil.\nHeat remaining 1 tablespoon olive oil in a large skillet over medium heat. Add corn; cook and stir until slightly softened, about 2 minutes. Stir in tomatoes and scallions; cook until scallions are wilted, about 2 minutes.\nMix corn mixture into barley in the bowl. Stir in mixed greens, lemon juice, and lemon zest. Season salad with salt and pepper.\n",
        "picture_link": "LPwltOYMU0I5VnhlucWcZOvLbkH4Yfq"
    },
    {
        "title": "Zucchini Waffles (Green Waffles)",
        "ingredients": [
            "3 cups shredded zucchini ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup dry potato flakes ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions.\nMix zucchini, eggs, vegetable oil, onion powder, and salt together in a bowl. Stir in potato flakes and baking powder; mix until batter is combined.\nPour 1/2 cup of the batter onto the center of the waffle iron. Close the lid; cook until iron stops steaming and waffle is crisp, about 5 minutes.\n",
        "picture_link": "h5nmyPe8aKVFA.RWuTSclxxnREw8jwS"
    },
    {
        "title": "Tangy Feta Mashed Potatoes",
        "ingredients": [
            "2 pounds Yukon Gold potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 (4 ounce) package crumbled tomato and basil feta cheese (such as Athenos®) ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon coarsely chopped capers ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain.\nMix feta cheese, butter, milk, capers, garlic, salt, and pepper into the potatoes. Mash with a potato masher or electric mixer to desired consistency.\n",
        "picture_link": "lmaKPvFXzqg95aZ250hk9FJBOScBnru"
    },
    {
        "title": "Grecian Cherries",
        "ingredients": [
            "2 cups cherries, pitted and coarsely chopped ADVERTISEMENT",
            "1 cup whole-milk ricotta cheese ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "4 teaspoons ground coriander ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chopped cherries with accumulated juices, ricotta cheese, feta cheese, coriander, sugar, and lemon juice in a large bowl. Chill before serving.\n",
        "picture_link": "NVWgNCcYHSUTZUAeeYaTjWgs1cisjoO"
    },
    {
        "title": "Zucchini Chocolate Oatmeal Bites",
        "ingredients": [
            "1 1/4 cups gluten-free oats ADVERTISEMENT",
            "1/2 cup almond butter ADVERTISEMENT",
            "1/2 cup coarsely shredded zucchini ADVERTISEMENT",
            "1/4 cup dairy-free mini chocolate chips ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "3 tablespoons flaxseed meal ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix oats, almond butter, zucchini, chocolate chips, honey, flaxseed meal, and ground cinnamon in a large bowl until combined.\nDivide mixture into 18 bite-sized pieces and roll into balls. Arrange in a storage container and refrigerate until set, about 1 hour.\n",
        "picture_link": "p6VPoRftlONQ1CVAA4EbxVIQyixTSfi"
    },
    {
        "title": "Fig Thumbprint Cookies",
        "ingredients": [
            "Cookie: ADVERTISEMENT",
            "2 2/3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "Fig Filling: ADVERTISEMENT",
            "1/2 pound fresh figs ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon lemon juice, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix flour, baking soda, and salt together in a bowl.\nBeat sugar and butter with an electric mixer in a large bowl until fluffy. Beat eggs in, one at a time, until combined; stir in vanilla extract. Fold in flour mixture until well blended.\nCombine figs, honey, cinnamon, and nutmeg together in a food processor; pulse until smooth. Stir in lemon juice until filling is slightly thinner than jam.\nShape dough into 1-inch balls; place on a non-stick baking sheet. Make thumbprints in batter with a wet finger. Spoon 1 teaspoon of filling into each thumbprint.\nBake in the preheated oven until edges are golden, 10 to 12 minutes. Cool on the baking sheet for 1 minute before removing to a wire rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ta'ameya (Egyptian Falafel)",
        "ingredients": [
            "2 cups dried split fava beans ADVERTISEMENT",
            "1 red onion, quartered ADVERTISEMENT",
            "1/2 cup fresh parsley ADVERTISEMENT",
            "1/2 cup fresh cilantro ADVERTISEMENT",
            "1/2 cup fresh dill ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 1/2 teaspoons ground coriander ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 cup sesame seeds (optional) ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place fava beans in large bowl and cover with several inches of water. Let soak, 8 hours to overnight. Drain.\nCombine soaked fava beans, red onion, parsley, cilantro, dill, garlic, coriander, salt, and cumin in a food processor; process to a dough-like consistency.\nHeat a skillet over medium heat. Add sesame seeds; cook, stirring occasionally, until toasted, about 5 minutes. Transfer to a large plate.\nShape fava bean mixture into balls. Roll in sesame seeds to coat.\nFill a large saucepan 1/4 full with oil; heat over medium heat. Fry fava bean balls in batches until golden brown, 3 to 5 minutes. Drain on paper towels.\n",
        "picture_link": "4JbD/8AppDjDmXaq6lAo6UGz8uSpTE2"
    },
    {
        "title": "Upside-Down Pumpkin Pecan Pie ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 (15 ounce) cans pumpkin puree ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2/3 cup evaporated milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (18.25 ounce) box yellow cake mix ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups coarsely chopped pecans ADVERTISEMENT",
            "Caramel Sauce: ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "Whipped Cream Topping: ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line bottoms and sides of two 9-inch pie pans with waxed paper. Spray with cooking spray.\nCombine pumpkin puree, white sugar, and evaporated milk in a large bowl. Add eggs, cinnamon, and salt; beat with an electric mixer until batter is smooth.\nPour batter into prepared pans. Sprinkle yellow cake mix on top. Drizzle 1 cup melted butter over cake mix. Sprinkle pecans on top; press lightly into butter.\nBake in the preheated oven until golden brown, 50 to 60 minutes. Remove pans from the oven and let pies cool, about 2 hours.\nRun a knife around the edges of the pans to loosen pies; invert onto serving plates. Peel off waxed paper. Place pies in the refrigerator.\nMelt 1 cup butter in a saucepan over low heat. Add brown sugar and 1 cup heavy cream; cook and stir until sugar is dissolved, 3 to 5 minutes. Simmer caramel sauce until smooth, about 3 minutes. Remove from heat.\nBeat 2 cups heavy cream in a chilled glass or metal bowl with an electric mixer until foamy. Add confectioners' sugar and vanilla gradually, beating until soft peaks form.\nSlice chilled pies into wedges. Drizzle caramel sauce over wedges; top with a dollop of whipped cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rainier Cherry Berry Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "3/4 cup blueberries ADVERTISEMENT",
            "1/2 cup fat-free vanilla yogurt ADVERTISEMENT",
            "6 large fresh strawberries, halved ADVERTISEMENT",
            "12 Rainier cherries, pitted and halved ADVERTISEMENT",
            "1/4 cup fat-free milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine banana, blueberries, vanilla yogurt, strawberries, cherries, and milk in a blender; blend until smooth, about 60 seconds.\n",
        "picture_link": "/5T8fOQSVep4C.ByD.2gPbASmhEdMcC"
    },
    {
        "title": "Refreshing Brazilian Lemonade",
        "ingredients": [
            "4 1/4 cups water ADVERTISEMENT",
            "4 large limes, cut into wedges and seeded ADVERTISEMENT",
            "1/2 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "5 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and limes in a blender; blend until smooth. Strain mixture through a strainer into a bowl; discard solids. Pour lime mixture into blender. Add condensed milk, ice, and sugar; blend until combined.\n",
        "picture_link": "3Axmf2wXXCtEPaSCO42g4fFArdtw3oK"
    },
    {
        "title": "Strawberry Basil Balsamic Martini",
        "ingredients": [
            "2 strawberries, or more to taste ADVERTISEMENT",
            "2 basil leaves, or more to taste ADVERTISEMENT",
            "1/2 fluid ounce agave nectar ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "2 fluid ounces vodka ADVERTISEMENT",
            "1/2 fluid ounce lime juice ADVERTISEMENT",
            "1/2 ounce balsamic glaze (reduced balsamic vinegar), divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place strawberries, basil, and agave nectar in a cocktail shaker and mash well with a muddler. Add ice, vodka, lime juice, and 1/4 ounce balsamic glaze. Cover and shake cocktail until the outside of the shaker has frosted.\nSwirl remaining 1/4 ounce balsamic glaze around the inside of a martini glass. Strain cocktail into the glass.\n",
        "picture_link": "CnKHw2uNRGw3dUAF7IgNtLDSre1JhnO"
    },
    {
        "title": "Kate's Grilled Corn Salad",
        "ingredients": [
            "6 ears corn ADVERTISEMENT",
            "1 tomato, finely chopped ADVERTISEMENT",
            "5 ounces Monterey Jack cheese, cut into small cubes ADVERTISEMENT",
            "1 orange bell pepper, finely chopped ADVERTISEMENT",
            "1/2 cucumber, finely chopped ADVERTISEMENT",
            "2 tablespoons finely chopped cilantro ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 1/2 teaspoons coarse sea salt ADVERTISEMENT",
            "freshly cracked black pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nBring a large pot of water to a boil. Add corn; cook until tender, about 6 minutes. Drain.\nCook corn on the preheated grill until lightly golden, about 5 minutes. Cool until easily handled, 5 to 10 minutes.\nCut corn kernels off the cob with a sharp knife. Transfer to a large bowl; add tomato, Monterey Jack cheese, orange bell pepper, cucumber, and cilantro. Stir in balsamic vinegar, sea salt, pepper, and garlic powder; mix to combine.\n",
        "picture_link": "EBnBLRf1BjL.Sx.4K5VH8saC.iz0y4u"
    }
]