[
    {
        "title": "Holiday Vegan Gravy",
        "ingredients": [
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "2 onions, sliced ADVERTISEMENT",
            "2 large carrots, cut into chunks ADVERTISEMENT",
            "4 ounces fresh mushrooms, halved ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "4 sun-dried tomatoes, quartered ADVERTISEMENT",
            "2 sprigs fresh marjoram ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 teaspoon vegetable oil in a large skillet over medium-low heat. Cook and stir onions, carrots, mushrooms, garlic, salt, and black pepper in the hot oil until coated, about 1 minute. Cover and cook until vegetables are soft, about 30 minutes. Uncover and increase heat to medium; cook and stir until vegetables are brown and caramelized, 7 to 10 more minutes.\nPour white wine into vegetables and simmer until wine is reduced by 2/3, 2 to 3 minutes. Stir in sun-dried tomatoes, marjoram, thyme, and water. Bring to a simmer, cover, and cook until vegetables are very soft, about 30 minutes. Strain liquid into a large measuring cup, using a spoon to press as much liquid as possible into the cup.\nHeat 1 tablespoon vegetable oil in a saucepan over medium heat; stir in flour and cook, stirring constantly, until flour mixture is golden brown, about 5 minutes. Whisk in reserved vegetable liquid and simmer until thickened, 3 to 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegetable and Fruit Juice",
        "ingredients": [
            "3 large carrots ADVERTISEMENT",
            "1 large tomato ADVERTISEMENT",
            "8 large strawberries ADVERTISEMENT",
            "1 lime, sliced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger ADVERTISEMENT",
            "1 apple ADVERTISEMENT",
            "1 large red bell pepper, stemmed and seeded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Juice carrots, tomato, strawberries, lime slices, ginger, apple, and red bell pepper using a juicer following manufacturer's instructions.\n",
        "picture_link": "2K9OomMRYLJqsF2AIag3/cxZyKOK.jS"
    },
    {
        "title": "Sweet Cajun Plantain",
        "ingredients": [
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 ripe (yellow) plantains, peeled and cut into 1/8-inch slices ADVERTISEMENT",
            "3 tablespoons white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix paprika, thyme, oregano, garlic powder, black pepper, cayenne pepper, and salt in a bowl. Add plantain slices to spice mixture and turn to coat.\nHeat olive oil in a skillet over medium-high heat. Cook plantains in skillet until softened, 1 to 2 minutes per side. Pour wine into the skillet. Bring wine to a boil and simmer until wine cooks off, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pineapple Ham Loaf",
        "ingredients": [
            "1 1/2 pounds ground ham ADVERTISEMENT",
            "1 1/2 pounds ground pork ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3/4 cup crushed saltine crackers ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground ham, ground pork, eggs, milk, crackers, salt, and black pepper together in a bowl; form into a loaf. Transfer loaf to a loaf pan.\nMix brown sugar, cider vinegar, and dry mustard together; pour over the loaf.\nBake in preheated oven for 1 hour. Spread pineapple atop the loaf; continue baking until no longer pink in the center, about 45 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Creamy Tropical Fruit Salad",
        "ingredients": [
            "1 (12 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "1 (11 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1 papaya, cut into bite-size chunks ADVERTISEMENT",
            "1 large mango, cut into bite-size chunks ADVERTISEMENT",
            "1 large peach, peeled and cut into bite-size chunks ADVERTISEMENT",
            "2 plantains, peeled and sliced ADVERTISEMENT",
            "1 pomegranate, seeds only ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/2 cup blackberry yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix pineapple, oranges, papaya, mango, peach, plantains, and pomegranate seeds together in a large bowl.\nStir lemon juice and honey together in a small bowl; pour over the fruit mixture and stir to coat. Add yogurt and gently fold fruit to coat.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Huwe Hunting Breakfast",
        "ingredients": [
            "3 eggs, beaten ADVERTISEMENT",
            "2 (15 ounce) cans chili ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium heat. Cook and stir eggs until no longer moist, about 3 minutes. Pour chili into the skillet; stir. Continue cooking until the chili is hot, about 5 minutes.\n",
        "picture_link": "hZkTzAC/UhH9mP07rmvidfH8GVFC36."
    },
    {
        "title": "Winter Chicken n' Squash",
        "ingredients": [
            "1 delicata squash - halved lengthwise, seeded, and cut into 2-inch slices ADVERTISEMENT",
            "1 1/4 cups jasmine rice ADVERTISEMENT",
            "6 chicken leg quarters with skin, cut into thighs and drumsticks ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 (8 ounce) can cream of broccoli soup ADVERTISEMENT",
            "1 (8 ounce) can drained canned peas ADVERTISEMENT",
            "2 tablespoons ground dried sage ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "2 teaspoons cayenne pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLay squash slices in a 11x13-inch baking dish. Spread rice in an even layer over the squash slices. Arrange chicken pieces onto the layer of rice.\nMix chicken broth, broccoli soup, peas, sage, and black pepper together in a bowl; pour into baking dish around the chicken piece. Sprinkle cayenne pepper over the chicken pieces. Season chicken and rice mixture with salt. Cover baking dish with aluminum foil.\nCook in the preheated oven for 1 hour and 45 minutes. Remove the aluminum foil and continue cooking until the chicken is no longer pink at the bone and the juices run clear, about 15 minutes more. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Cool dish 5 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Veal Chops",
        "ingredients": [
            "1 pound lean veal chops ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch ground cumin, or to taste ADVERTISEMENT",
            "3 tablespoons butter, thinly sliced ADVERTISEMENT",
            "2 ounces shredded mozzarella cheese ADVERTISEMENT",
            "2 ounces shredded provolone cheese ADVERTISEMENT",
            "2 ounces shredded white Cheddar cheese ADVERTISEMENT",
            "1 (16 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "2 tablespoons water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSeason both sides of veal chops with salt, black pepper, and cumin.\nPut 3 to 4 slices butter in the bottom of a 9x13-inch casserole dish; sprinkle in about 1/4 of the mozzarella cheese, 1/4 of the provolone cheese, and 1/4 of the white Cheddar cheese. Arrange a layer of veal chops atop the cheese layer. Top each chop with 2 to 3 slices butter, 1/3 of the mushrooms, and 1/4 of the mozzarella cheese, 1/4 of the provolone cheese, and 1/4 of the white Cheddar cheese. Continue layering with the remaining ingredients.\nPour enough water into the casserole dish to just cover the bottom; cover dish with aluminum foil and an oven-safe lid.\nBake in the preheated oven until veal is no longer pink in the center, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Grilled S'Mores",
        "ingredients": [
            "4 sheets 8x12-inches each) Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "4 graham crackers, broken into halves ADVERTISEMENT",
            "2 (1.55 ounce) bars milk chocolate candy bars, divided in half diagonally ADVERTISEMENT",
            "4 marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill to medium or preheat oven to 450 degrees F. For each s'more, top one graham cracker square with one candy bar half, one marshmallow and another graham cracker square. Repeat with remaining graham crackers, candy and marshmallows.\nCenter s'mores individually on each sheet of Reynolds Wrap(R) Aluminum Foil.\nBring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside. Repeat to make four packets.\nGrill 4 to 5 minutes in covered grill.\nOR Bake 4 to 5 minutes on a cookie sheet in oven.\n",
        "picture_link": "jw3CD8NkiGu9LqRCR1scI1irC8punHS"
    },
    {
        "title": "Sicilian Pasta Salmon Sauce",
        "ingredients": [
            "1 (2 ounce) can anchovy fillets, undrained, or to taste ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 teaspoon tomato paste ADVERTISEMENT",
            "1 (7.5 ounce) can salmon, undrained, or more to taste ADVERTISEMENT",
            "1/2 (7.5 ounce) can water ADVERTISEMENT",
            "1/4 cup pine nuts, or to taste ADVERTISEMENT",
            "1/4 cup raisins, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch saffron ADVERTISEMENT",
            "1 (16 ounce) package spaghettini ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour about 2 teaspoons oil from anchovy can into a skillet over medium heat; cook and stir onion in the hot anchovy oil until softened, about 5 minutes. Add anchovy fillets; cook and stir until fish dissolves, about 5 minutes.\nStir tomato paste into onion-anchovy mixture; add juice from canned salmon, water, pine nuts, raisins, salt, and black pepper. Cook and stir mixture until flavors have blended, about 15 minutes.\nBring a large pot of lightly salted water to a boil. Cook spaghettini in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes. Drain.\nMix salmon and saffron into onion-anchovy mixture; cook until salmon is heated through, about 15 more minutes. Serve salmon sauce over spaghettini.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raisin Topped Frosted Zucchini Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup raw sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "2 pinches ground nutmeg, or to taste ADVERTISEMENT",
            "3 cups finely shredded zucchini ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "60 raisins, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.\nBeat 1/2 cup butter with raw sugar in a bowl using an electric mixer until smooth and creamy; beat in egg.\nMix flour, cinnamon, baking soda, salt, cloves, and nutmeg in a large bowl. Stir flour mixture, alternating with zucchini and pecans, into creamed butter mixture until just incorporated. Drop batter by the heaping tablespoonful onto the prepared baking sheet, keeping cookies 2 inches apart.\nBake in the preheated oven until cookies are lightly browned, 12 to 15 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\nBeat cream cheese, 1/4 cup butter, and vanilla extract together using an electric mixer in a bowl until smooth. Gradually beat in confectioners' sugar until incorporated.\nFrost the cooled cookies; top each cookie with 2 raisins.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cheddar and Pineapple Grits",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "2 tablespoons quick-cooking grits ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/3 cup white sugar, or to taste ADVERTISEMENT",
            "1/2 sleeve buttery round crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace butter into a microwave-safe bowl, and microwave until butter is melted, about 1 minute. Pour melted butter into a small microwave-safe casserole dish and mix grits, pineapple, and Cheddar cheese into melted butter.\nMicrowave grits mixture on full power until mixture boils and grits are tender, about 4 minutes. Sprinkle top with sugar and cracker crumbs.\nBake in the preheated oven until crumbs are lightly toasted, 15 to 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vanilla Custard Pie",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "Vanilla Pudding: ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Meringue: ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix graham cracker crumbs, 1/4 cup sugar, and 1/3 cup melted butter in a bowl; press mixture into a 9-inch pie dish to form a crust.\nBake in preheated oven until firm, 5 to 10 minutes.\nWhisk milk, 1/2 cup sugar, cornstarch, flour, and salt in a saucepan over medium heat; bring to a boil, stirring constantly. Boil for 2 minutes, then add egg yolks while continuously stirring. Continue to cook and stir until thickened, about 1 minute more, and remove from heat. Stir in 1 tablespoon butter and vanilla extract. Allow vanilla mixture to cool for 10 minutes before pouring into prepared crust. Let pie come to room temperature.\nPreheat oven to 425 degrees F (220 degrees C).\nBeat egg whites in a glass or metal bowl until foamy. Gradually add 1/4 cup sugar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the meringue will form sharp peaks. Spread meringue over vanilla pudding.\nBake in preheated oven until lightly browned, about 5 minutes. Let cool to room temperature.\nRefrigerate for about 3 hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Joyce's Granola",
        "ingredients": [
            "4 cups rolled oats ADVERTISEMENT",
            "1 cup wheat germ ADVERTISEMENT",
            "1/2 cup flax seed meal ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "1/2 cup walnuts ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "5 tablespoons unsweetened applesauce ADVERTISEMENT",
            "2 tablespoons agave nectar ADVERTISEMENT",
            "3 tablespoons (blank) sugar-free pancake syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Grease a baking sheet.\nMix oats, wheat germ, flax seed meal, almonds, walnuts, and cinnamon together in a large bowl. Whisk applesauce, agave syrup, and pancake syrup together in a separate bowl; drizzle over the oats mixture and stir until evenly coated. Spread oats mixture onto prepared baking sheet.\nBake, stirring every 20 minutes, in preheated oven until golden brown, about 45 minutes; cool completely before storing in an airtight container.\n",
        "picture_link": "8SaA8OeU46eRLzSidcm/mqDG83wtlD6"
    },
    {
        "title": "Mocha Dark Chocolate Chip and Hemp Seed Nut Cookies ",
        "ingredients": [
            "1 1/2 cups flaxseed meal ADVERTISEMENT",
            "1/2 cup unsalted butter, at room temperature ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/4 cups oat flour ADVERTISEMENT",
            "1 (3.5 ounce) package non-instant mocha chocolate pudding mix (such as Dr. Oetker®) ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup dark chocolate chips, or more to taste ADVERTISEMENT",
            "1/3 cup hemp seed nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 345 degrees F (174 degrees C).\nCombine flaxseed meal, butter, eggs, brown sugar, white sugar, and vanilla extract in a large bowl; beat with an electric mixer until creamy. Stir in oat flour, pudding mix, and baking soda gradually. Fold chocolate chips and hemp seed nuts into the dough.\nScoop dough onto ungreased baking sheets with a cookie scoop.\nBake in the preheated oven until edges are lightly browned, 11 to 13 minutes. Flatten with a fork if desired.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Whole Wheat Date Nut Muffins",
        "ingredients": [
            "1 serving cooking spray (optional) ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1/2 banana, mashed ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons egg white ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 tablespoon flax seeds, or more to taste ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or more to taste ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "18 dates, pitted and chopped, or more taste ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease muffin tin with cooking spray or line with paper liners.\nBeat buttermilk, honey, mashed banana, canola oil, egg, egg white, and vanilla extract together in a bowl.\nCombine whole wheat flour, baking powder, flax seeds, baking soda, cinnamon, and salt in a large bowl. Mix in dates and walnuts. Pour in buttermilk mixture; mix batter until blended.\nScoop batter into the prepared muffin tin.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 25 minutes. Transfer to a wire rack to cool, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coconut Oil Milk Chocolate Chip Oat Cookies",
        "ingredients": [
            "1/3 cup coconut oil ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup milk chocolate chips ADVERTISEMENT",
            "1/4 cup old-fashioned oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line a baking sheet with parchment paper.\nCombine coconut oil, brown sugar, and white sugar in a large bowl; beat with an electric mixer until creamy. Beat in egg and vanilla extract.\nMix flour, baking soda, and salt together in a bowl. Gradually beat into the coconut oil mixture until just blended. Fold chocolate chips and oats into the dough.\nRoll 2 tablespoons of dough into a ball. Place on the prepared baking sheet. Repeat with remaining dough, spacing balls about 2 inches apart.\nBake in the preheated oven until cookies are golden on the bottom, 12 to 14 minutes.\n",
        "picture_link": "1xgSjCABUoJVL/HpcPwS.h9MDuwp93C"
    },
    {
        "title": "Forest on a Bagel",
        "ingredients": [
            "1 bagel, split ADVERTISEMENT",
            "1/2 cup cream cheese ADVERTISEMENT",
            "3 tablespoons miniature marshmallows ADVERTISEMENT",
            "3 tablespoons oats ADVERTISEMENT",
            "3 tablespoons almonds ADVERTISEMENT",
            "2 tablespoons raisins ADVERTISEMENT",
            "2 tablespoons dried cranberries ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast bagel in a toaster until golden, 3 to 5 minutes.\nSpread cream cheese onto the bagel; top with marshmallows, oats, almonds, raisins, and cranberries. Drizzle with honey.\n",
        "picture_link": "4vBrLANPaGMoWtTXHmx5ie6bkJn6Fnq"
    },
    {
        "title": "Watermelon-Raspberry Lemonade",
        "ingredients": [
            "1 cup water, divided ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "6 cups cubed seedless watermelon ADVERTISEMENT",
            "1/2 cup red raspberries ADVERTISEMENT",
            "1/2 cup fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1/3 cup water and sugar in a small saucepan; bring to a boil, stirring constantly, until sugar dissolves. Remove simple syrup from heat to cool.\nPlace watermelon, raspberries, and remaining water together in a blender; pulse until smooth. Pour watermelon mixture into a frosted pitcher; stir in simple syrup and lime juice. Refrigerate until chilled, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Harvest Pasta with Kale and Swiss Chard",
        "ingredients": [
            "13 ounces spaghetti ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 cup chopped kale ADVERTISEMENT",
            "1 hot pepper, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "3 1/2 ounces peeled and deveined shrimp ADVERTISEMENT",
            "2 cups chopped Swiss chard ADVERTISEMENT",
            "1 cup chopped green beans ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon fresh thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 minutes. Drain, reserving some of the cooking liquid.\nHeat 2 tablespoons olive oil in a large skillet over medium heat. Add onion and kale; cook and stir until softened, about 5 minutes. Add remaining 1 tablespoon olive oil, hot pepper, and garlic; cook and stir until fragrant, about 2 minutes. Stir in tomatoes, red bell pepper, shrimp, Swiss chard, and green beans. Cook until shrimp is opaque, about 5 minutes.\nStir spaghetti into the skillet, pouring in some of the reserved cooking liquid if mixture is too dry. Add balsamic vinegar, thyme, salt, and black pepper. Cook until flavors combine, 3 to 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Healthy Strawberry Apriplum Yogurt Smoothie",
        "ingredients": [
            "2 cups hulled strawberries ADVERTISEMENT",
            "2 apriplums, pitted and sliced into sections ADVERTISEMENT",
            "1/3 cup nonfat vanilla Greek yogurt (such as Chobani®) ADVERTISEMENT",
            "1 teaspoon ground toasted coconut ADVERTISEMENT",
            "1 teaspoon flaxseed meal ADVERTISEMENT",
            "1 1/2 cups whole milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine strawberries, apriplums, yogurt, coconut, flax seed in a blender. Pour in milk; pulse until smooth.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chef John's Tomato and \"Dirt\" Salad",
        "ingredients": [
            "Crumbs: ADVERTISEMENT",
            "2 tablespoons olive oil, or more if needed ADVERTISEMENT",
            "3 large brown mushrooms, finely minced ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 slices dark rye bread ADVERTISEMENT",
            "1 tablespoon finely ground almonds ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "8 ounces burrata cheese ADVERTISEMENT",
            "3 ripe fresh tomatoes, sliced ADVERTISEMENT",
            "1/4 cup white wine vinegar, or to taste ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil, or to taste ADVERTISEMENT",
            "Kosher salt and freshly ground pepper, to taste ADVERTISEMENT",
            "Fresh basil leaves, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a skillet over medium-high heat. Add finely minced mushrooms and a pinch of salt. Cook and stir until mushrooms completely dry out and turn golden brown, 7 or 8 minutes, reducing heat slightly toward the end if needed.\nBreak bread into large chunks and place in food processor. Pulse on and off until processed into fine crumbs. Add crumbs to mushroom mixture. Cook over medium heat until breadcrumbs are completely dried out, dark brown and toasted. Drizzle in more oil if needed. Stir in ground almonds. Continue cooking on medium until pieces of almond turn brown, 3 to 4 minutes. Remove from heat and allow \"dirt\" mixture to cool to room temperature.\nScoop spoonfuls of burrata into serving bowls. Arrange tomato slices on top. Drizzle with white wine vinegar and a generous drizzle of olive oil. Season with kosher salt, black pepper, and basil. Sprinkle with \"dirt\" mixture.\n",
        "picture_link": "1OTVk7X9KG92Peho3/ZHfIe8qseGanm"
    },
    {
        "title": "Banana Coconut Cake with Vanilla Glaze",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "coconut oil no-stick cooking spray ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/3 cup non-fat plain Greek yogurt ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup dark brown sugar ADVERTISEMENT",
            "2 large eggs, beaten ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/4 cup cane sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/4 teaspoons ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup mashed banana ADVERTISEMENT",
            "3/4 cup shredded unsweetened coconut ADVERTISEMENT",
            "Vanilla Glaze: ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons unsweetened cashew milk, or more as needed ADVERTISEMENT",
            "1/2 teaspoon coconut oil, melted ADVERTISEMENT",
            "1/8 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a fluted tube pan (such as Bundt(R)) with cooking spray.\nMix whole wheat flour, Greek yogurt, all-purpose flour, baking soda, baking powder, and salt together in a bowl.\nCombine brown sugar, eggs, butter, cane sugar, vanilla extract, allspice, and nutmeg in a large bowl; mix until well blended. Stir in flour mixture. Fold in mashed banana and shredded coconut until evenly combined. Spoon batter into the prepared pan.\nBake in preheated oven until a toothpick inserted into the center comes out clean, about 35 minutes. Remove from oven; turn over onto a wire rack to cool, about 30 minutes.\nCombine confectioners' sugar, cashew milk, coconut oil, vanilla extract, and salt together in a bowl; stir until mixture is creamy. Drizzle over cooled cake.\n",
        "picture_link": "VCm3.I.F1mZVBaldDhCXi0iN09iDgKW"
    },
    {
        "title": "Pasta and Veggies in Coconut Oil",
        "ingredients": [
            "1 (12 ounce) package elbow macaroni ADVERTISEMENT",
            "2 cups frozen mixed vegetables ADVERTISEMENT",
            "1 tablespoon coconut oil, or more to taste ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "sea salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add elbow macaroni; cook, stirring occasionally, until lightly softened, about 3 minutes. Add frozen vegetables; cook and stir until tender yet firm to the bite, about 5 minutes. Drain into a bowl.\nPlace coconut oil in the warm pot. Add macaroni mixture, garlic powder, sea salt, and pepper; toss until combined, 1 to 2 minutes. Top with Parmesan cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Granola Bars ",
        "ingredients": [
            "1 cup raisins ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "1 chopped raw almonds ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/4 cup unsalted raw peanut butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 tablespoon water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place raisins in a food processor; pulse into a paste.\nTransfer raisin paste to a large bowl. Add oats and almonds.\nPlace banana in the food processor; blend into a puree.\nCombine 1/4 cup banana puree, peanut butter, vanilla extract, and salt in a saucepan over medium heat; cook and stir until warmed through, 3 to 5 minutes. Add water if mixture seems too thick. Pour over raisin mixture in the bowl and mix with your hands until combined.\nLine a square baking dish with parchment paper. Press mixture into the baking dish. Brush remaining banana puree on top. Cover with plastic wrap.\nChill until firm, 8 hours to overnight. Cut into squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Cake Pop Swirl",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour, or as needed ADVERTISEMENT",
            "1 1/3 teaspoons baking soda ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine sugar, flour, and baking soda in a bowl. Add butter, milk, eggs, and vanilla extract; stir, adding more flour if needed, until batter is thick but smooth.\nScoop batter onto a nonstick baking sheet using an ice cream scoop.\nBake in the preheated oven until golden brown, 30 to 40 minutes. Cool on the baking sheet for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Auntie Mary's Sweet Potato Fritters ",
        "ingredients": [
            "4 sweet potatoes, shredded ADVERTISEMENT",
            "3 large carrots, shredded ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sweet potatoes and carrots together in a large bowl. Form into small balls and flatten into patties.\nHeat oil in a large skillet over medium-high heat. Fry patties in hot oil until golden brown, about 1 minute per side. Drain on paper towels; allow to cool slightly, about 5 minutes. Season with salt and pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Healthy Hemp Granola ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups old-fashioned rolled oats ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "1/4 cup hemp seeds ADVERTISEMENT",
            "1/4 cup flaxseed meal ADVERTISEMENT",
            "6 tablespoons honey ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "2 tablespoons flaxseed oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a large rimmed baking sheet with aluminum foil; grease with cooking spray.\nMix oats, almonds, hemp seeds, and flaxseed meal together in a large bowl.\nWhisk honey, water, flaxseed oil, vanilla extract, and almond extract together in a bowl until blended. Pour over oat mixture and stir quickly until distributed. Spread evenly on the prepared baking sheet.\nBake in the preheated oven, stirring every 3 to 5 minutes, until oats are golden and nuts appear toasted, 15 to 20 minutes. Let cool completely, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Wheat-Free Cashew Breakfast Bars",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3/4 cup raw cashews ADVERTISEMENT",
            "3/4 cup crispy rice cereal ADVERTISEMENT",
            "3/4 cup raw sunflower seeds ADVERTISEMENT",
            "1/2 cup soy nut butter ADVERTISEMENT",
            "1/2 cup blue agave nectar, or as needed ADVERTISEMENT",
            "1/2 cup old-fashioned oats ADVERTISEMENT",
            "2 tablespoons flaxseed meal ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray an 8x8-inch glass baking pan with cooking spray.\nPlace cashews in a food processor; grind until the consistency of flour.\nCombine ground cashews, rice cereal, sunflower seeds, nut butter, agave, oats, and flaxseed meal in the bowl of a stand mixer; blend until smooth.\nPress cashew mixture firmly into the prepared baking pan with a spatula.\nMelt chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes. Spread over cashew mixture.\nChill in the refrigerator until set, about 5 minutes. Cut into 1-inch squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Green Chile Cilantro Sauce",
        "ingredients": [
            "1 cup unsalted raw cashews ADVERTISEMENT",
            "1 (4 ounce) can diced green chile peppers ADVERTISEMENT",
            "1/4 cup hemp milk ADVERTISEMENT",
            "1/2 jalapeno pepper with seeds, or more to taste ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cashews, green chile peppers, hemp milk, jalapeno pepper, and salt in a blender; process until smooth.\nPour blended mixture into a small bowl; stir in cilantro.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bacon, Egg, and Cheese Pancake Balls (with Cake Pop Maker)",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "4 eggs, divided ADVERTISEMENT",
            "2 cups baking mix (such as Bisquick®) ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble into small pieces.\nBeat 3 eggs in a small bowl until smooth; pour into the hot skillet. Cook, stirring, over medium heat until scrambled and set, about 5 minutes.\nPreheat a cake pop maker according to manufacturer's instructions.\nCombine remaining egg, baking mix, milk, and vegetable oil in a large bowl to make pancake batter.\nFold crumbled bacon, scrambled eggs, and Cheddar cheese gently into the batter.\nFill wells of preheated cake pop machine with batter. Cook until golden brown, 4 to 6 minutes. Repeat with remaining batter.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spiralized Apple 'Spaghetti' with Cinnamon Dressing",
        "ingredients": [
            "1 Red Delicious apple ADVERTISEMENT",
            "1 (6 ounce) container plain Greek yogurt ADVERTISEMENT",
            "2 teaspoons honey, or more to taste ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Attach apple to a spiralizer and cut into ribbons.\nWhisk Greek yogurt, honey, cinnamon, and vanilla extract together in a bowl until blended. Add apple; toss to coat. Garnish with walnuts.\n",
        "picture_link": "jStwrn93WYnTugv9/3ddYLNyXqDKeKS"
    },
    {
        "title": "Grilled Lamb Shoulder Chops with Fresh Mint Jelly",
        "ingredients": [
            "3 sprigs fresh rosemary ADVERTISEMENT",
            "2 (8 ounce) lamb shoulder chops ADVERTISEMENT",
            "1 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "2 tablespoons pomegranate juice ADVERTISEMENT",
            "Kosher salt, to taste ADVERTISEMENT",
            "olive oil ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/2 cup orange marmalade ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 bunch fresh mint, leaves only, very thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using the dull side of a knife, \"chop\" the rosemary sprigs to bruise them and release their fragrance. Season chops with pepper (no salt) and place in a resealable plastic bag along with the garlic, rosemary, and pomegranate juice. Seal bag; massage gently to distribute flavors. Refrigerate for about 1 hour.\nPlace orange marmalade into a saucepan. Add vinegar and water. Bring to a boil over medium-high heat and immediately remove from heat. Pour through a fine strainer to remove orange rind. Add pepper flakes. Refrigerate until cold, about 30 minutes. When cold, stir in mint (if jelly is still warm, mint will turn black) until combined.\nRemove lamb from marinade; discard marinade. Salt both sides of the lamb chops. Lightly drizzle with about 1 to 2 teaspoons olive oil.\nLightly oil a grill and set at medium-high heat. Cook chops until browned and meat is medium rare, about 5 minutes on each side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C).\nServe with mint jelly.\n",
        "picture_link": "drDKQ9eV5TqnIZcPsvG6yRQcuhrasUq"
    },
    {
        "title": "Watermelon Hurricane",
        "ingredients": [
            "1 seedless watermelon, chunked ADVERTISEMENT",
            "ice as needed ADVERTISEMENT",
            "1 (750 milliliter) bottle vodka ADVERTISEMENT",
            "4 cups watermelon schnapps (such as watermelon Pucker®) ADVERTISEMENT",
            "1 (2 liter) bottle lemon-lime soda (such as Sprite®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1 chunk of watermelon into a juicer; juice, removing as much pulp as possible. Repeat until all of the watermelon is juiced.\nFill a glass 1/3 full with ice; pour in watermelon juice. Pour in one 1 1/2 fluid ounce shot of vodka and one 1 1/2 fluid ounce shot of watermelon schnapps; top with lemon-lime soda. Repeat for each cocktail.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blue Cheese Fig Burgers",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 medium sweet onion, sliced ADVERTISEMENT",
            "2 tablespoons fig preserves ADVERTISEMENT",
            "2 pounds ground chuck ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 (4 ounce) package Salemville® blue cheese ADVERTISEMENT",
            "4 hamburger buns ADVERTISEMENT",
            "Lettuce leaves ADVERTISEMENT",
            "1 tomato, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, heat olive oil and sliced onions. Cook onions 25-30 minutes or until onions are soft and caramelized. Add fig preserves and cook additional 2-3 minutes.\nIn a large bowl, add ground beef, salt, pepper, garlic powder and Worcestershire sauce. Mix until evenly combined.\nDivide the meat into 8 equal portions. Using your fingertips, press the portions of meat into 1/4-inch patties.\nIn a small bowl, combine Salemville blue cheese and 1 tablespoon of the fig onion mixture. Divide mixture into 4 equal portions. Place a portion of the blue cheese mixture onto half of the patties, save the rest for topping. Add one of the remaining patties to the top of the patties with Salemville blue cheese, and pinch to seal.\nPlace the burgers on a prepared grill and cook for 7 minutes each side. Remove patties and let rest for 5 minutes. Place lettuce and tomato on bottom of each bun. Add patty and top with remaining fig onion jam.\n",
        "picture_link": "rU9XMtaQDix2h2k08DRXTZZhkf.D5Ba"
    },
    {
        "title": "Black Olive and Mediterranean Spice Bread",
        "ingredients": [
            "1 1/4 cups warm water ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1 (6 ounce) can sliced black olives, drained ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 tablespoon butter, divided ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, sugar, and yeast in a large bowl. Let stand until yeast softens and begins to form a creamy foam, about 5 minutes. Add flour, black olives, olive oil, garlic, salt, and Italian seasoning to the bowl; mix well to form a dough.\nTurn dough out onto a floured work surface and knead until smooth, 5 to 10 minutes. Let stand until doubled in volume, about 1 hour.\nPunch dough down gently and knead, 5 to 10 minutes more. Let rise until doubled in volume again, about 45 minutes.\nLine a bowl with a well-floured cloth. Form dough into a ball and place upside down in the bowl. Let rise until doubled in volume again, about 45 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Fill a baking dish with water and place it in the bottom of your oven.\nGrease a baking sheet with 1 teaspoon butter and sprinkle cornmeal on top. Turn dough out gently onto the baking sheet.\nBake in the preheated oven until puffy, about 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C). Continue baking until bread is golden brown, 30 to 40 minutes. Brush remaining 2 teaspoons butter over the surface. Let cool slightly before slicing, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "To Die For Double Chocolate Peanut Butter Ice Cream",
        "ingredients": [
            "2 cups whole milk ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup peanut butter, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir whole milk, heavy cream, sugar, and cocoa powder together in a saucepan over low heat; cook, stirring, until sugar and cocoa powder have dissolved, about 5 minutes.\nBeat egg yolks in a bowl with an electric mixer until thick and pale yellow, about 4 minutes. Stir about 1/2 cup of cocoa mixture into egg yolks, whisking constantly.\nPour egg yolk mixture into cocoa mixture; cook, stirring constantly, until the mixture is thick enough to coat the back of a wooden spoon, about 5 minutes. Pour cocoa mixture into a bowl.\nPlace chocolate chips in a large microwave-safe bowl; heat in microwave in 20 second intervals until warm, stirring until chocolate chips are melted. Stir chocolate chips and vanilla extract into cocoa mixture just until combined; refrigerate until cold, about 2 hours.\nFreeze chocolate mixture in ice cream maker according to manufacturer's instructions. Drop peanut butter by spoonfuls into ice cream; using a knife, fold peanut butter through ice cream to form ribbons of peanut butter throughout.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten-Free Ricotta and Lemon Waffles",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "Waffles: ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup whole milk ricotta cheese ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "2 cups gluten-free pancake mix ADVERTISEMENT",
            "2 tablespoons coconut oil ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "Blueberry Sauce: ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions. Coat heated waffle iron with cooking spray or butter.\nWhisk milk, ricotta cheese, and egg together in a large bowl until smooth; stir in pancake mix, coconut oil, 1 tablespoon lemon juice, and vanilla extract. Mix batter until well combined.\nCombine blueberries, sugar, and 2 teaspoons lemon juice in a small saucepan; bring to a boil. Stir and reduce the heat to low, allowing blueberry sauce to simmer.\nPour 1/4 cup batter on the center of the waffle iron and close. Cook until golden brown, about 3 minutes. Pour blueberry sauce over the waffle. Repeat with remaining batter and sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Banana Split Martini",
        "ingredients": [
            "ice as needed ADVERTISEMENT",
            "2 fluid ounces white chocolate liqueur ADVERTISEMENT",
            "1 fluid ounce strawberry vodka ADVERTISEMENT",
            "1/2 fluid ounce banana liqueur ADVERTISEMENT",
            "1/2 teaspoon chocolate syrup, or to taste ADVERTISEMENT",
            "1 maraschino cherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice; add white chocolate liqueur, strawberry vodka, creme de banana liqueur, and chocolate syrup. Cover and shake until the outside of shaker has frosted. Strain into a chilled glass and garnish with a maraschino cherry.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pomegranate Steak with Quinoa",
        "ingredients": [
            "2 (8 ounce) beef Strip Steaks, boneless, 3/4-inch thick ADVERTISEMENT",
            "2 ounces goat cheese, crumbled ADVERTISEMENT",
            "Pomegranate seeds (optional) ADVERTISEMENT",
            "Marinade & Sauce: ADVERTISEMENT",
            "1 cup pomegranate juice ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "2 tablespoons minced fresh rosemary ADVERTISEMENT",
            "2 tablespoons minced fresh thyme ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons Dijon-style mustard ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "Quinoa: ADVERTISEMENT",
            "1 cup uncooked quinoa ADVERTISEMENT",
            "2 cups vegetable or beef broth ADVERTISEMENT",
            "1 cup thinly sliced fresh baby spinach ADVERTISEMENT",
            "1/2 cup pomegranate seeds or sweetened dried cranberries ADVERTISEMENT",
            "1/4 cup chopped toasted walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine Marinade & Sauce ingredients in medium bowl. Reserve 3/4 cup for basting sauce. Place beef steaks and remaining marinade in food-safe plastic bag; turn steaks to coat. Close bag securely and marinate in refrigerator 15 minutes to 2 hours.\nMeanwhile, prepare basting sauce. Pour reserved 3/4 cup marinade into small saucepan; bring to a boil. Reduce heat; cook 15 to 20 minutes or until reduced by half and slightly thickened, stirring occasionally. Set aside.\nCook quinoa in broth in medium saucepan according to package directions. Stir in spinach, pomegranate seeds and walnuts. Keep warm.\nRemove steaks from marinade; discard marinade. Place steaks on grid over medium, ash-covered coals. Grill, covered, 7 to 10 minutes (over medium heat on preheated gas grill, times remain the same) for medium rare (145 degrees F) to medium (160 degrees F) doneness, turning occasionally and basting with sauce.\nCarve steaks into slices; season with salt, as desired. Place quinoa on serving platter; top with cheese. Arrange beef around quinoa. Garnish with pomegranate seeds, if desired.\n",
        "picture_link": "Y2oqjw1Ux9PIBXnvII9EeHWK69ueGW2"
    },
    {
        "title": "Ms Piggie's Quick Coconut Ice Cream",
        "ingredients": [
            "1 cup coconut cream ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "1 cup white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place coconut cream, heavy cream, whole milk, and sugar in the jar of an electric blender; blend on medium speed for 2 minutes.\nFreeze cream mixture in an ice cream maker according to manufacturer's instructions.\n",
        "picture_link": "1jxbNOG4XLHixRRQYpggP9ytgceA8xK"
    },
    {
        "title": "Bitter Melon Jelly with Sago",
        "ingredients": [
            "Bitter Melon Jelly: ADVERTISEMENT",
            "1/4 piece bitter melon, halved and flesh and seeds removed ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "5 (3 ounce) packages lime-flavored gelatin mix ADVERTISEMENT",
            "2 cups hot water ADVERTISEMENT",
            "Optional Topping: ADVERTISEMENT",
            "1/2 cup pearl sago ADVERTISEMENT",
            "1/2 (14 ounce) can condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bitter melon and salt into a bowl; toss until melon is covered. Let sit until bitterness is extracted, about 40 minutes. Rinse melon under cold running water. Run the melon through a juicer to collect 1/2 to 1 fluid ounce of juice.\nCombine the melon juice and lime-flavored gelatin mix in a glass bowl. Pour in hot water; stir until gelatin is dissolved. Allow to cool, 3 to 5 minutes. Refrigerate until firm, about 4 hours.\nCombine 2 1/2 cups of water and pearl sago in a pot; bring to boil. Cook until sago becomes translucent, about 10 minutes. Strain the sago through a sieve. Place sago in a bowl; add condensed milk. Mix together until the milk coats the sago, stirring continuously so that they mixture does not clump. Top the chilled jelly with sago mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Goya Champuru (Bitter Melon Stir Fry)",
        "ingredients": [
            "2 Asian bitter melon (goya) ADVERTISEMENT",
            "kosher salt as needed ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 (1 pound) pork loin, cut into pieces ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "1 pinch garlic pepper, or to taste ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon soy sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut tips off melons with a sharp knife; cut in half lengthwise. Scoop out white interior and seeds with a spoon; rinse the melon. Cut into very small pieces. Place in a bowl and generously add kosher salt, mixing until melon is completely covered. Cover and refrigerate until flavors combine, about 5 minutes.\nRinse melon to remove excess salt. Place into a pot filled with water; cover and bring to a boil. Cook until melon has softened slightly, about 1 minute. Remove from heat; drain the melon.\nHeat sesame oil in a skillet over medium-high heat. Add pork; season with garlic salt and garlic pepper. Cook and stir until pork is no longer pink, 7 to 10 minutes. Add melon; cook until soft, about 5 minutes.\nReduce heat to medium. Push pork mixture to the edges of the skillet with a spatula. Crack eggs into the center of the skillet; scramble until firm, 3 to 5 minutes. Stir contents of the skillet together until combined. Season with soy sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Healthy Tasty Salmon Rice Bowl",
        "ingredients": [
            "1/2 pound salmon, cut into chunks ADVERTISEMENT",
            "1/2 cup thinly sliced kale, or to taste ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 (1/2 inch) piece fresh ginger, thinly sliced, or to taste ADVERTISEMENT",
            "1 tablespoon water, or more if needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup cooked rice, or to taste ADVERTISEMENT",
            "1 sheet seaweed, torn into small pieces ADVERTISEMENT",
            "1/2 teaspoon toasted sesame oil, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine salmon, kale, green onions, and ginger in a saucepan; add water and turn heat to medium-high. Bring liquid to a boil; reduce heat and simmer until salmon flakes easily with a fork, about 10 minutes. Add more water if needed. Season salmon with salt and pepper.\nStir rice into salmon mixture; cook until heated through, 2 to 3 minutes. Remove saucepan from heat. Stir seaweed into mixture and top with sesame oil.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bitter Melon, Zucchini, and Eggs",
        "ingredients": [
            "1 cup chopped bitter melon ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cups chopped zucchini ADVERTISEMENT",
            "3/4 cup chopped bell pepper ADVERTISEMENT",
            "3/4 cup chopped sweet onion ADVERTISEMENT",
            "4 large cloves garlic, chopped ADVERTISEMENT",
            "8 eggs, lightly beaten ADVERTISEMENT",
            "3 tablespoons sour cream ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix bitter melon and 1 tablespoon salt together in a bowl. Let stand until water is drawn out of bitter melon, about 20 minutes. Rinse melon; squeeze out excess moisture with your hands.\nHeat butter in a 12-inch skillet over medium heat; cook and stir bitter melon, zucchini, bell pepper, sweet onion, and garlic in the skillet until tender, 10 to 15 minutes. Drain excess liquid; return vegetables to skillet.\nCombine eggs, sour cream, Parmesan cheese, melted butter, 1/2 teaspoon salt, and ground black pepper together in a bowl; stir until combined. Pour egg mixture over vegetable mixture; cook and stir over medium heat until eggs are set but still very moist, 5 to 8 minutes. Top with Cheddar cheese; cover and turn off heat. Allow to rest until eggs have set and cheese is melted, 2 to 4 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lemon Parmesan Zucchini Chips with Basil Aioli",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup fresh basil ADVERTISEMENT",
            "2 cups panko breadcrumbs ADVERTISEMENT",
            "1/2 cup grated Stella® Parmesan cheese ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "Salt and pepper, to taste ADVERTISEMENT",
            "2 medium zucchini, sliced 1/4-inch thick ADVERTISEMENT",
            "1/2 cup flour ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree the mayonnaise and fresh basil and set aside.\nMix breadcrumbs, Stella Parmesan cheese, lemon zest, salt and pepper in a shallow bowl.\nDredge the zucchini slices in flour, dip in egg, and coat in the breadcrumb mixture.\nFry the coated zucchini slices in oil until lightly golden brown, about 2-3 minutes per side. Or, place them on a wire rack on a baking pan, sprayed lightly with oil, and bake in a preheated 425 degrees F (220 degrees C) oven until lightly golden brown, about 15-20 minutes.\nServe zucchini chips with the basil aioli.\n",
        "picture_link": "4A12MfC9GiDE4hDvC/OM0.jZ26MCILG"
    },
    {
        "title": "Bottled Spaghetti Sauce",
        "ingredients": [
            "39 pounds fresh tomatoes, halved ADVERTISEMENT",
            "3 pounds onions, halved ADVERTISEMENT",
            "2 heads garlic cloves, peeled ADVERTISEMENT",
            "2 cups olive oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup salt ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "6 (6 ounce) cans tomato paste, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add fourteen 1-quart jars; simmer to sterilize. Wash lids and rings in warm soapy water.\nPuree tomatoes in batches in a blender until smooth. Pour into a large pot. Add onions and garlic to the blender; puree until smooth. Mix into the pot.\nStir olive oil, sugar, salt, oregano, and basil into the pot; bring to a boil. Stir in tomato paste. Simmer sauce, adding more tomato paste if needed, until thickened, about 2 hours.\nPack sauce into hot, sterilized jars, filling to within 1/4 inch of the top. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars 2 inches apart into the boiling water using a holder. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 45 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool, at least 24 hours. Press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hearty Pumpkin Beef Soup",
        "ingredients": [
            "12 1/2 cups water ADVERTISEMENT",
            "1 (1 pound) pumpkin, cut into cubes ADVERTISEMENT",
            "2 pounds beef bottom round, cut into cubes ADVERTISEMENT",
            "1/2 pound beef soup bones, trimmed of excess fat ADVERTISEMENT",
            "2 tablespoons sea salt ADVERTISEMENT",
            "1 (14 ounce) can MSG-free beef broth (such as Swanson®) ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 leaves Chinese thyme ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "4 ears corn, cut into thirds ADVERTISEMENT",
            "2 large carrots, chopped ADVERTISEMENT",
            "1 large potato, cubed ADVERTISEMENT",
            "1 (3 ounce) package pumpkin beef noodles (such as Maggi®) (optional) ADVERTISEMENT",
            "1 bitter melon, seeded and chopped ADVERTISEMENT",
            "1 small radish, peeled and sliced into half moons ADVERTISEMENT",
            "1 Scotch bonnet chile pepper, chopped ADVERTISEMENT",
            "2 green onions, pressed flat with a knife ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a large pot. Place pumpkin in a blender. Cover and blend until pureed.\nStir pureed pumpkin, beef, soup bones, and salt into the water; add beef broth, garlic, thyme, and ground black pepper. Cover the soup and simmer until until beef is nearly tender and cooked through, about 40 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\nStir corn, carrots, potato, noodles, bitter melon, radish, Scotch bonnet chile pepper, and green onions into the soup; cook uncovered until vegetables are tender, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spiralized Cucumber and Jicama Tostada Salad with Avocado",
        "ingredients": [
            "1 jicama, cut into spirals ADVERTISEMENT",
            "1 English cucumber, cut into spirals ADVERTISEMENT",
            "1/2 red onion, cut into spirals ADVERTISEMENT",
            "2 mini sweet bell peppers, cut into matchstick pieces ADVERTISEMENT",
            "1 large jalapeno, cut into spirals ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon avocado oil ADVERTISEMENT",
            "2 avocados, mashed ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "4 prepared tostada shells ADVERTISEMENT",
            "10 grape tomatoes, halved ADVERTISEMENT",
            "1/4 cup chopped cilantro (optional) ADVERTISEMENT",
            "1 lime, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place jicama, cucumber, red onion, and bell peppers together in a mixing bowl. Toss with lime juice and avocado oil until combined; refrigerate until chilled, about 20 minutes.\nSeason the mashed avocado with garlic salt. Spread the avocado mixture evenly over tostada shells. Top evenly with jicama mixture and grape tomatoes. Garnish with cilantro and serve with lime wedges.\n",
        "picture_link": "ZQ5pn4riKZO5K7AOUVvy6nyMwjMPx5W"
    },
    {
        "title": "Spaghetti Squash Alfredo with Sausage and Walnuts",
        "ingredients": [
            "1 large spaghetti squash, halved and seeded ADVERTISEMENT",
            "2 tablespoons butter (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 (8 ounce) package walnuts ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pound Italian sausage, cut into chunks ADVERTISEMENT",
            "1 (16 ounce) jar Alfredo sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place spaghetti squash cut-side down in a microwave-safe dish. Pour in 1/4 cup water. Microwave on high until easily pierced with a fork, about 7 minutes.\nScrape insides of squash into spaghetti strands with a fork. Transfer to a bowl; add butter, salt, and pepper.\nHeat olive oil in a large skillet over medium heat. Add garlic; cook and stir until fragrant, about 1 minute. Add to bowl with spaghetti squash. Add walnuts and a pinch of salt to the skillet; cook and stir until toasted, about 1 minute. Transfer to a small bowl.\nPlace sausage in the skillet; cook and stir until browned, about 5 minutes. Pour in Alfredo sauce and stir until heated through, about 5 minutes. Spoon sausage mixture over squash and top with walnuts.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Watermelon, Feta and Cashew Salad",
        "ingredients": [
            "1 small ripe seedless watermelon ADVERTISEMENT",
            "1 head Bibb or Boston lettuce ADVERTISEMENT",
            "4 ounces feta cheese ADVERTISEMENT",
            "1/2 cup toasted cashews ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Fresh mint or basil leaves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Halve watermelon; scoop out balls of melon with a melon baller into a bowl. Separate leaves of lettuce and arrange like cups in a layer on a serving platter. Place melon balls on the lettuce. Crumble feta cheese over the salad and top with toasted cashews.\nWhisk rice vinegar, olive oil, salt and pepper together. Drizzle over the salad. Garnish with mint or basil leaves.\n",
        "picture_link": "65VSbcVgel.LcRX4hsceClmYLnYokwy"
    },
    {
        "title": "Gluten-Free Raspberry Zucchini Bread",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup coconut sugar ADVERTISEMENT",
            "1/2 cup coconut oil, melted ADVERTISEMENT",
            "1/2 cup unsweetened applesauce ADVERTISEMENT",
            "1/2 cup cane sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground Ceylon cinnamon ADVERTISEMENT",
            "1 teaspoon Himalayan salt ADVERTISEMENT",
            "1 1/2 cups gluten-free all-purpose baking flour ADVERTISEMENT",
            "1 1/2 cups chickpea flour (besan) ADVERTISEMENT",
            "3 cups grated, drained zucchini ADVERTISEMENT",
            "1 cup pecans ADVERTISEMENT",
            "1 cup fresh raspberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease 2 loaf plans with coconut oil and sprinkle with gluten-free flour.\nBeat eggs in a large bowl; stir in coconut sugar, coconut oil, applesauce, cane sugar, vanilla extract, baking soda, baking powder, Ceylon cinnamon, and Himalayan salt. Mix in gluten-free flour and chickpea flour, 1 cup at a time; stir until mixed well. Fold in zucchini, pecans, and raspberries. Pour batter into the prepared loaf pans.\nBake in preheated oven until a toothpick inserted into the center comes out clean, about 1 1/4 hours.\n",
        "picture_link": "EhzhfShZbkgrZ9ZKwbSRYzTfYDNSebG"
    },
    {
        "title": "Chestnut Flour Crepes (Gluten- and Wheat-Free)",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup chestnut flour ADVERTISEMENT",
            "vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk milk, eggs, and 1 tablespoon vegetable oil together in a bowl until thoroughly combined. Sprinkle in the chestnut flour 1/4 cup at a time, mixing well to avoid lumps, until batter is a liquid consistency. Whisk vigorously; pour through a fine strainer to remove any lumps.\nHeat cooking oil in an 8-inch crepe pan over medium-high heat. Pour in 1/4 cup of batter; swirl batter around to cover the entire surface. Cook until the edges have browned and are easily loosened with a spatula, 2 to 3 minutes per side. Transfer to a serving plate. Repeat with remaining batter.\n",
        "picture_link": "RFVIobQtNUP7s6Dq2jEbPC00l29aRXG"
    },
    {
        "title": "Open-Face Toasted Caprese",
        "ingredients": [
            "Balsamic Drizzle: ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1 teaspoon brown sugar (optional) ADVERTISEMENT",
            "Toast: ADVERTISEMENT",
            "1 loaf crusty sourdough or ciabatta bread, sliced ADVERTISEMENT",
            "Olive oil, to drizzle over bread slices and avocados ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 avocados - peeled, pitted and sliced ADVERTISEMENT",
            "1 (8 ounce) package Stella® fresh mozzarella, sliced ADVERTISEMENT",
            "Fresh basil leaves ADVERTISEMENT",
            "4 heirloom tomatoes, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add vinegar and brown sugar, if using, to a small saucepan and bring to a boil.\nReduce to a very low simmer and cook for 10-15 minutes, until liquid reduces by about half and is slightly syrupy. Remove from heat, pour vinegar in a bowl or glass to be used later, and set aside to cool and thicken.\nPreheat oven to 450 degrees F (230 degrees C) or grill to high heat.\nPlace the slices of bread on a baking sheet and drizzle with olive oil on both sides. Rub each side of bread with the halved garlic clove. Sprinkle with salt and pepper to taste.\nDrizzle avocado with olive oil, salt and pepper to taste.\nPlace bread slices and avocado slices in oven or grill both until lightly charred, about 2 to 3 minutes per side. Remove from the oven or grill.\nSlice Stella fresh mozzarella and divide equally among the sandwiches. Place on top toast, then add fresh basil to taste. Add grilled avocado slices and tomato slices. Drizzle everything with olive oil, balsamic drizzle and salt and pepper to taste.\n",
        "picture_link": "xjzZoFlFegtiZqumeWJ9c09oFNPII4W"
    },
    {
        "title": "Cherry Tomato and Corn Salad ",
        "ingredients": [
            "1 ear corn on the cob, unhusked, or to taste ADVERTISEMENT",
            "1 pint cherry tomatoes, halved ADVERTISEMENT",
            "4 ounces smoked Gouda cheese, cut into 1/2-inch cubes ADVERTISEMENT",
            "2 tablespoons olive oil, or to taste ADVERTISEMENT",
            "8 fresh basil leaves, cut into strips, or to taste ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium-high heat and lightly oil the grate.\nPlace corn on the grill; cover and cook until husks are blackened, 15 to 20 minutes. Let sit until easily handled, about 5 minutes. Discard husk and silks; cut kernels off the cob.\nCombine corn kernels, cherry tomatoes, Gouda cheese, olive oil, basil, salt, and pepper in a large bowl; mix gently to blend.\n",
        "picture_link": "pmEpSPq2F3ZpU4e3pC9VsVOi3cpka9m"
    },
    {
        "title": "Ma's Frozen Pickles",
        "ingredients": [
            "8 cups peeled and sliced cucumbers ADVERTISEMENT",
            "1 small onion, sliced ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cucumbers, onion, and salt in a bowl filled with water. Refrigerate until vegetables are softened, about 2 hours; drain.\nCombine sugar and vinegar in a saucepan; bring to a boil. Remove from heat; cool to room temperature. Pour liquid over cucumber mixture. Freeze until frozen, 1 to 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cauliflower Macaroni and Cheese Casserole",
        "ingredients": [
            "1 cup sausage links ADVERTISEMENT",
            "1 1/2 cups elbow macaroni ADVERTISEMENT",
            "1 head cauliflower, cut into florets ADVERTISEMENT",
            "1/4 cup butter, melted, or more as needed ADVERTISEMENT",
            "1/4 cup all-purpose flour, or more as needed ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 cups grated Cheddar cheese, divided ADVERTISEMENT",
            "2 slices bread, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 2 1/2-quart casserole dish.\nHeat a skillet over medium heat; cook sausage until heated through, 5 to 7 minutes. Cut sausage into small cubes.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 minutes. Drain.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, 5 to 6 minutes.\nMelt butter in a saucepan over medium heat; add flour and cook until a thick paste forms, 1 to 2 minutes. Slowly mix milk into butter-flour mixture until sauce is smooth and thickened, 2 to 4 minutes. Stir 1 cup Cheddar cheese into sauce until melted and smooth.\nSpread cauliflower into the prepared casserole dish; top with macaroni, covering the entire surface. Stir cheese sauce into cauliflower and macaroni until well coated. Sprinkle 1 cup Cheddar cheese over the top.\nBake in the preheated oven until cheese is melted and bubbling, about 35 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Classic Bing Cherry Pie",
        "ingredients": [
            "1 (15 ounce) package double crust ready-to-use pie crust ADVERTISEMENT",
            "4 cups Bing cherries, pitted and sliced ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup instant tapioca ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Press the bottom pie crust into a pie pan.\nCombine cherries, sugar, tapioca, lemon juice, and almond extract together in bowl. Refrigerate until cherry filling begins to set, about 10 minutes. Stir filling again; chill until flavors combine, about 10 minutes.\nPour the filling into the bottom half of the pie crust; cover with top crust, crimp the edges to seal, and dot with butter. Cut vents into the top with a sharp knife.\nBake in the preheated oven for 30 minutes; rotate the pie 1/4 of a turn. Continue baking until the crust is golden brown, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Salsa Verde Chicken and Rice Tortilla Soup",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "2 cooked chicken breast halves, shredded ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Fiesta Sides™ - Mexican Rice ADVERTISEMENT",
            "1 cup red bell pepper, diced ADVERTISEMENT",
            "1 cup salsa verde ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1 cup crushed tortilla chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure water into a pot and bring to a boil over medium-high heat. Add chicken, Knorr(R) Fiesta SidesTM - Mexican Rice, red bell pepper, and salsa verde. Reduce to a low and simmer until the rice is fully cooked, about 10 minutes. Stir in lime juice, continue to simmer for another 2 minutes.\nServe in bowls topped with crushed tortilla chips.\n",
        "picture_link": "gKlymgCEerb2uLefVGdcwochmKQVfMy"
    },
    {
        "title": "Arroz Poblano (Poblano Rice)",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 boneless, skinless chicken breast halves ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 poblano pepper - roasted, seeded, chopped ADVERTISEMENT",
            "1/2 cup corn (frozen, canned, or fresh) ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "1 tablespoon buttery spread (optional) ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Fiesta Sides™ - Yellow Rice ADVERTISEMENT",
            "Lime wedges, for serving (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a large skillet over medium-high heat. Add oil and heat until shimmering. Add chicken breast, cook until completely cooked through and browned on both sides. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove chicken from skillet, tent loosely with foil to keep warm and set aside.\nReturn skillet to heat. Add onion and cook for 3-4 minutes, stirring occasionally. Add garlic and cook one more minute. Stir in roasted and chopped poblano pepper. Remove from skillet and set aside.\nIn same skillet, place corn, water, buttery spread (if using) and contents of rice package. Bring to a boil, cover and reduce heat. Simmer for 7 minutes or until water has been absorbed and rice is tender. Add onion mixture back to skillet and toss together.\nPlace rice mixture on a serving platter. Slice chicken and place on top of rice (or chop into bite-sized pieces and stir into rice, then plate). Serve immediately.\n",
        "picture_link": "NmhKcIMP8.njbiP/aFRHxW8dqEqmKHK"
    },
    {
        "title": "Chicken Brine",
        "ingredients": [
            "3 1/2 quarts water ADVERTISEMENT",
            "1 (750 milliliter) bottle Sauvignon Blanc (such as Barefoot®) ADVERTISEMENT",
            "1/2 cup sea salt, or to taste ADVERTISEMENT",
            "3 ounces ginger, grated ADVERTISEMENT",
            "3 sprigs fresh parsley leaves, chopped ADVERTISEMENT",
            "3 sprigs fresh thyme leaves, chopped ADVERTISEMENT",
            "3 sprigs fresh rosemary leaves, chopped ADVERTISEMENT",
            "1 navel orange, zested ADVERTISEMENT",
            "2 lemons, zested ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, Sauvignon Blanc, and sea salt in a large pot. Bring to a boil; cook and stir until salt is dissolved, 2 to 3 minutes. Stir in ginger, parsley, thyme, rosemary, orange zest, lemon zest, garlic, and cayenne pepper. Let brine steep, covered, until cool, 4 to 5 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ranch Burger",
        "ingredients": [
            "1 pound ground beef (93% lean or leaner) ADVERTISEMENT",
            "1/4 cup soft bread crumbs ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1 medium red onion, cut crosswise into 1/2-inch thick slices ADVERTISEMENT",
            "1 tablespoon vegetable oil, divided ADVERTISEMENT",
            "4 whole-wheat buns, split and toasted ADVERTISEMENT",
            "Romaine lettuce ADVERTISEMENT",
            "Tomato slices ADVERTISEMENT",
            "1/4 cup reduced-fat creamy ranch dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine Ground Beef, bread crumbs, egg white and seasoned salt in medium bowl, mixing lightly but thoroughly. Lightly shape into four 1/2-inch thick patties. Brush onion slices with 1/2 tablespoon oil.\nPlace patties and onion slices on grid over medium, ash-covered coals. Grill patties, covered, 8 to 10 minutes (over medium heat on preheated gas grill 7 to 9 minutes), until instant-read thermometer inserted horizontally into center registers 160 degrees F, turning occasionally. Grill onions, 11 to 13 minutes or until tender, brushing with remaining 1/2 tablespoon oil and turning occasionally.\nLine bottom of each bun with lettuce. Place tomatoes and burgers on lettuce. Spoon dressing over burgers; top with onions. Close sandwiches.\n",
        "picture_link": "XuHWx29YGLt3XXlLuec8WYWC1NL3dYC"
    },
    {
        "title": "Beef and Spinach Breakfast Sandwich",
        "ingredients": [
            "12 ounces cooked beef (such as steak, roast, pot roast or deli roast beef), thinly sliced ADVERTISEMENT",
            "4 eggs or equivalent egg substitute ADVERTISEMENT",
            "1/2 cup chopped fresh baby spinach ADVERTISEMENT",
            "1/2 cup diced tomatoes ADVERTISEMENT",
            "Salt and black pepper (optional) ADVERTISEMENT",
            "4 slices reduced-fat Swiss cheese ADVERTISEMENT",
            "4 whole wheat round thin sandwich breads, split, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine eggs, spinach and tomato in medium bowl. Spray large nonstick skillet with cooking spray; heat over medium-high heat until hot. Add egg mixture; cook 2 to 4 minutes or until eggs are almost set, stirring occasionally. Sprinkle with salt and pepper, if desired.\nDivide egg mixture into 4 separate portions in pan. Evenly top with cheese and beef. Remove from heat and cover. Let stand 1 to 2 minutes or until cheese is melted.\nPlace one egg portion on bread bottoms. Close sandwiches; serve immediately.\n",
        "picture_link": "lEcb6iGM2GYf5CmATZg7DsJ65FRrrmO"
    },
    {
        "title": "Frozen Strawberry Salad",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 (10 ounce) package frozen strawberries in juice, thawed ADVERTISEMENT",
            "1/2 cup crushed pineapple, drained ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cream cheese and sugar in a bowl; add strawberries and pineapple. Fold in the whipped topping.\nLine a loaf pan with parchment paper. Pour the strawberry mixture into the loaf pan.\nPlace in the freezer until firm, about 6 hours. Set loaf pan in a warm water bath to loosen. Flip mixture onto a cutting board to remove; cut into slices.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken and Brie Sandwiches with Roasted Cherry Tomatoes",
        "ingredients": [
            "1 pound skinless, boneless chicken breasts ADVERTISEMENT",
            "1/2 cup Italian-style salad dressing, or to taste ADVERTISEMENT",
            "3 ounces Brie cheese, sliced ADVERTISEMENT",
            "1 tablespoon olive oil, divided ADVERTISEMENT",
            "2 cups cherry tomatoes, halved ADVERTISEMENT",
            "1/4 teaspoon kosher salt, divided ADVERTISEMENT",
            "3 tablespoons balsamic vinegar, divided ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "2 cups fresh spinach leaves ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 loaf French bread, halved lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts in a shallow dish. Coat with Italian dressing. Cover with plastic wrap and let marinate in the refrigerator, 8 hours to overnight.\nHeat a grill pan over medium-high heat. Remove chicken breasts from marinade and place in the skillet; cook until no longer pink in the center and the juices run clear, about 6 minutes per side.\nSlice chicken breasts; lay Brie cheese on top to melt.\nPreheat oven to 300 degrees F (150 degrees C).\nHeat 1 teaspoon olive oil in an oven-safe skillet over medium heat. Add tomatoes and 1/8 teaspoon salt; cook, stirring once, until tomatoes release their juices, about 4 minutes. Remove from heat and stir in 2 tablespoons balsamic vinegar and basil.\nTransfer skillet to the preheated oven; bake tomatoes until softened, about 15 minutes.\nCombine remaining 2 teaspoons olive oil, 1 tablespoon balsamic vinegar, and 1/8 teaspoon salt in a bowl. Add spinach; toss to coat.\nMix mayonnaise, Dijon mustard, garlic, and pepper together in a bowl.\nPlace bottom half of the loaf on a baking sheet. Spread mayonnaise mixture on top. Cover with spinach and tomatoes. Place chicken with Brie cheese on top. Cover with top half of the loaf.\nBake in the preheated oven until heated through, 5 to 10 minutes. Cut into 4 sections.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Chicken Enchilada Rice",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves, diced ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Fiesta Sides™ - Yellow Rice ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/2 (19 ounce) can enchilada sauce ADVERTISEMENT",
            "1/2 cup sweet corn ADVERTISEMENT",
            "1/2 cup reduced-sodium black beans, rinsed and drained ADVERTISEMENT",
            "1 large tomato, seeded and chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large skillet over medium-high heat and cook chicken, stirring frequently, until chicken is cooked, about 5 minutes.\nStir in Knorr(R) Fiesta SidesTM- Mexican Rice, water, and enchilada sauce. Add corn, beans, and tomato. Bring to a boil, reduce heat to low, and simmer, covered, until rice is tender, about 7 minutes. In the last minute of cooking, add the cilantro.\nTop with Cheddar cheese and serve.\n",
        "picture_link": "2HG/K2ByHNOoGaEmzleCLFCn2mkzcv."
    },
    {
        "title": "Glorified Picnic Rice",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup white rice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (20 ounce) can pineapple chunks, drained, reserving juice ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "1 (4 ounce) jar maraschino cherries, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and rice in a 3-quart saucepan. Bring to boil; simmer until water is absorbed and rice is tender, about 15 minutes. Allow to cool.\nMix sugar and flour together in a bowl. Stir sugar mixture, pineapple juice, and beaten eggs together in a saucepan; cook and stir over medium-low heat until the mixture has the consistency of pudding, about 5 minutes. Allow to cool.\nMix rice, pudding, pineapple, whipped topping, and cherries together in a bowl. Refrigerate until chilled, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Cherry Pie",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1/4 cup cold water, or as needed ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "Cherry Filling: ADVERTISEMENT",
            "2 pounds fresh Bing cherries, pitted ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons tapioca flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour and salt together in a bowl. Cut in shortening with 2 knives or pastry blender until the mixture resembles coarse crumbs. Add cold water, 1 tablespoon at a time, tossing with a fork, until flour mixture is moistened. Do not add more water than you need: when you squeeze a handful of the moistened pastry mixture, it should form a ball.\nDivide the dough in half and shape into balls. Wrap in plastic wrap and refrigerate, at least 1 hour or up to 3 days.\nPreheat oven to 375 degrees F (190 degrees C).\nMix cherries, sugar, and tapioca flour together in a saucepan; let sit until the sugar draws out the cherries' juices, about 10 minutes. Heat the cherry mixture over medium heat until the juices begin to thicken and run clear, about 5 minutes. Remove from heat; mix in butter and vanilla extract. Let sit until filling has cooled to lukewarm, 5 to 10 minutes.\nRoll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate. Spoon filling into crust using a slotted spoon to drain excess syrup; dot with butter. Cut left over dough into strips with a sharp paring knife or pastry wheel. Lay strips on top of the pie, pressing to seal the edges.\nBake in the preheated oven until crust is a golden brown, 40 to 50 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Perfect Sour Cherry Pie",
        "ingredients": [
            "2 (15 ounce) packages double crust ready-to-use pie crust ADVERTISEMENT",
            "2 pounds sour cherries, pitted ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 1/2 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Press the bottom pie crusts into 2 pie pans.\nCombine cherries, 1 cup plus 2 tablespoons sugar, and cornstarch in a saucepan. Let sit until sugar begins to draw out the cherries' juices, about 10 minutes. Bring to boil, stirring constantly. Lower the heat; simmer until the juices thicken and become translucent, about 5 minutes. Remove from heat; stir in butter and almond extract until well mixed. Pour into the bottom half of the pie shells. Cover with top crusts, crimp the edges to seal, and cut vents into the top with a sharp knife.\nBake in the preheated oven until crust is golden brown, 45 to 55 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hippie Juice",
        "ingredients": [
            "1 (1.75 liter) bottle raspberry lemonade (such as Simply Lemonade®) ADVERTISEMENT",
            "1 1/2 cups watermelon vodka ADVERTISEMENT",
            "1/2 cup coconut-flavored rum (such as Malibu®) ADVERTISEMENT",
            "1/2 cup triple sec ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 2 1/2 cups raspberry lemonade out of the bottle into a glass measuring cup.\nPour watermelon vodka, coconut-flavored rum, and triple sec into the bottle; stir to combine. Fill bottle back to the top with raspberry lemonade from the measuring cup. Refrigerate until serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hispanic Tilapia and Rice Bowl",
        "ingredients": [
            "4 (4 ounce) tilapia fillets ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 (15 ounce) can reduced-sodium black beans, rinsed and drained ADVERTISEMENT",
            "1 (15.25 ounce) can no-salt-added whole-kernel corn, drained ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "2 tablespoons medium chunky salsa ADVERTISEMENT",
            "1/4 teaspoon cumin ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Fiesta Sides™ - Yellow Rice ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pat tilapia filets dry with paper towels and season both sides with salt and pepper.\nIn large skillet, heat oil and add tilapia filets. Cook until fish releases easily with a spatula; flip and cook until fish is cooked through and flakes easily with a fork, 5 to 8 minutes. Remove from skillet and set aside, tenting loosely with foil to keep warm.\nAdd beans, corn, water, salsa, cumin, chili powder and contents of rice package to skillet, stir well. Bring to a boil, cover and reduce heat. Simmer until water has been absorbed and rice is tender, about 7 minutes.\nPlace rice in a serving dish and top with fish. Serve immediately.\n",
        "picture_link": "AfaLDGVuFsOrZ8zlfI.73tMeeO5pime"
    },
    {
        "title": "Carolina Barbecue Burgers",
        "ingredients": [
            "1 pound ground beef (93% lean or leaner) ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup beer ADVERTISEMENT",
            "1/4 cup yellow mustard ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1 cup thinly sliced cabbage ADVERTISEMENT",
            "4 hamburger buns, split and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To prepare barbecue sauce, combine brown sugar, beer, mustard and vinegar in small saucepan; bring to a boil. Reduce heat and simmer 15 to 17 minutes until thickened and reduced to 1/2 cup, stirring occasionally.\nLightly shape Ground Beef into four 1/2-inch thick patties. Place patties on grid over medium, ash-covered coals. Grill, covered, 8 to 10 minutes (over medium heat on preheated gas grill, covered, 7 to 9 minutes) until instant-read thermometer inserted horizontally into center registers 160 degrees F, turning occasionally. About 2 minutes before burgers are done, place bun, cut sides down, on grid. Grill until lightly toasted.\nSpoon 1 tablespoon sauce on bottom of each bun; top with burger. Evenly top burgers with cabbage. Evenly spoon remaining sauce over cabbage. Close sandwiches.\n",
        "picture_link": "R8ng76jkTleAQhYhKGa52M7R09u6Ubq"
    },
    {
        "title": "Cedar-Smoked Baby Back Ribs ",
        "ingredients": [
            "2 tablespoons garlic powder ADVERTISEMENT",
            "2 tablespoons onion powder ADVERTISEMENT",
            "1 tablespoon fine sea salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 rack baby back pork ribs ADVERTISEMENT",
            "1 (6x18-inch) cedar plank ADVERTISEMENT",
            "3/4 cup barbeque sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix garlic powder, onion powder, salt, and black pepper together in a small bowl. Spread over baby back ribs. Cover with plastic wrap and refrigerate, 8 hours to overnight.\nPlace plank on a rimmed baking sheet and pour in enough water to cover. Let soak before grilling, about 1 hour. Drain.\nPreheat an outdoor grill to about 500 degrees F (260 degrees C). Place plank on the grate and heat until slightly blackened, about 5 minutes. Flip plank and place ribs on top. Lower heat and cover the grill. Cook ribs, sprinkling some water on top every 30 minutes to create steam inside the grill, until tender, about 3 hours.\nUncover grill and increase heat to high. Brush barbeque sauce over ribs. Cook until ribs are dark brown, about 2 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "South African Sugar Bean Soup",
        "ingredients": [
            "2 1/2 cups speckled sugar beans ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "2 pounds bone-in beef chuck, cut into chunks ADVERTISEMENT",
            "4 large onions, thickly sliced ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "2 1/2 tablespoons hot water ADVERTISEMENT",
            "3/4 cup red wine ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "1 packet dry oxtail soup mix ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sugar beans into a large container and cover with several inches of cool water; let soak, 8 hours to overnight.\nCombine beef chuck and onions in a large pot over medium heat. Cook until beef is tender and falling off the bone, about 1 1/2 hour. Transfer beef to a cutting board; discard bones and cut beef into bite-size pieces. Place onions in a bowl.\nPour sugar beans and their soaking water into the pot. Bring to a boil; reduce heat and simmer, adding more water if needed, until beans are tender, about 1 hour. Stir in beef pieces and onions; bring soup to a boil.\nDissolve beef bouillon cube in 2 1/2 tablespoons hot water in a bowl. Stir in wine, tomato paste, dry soup mix, Worcestershire sauce, soy sauce, and cayenne pepper. Gradually mix into the boiling soup. Reduce heat and simmer until flavors combine, about 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kagianas (Greek Eggs and Tomato)",
        "ingredients": [
            "3 large ripe tomatoes, quartered ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tomatoes into a food processor; blend until smooth.\nHeat olive oil in a skillet over medium-high heat. Stir in tomatoes, salt, and pepper; cook and stir until all liquid has evaporated from the tomatoes, 10 to 15 minutes.\nReduce heat to medium. Add eggs; cook, stirring constantly, until mixture is evenly dry and no large chunks remain, 7 to 10 minutes.\n",
        "picture_link": "hAct5c2fha0fqPl/fLQpr2Wl9gZ.G4i"
    },
    {
        "title": "Rice and Veggie Salad with Knorr® Sides",
        "ingredients": [
            "1 (5.4 ounce) package Knorr® Rice Sides™ - Herb & Butter ADVERTISEMENT",
            "1 orange bell pepper, seeded and chopped ADVERTISEMENT",
            "1 cucumber, peeled and sliced ADVERTISEMENT",
            "1 (10.5 ounce) container cherry or grape tomatoes, halved ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 (10 ounce) package frozen shelled edamame, prepared according to package directions ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare rice according to package directions. Transfer to a large bowl and let cool.\nAdd bell peppers, cucumbers, tomatoes, onion, edamame, lime juice, olive oil, salt and pepper. Mix well and refrigerate until ready to serve!\n",
        "picture_link": "6DoA1c7INVwnXaDg0idmWuE1uDiPVae"
    },
    {
        "title": "Doughnut Grilled Cheese Sandwich",
        "ingredients": [
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1 glazed raised ring doughnut, halved horizontally ADVERTISEMENT",
            "2 slices Gouda cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread butter onto the cut sides of the doughnut.\nPreheat a skillet over medium heat. Place 1 doughnut slice, butter side down, into the skillet. Lay Gouda cheese on doughnut slice; top with remaining doughnut slice, butter side out. Flatten with a spatula. Cook, flipping once, until lightly browned on both sides and cheese is melted, about 4 minutes.\n",
        "picture_link": "c2ttQHuJBsRAALt09lrvpm3hF3jvU1y"
    },
    {
        "title": "South African Milk Tart",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "1 teaspoon margarine ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 teaspoons all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons cornstarch ADVERTISEMENT",
            "1 teaspoon vanilla extract, or to taste ADVERTISEMENT",
            "2 dashes ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine 1/2 cup margarine and 1/2 cup sugar in a bowl; beat with an electric mixer on low speed until creamy. Add 2 cups flour, 1 egg, baking powder, and salt; mix well until dough comes together.\nPress dough into bottom and sides of two 8-inch pie plates to form crusts.\nBake in the preheated oven until lightly golden, about 10 minutes. Remove from oven and let cool.\nCombine milk and 1 teaspoon margarine in a saucepan over medium-low heat; bring to a boil. Remove from heat.\nMix 1 1/2 cup sugar, 2 eggs, 2 1/2 teaspoons flour, cornstarch, and vanilla extract into a smooth paste in a bowl. Pour over hot milk in the saucepan.\nReturn saucepan to medium heat and stir milk mixture until thick, 5 to 8 minutes.\nDivide milk mixture evenly between the cooled crusts. Sprinkle cinnamon on top. Cool until filling is set, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dry Brined Turkey",
        "ingredients": [
            "Brine: ADVERTISEMENT",
            "1/4 cup salt ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (12 pound) thawed whole turkey, neck and giblets removed ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 yellow onion, quartered ADVERTISEMENT",
            "6 baby carrots, cut in half ADVERTISEMENT",
            "2 tablespoons softened butter ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix salt, brown sugar, and pepper together in a small bowl.\nRinse turkey in cold water; pat dry inside and out. Place turkey in a shallow baking pan. Rub outside with half of the salt mixture. Separate skin from the breast meat; rub remaining salt mixture between skin and breast meat. Place uncovered in the refrigerator, 8 to 12 hours.\nRemove turkey from refrigerator. Let sit until room temperature, about 1 hour.\nPreheat oven to 450 degrees F (230 degrees C).\nRinse turkey with cold water to remove salt mixture; place into a roasting pan. Stuff turkey cavity with celery, onion, and carrots. Separate turkey skin from the breast meat; rub softened butter onto breast meat. Pour chicken broth over the turkey.\nBake turkey in preheated oven, breast side up, for 30 minutes. Reduce heat to 325 degrees F (165 degrees C); cook, basting occasionally, until no longer pink at the bone and the juices run clear, about 2 hours. An instant-read thermometer inserted into the thickest part of the thigh should read 165 degrees F (74 degrees C). Remove turkey from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 30 minutes before slicing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Aunt Dora's Colombian Chicken with Potatoes",
        "ingredients": [
            "1 1/2 teaspoons olive oil ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "11 fluid ounces beef broth ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 tablespoon seasoning salt ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons ground turmeric ADVERTISEMENT",
            "1 1/2 teaspoons pimenton (paprika) ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "6 chicken thighs ADVERTISEMENT",
            "4 potatoes, peeled and quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a deep skillet over high heat. Add onions and garlic; cook and stir until onions are softened, about 5 minutes. Stir in red and green bell peppers; cook and stir until peppers are firm but tender, 5 to 7 minutes. Mix in beef broth, cumin, curry powder, seasoning salt, garlic powder, turmeric, pimenton, oregano, and pepper.\nSubmerge chicken thighs, skin side down, half way into broth mixture; stir to coat chicken. Bring to a boil; cover and reduce heat to low. Simmer until chicken is no longer pink, about 40 minutes.\nStir potatoes into the chicken mixture until mostly submerged; check that chicken thighs are still skin side down. Bring to a boil; cover. Reduce heat; simmer until potatoes are soft and chicken is cooked through, about 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Low-Carb Cauliflower Crust Breakfast Pie",
        "ingredients": [
            "cooking spray (such as Pam®) ADVERTISEMENT",
            "1/3 head cauliflower ADVERTISEMENT",
            "2 tablespoons coconut oil ADVERTISEMENT",
            "1 cup coarsely chopped red onion ADVERTISEMENT",
            "1 green bell pepper, coarsely chopped ADVERTISEMENT",
            "3 mushrooms, diced ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "6 slices cooked bacon, finely chopped, divided (optional) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 1/2 cups grated Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch glass pie pan with cooking spray.\nGrate cauliflower coarsely with a box grater. Measure out 1 1/2 cup of cauliflower \"rice\"; press into the bottom and sides of the pan to make a crust.\nBake in the preheated oven until crust looks dry, about 15 minutes.\nMelt coconut oil in a large skillet over medium heat. Add onion and bell pepper; cook and stir until softened, about 10 minutes. Add mushrooms and butter; cook and stir until mushrooms are lightly browned, about 5 minutes. Stir in 3 slices bacon. Season with salt and pepper.\nWhisk eggs in a bowl until blended. Whisk in sour cream until smooth. Stir in onion mixture and 1 cup Cheddar cheese.\nSprinkle 1/4 cup Cheddar cheese over the cauliflower crust. Spread egg mixture evenly over the cheese. Top with remaining 1/4 cup Cheddar cheese. Sprinkle remaining 3 slices bacon on top.\nBake in the preheated oven until a knife inserted into the center comes out clean, about 40 minutes. Remove from oven and let stand until set, 5 to 10 minutes.\n",
        "picture_link": ".QlAWtT8EubN1nM.KH3ogCgy1KrLWVu"
    },
    {
        "title": "Veggie-Packed Bolognese",
        "ingredients": [
            "1 (16 ounce) package Barilla® Rigatoni ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (8 ounce) package fresh button mushrooms, sliced ADVERTISEMENT",
            "1 medium yellow squash, coarsely chopped ADVERTISEMENT",
            "1 medium zucchini, coarsely chopped ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (24 ounce) jar Barilla® Meat Sauce ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 12-inch deep skillet heat the olive oil over medium heat, then add the mushrooms, squash, zucchini, onion, garlic and salt.\nCook and stir for 5 to 6 minutes or until just tender, then stir in the Meat Sauce and reduce heat to a low simmer.\nMeanwhile, bring 4 to 6 quarts of water to a rolling boil, adding salt to taste along with the Rigatoni, and stir gently.\nCook pasta according to package directions. Remove from heat and drain well.\nStir the pasta into the Meat Sauce mixture in the skillet.\nServe topped with Parmesan.\n",
        "picture_link": "kurVCDoW2RFZrqrhLFbAgiFAJ23a7Si"
    },
    {
        "title": "Barilla® Chickpeas and Pasta",
        "ingredients": [
            "1 (16 ounce) box Barilla® Penne pasta ADVERTISEMENT",
            "1 (16 ounce) can chickpeas, rinsed and drained, divided ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 medium zucchini, halved lengthwise and sliced crosswise ADVERTISEMENT",
            "1 (24 ounce) jar Barilla® Roasted Garlic Sauce ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F.\nIn a small bowl combine 1 cup chickpeas, 1 tablespoon oil, and salt; spread in an even layer in a 15x10x1-inch baking pan.\nRoast chickpeas about 30 minutes or until browned and crisp, stirring once halfway through roasting; cool completely.\nIn a food processor blend remaining chickpeas until finely processed; set aside.\nIn a large pot bring 4 to 6 quarts of water to a rolling boil; add salt to taste and the Penne; stir gently.\nCook pasta according to package directions; remove from heat and drain well, reserving 1 cup of the cooking liquid.\nMeanwhile, in a medium saucepan heat 2 teaspoons oil over medium heat; saute zucchini for 2 to 3 minutes; remove zucchini from pan and set aside.\nIn the same saucepan stir together the Roasted Garlic sauce and processed chickpeas; bring to a very low simmer.\nWhile pasta is draining, pour Roasted Garlic sauce mixture into large pot; stir in zucchini and 1 tablespoon rosemary; stir in pasta.\nStir in up to 1 cup of the reserved cooking liquid until desired consistency is reached; serve immediately topped with roasted chickpeas and crumbled feta.\n",
        "picture_link": "pErQI7b7vzWV.454oq7YhHAjtVRyibW"
    },
    {
        "title": "Spring Veggie Galette",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "3/4 cup chilled unsalted butter, cut into cubes ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon whole milk ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 shallots, thinly sliced ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "3/4 cup ricotta cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 lemon, zested and juiced ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "8 spears asparagus, or more to taste ADVERTISEMENT",
            "1/4 cup corn ADVERTISEMENT",
            "1/4 cup peas ADVERTISEMENT",
            "1 tablespoon heavy whipping cream, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix all-purpose flour, whole wheat flour, sugar, and 1/2 teaspoon kosher salt together in a food processor. Add cubed butter; pulse until mixture is the size of peas.\nWhisk 1 egg and milk together in a small bowl. Add to the food processor; pulse until dough clumps together.\nTurn dough out onto a sheet of plastic wrap. Bring together into a ball; flatten into a disk and chill until firm, at least 1 1/2 hour and up to overnight.\nRemove dough from the refrigerator. Let come to room temperature, about 1 hour.\nPreheat oven to 425 degrees F (220 degrees C).\nHeat oil in a large skillet over medium heat. Add shallots; cook and stir until translucent and edges are browned, about 3 minutes. Remove from heat; let cool.\nUnwrap dough and place on a work surface lined with parchment paper. Roll out into an 11-inch circle. Slide dough and parchment paper onto a baking sheet. Spread mustard over dough, leaving a 1-inch border.\nMix ricotta cheese, 1 egg, lemon zest, lemon juice, Parmesan cheese, salt, pepper, and red pepper flakes together in a bowl. Spread over mustard. Scatter shallots, asparagus, corn, and peas on top.\nLift corners of the parchment paper up to help fold the edges of the dough around the filling; gently pleat to seal. Brush heavy cream over edges of the dough.\nBake in the preheated oven until golden, about 35 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pomegranate Sorbet Smile",
        "ingredients": [
            "3 pomegranates ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons freshly squeezed lemon juice ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Score pomegranate rinds lengthwise and crosswise with a knife. Carefully crack open with the knife. Break flesh into quarters with your hands, using scored lines as a guide. Hold each quarter over a large bowl and whack firmly with a wooden spoon to release seeds.\nMash seeds in the bowl with a potato masher to release some juice. Add sugar and lemon juice; continue mashing to release more juice.\nBeat egg whites in a glass, metal, or ceramic bowl with an electric mixer until stiff peaks form. Mash into the pomegranate mixture in the bowl.\nBeat cream in a chilled glass or metal bowl with an electric mixer until thick. Mash into the pomegranate mixture, popping seeds to reach desired consistency.\nPour mixture into freezer-safe containers. Freeze until firm, about 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Superfood Green Smoothie",
        "ingredients": [
            "1 cup spinach leaves ADVERTISEMENT",
            "1 cup shredded kale ADVERTISEMENT",
            "1/2 pear, cut into chunks ADVERTISEMENT",
            "1/2 large ripe banana, sliced ADVERTISEMENT",
            "1/2 cup frozen blueberries ADVERTISEMENT",
            "1/3 cup plain yogurt ADVERTISEMENT",
            "4 ice cubes ADVERTISEMENT",
            "2 tablespoons ground flax seeds ADVERTISEMENT",
            "1/2 cup brewed green tea, chilled, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine spinach, kale, pear, banana, blueberries, yogurt, ice cubes, and ground flax seeds in a blender; pour in tea. Blend on high until mixture is smooth. Mix with a wooden spoon to redistribute ingredients if needed.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ethiopian Firfir with Dried Beef (Quanta Firfir)",
        "ingredients": [
            "2 red onions, chopped ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon garlic paste ADVERTISEMENT",
            "4 ripe tomatoes, chopped ADVERTISEMENT",
            "3 cups water, divided ADVERTISEMENT",
            "14 ounces dried beef ADVERTISEMENT",
            "2 tablespoons Ethiopian berbere seasoning ADVERTISEMENT",
            "1/2 cup Ethiopian kibbeh (spiced clarified butter) ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 pieces injera (Ethiopian bread) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place onions in a large saucepan over medium-high heat. Cook, covered, until starting to brown, about 5 minutes. Add vegetable oil and garlic paste; cook until fragrant, about 5 minutes. Stir in tomatoes; cook until softened, 5 to 7 minutes.\nStir 1/2 cup water, dried beef, and berbere seasoning into the saucepan. Reduce heat to medium and cook until flavors combine, about 10 minutes. Continue cooking, adding 1/3 cup water every few minutes, until beef is softened and sauce is thick, about 20 minutes. Stir in kibbeh and salt.\nTear 1 injera into palm-sized pieces; fold gently into the sauce. Serve beef and sauce over whole injera.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Green Apple Sorbet with Pistachios",
        "ingredients": [
            "Sorbet: ADVERTISEMENT",
            "2 large green apples, chopped ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "1 green apple, sliced ADVERTISEMENT",
            "1/2 cup pistachios, or to taste ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 chopped apples, water, white sugar, and lemon juice in a food processor; blend until smooth.\nPour blended apple mixture into an ice cream maker and freeze according to manufacturer's instructions for sorbet, 10 to 15 minutes.\nTop with sliced green apple, pistachios, and confectioners' sugar before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Potato Toast",
        "ingredients": [
            "1 large sweet potato ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "1 tablespoon jarred minced garlic ADVERTISEMENT",
            "1/4 cup whole milk ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "10 slices bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add sweet potato; cook until tender when pierced with a fork, 15 to 20 minutes. Drain and cool until easily handled, 5 to 10 minutes. Peel potato and mash with a fork.\nHeat oil in a large skillet over medium heat. Add onion; cook and stir until browned, about 5 minutes. Stir in broth and garlic; cook, stirring occasionally, until onion is very tender, about 3 minutes.\nCombine mashed potato, onion mixture, milk, parsley, basil, onion powder, cumin, and cinnamon in a blender; puree until smooth.\nToast bread slices; spread potato mixture on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apple Cider Sausage ",
        "ingredients": [
            "1 pound mild Italian sausage links ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 (12 fluid ounce) bottle hard apple cider ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 pound angel hair pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sausages and water in a large skillet over medium-high heat; bring to a boil. Uncover and cook until water evaporates, about 5 minutes. Transfer sausages to a cutting board; cool sausages until easily handled, about 5 minutes.\nSlice sausages into 1/2-inch disks.\nCombine apple cider and onion in the skillet over medium heat; cook and stir for 5 minutes. Add sliced sausage and orange juice; cook, stirring occasionally, until flavors combine, about 10 minutes. Stir diced tomatoes into sauce; simmer until heated through, about 5 minutes.\nBring a large pot of water to a boil. Cook angel hair in the boiling water, stirring occasionally until tender yet firm to the bite, 4 to 5 minutes. Drain.\nDivide angel pasta among 6 plates. Cover with sausage and sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Honeydew Punch",
        "ingredients": [
            "1/2 honeydew melon, peeled and seeded ADVERTISEMENT",
            "1 sweet potato, peeled ADVERTISEMENT",
            "1 Granny Smith apple ADVERTISEMENT",
            "1/4 lemon, peeled and seeded ADVERTISEMENT",
            "3 leaves kale ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger root ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process honeydew melon, sweet potato, Granny Smith apple, lemon, kale leaves, and ginger root in a juicer. Stir juice thoroughly.\nPour juice into two 1-pint jars. Chill before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "No-Bake Energy Bars with Honey",
        "ingredients": [
            "1 sheet waxed paper ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "3/4 cup creamy peanut butter ADVERTISEMENT",
            "4 cups granola ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9x13-inch baking pan with waxed paper.\nHeat honey in a saucepan over medium heat until bubbly, 2 to 3 minutes. Add peanut butter; stir until thoroughly mixed.\nPlace granola in a large bowl. Pour honey mixture over granola; stir until well combined. Transfer granola mixture to prepared baking pan; press firmly. Let stand until firm, 15 to 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick and Easy Edamame Salad",
        "ingredients": [
            "3 cups hulled edamame ADVERTISEMENT",
            "1 (15.5 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "3/4 cup frozen corn, thawed ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "2 tablespoons ginger sesame dressing, or to taste ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine edamame, black beans, corn, red onion, red pepper, ginger sesame dressing, and salt in a bowl; stir until well mixed. Place in the refrigerator until ready to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shredded Pork Fajita Tacos",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (16 ounce) package shredded pork ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (1 ounce) package fajita seasoning ADVERTISEMENT",
            "6 (6 inch) corn tortillas ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "1 cup shredded lettuce ADVERTISEMENT",
            "1 cup tomatoes, chopped ADVERTISEMENT",
            "1 cup Shredded Cheddar cheese ADVERTISEMENT",
            "1 (8 ounce) jar salsa (optional) ADVERTISEMENT",
            "1 (8 ounce) carton sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a large skillet over medium heat until melted, 3 to 5 minutes. Stir in onion and green pepper; cook and stir until softened, about 5 minutes. Add shredded pork, water, and fajita seasoning; cook and stir until heated through, about 5 minutes.\nPlace tortillas in a skillet over low heat until warmed, 1 to 2 minutes. Remove tortillas from the skillet. Spoon shredded pork mixture into tortillas; top with lettuce, tomato, Cheddar cheese, salsa, and sour cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dark Beer Syrup ",
        "ingredients": [
            "1 (12 fluid ounce) can or bottle dark beer (such as Goose Island® Oktoberfest) ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine beer and sugar in a saucepan over medium heat. Bring to a gentle simmer; cook, stirring occasionally and skimming off the foam, until reduced to a light syrup consistency, 30 to 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Boozy Mudslide Cheesecake (No Bake)",
        "ingredients": [
            "20 chocolate sandwich cookies (such as Oreo®) ADVERTISEMENT",
            "7 tablespoons melted butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "4 ounces mascarpone cheese, softened ADVERTISEMENT",
            "1/3 cup Irish cream liqueur ADVERTISEMENT",
            "2 tablespoons coffee-flavored liqueur ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "10 1/2 ounces milk chocolate, melted ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 tablespoon confectioners' sugar, or to taste ADVERTISEMENT",
            "1 cup crushed malted milk balls, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cookies into a blender; blend to fine crumbs. Stir crumbs and melted butter together in bowl until well mixed. Press crumb mixture into a 9-inch springform pan.\nWhisk the cream cheese and mascarpone cheese together in a bowl until well combined; add Irish cream liqueur, coffee-flavored liqueur, vanilla extract, and salt. Pour in milk chocolate; mix until smooth. Pour the chocolate mixture into the springform pan. Chill in the refrigerator until firm, 4 hours to overnight.\nBeat cream in a bowl with an electric mixer until foamy. Gradually add confectioners' sugar, continuing to beat until soft peaks form.\nRemove cheesecake from the refrigerator. Top with whipped cream and crushed malted milk balls.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Middle Eastern-Style Marzipan",
        "ingredients": [
            "3 cups raw unshelled almonds ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 cup honey, or as needed ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place almonds in a large skillet over low heat. Toast, stirring occasionally, until shells crack open easily, about 30 minutes. Cool until easily handled, about 15 minutes.\nShell almonds; place in a food processor. Add cardamom, cinnamon, and salt. Process, slowly pouring in honey, until marzipan mixture lumps together.\nCut and form marzipan into desired shapes. Dust with confectioners' sugar before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Brazilian Crab Cakes (Casquinha de Siri)",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tomatoes - peeled, seeded, and chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "2 tablespoons chopped parsley, or to taste ADVERTISEMENT",
            "2 green onions, chopped, or to taste ADVERTISEMENT",
            "1 pound lump crabmeat, picked over for pieces of shell ADVERTISEMENT",
            "1 1/2 cups coconut milk ADVERTISEMENT",
            "1 tablespoon palm oil (optional) ADVERTISEMENT",
            "2 tablespoons bread crumbs ADVERTISEMENT",
            "1 dash hot pepper sauce, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "clean scallop shells ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nHeat olive oil in a skillet over medium heat. Add onion and garlic; cook and stir until soft, about 5 minutes. Stir in tomatoes, green bell pepper, parsley, and green onions; cook until slightly softened, 3 to 5 minutes. Add crabmeat; cook until flavors combine, about 20 minutes.\nPour coconut milk and palm oil into the skillet. Cook until slightly reduced, 3 to 5 minutes. Stir in bread crumbs to give mixture a paste-like consistency. Season with hot pepper sauce, salt, and black pepper.\nStuff scallops shells with the crab mixture. Sprinkle Parmesan cheese on top. Arrange on a baking sheet.\nBake in the preheated oven until golden brown, about 12 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Brigadeiro Chocolate Delights",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk (such as La Lechera®) ADVERTISEMENT",
            "2 tablespoons powdered cocoa (such as Nestle®) ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1 cup chocolate sprinkles, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine condensed milk, cocoa, and 2 tablespoons butter in a saucepan; bring to a boil. Reduce heat to low and cook, stirring constantly, until brigadeiro mixture thickens and pulls away from the bottom and sides when the pan is tilted, 10 to 15 minutes.\nRemove from heat and let brigadeiro mixture cool to room temperature, about 1 hour.\nScoop teaspoonfuls of the brigadeiro mixture and roll into balls with greased hands.\nSpread chocolate sprinkles on a shallow plate. Dip and roll brigadeiros in sprinkles.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Crack Chicken Casserole ",
        "ingredients": [
            "2 pounds boneless chicken breasts ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "2 (1.5 ounce) packages potato chips, crushed ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 (8 ounce) package fresh mushrooms, sliced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 (8 ounce) package American cheese slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts in a large pot; add enough water to cover. Bring to a boil; reduce heat and simmer until an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), 15 to 20 minutes. Remove chicken with a slotted spoon and cool until easily handled, about 10 minutes. Reserve cooking liquid.\nDice chicken into bite-size pieces.\nLayer 1 bag crushed potato chips in the bottom of a 9x13-inch baking dish. Top with diced chicken.\nPreheat oven to 350 degrees F (175 degrees C).\nMelt butter in a saucepan over medium heat. Add onion, mushrooms, green bell pepper, and red bell pepper; cook and stir until onion is translucent, 5 to 10 minutes.\nStir in flour into onion mixture to make a paste; cook until golden, about 3 minutes. Pour in 2 cups reserved cooking liquid and milk; cook and stir until sauce is smooth and thick, about 5 minutes. Add American cheese, 1 slice at a time, stirring until melted.\nPour sauce over chicken in the baking dish. Top with remaining crushed potato chips.\nBake in the preheated oven until bubbly and golden, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]