[
    {
        "title": "Honey Angel Food Cake",
        "ingredients": [
            "1 1/2 cups egg whites ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 3/4 teaspoons cream of tartar ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 cup sifted cake flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a 10-inch tube pan in the oven. Preheat oven to 425 degrees F (220 degrees C).\nBeat egg whites with salt in a glass or metal bowl until foamy. Add cream of tartar and continue to beat until egg whites stand in peaks. Gradually add honey while beating continually to integrate until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks.\nSift flour and white sugar together. Add 1/3 of the flour mixture into the egg whites and fold gently with a spoon to integrate; repeat in two more additions of the flour mixture to completely incorporate. Stir vanilla into the batter.\nRemove hot tube pan from the preheated oven. Pour the batter into the hot pan. Thump pan several times on a flat surface to break air bubbles in batter.\nBake in the preheated oven until golden and the top springs back when lightly pressed, 22 to 25 minutes. Cool cake in pan on a wire pastry rack for at least 2 hours. Run a long, thin metal spatula or knife around edge of pan to loosen cake from pan.\n",
        "picture_link": "Hm52mrI0awQYAaZvzgjeLH1vDflcsO6"
    },
    {
        "title": "Chocolate Peanut Butter",
        "ingredients": [
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1 1/2 cups creamy peanut butter ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons cocoa powder, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate chips in a large microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, 1 to 3 minutes. Stir peanut butter, honey, and cocoa powder into melted chocolate and stir until completely combined. Transfer to a jar and store at room temperature.\n",
        "picture_link": "65kwnlBkUGnd2ebjpEJEXghevoOwxSG"
    },
    {
        "title": "Eggs n' Fries",
        "ingredients": [
            "1 teaspoon butter, or to taste ADVERTISEMENT",
            "1/4 cup frozen French fries, or to taste ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat. Cook and stir French fries in hot butter until browned and hot, 3 to 5 minutes. Add eggs and season with salt and black pepper; cook and stir until eggs are scrambled and set, 3 to 5 minutes.\n",
        "picture_link": "cvkPhl5WTKene7hRaOCNqnmh.RAykzK"
    },
    {
        "title": "Turmeric Honey Paste",
        "ingredients": [
            "1 cup honey ADVERTISEMENT",
            "3 tablespoons ground turmeric ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix honey, turmeric, coconut oil, and black pepper together in a resealable container using a butter knife until thoroughly combined. Cover and store in the refrigerator.\n",
        "picture_link": "haKBlFx6pFE76bwJS1luVfSE5tr8jHO"
    },
    {
        "title": "Sneaky Shamrock Shake",
        "ingredients": [
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup baby spinach ADVERTISEMENT",
            "4 hard peppermint candies ADVERTISEMENT",
            "3 cups vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend milk, spinach, and candies together in a blender until smooth; add ice cream, working in batches, and blend until smooth and evenly green.\n",
        "picture_link": "a12AuGYpwoSmTtdZzSUXpKfCny/rEhS"
    },
    {
        "title": "Crystal's Quick Avocado Salad",
        "ingredients": [
            "1 avocado - peeled, pitted and diced ADVERTISEMENT",
            "1/2 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1/4 cup chopped cilantro, or to taste ADVERTISEMENT",
            "1/2 lemon, juiced, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix avocado, corn, cilantro, lemon juice, salt, and pepper together in a bowl; let sit 5 minutes before serving.\n",
        "picture_link": "mM8iNkb6Ojm0v2pq2u7QuV/R56anpGq"
    },
    {
        "title": "Peanut Butter Fondue",
        "ingredients": [
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "4 large marshmallows ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir brown sugar, corn syrup, and butter together in a small saucepan over low heat until butter is melted and mixture is combined, about 5 minutes.\nAdd peanut butter, evaporated milk, and marshmallows; cook, stirring constantly, until marshmallows are melted and mixture is smooth, 3 to 5 minutes more.\nStir vanilla into peanut butter mixture, remove from heat, and transfer mixture to a fondue pot.\n",
        "picture_link": "uF8DTF8LvbPRa4IXhD0DTTqcb43udaq"
    },
    {
        "title": "Best Sloppy Joes",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 cup ketchup (such as Heinz®) ADVERTISEMENT",
            "1/2 (12 ounce) bottle chili sauce (such as Heinz®) ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nMix ketchup, chili sauce, onion, green bell pepper, brown sugar, and mustard powder into ground beef; bring to a boil. Reduce heat and simmer until flavors have blended, about 15 minutes; serve on hamburger buns.\n",
        "picture_link": "QTaCyNWOCLCNe/oeMzRVknSfewCqKkW"
    },
    {
        "title": "Easy Warm Spinach Salad",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup seasoned rice vinegar ADVERTISEMENT",
            "1 (2 ounce) can anchovy fillets (such as King Oscar®), diced (optional) ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 yellow onion, thinly sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "12 ounces baby spinach (such as Dole®) ADVERTISEMENT",
            "4 hard-boiled eggs, peeled and sliced ADVERTISEMENT",
            "1/2 cup green onions, finely chopped ADVERTISEMENT",
            "1/4 cup grated Asiago cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble bacon.\nWhisk red wine vinegar, seasoned rice vinegar, anchovies, and white pepper together in a bowl until dressing is evenly mixed.\nHeat olive oil in a large wok or skillet over medium-high heat; saute onion and garlic until onion is transparent, 5 to 10 minutes. Lower heat to medium. Add spinach, working in batches, to onion mixture, tossing and mixing until spinach wilts, 1 to 2 minutes.\nTransfer spinach mixture to a serving bowl; top with egg slices and bacon.\nPour dressing into the wok; bring to just under a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Pour dressing over spinach mixture; sprinkle with green onions and Asiago cheese.\n",
        "picture_link": "AM/kXCekQozdRgdVDcAG2sAIsJmW8Ba"
    },
    {
        "title": "Giant King Cake Burger",
        "ingredients": [
            "3 pounds ground beef ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "2 tablespoons steak sauce ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons vegetable oil, or as needed ADVERTISEMENT",
            "1 pound Cheddar cheese, thinly sliced ADVERTISEMENT",
            "1 pound cooked bacon strips ADVERTISEMENT",
            "1 Mardi Gras King Cake (see footnote), sliced in half horizontally, icing reserved ADVERTISEMENT",
            "2 tablespoons purple decorating sugar ADVERTISEMENT",
            "2 tablespoons yellow decorating sugar ADVERTISEMENT",
            "2 tablespoons green decorating sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 10-inch round cake pan with plastic wrap.\nMix ground beef, onion, steak sauce, Worcestershire sauce, salt, and pepper together in a bowl. Press beef mixture firmly into prepared cake pan to form a giant beef patty. Cover pan with plastic wrap and refrigerate until firm, about 2 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nLightly oil a pizza peel. Remove plastic wrap from top of beef patty and invert pan on top of pizza peel to release patty from the pan. Remove remaining plastic wrap. Use a grill spatula and a slight shaking motion to gently slide the patty from the pizza peel onto the preheated grill.\nCook beef patty on the preheated grill until browned on one side, 7 to 10 minutes. Use the grill spatula and pizza peel to carefully flip the patty. Place cheese and bacon slices on top of the burger and cook until burger is firm and no longer pink in the center, about 10 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nPlace the bottom half of the king cake on a serving platter. Place the burger on top of the bottom king cake 'bun' and place the top half of the king cake on the burger. Spread reserved icing over the top 'bun' and sprinkle purple, yellow, and green decorating sugars over the top.\n",
        "picture_link": "RE9HpCB4.JXhEIl.8.2g.iLgF.TtJhK"
    },
    {
        "title": "Raspberry Lemonade Martini",
        "ingredients": [
            "1 cup ice, or as needed ADVERTISEMENT",
            "2 fluid ounces raspberry-flavored vodka ADVERTISEMENT",
            "1 fluid ounce limoncello liqueur ADVERTISEMENT",
            "1 fluid ounce simple syrup ADVERTISEMENT",
            "1/2 fluid ounce lemon juice ADVERTISEMENT",
            "1 splash raspberry-flavored liqueur (such as Chambord®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice; pour in the raspberry-flavored vodka, lemon-flavored vodka, simple syrup, lemon juice, and raspberry-flavored liqueur. Cover shaker, shake, and strain drink into a martini glass.\n",
        "picture_link": "Q2tVXkta94JQmSpnw8uqzRFzj7DIy.a"
    },
    {
        "title": "Chipotle Creme Fraiche",
        "ingredients": [
            "2 (8 ounce) containers creme fraiche ADVERTISEMENT",
            "2 chipotle peppers in adobo sauce, or more to taste, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir creme fraiche and chipotle peppers together in a bowl.\n",
        "picture_link": "ChonJA0j51L4WvriNtQh2OEj8CxjISO"
    },
    {
        "title": "Simple Bundt® Caramel Rolls",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "3 (7.5 ounce) cans refrigerated biscuit dough (such as Pillsbury® Country Style) ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a fluted tube pan (such as Bundt(R)) with cooking spray.\nMelt margarine in a saucepan over medium-low heat. Stir cream and brown sugar into melted margarine until sugar dissolves, 2 to 3 minutes. Remove saucepan from heat.\nSpread 1 can of biscuit dough into the bottom of the prepared tube pan; sprinkle with cinnamon. Layer 1 more can biscuit dough into the tube pan and sprinkle with cinnamon. Layer last can biscuit dough into tube pan. Pour margarine mixture over biscuit dough.\nBake in the preheated oven until biscuits are slightly browned, about 20 minutes. Let biscuits cool 5 to 10 minutes in pan. Turn pan upside-down onto a serving plate and remove pan.\n",
        "picture_link": "Fu.91fJ.RnsuySvhIjLnqdm9p77Jhv2"
    },
    {
        "title": "Palacinky",
        "ingredients": [
            "2 cups skim milk ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup canola oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat milk, eggs, flour, sugar, and vanilla extract together in a large mixing bowl until the batter is thin and without lumps.\nHeat a large skillet over medium heat and grease with 1 tablespoon canola oil. Ladle enough batter into the skillet to cover the cooking surface in a thin layer. Cook until bubbles appear on the surface, 2 to 3 minutes. Flip with a large turner and cook until browned on the other side, about 2 minutes more.\nRemove cooked palacinky to a plate and roll into a log.\n",
        "picture_link": "Qg3i5hp8GFbINzmVEXbt40rlnDVOaBa"
    },
    {
        "title": "Clone of a Girl Scout Tagalong®",
        "ingredients": [
            "1 (12 ounce) bag semisweet chocolate chips ADVERTISEMENT",
            "1 (16 ounce) jar peanut butter ADVERTISEMENT",
            "1 (16 ounce) package buttery round crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the chocolate in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching.\nSpread peanut butter onto a cracker and top with another cracker creating a sandwich. Repeat until all the crackers are used.\nLine a baking sheet with waxed paper.\nGently place a cracker sandwich into the melted chocolate; spoon chocolate over the cracker until covered. Carefully lift coated cracker sandwich out of chocolate using a fork to strain off the excess chocolate and place on the prepared baking sheet. Repeat with remaining cracker sandwiches and chocolate; refrigerate until chocolate is hardened.\n",
        "picture_link": "7ekixTeAk/ECL3/msV3kEJ.Pa8ptd92"
    },
    {
        "title": "Tomato, Basil, and Gouda Cheese Fondue",
        "ingredients": [
            "8 ounces Gouda cheese, cut into 1-inch cubes ADVERTISEMENT",
            "1/3 cup diced fresh tomato ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 French baguette, sliced and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place Gouda cheese in a microwave-safe bowl; heat on high for 1 minute. Stir cheese and continue cooking in 30-second intervals until cheese is melted, 1 to 2 minutes.\nStir tomato and basil into melted cheese. Serve fondue with baguette slices.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chai Snickerdoodle Cookies",
        "ingredients": [
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons chai concentrate ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat 1 3/4 cups sugar, butter, eggs, and chai concentrate together in a bowl until light and fluffy. Whisk flour, baking soda, and salt together in another bowl. Stir flour mixture into butter mixture until dough is combined.\nWhisk 3 tablespoons sugar and cinnamon together in a small bowl.\nForm dough into 1-inch balls and roll each ball in cinnamon sugar to coat; place 2-inches apart on baking sheets.\nBake cookies in the preheated oven until golden, about 10 minutes. Cool on wire racks.\n",
        "picture_link": "4F.eBwZbOTTBwIQzoUtHrOYid.JJinu"
    },
    {
        "title": "Strawberry Shortcake Trifle",
        "ingredients": [
            "2 1/2 cups water ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "5 tablespoons cornstarch ADVERTISEMENT",
            "1 (3 ounce) package strawberry-flavored gelatin mix (such as Jell-O®) ADVERTISEMENT",
            "2 pints strawberries, sliced ADVERTISEMENT",
            "1 1/2 (8 ounce) containers fat-free whipped topping (such as Cool Whip®), or more to taste ADVERTISEMENT",
            "1 (16 ounce) prepared pound cake (such as Sara Lee®), cut into cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, sugar, and cornstarch together in a saucepan; cook, stirring constantly, over medium-high heat until mixture is boiling and thickened, 5 to 10 minutes. Remove saucepan from stove and stir gelatin mix into sugar mixture until dissolved. Set strawberry glaze aside to cool.\nLayer half the strawberries in the bottom of a trifle or glass bowl. Drizzle half the strawberry glaze over strawberry layer until evenly coated. Spread half the whipped topping over strawberry layer; top with pound cake. Layer the remaining strawberries, strawberry glaze, and whipped topping, respectively, over pound cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cran-Orange Oatmeal Muffins",
        "ingredients": [
            "1 cup rolled oats ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/2 cup granular sucrolose sweetener (such as Splenda®) ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup rye flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup fresh cranberries ADVERTISEMENT",
            "1/2 cup ground pecans, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 12 muffin cups or line with paper muffin liners.\nCombine oats and orange juice in a large bowl; soak for 15 minutes. Stir yogurt, sucralose sweetener, and molasses into oat mixture; add eggs and beat.\nMix whole wheat flour, rye flour, baking powder, salt, baking soda, and nutmeg into oat mixture; add vanilla and cranberries. Spoon batter into prepared muffin cups and sprinkle pecans over the top of each muffin.\nBake in the preheated oven until golden brown and cooked through, about 20 minutes.\n",
        "picture_link": "jewWrpaEst6dS8jEi5QMb0yNrBE/wv."
    },
    {
        "title": "Aunt Erma Lee's Smooth and Creamy Pimento Cheese",
        "ingredients": [
            "1 (2 pound) loaf processed cheese food (such as Velveeta®), cut into 8 pieces ADVERTISEMENT",
            "2 (7 ounce) jars pimento peppers, drained and chopped ADVERTISEMENT",
            "1/4 cup tarragon vinegar ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup unsalted butter ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cheese food, pimento peppers, tarragon vinegar, mayonnaise, butter, and sugar in a large saucepan or Dutch oven over low-heat; cook, stirring occasionally, until the cheese and butter are melted completely, about 20 minutes.\nPour mixture into sealable containers and refrigerate at least 4 hours before serving.\n",
        "picture_link": "erdLoZz/DnRag3ZcE2l.u2gWryFofF6"
    },
    {
        "title": "Curried Couscous with Asparagus and Bleu Cheese",
        "ingredients": [
            "2 3/4 cups water, divided ADVERTISEMENT",
            "2 cups uncooked couscous ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 cups fresh asparagus tips and pieces ADVERTISEMENT",
            "1/2 cup thinly sliced green onions ADVERTISEMENT",
            "1/3 cup shredded carrots ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3 ounces crumbled blue cheese ADVERTISEMENT",
            "1/4 cup sunflower kernels ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 1 3/4 cups water to a boil in a saucepan. Slowly pour couscous and raisins into the boiling water while stirring. Place a cover on the saucepan, reduce heat to low, and simmer until the couscous absorbs most of the water, 8 to 10 minutes.\nRemove saucepan from heat and set aside until couscous absorbs remaining water, about 5 minutes more. Fluff couscous with a fork.\nHeat olive oil in a skillet over medium-high heat. Saute asparagus, green onions, and carrots in hot oil until tender-crisp, about 5 minutes.\nMix vinegar, sugar, curry powder, ginger, and salt together in a large bowl until the sugar is completely dissolved into the vinegar; add the couscous mixture, asparagus mixture, blue cheese, and sunflower kernels. Gently fold the mixture until the kernels are evenly distributed through the mixture.\n",
        "picture_link": "Xzi9IF5ECLIFQJOrggdmtdSXGAg4.3K"
    },
    {
        "title": "Blackened Corn and Jicama Pico de Gallo",
        "ingredients": [
            "2 cups fresh corn kernels ADVERTISEMENT",
            "2 cups peeled, chopped jicama ADVERTISEMENT",
            "1 cup diced red onion ADVERTISEMENT",
            "1 cup small diced white onion ADVERTISEMENT",
            "1 cup small diced red bell pepper ADVERTISEMENT",
            "1/2 cup small diced green bell pepper ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "1 1/2 tablespoons salt ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon red wine vinegar ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "2 cups fresh cilantro leaves, finely chopped ADVERTISEMENT",
            "1 1/2 cups small diced tomatoes ADVERTISEMENT",
            "1 lime, zested and juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over high heat. Cook corn kernels in the hot skillet, turning frequently, until beginning to blacken slightly, about 5 minutes.\nMix corn, jicama, red onion, white onion, red bell pepper, green bell pepper, olive oil, white vinegar, salt, cumin, black pepper, red wine vinegar, and chili powder together in a large bowl. Add cilantro, tomatoes, lime zest, and lime juice to the corn mixture; gently stir to incorporate.\n",
        "picture_link": "rfu/OVpgEIqtB.tWsadV.37XFtx/MJy"
    },
    {
        "title": "Trout Caviar 'Fish and Chips'",
        "ingredients": [
            "2 ounces golden trout roe ADVERTISEMENT",
            "120 potato chips (such as PopChips®) ADVERTISEMENT",
            "1/2 cup sour cream, or as needed ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread potato chips on a flat surface. Spoon sour cream into a small resealable plastic bag. Press the sour cream into a corner and cut the corner of the bag off with scissors.\nPipe about 1/4 to 1/2 teaspoon sour cream into the center of each chip. Top sour cream with about 1/2 gram trout caviar; garnish caviar with a few pieces of chopped chive.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cilantro-Lime Yogurt Sauce",
        "ingredients": [
            "1 cup plain Greek yogurt ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir yogurt, cilantro, lime juice, and salt together in a bowl until smooth.\nCover bowl with plastic wrap and refrigerate until chilled, at least 20 minutes.\n",
        "picture_link": "B5ZMFfl5vAV13GQqdyoj5DwnwOpxdr2"
    },
    {
        "title": "Coconut Shrimptastrophy",
        "ingredients": [
            "6 cups all-purpose flour, divided ADVERTISEMENT",
            "5 cups cold club soda ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 quarts canola oil ADVERTISEMENT",
            "8 pounds shrimp, peeled and deveined with tails attached ADVERTISEMENT",
            "8 cups shredded unsweetened coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 4 cups flour, club soda, 1 tablespoon plus 1 teaspoon baking powder, 1 tablespoon plus 1 teaspoon baking soda, and salt together in a large bowl to form a slightly lumpy batter.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nDust shrimp with remaining 2 cups flour. Dip shrimp into batter and place on a baking sheet to drain excess, 5 minutes.\nSpread coconut out on a rimmed baking sheet. Roll battered shrimp in coconut.\nFry shrimp in hot oil in small batches, being careful not to crowd them, until they float to the top and turn golden brown, about 5 minutes. Drain on paper towels.\n",
        "picture_link": "vGzFKs0uyjinYCGo./N.Bhmy39cijKK"
    },
    {
        "title": "Rockin' Tacos",
        "ingredients": [
            "1 pound ground sirloin beef (90% lean) ADVERTISEMENT",
            "2 (10 ounce) cans Ro*Tel® Original Diced Tomatoes & Green Chilies, divided ADVERTISEMENT",
            "1 (1.25 ounce) package 30%-less-sodium taco seasoning mix ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "12 (6 inch) flour tortillas, warmed ADVERTISEMENT",
            "3 cups shredded lettuce ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook beef in large skillet over medium-high heat about 7 minutes or until crumbled and no longer pink, stirring occasionally; drain. Add 1 can undrained tomatoes and seasoning mix; mix well. Stir in water; bring to a boil. Reduce heat to low; simmer 10 minutes, stirring occasionally.\nMeanwhile, drain remaining can of tomatoes; set aside.\nSpoon meat mixture evenly onto tortillas; top with lettuce, drained tomatoes and cheese.\n",
        "picture_link": "dfCOkkFqCuupISWXl6zVTMFSAAzAG/m"
    },
    {
        "title": "Memphis Wontons",
        "ingredients": [
            "8 ounces cooked pulled pork, chopped ADVERTISEMENT",
            "1/2 white onion, minced ADVERTISEMENT",
            "1 (12 ounce) package wonton wrappers ADVERTISEMENT",
            "2 quarts canola oil ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix pulled pork and onion together in a bowl.\nSpoon pork mixture, about 1 teaspoon per wonton, onto the center of each wonton wrapper. Moisten 2 of the 4 sides of each wrapper with water and fold wrapper over filling, forming a triangle. Press to seal.\nHeat oil in a deep-fryer or large saucepan to 325 degrees F (165 degrees C) or until almost smoking.\nWorking in batches, fry wontons in the hot oil until golden brown, about 1 minute. Transfer cooked wontons to crumpled paper towels. Serve immediately with barbeque sauce.\n",
        "picture_link": "VpbnIATEjl38UW7lY2B8aj1CNkXnWb."
    },
    {
        "title": "Cheesy Oven Roasted Fingerling Fries",
        "ingredients": [
            "3 pounds fingerling potatoes, cut in half lengthwise ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 cup shredded fontina cheese ADVERTISEMENT",
            "Fresh parsley, torn ADVERTISEMENT",
            "Fresh basil leaves, torn ADVERTISEMENT",
            "Chopped fresh chives ADVERTISEMENT",
            "Kosher salt and cracked black pepper to taste ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F.\nIn a large bowl, toss together the halved potatoes, olive oil, butter, garlic salt and freshly cracked black pepper.\nTear 4 large sheets of Reynolds Wrap(R) Aluminum Foil, each about 16 inches long. Divide the potato mixture evenly between the sheets of foil. Bring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside. Place the packets on a baking sheet and transfer to the oven. Cook for 25 minutes.\nRemove one packet from the oven. Open packet carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet. Check to see if the potatoes are fully cooked and fork tender; if not, return to the oven for 5 more minutes.\nOnce cooked, open up the packets and top each portion of potatoes with cheese and herbs. Let the cheese melt before serving. Season with salt and pepper to taste.\n",
        "picture_link": "SjQhx6mY3CqncqqYHoSp4YWDqHFRwTy"
    },
    {
        "title": "Giant Homemade Almond Butter Cups",
        "ingredients": [
            "10 ounces dark chocolate chips ADVERTISEMENT",
            "10 paper muffin cup liners ADVERTISEMENT",
            "1 1/2 cups almond butter ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes.\nLine muffin cup liners with a layer of chocolate, about 2 teaspoons each.\nMix almond butter and confectioners' sugar together in a separate bowl until thoroughly combined. Roll mixture into 10 balls. Flatten balls and place onto chocolate layer, leaving an 1/8-inch rim at edges.\nPour remaining chocolate over almond butter mixture to cover evenly. Set at room temperature until firm, 10 to 15 minutes.\n",
        "picture_link": "77nHmEWTSWOMQRa6QhWkgP.d2WPi.7C"
    },
    {
        "title": "Caramel Pecan Apple Pie",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup cold shortening ADVERTISEMENT",
            "6 tablespoons ice water, or as needed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "Caramel: ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/2 cup firmly packed brown sugar ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "8 Granny Smith apples - peeled, cored and thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 2 1/2 cups flour and salt together in a bowl. Cut in shortening with 2 knives or pastry blender until the mixture resembles coarse crumbs. Add ice water, 1 tablespoon at a time, tossing with a fork, until flour mixture is moistened and dough comes together. Do not add more water than you need. Divide the dough in half and shape into 2 balls. Wrap in plastic wrap and refrigerate, at least 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Line a 9-inch pie pan with wax paper.\nMelt 1/2 cup unsalted butter in a saucepan over medium heat. Stir in 3 tablespoons flour to form a paste. Stir in 1/4 cup white sugar, 1/2 cup brown sugar, 1/4 cup water, vanilla extract, cinnamon, and nutmeg; bring to a boil. Reduce heat and simmer until filling mixture is thickened slightly, about 3 minutes.\nMelt 1/3 cup butter in a separate saucepan over low heat. Add 1/2 cup brown sugar and whisk until smooth, about 2 minutes. Stir in pecans.\nSpread pecan mixture evenly onto lined pie pan. Roll out one ball of dough; line pie pan over pecan mixture. Toss apples with filling mixture; pour into pie plate. Roll out second ball of dough and place over apple filling. Crimp edges of bottom and top crusts together. Cut several small slits into top crust to vent. Place pie on foil-lined baking sheet.\nBake pie in the preheated oven until crust is golden brown, about 1 hour.\nRemove pie from oven and allow to cool slightly, 5 to 10 minutes. Place a serving plate gently over pie and carefully flip to invert, being careful not to come in contact with molten sugar. Peel off waxed paper; cool for 1 hour.\n",
        "picture_link": "f6OSnZPw.6ly4h5BUOIhvnLbZKAZ6TS"
    },
    {
        "title": "Pakistani Chicken Karahi",
        "ingredients": [
            "1/2 cup sunflower oil ADVERTISEMENT",
            "1 (3 pound) whole chicken, giblets discarded, cut into 12 pieces ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ginger and garlic paste ADVERTISEMENT",
            "1/2 teaspoon red chile powder ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "6 ripe tomatoes, roughly chopped ADVERTISEMENT",
            "4 green chile peppers, finely chopped, or more to taste ADVERTISEMENT",
            "1 bunch fresh cilantro leaves, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot or karahi over high heat. Add chicken pieces and cook until starting to brown, about 5 minutes. Add water, cumin, salt, ginger and garlic paste, red chile powder, and turmeric; cook and stir until fragrant, about 30 seconds.\nStir tomatoes and green chile peppers into the pot. Reduce heat to low, cover, and cook until chicken pieces are no longer pink at the bone, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nSprinkle cilantro leaves over the chicken and cook until the leaves look slightly wilted, about 30 seconds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Scottish Shortbread, Gluten-Free",
        "ingredients": [
            "1 1/2 cups almond flour ADVERTISEMENT",
            "1 cup brown rice flour ADVERTISEMENT",
            "1/2 cup sorghum flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace almond flour, brown rice flour, sorghum flour, sugar, cinnamon, allspice, cardamom, ginger, and salt together in a large resealable bag; seal and shake well to combine.\nMix butter and flour mixture together in a large bowl with an electric mixer until well combined.\nRoll dough into walnut-size balls and place 2 inches apart onto ungreased baking sheets; flatten balls slightly.\nBake in the preheated oven until edges are golden brown, about 27 minutes. Cool in the pan for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "4A2fMfUXT33pA/WWqMxZeg.kkeaIDP2"
    },
    {
        "title": "Power 9 Protein Smoothie",
        "ingredients": [
            "1 cup soy milk ADVERTISEMENT",
            "1 large frozen banana ADVERTISEMENT",
            "1 tablespoon plain yogurt ADVERTISEMENT",
            "1 tablespoon peanut butter ADVERTISEMENT",
            "1 tablespoon tahini ADVERTISEMENT",
            "1 tablespoon flax seed meal ADVERTISEMENT",
            "1 tablespoon almond flour ADVERTISEMENT",
            "1 tablespoon wheat germ ADVERTISEMENT",
            "1 scoop protein powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend soy milk, banana, yogurt, peanut butter, and tahini together in a blender. Add flax seed meal, almond flour, wheat germ, and protein powder; blend to combine.\n",
        "picture_link": "/1p6KigLcgYMQvyNB4xwsLkPoRmZBJy"
    },
    {
        "title": "Cheddar Dumpling Tomato Soup",
        "ingredients": [
            "Soup: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 yellow onion, roughly chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried Italian seasoning ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "2 cups water, divided ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "Dumplings: ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon freshly cracked black pepper, plus more to taste ADVERTISEMENT",
            "1/4 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup buttermilk, shaken ADVERTISEMENT",
            "2 tablespoons chopped fresh Italian parsley ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nIn a medium ovenproof pot, heat the olive oil over medium heat. Add the chopped onion and cook until translucent, about 3-5 minutes. Add garlic and Italian seasoning and cook until fragrant, about 1 minute. Pour in the can of tomatoes. Add about 1 cup of water to the pot. Bring the soup to a simmer and then immediately turn the heat down to low. Cook the soup, uncovered, for about 10-15 minutes, until slightly thickened and very fragrant.\nTransfer the soup, in batches if necessary, to a blender and pulse until very smooth, allowing steam to escape while you process (or use an immersion blender and blend the soup in the pot). Return the pureed soup to the pot. Add salt. Mix in additional water, as needed, if the soup is too thick. Set aside.\nFor the Dumplings: In a medium bowl, mix together the flour, baking powder, salt and black pepper. Add cheese and mix until evenly distributed. Pour in the buttermilk and mix until the dough is combined and wet. Using a tablespoon or ice cream scoop, drop balls of dough into the soup.\nCover the pot with Reynolds Wrap(R) Aluminum Foil and transfer to the oven. Bake for 20-25 minutes, until the dumplings are cooked and fluffy.\nGarnish each soup bowl pepper and a sprinkling of parsley.\n",
        "picture_link": "wPQ068z6gguwB22eW9s.dhweSZpKGwC"
    },
    {
        "title": "Creamy Cheese Fall Vegetable Casserole",
        "ingredients": [
            "3 cups milk ADVERTISEMENT",
            "3 carrots, peeled and diced ADVERTISEMENT",
            "2 sweet potatoes, peeled and diced ADVERTISEMENT",
            "2 leeks, finely chopped (white part only) ADVERTISEMENT",
            "2 parsnips, peeled and diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 butternut squash, peeled and diced ADVERTISEMENT",
            "1 small turnip, peeled and diced ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, cubed ADVERTISEMENT",
            "1 cup shredded Parmesan cheese ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup fine bread crumbs ADVERTISEMENT",
            "2 tablespoons melted butter, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 3-quart casserole dish.\nPlace milk, carrots, sweet potatoes, leeks, parsnips, celery, butternut squash, and turnip in a large saucepan; bring to a boil. Reduce heat to medium low; simmer vegetables until tender, stirring occasionally, about 15 minutes.\nStir cream cheese into vegetable mixture until melted. Stir Parmesan cheese and nutmeg into mixture. Season vegetable mixture with salt and pepper; pour into prepared casserole dish.\nStir bread crumbs and melted butter together in a small bowl; sprinkle crumb mixture over casserole.\nBake, covered, in the preheated oven until bubbly, about 30 minutes. Remove cover and cook until top is lightly browned, about 5 minutes more. Let casserole rest for 2 minutes before serving.\n",
        "picture_link": "1fsEy4Vr5mKKTZyf5m48h4bvg6BISiS"
    },
    {
        "title": "Laura's Breadless Fried Egg Sandwich",
        "ingredients": [
            "3 slices bacon ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/3 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon slices in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain slices on paper towels. Crumble into pieces and set aside.\nSpray another skillet with cooking spray and heat over medium-low heat. Crack eggs side by side into the skillet; season with salt and black pepper. Cook until egg whites are set and firm, 3 to 4 minutes. Flip eggs. Sprinkle bacon pieces and Cheddar cheese over one egg. Continue cooking to desired doneness and cheese is melted, 3 to 4 minutes more. Place second egg on top. Transfer to serving dish.\n",
        "picture_link": "4nwabn7IMkeNR4lSB3s.uUQ0EqSeSv2"
    },
    {
        "title": "Homemade Gluten-Free Shake and Bake ",
        "ingredients": [
            "1/2 cup stone-ground cornmeal ADVERTISEMENT",
            "6 tablespoons brown rice flour ADVERTISEMENT",
            "2 tablespoons ground almonds ADVERTISEMENT",
            "2 tablespoons smoked paprika ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon white sugar, or more to taste ADVERTISEMENT",
            "1 teaspoon sea salt, or more to taste ADVERTISEMENT",
            "1 teaspoon ground black pepper, or more to taste ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried thyme, or more to taste ADVERTISEMENT",
            "1 pinch dried rosemary (optional) ADVERTISEMENT",
            "1 pinch dried chile pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cornmeal, brown rice flour, almonds, paprika, garlic powder, sugar, salt, pepper, oregano, basil, thyme, rosemary, and chile pepper together in a large resealable plastic bag.\n",
        "picture_link": "3eZDFvdEe0mQFnQxP1ziUHYdoOc8Soa"
    },
    {
        "title": "Gluten-Free Dark Chocolate Cupcakes",
        "ingredients": [
            "1 1/2 cups gluten-free all-purpose flour ADVERTISEMENT",
            "1 1/2 cups coconut sugar ADVERTISEMENT",
            "1 cup dark chocolate chips ADVERTISEMENT",
            "1 cup cocoa powder ADVERTISEMENT",
            "1/4 cup coconut flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon xanthan gum ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups buttermilk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line muffin pans with paper liners.\nCombine gluten-free flour, coconut sugar, dark chocolate chips, cocoa powder, coconut flour, baking powder, baking soda, xanthan gum, and salt in a bowl; mix well to combine.\nWhisk buttermilk, eggs, vegetable oil, and vanilla extract together in another large bowl until combined. Add flour mixture; fold in with a spatula until completely blended. Divide batter evenly among muffin cups, filling each about halfway.\nBake cupcakes in the preheated oven until a toothpick inserted in the centers comes out clean, about 20 minutes. Cool in pans 5 minutes; transfer to a wire rack to cool completely.\n",
        "picture_link": "MEVA6k0SJSwYmMEg3chX9pMNiYXi.wO"
    },
    {
        "title": "Grandma's Hot Hominy",
        "ingredients": [
            "1 (20 ounce) can white hominy ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped jalapeno pepper, or to taste ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 tablespoon butter, or to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine hominy, garlic, and jalapeno in a saucepan. Bring to a boil, reduce heat, and simmer until hominy is tender, 15 to 20 minutes. Strain out liquid and pour hominy mixture into baking dish. Stir sour cream and butter into hominy mixture; top with Cheddar cheese.\nBake in preheated oven until cheese melts, about 25 minutes.\n",
        "picture_link": "3to7j7M.m3K91yn9p2evaHz41ugA9s2"
    },
    {
        "title": "Espresso Coriander Brown Sugar Beef Tenderloin",
        "ingredients": [
            "1 (4 pound) beef tenderloin, trimmed of fat ADVERTISEMENT",
            "2 tablespoons instant espresso powder ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground coriander ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "3/4 teaspoon sea salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "Olive oil ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F. Line a rimmed baking sheet with Reynolds Wrap(R) Aluminum Foil. Set aside.\nTrim any excess fat from the tenderloin.\nIn a small bowl, combine espresso, brown sugar, and spices for the rub. Coat all sides of the tenderloin with the rub, creating a crust around the beef.\nPlace a rack on top of the foil-lined sheet and brush lightly with olive oil. Set the beef on your prepared rack and insert an oven-safe meat thermometer into the center. Roast, uncovered, for 50-60 minutes, or until the thermometer reads 135 degrees (for medium rare).\nRemove from the oven and cover with foil. Let stand for 15 minutes. The internal temperature of the roast will increase to 145 degrees F while resting. Cut into 1/2-inch slices and serve.\n",
        "picture_link": "QDVeOWTQFA6k4h.bIz4c7QuCVkwt/o6"
    },
    {
        "title": "Nonna's Pizzelle",
        "ingredients": [
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3/4 cup shortening (such as Crisco®), melted and cooled slightly ADVERTISEMENT",
            "2 tablespoons shortening (such as Crisco®), melted and cooled slightly ADVERTISEMENT",
            "1 tablespoon anise seeds, crushed ADVERTISEMENT",
            "1 teaspoon vanilla extract (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat pizzelle iron according to manufacturer's instructions.\nMix flour and baking powder together in a bowl.\nCombine eggs and sugar in the bowl of a stand mixer fitted with a paddle attachment and beat on medium speed until well-blended. Add 3/4 cup plus 2 tablespoons shortening and beat until blended. Add flour mixture and mix on medium speed until incorporated. Fold anise seeds and vanilla extract into batter with a spatula.\nDrop a teaspoon of batter onto the preheated iron. Bake until golden, 30 to 40 seconds, or a few seconds longer for darker pizzelle.\n",
        "picture_link": "zz9ATu6jBv6PGNUb3jand1HsRL2DJwG"
    },
    {
        "title": "Orange Pizzelle",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3 eggs, at room temperature ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 tablespoon orange extract ADVERTISEMENT",
            "2 teaspoons triple sec (orange-flavored liqueur) ADVERTISEMENT",
            "8 drops yellow food coloring ADVERTISEMENT",
            "4 drops red food coloring ADVERTISEMENT",
            "2 teaspoons finely grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour and baking powder together in a small bowl.\nBeat the eggs in a large bowl with an electric mixer on medium speed, adding sugar gradually until mixture thickens. Beat in melted butter gradually until well-blended. Stir in orange extract, triple sec, yellow food coloring, and red food coloring. Carefully stir in sifted flour and baking powder until batter is stiff and smooth. Fold in grated orange zest.\nGrease and preheat pizzelle baker according to manufacturer's instructions.\nUse a small ice cream scoop or tablespoon cookie scoop to drop batter onto the preheated pizzelle baker. Bake until browned, 30 to 40 seconds. Transfer to a cooling rack to cool completely.\n",
        "picture_link": "y35BTmOPWJahN0C4R9A8DsaRfJdjC0W"
    },
    {
        "title": "Furikake Salmon",
        "ingredients": [
            "4 salmon steaks ADVERTISEMENT",
            "1/2 teaspoon garlic salt, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon mayonnaise, or more to taste ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 (1.7 ounce) container nori fumi furikake (seaweed and sesame rice seasoning) ADVERTISEMENT",
            "1/4 cup oil for frying, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season salmon with garlic salt and black pepper. Combine mayonnaise and honey in a small bowl and spread on top side of salmon steaks.\nPlace furikake in a shallow bowl. Dip top side of each salmon steak in furikake; press down lightly for coating to stick.\nHeat oil in a large skillet over medium heat. Place salmon coated-side down and cook until golden brown, about 5 minutes. Turn over and continue cooking until salmon flakes easily with a fork, about 5 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Naked Chicken Burrito Bowl ",
        "ingredients": [
            "2 skinless, boneless chicken breasts ADVERTISEMENT",
            "1/2 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (15.25 ounce) can white corn kernels, drained ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1 1/2 cups cooked long-grain white rice ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "3/4 cup chopped lettuce ADVERTISEMENT",
            "1/3 (8 ounce) jar salsa ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nSeason chicken breasts with garlic powder, salt, and black pepper.\nGrill chicken until no longer pink in the center and cooked through, about 6 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cut chicken into strips or bite-sized pieces.\nWarm corn and black beans in separate saucepans over medium-low heat, covered, until heated through, about 5 minutes.\nLayer cooked rice, corn, black beans, and chicken on 2 serving plates. Top with Monterey Jack cheese, lettuce, salsa, and sour cream.\n",
        "picture_link": "nSoFUD3VPw9NlUAVYvyHiFCZn93/.9y"
    },
    {
        "title": "Hillshire Farm Lit'l Smokies® French Toast Bites",
        "ingredients": [
            "1 (12.5 ounce) package frozen French toast ADVERTISEMENT",
            "1 (14 ounce) package Hillshire Farm Lit'l Smokies® Smoked Sausage ADVERTISEMENT",
            "1/4 cup maple syrup, plus extra for brushing ADVERTISEMENT",
            "40 toothpicks ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare French toast according to package directions. Saute smoked sausages in a skillet over medium heat until browned.\nCut French toast into 1-inch wide pieces. Spread a little maple syrup on each piece of toast then sandwich one smoked sausage between two pieces of toast and seal together with a toothpick. Repeat with remaining smoked sausages.\nMix 1/4 cup maple syrup and Dijon mustard in a small bowl and serve alongside French toast bites. Sprinkle with confectioners' sugar before serving.\n",
        "picture_link": ".niGWjecXsSPeJWHAmJZaAwL3VkUMe."
    },
    {
        "title": "My Best Salsa",
        "ingredients": [
            "2 cups chopped onions ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 1/2 cups chopped green bell pepper ADVERTISEMENT",
            "1 cup chopped jalapeno peppers ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/3 cup vinegar ADVERTISEMENT",
            "9 cloves garlic, minced ADVERTISEMENT",
            "3 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine onions, tomato sauce, green bell pepper, jalapeno peppers, tomato paste, vinegar, garlic, cumin, salt, and black pepper together in a saucepan; bring to a slow boil for 15 minutes. Stir cilantro into salsa and remove saucepan from heat.\n",
        "picture_link": "8FXL5bRsVazvqRQ6ju0b.ad7vReP7fO"
    },
    {
        "title": "Manda's Breakfast Casserole",
        "ingredients": [
            "10 slices bacon ADVERTISEMENT",
            "5 red potatoes, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 orange bell pepper, diced ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "1 jalapeno pepper, diced ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "3/4 cup skim milk ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble into pieces.\nPreheat oven to 425 degrees F (220 degrees C). Grease bottom and sides of a 9x13-inch casserole dish.\nLayer potatoes, red bell pepper, orange bell pepper, onion, and jalapeno pepper in the casserole dish. Sprinkle 1/2 cup Cheddar cheese on top. Scatter bacon pieces over the cheese.\nWhisk eggs, milk, garlic powder, black pepper, salt, and paprika together in a large bowl. Pour over layers in the casserole dish.\nBake in the preheated oven until set, about 35 minutes. Remove from oven and top with remaining 1/2 cup Cheddar cheese. Continue baking until cheese is melted and golden, about 10 minutes more.\n",
        "picture_link": "iglR2BnXGUCLGUkZu9vIFmlEmI7LdmG"
    },
    {
        "title": "Stumptown Coffee Rub",
        "ingredients": [
            "1/4 cup ground coffee (such as Stumptown®) ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "2 tablespoons sea salt ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grind coffee, black pepper, sea salt, brown sugar, cumin, garlic powder, onion powder, and cayenne pepper together in a coffee grinder until well-combined.\n",
        "picture_link": "KZF5iLConTxTpK.u36QfrtY2a4mc1Ma"
    },
    {
        "title": "Matrimonial Date Squares",
        "ingredients": [
            "Date Filling: ADVERTISEMENT",
            "1 pound pitted dates ADVERTISEMENT",
            "2/3 cup light brown sugar ADVERTISEMENT",
            "2/3 cup orange juice ADVERTISEMENT",
            "1 orange, zested ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "Oatmeal Crust: ADVERTISEMENT",
            "1 1/2 cups regular rolled oats ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup cold unsalted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat dates, 2/3 cup brown sugar, orange juice, and orange zest in a saucepan over low heat; cook, stirring occasionally, until dates have softened, absorbed the liquid, and mixture is like a paste, about 10 minutes. Remove from heat; stir in vanilla extract.\nStir oats, flour, 1 cup brown sugar, baking soda, and salt together in a bowl; cut in butter with a knife or pastry blender until mixture resembles coarse crumbs.\nLightly press 2/3 of the crumb mixture into the bottom of a 9x9-inch pan. Spread date mixture evenly over the crumb crust; sprinkle remaining crumbs evenly over the top of date mixture.\nBake in the preheated oven until top is golden, about 30 minutes; cool on a wire rack for at least 1 hour before slicing into bars.\n",
        "picture_link": "5lGkVVcrgA6tr3H5873ZawGds8jVKSO"
    },
    {
        "title": "Quick Dirty Rice",
        "ingredients": [
            "1/2 pound bulk pork sausage, or more to taste ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 green bell pepper, finely chopped ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "2 cups chicken broth (such as Swanson®) ADVERTISEMENT",
            "1 cup white rice ADVERTISEMENT",
            "1/2 cup yellow rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a saucepan over medium-high heat. Cook and stir sausage, onion, bell pepper, and celery together in the hot skillet until sausage is browned and vegetables are tender, 7 to 10 minutes; drain and discard grease.\nPour chicken broth into the pot; add white rice and yellow rice. Bring the mixture to a simmer, reduce heat to medium-low, and cook at a simmer until the rice is tender and the moisture is absorbed, 20 to 30 minutes.\n",
        "picture_link": "1m7meOifuZmIcHE22d/zLW98FUCKmci"
    },
    {
        "title": "A Slice of Heaven (Baked Corned Beef)",
        "ingredients": [
            "3 pounds corned beef brisket ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 270 degrees F (132 degrees C).\nRinse corned beef in running water to remove about 1/2 of the salt and trim away any fat. Place corned beef in a baking dish and spread a 1/4-inch layer brown sugar over beef. Cover the baking dish with aluminum foil.\nBake in the preheated oven until an internal temperature of 145 degrees F (65 degrees C) is reached, about 2 hours.\n",
        "picture_link": ".p1Ha63IQ5Mh8T.lcbS4WjNP9hb8f5i"
    },
    {
        "title": "Chicken Rollatina",
        "ingredients": [
            "3/4 cup ricotta cheese ADVERTISEMENT",
            "3/4 cup shredded mozzarella cheese, divided ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "1 1/4 teaspoons Italian seasoning ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves, pounded 1/4-inch thick ADVERTISEMENT",
            "1 (8 ounce) package sliced mushrooms ADVERTISEMENT",
            "3/4 cup white wine ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "2 tablespoons butter, cut into small pieces, divided ADVERTISEMENT",
            "1 pound penne pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir ricotta cheese, 1/2 of the mozzarella cheese, 1/2 of the Parmesan cheese, and Italian seasoning together in a bowl.\nLay pounded chicken breasts on a work surface; spoon 2 tablespoons cheese mixture into the center of each chicken breast. Roll chicken around cheese and secure with a toothpick. Repeat with remaining chicken breasts. Place rolled chicken into a 9x13-inch glass baking dish. Spread mushrooms around chicken and pour white wine and lemon juice over the top. Scatter 1/2 of the butter over chicken and sprinkle remaining mozzarella cheese and Parmesan cheese over the top.\nBake in the preheated oven until chicken is no longer pink in the middle and juices run clear, 40 to 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nBring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain, return penne to the pot, and stir remaining butter into pasta. Ladle pasta into bowls, place chicken over pasta, and spoon pan juices over the top.\n",
        "picture_link": "YKqFZ/zKFQRBbWJm9oBBvFLOwqYC.Ku"
    },
    {
        "title": "Fruity Pebbles™ the Drink",
        "ingredients": [
            "2 cups orange juice ADVERTISEMENT",
            "2 cups frozen strawberry daiquiri mixer ADVERTISEMENT",
            "2 cups lemon-lime soda (such as Sprite®) ADVERTISEMENT",
            "1 cup vodka ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix orange juice, daiquiri mixer, lemon-lime soda, and vodka together in a pitcher.\n",
        "picture_link": "TF8iIvFLJW3S0ueWHI15GCwqKx6Nufu"
    },
    {
        "title": "Prepared Yellow Mustard",
        "ingredients": [
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup mustard powder ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "1/2 teaspoon quick-mixing flour (such as Wondra®) ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground turmeric ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, mustard powder, vinegar, flour, 1/4 teaspoon plus 1/8 teaspoon salt, turmeric, garlic powder, and paprika in a small saucepan over medium heat; whisk until smooth. Bring mixture to a boil, reduce heat to medium-low, and simmer, stirring often, until mustard is thickened, 5 to 10 minutes.\nRemove saucepan from heat; leave uncovered for 1 minute. Cover saucepan with a lid until cooled to room temperature; refrigerate until chilled.\n",
        "picture_link": "eoT7vNMsXN7ojCx496rT7v05QFFv7sa"
    },
    {
        "title": "Warm Rice, Artichoke, Spinach, and Chicken Salad",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup pine nuts ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "1 teaspoon vegetable bouillon (such as Knorr®) ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "2 cups rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 bunch green onions ADVERTISEMENT",
            "1/4 cup torn fresh basil leaves ADVERTISEMENT",
            "10 small thinly sliced fresh mushrooms ADVERTISEMENT",
            "1 bunch fresh spinach, roughly chopped ADVERTISEMENT",
            "2 cups diced cooked chicken breast ADVERTISEMENT",
            "1 cup roughly chopped marinated artichoke hearts ADVERTISEMENT",
            "1 cup shredded Parmesan cheese ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a pot over medium-high heat. Saute onion and garlic in hot oil until onion softens, 5 to 7 minutes. Stir pine nuts into onion mixture; saute until fragrant and golden, 2 to 3 minutes. Stir lemon zest, vegetable bouillon, and turmeric into onion mixture; saute until fragrant, about 1 minute. Add rice to mixture and cook until fragrant, 2 to 3 minutes more.\nPour rice mixture in a rice cooker and add water. Set the rice cooker to the regular white rice cycle, and select Start. Fluff cooked rice with a fork and top rice with green onion and basil. Close rice cooker and steam green onion and basil until tender, about 5 minutes.\nStir mushrooms into rice and place spinach on top. Close rice cooker again and steam until spinach wilts slightly, about 5 minutes more. Add chicken, artichoke hearts, and Parmesan cheese; stir to combine. Season with black pepper.\n",
        "picture_link": "HG0F6acxqQyYExThYEn1N98VY2h2ZvG"
    },
    {
        "title": "Bananas Foster French Toast Bake",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 loaf French bread, cut diagonally into 1-inch slices ADVERTISEMENT",
            "1 1/2 cups half-and-half ADVERTISEMENT",
            "6 eggs, slightly beaten ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 large bananas, cut diagonally into 1/2-inch slices ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 9x13-inch baking pan with cooking spray. Arrange bread slices in baking pan in a single layer. Whisk half-and-half, eggs, vanilla extract, cinnamon, and salt together in a bowl; pour over bread slices. Cover with plastic wrap and refrigerate, 8 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove plastic wrap and top bread slices with bananas. Combine brown sugar, butter, and corn syrup in a bowl; drizzle over bread slices.\nBake in the preheated oven until golden brown and set in the center, about 40 minutes.\n",
        "picture_link": "8.5n28kae.WVCdAXNNBpwFxLB5bQRVS"
    },
    {
        "title": "Steak Summer Rolls",
        "ingredients": [
            "Pickles: ADVERTISEMENT",
            "1 1/4 cups seasoned rice vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "2 large carrots, peeled and cut into 3x1/8-inch matchstick strips ADVERTISEMENT",
            "1/2 daikon radish, peeled and cut into 3x1/8-inch matchstick strips ADVERTISEMENT",
            "Steak: ADVERTISEMENT",
            "3 tablespoons low-sodium soy sauce ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 pound flat iron steaks ADVERTISEMENT",
            "2 tablespoons vegetable oil, or as needed ADVERTISEMENT",
            "Rolls: ADVERTISEMENT",
            "6 (8 1/2-inch) rice paper wrappers ADVERTISEMENT",
            "6 large soft-leaf lettuce leaves (such as Bibb or Boston) ADVERTISEMENT",
            "3 cups loosely packed fresh cilantro sprigs ADVERTISEMENT",
            "Dipping Sauce: ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "1 teaspoon Sriracha hot sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vinegar, water, 2 tablespoons sugar, fish sauce, and red pepper flakes in a glass, ceramic, or stainless steel bowl; stir until sugar is dissolved. Add carrots and daikon radish. Put a plate on top to weigh down vegetables and refrigerate for 4 hours or overnight.\nCombine soy sauce, 1 tablespoon sugar, and garlic in a shallow baking dish; stir until sugar is dissolved. Add steak, pressing down until steak is covered in marinade, and refrigerate for 4 hours or overnight.\nHeat a ridged grill pan over high heat; add oil. Remove steak from marinade and discard marinade. Grill steak until desired doneness is reached, 6 to 10 minutes per side. Transfer steak to a cutting board and cool. Slice across grain into 24 thin slices.\nDrain carrot and daikon radishes, reserving 1/2 cup pickling liquid.\nFill a shallow bowl with warm water. Dip 1 rice paper sheet into water to soften, about 5 seconds. Transfer sheet to a work surface. Arrange 2 pieces of lettuce over the half of wrapper closest to you. Top each lettuce leaf half with 2 slices of steak. Add about 1/4 cup carrot and daikon pickles and a few cilantro sprigs. Starting with bottom edge, begin to roll up rice paper sheet tightly around filling. After 1 roll, fold in ends of rice paper like a burrito, then finish rolling. Repeat with remaining wrappers and filling. Diagonally cut rolls in half crosswise and arrange on a serving platter.\nWhisk peanut butter, reserved pickling liquid, and sriracha hot sauce together in a bowl; serve on the side with rolls.\n",
        "picture_link": "clN4DFy2hgswvTKsnPuf0ParPaDNoV2"
    },
    {
        "title": "Game Day Chili Pups",
        "ingredients": [
            "1 (1 pound) loaf frozen bread dough, thawed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (14 ounce) package Hillshire Farm Lit'l Smokies® Smoked Sausage ADVERTISEMENT",
            "1 (15 ounce) can no-bean chili ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/4 white onion, chopped ADVERTISEMENT",
            "1 (12 ounce) jar sliced pickled jalapenos ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut thawed dough into 36 to 40 one-inch pieces. Roll each piece into a small oval shape and place on a parchment-lined baking sheet. Cover with greased plastic wrap and let rise in a warm place until doubled in size.\nHeat oven to 375 degrees F. Whisk egg with 1 teaspoon water and gently brush the tops of each roll. Bake until golden, about 15 minutes.\nIn a skillet over medium-high heat, cook Lit'l Smokies smoked sausages until browned. At the same time, heat chili in a saucepan over medium heat until hot.\nCut each roll in half down the top, not cutting all the way through. Place a smoked sausage into each roll, top with a spoonful of chili and garnish with cheddar cheese, onion and jalapenos.\n",
        "picture_link": "Wfan9ndMDQ.NaIWGpDU5I6/WiL2ReYq"
    },
    {
        "title": "Quick and Easy Barbecue Rub",
        "ingredients": [
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons ground paprika ADVERTISEMENT",
            "2 tablespoons kosher salt ADVERTISEMENT",
            "2 tablespoons firmly packed brown sugar ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "2 teaspoons ground cumin, or more to taste ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon oregano ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk white sugar, paprika, kosher salt, brown sugar, garlic powder, black pepper, onion powder, cumin, chili powder, oregano, and cayenne pepper together in a bowl.\n",
        "picture_link": "ghVYSmaFevju9l5OF8hbsLxB8kRyv36"
    },
    {
        "title": "Easy Cheesy Bean Dip",
        "ingredients": [
            "1 (11.5 ounce) can condensed bean with bacon soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "1 tablespoon taco seasoning mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir soup, sour cream, Cheddar cheese, onion, and taco seasoning together in a microwave-safe bowl. Microwave on high until hot, 3 to 5 minutes. Stir and microwave again until cheese melts and mixture is bubbling, 3 to 5 minutes more.\n",
        "picture_link": "AU9kQ.DFF.jrtlsI0d.zSIY5DzXMVdW"
    },
    {
        "title": "Paleo Candied Hot Roasted Pecan Bits",
        "ingredients": [
            "2 cups pecan halves ADVERTISEMENT",
            "2 tablespoons bacon drippings ADVERTISEMENT",
            "1 teaspoon coconut palm sugar ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 225 degrees F (110 degrees C).\nPut pecans in a resealable bag and pound into small pieces.\nMix bacon drippings, palm sugar, sea salt, and cayenne pepper together in a bowl. Add pecans to the bowl and stir to coat using a spatula. Spread coated pecan pieces onto a rimmed baking sheet.\nBake in the preheated oven, stirring every 15 minutes, until pecans are toasted and fragrant, about 1 hour. Cool to room temperature and stir in an air-tight container.\n",
        "picture_link": "wLAJ9PKn7qLiekwCtXmn1BwZSBtN3fm"
    },
    {
        "title": "Chicken Fruit Salad",
        "ingredients": [
            "1/2 cup orzo pasta ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/2 cup light mayonnaise (such as Light Miracle Whip®) ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons light sour cream ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "1 (20 ounce) can pineapple tidbits, drained ADVERTISEMENT",
            "2 cups cubed cooked chicken ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 Fuji apple, cored and diced ADVERTISEMENT",
            "1 cup seedless green grapes, halved ADVERTISEMENT",
            "6 small green onions, minced ADVERTISEMENT",
            "1 (11 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "2 tablespoons shelled salted pumpkin seeds, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook orzo in the boiling water, stirring occasionally until cooked through but firm to the bite, about 11 minutes. Drain and transfer to a bowl; refrigerate until chilled.\nWhisk mayonnaise, Dijon mustard, sour cream, orange juice, curry powder, salt, and pepper together in a bowl until dressing is smooth; cover with plastic wrap and refrigerate until chilled, at least 30 minutes.\nMix pineapple, chicken, celery, apple, grapes, and green onions together in a bowl. Stir orzo and dressing into pineapple mixture. Gently fold oranges into salad and top with pumpkin seeds.\n",
        "picture_link": "VeMFBkLtTPwUW59clH2guGZkzrzrPQi"
    },
    {
        "title": "Salmon Scampi and Rice",
        "ingredients": [
            "1 pound skinless salmon fillet, cut into 2-inch chunks ADVERTISEMENT",
            "2 tablespoons I Can't Believe It's Not Butter!® Spread, divided ADVERTISEMENT",
            "10 ounces thin green beans, cut into 2-inch pieces ADVERTISEMENT",
            "3 cloves garlic, finely chopped ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Rice Sides™ - Herb & Butter ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley leaves ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season salmon, if desired, with salt and pepper. Melt 1 tablespoon Spread in large nonstick skillet over medium-high heat and cook salmon, turning occasionally, until salmon flakes with a fork, about 5 minutes. Remove and set aside.\nMelt remaining 1 tablespoon Spread in same skillet over medium-high heat and cook green beans and garlic, stirring occasionally, until fragrant, about 2 minutes.\nPrepare Knorr(R) Rice Sides(TM) - Herb & Butter in same skillet according to package directions. Stir in parsley, lemon juice and salmon. Serve, if desired, with lemon wedges.\n",
        "picture_link": "QUVGfuFd6JPG7v.5OAGtDx/0M8m4Zm."
    },
    {
        "title": "Classic Dairy-Free Cream of Tomato and Basil Soup",
        "ingredients": [
            "2 tablespoons coconut oil ADVERTISEMENT",
            "1 yellow onion, finely chopped ADVERTISEMENT",
            "3 tablespoons tomato paste ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon gluten-free all purpose baking flour ADVERTISEMENT",
            "3 cups vegetable broth ADVERTISEMENT",
            "1 (15 ounce) can crushed tomatoes ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 tablespoon pure maple syrup ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 (13.5 ounce) can coconut milk ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "fresh basil for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat coconut oil in a pot over medium-high heat. Saute onion in hot coconut oil until softened, about 5 minutes. Stir tomato paste and garlic with the onion; cook and stir until the garlic is fragrant, about 2 minutes more.\nSprinkle flour over the onion mixture and stir to incorporate; add vegetable broth, crushed tomatoes, chopped basil, lemon juice, maple syrup, and bay leaf. Bring the broth to a boil, reduce heat to medium-low, and cook at a simmer until the tomatoes are completely softened, about 20 minutes.\nTurn heat below pot off. Remove and discard bay leaf. Pour soup into a blender. Hold lid in place and pulse blender a few times to get mixture moving before leaving on to blend into a puree; pour pureed soup into the pot and place over medium-low heat.\nStir coconut milk into pureed soup until the color is consistent; heat until the soup is warmed. Season soup with sea salt and garnish with fresh basil sprigs.\n",
        "picture_link": "NN1b2Z7WfNfcK8OU7Xb1Jz.AvgsbiHq"
    },
    {
        "title": "Hearty Chili Chicken & Rice",
        "ingredients": [
            "1 pound boneless, skinless chicken breasts, cut into bite-size pieces ADVERTISEMENT",
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "2 red and/or green bell peppers, chopped ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 (15.5 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can fat-free, reduced-sodium chicken broth ADVERTISEMENT",
            "1 (5.6 ounce) package Knorr® Fiesta Sides™ - Spanish Rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken, if desired, with salt and pepper. Heat 1 tablespoon oil in large saucepan over medium-high heat and cook chicken, stirring occasionally, until chicken is thoroughly cooked, about 5 minutes. Remove and set aside.\nHeat remaining 1 tablespoon oil in same saucepan and cook peppers with chili powder over medium-high heat, stirring occasionally, until peppers begin to soften, about 2 minutes. Stir in beans, broth, 1 1/2 cups water and Knorr(R) Fiesta Sides(TM) - Spanish Rice and prepare according to package directions.\nStir in chicken and serve, if desired, with sour cream, shredded cheese and chopped cilantro or scallions.\n",
        "picture_link": "y2xmEzXhFKmGWDEw1zP7Nvq2eUcopPa"
    },
    {
        "title": "Artichoke and Salmon Salad",
        "ingredients": [
            "1 (4 ounce) package cream cheese, at room temperature ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 teaspoon Greek seasoning (such as Cavender's®) ADVERTISEMENT",
            "1 (2.6 ounce) pouch skinless, boneless pink salmon ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese, parsley, lemon, and Greek seasoning together in a bowl; fold in salmon and artichoke hearts.\n",
        "picture_link": "DSSQdmSTkCwXAPw5HMjJzIPRSSAmn6C"
    },
    {
        "title": "Scrumptious Sausage and Raisin Appetizer Balls",
        "ingredients": [
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1 pinch paprika, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix sausage, raisins, and basil together in a bowl; roll into walnut-size balls. Arrange balls on a baking sheet or jelly roll pan with sides; sprinkle with paprika.\nBake in the preheated oven for 15 minutes. Remove sheet from oven, drain fat, re-roll balls if needed, and sprinkle with more paprika. Continue baking until cooked through, 10 to 15 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Drain.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Buffalo Bleu Chicken Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup half-and-half ADVERTISEMENT",
            "2 cups cubed, cooked chicken ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/3 cup buffalo wing sauce, or more to taste ADVERTISEMENT",
            "1/4 cup creamy tomato soup ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup crumbled blue cheese, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium-high heat. Saute celery and onion in melted butter until tender, about 5 minutes.\nSprinkle flour over the celery mixture; cook and stir until the flour absorbs into the butter, about 2 minutes.\nStream chicken broth, water, and half-and-half into the flour mixture while stirring; add chicken, Cheddar cheese, buffalo wing sauce, and tomato soup. Bring mixture to a simmer and cook, stirring occasionally, until the cheese has melted completely into the liquid, about 10 minutes.\nLadle soup into 8 bowls. Top each serving with blue cheese crumbles to serve.\n",
        "picture_link": "PIW6t49qiy3CR8/I5XaCp7SJgLJlw0u"
    },
    {
        "title": "Red Velvet Chex Party Mix",
        "ingredients": [
            "6 cups Chocolate Chex® cereal ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "3 tablespoons corn syrup ADVERTISEMENT",
            "1 drop red gel food color ADVERTISEMENT",
            "1 cup Betty Crocker® Gluten Free devil's food cake mix ADVERTISEMENT",
            "1/2 cup Betty Crocker® Rich & Creamy cream cheese frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large microwavable bowl, place cereal; set aside. In medium microwavable bowl, microwave brown sugar, butter, corn syrup, food color and cake mix uncovered on High 2 to 2 1/2 minutes or until mixture is boiling. Immediately pour over cereal; toss until well coated.\nSpread on waxed paper. Cool 5 minutes.\nPlace frosting in a small microwavable bowl; microwave uncovered on high 20 seconds. Drizzle over cereal mixture. Store loosely covered.\n",
        "picture_link": "R.T6f38RAtN37R9G.dy5Xo1.d6SOEfi"
    },
    {
        "title": "Granola Almond Pancakes",
        "ingredients": [
            "2 cups unbleached all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar, or to taste ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups almond milk (such as Silk®) ADVERTISEMENT",
            "1 (4 ounce) container applesauce ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "1/2 cup sliced almonds, or to taste ADVERTISEMENT",
            "1 cup granola (such as Back to Nature®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, sugar, baking powder, cinnamon, and salt together in a bowl. Whisk almond milk, applesauce, eggs, and almond extract together in a separate bowl. Add flour mixture to almond milk mixture and stir until batter is just moistened. Stir granola and almonds into batter.\nHeat a lightly oiled griddle over medium heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "dWN/o9Vhq/V2BNPCpPLHRX/nmbFx7Se"
    },
    {
        "title": "Easy Slow Cooker Swiss Steak",
        "ingredients": [
            "2 pounds beef stew meat, cut into 1-inch pieces ADVERTISEMENT",
            "1/4 cup steak sauce (such as A1®) ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread beef stew meat into the bottom of a slow cooker. Pour steak sauce over the beef; top with onion and tomatoes.\nCook on Low for 9 to 10 hours.\nWhisk flour into water in a small bowl; stir into liquid in slow cooker. Continue cooking until the liquid thickens, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tempeh Delight",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "3 cloves garlic, or more to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh ginger ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 (8 ounce) packages tempeh, sliced diagonally ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process soy sauce, water, maple syrup, garlic, and ginger together in a food processor or blender until smooth.\nPour oil into a baking dish. Place tempeh on top of oil and pour soy sauce mixture over tempeh. Cover dish with aluminum foil and marinate for 1 to 2 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nBake tempeh, covered with aluminum foil, in the preheated oven for 30 minutes. Remove aluminum foil, increase heat to 375 degrees F (190 degrees C) and continue baking until tempeh is slightly brown, about 15 minutes more.\n",
        "picture_link": "VRKzpf5uze/eOaOI81U.5wviFXPvgB."
    },
    {
        "title": "Wheat Berry Salad with Olives and Garlic",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 cup wheat berries ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 cup pitted and finely chopped kalamata olives ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan; add wheat berries, lower heat to medium-low, and cook until wheat berries are tender and water is absorbed, 1 to 1 1/2 hours.\nHeat olive oil in a skillet over medium-low heat; saute garlic until fragrant, 1 to 2 minutes. Add olives; cook and stir for 10 minutes. Add wheat berries to olive mixture. Cook and stir wheat berries-olive mixture until heated through, about 5 minutes. Season with salt.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Papajoe's Coleslaw for BBQ Samiches (Sandwiches for Normal Folk)",
        "ingredients": [
            "1/2 large head cabbage, thinly sliced ADVERTISEMENT",
            "1/2 cup finely shredded carrots ADVERTISEMENT",
            "1/2 cup creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1/2 cup mayonnaise (such as Duke's®) ADVERTISEMENT",
            "1/4 cup buttermilk ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 tablespoon apple cider vinegar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons salt, or more to taste ADVERTISEMENT",
            "1 teaspoon basil pesto ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cabbage and carrots together in a large bowl.\nWhisk creamy salad dressing, mayonnaise, buttermilk, sour cream, honey, apple cider vinegar, lemon juice, salt, basil pesto, mustard, cayenne pepper, celery seed, onion powder, ground black pepper, and garlic powder together in a bowl until smooth and creamy.\nPour half the dressing over the cabbage mixture and toss to coat. Gradually add remainder of dressing until coleslaw is your desired consistency. Cover bowl with plastic wrap and refrigerate until flavors combine, at least 3 hours.\n",
        "picture_link": "jxxissWdk0HBb/qJaI.GPuEzY.RUIR2"
    },
    {
        "title": "Healthy Tartar Sauce",
        "ingredients": [
            "1 egg yolk (optional) ADVERTISEMENT",
            "1 cup fat-free mayonnaise ADVERTISEMENT",
            "2 tablespoons diced cucumber ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon diced onion ADVERTISEMENT",
            "1 1/2 teaspoons white vinegar ADVERTISEMENT",
            "1 teaspoon mustard ADVERTISEMENT",
            "1 small garlic clove, pressed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg yolk and mayonnaise together in a bowl; stir cucumber, lemon juice, onion, vinegar, mustard, and garlic into the mayonnaise mixture.\nCover bowl with plastic wrap and refrigerate at least 1 hour.\n",
        "picture_link": "VcbuxGLvC1LKy1LgGzT9qcz.JQrsv7."
    },
    {
        "title": "Amaranth Pancakes",
        "ingredients": [
            "1/2 cup rice flour ADVERTISEMENT",
            "1/2 cup sorghum flour ADVERTISEMENT",
            "1/2 cup amaranth ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup almond milk ADVERTISEMENT",
            "1/2 cup unsweetened applesauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a griddle over medium heat.\nWhisk rice flour, sorghum flour, amaranth, baking powder, and cinnamon together in a bowl. Stir almond milk, applesauce, and egg into flour mixture until batter is just combined.\nSpray griddle with cooking spray. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "zoRPDBAgkcdLRewlSU3nXLZ91J0qxDi"
    },
    {
        "title": "Bacon Cheeseburger Dogs",
        "ingredients": [
            "cooking spray (such as Pam®) ADVERTISEMENT",
            "6 all-beef hot dogs ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "2 1/2 pounds ground beef ADVERTISEMENT",
            "12 slices bacon ADVERTISEMENT",
            "6 hero rolls ADVERTISEMENT",
            "12 slices American cheese ADVERTISEMENT",
            "2 teaspoons hamburger seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil and spray with cooking spray.\nBring a pot of water to a boil. Cook hot dogs in boiling water until heated through, 5 to 10 minutes. Drain hot dogs and allow to cool for 5 minutes.\nMeanwhile, melt 1 teaspoon butter in a skillet; saute mushrooms and onion in butter until softened, 5 to 10 minutes.\nSpread a sheet of plastic wrap on a work surface. Divide ground beef into 6 equal portions. Spread one portion of beef over plastic wrap to about 1/4-inch thick rectangle patty; season with hamburger seasoning. Lay one hot dog across the center of the beef and spoon about 1/6 the mushroom mixture over hot dog.\nUsing the plastic wrap, roll ground beef around hot dog, pulling plastic wrap away from the meat as you wrap. Seal the ends of the beef completely around hot dog. Wrap 2 slices bacon around beef and arrange on the prepared baking sheet. Repeat with remaining beef, hot dogs, and bacon.\nBake in the preheated oven until bacon is crisp and beef is slightly pink in the center, about 15 minutes. Top each burger-dog with 2 slices American cheese and continue baking until cheese is melted, about 5 minutes more. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).\n",
        "picture_link": "3CUsY0TWlu3DHXnoUAV4KjB8OL/3rM."
    },
    {
        "title": "Deep-Fried Hot Wings and Drumettes",
        "ingredients": [
            "3 cups peanut oil for frying, or as needed ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 (5 ounce) bottles hot pepper sauce (such as Frank's RedHot®), divided ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 1/2 pounds chicken wings and drummettes ADVERTISEMENT",
            "1/2 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 400 degrees F (200 degrees C).\nPlace flour in a bowl. Whisk eggs, 1 bottle hot sauce, and water in another bowl until smooth. Season chicken with garlic powder, salt, and pepper.\nDip each wing into the egg mixture, then toss with flour mixture to coat. Gently shake off excess flour and set aside. Repeat with remaining chicken.\nFry chicken in the hot oil in batches until chicken is no longer pink at the bone and skin is golden brown, about 5 minutes. Drain in a large bowl lined with paper towels, then season with salt.\nHeat butter and remaining bottle hot sauce in a saucepan over medium-high heat until butter is melted. Whisk until smooth. Remove paper towels from bowl and pour butter sauce over chicken; toss to coat.\n",
        "picture_link": "eJ6wlXZNL20p2bso20eMdXp.8W2mKFW"
    },
    {
        "title": "Cocktail Beer Balls",
        "ingredients": [
            "3 cups ketchup ADVERTISEMENT",
            "1 (12 ounce) bottle light beer ADVERTISEMENT",
            "2 teaspoons salt, divided ADVERTISEMENT",
            "2 teaspoons ground black pepper, divided ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1/2 pound ground pork ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir ketchup, beer, 1 teaspoon salt, and 1 teaspoon pepper together in a pot over medium-low heat. Bring to a simmer.\nMix ground beef, ground pork, bread crumbs, egg, Parmesan cheese, 1 teaspoon salt, 1 teaspoon pepper, onion powder, and garlic powder together in a bowl. Roll mixture into cocktail-sized meatballs. Place meatballs in sauce and simmer until flavors blend and meatballs are cooked through, 4 to 6 hours.\n",
        "picture_link": "rSa80c1LtOOT1Ix/mzKbJenQc0LNocy"
    },
    {
        "title": "White Chocolate Strawberry Ghosts",
        "ingredients": [
            "3 (12 ounce) packages white chocolate chips ADVERTISEMENT",
            "1/3 cup coconut oil ADVERTISEMENT",
            "3 quarts strawberries ADVERTISEMENT",
            "2 (12 ounce) packages semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt white chocolate and coconut oil in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching.\nDip strawberries in melted white chocolate mixture; set on waxed paper-lined baking sheet to dry.\nMelt semisweet chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Pour chocolate into a pastry bag with a small tip or a plastic bag with a small corner cut off.\nPipe eyes and and open mouth on the dried white chocolate dipped strawberries to make a 'face'.\n",
        "picture_link": ".6PslJyGRafzsSN8prBrEraT3k6QVOy"
    },
    {
        "title": "California Club Turkey Sandwich",
        "ingredients": [
            "1 tablespoon cream cheese, or to taste ADVERTISEMENT",
            "2 slices toasted whole wheat bread ADVERTISEMENT",
            "1 tablespoon sunflower seeds ADVERTISEMENT",
            "3 slices avocado ADVERTISEMENT",
            "1 teaspoon mayonnaise ADVERTISEMENT",
            "3 slices smoked turkey, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread cream cheese on one piece of toast. Sprinkle sunflower seeds over the cream cheese and place avocado slices over the seeds.\nSpread mayonnaise on the other piece of toast. Arrange turkey slices over the mayonnaise. Put turkey side of sandwich together with the avocado side of the sandwich.\n",
        "picture_link": "9i0P2wk/rLDS9j8LcoFAOfbZ.8NuZeu"
    },
    {
        "title": "Vietnamese Pork and Five Spice",
        "ingredients": [
            "4 pounds pork shoulder, cut into cubes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season pork with salt and pepper.\nHeat olive oil in a large pot over medium heat; cook pork and garlic in hot oil until the pork is completely browned, 7 to 10 minutes.\nStir brown sugar, soy sauce, fish sauce, and five-spice powder with the pork. Reduce heat to medium-low and cook mixture at a simmer, stirring occasionally, until the pork is tender enough to easily pull apart with a fork, about 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Southwestern Chicken",
        "ingredients": [
            "2 tablespoons ground cumin ADVERTISEMENT",
            "2 teaspoons garlic salt ADVERTISEMENT",
            "2 teaspoons ground dried chipotle pepper ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (15 ounce) can black beans ADVERTISEMENT",
            "1 (8 ounce) can whole kernel corn ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast meat - cut into cubes ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small red onion, diced ADVERTISEMENT",
            "1 cup uncooked instant rice ADVERTISEMENT",
            "1 cup grated Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cumin, salt, dried chipotle pepper, and paprika in a large, resealable plastic bag. Seal bag and shake to mix. Measure 2 teaspoons of the seasoning into a large bowl; add diced tomatoes with green chile peppers, black beans, and corn to the bowl and stir.\nPut chicken in the bag with the remaining seasoning; shake to coat.\nHeat olive oil in a large skillet over high heat. Turn seasoned chicken out into the skillet, add red onion, and saute in the hot oil until the chicken is browned, about 5 minutes.\nReduce heat to medium-high. Stir tomato mixture with the chicken; bring to a boil, add rice, and stir.\nReduce heat to low. Sprinkle Cheddar cheese over the chicken mixture. Place a cover on the skillet and simmer until the rice is tender and the chicken no longer pink in the middle, about 5 minutes. Remove from heat to cool for 5 minutes before serving.\n",
        "picture_link": "3/vzZSt4OavWVHkIo.ga5uPL0GYvkPu"
    },
    {
        "title": "Mexican Green Papaya Salad",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, or to taste ADVERTISEMENT",
            "3 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 pinch chili powder, or more to taste (optional) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "1 green papaya, peeled and shredded ADVERTISEMENT",
            "2 cups cold cooked black beans ADVERTISEMENT",
            "1 cup cold cooked corn ADVERTISEMENT",
            "1 red bell pepper, cut into small dice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend cilantro, garlic, lime juice, olive oil, brown sugar, chili powder, and salt in a blender until smooth.\nToss shredded papaya, black beans, corn, and red bell pepper together in a large mixing bowl; add dressing and toss to coat.\nCover bowl with plastic wrap and refrigerate at least 30 minutes.\n",
        "picture_link": "d3Vtg2jpIIYOB9H0qqXh29007EfvEV6"
    },
    {
        "title": "Chocolate Mint Chex Party Mix",
        "ingredients": [
            "3 cups Chocolate Chex® cereal ADVERTISEMENT",
            "3 cups Corn Chex® cereal ADVERTISEMENT",
            "1/2 cup mint chocolate chips ADVERTISEMENT",
            "1/2 cup peppermint-flavored dark chocolate pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large microwavable bowl, measure cereal. Set aside. Line cookie sheet with waxed paper.\nIn medium microwavable bowl, microwave mint chips uncovered on Medium (50%) about 1 minute, stir. Microwave an additional 15 seconds at a time, until chocolate is mostly melted and can be stirred smooth. Pour over cereal, evenly coating pieces.\nMicrowave uncovered on High 3 minutes, stirring every minute. Spread on waxed paper; cool 5 minutes. Stir in candies. Store tightly covered.\n",
        "picture_link": "yWedanNbNvSBf0BHCr1mx13o6ilUF2K"
    },
    {
        "title": "Taco Stuffed Peppers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (8 ounce) box Mexican rice mix ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 bell peppers, tops and seeds removed ADVERTISEMENT",
            "1 (8 ounce) bottle spicy ranch dressing ADVERTISEMENT",
            "1 (8 ounce) package shredded Mexican cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix taco seasoning into ground beef.\nCombine water, Mexican rice mix, and butter in a saucepan; bring to a boil for 1 minute. Cover saucepan, reduce heat to low, and cook until water is absorbed, about 25 minutes. Mix ground beef into rice mixture.\nBring a pot of water to a boil; cook green bell peppers until slightly softened, about 5 minutes. Drain. Fill each bell pepper with beef-rice mixture. Arrange bell peppers in a baking dish. Pour ranch dressing over bell peppers and top each with Mexican cheese blend.\nBake in the preheated oven until peppers are tender and cheese is melted, 45 to 50 minutes.\n",
        "picture_link": "38fAan8/KkSR4a/RGM6aAljRdRilMFi"
    },
    {
        "title": "Millet Mung Bean Main Dish",
        "ingredients": [
            "9 cups water, divided ADVERTISEMENT",
            "2 cups dried mung beans ADVERTISEMENT",
            "2 1/2 cups millet ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 carrot, shredded, or more to taste ADVERTISEMENT",
            "2/3 bunch chopped flat-leaf parsley ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger, grated ADVERTISEMENT",
            "2 teaspoons dried basil, or more to taste ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "2 cups chopped tomatoes ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 4 cups water and mung beans to a boil in a pot; cover, reduce heat to medium-low, and simmer until beans are tender, 45 to 60 minutes.\nBring 5 cups water and millet to a boil in a separate pot; cover, reduce heat to medium-low, and simmer until water is absorbed and millet is tender, 10 to 20 minutes.\nHeat oil in a skillet over medium heat; cook and stir onion, green bell pepper, celery, carrot, parsley, garlic, ginger, basil, oregano, cumin, curry powder, and cayenne pepper until vegetables are slightly tender, 5 to 10 minutes. Stir tomatoes, salt, and pepper into vegetable mixture.\nMix mung beans, millet, and Cheddar cheese into vegetable mixture; cook and stir until cheese is melted, 2 to 3 minutes.\n",
        "picture_link": "wgI8Fdo5FZNR3miMr.viM92zqFD0/K6"
    },
    {
        "title": "Honey Almond Asparagus with Feta Cheese Course",
        "ingredients": [
            "4 sheets (12x18-inches each) Reynolds Wrap® Heavy Duty Aluminum Foil ADVERTISEMENT",
            "1 pound asparagus, ends trimmed ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 tablespoon fresh minced garlic ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill to medium-high or oven to 450 degrees F.\nCenter one-fourth of asparagus on each sheet of foil.\nPlace honey and garlic into a small heatproof bowl and stir to combine. Warm honey in microwave for 10 to 15 seconds to thin. Spoon 1 tablespoon of the honey over each asparagus packet. Season with salt and pepper then top with sliced almonds.\nBring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside. Repeat to make four packets. Place packets on a cookie sheet.\nGrill until asparagus is fork tender, 5 to 8 minutes. Sprinkle with feta cheese before serving.\n",
        "picture_link": "szxbBg9acLY.rEjpQsm/3hs1yU4uXdK"
    },
    {
        "title": "Honey Ginger Plum Sundae",
        "ingredients": [
            "2 plums, pitted and chopped ADVERTISEMENT",
            "2 tablespoons chopped almonds ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "2 scoops frozen yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine plums, almonds, orange juice, honey, ginger, and cardamom together in a bowl. Serve topping over frozen yogurt.\n",
        "picture_link": "pYu6oHLQs9f9azmizCFal99/tysAim6"
    },
    {
        "title": "Dane's Frozen Peach Margaritas",
        "ingredients": [
            "2 cups ice cubes, or as desired ADVERTISEMENT",
            "1 fresh peach, pitted and sliced ADVERTISEMENT",
            "2 1/2 (1.5 fluid ounce) jiggers tequila ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger triple sec ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger peach schnapps ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon agave nectar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cubes, peach, tequila, triple sec, peach schnapps, lime juice, and agave nectar together in a blender until smooth, about 30 seconds.\n",
        "picture_link": "T80co4Qmv6kVIJYRoqtVfQTLgVXl7We"
    },
    {
        "title": "Peaches with Burrata, Basil, and Raspberry Balsamic Syrup",
        "ingredients": [
            "1 (4 ounce) ball Burrata cheese, at room temperature ADVERTISEMENT",
            "1 peach, sliced ADVERTISEMENT",
            "1 tablespoon thinly sliced fresh basil leaves ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "3 tablespoons raspberry balsamic vinegar ADVERTISEMENT",
            "flaked sea salt ADVERTISEMENT",
            "freshly ground black pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently tear open the Burrata cheese to expose the soft, creamy core and place it in the middle of a plate. Arrange peach slices in and around the cheese. Sprinkle basil leaves over cheese and top with olive oil.\nBring raspberry balsamic vinegar to a boil in a small saucepan; reduce heat to medium-low and simmer until vinegar reduces to a thick syrup, about 5 minutes. Spoon balsamic syrup over peaches and cheese; season with sea salt and black pepper.\n",
        "picture_link": "AWfe1XeS00xxxVT9DqLc9tNVoBZT84K"
    },
    {
        "title": "Moroccan Carrots",
        "ingredients": [
            "4 large carrots, peeled and grated ADVERTISEMENT",
            "1 (16 ounce) can garbanzo beans (chickpeas), drained and rinsed ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "salt and ground pepper to taste ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine carrots, garbanzo beans, and raisins together in a bowl.\nWhisk olive oil, lemon juice, cumin, chili powder, salt, and ground black pepper together; stir into carrot mixture. Marinate carrot mixture for 2 hours. Serve with crumbled feta cheese.\n",
        "picture_link": "VdyyqmDNnm5.nIOXjzTpNcB/RvazhE6"
    },
    {
        "title": "Vegetable Pizza Frittata",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "3/4 cup thinly sliced white onion ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "5 egg whites ADVERTISEMENT",
            "1 1/2 cups coarsely chopped spinach ADVERTISEMENT",
            "1/3 cup finely shredded reduced-fat Parmesan cheese ADVERTISEMENT",
            "2 tablespoons minced fresh parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 roma (plum) tomatoes, thinly sliced ADVERTISEMENT",
            "8 black olives, pitted and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack 3 to 6 inches from the heat source and preheat the oven's broiler.\nHeat olive oil in a 10-inch oven-proof skillet over medium heat; cook and stir onion until soft and transparent, about 5 minutes.\nBeat eggs, egg whites, spinach, Parmesan cheese, parsley, salt, basil, oregano, and black pepper together in a bowl; pour over onions. Cook over low heat, gently lifting with a spatula and tilting skillet to let liquid run under cooked parts, until partially cooked, about 10 minutes. Arrange tomatoes and black olives on top of semi-soft frittata.\nBroil frittata in preheated oven until slightly browned on top, about 5 minutes. Cut into wedges.\n",
        "picture_link": "llkP.EtBPijNf10tSnGE7iXJhh6e7p."
    },
    {
        "title": "Super Easy Chocolate Chip Cookies",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (11 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat cake mix, eggs, and vegetable oil in a bowl using an electric mixer on medium until dough is well combined; stir in chocolate chips. Drop dough by the spoonful onto a baking sheet.\nBake in the preheated oven until golden brown, 10 to 12 minutes.\n",
        "picture_link": "3dTf.EWSVJREbK1b96EqyQUpa9vRpPO"
    },
    {
        "title": "Coconut Sugar Cinnamon Toast",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 tablespoon coconut sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 drops vanilla extract ADVERTISEMENT",
            "2 slices bread, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash butter in a bowl until smooth; stir in coconut sugar, cinnamon, and vanilla extract. Spread butter mixture onto each piece of toast.\n",
        "picture_link": "be8Yl.URzIb8R50pkgKqsgoKrOWeyce"
    },
    {
        "title": "Grilled Beets with Feta",
        "ingredients": [
            "1 bunch beets, trimmed and thinly sliced ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1 pinch sea salt to taste ADVERTISEMENT",
            "2 ounces crumbled feta cheese ADVERTISEMENT",
            "2 teaspoons chopped fresh chives, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat and lightly oil the grate.\nSpread beets onto a sheet of aluminum foil. Drizzle olive oil over beets and season with salt. Fold foil over beets, sealing the edges together to create a packet.\nCook on the preheated grill, turning once, until beets are tender, about 30 minutes. Carefully open packet and top beets with feta cheese and chives. Close packet again and grill until cheese melts, about 5 minutes.\n",
        "picture_link": "SJOGrXoovc6fY.vOT4jJJ35guuSHe.O"
    },
    {
        "title": "Country Sauteed Fiddleheads",
        "ingredients": [
            "1 pound fiddleheads ADVERTISEMENT",
            "1 1/2 teaspoons butter ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse fiddleheads thoroughly; trim stems. Soak in cold salted water for 5 minutes; rinse again.\nPlace fiddleheads in a large skillet; pour in enough water to cover and bring fiddleheads to a boil. Simmer for 10 minutes; drain.\nMelt butter in same skillet over medium low heat; stir in fiddleheads and toss to coat. Cook fiddleheads until tender, about 5 minutes. Stir vinegar into fiddleheads; season with salt and pepper.\n",
        "picture_link": "AvH.UBOucM4LboVDAzFHogC/QQZqlbq"
    },
    {
        "title": "Orange Chicken Kabobs",
        "ingredients": [
            "1/4 cup orange marmalade ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons red wine ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 large garlic clove, minced ADVERTISEMENT",
            "1/4 teaspoon dried sage ADVERTISEMENT",
            "1/8 teaspoon garlic salt ADVERTISEMENT",
            "1/8 teaspoon kosher salt ADVERTISEMENT",
            "1 (6 ounce) package fresh mushrooms, or to taste ADVERTISEMENT",
            "1 bell pepper, chopped, or to taste ADVERTISEMENT",
            "1/2 red onion, chopped, or to taste ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "1 cup chopped fresh pineapple, or to taste ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk orange marmalade, balsamic vinegar, red wine, olive oil, chives, basil, garlic, sage, garlic salt, and kosher salt together in a bowl until marinade is smooth. Pour about 1/4 of the marinade into a resealable plastic bag; add mushrooms, bell pepper, and red onion. Squeeze air out of bag and seal.\nPour the remaining marinade into a separate resealable bag; add chicken. Squeeze air out of bag and seal. Marinate vegetables and chicken in the refrigerator, 2 to 8 hours.\nRemove vegetables and chicken from bag and discard marinade. Thread vegetables, chicken, and pineapple onto skewers.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook kabobs on the preheated grill until chicken is no longer pink in the center, 5 to 10 minutes per side.\n",
        "picture_link": "0/wzs4fa48hdP0FoQTGOXixZj/x63ni"
    },
    {
        "title": "Bourbon Citrus Slush",
        "ingredients": [
            "2 tea bags ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "3 1/2 cups boiling water ADVERTISEMENT",
            "1 (16 ounce) can frozen orange juice concentrate ADVERTISEMENT",
            "1 (16 ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "1 1/2 cups bourbon ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tea bags and 1 cup boiling water in a cup; allow to steep for 5 minutes. Remove and discard tea bag.\nMix 3 1/2 cup boiling water, tea, orange juice concentrate, frozen lemonade concentrate, bourbon, and sugar together in a container with an airtight lid. Cover and freeze until partially frozen, about 30 minutes. Stir mixture and freeze for about 24 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Inside Out Oreos®",
        "ingredients": [
            "1 (14 ounce) package chocolate sandwich cookies (such as Oreo®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently separate each sandwich cookie and scrape the cream filling into a bowl.\nMelt the cream filling in a microwave until liquefied. Dip the chocolate cookies into the melted filling and place on a baking sheet; freeze until solid, about 2 hours.\n",
        "picture_link": "70eMnpVXUPoxMPO4PhH.E03wtKJ1pSS"
    }
]