[
    {
        "title": "Hazelnut Biscotti",
        "ingredients": [
            "1 cup skinned, toasted hazelnuts ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/4 cup hazelnut liqueur ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 cups unbleached all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup mini semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nCoarsely chop the hazelnuts. In a bowl, combine the nuts, sugar, butter, liqueur and eggs; mix well. Stir in the flour, baking powder and salt.\nTurn the dough out onto a floured surface and knead briefly; then form into a long loaf about 2 inches wide. Place the loaf on a parchment-lined or lightly oiled cookie sheet and bake in the middle of the oven for 25 min. or until firm. The loaf will have a cakelike texture. Remove from the oven and cool.\nCut the loaf diagonally into 1/4-1/2 inch slices and lay those out on a cookie sheet. Bake for 20 minutes more, turning them once until both sides are lightly browned and toasted. Cool and store in an airtight container.\n",
        "picture_link": "dj6/D2LGCtPFNT97wJ3k7PS2RyBNfEq"
    },
    {
        "title": "Chocolate Mint-Filled Cookies",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2/3 cup butter, softened ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "48 small peppermint patties ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In heavy small saucepan over low heat, heat chocolate chips, stirring occasionally, until melted and smooth.\nPour melted chocolate into bowl and add flour, butter, corn syrup, baking soda, salt, egg and 1/2 cup sugar. Mix with electric mixer at low speed until blended. Increase speed to medium; beat until well mixed, scraping bowl frequently with rubber spatula.\nWrap dough with plastic wrap and refrigerate until easy to handle, about 2 hours.\nPreheat oven to 350 degrees F (180 degrees C).\nMeasure 1/3 cup sugar into small bowl. Shape dough into 96 balls; roll balls in sugar to coat. Place in even number of balls, about 2 inches apart, on ungreased large cookie sheet.\nBake cookies 12 to 15 minutes until set. Immediately remove half of cookies from cookie sheet and invert onto work surface. While still hot, place chocolate-covered mint patties on remaining cookies, top side up. Press cookies together slightly so mint patty spreads out to cookie edges as it melts. With pancake turner, remove cookies to wire racks to cool. Repeat with remaining dough and mints.\n",
        "picture_link": "nxr6JVSDdtb/lVDIMczNx91EOzE.Ihy"
    },
    {
        "title": "Mountain Cookies II",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nTo Make Dough: In a mixing bowl, cream 1 cup butter, 1 cup confectioner's sugar and 2 teaspoons vanilla. Combine 2 cups flour and 1/2 teaspoon salt. Gradually add to the creamed mixture and mix well.\nShape into 1 inch balls; place 2 inches apart on ungreased baking sheets. Make a deep indentation in the center of each cookie.\nBake for 10 to 12 minutes or until the edges just start to brown. Remove to wire racks to cool completely.\nTo Make Filling: Beat cream cheese, 1 cup confectioner's sugar, 2 tablespoons flour, and 1 teaspoon vanilla in a mixing bowl. Add pecans and coconut; mix well.\nSpoon 1/2 teaspoon of the filling into each cookie.\nTo Make Topping: Heat chocolate chips, 2 tablespoons butter or margarine and water in a small saucepan until melted. Stir in 1/2 cup confectioner's sugar. Drizzle over cookies.\n",
        "picture_link": "BwTLqDt5RUN/p4m2HcqvHi.Q5Jv0FUy"
    },
    {
        "title": "Chinese Noodle Pancakes with Asparagus",
        "ingredients": [
            "1 pound fresh Chinese wheat noodles ADVERTISEMENT",
            "1/2 pound fresh asparagus ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons Chinese rice wine ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon fermented black beans ADVERTISEMENT",
            "8 ounces spinach with stems, rinsed ADVERTISEMENT",
            "2 teaspoons dark sesame oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot of water boil noodles until al dente. Drain well. Rinse with cool water until the noodles are cool.\nBreak off the tough ends of the asparagus, and cut the rest of the spears into 2-inch lengths. In a large skillet, heat 1 tablespoon of the oil over medium heat. Add the garlic and ginger, saute for 1 minute, make sure not to brown the garlic. Add the asparagus and 1/2 cup water. Simmer for 2 minutes.\nPut the cornstarch into a small mixing bowl, stir in the remaining 1/2 cup water and the rice wine or sherry. Stir well. Add this mixture, the soy sauce, and the fermented black beans, if you're using them, to the simmering vegetables. Let the sauce boil for a few seconds, add the spinach and stir until it wilts. Remove the skillet from the heat\nHeat the remaining oil in a skillet over high heat. Divide the noodles into four mounds, and place the mounds of noodles in the hot frying pan. Flatten the mounds in the frying pan so that more surface area will brown, reduce the heat to medium-high, and fry the cakes for at least 5 minutes, until they develop a golden-brown crust on the bottom. Turn the cakes over, and fry them for 3 minutes\nWhile the noodle cakes cook, reheat the vegetables and the sauce slightly. Add the sesame oil, salt and pepper to the vegetable mixture. Place the noodle cakes on plates, spoon the sauce and vegetables over and around the cakes, and serve.\n",
        "picture_link": "ZQNw11DdvFxy2CVJca9OSVeKIbpQ40."
    },
    {
        "title": "Pinwheel Cookies I",
        "ingredients": [
            "1 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1 (1 ounce) square unsweetened chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine butter and sugar and egg yolk. Add dry ingredients and milk alternately.\nDivide dough into 2 equal parts. Melt chocolate over low heat and add to one half of the dough.\nUse a rolling pin and roll each half into a rectangle. Put the chocolate rectangle on top of the vanilla one. Roll up like a jelly roll in wax paper.\nChill several hours, best if chilled overnight.\nSlice them and bake at 400 degrees (200 degrees C) for about 5 minutes.\n",
        "picture_link": "qQf/kO3X7Gyno4GScJ9E5G6MEg9lspi"
    },
    {
        "title": "Mushroom Patties",
        "ingredients": [
            "1 cup bread crumbs ADVERTISEMENT",
            "1/2 cup cottage cheese ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup pecans, finely crushed ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine bread crumbs, cottage cheese, Cheddar cheese, nuts, eggs and onion soup mix in a medium size mixing bowl. Mix well.\nForm the mixture into patties and place one at a time in a skillet with oil. Fry until both sides of the patties are browned.\nIn a small bowl mix mushroom soup and milk together.\nPlace fried patties in a 9x13 inch casserole dish. Pour the milk and mushroom soup mixture over the patties. Bake for 25 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar-Free Spice Cookies",
        "ingredients": [
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "3/4 cup wheat germ ADVERTISEMENT",
            "1 1/2 teaspoons low sodium baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 1/4 teaspoons ground ginger ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup frozen apple juice concentrate, thawed ADVERTISEMENT",
            "2/3 cup raisins ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the dry ingredients in a mixing bowl.\nIn a blender, combine the juice concentrate and the raisins. Mix on high until raisins are chopped. Add the egg whites and beat on slow speed just until combined.\nSlowly add the juice mixture and the oil to the dry ingredients and mix until combined.\nWrap the somewhat soft dough in waxed paper and chill for 2 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nWet your hands and shape dough into balls 1 1/2 inches in diameter. Place on nonstick cookie sheet and flatten with fork. Bake 8 to 10 minutes until just done. Don't overbake! Cool on wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Refrigerator Cookies",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup packed light brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thoroughly cream shortening and sugar; add egg and beat well. Melt chocolate over low heat. Add chocolate and vanilla to shortening mixture. Mix well.\nSift dry ingredients; add to creamed mixture alternately with milk. Stir in nuts.\nShape into rolls. Wrap in waxed paper; chill thoroughly or overnight.\nPreheat oven to 400 degrees F (200 degrees C).\nUsing a sharp knife, cut 1/4 inch thick slices off the rolls and place about 2 inches apart on cookie sheets. Bake 8 to 10 minutes.\n",
        "picture_link": "etrj4XoUTqsYeCnPAUCThUsu9knTO2y"
    },
    {
        "title": "Scalloped Corn II",
        "ingredients": [
            "2 (14.75 ounce) cans cream-style corn ADVERTISEMENT",
            "1/4 (16 ounce) package saltine crackers ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, combine corn, crackers and egg. Mix and pour into small baking dish. Bake for 30 minutes. Season with salt and pepper to taste.\n",
        "picture_link": "LSBF4ySJkz5F1Sc2Xrcy9JF3AVxUP8S"
    },
    {
        "title": "Raisin Peanut Butter Bran Cookies",
        "ingredients": [
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "3/4 cup whole bran cereal ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups raisins ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with aluminum foil or baking parchment.\nIn a large saucepan, melt the butter over medium heat. Add peanut butter and sugar and stir until melted. Remove from heat.\nTransfer to large mixing bowl and stir in bran cereal. Stir in eggs and vanilla and mix well. Fold in raisins and oatmeal and stir until well blended.\nSift together flour and baking soda and add to mixture. Mix thoroughly.\nDrop dough by tablespoonfuls onto cookie sheets. Dip a fork into water and press to flatten dough to 1/2 inch thickness.\nBake for 15 minutes, or until cookies are lightly colored. Reverse sheet once during baking time. Let stand on wire racks to cool.\n",
        "picture_link": "IRd5REnRizQO8cucwMiPaH9YTKG6C22"
    },
    {
        "title": "Sweet Potato Surprise",
        "ingredients": [
            "3 sweet potatoes ADVERTISEMENT",
            "2 bananas ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/4 cup evaporated milk ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1 1/2 cups miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Grease one 8x12 inch baking dish.\nBring a pot of salted water to a boil. Add potatoes; cook until tender but still firm. Drain, and transfer to a large bowl to cool.\nIn a mixing bowl, combine sweet potatoes, bananas, white sugar, brown sugar, pecans, evaporated milk, butter, vanilla, cinnamon and nutmeg. Mix well.\nPour mixture into baking dish, place coconut on top of potato mixture and top with marshmallows. Bake for 10 to 15 minutes.\n",
        "picture_link": "I85yNigQCOS34LZrEpwuGS8zwzvERQW"
    },
    {
        "title": "Cranberry Cherry Pie",
        "ingredients": [
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1 (16 ounce) can whole cranberry sauce ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "7 tablespoons orange juice ADVERTISEMENT",
            "1/8 cup milk ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together cherry pie filling, cranberry sauce, raisins, cornstarch and ginger.\nMake pie-crust dough, substituting orange juice for water. Divide dough 55 % / 45 %. Roll larger piece to 1 1/2 inches larger than 9-inch pie pan. Place crust in pie plate leaving one inch overhang, and brush with egg white. Spoon cherry filling into pie crust.\nRoll second crust to 12-inch round. Cut into 14 strips to make a lattice top. Moisten edge of bottom crust with water. Place 7 strips across pie. Do not seal ends. Fold every other strip back halfway from center. Place center cross strip on pie and replace folded part of strips. Now fold back alternate strips. Place second cross strip in place. Repeat to weave cross strips into lattice. Seal ends. Turn bottom crust edge up over ends of strips. Pinch to seal. Make high fluted edge. Brush pastry with milk, and sprinkle lightly with sugar.\nBake at 400 degrees C (205 degrees C) for 50 minutes, or until fruit begins to bubble and crust is golden brown. Cool pie slightly on wire rack.\n",
        "picture_link": "NAH9vbR0G9.6j3VJNk5EBFcnWZ6qDVe"
    },
    {
        "title": "Cookie Pops on a Stick!!",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 1/2 cups self-rising flour ADVERTISEMENT",
            "24 popsicle sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nCombine butter or margarine, baking soda, white sugar and your favorite extract flavor. Beat these ingredients together with an electric mixer until fluffy. Add self-rising flour Beat well.\nRoll dough into walnut sized balls. Place them two inches apart onto the cookie sheet and flatten slightly. Press ice cream stick into the flattened side of the cookie, and press down. This way, you know how large the cookie will be when baked. Add whatever topping to each cookie you like, OR, before pressing stick into the cookie, roll each cookie into sprinkles first, then flatten.\nBake until edges are lightly golden.\n",
        "picture_link": "O3ENOhTgFEtGS4lTxwZSuqKGWqsI3GW"
    },
    {
        "title": "Garlic Mashed Potatoes with Eggplant",
        "ingredients": [
            "1 eggplant, trimmed and halved lengthwise ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 potatoes, peeled and cubed ADVERTISEMENT",
            "2 cloves garlic, peeled and halved ADVERTISEMENT",
            "2 slices bacon ADVERTISEMENT",
            "1 tablespoon bacon drippings ADVERTISEMENT",
            "1/2 onion, cut into strips ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "freshly cracked black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace eggplant halves, cut sides up, onto a baking sheet and brush with 1 tablespoon olive oil.\nBake eggplant in the preheated oven until soft, 30 to 35 minutes. Peel eggplant when cool enough to handle; set aside.\nWhile eggplant is baking, place potatoes and garlic cloves into a large pot and cover with lightly-salted water. Bring to a boil, reduce heat to medium-low, and simmer until tender, about 20 minutes. Drain.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and retain 1 tablespoon drippings in the skillet. When bacon is cool, crumble, and set aside. Cook and stir onion in bacon drippings until soft and translucent, about 5 minutes. Set onion aside.\nPlace eggplant, potatoes, cooked garlic cloves, and 1 tablespoon olive oil in a large bowl and mash with a potato masher until smooth and thoroughly combined. Season to taste with salt and cracked black pepper. Serve in a bowl topped with cooked onion and crumbled bacon.\n",
        "picture_link": "VJ1Z8zXXmbVBVs1jjAgulkHmsxvz4.2"
    },
    {
        "title": "Sun Dried Tomato Pesto (no nuts)",
        "ingredients": [
            "1 cup sun-dried tomatoes ADVERTISEMENT",
            "1/2 cup fresh basil ADVERTISEMENT",
            "2 tablespoons shredded Parmesan cheese ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sun-dried tomatoes in a small pot and cover with water; bring to a boil. Remove from heat and let tomatoes soften, about 10 minutes. Drain.\nBlend tomatoes, basil, Parmesan cheese, garlic, and salt in a blender until mixed. Slowly add olive oil, about 1/4 cup at a time; blend until smooth.\n",
        "picture_link": "54tuHQgknS5iC2PPtaKiCsgi7OQmoam"
    },
    {
        "title": "Authentic Tabbouleh",
        "ingredients": [
            "1/2 cup fine bulgur ADVERTISEMENT",
            "6 ripe tomatoes, finely chopped ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "5 bunches Italian parsley, minced ADVERTISEMENT",
            "1/2 bunch fresh mint leaves, minced ADVERTISEMENT",
            "1 bunch green onions, minced ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3/4 cup freshly squeezed lemon juice ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and rinse bulgur until runoff water becomes clear. Place prepared bulgur in a large bowl. Add tomatoes to bowl; stir to combine. Allow mixture to sit until bulgur absorbs tomato juice and expands, 30 minutes to 1 hour.\nAdd onion, parsley, mint, and green onions to bowl. Stir to combine.\nMix together tomato paste, vegetable oil, and lemon juice in a bowl, stirring until thoroughly combined. Add dressing to salad; mix to coat. Season with salt, ground black pepper, and cayenne pepper to taste.\n",
        "picture_link": "gpoF7fevafKime/UE0XAYl3Dt2RcjLi"
    },
    {
        "title": "Jenni's Italian Farro Pilaf",
        "ingredients": [
            "1 cup semi-pearled farro, rinsed ADVERTISEMENT",
            "2 teaspoons chicken bouillon ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2/3 cup sun-dried tomatoes packed in olive oil with garlic, drained and chopped ADVERTISEMENT",
            "1 (8 ounce) package fresh mushrooms, cubed ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 pound yellow squash, cubed ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring farro, chicken bouillon, and water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until farro is tender and the liquid has been absorbed, 20 to 25 minutes. Drain any excess water.\nCook and stir sun-dried tomatoes and mushrooms with basil in a skillet over medium heat until mushrooms are slightly softened, about 5 minutes. Add squash and cook until tender, about 10 more minutes. Cook and stir farro with squash mixture until heated through, 2 to 3 minutes. Sprinkle farro pilaf with Parmesan cheese.\n",
        "picture_link": "Pq/vD./Ptp1BJ0iIwCBHP9mX3gB7vIC"
    },
    {
        "title": "Carne Asada Tacos or Al Pastor Tacos",
        "ingredients": [
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon anise seed ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/4 teaspoon ground thyme ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "5 whole cloves ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1 cup cider vinegar ADVERTISEMENT",
            "1 orange, juiced ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 pounds flank steak ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1/4 (7 ounce) can chipotle peppers in adobo sauce, or to taste ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 tablespoon water, or as needed ADVERTISEMENT",
            "24 (5 inch) corn tortillas ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 bunch cilantro, chopped ADVERTISEMENT",
            "1 bunch radishes, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1/2 chopped onion, 2 cloves garlic, parsley, oregano, paprika, anise seed, black pepper, cumin, sage, thyme, bay leaves, cloves, soy sauce, vinegar, orange juice, and lime juice in a blender; pulse until a very well-blended paste is achieved, scraping down sides as needed, 3 to 5 minutes. Spread paste on both sides of the flank steak. Wrap steak in plastic and refrigerate at least 6 hours to overnight.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate. Remove excess marinade from flank steak.\nGrill steak until it begins to firm and is hot and slightly pink in the center, about 8 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Chop steak into small pieces and transfer to a platter; cover and keep warm until ready to serve.\nPlace 1 chopped onion, tomatoes, chipotle peppers, and 3 cloves garlic in a blend; pulse until desired consistency. Add water if the salsa becomes too thick. Transfer salsa to a bowl.\nHeat tortillas in a microwave safe plate until warm, about 1 minute.\nServe beef over stacks of two corn tortillas with salsa and sprinkle with remaining 1/2 chopped onion, radishes, and cilantro.\n",
        "picture_link": "V.RYOam/xGsc4/D5YfGIMeIIXTR.PMG"
    },
    {
        "title": "Dianne's Pumpkin Cookie Cups",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg (optional) ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup confectioners' sugar, divided ADVERTISEMENT",
            "1/3 cup pumpkin puree ADVERTISEMENT",
            "2 3/4 cups confectioners' sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease 32 miniature muffin cups.\nSift flour, baking powder, salt, and 1/4 teaspoon nutmeg in a bowl. In a separate large mixing bowl, cream unsalted butter with sugar with an electric mixer until smooth and workable; beat in egg and milk. Set the mixer to low speed and and gradually beat in flour mixture, beating just until the dough comes together.\nPinch off dough by tablespoon, roll into a ball, and place balls into the prepared mini muffin cups.\nBake in the preheated oven until edges start to turn golden brown, 8 to 10 minutes. Remove from oven and let stand for 1 minute. Use the back of a rounded teaspoon measure to press a small depression into the top of each cookie. Let the cookies cool for 5 minutes in pan before removing to finish cooling on a rack. It helps to give the cookies a little twist as you lift them out.\nBeat cream cheese with 1 cup confectioners' sugar in a bowl with an electric mixer until smooth. Slowly beat in pumpkin puree until thoroughly combined. Beat in remaining 2 3/4 cups confectioners' sugar, a little at a time. Stir in cinnamon, 1/4 teaspoon nutmeg, 1/4 teaspoon ginger, and a pinch of cloves. Spoon or pipe the pumpkin mixture into each cookie cup.\n",
        "picture_link": "qfGnbrXnRDQdQWiLASgwfbHyJljN9qa"
    },
    {
        "title": "BonBon's Hot Fudge Sauce",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "4 ounces semisweet chocolate (such as Guittard®) ADVERTISEMENT",
            "4 ounces dark chocolate (such as Guittard®) ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sweetened condensed milk into a saucepan with semisweet and dark chocolate and butter over medium-low heat. Melt chocolate and butter, stirring constantly, until the sauce is smooth; stir in vanilla extract. Serve warm.\n",
        "picture_link": "Qni15Ql8fPGmGDq1nJKV0TFJTeTSCIa"
    },
    {
        "title": "Cherry and Raisin Loaf",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons bread machine yeast ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup dried cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the milk, butter, brown sugar, egg, salt, cinnamon, yeast and bread flour into the pan of a bread machine in the order recommended by the manufacturer. Select the white bread cycle. About 5 minutes before the end of the mixing process, add the raisins and cherries. If your bread machine has a fruit setting, use that.\n",
        "picture_link": "glR6GFTP4g33OmWIrEimc4FyZtAT7bO"
    },
    {
        "title": "Tangy Shrimp Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "2 (4.5 ounce) cans small shrimp, drained ADVERTISEMENT",
            "1 (8 ounce) jar cocktail sauce ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the cream cheese, mayonnaise and sour cream until smooth. Spread into the bottom of a serving dish. Top with layers in the following order: shrimp, cocktail sauce, mozzarella cheese, green onion, green pepper, and tomato. Cover and refrigerate for 1 hour before serving.\n",
        "picture_link": "BAAchrWltRY4obTykR6y1QOBLdeycT."
    },
    {
        "title": "Brazilian Whole Banana Pie",
        "ingredients": [
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "10 bananas, peeled and sliced lengthwise ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "2 cups toasted wheat germ ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup light margarine ADVERTISEMENT",
            "1 tablespoon cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nSprinkle 3 tablespoons of brown sugar over the bottom of a small saucepan or skillet. Cook over medium heat until melted. Stir in water until sugar is completely dissolved. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Pour the syrup into a round baking dish or deep dish pie plate and spread to coat the bottom.\nMake a layer of bananas on top of the melted sugar. In a medium bowl, stir together the whole wheat flour, wheat germ, oats and 1 cup of brown sugar. Mix in the margarine using your hands, pinching it into small pieces to make a crumbly dough. Sprinkle half of this over the bananas in the dish and pat down. Top with the remaining bananas and sprinkle with about half of the cinnamon. Spread the rest of the dough over the bananas and pat the pie smooth. Sprinkle remaining cinnamon over the top.\nBake for 45 minutes in the preheated oven, until the pie topping is toasted and a toothpick inserted into the center comes out clean.\n",
        "picture_link": "b33khYQ3OE2kl7RoCnNNcS3bF12nX0G"
    },
    {
        "title": "Dilled Cucumber, Tomato and Celery Salad",
        "ingredients": [
            "1/3 cup water ADVERTISEMENT",
            "1 tablespoon dill seed ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/3 cup buttermilk salad dressing and seasoning mix ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "2 large cucumbers, quartered and thinly sliced ADVERTISEMENT",
            "3 tomatoes, cubed ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/2 onion, sliced and quartered ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water and dill seed in a small saucepan and bring to a simmer over medium-high heat. Reduce heat to medium-low and simmer 10 minutes. Whisk in honey and salad dressing mix, then pour mixture into a large bowl. Whisk in mayonnaise, buttermilk, milk, and vinegar until smooth.\nPlace cucumbers, tomatoes, celery, onion, garlic, and salt into a separate bowl, and pour half of the dressing onto the vegetables; toss well. Cover, and refrigerate salad for at least 1 hour. Cover and refrigerate remaining dressing for future use.\n",
        "picture_link": "53V3tTA2a36GIC5Ko0.QV.I7fnQdnC2"
    },
    {
        "title": "Cinnamon Rice",
        "ingredients": [
            "1 cup uncooked rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 tablespoons nonfat milk ADVERTISEMENT",
            "5 tablespoons raisins ADVERTISEMENT",
            "2 teaspoons margarine ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring rice, water, milk, raisins, and margarine to a boil in a saucepan over medium-high heat, stirring occasionally. Reduce heat to low, cover, and cook until liquid has absorbed and rice is tender, about 15 minutes. Mix together cinnamon and sugar, sprinkle over rice to serve.\n",
        "picture_link": "Gds72hyoX9s9W6ibpLMnOIhFoeoSpYy"
    },
    {
        "title": "Coffee Smoother",
        "ingredients": [
            "1/2 cup coffee ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/2 cup chocolate ice cream ADVERTISEMENT",
            "1 tablespoon cinnamon ADVERTISEMENT",
            "1/4 cup ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the coffee, milk, ice cream, cinnamon, and ice cubes in the bowl of a blender; puree until smooth.\n",
        "picture_link": "K3nvudisEd8sNF6/UyWBPwKczxKiV0G"
    },
    {
        "title": "Nicole's Balsamic Beet and Fresh Spinach Salad",
        "ingredients": [
            "1/4 cup aged balsamic vinegar ADVERTISEMENT",
            "1/4 cup white wine vinegar ADVERTISEMENT",
            "1 tablespoon Chardonnay wine ADVERTISEMENT",
            "2 tablespoons white sugar (optional) ADVERTISEMENT",
            "1 (15 ounce) can sliced beets, drained and cut into 1/4 inch slivers ADVERTISEMENT",
            "1/4 cup thinly sliced red onions ADVERTISEMENT",
            "4 cups chopped fresh spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the balsamic vinegar, white wine vinegar, Chardonnay, and sugar in a small bowl. Place the beets and onions in a small, sealable container. Pour the vinegar mixture over the beets and onions to completely cover. Seal top; marinate in refrigerator for 4 to 5 hours.\nWhen ready to serve, divide spinach leaves between four salad plates. Top with beet mixture, and drizzle salads with a bit of the marinating liquid.\n",
        "picture_link": "Z7ZTvfJyq09VBLP6u5krqrFrPMwLQ56"
    },
    {
        "title": "Chocolate Dipped Bing Cherries",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "8 ounces semisweet chocolate, chopped ADVERTISEMENT",
            "24 Bing cherries with stems ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the sugar into a shallow dish. Drop two drops of vanilla at a time into the dish in 24 separate places to form lumps of vanilla sugar. Set aside to allow the lumps to harden.\nPit the cherries carefully from the bottom. I use a small curved dental tool. Make sure the stem stays intact.\nWhen the lumps of sugar have hardened, insert them into the cherries where the pits were; set aside. Melt chocolate in the microwave, stirring every 30 seconds until melted and smooth.\nHold cherries by the stem and dip into the chocolate leaving the very top uncovered. Set on waxed paper to dry. Refrigerate overnight to allow the sugar lumps to dissolve.\n",
        "picture_link": "OO5JLJyaKnYkQw9owatspm9HzDeDiay"
    },
    {
        "title": "Sauteed Navy Beans and Artichokes",
        "ingredients": [
            "6 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground red pepper ADVERTISEMENT",
            "1 (15 ounce) can navy beans, drained and rinsed ADVERTISEMENT",
            "1 (14 ounce) can marinated artichoke hearts, drained and quartered ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat. Stir in the garlic, season with red pepper, and cook about 1 minute. Mix in beans, and continue to cook and stir until slightly crisp. Mix in artichoke hearts, and cook 2 minutes. Season with freshly ground black pepper and salt. Top with Romano cheese to serve.\n",
        "picture_link": "CeZFhviKEWyW1Z/NJMBNcqFr25poLH6"
    },
    {
        "title": "Beef and Broccoli Salad",
        "ingredients": [
            "1 1/2 pounds broccoli - cut into florets, stems peeled and sliced 1/4 inch thick ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon prepared horseradish, or to taste ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "3 tablespoons sour cream ADVERTISEMENT",
            "3/4 pound thick sliced deli roast beef, cut into 1/2-inch pieces ADVERTISEMENT",
            "2 1/2 cups cherry tomatoes, halved ADVERTISEMENT",
            "6 green onions cut diagonally into thin slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1/2 inch of water into a pan fitted with a steamer basket. Place the broccoli in the basket. Cover, and bring to a boil. Cook until tender, about 4 to 5 minutes. Drain, and cool.\nTo make the dressing, whisk together the vinegar, mustard, horseradish, salt, and pepper in a bowl. Continue whisking while slowly adding the olive oil to make a smooth mixture. Whisk in the sour cream.\nPlace the broccoli, roast beef, tomatoes, and green onions into a bowl. Stir in the dressing and toss until evenly coated. Divide the salad evenly among 4 serving plates.\n",
        "picture_link": "736lUWxUbfCc1bOztUXjk82r/efA/dy"
    },
    {
        "title": "Griddle Scones",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening or lard ADVERTISEMENT",
            "1 tablespoon corn syrup ADVERTISEMENT",
            "1 1/2 cups buttermilk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk together the flour, baking soda, sugar, and salt. Cut in the shortening with a fork, pastry blender, or by pinching between your fingers. Make a well in the center, and pour in the corn syrup and buttermilk. Stir with a sturdy spoon to form a soft dough. Divide the dough in half, and pat out into 3/4 inch thick circles on a floured surface. Cut each circle into 6 wedges.\nHeat a griddle over medium heat, and grease lightly with cooking spray or oil. Cook scones on each side, then stand them on edge, and cook all three edges. Cool on a wire rack.\n",
        "picture_link": "5dtcv2KyTkQPe3YquMOP.PR5DsFRPw."
    },
    {
        "title": "Vegetable Koftas",
        "ingredients": [
            "For the Koftas ADVERTISEMENT",
            "1 1/2 cups frozen mixed vegetables, thawed ADVERTISEMENT",
            "2 slices bread ADVERTISEMENT",
            "1 1/4 cups mashed potatoes ADVERTISEMENT",
            "1 serrano pepper, finely chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 teaspoon minced fresh ginger ADVERTISEMENT",
            "1 tablespoon chopped cilantro ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "vegetable oil, for deep-fat frying ADVERTISEMENT",
            "For the Gravy ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 medium onions, chopped ADVERTISEMENT",
            "1 teaspoon minced ginger ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 teaspoons ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon garam masala ADVERTISEMENT",
            "1/2 cup tomato paste ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup cream (optional) ADVERTISEMENT",
            "2 tablespoons coarsely chopped cashews ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil the mixed vegetables till soft. Drain, and allow to cool to room temperature. When cool, chop fine and set aside.\nMoisten the slices of bread with a little water and squeeze out the excess. Stir together the vegetables, bread, mashed potatoes, serrano, onion, ginger, cilantro, and salt. Form into 8 balls.\nHeat oil in deep-fryer to 375 degrees F (190 degrees C).\nFry the koftas in the hot oil until golden brown. Drain on paper towels, and allow to cool to room temperature.\nMake the gravy by melting the butter in a large saucepan over medium-high heat. Stir in the onions, ginger, garlic, ground coriander, turmeric, and garam masala; cook until the onions have softened. Mix in the tomato paste and cook for 5 minutes. Pour in the milk and season with salt; cook for 10 to 15 minutes more, stirring occasionally.\nTo serve, reheat the koftas in the gravy. Garnish with the cream and chopped cashews.\n",
        "picture_link": "IaewtMywB4BwTGjf98U2r1AV9nHRNyq"
    },
    {
        "title": "Good Glop",
        "ingredients": [
            "1 pound sliced bacon ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "4 large green onions, sliced ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain on paper towels and crumble.\nMix together the crumbled bacon, Cheddar cheese, green onions, and mayonnaise. Refrigerate overnight before serving.\n",
        "picture_link": "9ch/.rptQQVAWEeLnx9Vy60PnK1bV22"
    },
    {
        "title": "Lasooni Murgh (Garlic Flavored Spicy Chicken)",
        "ingredients": [
            "1 (8 ounce) container plain yogurt ADVERTISEMENT",
            "1 clove garlic, mashed into a paste ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons garam masala ADVERTISEMENT",
            "2 teaspoons white pepper ADVERTISEMENT",
            "5 saffron threads ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken, cut in 1-inch pieces ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon cumin seed ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the yogurt, garlic paste, lemon juice, garam masala, white pepper, and saffron; season to taste with salt. Toss the chicken in the yogurt and marinate in the refrigerator for 10 to 12 hours.\nHeat the oil in a frying pan over medium-high heat. Toss in the cumin seeds and allow to cook until fragrant, 20 to 30 seconds. Add the chicken and brown in the oil. Discard any remaining marinade. Turn heat to medium-low, cover, and continue cooking until the chicken is cooked through, about 15 minutes. Pour in the cream and heat through. Serve immediately.\n",
        "picture_link": "MWiL7Ovu3l3UIQ0mMdD.A0gQ4NYkrx2"
    },
    {
        "title": "Fresh-Squeezed Salty Dog",
        "ingredients": [
            "1 grapefruit, juiced ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger gin ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Shake together the grapefruit juice, gin, and a generous amount of salt in a cocktail shaker. Pour into a glass over ice.\n",
        "picture_link": "zCBBnZ8D7/zAidm4H/60wpKGuFxl1jO"
    },
    {
        "title": "Russian Quaalude",
        "ingredients": [
            "Ice cubes ADVERTISEMENT",
            "1 fluid ounce coffee liqueur ADVERTISEMENT",
            "1 fluid ounce vodka ADVERTISEMENT",
            "1 fluid ounce Irish cream liqueur ADVERTISEMENT",
            "1 fluid ounce hazelnut liqueur, such as Frangelico ADVERTISEMENT",
            "1 fluid ounce half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a highball glass with ice. Pour in coffee liqueur, vodka, Irish cream, hazelnut liqueur and half-and-half. Stir with a cocktail stirrer.\n",
        "picture_link": "7r3LM.fSseeQ1cKpXQGR0t./99A8CsG"
    },
    {
        "title": "Stew Beef Sauerbraten",
        "ingredients": [
            "2 tablespoons shortening ADVERTISEMENT",
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1 teaspoon browning sauce ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the shortening in a pressure cooker pot over medium-high heat. Add the stew beef; cook, turning occasionally, until the outside is browned. Pour in the water, vinegar and browning sauce. Add the bay leaves and season with salt and pepper to taste.\nClose the lid on the pressure cooker and bring to full pressure. Adjust the heat as needed. Once the pot comes to full pressure, cook for 15 minutes. Remove from the heat and release the pressure according to the manufacturer's instructions. While the pressure is releasing, mix together the flour and 1/2 cup of water in a cup. Pour this into the pressure cooker, and cook over medium-high heat, stirring frequently, until thickened.\n",
        "picture_link": "IkC/fM90qDqZpuTenNCgvrICO7gIWdK"
    },
    {
        "title": "Simple Stovetop Amish Chicken",
        "ingredients": [
            "1 (2 pound) roasting chicken ADVERTISEMENT",
            "8 cups water, or as needed ADVERTISEMENT",
            "1 (28 ounce) can low fat, low sodium chicken broth ADVERTISEMENT",
            "3 large baking potatoes, peeled ADVERTISEMENT",
            "1 (10 ounce) package wide egg noodles ADVERTISEMENT",
            "1 teaspoon salt-free seasoning blend ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken into a large pot, and fill with enough water to cover it. Bring to a boil, cover, and cook over high heat until chicken is easily removed from the bone, about 35 minutes. Turn the chicken over once during this time so it will cook evenly. Cutting the chicken into pieces can speed up the cooking process a bit.\nWhile the chicken is cooking, cut two of the potatoes into large chunks, and the other potato into very small cubes.\nWhen the chicken is cooked, remove it from the water. Pull off the skin, and place all of the chicken meat in a separate dish. Pull the meat apart in long shreds. Reserve the cooking water in a separate container. Discard chicken skin and bones.\nPour the chicken broth into the pot, and add potatoes, chicken, salt, and pepper. Pour in 2 to 3 cups of the reserved water. Bring to a boil, and cook for about 15 minutes, until potatoes start to soften. Add 3 more cups of the chicken water, and the noodles. Season with salt-free seasoning blend, salt, and pepper. Cover, and simmer over medium-low heat until the noodles are tender and small potato pieces have dissolved.\n",
        "picture_link": "nnoPz/WVjA1Yl1uAvZ9u7S70EsCGzGO"
    },
    {
        "title": "Mediterranean Onion Dip",
        "ingredients": [
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 roasted red pepper, diced ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "10 pitted kalamata olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, combine the garlic, red pepper, onion soup mix, feta cheese, cream cheese, sour cream and olives. Process until smooth and well blended. Transfer to a bowl, and refrigerate for 30 minutes to blend flavors before serving.\n",
        "picture_link": "raOMkiclfdWJEYUg7YOClBt/hfYUSJC"
    },
    {
        "title": "Leftover Scalloped Potato Soup",
        "ingredients": [
            "4 cups leftover scalloped potatoes ADVERTISEMENT",
            "4 cups chicken broth, or as needed ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup cubed cooked ham (optional) ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the scalloped potatoes into a large pot, and pour in enough chicken broth to cover the potatoes completely. Season with garlic powder, salt and pepper. Add ham if using. Bring to a boil, and reduce heat to low. Stir in the Cheddar and Parmesan cheese, and simmer for about 10 minutes.\n",
        "picture_link": "wBZzT4mS7s4THYvaPjVydLqb1DEVNF."
    },
    {
        "title": "Kifta",
        "ingredients": [
            "1 1/2 cups vegetable oil for frying ADVERTISEMENT",
            "1 large potato, thinly sliced ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1/2 bunch fresh parsley, chopped ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons ground allspice ADVERTISEMENT",
            "1 1/2 teaspoons ground nutmeg ADVERTISEMENT",
            "1 1/2 teaspoons cumin ADVERTISEMENT",
            "1 large tomato, thinly sliced ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "2 cups long grain white rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Heat the oil in a large heavy skillet over medium-high heat. When the oil is hot, place potato slices in a thin layer, and fry just until golden. Remove with a slotted spoon, and set aside on paper towels.\nIn a medium bowl, mix together the ground beef, minced onion, garlic, parsley, salt, pepper, allspice, nutmeg, and cumin. Press flat into a 7x11 inch baking dish. Arrange potato slices over the meat in an even layer. Place tomato slices over the potato. Top with slices of onion. Cover with aluminum foil.\nBake for 45 minutes in the preheated oven. Remove the aluminum foil from the top, and continue to bake for another 15 minutes, or until browned.\nWhile the kifta is cooking, combine the rice and water in a saucepan. Bring to a boil, then reduce heat to low, cover, and simmer for 20 minutes or until rice is tender. When kifta is done, cut into squares and serve over rice.\n",
        "picture_link": "Lpd5uGI/hZV5tB9e4w2XClj6UBIjaz."
    },
    {
        "title": "Autumn Apple-Squash Crisp",
        "ingredients": [
            "4 1/2 cups butternut squash - peeled, seeded, and cut into 3/4-inch chunks ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "4 large Granny Smith apple - peeled, cored and chopped ADVERTISEMENT",
            "2 large carrots, peeled and shredded ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "Topping ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "1 cup wheat bran ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nPour about 1 inch of water into the bottom of a pan. Place the squash into a steamer basket fitted into the pan. Bring to a boil, then reduce heat to medium, cover, and steam the squash until tender and easily pierced with a fork, about 15 minutes. Cool.\nPlace the squash, 2/3 cup brown sugar, 1/2 cup all-purpose flour, eggs, milk, vanilla, 2 teaspoons cinnamon, nutmeg, and cloves in the bowl of a food processor. Pulse until the mixture is smooth. Pour into a large mixing bowl. Stir in the apples, carrots, and raisins until evenly blended. Spread the mixture over the bottom of the prepared baking dish.\nMix together the rolled oats, wheat bran, 1 cup brown sugar, 1/2 cup whole wheat flour, and 1 tablespoon cinnamon with the melted butter in a bowl until crumbly. Spoon the topping over the apple-squash mixture.\nBake in preheated oven until top is golden brown and the apples are tender, 30 to 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "ChoriQueso",
        "ingredients": [
            "2 tablespoons corn oil ADVERTISEMENT",
            "8 ounces chorizo sausage ADVERTISEMENT",
            "8 ounces sliced mozzarella cheese ADVERTISEMENT",
            "1 (12 ounce) package corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nHeat the corn oil in a large skillet over medium heat. Crumble in the chorizo sausage; cook and stir until evenly browned, about 5 minutes. Remove from the pan, and set aside. Place slices of cheese in a single layer to cover the bottom of the pan. It is okay if they overlap a little bit. When cheese melts, quickly pour into a nice casserole dish, or oven-proof bowl. Sprinkle the chorizo on top.\nBake for 5 minutes in the preheated oven, or until cheese is fully melted. Remove from the oven, stick a fork in it and load your tortilla.\n",
        "picture_link": "O3BlK50YhXxaL/sAC2hSC01Ap5ZOqHy"
    },
    {
        "title": "Southwest Garden Stew",
        "ingredients": [
            "6 ounces cubed beef stew meat ADVERTISEMENT",
            "1/2 large onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 large zucchini, chopped ADVERTISEMENT",
            "1 medium yellow squash, chopped ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 cooked chicken breast, cubed ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "2 tablespoons cream or milk ADVERTISEMENT",
            "1/2 (10 ounce) package frozen corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook beef in a large pot over medium heat until browned on all sides. Stir in onion, garlic, zucchini, squash, and tomatoes. Cook, stirring, for 3 to 5 minutes.\nStir in chili powder, cumin, oregano, Italian seasoning, and red pepper flakes. Stir in chicken, broth, and cream. Cover, reduce heat to low, and simmer 2 hours.\nStir in corn. Cover, and increase heat to medium low. Simmer for 45 minutes. If the stew becomes too thick, stir in a little water to reach the desired consistency.\n",
        "picture_link": "R3qzkolPVkYffIYz3KRl6iaBbvNFLGu"
    },
    {
        "title": "Dutch East Chicken Wings and Rice",
        "ingredients": [
            "Wings: ADVERTISEMENT",
            "3 1/2 pounds chicken wings, tips on ADVERTISEMENT",
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "3 (10.75 ounce) cans tomato soup ADVERTISEMENT",
            "2 teaspoons ground cloves ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "8 bay leaves ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Rice: ADVERTISEMENT",
            "2 cups long grain rice, rinsed and drained ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 teaspoon cloves ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground turmeric ADVERTISEMENT",
            "1/3 cup slivered almonds ADVERTISEMENT",
            "1/3 cup golden raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPour tomato sauce and soup into a large roasting pan. Stir in cloves, garlic, bay leaves, cayenne, and salt and pepper. Take the tip of each chicken wing and bend it back, securing it under the joint where thigh and drummette are joined. Place wings in pan, and spoon sauce over chicken.\nCover pan, and bake in a preheated oven for 30 minutes. Reduce heat to 325 degrees F (165 degrees C), and bake until sauce is thick, about 1 1/2 hours.\nTo prepare rice, combine rice, water, cloves, salt, turmeric, almonds, and raisins in a large saucepan over high heat. Bring to a boil. Reduce heat, and simmer until rice is cooked, about 10 minutes.\n",
        "picture_link": "iQrbcdg4QCOLbj2OtlKjOlDln3nFNiO"
    },
    {
        "title": "Portuguese Fresh Tuna (Sauce and Marinade)",
        "ingredients": [
            "3 tablespoons pimenta moida ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 teaspoon pepper ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "2 tablespoons hot paprika ADVERTISEMENT",
            "4 large fresh tuna steaks ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "1/4 cup pimenta moida ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons hot paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 teaspoon pepper ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable plastic bag, mix 3 tablespoons pimenta moida, 1/4 cup cider vinegar, 1/2 teaspoon salt, 1/3 teaspoon pepper, 1 tablespoon garlic powder, and 2 tablespoons hot paprika. Place tuna steaks in the bag, seal, and gently shake to coat. Marinate in the refrigerator 1 1/2 to 3 hours.\nMelt the butter and heat the olive oil in a large, heavy cast iron skillet over medium-high heat. Discard marinade, and place tuna steaks in the skillet. Fry 2 1/2 minutes on each side, or until fish is easily flaked with a fork. Remove from skillet and drain on paper towels.\nMix 1/4 cup pimenta moida, ketchup, 1/4 cup cider vinegar, water, 2 tablespoons hot paprika, 1/2 teaspoon salt, 1/3 teaspoon pepper, and 1 tablespoon garlic powder into the skillet. Scrape up browned bits, and cook sauce 3 minutes, or until slightly thickened. Scoop a portion of the sauce over the cooked fish to serve, and serve remaining sauce as a gravy for rice and potatoes.\n",
        "picture_link": "TwR027RId1xyBfiYDSurvZXbRuLEiXO"
    },
    {
        "title": "Grilled Oyster Shooters",
        "ingredients": [
            "8 fresh oysters in shells ADVERTISEMENT",
            "1/3 cup Fresh lemon juice ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "hot pepper sauce to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat. You may assemble your ingredients while the grill heats up.\nPlace the whole oysters on the hot grill. Cook until they open, 5 to 10 minutes - you will hear the juice sizzling on the hot coals when this happens.\nRemove the oysters from the grill, and pry off the top shell. You may want to wear some heavy gloves to protect from the heat. Slide a knife between the oyster and shell to disconnect. Top each one with 2 teaspoons of lemon juice, 1 teaspoon of Worcestershire sauce, and hot pepper sauce and salt to taste. Serve in the shell while still warm.\n",
        "picture_link": "uWgL3mU3Hru55TbgwnPbu8tLHhzEGwa"
    },
    {
        "title": "Homemade Potato Soup",
        "ingredients": [
            "6 medium white potatoes, peeled and chopped ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 carrot, peeled and diced ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 tablespoon oil-packed minced garlic ADVERTISEMENT",
            "4 cubes chicken bouillon ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 tablespoon parsley flakes ADVERTISEMENT",
            "1 tablespoon salt-free herb seasoning blend ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 1/2 cups soy milk ADVERTISEMENT",
            "2 cups chopped broccoli ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker, place the potatoes, onions, carrot, celery, oil-packed garlic, and bouillon cubes. Pour in the water, and season with parsley, herb seasoning blend, and Italian seasoning.\nCover slow cooker, and cook soup 3 to 4 hours on High, or 10 to 12 hours on Low. Stir in soy milk during the final 30 minutes of cook time.\nPlace broccoli over boiling water in a pot fitted with a steamer basket, and steam 5 minutes, or until tender but firm. Spoon into the soup to serve.\n",
        "picture_link": "I9qodMKm2CvuSviHPRMceP1Zb8BsJVW"
    },
    {
        "title": "Stir-Fried Pumpkin",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "4 cups cubed fresh pumpkin ADVERTISEMENT",
            "1/2 cup grated carrot ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons black sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet. Add the onion and garlic; cook and stir until the onions begin to brown. Stir in the pumpkin, carrot, soy sauce, salt, and pepper; cook another 5 to 7 minutes, until pumpkin is tender. Sprinkle with sesame seeds before serving.\n",
        "picture_link": "/o6GaD5zZ..wNjYgVHRRFqCIxTO2Mpq"
    },
    {
        "title": "Rotini and Salami Casserole",
        "ingredients": [
            "1 (16 ounce) package uncooked rotini pasta ADVERTISEMENT",
            "2 (28 ounce) jars pasta sauce ADVERTISEMENT",
            "2 1/4 pounds salami, cubed ADVERTISEMENT",
            "2 (8 ounce) packages shredded Italian cheese blend ADVERTISEMENT",
            "8 (1 ounce) slices provolone cheese ADVERTISEMENT",
            "Italian seasoning to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Place rotini in the pot, and cook for 8 to 10 minutes, until al dente. Drain, and mix with the pasta sauce to coat.\nScoop half the pasta and sauce into a large casserole dish. Layer with 1/2 the salami, and 3/4 of the shredded cheese. Cover with remaining pasta mixture, layer with remaining salami and shredded cheese, and top with provolone slices. Sprinkle with Italian seasoning.\nCover with aluminum foil, and bake 35 minutes in the preheated oven, until bubbly.\n",
        "picture_link": "IgXM3aeRKG6K2xWsR91hW1qihhYZVNy"
    },
    {
        "title": "Corn Balls",
        "ingredients": [
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 (11 ounce) can cream-style corn ADVERTISEMENT",
            "1 cup water or chicken broth ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "10 cups soft bread cubes ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nHeat a saucepan over medium-high heat and coat with cooking spray. Add the celery and onion. Cook and stir until tender. Reduce the heat to medium and mix in the cream-style corn, water and salt. Remove from the heat and stir in the eggs and bread cubes. Form into balls about the size of baseballs, and place them on a cookie sheet. Brush melted butter onto the balls.\nBake for 15 minutes in the preheated oven, or until heated through and the outside is lightly toasted.\n",
        "picture_link": "6I8dzNnVX/UYj3f5AXAF08G7goQE8gy"
    },
    {
        "title": "Bramblett's Vegetable Stock",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 onions, cut into chunks ADVERTISEMENT",
            "1 celeriac (celery root), chopped ADVERTISEMENT",
            "1 cup potato peelings ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "1 cup fresh mushrooms ADVERTISEMENT",
            "1 cup butternut squash peelings and pulp ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large pot over medium-low heat. Place onions in pot and cook 20 minutes, stirring occasionally until very tender and golden brown.\nMix celery root, potato peels, carrots, mushrooms and squash into pot. Season with salt. Continue cooking 45 minutes or until vegetables are very tender and golden brown.\nPour water into pot. Bring to a boil. Reduce heat to low and simmer 30 minutes, stirring occasionally. Strain out the solids, taste for sufficient salt and voila! Your stock!\n",
        "picture_link": "9CK6Ce3WrvAO30LgdpsBXXhqWb1J9Se"
    },
    {
        "title": "North Indian Nepali Curry Dumplings",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 tablespoon garam masala ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon ginger paste ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "2 (10 ounce) packages round dumpling wrappers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the dipping sauce, heat the olive oil in a skillet over medium heat. Stir in 1 clove of garlic and the chopped onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the tomato, salt, pepper, and cayenne pepper. Cover and reduce heat to low and continue cooking for 15 minutes. Remove from heat and stir in 1 tablespoon cilantro. Pour sauce into a blender and carefully blend until smooth. Cover and refrigerate until ready to use.\nCombine the ground pork, 1 bunch of cilantro, chopped onion, green onions, garam masala, curry powder, 2 cloves of garlic, ginger paste, salt, and pepper in a large bowl. Place a heaping teaspoon of the pork mixture in the center of a dumpling wrapper. Moisten the edge of the wrapper with a few drops of water. Fold the dumpling in half into a half moon shape. Repeat with the remaining dumplings.\nPlace a steamer insert into a saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Add the dumplings, recover, and steam until cooked through, about 15 minutes. Serve with the dipping sauce.\n",
        "picture_link": "P68LdNlMNFEehzoEC1eSvunHOyJpLyG"
    },
    {
        "title": "Hazel's Pumpkin Cornbread",
        "ingredients": [
            "2 cups yellow cornmeal ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup corn oil ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the cornmeal, baking powder and baking soda. Make a well in the center and pour in the eggs, oil, honey, pumpkin puree and buttermilk. Let the batter stand while you preheat the oven.\nPreheat the oven to 425 degrees F (220 degrees C). Heat an 8 or 9 inch cast-iron skillet on the stovetop until hot. Coat with cooking spray, then pour in the cornbread batter.\nBake for 20 to 25 minutes, or until cornbread starts to pull away from the sides of the pan.\n",
        "picture_link": "CrmyZw20HAd46N/fV/84wh9uh.4ekLa"
    },
    {
        "title": "Smoky Black Beans",
        "ingredients": [
            "1 pound dry black beans, soaked overnight ADVERTISEMENT",
            "4 teaspoons bacon drippings ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 teaspoons hickory-flavored liquid smoke ADVERTISEMENT",
            "2 tablespoons dark molasses ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "4 slices pickled jalapeno peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain the black beans from their soaking water and place in a slow cooker. Fill with enough fresh water to cover them. Cover and set to High.\nHeat bacon drippings in a skillet over medium heat. Add onions; cook and stir until tender. Stir this into the beans along with the brown sugar, liquid smoke, molasses and jalapeno slices. Stir to blend, then cover and cook on High for 5 to 6 hours, or until beans are tender.\n",
        "picture_link": "P6Vv8In8dONgrDpwpupu4mlo.ZkiADq"
    },
    {
        "title": "Pumpkin, Butter Bean, and Spinach Curry",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "3 tablespoons curry paste ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1 pound pumpkin, cut into 1 inch squares ADVERTISEMENT",
            "1 (15 ounce) can small butter beans (lima beans) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (9 ounce) package frozen spinach, thawed and drained ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large saucepan over medium heat, and stir in the onion. Cook and stir until the onion is soft and beginning to brown, about 8 minutes. Stir in the curry paste, cook for 2 minutes longer, then add the coconut milk water, and pumpkin. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the pumpkin is nearly tender, about 10 minutes.\nStir in the butter beans, and continue simmering until the pumpkin is tender, about 5 minutes. Season to taste with salt and pepper, then stir in the spinach and cilantro. Simmer a few more minutes to reheat, and serve.\n",
        "picture_link": "5/k0E4VpkCEUfFW/lD0WzCpNUlxxp82"
    },
    {
        "title": "Blended Berry Pancakes",
        "ingredients": [
            "1 cup pancake mix ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "10 whole frozen strawberries ADVERTISEMENT",
            "1/2 cup frozen blueberries ADVERTISEMENT",
            "1 teaspoon brown sugar, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a pancake griddle to medium heat. Whisk together the pancake mix and water in a bowl.\nPlace the still-frozen strawberries into a blender, and pulse several times to break the berries up into small pieces. Mix the chopped strawberries and the frozen blueberries into the batter until the fruit is well distributed.\nGrease the griddle with butter, and pour about 1/4 cup of batter per pancake onto the griddle. Allow the bottom side to brown and the batter to form air holes; sprinkle the uncooked side with brown sugar, if desired, and flip to brown the other side.\n",
        "picture_link": "AcN0nO8z/guxZgI/utOBVqWIZbgTsvC"
    },
    {
        "title": "Tropical Paradise Pancakes",
        "ingredients": [
            "2 cups buttermilk pancake mix ADVERTISEMENT",
            "1 1/2 cups orange juice ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 large banana, sliced ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the pancake mix and orange juice; the batter will be lumpy. Stir in the pineapple, banana, pecans, and coconut.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter.\n",
        "picture_link": "FFUZHvtSQZKNXz9bt/LQ/R8I1ZjdukO"
    },
    {
        "title": "RWOP Finalist: PHILLY Stuffed Mushrooms",
        "ingredients": [
            "3 (8 ounce) packages mushrooms ADVERTISEMENT",
            "2 (8 ounce) packages PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1 packet Italian dressing mix ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/8 teaspoon ground red pepper (cayenne) ADVERTISEMENT",
            "1 (6 ounce) package stuffing mix ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nClean mushrooms and remove stems; set aside.\nMix cream cheese, Italian dressing mix, mayonnaise, onion, parsley, Parmesan cheese and red pepper; set aside.\nPut stuffing mix in separate bowl.\nStuff mushrooms with the cream cheese mixture.\nPress cream cheese side of mushrooms into the stuffing mix until well coated.\nPlace mushrooms cream cheese sides up, on a baking pan, then drizzle with the melted butter.\nBake for 30 min. Enjoy!\n",
        "picture_link": "erEg7xCLgvhrpFL49DRwAk7DvhArwRS"
    },
    {
        "title": "Pistachio Twists",
        "ingredients": [
            "1 (17.5 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "1/3 cup finely chopped shelled pistachios ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nUnfold the sheets of puff pastry, and brush tops with egg white. Sprinkle pistachios and salt over the egg white wash; flip the sheets, brush with egg white, and sprinkle with pistachios and salt. With a sharp knife, cut pastry into 3-inch long strips, about 3/4 inch wide. Twist the strips twice, then arrange on the prepared baking sheets so they don't touch.\nBake in the preheated oven until browned, about 15 minutes.\n",
        "picture_link": "w9K6CrbNY3k2HsKReWpEdP0X/9uBlkm"
    },
    {
        "title": "Venison with Blackberry Wine Sauce",
        "ingredients": [
            "2 tablespoons shallot, minced ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "3 tablespoons blackberry jam ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 cup beef stock ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 (1/2 pound) venison steaks ADVERTISEMENT",
            "12 fresh blackberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat shallots, garlic, blackberry jam, and red wine in a saucepan over medium-high heat. Simmer until reduced to 1/2 cup of liquid, about 15 minutes. Strain liquid through a fine mesh sieve and set aside. Heat the beef broth in a separate skillet over medium-high heat until reduced by half, 15 to 20 minutes. Whisk the two reduced sauces together, and stir in the butter. Season with salt and pepper.\nHeat a skillet over medium-high heat. Cook the venison steaks until they are beginning to firm, and are hot and slightly pink in the center, 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read at least 145 degrees F (65 degrees C). Serve the steaks with the sauce and a few fresh blackberries.\n",
        "picture_link": "dasDbYIK4XgEeqFVSqPTMgGzDGbeic."
    },
    {
        "title": "Truffle Lovers' Popcorn",
        "ingredients": [
            "4 teaspoons white truffle oil ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (3.5 ounce) package microwave popcorn, popped ADVERTISEMENT",
            "1/4 teaspoon sea salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the truffle oil, parsley, and Parmesan cheese in a heat-safe bowl.\nPlace unopened package of popcorn into center of microwave oven; cook on High power until the bag fills with popped corn and the pops occur about 2 seconds apart (1 1/2 to 4 minutes, depending on oven's power). Open hot bag carefully and pour into bowl. Toss with truffle oil mixture; season to taste with sea salt.\n",
        "picture_link": "Mzb/8cDKjtaej.tNANPwfgALIh8TBDO"
    },
    {
        "title": "Fiesta Pita",
        "ingredients": [
            "1 (6 inch) whole wheat pita bread ADVERTISEMENT",
            "1/2 cup vegetarian refried beans ADVERTISEMENT",
            "1/4 avocado - peeled, pitted and diced ADVERTISEMENT",
            "2 tablespoons fresh salsa, or to taste ADVERTISEMENT",
            "2 tablespoons crumbled feta cheese, divided ADVERTISEMENT",
            "hot sauce to taste ADVERTISEMENT",
            "2 teaspoons chopped fresh cilantro, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm the pita in a toaster oven until fragrant, 1 or 2 minutes; cut in half and open up each half. Heat the beans in a small saucepan over medium heat until hot, and mix in the avocado. Divide the bean mixture in half, and fill each half of the pita with half the bean mixture. Top each pita with 1 tablespoon of feta cheese, and add a dash of hot sauce and a teaspoon of chopped fresh cilantro to each.\n",
        "picture_link": "GVg4xDYeB9fanBV642CUiNsVrzzz8RG"
    },
    {
        "title": "Roasted Green Beans with Dill Vinaigrette",
        "ingredients": [
            "2 pounds fresh green beans, trimmed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon coarse salt ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 1/2 teaspoons Dijon mustard ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon dried dill ADVERTISEMENT",
            "1/2 teaspoon coarse-ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C).\nCombine the green beans in a large bowl with 1 tablespoon olive oil and the coarse salt; toss to coat.\nRoast the green beans in the preheated oven until cooked through, about 20 minutes.\nWhisk 1 tablespoon of olive oil, red wine vinegar, Dijon mustard, sugar, dill, and pepper together in a bowl; drizzle over the roasted green beans to serve.\n",
        "picture_link": "EDQ/phKFbwcNJ3qActnOGesWM.m0GAW"
    },
    {
        "title": "Blackberry Bubble Ring",
        "ingredients": [
            "18 frozen dinner rolls, thawed ADVERTISEMENT",
            "1/2 cup blackberry jam ADVERTISEMENT",
            "1/3 cup corn syrup ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a tube pan.\nFlatten each dinner roll into a circle, then place about 1/2 teaspoonful blackberry jam onto the center of the dough. Roll the filled dough into a ball, then transfer the dough into the prepared pan.\nBake in the preheated oven until golden brown, about 30 minutes.\nCombine the corn syrup, butter, and vanilla extract in a small bowl. Pour over the baked rolls, and allow syrup to be absorbed before removing from the pan. To remove from the pan, run a paring knife between the bread and the edge of the pan. Hold the pan on its side and gently tap the sides of the pan against the counter to loosen it. Cover the pan with a plate or cooling rack, and invert it to tip the bread out of the pan and onto the plate.\n",
        "picture_link": "sv8JpdkzJ.NrwmloUUeLlSyyMZjnLou"
    },
    {
        "title": "Dark Chocolate Chipotle Cookies",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "8 ounces semi-sweet chocolate, chopped ADVERTISEMENT",
            "2 cups butter, softened ADVERTISEMENT",
            "2 cups brown sugar ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup cocoa powder, sifted ADVERTISEMENT",
            "2 teaspoons finely chopped chipotle peppers in adobo sauce ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 1/2 cups chocolate chips ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together flour, baking soda, and salt in a bowl.\nPlace the chopped chocolate into a microwave-safe bowl; melt in the microwave oven at 40 percent power in 30-second intervals; stirring after each melting, until the chocolate is warm and smoothly melted, 1 to 3 minutes. Allow to cool slightly.\nIn a separate large bowl, use an electric mixer to beat the butter, brown sugar, 1 1/2 cup of white sugar, cocoa powder, and chipotle pepper until smooth. Add the eggs one at a time, beating each egg into the mixture before adding the next. Beat in the vanilla extract and water.\nMix the melted chocolate into the butter mixture. Gently stir in the flour mixture until incorporated. Mix in the chocolate chips. Cover bowl, and refrigerate dough for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nPlace 1/2 cup sugar in a small bowl. Roll dough into small balls. Roll balls in sugar to coat. Place the cookies onto the prepared baking sheets, about 2 inches apart.\nBake in the preheated oven until cookies are set, 12 to 14 minutes. Allow to cool on the sheets for a minute or two before removing to racks to finish cooling.\n",
        "picture_link": "qLgBuReQ8CCHv11/MQeBxrQyWZ594Yq"
    },
    {
        "title": "Bay Leaf Beet Soup",
        "ingredients": [
            "4 large red beets, trimmed ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "2 tablespoons chopped leek ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "4 cups vegetable broth ADVERTISEMENT",
            "5 bay leaves, broken in half ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1/8 teaspoon dried basil ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pinch ground cumin ADVERTISEMENT",
            "1 pinch dried tarragon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Wrap beets in foil.\nBake the beets until tender, about 1 hour; allow to cool, then peel the beets. Cut them into bite-size chunks.\nHeat the olive oil in a soup pot over medium heat, and cook the red onion, leek, and garlic until the onion is translucent, about 5 minutes. Pour in the vegetable broth, and mix in the beets, bay leaves, cinnamon, salt, black pepper, oregano, basil, cinnamon, cumin, and tarragon. Bring the soup to a boil, then reduce heat to a simmer, and cook until the flavors of the bay leaves and spices are blended, 20 to 25 minutes. Pick out bay leaves.\nLadle about 1/4 of the beets into a blender, and add soup liquid as needed to fill the blender about 1/4 full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the beets and broth moving before leaving it on to puree. Puree the beets until smooth, and pour back into the soup.\n",
        "picture_link": "ZHcpo/FTjwo4gRbV/cDUQEPOP2CoSmO"
    },
    {
        "title": "Spicy Garlic Hot Wings",
        "ingredients": [
            "1 (4 pound) bag chicken wing drumettes ADVERTISEMENT",
            "2 tablespoons hot chili oil ADVERTISEMENT",
            "2 tablespoons minced fresh ginger ADVERTISEMENT",
            "4 cloves garlic minced or pressed ADVERTISEMENT",
            "2 green onions (including tops) minced ADVERTISEMENT",
            "1/3 cup Kikkoman Soy Sauce ADVERTISEMENT",
            "3 tablespoons Kikkoman Rice Vinegar ADVERTISEMENT",
            "1 1/2 tablespoons sugar ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1/2 cup chopped cilantro ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat over to 400 degrees F. Bake chicken wings on a nonstick baking sheet for 20 minutes, drain liquid. Turn wings over and bake for an additional 25 minutes until done and lightly browned.\nIn the meantime put hot chili oil in a small saute pan. Add ginger, garlic, and green onions. Saute for 3 minutes, turn saute pan heat down to low and add in the rice vinegar, sugar, sesame oil, and cilantro. Stir well to combine.\nIn a small bowl mix cornstarch and water, pour into sauce pan with vegetable. Stir together and heat until it thickens, about 5 minutes. Place cooked wings in a large bowl, toss with the thickened sauce.\n",
        "picture_link": "meBGqMlHhUTPH.VdRCppwEb5wD5wBRO"
    },
    {
        "title": "Flapper Pie",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Meringue: ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nMix the graham cracker crumbs, 1/2 cup sugar, melted butter, and cinnamon in a bowl. Reserve 1/4 cup for topping the pie. Press the remaining crumb mixture in the bottom and up the sides of a 9-inch deep-dish pie plate. Bake the crust in the preheated oven for 8 minutes.\nHeat the milk in a saucepan over medium-high heat. In a non-plastic bowl, whisk together the 1/2 cup sugar, cornstarch, egg yolks, and vanilla. When the milk is hot but not boiling, slowly pour the milk in a steady stream into the yolk mixture, whisking constantly. Return the custard to the saucepan and bring to a boil over medium heat, stirring constantly with a wooden spoon or a heat-proof spatula. Cook and stir for 2 to 3 minutes over low heat until the custard has thickened. Pour the custard into the graham cracker crust.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nBeat the egg whites until medium peaks form; add 2 tablespoons of sugar and beat until the meringue is stiff. Scoop out the meringue on top of the custard filling. Sprinkle the meringue with the reserved graham cracker crumbs.\nPlace the pie under the broiler and bake until the meringue starts to brown, 3 to 5 minutes.\n",
        "picture_link": "g4dH0P6VQ/mB8YxsyZZ6TtAcsI14WtW"
    },
    {
        "title": "Hearty Beef Soup",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 (26 ounce) containers beef broth ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (12 fluid ounce) can tomato juice ADVERTISEMENT",
            "1 cup frozen mixed vegetables ADVERTISEMENT",
            "1/2 cup pearl barley ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the beef broth, then add the ground beef. Cook for 10 minutes, stirring and breaking up the ground beef. Mix in the diced tomatoes and tomato juice.\nStir in the mixed vegetables, pearl barley, basil, parsley, and pepper. Simmer until the barley is tender, 40 to 50 minutes.\n",
        "picture_link": "1mlGvvGDBidzTtPVFQbFb4aHTQfUed2"
    },
    {
        "title": "Sweet Chunk Zucchini Pickles",
        "ingredients": [
            "1 gallon water ADVERTISEMENT",
            "16 cups peeled and cubed zucchini ADVERTISEMENT",
            "1 cup pickling lime (calcium hydroxide) ADVERTISEMENT",
            "1 gallon water ADVERTISEMENT",
            "2 cups apple cider vinegar ADVERTISEMENT",
            "8 cups white sugar ADVERTISEMENT",
            "3 teaspoons pickling spice ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the zucchini into one gallon water in a large bowl. Stir in the pickling lime, and let stand for 24 hours. Drain and rinse the zucchini a few times, then cover with a fresh gallon water. Let stand for 3 hours, then drain.\nHeat the vinegar, sugar, pickling spice, and salt in a large pot over medium heat until the sugar dissolves. Stir in the drained zucchini. Cover and rest the zucchini for 24 hours. Bring the zucchini mixture to a simmer over medium heat for 35 minutes. Allow to cool.\nSterilize about 10 pint-sized jars and lids in boiling water for at least 5 minutes. Divide and pack the zucchini mixture evenly into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings. Store in the refrigerator.\n",
        "picture_link": "EOBZS.gxSbabeIT6N4ibnRr1PBZasPe"
    },
    {
        "title": "Quinoa with Peaches and Creamy Yogurt",
        "ingredients": [
            "1 cup quinoa ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 large fresh peach, pitted and chopped ADVERTISEMENT",
            "1/2 cup fat-free Greek yogurt ADVERTISEMENT",
            "2 tablespoons honey, or to taste ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 tablespoon lime juice, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "If quinoa is not pre-rinsed, rinse in plenty of cool water to remove coating, and drain. Bring 2 cups of water to a boil in a saucepan, and stir in the quinoa; reduce heat to low, and simmer until tender, 15 to 20 minutes. Drain excess water, and mix in the cinnamon and 1 teaspoon of nutmeg.\nMix the chopped peach with yogurt in a bowl. Serve quinoa in a serving bowl, topped with about 2 tablespoons of the peach yogurt. Drizzle with a teaspoon or so of honey, sprinkle with nutmeg, and drizzle about a teaspoon of lime juice over the top.\n",
        "picture_link": "slFaecFdP7XCZSzBoNILQBhm0izXLdG"
    },
    {
        "title": "Brown Sugar Pecan Refrigerator Cookies",
        "ingredients": [
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the brown sugar and butter with an electric mixer in a large bowl until smooth. Beat in the egg and vanilla extract until completely incorporated. Mix the flour, baking powder, and salt together in a separate bowl, then stir the flour mixture into the butter mixture until just incorporated. Fold in the pecans mixing just enough to evenly combine.\nRoll the dough into a log, and wrap in wax paper. Chill the dough in the refrigerator for at least one hour.\nPreheat an oven to 350 degrees F (175 degrees C). Slice the dough and arrange the cookies on a baking sheet.\nBake in the preheated oven until the edges are golden, about 12 minutes. Allow the cookies to cool on the baking sheet for 1 minute before removing to a wire rack to cool completely.\n",
        "picture_link": "ZpFhjxtklq76lGITqw8t.y2Oy3M6mXW"
    },
    {
        "title": "Cardamom Rose Meringues",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 teaspoons rose extract ADVERTISEMENT",
            "1/4 teaspoon ground cardamom ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 drop red food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Line a baking sheet with parchment paper.\nIn a mixing bowl, beat egg whites and cream of tartar together with an electric mixer on high speed until the mixture forms stiff peaks.\nPlace sugar, water, rose extract, cardamom, salt, and food coloring in a saucepan, and bring to a simmer over low heat, stirring until the sugar has dissolved. Simmer the mixture for a minute or two, stirring constantly, and very slowly pour the syrup in a thin stream into the egg whites, beating constantly with electric mixer on high speed. Beat until the syrup is incorporated and the meringue is stiff and shiny.\nDrop by spoonfuls or pipe into rosettes with a star tip onto the prepared baking sheet.\nBake in the preheated oven until the meringues are hard, 1 to 1 1/2 hours; turn off the oven, and allow them to cool inside the oven to finish baking the insides.\n",
        "picture_link": ".xClFcUCtCoh8xXZkOPqAX4Cz4Op2x."
    },
    {
        "title": "Broth Pesto with Pasta, Peas, and Chicken",
        "ingredients": [
            "4 cups reduced-sodium vegetable broth ADVERTISEMENT",
            "1 (8 ounce) package seashell pasta ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons chopped spring onions ADVERTISEMENT",
            "1 (12 ounce) package Quorn™ Chicken-Style Recipe Tenders ADVERTISEMENT",
            "1 cup sweet peas ADVERTISEMENT",
            "3 tablespoons pesto sauce, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the vegetable broth into a saucepan, and bring to a boil. Stir in the pasta, and boil over medium-low heat until tender, about 8 minutes. Drain pasta, and reserve broth.\nHeat the butter in a skillet over medium heat, and stir in half the spring onions; cook and stir until the onions begin to soften, 2 to 3 minutes, then add the vegetarian chicken-style pieces. Cook until vegetarian pieces are browned, about 3 minutes per side, then stir in remaining onion and green peas. Pour 1/2 cup of reserved vegetable broth into the skillet. Bring the mixture to a boil, cook for 1 to 2 minutes to cook the peas, and stir in the pasta and pesto sauce. Mix in an additional 1/2 cup of broth to form a creamy sauce.\n",
        "picture_link": "uKXb1DinXZCvfOh.3SdV7hNl.tyxpW."
    },
    {
        "title": "Mozzarella-Stuffed Turkey Burgers",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1/2 red bell pepper, diced (optional) ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the ground turkey, egg, black beans, red bell pepper, mozzarella cheese, garlic powder, salt, and black pepper together in a bowl until blended; form the mixture into 4 patties.\nHeat a large skillet over medium heat; cook the turkey patties in the skillet until cooked through and no longer pink the center, 7 to 10 minutes per side. An instant-read meat thermometer inserted into the center of a patty should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "WjKEe4YshTk03jPf7jEdfQcZTbGE/uO"
    },
    {
        "title": "Abstinence on the Beach",
        "ingredients": [
            "1 (12 fluid ounce) can frozen concentrated grapefruit juice ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen cranberry juice concentrate ADVERTISEMENT",
            "1/4 cup coconut milk ADVERTISEMENT",
            "9 cups cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 6 quart container combine concentrated grapefruit juice, concentrated cranberry juice and water. Put about 1 cup of juice and coconut milk in food processor or blender. Blend until smooth and pour back into main juice mixture. Stir to incorporate.\nChill at least 2 hours. Serve in punch bowl or pitcher.\n",
        "picture_link": "01Jb84UW/xcfvDD2.71Kng4YyD0XX6e"
    },
    {
        "title": "Braciola III",
        "ingredients": [
            "1 1/2 pounds boneless round steak ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon chopped parsley ADVERTISEMENT",
            "3 slices bacon, cut into 1 inch pieces ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 (32 ounce) jar spaghetti sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using a glancing motion, pound round steak to 1/2 inch with a moistened mallet or the side of a cleaver. Rub with garlic and sprinkle with cheese and parsley, leaving a small border around the edges. Place bacon pieces evenly over steak and season with salt and pepper. Roll up from the narrow end, and tie tightly with twine.\nHeat oil in Dutch oven over medium-high heat. Brown roll on all sides, 1 to 2 minutes a side. Pour in spaghetti sauce, reduce heat to low, and simmer, covered, for 60 to 90 minutes, until tender.\n",
        "picture_link": "gtl.x/xLFybSQMERSHrnUEt.BHyUyfO"
    },
    {
        "title": "Frozen Sherbet Dessert",
        "ingredients": [
            "1 (10 ounce) package frozen raspberries ADVERTISEMENT",
            "1/2 gallon pineapple sherbet ADVERTISEMENT",
            "2 firm bananas. sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place frozen raspberries in hot water for 5 minutes to thaw slightly. Empty sherbet into a large bowl. Stir in raspberries and bananas. Place bowl, covered, in freezer until firm.\n",
        "picture_link": "6m1TNAh/FwkvEaMWcHxZgyyFP4QaxiK"
    },
    {
        "title": "World's Greatest Martini",
        "ingredients": [
            "8 fluid ounces gin ADVERTISEMENT",
            "1/2 fluid ounce dry vermouth ADVERTISEMENT",
            "1/2 fluid ounce sweet vermouth ADVERTISEMENT",
            "4 cups ice cubes ADVERTISEMENT",
            "4 pimento-stuffed green olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill cocktail shaker with fresh ice cubes. Add about 1/2 ounce each dry and sweet vermouth. Shake enough to coat ice and pour off liquid. Add eight ounces gin to coated ice in shaker and shake vigorously. Pour into four chilled Martini glasses, garnish with pimiento-stuffed olive and serve.\n",
        "picture_link": "ED/OvLrI649ZWKN6FB/meMHvlt.EU62"
    },
    {
        "title": "Carolina BBQ Pork Sauce",
        "ingredients": [
            "2 cups distilled white vinegar ADVERTISEMENT",
            "2/3 cup ketchup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon crushed red pepper ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a sauce pan, combine vinegar, ketchup, water and sugar. Season with salt, black pepper, cayenne pepper and red pepper flakes. Bring to a boil, reduce heat and simmer until sugar is dissolved.\n",
        "picture_link": "wQfNA6z7MSL.eyk6ZFRIGWqQK9SIAdK"
    },
    {
        "title": "Braciola II",
        "ingredients": [
            "2 pounds top sirloin ADVERTISEMENT",
            "2 medium heads garlic, minced ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, chopped ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "32 ounces tomato sauce ADVERTISEMENT",
            "1 tablespoon anise seed ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut sirloin into 6 oblong pieces, 3/16 inch thick. Lay out on waxed paper and sprinkle each piece with garlic, parsley, pepper and salt. Roll up each piece, beginning at the narrow end, and tie tightly with twine.\nHeat oil in large Dutch oven over medium-high heat. Place rolls in pot and brown, 1 to 2 minutes on each side. Pour in 1/2 cup of red wine, reduce heat to low and simmer 10 minutes. Pour in half of peeled, chopped tomatoes, cover and simmer 15 minutes.\nMix together tomato paste and water. Combine with remaining peeled tomatoes, crushed tomatoes, and tomato sauce and add to pot in small increments, cooking down slightly after each, for a total of 30 minutes. Sprinkle in anise seed, oregano and sugar and simmer 1 hour more.\nThirty minutes before serving pour in remaining wine and basil. Simmer until ready to serve.\n",
        "picture_link": "flVEuJVjKqzORY7bVueY5Rms0ddAC5u"
    },
    {
        "title": "American Lite Fried Rice",
        "ingredients": [
            "1 cup dry jasmine rice ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 cups broccoli florets ADVERTISEMENT",
            "1 cup cauliflower florets ADVERTISEMENT",
            "5 green onions, chopped ADVERTISEMENT",
            "1 (10 ounce) package shredded carrots ADVERTISEMENT",
            "3 cups shredded cabbage ADVERTISEMENT",
            "1 (8 ounce) can water chestnuts, drained ADVERTISEMENT",
            "1/4 cup soy sauce, or to taste ADVERTISEMENT",
            "1/4 cup water as needed ADVERTISEMENT",
            "chili sauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, bring 2 cups of water to a boil. Stir in rice. Reduce heat, cover, and simmer for 20 minutes.\nHeat vegetable oil in a large skillet over medium heat. Cook garlic and rice in oil for about 2 minutes, stirring frequently to avoid burning the garlic. Add broccoli and cauliflower florets and cook, stirring occasionally, for 3 to 5 minutes. Toss green onions, carrots, cabbage, and water chestnuts into the pan, and cook another 5 minutes, or until vegetables are tender. Add additional water as needed to keep vegetables moist. Drizzle with soy sauce, and toss to coat.\n",
        "picture_link": "eX/j6TzcD2YSDlLLaeZf3X9lh5DKWO."
    },
    {
        "title": "Mom's Seafood Pasta Salad for a Crowd",
        "ingredients": [
            "1 (32 ounce) package dried small pasta shells ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1/2 (16 ounce) bottle French dressing ADVERTISEMENT",
            "1/2 (16 ounce) bottle thousand island dressing ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 (5 ounce) cans water packed tuna, drained and flaked ADVERTISEMENT",
            "2 (6 ounce) cans tiny shrimp, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large bowl, toss together cooked pasta, celery and green onions. Mix in French dressing, thousand island dressing and mayonnaise. Fold in tuna and shrimp. Cover and chill in the refrigerator at least 3 hours.\n",
        "picture_link": "2NKCNfiWFLqB6y62BQFZ1cVHoXAMSpy"
    },
    {
        "title": "Cheese Ball - Easy",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup shredded cooked corned beef ADVERTISEMENT",
            "1 teaspoon prepared horseradish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together cream cheese, corned beef and horseradish using your hands. Form into a ball, wrap in plastic wrap, and refrigerate for several hours or overnight for best flavor. Serve with crackers.\n",
        "picture_link": "aFp39za2Vig3tdto2zC3k/6405dtIyy"
    },
    {
        "title": "Melt in Your Mouth Pralines",
        "ingredients": [
            "2 cups chopped pecans ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 275 degrees F (135 degrees C). Spread pecans out on a baking sheet in a single layer. Bake for 15 minutes in the preheated oven, or until fragrant. Set aside.\nIn a saucepan, stir together the confectioners' sugar, white sugar, buttermilk, heavy cream, butter, and salt. Bring to a boil over medium heat. When the mixture begins to boil, start stirring gently with a wooden spoon, and continue cooking until the mixture is slightly above the soft ball stage to 250 degrees F (120 degrees C).\nRemove from heat, and stir in baking soda and vanilla. The mixture will expand some while stirring. Cool for 10 to 15 minutes, then stir in pecans. Keep stirring with a wooden spoon until the mixture loses its gloss. Drop teaspoonfuls of the mixture onto parchment paper that has been coated with butter flavored non-stick spray. Allow to cool completely.\n",
        "picture_link": "nnqrq.07BkLMZ6QWTJWlnoBoATkyZuS"
    },
    {
        "title": "Chipas (Argentinean Cheese Bread)",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "6 ounces shredded Italian cheese blend ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 3/4 cups tapioca starch ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Oil a baking sheet with cooking spray and set aside.\nStir together egg, milk, cheese, and butter in a large bowl. Sprinkle in tapioca starch and flour; stir in to form a dough. Knead dough for two minutes on a lightly floured surface, then roll into golf ball-sized pieces, and place onto prepared baking sheet.\nBake in preheated oven until golden brown, 10 to 15 minutes.\n",
        "picture_link": "1hEJOaD1iR7Lz6gjPNQVTaYZ81ugK6K"
    },
    {
        "title": "Qabali - Afghani  Rice",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "5 carrot, julienned ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 cup sultana raisins ADVERTISEMENT",
            "4 cups uncooked basmati rice ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 pinch saffron (optional) ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Place rice in a large bowl, rinse, and then soak in cold water for 30 minutes.\nIn a large skillet, heat 3 tablespoons oil over medium heat. Add carrots and 1 teaspoon sugar; cook, stirring frequently, until tender. Stir in raisins, and continue cooking until the raisins are soft and plump. Remove from heat, and set aside to cool.\nBring a large pot of water to a boil. Strain rice, and then add to boiling water. Cook for about 5 minutes, then strain with a mesh strainer.\nIn a small saucepan, heat 1/2 cup oil and 1 tablespoon sugar. Cook until sugar dissolves completely, making a syrup. Remove from heat , and cool. Once cool, add 1 cup water, and return to a boil.\nReturn the rice to pan. Stir in carrots and raisins, and then mix in oil and sugar syrup. Season with saffron, cinnamon, cardamom, black pepper, and cumin. Poke some holes with a spoon all over the rice. Cover, and cook over high heat until you hear crackling noises. Remove from heat.\nBake, covered, in preheated oven for 20 minutes. Remove from oven, and toss rice with a fork.\n",
        "picture_link": "LD2rx0xWSXt9VwfjtN.sACr0iTUwFKi"
    },
    {
        "title": "Corned Beef Dip",
        "ingredients": [
            "1 (12 ounce) can canned corned beef ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix all ingredients in a bowl, cover, and chill for 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken Fried Pheasant",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1 1/2 tablespoons distilled white vinegar ADVERTISEMENT",
            "2 pheasant breast halves, thinly sliced ADVERTISEMENT",
            "1 cup finely crushed saltine cracker crumbs ADVERTISEMENT",
            "1 cup canola oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow bowl, mix the milk and vinegar. Dip the pheasant slices in the milk and vinegar mixture, then press both side in the cracker crumbs to coat.\nHeat the oil in a skillet over medium-high heat. Cook the pheasant in the hot oil about 5 minutes on each side, or until golden brown. Drain on paper towels.\n",
        "picture_link": "fPtDdM6bagkUIa.aB.xOf/az3siWhHC"
    },
    {
        "title": "Justine's Artichoke Chicken Spinach Dip",
        "ingredients": [
            "1 (10 ounce) box frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 (13.75 ounce) can artichoke hearts, drained ADVERTISEMENT",
            "1 (12.5 fl oz) can chunk chicken, drained ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the spinach, artichokes, chicken, mayonnaise, cheese, garlic, and liquid smoke in a large bowl; mix well. Spoon mixture into a glass baking dish.\nBake in preheated oven until the edges turn golden brown, about 30 minutes.\n",
        "picture_link": "T8wtR2HCiaF.jqzwcnYLO4Tnt13doHy"
    },
    {
        "title": "Strawberries Romanov",
        "ingredients": [
            "1/2 cup sour cream ADVERTISEMENT",
            "1 1/2 cups vanilla ice cream, softened ADVERTISEMENT",
            "1 cup sweetened whipped cream ADVERTISEMENT",
            "1/4 cup orange flavored liqueur, or to taste ADVERTISEMENT",
            "2 cups fresh strawberries, hulled ADVERTISEMENT",
            "2 sprigs mint leaves, for garnish ADVERTISEMENT",
            "shaved semisweet chocolate, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the sour cream, vanilla ice cream, and whipped cream. Gradually stir in the orange liqueur. Divide the berries between two parfait glasses, and spoon the cream mixture over them. Garnish with mint leaves and shaved chocolate.\n",
        "picture_link": "/Ps9yUjbwP.CioxvAbHF6EBgk1eOMAW"
    },
    {
        "title": "Pumpkin Pie Cocktail",
        "ingredients": [
            "2 scoops vanilla ice cream ADVERTISEMENT",
            "1/2 cup crushed ice ADVERTISEMENT",
            "1 tablespoon canned pumpkin ADVERTISEMENT",
            "1 fluid ounce half-and-half ADVERTISEMENT",
            "1 fluid ounce spiced rum ADVERTISEMENT",
            "1/4 teaspoon pumpkin pie spice ADVERTISEMENT",
            "2 tablespoons whipped topping ADVERTISEMENT",
            "1 pinch pumpkin pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the ice cream, ice, pumpkin, half-and-half, rum, and 1/4 teaspoon pumpkin pie spice in a blender; blend until smooth. Pour into a serving glass; top with whipped topping, sprinkle with pinch of pumpkin pie spice.\n",
        "picture_link": "aADkxN83gCtz27o4GJKXSFeSGkcGRri"
    },
    {
        "title": "Wyoming Stew",
        "ingredients": [
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "2 teaspoons meat tenderizer ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1 (16 ounce) package frozen stew vegetables ADVERTISEMENT",
            "1 (10 ounce) can refrigerated crescent dinner rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a cast-iron skillet over medium-high heat. Sprinkle meat tenderizer over beef cubes, and cook in the hot skillet until browned. Drain off any excess juice. In a small bowl, mix together the chicken broth, cream of chicken soup and onion soup mix. Pour over the meat, reduce heat to low, and simmer for 45 minutes.\nPreheat the oven to 350 degrees F (175 degrees C). Add the frozen stew vegetables to the skillet, and simmer for 10 more minutes. Unroll the crescent roll dough, and arrange to cover the top of the pan like a pie.\nBake for 10 to 15 minutes in the preheated oven, or until the top is golden brown. Remove from oven and serve.\n",
        "picture_link": "nDdSsINixx9RWrZzxXRFkq2QLtZM8Nq"
    },
    {
        "title": "Clams Creole",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup chopped green onions, white part only ADVERTISEMENT",
            "1/2 cup finely chopped green bell pepper ADVERTISEMENT",
            "1/2 cup finely chopped celery ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "2 pounds fresh cherrystone or littleneck clams, scrubbed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a pot large enough to hold your clams, over medium heat. Add the onions, green pepper, celery and garlic; and cook, stirring until tender, about 5 minutes.\nStir in the can of tomatoes with green chilies, wine and clams. Turn the heat up to medium-high, cover the pot, and cook for 5 to 8 minutes, or just until all of the clams have opened. Remove from heat immediately.\n",
        "picture_link": "F.WIsBDRHDQyw5Gro2Bd.K7HVSfA6v6"
    },
    {
        "title": "Blueberry Meringue Pie",
        "ingredients": [
            "1 (9 inch) pie shell, partially baked ADVERTISEMENT",
            "4 cups blueberries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nIn a large bowl, stir together the sugar, cinnamon and cornstarch. Add blueberries and lemon juice, and stir gently to coat berries. Pour into the pie crust.\nBake for 30 minutes in the preheated oven. When the pie is done, whip the egg whites in a large glass or metal bowl until soft peaks form. Gradually sprinkle in sugar while continuing to whip into a stiff meringue. Spread over the hot filling so that the meringue is sealed to the crust all around.\nBake for 10 more minutes, or until meringue is nicely browned. Cool to room temperature before refrigerating or serving.\n",
        "picture_link": "Kb1YgduzzMQOFIr63/S5d5kqFzZuhM2"
    },
    {
        "title": "Blue Cheese, Sweet Pecan, and Cranberry Spread",
        "ingredients": [
            "4 ounces crumbled blue cheese ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1/2 cup chopped candied pecans ADVERTISEMENT",
            "1/2 cup chopped dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the blue cheese and cream cheese in a medium bowl. Stir in the pecans and cranberries. Serve at room temperature.\n",
        "picture_link": "Z8kyarmZ/fc/qqWtkc4LAZXbN4xTbhq"
    },
    {
        "title": "Teriyaki Venison",
        "ingredients": [
            "1 pound venison steaks, cubed ADVERTISEMENT",
            "1/3 cup teriyaki sauce ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons Creole seasoning ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the venison in a large bowl. Cover with the teriyaki sauce, and sprinkle with garlic. Marinate at least 4 hours in the refrigerator.\nSift together the flour and Creole seasoning. Dredge the venison in the flour mixture to coat. Discard remaining marinade.\nHeat the oil in a skillet over medium heat. Cook the venison 15 minutes, or until browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cinnamon Gelatin Salad",
        "ingredients": [
            "1 (3 ounce) package raspberry flavored Jell-O® mix ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 (2.25 ounce) package cinnamon red hot candies ADVERTISEMENT",
            "1 cup applesauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small serving bowl, mix together the gelatin and boiling water until gelatin is completely dissolved. Stir in cinnamon candies until melted, then mix in the applesauce. Chill until set, about 3 hours.\n",
        "picture_link": "Rd15En0qDb0ze8O0wNaxcviGO0suZeG"
    },
    {
        "title": "Easy Chip Dip",
        "ingredients": [
            "3/4 cup sour cream ADVERTISEMENT",
            "1/4 cup salsa ADVERTISEMENT",
            "1 (1.8 ounce) packet dry vegetable soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the sour cream, salsa, and the soup mix in a small bowl. Cover and chill in refrigerator at least 15 minutes.\n",
        "picture_link": "xlLb1RQkWIl273IBWaBCBDYVMxKOWuC"
    }
]