[
    {
        "title": "Jan's Pretzel Dogs ",
        "ingredients": [
            "1 (12 fluid ounce) can or bottle room temperature beer ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "4 1/2 cups bread flour ADVERTISEMENT",
            "1/4 cup unsalted butter, melted ADVERTISEMENT",
            "1 large egg yolk ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "10 cups water ADVERTISEMENT",
            "2/3 cup baking soda ADVERTISEMENT",
            "1/4 cup kosher salt, divided - or to taste ADVERTISEMENT",
            "18 hot dogs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the beer in a saucepan over low heat until it reaches 110 degrees F (45 degrees C).\nCombine the warm beer, sugar, and 2 teaspoons kosher salt in a bowl. Sprinkle the yeast on top, and let stand for 5 minutes until the yeast softens and begins to form a creamy foam.\nPlace the bread flour and butter in a bread machine. Add the yeast mixture, then select the dough cycle.\nPreheat an oven to 450 degrees F (230 degrees C).\nLine 2 baking sheets with parchment paper or grease with vegetable oil.\nBeat the egg yolk in a small bowl with 1 tablespoon water; set aside.\nStir baking soda into 10 cups water in a large pot until dissolved, and bring to a boil.\nTurn the dough out onto a lightly-oiled surface, and roll into a 10x20-inch rectangle.\nCut the dough into 18 1-inch wide strips, then wrap each strip tightly around a hot dog in a spiral, pinching the edges to seal, and leaving the ends open. About half an inch of hot dog should peek out of each end of the dough wrapper.\nDrop 2 or 3 dough-wrapped hot dogs into the boiling water for 30 seconds.\nArrange the boiled hot dogs on the prepared baking sheets. Brush each pretzel dog with the egg yolk mixture, and sprinkle with the remaining 1/4 cup salt.\nBake in the preheated oven until golden brown, about 15 minutes.\n",
        "picture_link": "QPIW9z/kpPtRtXlam0veJZB5COWuTD2"
    },
    {
        "title": "Calico Squash Casserole",
        "ingredients": [
            "2 cups sliced yellow squash ADVERTISEMENT",
            "1 cup sliced zucchini ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup sliced green onion ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon salt, divided ADVERTISEMENT",
            "2 cups crushed buttery round crackers ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (8 ounce) can sliced water chestnuts, drained ADVERTISEMENT",
            "1 large carrot, shredded ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 (4 ounce) jar diced pimento peppers, drained ADVERTISEMENT",
            "1 teaspoon sage ADVERTISEMENT",
            "1/2 teaspoon white pepper ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large saucepan combine yellow squash, zucchini, onion, green onion, water and 1/2 teaspoon salt. Cover and cook over medium heat about 6 minutes. Drain well and set aside.\nIn a medium bowl combine cracker crumbs and butter. Mix well and spread half of the mixture into the bottom of a 9x13 inch casserole dish.\nIn a large bowl combine soup, water chestnuts, carrots, mayonnaise, pimentos, sage, pepper and remaining 1/2 teaspoon salt. Fold in squash mixture and spoon over crumb crust. Sprinkle cheese on top, and then the remaining cracker crumbs.\nBake in preheated oven for 20 to 30 minutes, or until firm and heated through.\n",
        "picture_link": "ryM4imegsJnclmxRjtnPci.GHsPqEbG"
    },
    {
        "title": "Gaye's Microwave Fudge",
        "ingredients": [
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x9 inch dish.\nIn a microwave safe bowl, stir together confectioners' sugar and cocoa. Pour milk over mixture and place butter in bowl. Do not mix. Microwave until butter is melted, 2 minutes. Stir in vanilla and stir vigorously until smooth. Pour into prepared dish.\nChill in freezer 10 minutes before cutting into squares.\n",
        "picture_link": "CmbTQXGb03215MQJ.2yZ/jzQSjrtKIe"
    },
    {
        "title": "French Herb Bread",
        "ingredients": [
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon minced parsley ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl combine the yeast, sugar, 1 teaspoon of the salt and 1 1/2 cups of the flour.\nIn a sauce pan combine the milk, water and 1/4 cup of the butter or margarine until 110 degrees F (38 degrees C). Add milk mixture and vinegar to the flour mixture and blend at low speed of the mixer until moistened. Beat at medium speed for 3 minutes.\nStir in 1 1/2 cups additional flour to form a sticky dough. Turn dough out onto a floured surface and knead adding 1/2 to 1 cup more of flour until dough is smooth and pliable. Place dough in a greased bowl and let rise in a warm place until doubled in volume.\nPunch down dough and roll into a rectangle shape about 16x8 inches.\nIn a saucepan heat the onion, garlic, 1/2 teaspoon salt, parsley and 2 tablespoons butter or margarine until butter or margarine is melted. Spread over the dough rectangle and starting from the 16 inch side roll the dough up tightly like a jelly roll.\nPlace the bread seam side down onto a greased cookie sheet and let rise until doubled in sized.\nPreheat oven to 400 degrees F (205 degrees C).\nBake bread until golden brown about 20 to 30 minutes. Brush hot bread with melted butter and sprinkle with chopped parsley.\n",
        "picture_link": "NbZCQAqcHV.LCFpVgQ7uJ5rlL7k9g6O"
    },
    {
        "title": "Ann's Sister's Meatloaf Recipe",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups dry bread crumbs ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 teaspoon monosodium glutamate (MSG) ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "2 slices bacon ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl combine the beef, eggs, crumbs, ketchup, MSG, water and soup mix. Mix well and spoon mixture into loaf pan. Cover with 2 strips of bacon, then cover with tomato sauce.\nBake in preheated oven for 1 hour.\n",
        "picture_link": "3hVK7sMbYgpjwD6d3IELgN5Mgj8a1Gy"
    },
    {
        "title": "Turkey Wild Rice Soup",
        "ingredients": [
            "3 (10.5 ounce) cans condensed chicken broth ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/2 cup finely chopped green onions ADVERTISEMENT",
            "1/2 cup uncooked wild rice ADVERTISEMENT",
            "8 slices bacon ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon poultry seasoning ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups half-and-half cream ADVERTISEMENT",
            "1 1/2 cups cooked, diced turkey meat ADVERTISEMENT",
            "2 tablespoons dry sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, combine chicken broth, water, green onions and wild rice. Bring to a boil, then reduce heat and simmer until rice is tender, 35 to 40 minutes.\nMeanwhile, cook the bacon in a large skillet over medium heat until crisp. Allow to cool and then crumble. Set aside.\nWhen rice is tender, melt the margarine in a medium saucepan over medium-low heat. Stir in flour, salt, poultry seasoning and pepper all at once. Cook, stirring, until smooth and bubbly. Stir in half-and-half and cook until thickened, 2 minutes. Stir half-and-half mixture into rice mixture. Stir in bacon, turkey and sherry. Heat through and serve.\n",
        "picture_link": "idVJYdSDxA.KikOuBOO8TamZKb2ARLa"
    },
    {
        "title": "Zucchini Cookies",
        "ingredients": [
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup grated zucchini ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together the margarine and sugar until smooth. Beat in the egg then stir in the zucchini. Combine the flour, baking soda, salt and cinnamon; stir into the zucchini mixture. Mix in raisins. Cover dough and chill for at least 1 hour or overnight.\nPreheat oven to 375 degrees F (190 degrees C). Grease cookie sheets. Drop dough by teaspoonfuls onto the prepared cookie sheet. Cookies should be about 2 inches apart.\nBake for 8 to 10 minutes in the preheated oven until set. Allow cookies to cool slightly on the cookie sheets before removing to wire racks to cool completely.\n",
        "picture_link": "UEvc0eVRoz5OI9xsKa1ndgGKv2U6yKq"
    },
    {
        "title": "Chocolate Chip Cookie Bars",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, beat together the butter, vanilla and sugar until light and fluffy. Sift together the salt and flour and mix into the butter mixture. Fold in the chocolate chips and nuts. Mix until well blended. Press batter into a 15x10 inch jelly roll pan.\nBake 20 minutes or until golden brown. Cut into bars and let cool in pan on wire rack.\n",
        "picture_link": "l12PQd/Awd8y0nFP9OQtQMGPi0skPVC"
    },
    {
        "title": "Grilled Filet Mignon with Gorgonzola Cream Sauce",
        "ingredients": [
            "4 cups heavy cream ADVERTISEMENT",
            "3 ounces crumbled Gorgonzola cheese ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "4 (8 ounce) fillets beef tenderloin ADVERTISEMENT",
            "1 pinch lemon pepper ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch onion powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "12 slices thick sliced bacon, chopped ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour heavy cream into a saucepan and bring to a boil over medium heat. Reduce heat and simmer until the cream has reduced by half, stirring occasionally, about an hour. Remove from heat and whisk in the Gorgonzola cheese and Parmesan cheese, salt, pepper, and nutmeg, until the cheese has melted.\nSeason the beef tenderloin with lemon pepper, garlic powder, onion powder, salt, and pepper. Set aside. Place the bacon in a large, deep skillet, and cook over medium-high heat, stirring occasionally, until evenly browned, about 10 minutes. Drain the bacon on a paper towel-lined plate.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nCook the steaks until they start to firm, and are reddish-pink and juicy in the center, 3 to 5 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove the steaks from the grill and tent with foil to rest for 5 to 10 minutes. Serve each steak with the Gorgonzola sauce and top with crumbled bacon and chopped green onion.\n",
        "picture_link": "jItcIu7q.l.4XxGfWHCxv9fwsfT7dQO"
    },
    {
        "title": "Light Chocolate Chip Cookies",
        "ingredients": [
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream the butter with the brown and white sugars. Stir in the vanilla, egg white, and water. Sift together the flour, baking soda, and salt; stir into the creamed mixture. Mix in the chocolate chips.\nDrop dough by heaping spoonfuls onto ungreased cookie sheets. Bake for 8 to 10 minutes in the preheated oven. Allow cookies to cool for 1 minute on baking sheets before transferring to wire racks to cool completely.\n",
        "picture_link": "Pj4ubuYYFEyNYlW.gUh/WgkzOIy.Hhe"
    },
    {
        "title": "Cheeseburger Noodle Casserole",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "8 ounces spaghetti ADVERTISEMENT",
            "1 (14.5 ounce) can peeled and diced tomatoes ADVERTISEMENT",
            "1 packet dry onion soup mix ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium high heat, saute the ground beef for 5 minutes, or until browned; drain excess fat.\nPrepare the spaghetti according to package directions; drain water.\nIn a 2 quart casserole, combine the browned beef, cooked spaghetti, tomatoes, onion soup mix, sour cream, basil, garlic powder and salt and pepper to taste. Mix together well.\nCover dish and bake in preheated oven for 15 minutes. Top with the cheese and bake, uncovered, for 15 more minutes.\n",
        "picture_link": "dJbTJKOPR1dD7bYnsGPo5CilUvq.sxG"
    },
    {
        "title": "Lemon Pasta Sauce",
        "ingredients": [
            "4 tablespoons butter ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1 teaspoon grated lime zest ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "10 ounces uncooked pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a sauce pan or skillet large enough to hold the pasta when it is done, combine the butter, cream, and beef broth or bouillon and simmer over medium heat until reduced by about half. Add the lemon juice, lemon and lime zest and set aside.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Toss pasta with sauce; serve.\n",
        "picture_link": "O0a6CVX0DP/TBkw8MOUB8dHGzVSxsOa"
    },
    {
        "title": "Gina's Lemon Pepper Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 teaspoon lemon pepper ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken in a lightly greased 9x13 inch baking dish. Season with lemon pepper, garlic powder and onion powder to taste. Bake in preheated oven for 15 minutes.\nTurn over chicken pieces and add more seasoning to taste. Bake for an additional 15 minutes, or until chicken is cooked through and juices run clear.\n",
        "picture_link": "FmvYEZUHVgSFiW39GxMAIeEPlPH8j6K"
    },
    {
        "title": "Chicken Noodle Casserole II",
        "ingredients": [
            "1 large onion, diced ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3 (10 ounce) cans chicken chunks ADVERTISEMENT",
            "1 pint sour cream ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken and mushroom soup ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (8 ounce) package uncooked egg noodles ADVERTISEMENT",
            "4 ounces buttery round crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In medium skillet, fry onion in butter until softened. Pour into 9x13 baking dish.\nIn large bowl, combine chicken chunks, sour cream and soup. Stir in 2 cups of shredded cheddar. Stir in uncooked egg noodles. Pour mixture over onions in baking dish. Top with crumbled crackers and remaining cheddar.\nBake 30 minutes, or until top is golden and noodles are soft.\n",
        "picture_link": "HqmLJEDZGwnuhBorW8RIHNwGB6MQ7am"
    },
    {
        "title": "Upside Down Pumpkin Cake",
        "ingredients": [
            "1 (29 ounce) can pumpkin puree ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix with pudding ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, blend pumpkin, cinnamon, cloves, salt, sugar, eggs and milk. Pour mixture into a 9x13 inch baking dish. Sprinkle dry cake mix and nuts over the batter. Pour melted butter over the cake.\nBake in a preheated 350 degrees F (175 degrees C) oven for 60 minutes and let cool. The cake will be \"liquidy\" at first, but will solidify as it cools.\n",
        "picture_link": "4MS3azEJrFMC2KpYVLItBTtsmwIVf1S"
    },
    {
        "title": "Pebber Nodder (Danish Christmas Cookies)",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the butter and sugar until smooth. Beat in the eggs one at a time, stirring until light and fluffy. Combine the flour, cardamom and cinnamon; stir into the sugar mixture just until blended.\nSeparate the dough into 6 balls, and roll each ball into a rope about as big around as your finger on a lightly floured surface. Cut into 1/2-inch pieces, and place them on an ungreased baking sheet.\nBake for 10 minutes in the preheated oven, or until lightly browned. Cool on baking sheets for a few minutes, then transfer to wire racks to cool completely.\n",
        "picture_link": "JtXqydogzbwQ48GWJT6yf/2g/FjTq/6"
    },
    {
        "title": "Cheesy Sausage Pasta",
        "ingredients": [
            "1 (16 ounce) package uncooked pasta shells ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 tablespoon finely minced onion ADVERTISEMENT",
            "1 orange bell pepper, thinly sliced ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 pound bulk Italian sausage ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water, and bring to a rolling boil over high heat. Stir in the shell pasta, and return to a boil. Cook, stirring occasionally, until cooked through but still firm to the bite, about 13 minutes. Drain well.\nWhile the pasta is cooking, heat the vegetable oil in a large skillet over medium-high heat. Cook onion, orange pepper, and garlic in oil until tender, about 5 minutes. Stir the crumbled Italian sausage into the vegetables in the skillet; cook and stir until meat is browned and cooked through, about 8 minutes. Stir in the undrained tomatoes and the heavy cream. Turn the heat to medium-low, and allow the sauce to cook until thick, about 5 additional minutes.\nMix pasta with the sausage cream sauce, stir in the Parmesan cheese, and serve. Garnish with chopped fresh parsley.\n",
        "picture_link": "lOph1Mxt4wTwbGJmM.LEgZ2rJKDQWU."
    },
    {
        "title": "Fried Ice Cream",
        "ingredients": [
            "1 quart vanilla ice cream ADVERTISEMENT",
            "3 cups crushed cornflakes cereal ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 quarts oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scoop ice cream into 8 - 1/2 cup sized balls. Place on baking sheet and freeze until firm, about 1 hour.\nIn a shallow dish, combine cornflakes and cinnamon. In another dish, beat egg whites until foamy. Roll ice cream balls in egg whites, then in cornflakes, covering ice cream completely. Repeat if necessary. Freeze again until firm, 3 hours.\nIn deep fryer or large, heavy saucepan, heat oil to 375 degrees F (190 degrees C).\nUsing a basket or slotted spoon, fry ice cream balls 1 or 2 at a time, for 10 to 15 seconds, until golden. Drain quickly on paper towels and serve immediately.\n",
        "picture_link": "CbGkvY3xxbwKxHSqFmSRhjzY7FKbx72"
    },
    {
        "title": "Better Than Pumpkin Pie",
        "ingredients": [
            "1 1/2 cups peeled and cubed butternut squash ADVERTISEMENT",
            "1 cup lightly packed brown sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground allspice ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "1 pinch ground ginger ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 (9 inch) unbaked pie shell ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place squash in a saucepan with enough water to cover. Bring to a boil, and simmer over medium heat until tender, about 15 minutes. Drain, and cool.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a blender or food processor, combine butternut squash, brown sugar, cornstarch, egg, milk, cinnamon, allspice, cloves, ginger, and nutmeg. Process until smooth. Pour into the unbaked pie shell.\nBake in preheated oven for 50 minutes, or until a table knife comes out clean when inserted in the center.\n",
        "picture_link": "CjaXD0Ot4em2/gxma3h0eRabznBxkRq"
    },
    {
        "title": "Apple Loaf",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup apples - peeled, cored and shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x5 inch loaf pan.\nMix together flour, baking powder, soda, salt and nuts.\nIn a large bowl, beat margarine, sugar and 1 egg until smooth. Beat in second egg, and stir in vanilla. Stir in shredded apples. Pour flour mixture into batter; stir just until moistened. Spread into prepared pan.\nBake for 50 to 60 minutes, or until an inserted toothpick comes out clean. Let stand 10 minutes, then remove from pan. Place on a rack to cool.\n",
        "picture_link": "5f/bLYxyplx0wkQBajCKcxGaW69WyAe"
    },
    {
        "title": "Cheesy Tuna Melts",
        "ingredients": [
            "1 (5 ounce) can tuna, drained ADVERTISEMENT",
            "1/3 cup chopped celery ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 English muffins, split and toasted ADVERTISEMENT",
            "8 slices ripe tomato ADVERTISEMENT",
            "8 slices Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to broil.\nIn a bowl, mix together tuna, celery, mayonnaise and salt. Spread tuna mixture onto the toasted muffin halves and place them on a baking sheet. Top each half with a slice of tomato and a slice of cheese.\nBroil until cheese is melted, about 3 to 5 minutes.\n",
        "picture_link": "wcEzZbWVLUNdS9jHjRi7.t10NtTaVbm"
    },
    {
        "title": "Pork Roast with Sauerkraut and Kielbasa",
        "ingredients": [
            "1 (2 pound) boneless pork loin roast ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 sprigs fresh thyme leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 pounds sauerkraut ADVERTISEMENT",
            "1 pound kielbasa, cut into 3-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler. Place the roast in a roasting pan, brush with olive oil, sprinkle with thyme leaves, and season with salt and pepper. Place under the broiler for 10 minutes, until lightly browned in several places.\nPlace 2 pounds sauerkraut in a slow cooker. Arrange kielbasa pieces around the edges of the slow cooker pot, and place the roast in the center. Cover with remaining sauerkraut.\nCover slow cooker, and cook roast 6 hours on High.\n",
        "picture_link": "PWJbxxF.CEL7p.r3ds2sLOX89tc4saq"
    },
    {
        "title": "Weeknight Chicken Cordon Bleu",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves - pounded to 1/4 inch thickness ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 slices cooked ham ADVERTISEMENT",
            "6 slices Swiss cheese ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (10.5 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace milk and bread crumbs in two separate shallow bowls. Season the chicken with salt and pepper. Place one slice of ham and one slice of cheese on each piece of chicken; roll, and secure with toothpicks. Dip each chicken roll into milk, and then into breadcrumbs.\nHeat oil in a large skillet over medium-high heat. Brown rolled chicken on all sides. Arrange the chicken in a 9x13 inch baking dish.\nIn a small saucepan over medium heat, blend soup and cream; season with salt and pepper to taste. Pour over the chicken.\nBake in the preheated oven for 15 minutes, or until chicken is no longer pink and juices run clear.\n",
        "picture_link": "NaKhKPf8tEZGiTJIb11nEc0Hzad3jjC"
    },
    {
        "title": "Rhubarb Stir Cake",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 1/3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "4 cups chopped rhubarb ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, cream together butter or margarine and brown sugar. Beat in egg and vanilla.\nSift or stir together flour, baking soda and salt; gradually stir in to butter mixture. Fold in sour cream and rhubarb. Spoon batter into greased 9 x 13 inch glass baking dish.\nStir together white sugar and nutmeg; sprinkle over batter.\nBake at 350 degrees F (175 degrees C) for 40 minutes, or until tester comes out clean.\n",
        "picture_link": "2d05Jv06xScaxeGZ.oLsrz0.nZ8mOYG"
    },
    {
        "title": "Quiche Supreme",
        "ingredients": [
            "2 (9 inch) deep dish frozen pie crusts ADVERTISEMENT",
            "1 tablespoon finely chopped green bell pepper ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 (4.5 ounce) can mushrooms, drained and chopped ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "8 ounces shredded Monterey Jack cheese ADVERTISEMENT",
            "8 ounces shredded Swiss cheese ADVERTISEMENT",
            "12 ounces cooked ham, chopped ADVERTISEMENT",
            "1/2 teaspoon vinegar ADVERTISEMENT",
            "1/8 teaspoon dried tarragon ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch dried parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C) and pre-bake crusts for 10 minutes. Set aside to cool on racks.\nIn a large skillet, saute green pepper, onion and mushrooms until onions are soft and translucent. Remove from heat and set aside.\nIn a large bowl, mix eggs and cream together. Stir in the shredded Jack and Swiss cheese, chopped ham and sauteed vegetables. Stir in vinegar and season with tarragon, garlic powder, nutmeg, parsley, salt and pepper. Divide filling into the 2 baked pie crusts.\nBake in the preheated oven for 55 to 60 minutes, or until filling is set and crusts are golden brown.\n",
        "picture_link": "lt0KhhVu7sq3oRU1UQaUv8.bxsIXDnC"
    },
    {
        "title": "Mustard Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 cup prepared mustard ADVERTISEMENT",
            "1 (6 ounce) can French-fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace mustard in a shallow dish or bowl; place onions in a second shallow dish or bowl. Dredge chicken in mustard to coat both sides, then dredge in onions. Place coated chicken in a lightly greased 9x13 inch baking dish.\nBake at 375 degrees F (190 degrees C) for 50 to 60 minutes or until chicken is cooked through and juices run clear.\n",
        "picture_link": "Hvs9gdZ.Fhb5INildDh0eELg/2ZMQj."
    },
    {
        "title": "Cranberry Orange Bread",
        "ingredients": [
            "2 cups flour ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup butter, cut into small chunks ADVERTISEMENT",
            "3/4 cup orange juice ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup chopped cranberries ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 8 1/2x4 1/2-inch loaf pan.\nCombine flour, sugar, baking powder, salt, and baking soda in a bowl. Stir butter into flour mixture until combined. Add orange juice, orange zest, and egg; mix well. Fold in cranberries and walnuts. Spoon batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 60 to 75 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "GUc4yQinEJD4rN239rayVBbw7/96VXq"
    },
    {
        "title": "Hearty Meatball Sandwich",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1/3 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "1/2 small onion, chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 tablespoon cracked black pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup marinara sauce ADVERTISEMENT",
            "3 hoagie rolls, split lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together the ground beef, bread crumbs, onion, salt and pepper, garlic powder, and half of the mozzarella cheese. Form the mixture into a log, and place it into an 8x8 inch baking dish.\nBake for 50 minutes in the preheated oven, or until the center is no longer pink. Let stand for 5 minutes, then slice into 1/2 inch slices. Place a few slices onto each hoagie roll, cover with marinara sauce, and sprinkle remaining mozzarella cheese over.\nWrap each sandwich with aluminum foil, and return to the oven for 15 minutes, until bread is lightly toasted and cheese is melted. Let stand 15 minutes before eating. Each sandwich serves 2.\n",
        "picture_link": "vN1iyR3EszMKeMN1CUg6.EMXzcLdVn6"
    },
    {
        "title": "Amy's Spicy Beans and Rice",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 cup uncooked brown rice ADVERTISEMENT",
            "2 (15 ounce) cans black beans, undrained ADVERTISEMENT",
            "2 fresh jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "1 teaspoon ground cumin, or to taste ADVERTISEMENT",
            "1 tablespoon chili powder, or to taste ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 fresh green onions, chopped ADVERTISEMENT",
            "1/2 (2 ounce) can sliced black olives, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a saucepan bring the water to a boil. Add rice and stir. Reduce heat, cover and simmer for 40 minutes.\nMeanwhile, pour beans into a 2 quart casserole. Sprinkle with jalapenos, cumin, chili powder and black pepper.\nBake in preheated oven for 30 minutes. Sprinkle with cheese, green onions and olives. Bake for 5 to 10 minutes more.\nServe beans over cooked rice.\n",
        "picture_link": "NdVBSa8Z.1cey/sHvXsJ7x3yjHCKqie"
    },
    {
        "title": "Jan's Chocolate Cake",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). If using layers, grease and line the pans with parchment paper. If using a 9 X 13 pan, grease and dust with cocoa powder. Sift together the cocoa, flour, baking soda and salt. Set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time. Alternately beat in the flour mixture and the buttermilk, mixing just until incorporated. Add the boiling water and beat for one full minute.\nBake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "9PjrBcmXcMKRb4YL9a9KpV8F9.lR4ae"
    },
    {
        "title": "Mock Chicken Fried Steak",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups crushed saltine crackers, divided ADVERTISEMENT",
            "1/2 cup oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the ground beef, parsley, chili powder, salt, egg, and 1 cup of crushed saltine crackers. Form into 6 balls, then flatten into patties. Coat patties with remaining cracker crumbs, and place them on a plate. Refrigerate for at least 30 minutes.\nHeat the oil in a large skillet over medium heat. Fry patties for about 7 minutes per side, or until the centers are well done and the outside is golden brown.\n",
        "picture_link": "B4u5i4ApZtIwbzF..AOCIT/0YKYdj6O"
    },
    {
        "title": "Fabulous Fruit Salad",
        "ingredients": [
            "1 red apple, cored and chopped ADVERTISEMENT",
            "1 Granny Smith apple, cored and chopped ADVERTISEMENT",
            "1 nectarine, pitted and sliced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 (8 ounce) container nonfat lemon yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine red apple, Granny Smith apple, nectarine, celery, dried cranberries, and walnuts. Mix in yogurt. Chill until ready to serve.\n",
        "picture_link": "6DnTlFqBMCQb9ESYUH7sZv5t2j7kh1e"
    },
    {
        "title": "Pasta Primavera with Smoked Gouda",
        "ingredients": [
            "1 (16 ounce) package whole wheat penne pasta ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 zucchinis, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "1 (8 ounce) package mushrooms, sliced ADVERTISEMENT",
            "3 onions, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes, coarsely chopped ADVERTISEMENT",
            "1 cup low-sodium chicken broth ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2/3 cup shredded smoked Gouda cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nHeat the olive oil in a skillet over medium heat. Stir in the zucchini, bell pepper, carrots, mushrooms, and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the garlic and cook for one minute more. Stir in the tomatoes, chicken broth, parsley, basil, oregano, and red pepper flakes. Bring to a boil, then reduce heat to low and simmer until sauce thickens. Stir in the pasta and cook until heated through, about 2 minutes. Top with Parmesan and Gouda cheeses before serving.\n",
        "picture_link": "d8vCTywY.cTCEAiIRosxi2GgsAIADB."
    },
    {
        "title": "Milly's Oatmeal Brownies ",
        "ingredients": [
            "1 cup butter at room temperature ADVERTISEMENT",
            "1 cup firmly packed light brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "chocolate chips (optional) ADVERTISEMENT",
            "raisins (optional) ADVERTISEMENT",
            "chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan.\nIn a large bowl, beat the butter, brown sugar, and white sugar until thoroughly mixed and creamy. Beat in the eggs, one at a time, mixing well after each addition. Stir in the vanilla extract until well mixed, and mix in salt, baking soda, baking powder, flour, rolled oats, plus chocolate chips, raisins, and chopped nuts if desired. Mix well to moisten all ingredients, and spread into the prepared baking pan.\nBake in the preheated oven until golden brown, 20 to 25 minutes. Let cool in the pan for about 5 minutes before cutting into bars.\n",
        "picture_link": "giw87.C990jAEOQw2ItCvwYOutGq0ia"
    },
    {
        "title": "Hawaiian Chicken I",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 cups teriyaki sauce, divided ADVERTISEMENT",
            "6 pineapple rings ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup soy sauce ADVERTISEMENT",
            "3/4 cup unsweetened pineapple juice ADVERTISEMENT",
            "6 tablespoons Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken breast halves in a dish with the 1 1/2 cups of teriyaki sauce. Cover and refrigerate 8 hours or overnight.\nPreheat a grill for high heat.\nLightly oil the grill grate. Place chicken breasts on grill, and discard marinade. Cook for 8 minutes per side, or until juices run clear. Brush with the remaining teriyaki sauce during the last 5 minutes. When almost done, place one pineapple ring on top of each breast, and brush with melted butter.\nIn a small saucepan over medium heat, mix the brown sugar, soy sauce, pineapple juice, and Worcestershire sauce. Cook, stirring occasionally, until sugar is dissolved. Serve with chicken for dipping!\n",
        "picture_link": "j.xc2MyW0MeuQbokCBiPMNFhjGuTEqi"
    },
    {
        "title": "Whole Wheat Pumpkin-Applesauce Muffins",
        "ingredients": [
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "2/3 cup brown sugar, firmly packed ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "1/2 cup canned pumpkin ADVERTISEMENT",
            "1/3 cup buttermilk ADVERTISEMENT",
            "2 eggs, slightly beaten ADVERTISEMENT",
            "1/4 cup golden raisins (optional) ADVERTISEMENT",
            "1/4 cup chopped pecans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Grease 12 muffin cups, or line the cups with paper muffin liners.\nWhisk together the flour, baking powder, baking soda, salt, and pumpkin pie spice; set aside. Combine the brown sugar, white sugar, oil, applesauce, pumpkin, buttermilk, and beaten eggs and mix until well blended. Pour the pumpkin mixture into the dry ingredients and stir until combined. Fold in the raisins and pecans, if desired.\nDivide the batter evenly in the prepared muffin pan. Bake in the preheated oven until the tops spring back when lightly pressed, 15 to 20 minutes, or until a toothpick inserted in the center comes out clean. Cool the muffin pan on a wire rack for 5 minutes before removing the muffins from the pan.\n",
        "picture_link": "sEX4vu5PDjbrTPXzzKAYRcdC8.2.Xmq"
    },
    {
        "title": "Kim's Macaroni Salad",
        "ingredients": [
            "1 (8 ounce) package uncooked elbow macaroni ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon white pepper ADVERTISEMENT",
            "1/4 cup green onions, sliced ADVERTISEMENT",
            "2 jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add macaroni, and cook until tender, about 8 minutes. Drain, and rinse under cold running water.\nIn a large bowl, mix together the mayonnaise, vinegar, sugar, salt, pepper, green onions and jalapeno peppers. Stir in the macaroni. Refrigerate until chilled before serving, at least 30 minutes.\n",
        "picture_link": "tH.1ds9ytEhi0Z3jd/fsxSChyjHNOXG"
    },
    {
        "title": "Mom's Sushi Rice",
        "ingredients": [
            "2 1/4 cups Japanese sushi-style rice ADVERTISEMENT",
            "1 (4 inch) piece konbu dried kelp (optional) ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rice into a large, deep bowl. Fill with cold water and rub rice together with hands until the water turns milky white. Pour off the cloudy water, being careful not to pour out the rice. Repeat 3 or 4 times until you can see the rice through 3-inches of water.\nDrain the rice in a fine strainer, then place into a saucepan along with konbu and water. Allow to stand for 30 minutes. Stir together rice vinegar, sugar, and salt until dissolved in a small bowl, set aside.\nCover, and bring rice to a boil over high heat, then reduce heat to low, and simmer for 15 minutes. Remove from heat and allow to stand for 5 minutes.\nScrape rice into a bowl; remove and discard the konbu. Stir in vinegar mixture until well incorporated and no lumps of rice remain. Allow to cool at room temperature. For a shinier appearance, use an electric fan to cool the rice rapidly.\n",
        "picture_link": "3qeubW/xzOKr62DyIeLzKU5rzvzML1q"
    },
    {
        "title": "Turkey Carcass Soup",
        "ingredients": [
            "1 turkey carcass ADVERTISEMENT",
            "4 quarts water ADVERTISEMENT",
            "6 small potatoes, diced ADVERTISEMENT",
            "4 large carrots, diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 1/2 cups shredded cabbage ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, chopped ADVERTISEMENT",
            "1/2 cup uncooked barley ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/4 teaspoon freshly cracked black pepper ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon poultry seasoning ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the turkey carcass into a large soup pot or stock pot and pour in the water; bring to a boil, reduce heat to a simmer, and cook the turkey frame until the remaining meat falls off the bones, about 1 hour. Remove the turkey carcass and remove and chop any remaining turkey meat. Chop the meat.\nStrain the broth through a fine mesh strainer into a clean soup pot. Add the chopped turkey to the strained broth; bring the to a boil, reduce heat, and stir in the potatoes, carrots, celery, onion, cabbage, tomatoes, barley, Worcestershire sauce, salt, parsley, basil, bay leaf, black pepper, paprika, poultry seasoning, and thyme. Simmer until the vegetables are tender, about 1 more hour. Remove bay leaf before serving.\n",
        "picture_link": "CuYwtoZ8.zScq8x5bj2mco17aKbTqsy"
    },
    {
        "title": "Bacon-y Bok Choy",
        "ingredients": [
            "4 slices bacon, chopped ADVERTISEMENT",
            "2 pounds baby bok choy ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1/2 small red onion, chopped ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fry bacon in a large skillet over medium heat until crispy. Remove bacon and drain the fat, reserving one tablespoon of the grease in the skillet. Add the olive oil, onion, red pepper flakes and garlic. Cook and stir over medium heat until the onions are starting to be tender.\nAdd the bok choy, and place a lid on the pan. Let cook for 3 to 5 minutes. Remove the lid; cook and stir until the bok choy is tender but still crunchy, about 2 minutes. Stir in the bacon, and season with salt. Serve piping hot!\n",
        "picture_link": "Uf7KcseusDepVqNYHyXiIJhPHVZIfHq"
    },
    {
        "title": "Rosemary Pork Roast",
        "ingredients": [
            "3 pounds pork tenderloin ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons dried rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nRub the roast OR tenderloin liberally with olive oil, then spread the garlic over it. Place it in a 10x15 inch roasting pan and sprinkle with the rosemary.\nBake at 375 degrees F (190 degrees C) for 2 hours, or until the internal temperature of the pork reaches 145 degrees F (63 degrees C).\n",
        "picture_link": "2TLr6mthWaEqwmZGCbgJrZMbGSQ1GBe"
    },
    {
        "title": "Spicy Spaghetti Squash",
        "ingredients": [
            "1 small spaghetti squash, halved and seeded ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 green onions, minced ADVERTISEMENT",
            "12 ounces ground white meat turkey ADVERTISEMENT",
            "2 cups crushed tomatoes ADVERTISEMENT",
            "2 tablespoons red wine ADVERTISEMENT",
            "2 teaspoons capers ADVERTISEMENT",
            "2 teaspoons minced fresh oregano ADVERTISEMENT",
            "2 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace each squash half cut side down on a cookie sheet and bake uncovered for about 45 to 60 minutes or until a fork goes easily into the shell. Allow to cool and scoop out the strands of squash with a large spoon and set aside.\nHeat the oil in a skillet over medium high heat. Add the onion, garlic and scallions and saute for 2 minutes. Add the turkey and cook for 4 minutes. Add the tomatoes and wine and bring to a boil, lower the heat and simmer for 20 minutes.\nAdd the capers, oregano, red pepper flakes and parsley; simmer for 5 minutes. If the squash has cooled too much, reheat it in the microwave, covered for 2 to 3 minutes. Top the squash with the sauce and serve.\n",
        "picture_link": "CletER7v7ELsiGOZrP1x2u6gWVpareO"
    },
    {
        "title": "Orange Rosemary Chicken",
        "ingredients": [
            "1 1/2 cups orange juice ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "3 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (2.5 pound) whole chicken, cut into 8 pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix the orange juice, olive oil, chives, rosemary, salt, and pepper. Place the chicken in the mixture. Cover and marinate in the refrigerator at least 4 hours.\nPreheat the oven broiler.\nRemove the chicken from the marinade, and shake off excess. Pour the marinade into a small saucepan and bring to a boil over high heat. Reduce heat to medium-low, and simmer for 10 minutes; set aside.\nArrange the chicken on a baking sheet. Broil 30 minutes in the preheated oven, 6 to 8 inches from heat. Turn and brush frequently with the remaining marinade mixture, until no longer pink and juices run clear.\n",
        "picture_link": "S0XSPGyxhc6hbc5o9cJ3GW4QG6jXtoC"
    },
    {
        "title": "Tasty Lentil Tacos",
        "ingredients": [
            "1 teaspoon canola oil ADVERTISEMENT",
            "2/3 cup finely chopped onion ADVERTISEMENT",
            "1 small clove garlic, minced ADVERTISEMENT",
            "2/3 cup dried lentils, rinsed ADVERTISEMENT",
            "1 tablespoon taco seasoning, or to taste ADVERTISEMENT",
            "1 2/3 cups chicken broth ADVERTISEMENT",
            "2/3 cup salsa ADVERTISEMENT",
            "12 taco shells ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat; cook and stir onion and garlic until tender, about 5 minutes. Mix lentils and taco seasoning into onion mixture; cook and stir for 1 minute.\nPour chicken broth into skillet and bring to a boil. Reduce heat to low, cover the skillet, and simmer until lentils are tender, 25 to 30 minutes.\nUncover the skillet and cook until mixture is slightly thickened, 6 to 8 minutes. Mash lentils slightly; stir in salsa.\nServe about 1/4 cup lentil mixture in each taco shell.\n",
        "picture_link": "IRdWjs7gI3w.UyPtqG.7ayHvWTjIEyG"
    },
    {
        "title": "Spaghetti Pizza I",
        "ingredients": [
            "1 (8 ounce) package spaghetti, broken into 2-inch pieces ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "1 (16 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "4 ounces pepperoni sausage, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain and rinse with cold water.\nCombine egg, milk, 1/2 cup of the mozzarella cheese, salt, and garlic salt in a large bowl. Stir in cooked spaghetti; mix well.\nSpread mixture into prepared baking dish. Bake in preheated oven for 15 minutes. Remove from oven and reduce temperature to 350 degrees F (175 degrees C).\nSpread sauce over spaghetti. Sprinkle with oregano, basil, and the remaining 1 1/2 cups mozzarella. Top with pepperoni, return to oven, and bake until cheese is bubbly and beginning to brown, about 30 minutes more. Let stand 5 minutes before cutting.\n",
        "picture_link": "Bh21KCgmD7KljUVY7KonWMuVgXKxugO"
    },
    {
        "title": "Alfredo Blue",
        "ingredients": [
            "1 (16 ounce) package fettuccini pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, sliced ADVERTISEMENT",
            "4 ounces blue cheese, crumbled ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water for 8 to 10 minutes, or until al dente; drain.\nHeat olive oil in a small skillet over medium heat. Saute garlic in olive oil until golden. Remove garlic, and reserve oil.\nIn a medium saucepan over medium-low heat, combine blue cheese, Parmesan cheese, and cream. Stir until cheeses are melted. Stir in the oil from the garlic pan. Season with Italian seasoning, salt, and pepper.\nToss sauce with hot pasta, and let stand 5 minutes before serving.\n",
        "picture_link": "mnEK7iT31KIWulV52xSh/dYyj4wZCPK"
    },
    {
        "title": "Russian Black Bread",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 1/2 cups bread flour ADVERTISEMENT",
            "1 cup rye flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "2 tablespoons dark corn syrup ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon instant coffee granules ADVERTISEMENT",
            "1 tablespoon caraway seed ADVERTISEMENT",
            "1/4 teaspoon fennel seed (optional) ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients into the bread machine in order suggested by the manufacturer.\nUse the whole wheat, regular crust setting.\nAfter the baking cycle ends, remove bread from pan, place on a cake rack, and allow to cool for 1 hour before slicing.\n",
        "picture_link": "P9DBQfl3oPNyqaERNJjCVkjvahrw99y"
    },
    {
        "title": "Blueberry Bread I",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together beaten eggs with the sugar. Add milk and melted shortening or vegetable oil.\nSift together flour, salt, and baking powder. Combine mixtures, stirring only until blended. Carefully fold in fresh or frozen blueberries and broken walnut pieces.\nPour into greased 5 x 12 inch loaf pan. Bake at 350 degrees F (175 degrees C) for 50-60 minutes. Cool in pan but try to turn it out of pan before it is totally cool. It will be easier to remove. Can also be made in a normal size loaf pan or can be made into 2 pans.\n",
        "picture_link": "soeTN2Dv5ihWP7dGCsihJIiBUjT713O"
    },
    {
        "title": "Red Velvet Cake III",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 ounce red food coloring ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 cup cold milk ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9 x 13 inch pan.\nMix together cake mix, 1 box pudding mix, eggs, oil, food coloring, water, vinegar, and cocoa. Pour into prepared pan.\nBake at 350 degrees F (175 degrees C) for 35 to 40 minutes. Cool.\nBeat together milk and cream cheese. Mix in 1 box pudding mix. Fold in whipped topping. Spread on cooled cake. Refrigerate.\n",
        "picture_link": "9g9oD8Lk5u5d/gxaODAGwb3AEtRrF4C"
    },
    {
        "title": "White Chocolate Snack Mix",
        "ingredients": [
            "1 (10 ounce) package mini twist pretzels ADVERTISEMENT",
            "5 cups toasted oat cereal ADVERTISEMENT",
            "5 cups crispy corn cereal squares ADVERTISEMENT",
            "2 cups salted peanuts ADVERTISEMENT",
            "1 (14 ounce) package candy-coated milk chocolate pieces ADVERTISEMENT",
            "2 (11 ounce) packages white chocolate chips ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line 3 baking sheets with waxed paper or parchment. Set aside.\nIn a large bowl, combine mini pretzels, toasted oat cereal, crispy corn cereal squares, salted peanuts, and candy-coated chocolate pieces. Set aside.\nIn a microwave-safe bowl, heat chips and oil on medium-high for 2 minutes, stirring once. Microwave on high for 10 seconds; stir until smooth. Pour over cereal mixture and mix well.\nSpread onto prepared baking sheets. Cool; break apart. Store in an airtight container.\n",
        "picture_link": "3lMn0zgpLvPGm5xU6SUmRbcmeu8QIL."
    },
    {
        "title": "Aztec Casserole",
        "ingredients": [
            "9 (6 inch) corn tortillas, cut in half ADVERTISEMENT",
            "2 (10 ounce) cans enchilada sauce ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 (4 ounce) cans diced green chiles ADVERTISEMENT",
            "1 cup fresh corn kernels ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - boiled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, combine sour cream, cheese, chile peppers, corn, and chicken. Mix together well.\nDip 9 tortilla halves in enchilada sauce, and arrange them in the bottom of a lightly greased 9x13 inch baking dish. Spread 1/2 chicken mixture over the tortilla layer. Repeat.\nBake in the preheated oven for 25 to 30 minutes, or until center is heated through.\n",
        "picture_link": "vQiEmE2XbTxSSCtb/z5kSDN53sS0GhS"
    },
    {
        "title": "Eggplant with Garlic Sauce",
        "ingredients": [
            "3 tablespoons canola oil ADVERTISEMENT",
            "4 Chinese eggplants, halved lengthwise and cut into 1 inch half moons ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "3 tablespoons garlic powder ADVERTISEMENT",
            "5 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "2 tablespoons light soy sauce ADVERTISEMENT",
            "2 tablespoons oyster sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the canola oil in a skillet over high heat. Cook and stir the eggplant until soft, about 4 minutes. Stir in the water, red pepper flakes, and garlic powder. Cover and simmer until all the water is absorbed. Meanwhile, mix sugar, cornstarch, soy sauce, and oyster sauce in a bowl until sugar and cornstarch have dissolved. Stir sauce into the eggplant, making sure to evenly coat the eggplant. Cook until the sauce has thickened.\n",
        "picture_link": "nGKHXCmPHC.aApTP.qQmxC9MXp4Uk.y"
    },
    {
        "title": "Southern Baked Yellow Squash",
        "ingredients": [
            "3 pounds yellow summer squash, cut into 1-inch cubes ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease a 2-quart baking dish.\nPlace the squash in a large saucepan, cover with water, and boil until soft, about 15 minutes. Drain the squash well, place in a large mixing bowl, and mash until slightly chunky. Stir in 1/2 cup of bread crumbs, onion, eggs, 1/4 cup of butter, sugar, salt, and pepper until thoroughly combined, and spread mixture into the prepared baking dish. Drizzle the top of the casserole with 1/4 cup melted butter, and sprinkle 1/4 cup bread crumbs over the butter.\nBake in the preheated oven until the casserole is cooked through and the top is golden brown, about 1 hour.\n",
        "picture_link": "szqH.WBWTJ2BTWJ1Z49iN80FwZzpgYG"
    },
    {
        "title": "Beef Bourguignon I",
        "ingredients": [
            "3 cups Burgundy wine ADVERTISEMENT",
            "2 tablespoons brandy ADVERTISEMENT",
            "2 onions, thinly sliced ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 sprig fresh parsley ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "10 whole black peppercorns ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 pounds cubed beef chuck roast ADVERTISEMENT",
            "4 tablespoons olive oil, divided ADVERTISEMENT",
            "1/4 pound bacon, cubed ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1 pound fresh mushrooms, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For marinade: In a large bowl, combine the wine, cognac, onions, carrots, parsley, bay leaf, garlic, peppercorns and salt. Mix well and add the cubed beef. Cover and marinate in the refrigerator for 2 days.\nPreheat oven to 300 degrees F (150 degrees C).\nFor Bourguignon: Strain the meat from the vegetables and marinade; reserve marinade. Dry meat with paper towels. Heat 2 tablespoons of the oil in a large skillet over medium high heat. Add the meat and saute for 10 minutes, or until browned on all sides. Transfer meat to a separate medium bowl with a slotted spoon and set aside.\nIn the same skillet, add the bacon and saute until lightly browned. Transfer the bacon to the bowl with the meat. Drain the skillet and return it to the heat. Pour a cup of marinade into the skillet to deglaze the skillet, scraping the bottom to loosen up all the little bits. Return this liquid to the reserved marinade.\nHeat the remaining oil in the skillet. Add the onion and carrot from the marinade, along with the additional onion that you've chopped, and saute for 5 minutes, or until tender. Transfer this mixture to the bowl with the meat and bacon, again using a slotted spoon, and return skillet to the heat. Add the flour to the skillet, combining with the oil and stir until well mixed and brown, about 2 minutes.\nNow add the tomato paste, garlic, beef broth, reserved marinade and salt and pepper to taste. Bring to a boil and whisk to remove any flour lumps. Add this to the meat and vegetable mixture. Place entire mixture into a 9x13 baking dish.\nBake at 300 degrees F (150 degrees C) for 3 hours, stirring occasionally and adding water as needed. Season with salt and pepper to taste.\nAbout 15 minutes before meat is done baking, melt butter in the skillet over medium high heat. Add the mushrooms and saute for 5 to 10 minutes, or until lightly browned. When meat is done, add the mushrooms to the meat mixture, stir well and let sit for about 15 minutes.\n",
        "picture_link": "mw5oQ4TMAqJMf3WYnmj727ZAgIxdddW"
    },
    {
        "title": "Rosemary Mashed Potatoes and Yams",
        "ingredients": [
            "8 cloves garlic ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 pounds baking potatoes, peeled and cubed ADVERTISEMENT",
            "1 1/2 pounds yams, peeled and cubed ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease an 8 inch square baking dish.\nPlace garlic in small ovenproof bowl, and drizzle with olive oil. Roast for 30 minutes, or until very soft. Cool and peel the garlic, and reserve the oil.\nBoil potatoes and yams in a large pot of salted water until tender, about 20 minutes. Drain, reserving 1 cup liquid.\nPlace potatoes and yams in a large bowl with milk, butter, rosemary, garlic, and reserved olive oil. Mash to desired consistency, adding reserved cooking liquid as needed. Mix in 1/4 cup cheese. Season with salt and pepper to taste. Transfer to the prepared baking dish. Sprinkle with remaining cheese.\nBake until heated through and golden on top, about 45 minutes.\n",
        "picture_link": "Ew.HEpBIM0YiobLe0C/8j7qvUXcx4XS"
    },
    {
        "title": "Play Dough Cookies",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "3 ounces cream cheese ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "assorted colors of paste food coloring ADVERTISEMENT",
            "24 lollipop sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl cream butter, cream cheese and sugar until fluffy. Add egg and vanilla; beat until smooth.\nIn a medium bowl combine flour, baking powder and salt. Add dry ingredients to the creamed mixture. Stir till soft dough forms. Divide dough into fourths. Tint each with a different food color. Wrap in plastic wrap and chill for 2 hours.\nPreheat oven to 350 degrees F (175 degrees C). Working with half of each color, shape dough into 3/4 inch balls and for each cookie place 1 pink, 1 green, 1 blue and 1 orange ball together to make 1 large ball. Shape into a 12 inch long roll (like a snake), starting at one end, coil roll to make a 2 3/4 inch round cookie. Place cookies 3 inches apart on lightly greased baking sheet. Carefully insert lollipop sticks into bottoms of cookies.\nBake cookies for 8 minutes or until lightly browned. Cool and store in an airtight container.\n",
        "picture_link": "MGmvjlUbc2lh18SLJoaa4c2GEG1i6W2"
    },
    {
        "title": "Cajun Potato Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 pounds andouille sausage, sliced into rounds ADVERTISEMENT",
            "6 russet potatoes, peeled and cut into bite-sized pieces ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 3/4 cups heavy cream ADVERTISEMENT",
            "2 teaspoons Italian seasoning ADVERTISEMENT",
            "1 bunch fresh spinach, chopped ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the butter and oil together in a large stock pot over medium heat. Cook the onion and garlic in the butter and oil until the onions are translucent, about 5 minutes. Add the sausage slices; cook and stir another 5 minutes. Stir in the potatoes; cook and stir 15 minutes. Pour in the chicken broth, milk, heavy cream, and Italian seasoning. Bring to a simmer and cook 10 to 12 minutes until the potatoes are tender. Mix in the spinach. Remove from heat. Top with Parmesan cheese.\n",
        "picture_link": "cK1n/5ofUG8LVY6MpKdk..QK9aU9W16"
    },
    {
        "title": "Coffee Butter Frosting",
        "ingredients": [
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1/3 cup butter or margarine, softened ADVERTISEMENT",
            "1 tablespoon strong brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the confectioners sugar and cocoa powder. In another bowl, beat the butter until creamy, gradually beat in the sugar mixture, being sure to scrape the bottom of the bowl, occasionally. Finally stir in the coffee, and beat until smooth.\n",
        "picture_link": "S3TXKEGhTh0l5ljoDNzr5/1heNS8kF2"
    },
    {
        "title": "California Sherry Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup cooking sherry ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 lemon ADVERTISEMENT",
            "4 carrots ADVERTISEMENT",
            "4 zucchini squashes, julienned ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in a resealable plastic bag with flour, salt, and pepper. Seal bag and shake to coat. Remove chicken from bag, shaking off excess flour.\nHeat oil in a large skillet over medium high heat. Brown chicken on each side for about 5 minutes, or until golden. Remove from skillet and set aside.\nIn same skillet combine sherry, broth, garlic and a squeeze of lemon and bring to a boil. Return chicken to skillet, reduce heat to low and simmer for 15 to 20 minutes, or until chicken is cooked through and no longer pink inside.\nIn the meantime, saute carrots and zucchini in a separate medium skillet until they are tender. Add to simmering chicken and sauce and heat through before serving.\n",
        "picture_link": "Jtk3NFOdBTNnS5jWuEnglokan85Xz3a"
    },
    {
        "title": "Rolled Fondant",
        "ingredients": [
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1/2 cup glucose syrup ADVERTISEMENT",
            "1 tablespoon glycerin ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "8 cups sifted confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gelatin and cold water; let stand until thick. Place gelatin mixture in top of double boiler and heat until dissolved.\nAdd glucose and glycerin, mix well. Stir in shortening and just before completely melted, remove from heat and stir in vanilla. Mixture should cool until lukewarm.\nPlace 4 cups confectioners' sugar in a large bowl. Make a well in the center and using a wooden spoon, stir in the lukewarm gelatin mixture. Mix in sugar and add more a little at a time, until stickiness disappears. Knead in remaining sugar. Knead until the fondant is smooth, pliable and does not stick to your hands. If fondant is too soft, add more sugar; if too stiff, add water (a drop at a time). Use fondant immediately or store in airtight container in fridge. When ready to use, bring to room temperature and knead again until soft.\n",
        "picture_link": "04CI8QNjEBH6/zcwgFLnywhOj0Kfxu6"
    },
    {
        "title": "Chocolate Cheesecake II",
        "ingredients": [
            "1 1/2 cups chocolate cookie crumbs ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/4 cup semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F ( 175 degrees C). Lightly grease a 9 inch springform pan.\nIn a small bowl, mix together 1 1/2 cups chocolate wafer crumbs, 2 tablespoons sugar, and melted butter. Press onto the bottom and 1 1/2 inch up the sides of the prepared 9 inch springform pan. Bake at 350 degrees F (175 degrees C) for 10 minutes. Allow to cool. Reduce oven temperature to 325 degrees F (165 degrees C).\nTo Make Filling: In a small saucepan, heat 1/4 cup whipping cream and 1/4 cup chocolate chips, stirring constantly, until chips are melted. Remove from heat.\nIn a large mixing bowl, beat cream cheese and 1 cup of sugar until smooth. Add cocoa and beat well. Add eggs and beat on low until just blended. Stir in 1 teaspoon vanilla and reserved chocolate mixture until blended. Pour over crust. Bake at 325 degrees F (165 degrees C) for 45 to 50 minutes or until center is almost set.\nTo Make Topping: In a small saucepan, heat 1/4 cup whipping cream and 1 teaspoon vanilla until just before boiling. Stir constantly and be careful not to boil over. Have 1 1/2 cups chocolate chips ready in a small bowl. Pour in the hot cream and stir with a spoon until smooth. Spread over baked cheesecake and refrigerate overnight.\n",
        "picture_link": "usMRT22ilgZReIc53brP3FPPkCwYIru"
    },
    {
        "title": "Creamy Strawberry Crepes",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 1/4 cups sifted confectioners' sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup heavy cream, whipped ADVERTISEMENT",
            "4 cups sliced strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs, milk, water, melted butter, flour, and salt in the pitcher of a blender; blend until smooth.\nBlend the cream cheese, confectioners' sugar, lemon juice, lemon zest, and vanilla with an electric mixer until smooth. Gently fold in the whipped cream.\nHeat a lightly oiled griddle or non-stick skillet over medium heat. Pour or scoop the batter onto the griddle, using approximately 2 tablespoons for each crepe. Tip and rotate pan to spread batter as thinly as possible. Flip over when the batter is set and the edges are beginning to brown. Cook until the other side begins to brown. Stack finished crepes on a plate, cover with a damp towel and set aside.\nTo serve, fill each crepe with 1/4 cup sliced strawberries and 1/3 cup of the cream cheese filling, roll up and top with a small dollop of the cream cheese filling and more sliced strawberries.\n",
        "picture_link": "X1IXx5yk4sVWCj85MDuXfzrywiQojLW"
    },
    {
        "title": "Simple Macaroni and Cheese",
        "ingredients": [
            "1 (8 ounce) box elbow macaroni ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nMelt butter in a saucepan over medium heat; stir in flour, salt, and pepper until smooth, about 5 minutes. Slowly pour milk into butter-flour mixture while continuously stirring until mixture is smooth and bubbling, about 5 minutes. Add Cheddar cheese to milk mixture and stir until cheese is melted, 2 to 4 minutes.\nFold macaroni into cheese sauce until coated.\n",
        "picture_link": "b3V5YsfXqiq1qqFNnumIDEzd7o8AYRS"
    },
    {
        "title": "Grilled Salmon Kyoto",
        "ingredients": [
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/4 cup orange juice concentrate ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons tomato sauce ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon prepared mustard ADVERTISEMENT",
            "1 tablespoon green onion, minced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon minced fresh ginger root ADVERTISEMENT",
            "4 salmon steaks (1 inch thick) ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow glass baking dish, combine soy sauce, orange juice concentrate, oil, tomato sauce, lemon juice, mustard, green onion, garlic, and ginger. Place salmon in marinade, and turn to coat. Cover, and refrigerate for 30 minutes to 1 hour.\nPreheat an outdoor grill for high heat.\nRemove salmon from marinade. Pour marinade into a small saucepan. Bring to a boil, and cook for 1 minute.\nLightly oil the grill grate. Brush or spray salmon with olive oil. Cook on grill for 5 to 10 minutes, or until fish flakes easily with a fork. Turn salmon once, and brush with boiled marinade halfway through cooking time.\n",
        "picture_link": "lOe/08VMD9N7enk0VN1Qxx/X8v7qq0y"
    },
    {
        "title": "Mid-Summer Italian Bread Salad",
        "ingredients": [
            "1 clove garlic ADVERTISEMENT",
            "1 (1 pound) loaf Italian bread ADVERTISEMENT",
            "1 cup chopped tomatoes ADVERTISEMENT",
            "1 cup cucumber - peeled, seeded and chopped ADVERTISEMENT",
            "1 cup chopped red onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 cups chopped fresh basil ADVERTISEMENT",
            "1/8 cup chopped fresh thyme ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub a peeled clove of garlic around a wooden salad bowl.\nPull apart or chop the bread into bite-size pieces.\nIn the prepared salad bowl, combine the bread, tomatoes, cucumbers, red onions, garlic, basil and thyme. Add enough olive oil and vinegar to lightly coat, toss and serve.\n",
        "picture_link": "7V2Dc/9ws5YtKaWiX0q74sp9TNaDpyO"
    },
    {
        "title": "Garlic Kale",
        "ingredients": [
            "1 bunch kale ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Tear the kale leaves into bite-size pieces from the thick stems; discard the stems.\nHeat the olive oil in a large pot over medium heat. Cook and stir the garlic in the hot oil until softened, about 2 minutes. Add the kale and continue cooking and stirring until the kale is bright green and wilted, about 5 minutes more.\n",
        "picture_link": "SNj6OQCHVc3SEKUeWnBKpRm0m0qEIoK"
    },
    {
        "title": "Chef John's Mushroom Gravy",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 (16 ounce) package sliced mushrooms ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup all-purpose flour, or as needed ADVERTISEMENT",
            "1 quart beef stock ADVERTISEMENT",
            "1 pinch ground black pepper to taste ADVERTISEMENT",
            "fresh thyme leaves, to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter over medium heat in a saucepan until it foams. Stir in mushrooms. Season with salt. Simmer until liquid evaporates, about 20 minutes.\nStir in the flour, cooking and stirring for about 5 minutes. Add about 1 cup of beef stock, stirring briskly until incorporated, then pour in the remaining stock and mix thoroughly. Season with black pepper and thyme. Reduce heat to medium-low, and simmer until thickened, about 30 minutes, stirring often.\n",
        "picture_link": "2ZiEDBo40rbk/T6/1GLXoqRwTk8X.e6"
    },
    {
        "title": "Hot Spiced Cranberry Cider",
        "ingredients": [
            "2 quarts apple cider ADVERTISEMENT",
            "6 cups cranberry juice ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "4 cinnamon sticks ADVERTISEMENT",
            "1 1/2 teaspoons whole cloves ADVERTISEMENT",
            "1 lemon, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, combine apple cider, cranberry juice, brown sugar, cinnamon sticks, cloves and lemon slices. Bring to a boil, reduce heat, and simmer for 15 to 20 minutes. With a slotted spoon, remove cinnamon, cloves, and lemon slices. Serve hot.\n",
        "picture_link": "EekNp4aMywXlwTwbPkw7PM7jzcLzdeq"
    },
    {
        "title": "Lemon Thyme Rice",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 tablespoon fresh thyme leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a medium saucepan over medium-high heat, and stir in the rice. Cook rice, stirring frequently, until browned, about 5 minutes.\nMix chicken broth, lemon juice and thyme into the rice. Cover, and reduce heat to low. Cook 20 minutes, until liquid has been absorbed. Fluff with a fork before serving.\n",
        "picture_link": "vbXUDLSVa8VL8Yib5bGw6bjjqhwXNfO"
    },
    {
        "title": "Mom's Best Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup quick-cooking oats ADVERTISEMENT",
            "1/8 cup cornmeal ADVERTISEMENT",
            "1 cup dried bread crumbs ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup tomato juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon barbecue sauce ADVERTISEMENT",
            "1 dash liquid smoke flavoring ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 teaspoons prepared mustard ADVERTISEMENT",
            "2 dashes liquid smoke flavoring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the beef, onion, oatmeal, cornmeal, bread crumbs, salt, sugar, egg, tomato juice, water, barbecue sauce, 1/8 teaspoon liquid smoke and vinegar. Mix together thoroughly and place mixture into a lightly greased 9x5 inch loaf pan.\nIn a separate small bowl, combine the ketchup, brown sugar, mustard and 2 drops liquid smoke and mix thoroughly. Spread over the top of the meatloaf.\nBake at 350 degrees F (175 degrees C) for approximately one hour.\n",
        "picture_link": "JRfm7koNi6lUTJe738K36Yb2ZGAJeEa"
    },
    {
        "title": "Turkey in a Smoker",
        "ingredients": [
            "1 (10 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "2 tablespoons seasoned salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 (12 fluid ounce) cans cola-flavored carbonated beverage ADVERTISEMENT",
            "1 apple, quartered ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat smoker to 225 to 250 degrees F (110 to 120 degrees C).\nRinse turkey under cold water, and pat dry. Rub the crushed garlic over the outside of the bird, and sprinkle with seasoned salt. Place in a disposable roasting pan. Fill turkey cavity with butter, cola, apple, onion, garlic powder, salt, and ground black pepper. Cover loosely with foil.\nSmoke at 225 to 250 degrees F (110 to 120 degrees C) for 10 hours, or until internal temperature reaches 180 degrees F (80 degrees C) when measured in the thickest part of the thigh. Baste the bird every 1 to 2 hours with the juices from the bottom of the roasting pan.\n",
        "picture_link": "EsR6DmEVIrgJEJiKal9tEoBx7Fmo/6K"
    },
    {
        "title": "Smooth and Creamy Peanut Butter Pie",
        "ingredients": [
            "3/4 cup creamy peanut butter ADVERTISEMENT",
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (9 inch) prepared chocolate cookie crumb crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together peanut butter, cream cheese and sugar. Then stir whipped topping into peanut butter mixture. Whisk until smooth and no lumps remain.\nPour filling into pie crust and refrigerate for about 3 hours until pie is firm.\n",
        "picture_link": "onFOTv6ZWucImYOP0VO18MdFn/QL/b6"
    },
    {
        "title": "Panang Curry with Chicken",
        "ingredients": [
            "5 tablespoons Panang curry paste ADVERTISEMENT",
            "cooking oil ADVERTISEMENT",
            "4 cups coconut milk ADVERTISEMENT",
            "2/3 pound skinless, boneless chicken breast, cubed ADVERTISEMENT",
            "2 tablespoons palm sugar ADVERTISEMENT",
            "2 tablespoons fish sauce, or to taste ADVERTISEMENT",
            "6 kaffir lime leaves, torn ADVERTISEMENT",
            "2 fresh red chile peppers, sliced ADVERTISEMENT",
            "1/4 cup fresh Thai basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fry the curry paste in the oil in a large skillet or wok over medium heat until fragrant. Stir the coconut milk into the curry paste and bring to a boil. Add the chicken; cook and stir until the chicken is nearly cooked through, 10 to 15 minutes. Stir the palm sugar, fish sauce, and lime leaves into the mixture; simmer together for 5 minutes. Taste and adjust the saltiness by adding more fish sauce if necessary. Garnish with sliced red chile peppers and Thai basil leaves to serve.\n",
        "picture_link": "jESD9/BvVAzTIZXRYGk6WFMPPRSoHkS"
    },
    {
        "title": "Red Bean Salad with Feta and Peppers",
        "ingredients": [
            "1 (15 ounce) can kidney beans ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "2 cups chopped cabbage ADVERTISEMENT",
            "2 green onions ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse kidney beans under cold water. Drain well.\nIn a large salad bowl, combine beans, red pepper, cabbage, onions, feta, parsley, garlic, lemon juice, and olive oil. Cover and refrigerate for up to 3 days.\n",
        "picture_link": "sOchM4GFrhmdJlI1mWMag76KgFIT/C6"
    },
    {
        "title": "Easy Alfredo Sauce II",
        "ingredients": [
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, beat butter and Parmesan with an electric mixer until fluffy. Add cream, a little at a time, until mixture resembles softly scrambled eggs. Toss with hot pasta to serve.\n",
        "picture_link": "w0NnOjyW6O391mPEy48RwpNtxItzgJ6"
    },
    {
        "title": "Creamed Chicken for Biscuits",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3 cups cooked, chopped chicken breast meat ADVERTISEMENT",
            "2 cups frozen green peas, thawed and drained ADVERTISEMENT",
            "1 cup toasted sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium heat. Stir in flour, then add broth, cream, garlic powder, salt and pepper. Mix together and cook until thickened. Stir in chicken, peas and almonds. Heat through and serve over hot cooked biscuits.\n",
        "picture_link": "Xh2QqyUaStrvPrhj6Ovr2EHHSZuLwaC"
    },
    {
        "title": "Slow Cooker Bolognese",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup finely chopped baby carrots ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup whole milk ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium heat, and cook and stir the carrots, onion, and garlic until tender, about 10 minutes. Place the ground beef into the skillet and cook and stir, breaking up the meat as it cooks, until browned. Drain off excess fat from the skillet, and pour in 1 cup milk. Bring to a simmer, reduce heat to medium-low, and simmer until the milk is absorbed, about 15 minutes.\nPlace the beef mixture into a slow cooker, and set the cooker to High. Stir in crushed tomatoes, tomato paste, salt, pepper, basil, oregano, and red pepper flakes, and cook for 2 hours. Mix in 1/2 cup milk and Parmesan cheese, stir well, and cook for 2 more hours.\n",
        "picture_link": "5PZ14pIsILz48XUlxBZ2yYteMnE7XVa"
    },
    {
        "title": "Ham and Split Pea Soup Recipe - A Great Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "2 ribs celery, diced ADVERTISEMENT",
            "3 cloves garlic, sliced ADVERTISEMENT",
            "1 pound ham, diced ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 pound dried split peas ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the butter in a large soup pot over medium-low heat. Stir in onion, celery, and sliced garlic. Cook slowly until the onions are translucent but not brown, 5 to 8 minutes.\nMix in ham, bay leaf, and split peas. Pour in chicken stock and water. Stir to combine, and simmer slowly until the peas are tender and the soup is thick, about 1 hour and 15 minutes. Stir occasionally. Season with salt and black pepper to serve.\n",
        "picture_link": "f8.Gpk7n07ghop8gWhn6LbdJc6Z.45y"
    },
    {
        "title": "Tomato Basil Salmon",
        "ingredients": [
            "2 (6 ounce) boneless salmon fillets ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tomato, thinly sliced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with a piece of aluminum foil, and spray with nonstick cooking spray. Place the salmon fillets onto the foil, sprinkle with basil, top with tomato slices, drizzle with olive oil, and sprinkle with the Parmesan cheese.\nBake in the preheated oven until the salmon is opaque in the center, and the Parmesan cheese is lightly browned on top, about 20 minutes.\n",
        "picture_link": "8HS4PjRvK1y5uWAX4VuAFZtEK4AV7SK"
    },
    {
        "title": "Spinach and Cheese Stuffed Pasta Shells",
        "ingredients": [
            "32 jumbo pasta shells ADVERTISEMENT",
            "2 cups ricotta cheese ADVERTISEMENT",
            "2 (10 ounce) packages frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons fennel seed ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 1/2 cups spaghetti sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to boil, gently place pasta shells in boiling water; bring water back to boil. Cook until noodles are just tender; drain well.\nSqueeze spinach dry. Combine spinach, ricotta, 1/3 cup Parmesan cheese, fennel, basil and garlic in a large mixing bowl. Season with salt and pepper; mix well.\nSpread 1/2 cup marinara sauce evenly over the bottom of a 9x13 inch baking dish.\nFill each pasta shell with the spinach cheese mixture. Arrange the shells, filling side up in the baking dish. Spoon remaining marinara sauce over the shells. Sprinkle remaining Parmesan cheese on top of the shells.\nCover the pan loosely with aluminum foil and bake in preheated oven until heated through; about 30 minutes.\n",
        "picture_link": "IXlRheA12.fr9NunC30HgkurVy/OYPe"
    },
    {
        "title": "Eggnog Thumbprints",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon rum ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together 3/4 cup butter, white sugar, and brown sugar until smooth. Beat in egg and vanilla. Combine flour and salt; stir into the creamed mixture by hand to form a soft dough. Roll dough into 1 inch balls, and place balls 2 inches apart on ungreased cookie sheets. Make an indention in the center of each cookie using your finger or thumb.\nBake for 12 minutes in preheated oven. Cool completely.\nIn a small bowl, mix together 1/4 cup butter, confectioners' sugar, and rum. Spoon rounded teaspoonfuls of filling onto cookies. Sprinkle with nutmeg. Let stand until set before storing in an airtight container.\n",
        "picture_link": "biOtX8GTzdZZ4rJdcXZQqi0/WkXNV8u"
    },
    {
        "title": "Steak on a Stick",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "2 teaspoons mustard powder ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "2 pounds flank steak, cut into thin strips ADVERTISEMENT",
            "32 wooden skewers (8 inch long) soaked in water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable bag, combine the soy sauce, olive oil, water, molasses, mustard powder, ginger, garlic powder and onion powder. Seal and shake the bag to mix together. Add steak strips to the bag and seal. Refrigerate for at least 8 hours to marinate.\nPreheat the oven's broiler. Thread meat onto skewers and place on a broiling rack.\nBroil the steak for 3 to 4 minutes on each side. Arrange on a platter to serve.\n",
        "picture_link": "XLNTkaNcFAWi8IOPYaUaHS11QqnP5y."
    },
    {
        "title": "Bacon Ranch Chicken Skewers",
        "ingredients": [
            "1/3 cup ranch dressing ADVERTISEMENT",
            "1 teaspoon hot chile paste (such as sambal oelek) ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into 1 inch pieces ADVERTISEMENT",
            "24 (1-inch) pieces red onion ADVERTISEMENT",
            "12 slices thick cut bacon ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "12 (6 inch) bamboo skewers, soaked in water for 2 hours ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together ranch dressing and hot chile paste in a large bowl.\nMix in chicken pieces and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator for 1 to 3 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove chicken from the bag and transfer to a plate or baking sheet lined with paper towels. Pat chicken pieces dry with more paper towels.\nThread a piece of onion about 1 1/2 inches down the skewer.\nThread the end portion of one strip of bacon onto skewer so the rest of the strip is hanging down. Skewer on a piece of chicken; thread on the next portion of the bacon. Turn the skewer so that the long end of the bacon is again hanging down. Repeat this process of skewering and turning until the entire strip of bacon is threaded, using 4 to 5 chicken pieces.\nThread a second piece of onion onto the end of the skewer.\nRepeat steps 5 through 7 for all twelve skewers.\nSeason chicken skewers with salt and pepper as desired.\nCook the skewers on the preheated grill, turning every 3 to 4 minutes, until nicely browned on all sides and the meat is no longer pink in the center, 12 to 16 minutes total per skewer. Serve with ranch dressing as a dipping sauce.\n",
        "picture_link": ".f2aV.XD9wau4SGLiiWWOckA7CM73le"
    },
    {
        "title": "Coriander and Cumin Rubbed Pork Chops",
        "ingredients": [
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon ground coriander ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "2 boneless pork loin chops ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the salt, cumin, coriander, garlic, and 1 tablespoon olive oil to form a paste. Season the pork chops with salt and pepper, and rub with the paste.\nHeat the remaining olive oil in a skillet over medium heat, and cook the pork chops about 5 minutes on each side, to an internal temperature of 145 degrees F (63 degrees C).\n",
        "picture_link": "wHfXc5xug24wrEl16puKzfzY7rj9nuq"
    },
    {
        "title": "White Cake Frosting I",
        "ingredients": [
            "3/4 cup shortening ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 teaspoon clear imitation vanilla extract ADVERTISEMENT",
            "1/8 teaspoon powdered butter flavoring ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "With an electric mixer blend all ingredients until mixed.\n",
        "picture_link": "XSUXWPo3xrrQEoqXxU5FzpbxKRKxq9G"
    },
    {
        "title": "Cranberry Scones",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter, chilled and diced ADVERTISEMENT",
            "1 cup fresh cranberries, roughly chopped ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 grated zest of one orange ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup half-and-half cream ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large bowl, stir together flour, brown sugar, baking powder, nutmeg and salt. Cut in butter until mixture resembles coarse crumbs.\nIn a separate bowl, toss cranberries with sugar; add to flour mixture along with orange peel and nuts. Mix lightly.\nIn another bowl, beat together cream and egg; slowly pour into dry ingredients, mixing with rubber scraper until dough forms. Knead dough 4 or 5 times, being careful not to over handle. Divide dough in half. Turn out onto lightly floured surface. Shape each half into a 6 inch circle. Cut each circle into 6 wedges. Place scones on lightly greased baking sheets.\nBake in preheated oven until golden brown, about 20 minutes.\n",
        "picture_link": "BMSaa4mjWqofUgNJIdIOHzeOSDC1S8e"
    },
    {
        "title": "Beef Pot Pie III",
        "ingredients": [
            "1 pound sirloin steak, cubed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "3 large carrots, diced ADVERTISEMENT",
            "3 potatoes, cubed ADVERTISEMENT",
            "1 cup frozen green peas, thawed ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 (9 inch) refrigerator pie crusts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, brown the pieces of meat on all sides. Pour in some water to almost cover. Bring to a boil and reduce heat. Simmer until meat is tender and falls apart easily; about 2 to 3 hours. Transfer meat to a large mixing bowl. Shred the meat slightly and add salt and pepper to taste.\nIn another 2 quart saucepan over medium heat, pour in beef broth and add carrots and potatoes. Cook until almost tender; about 15 to 20 minutes. Preheat oven to 350 degrees F (175 degrees C).\nWhen the carrots and potatoes are done, transfer to the large mixing bowl with the beef; leaving the liquid in the pan. Combine the peas with the carrots, potatoes and beef.\nDissolve the cornstarch with the 1/3 cup of water. Pour into the saucepan of beef broth, stirring constantly. Bring to a simmer and reduce heat; cook for 5 minutes.\nLine a 9 inch pie plate with one of the pie crust following the package directions. Place the beef mixture into the pie crust. Pour the gravy over the top of the mixture, then cover with the other pie crust. Bake in a preheated oven until the crust is golden brown; about 25 minutes. Let cool for 5 minutes before serving.\n",
        "picture_link": "S4k/vzTG5X0FWgv743HRI7MKYTm5aem"
    },
    {
        "title": "Chicken Enchilada Casserole I",
        "ingredients": [
            "2 pounds skinless, boneless chicken breast halves - cooked and diced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10 ounce) can enchilada sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (4 ounce) can diced green chiles ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "16 ounces processed cheese spread ADVERTISEMENT",
            "10 (6 inch) corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 5 quart pot combine the chicken, cream of celery soup, cream of chicken soup, enchilada sauce, diced tomatoes and green chiles, onion, garlic, chicken broth, chili powder and cheese. Heat over medium high until the cheese is melted and all of the ingredients are mixed together well.\nIn a 9x13 inch baking dish, layer the mixture and the tortillas like you would lasagna. Make sure to put a thin layer of the mixture on the bottom of the baking dish to prevent sticking. After layering, place dish in the preheated oven and bake for 45 minutes to 1 hour, until cheese starts to brown and bubble. Let stand and cool for at least 10 minutes before serving!\n",
        "picture_link": "O02Ka2Gen88lyil9T3owEIC4wkLpjB."
    },
    {
        "title": "Chocolate Icing",
        "ingredients": [
            "4 tablespoons butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, melt butter and brown sugar over medium heat. Stir until sugar is dissolved, then add milk. Bring to a boil and remove from heat.\nSift together cocoa and confectioners sugar. Blend into butter mixture and add vanilla. If consistency is too stiff, add more milk.\nSpread Quickly over cooled cake, as frosting will set up very fast.\n",
        "picture_link": "jIjT8q6hYL.9uSbDaV5c9lV6QAo3tbK"
    },
    {
        "title": "Pita Pizza",
        "ingredients": [
            "1 pita bread round ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "3 tablespoons pizza sauce ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup sliced crimini mushrooms ADVERTISEMENT",
            "1/8 teaspoon garlic salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium-high heat.\nSpread one side of the pita with olive oil and pizza sauce. Top with cheese and mushrooms, and season with garlic salt.\nLightly oil grill grate. Place pita pizza on grill, cover, and cook until cheese completely melts, about 5 minutes.\n",
        "picture_link": "zzfg8ZmIRkLVKN9QCv99qq8XprKrbeq"
    },
    {
        "title": "Beer Cheese Soup III",
        "ingredients": [
            "4 cubes chicken bouillon ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 1/2 cups cubed potatoes ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup diced carrots ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 (20 ounce) package frozen cauliflower and broccoli ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 pound processed cheese food (eg. Velveeta), cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium high heat, dissolve the bouillon in the beer and water. Add the potatoes, celery, carrots and onion, mix well and allow to cook for 15 to 20 minutes.\nStir in the cauliflower and broccoli mix, and heat for 10 more minutes. Finally, add the condensed chicken soup and the cheese. Reduce heat to low and allow the cheese to melt, stirring often.\n",
        "picture_link": "oFw.3lvZAJjxYhqy3kN1PYtKQIEbdqq"
    },
    {
        "title": "Fabulous Cilantro Pesto",
        "ingredients": [
            "1 (16 ounce) package farfalle pasta ADVERTISEMENT",
            "1 bunch fresh cilantro ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 cup walnuts or pecans ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add the pasta, and return water to a boil. Cook pasta for 8 to 10 minutes, or until al dente; drain well.\nIn an electric food processor or blender, blend cilantro, garlic, vinegar, Parmesan cheese, cayenne pepper, nuts, and salt. Add 1/4 cup of the olive oil, and blend the pesto. Add more olive oil until the pesto reaches your desired consistency.\nPour pesto in a small saucepan and warm over low heat, stirring constantly, until pesto begins to simmer. Pour over cooked pasta and toss.\n",
        "picture_link": "O1xGVT0yyvZhdMMJXZm2aljnWsuWDg2"
    },
    {
        "title": "Wacky Cake VIII",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "6 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSift flour, sugar, salt, soda, and cocoa together into an 8x8 inch ungreased cake pan. Make three depressions. Pour oil into one well, vinegar into second, and vanilla into third well. Pour water over all, and stir well with fork.\nBake at 350 degrees F (175 degrees C) for 30 to 40 minutes, or until tooth pick inserted comes out clean. Frost with your favorite icing.\n",
        "picture_link": "A8AwnBQnNq8FfZ.HOsnKThi/xSQH2Am"
    },
    {
        "title": "Buttermilk Chocolate Cake with Fudge Icing",
        "ingredients": [
            "1 cup buttermilk ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. In a medium bowl, combine the buttermilk and baking soda. Set aside in a warm place.\nIn a large bowl, mix together 2 cups sugar, eggs, 3 tablespoons cocoa powder, oil and 2 teaspoons vanilla until blended. Stir in the boiling water, then gradually beat in the flour. Stir in the buttermilk mixture.\nPour batter into prepared pan. Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\nTo make the Fudge Icing: In a saucepan, combine 1 cup sugar, 1/2 cup cocoa powder, milk, butter and 1 teaspoon vanilla extract. Bring to a boil, and cook for 1 minute. Remove from heat. Using an electric mixer, beat icing for 3 minutes, or until it thickens to spreading consistency. Pour over completely cooled cake.\n",
        "picture_link": "/hGJOrgTqBnTC1ZNscIEVQuqItcmsDe"
    },
    {
        "title": "Brownie Mix in a Jar II",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 1/4 cups white sugar ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together flour, baking powder, and salt in a quart jar. Layer remaining ingredients in the order listed. Press each layer firmly in place before adding the next layer. NOTE: Be sure to wipe out the inside of the jar with a dry paper towel after adding the cocoa powder, so the other layers will show through the glass.\nAttach a tag with the following instructions: Brownie Mix in a Jar 1. Preheat the oven to 350 degrees F (175 degrees C). Grease and flour a 9x13inch baking pan. 2. Empty jar of brownie mix into a large mixing bowl, and stir to blend. Mix in 3/4 cup melted butter and 4 eggs. Mix thoroughly. Spread batter evenly into prepared baking pan. 3. Bake for 25 to 30 minutes in preheated oven. Cool completely in pan before cutting into 2 inch squares.\n",
        "picture_link": "fAQ62HTifX8a8ZEHlvfzhQ56hJMktty"
    },
    {
        "title": "Greek Lemon Chicken and Potatoes",
        "ingredients": [
            "4 pounds skin-on, bone-in chicken thighs ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/2 cup fresh lemon juice ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "3 russet potatoes, peeled and quartered ADVERTISEMENT",
            "2/3 cup chicken broth, plus splash to deglaze pan ADVERTISEMENT",
            "chopped fresh oregano for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly oil a large roasting pan.\nPlace chicken pieces in large bowl. Season with salt, oregano, pepper, rosemary, and cayenne pepper. Add fresh lemon juice, olive oil, and garlic. Place potatoes in bowl with the chicken; stir together until chicken and potatoes are evenly coated with marinade.\nTransfer chicken pieces, skin side up, to prepared roasting pan, reserving marinade. Distribute potato pieces among chicken thighs. Drizzle with 2/3 cup chicken broth. Spoon remainder of marinade over chicken and potatoes.\nPlace in preheated oven. Bake in the preheated oven for 20 minutes. Toss chicken and potatoes, keeping chicken skin side up; continue baking until chicken is browned and cooked through, about 25 minutes more. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Transfer chicken to serving platter and keep warm.\nSet oven to broil or highest heat setting. Toss potatoes once again in pan juices. Place pan under broiler and broil until potatoes are caramelized, about 3 minutes. Transfer potatoes to serving platter with chicken.\nPlace roasting pan on stove over medium heat. Add a splash of broth and stir up browned bits from the bottom of the pan. Strain; spoon juices over chicken and potatoes. Top with chopped oregano.\n",
        "picture_link": "Y6ywFPm.OfHDbvnPfZ331bnV2d2sVUu"
    },
    {
        "title": "One Skillet Mexican Quinoa",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 jalapeno pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes ADVERTISEMENT",
            "1 cup yellow corn ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1 pinch kosher salt and ground black pepper to taste ADVERTISEMENT",
            "1 avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat. Saute jalapeno pepper and garlic in hot oil until fragrant, about 1 minute.\nStir black beans, tomatoes, yellow corn, quinoa, and chicken broth into skillet; season with red pepper flakes, chili powder, cumin, salt, and black pepper. Bring to a boil, cover the skillet with a lid, reduce heat to low, and simmer until quinoa is tender and liquid is mostly absorbed, about 20 minutes. Stir avocado, lime juice, and cilantro into quinoa until combined.\n",
        "picture_link": "7izeeKXlQrDK9ED/rkoIcu8BVBMO5.y"
    },
    {
        "title": "Ham and Pineapple Kabobs",
        "ingredients": [
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon prepared mustard ADVERTISEMENT",
            "3/4 pound cooked ham, cut into 1 inch cubes ADVERTISEMENT",
            "1 (15 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nIn a medium bowl, mix together brown sugar, vinegar, vegetable oil, and mustard. Thread ham and pineapple chunks alternately onto skewers.\nLightly oil grill grate. Place skewers on the prepared grill, and brush liberally with the brown sugar mixture. Cook for 6 to 8 minutes, turning frequently and basting often. Serve when heated through and richly glazed.\n",
        "picture_link": "9MMpv1nGRJ7LUM.tE7dRvsThPzHGb3C"
    },
    {
        "title": "Slow Cooker Baked Potatoes",
        "ingredients": [
            "4 baking potatoes, well scrubbed ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "4 sheets aluminum foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prick the potatoes with a fork several times, then rub potatoes with olive oil, sprinkle with salt, and wrap tightly in foil. Place the potatoes into a slow cooker, cover, and cook on High for 4 1/2 to 5 hours, or on Low for 7 1/2 to 8 hours until tender.\n",
        "picture_link": "IXJZXTncs6hILIbmpSZ64k86JbanbxG"
    },
    {
        "title": "Chicken Pesto a la Lisa",
        "ingredients": [
            "1/2 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "3/4 cup prepared basil pesto ADVERTISEMENT",
            "1/4 cup toasted pine nuts ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "3/4 cup crumbled feta cheese ADVERTISEMENT",
            "1 (16 ounce) package fusilli pasta ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak sun dried tomatoes in chicken broth.\nCook chicken in oil with garlic in a large skillet over medium heat until done.\nStir cornstarch into a couple of tablespoons of chicken broth. Stir remaining chicken broth, sun dried tomatoes, pesto, pine nuts, and basil into the skillet with the chicken. Mix cornstarch mixture into the sauce, and cook until thickened. Add feta a few minutes before serving.\nMeanwhile, cook the pasta in a large pot of boiling salted water until al dente. Drain. Serve sauce over pasta, and sprinkle with Parmesan cheese.\n",
        "picture_link": "7BlgGBWsaz0v1FmhvGN.K/G1JjPhsca"
    }
]