[
    {
        "title": "Simplified Cassoulet",
        "ingredients": [
            "3 pounds boneless lamb shoulder roast, cut into 11/2-inch cubes (or a combination of lamb and boneless pork shoulder roast) ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "Salt and freshly ground black pepper ADVERTISEMENT",
            "1 pound mild Italian sausages ADVERTISEMENT",
            "1 cup water for sausages ADVERTISEMENT",
            "1/2 pound kielbasa, cut into 6 pieces ADVERTISEMENT",
            "1 1/2 pounds boneless duck breast halves ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup full-bodied dry red wine ADVERTISEMENT",
            "reserved duck fat ADVERTISEMENT",
            "2 large onions, cut into medium dice ADVERTISEMENT",
            "6 garlic cloves, minced ADVERTISEMENT",
            "2 ounces thinly sliced prosciutto, minced ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "6 (16 ounce) cans white beans, drained ADVERTISEMENT",
            "3 cups fresh bread crumbs (process sliced bread in a food processor or blender) ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1/3 cup minced fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Adjust oven rack to lower-middle position and heat oven to 450 degrees.\nPlace lamb cubes in a bowl. Drizzle with 2 tablespoons oil and sprinkle generously with salt and pepper, turning to coat.\nPlace Italian sausages, 1 cup water, and remaining 1 tablespoon oil in a large heavy roasting pan set over two burners. Cover with heavy-duty foil and turn heat to medium-high. Cook until sausages lose their raw color, about 5 minutes. Remove foil (reserve it) and continue to cook until water evaporates. Add smoked sausages and cook, turning frequently, until all sausages are browned, 5 to 8 minutes longer. Transfer to a plate. When cool enough to handle, cut Italian sausages into bite-size chunks. Halve smoked sausages lengthwise. Set aside.\nGenerously sprinkle duck breasts with salt and pepper. Reduce heat under roasting pan and add duck breasts, skin side down. Cook until fat has rendered and skin is mahogany brown, 10 to 12 minutes.\nTurn duck breasts over and continue to cook until cooked through, about 5 minutes longer.\nRemove duck from pan. Drain fat from pan and reserve. Slice each breast crosswise into 4 pieces.\nReturn roasting pan to medium-high heat. Add lamb cubes and cook, turning once, until a brown crust forms on two sides, 8 to 10 minutes. Transfer lamb to a large ovenproof pot; set roasting pan aside. Add broth mixture and wine to lamb and cover with reserved foil, pressing down so that it almost touches meat, then sealing foil around top of pot, leaving a small opening for steam to escape. Bring to a simmer and simmer for a few minutes to burn off alcohol. Seal foil completely, then cover pot with lid. Bake, without checking pot, for 1 hour and 15 minutes; meat will be very tender.\nMeanwhile, reheat roasting pan over medium-high heat. Add enough reserved duck fat or olive oil to pan to equal 2 tablespoons. Add onions and garlic and saute until tender, about 5 minutes. Add prosciutto and thyme and saute to blend flavors, 1 to 2 minutes longer. Add tomatoes and beans and simmer to blend flavors, about 10 minutes. Remove from heat.\nTransfer cooked lamb and broth to roasting pan. Add duck, sausages, and enough water to make a soupy, moist casserole. You can let the cassoulet mixture stand at room temperature for up to 2 hours.\nAn hour before serving, adjust oven rack to lower-middle position and heat oven to 350 degrees. Bring cassoulet to a simmer.\nMix bread crumbs, melted butter, and parsley and sprinkle over cassoulet. Bake until crumbs are golden and stew is bubbly, about 45 minutes. Let stand for 5 minutes, and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hawaiian Tuna Sandwich",
        "ingredients": [
            "4 hamburger buns, split ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (5 ounce) can tuna chunks in olive oil ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 dash chili powder ADVERTISEMENT",
            "1 cup shredded lettuce ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "4 canned pineapple rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Toast hamburger buns, and spread cut sides with butter.\nDrain half of the oil from the tuna. Combine the tuna and remaining oil, lemon juice, salt, pepper, and chili powder in a small bowl. Mix well. Fill each toasted bun with tuna salad, shredded lettuce, mozzarella cheese, and one pineapple ring.\nPlace sandwiches on a baking sheet, and heat until the cheese melts, approximately 10 to 12 minutes.\n",
        "picture_link": "rQlZc3MFk71.zTD16VwuKwLsLFpP87e"
    },
    {
        "title": "Blackberry Fool",
        "ingredients": [
            "4 cups heavy cream ADVERTISEMENT",
            "1 cup confectioners' sugar, divided ADVERTISEMENT",
            "1/2 cup sour cream, at room temperature ADVERTISEMENT",
            "1/8 teaspoon almond extract ADVERTISEMENT",
            "2 pints fresh blackberries ADVERTISEMENT",
            "8 strips of lemon zest, for garnish ADVERTISEMENT",
            "8 sprigs fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the heavy cream into a large bowl with half of the confectioners' sugar and almond extract. Whip until stiff. Fold in sour cream. Refrigerate.\nIn a separate bowl, toss blackberries with the remaining confectioners' sugar. Let stand at room temperature for about 15 minutes.\nIn 8 parfait glasses, layer whipped cream and blackberries, beginning and ending with whipped cream. Garnish each parfait with a strip of lemon zest, a few blackberries and a sprig of mint.\n",
        "picture_link": "sUUjaM/1omIeB/cCYEfVcMNDzizRiJ6"
    },
    {
        "title": "Yummy Banana Fizzy",
        "ingredients": [
            "1 1/2 fluid ounces dark rum ADVERTISEMENT",
            "1 1/2 fluid ounces banana liqueur ADVERTISEMENT",
            "3 fluid ounces orange juice ADVERTISEMENT",
            "1 cup chilled lemon-lime soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the rum, banana liqueur and orange juice into a highball glass. Top it off with lemon lime soda and stir. It's that easy.\n",
        "picture_link": "MVyoeLyUJZdUX66VZ34BCh.4g.b333u"
    },
    {
        "title": "Chicken Veronique",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 1/2 pounds chicken, cut into pieces ADVERTISEMENT",
            "1/2 cup orange marmalade ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1/2 cup green seedless grapes ADVERTISEMENT",
            "lemon, sliced ADVERTISEMENT",
            "Italian parsley, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Pour olive oil and butter into a 9x13-inch baking dish. With a spatula, spread oil and butter to cover the bottom of the baking dish.\nPlace the flour, salt, and chicken pieces into a large resealable plastic bag, and shake to coat lightly. Arrange chicken pieces skin-side down in a single layer in the baking dish.\nBake in preheated oven for 20 minutes. Turn chicken pieces and bake 10 minutes. Brush chicken with 1/2 marmalade, and bake until the chicken is golden brown and fork tender, about 10 to 15 minutes. Remove chicken to a serving platter, and keep warm.\nReserve 2 tablespoons of drippings to a saucepan, and place over medium-high heat. Stir in chicken stock. In a small bowl, mix together cornstarch and lemon juice; stir into stock mixture. Bring to a boil, and cook until sauce thickens, 3 to 4 minutes. Stir in remaining marmalade. Stir in grapes, and cook until heated through. Serve sauce over chicken, and garnish with lemon slices and parsley.\n",
        "picture_link": "kB/LFDCDCylRSoe5oMXfyFChd/lr5p6"
    },
    {
        "title": "Cinnamon Krisp",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 (10 ounce) package miniature marshmallows ADVERTISEMENT",
            "9 cups crispy rice cereal ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "1 cup slivered almonds ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease an 8x8 inch pan; set aside.\nMelt the butter with the marshmallows in a large saucepan over medium heat, stirring constantly. Remove from heat; stir in the rice cereal, cinnamon, almonds, and raisins. Press the mixture into the prepared pan. Cool 30 minutes; cut into squares.\n",
        "picture_link": "ic7irVAiwH9MggeaCyBWSGkMCBRNkA."
    },
    {
        "title": "Fiery Red Pepper Potatoes",
        "ingredients": [
            "1 1/2 tablespoons soy sauce ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 1/2 tablespoons vegetable oil ADVERTISEMENT",
            "3 potatoes, cut into bite sized pieces ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 large red bell pepper, chopped ADVERTISEMENT",
            "2 teaspoons sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the soy sauce and cayenne pepper in a small bowl until the cayenne pepper is dissolved; set aside.\nHeat the vegetable oil in a large skillet over medium-high heat; cook the potatoes in the hot oil until golden brown, about 5 minutes. Stir in the onions, bell pepper, and sesame seeds; cook 1 minute more. Pour the soy sauce mixture over the potatoes; cook and stir until the liquid is completely absorbed, 1 to 2 minutes.\n",
        "picture_link": "tqTCdXTPaf1mtdpB1lBetA5YzfVpp9q"
    },
    {
        "title": "Kocoa Klastch Blend",
        "ingredients": [
            "2 pounds confectioners' sugar, sifted ADVERTISEMENT",
            "4 cups French vanilla flavored powdered coffee creamer ADVERTISEMENT",
            "2 cups Dutch process cocoa powder ADVERTISEMENT",
            "2 tablespoons dried orange zest ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground anise seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the confectioners' sugar, coffee creamer, cocoa, orange zest, cinnamon and anise seed. Store in an airtight container, or separate into smaller jars for gift giving.\nTo prepare, mix 1/4 cup of the cocoa mix with 1 1/2 cups of hot milk or boiling water.\n",
        "picture_link": "cyC94KVNlnbfI1xNYkd1woj2yt77yZu"
    },
    {
        "title": "Spicy Clam Sauce",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "3 (10 ounce) cans chopped clams, drained with juices reserved ADVERTISEMENT",
            "3 tablespoons dried oregano leaves, crumbled ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese for topping (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Add the garlic and drained clams; cook and stir for about 5 minutes. Season with oregano, pepper, and red pepper flakes. Pour in the reserved clam juice. Reduce heat to low, and simmer for about 20 minutes. Remove from heat and serve over pasta. Garnish with Parmesan cheese, if desired.\n",
        "picture_link": "KDZOMTBk15k0f9450mbMdjU3qWnQJLC"
    },
    {
        "title": "Jimmy Dean Sausage Crostini",
        "ingredients": [
            "1 (16 ounce) package Regular Flavor Jimmy Dean Pork Sausage, cooked, crumbled and drained ADVERTISEMENT",
            "1 medium yellow onion, finely chopped ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2/3 cup sweet red pepper, finely chopped ADVERTISEMENT",
            "1/3 cup fresh basil, finely chopped ADVERTISEMENT",
            "2 (12 ounce) loaves French bread, sliced 3/4 inch thick ADVERTISEMENT",
            "4 tablespoons olive oil or melted butter ADVERTISEMENT",
            "1 1/2 teaspoons finely chopped rosemary (optional) ADVERTISEMENT",
            "3/8 teaspoon cayenne pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 F. In large bowl, combine cooked sausage, onion, mozzarella, cream cheese, red pepper, basil, and optional ingredients if desired; mix well.\nPlace sliced bread on baking sheet, brush tops with butter or olive oil and bake until lightly toasted. Remove from oven and top each slice with sausage mixture.\nReturn to oven and bake 7-10 minutes or until topping is hot. Serve warm.\n",
        "picture_link": "bBzDu8dZrz78NFEpwwEAWqLSmwTFHgy"
    },
    {
        "title": "Blushing Pomegranate Chicken",
        "ingredients": [
            "2 pounds sweet potatoes, peeled and quartered ADVERTISEMENT",
            "3 1/2 pounds bone-in chicken pieces ADVERTISEMENT",
            "1 cup pomegranate juice ADVERTISEMENT",
            "1/4 cup sherry vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 bunch green onions, sliced ADVERTISEMENT",
            "1/4 cup pomegranate seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange sweet potatoes and chicken pieces in a 9x13 inch baking dish. In a small bowl, mix together pomegranate juice, sherry vinegar, olive oil, brown sugar, ginger, garlic, and salt and pepper. Pour over chicken and sweet potatoes. Cover, and marinate for 1 to 2 hours, turning once.\nPreheat oven to 350 degrees F (175 degrees C). Bake, uncovered, in preheated oven for 45 minutes, or until chicken and sweet potatoes are cooked through. Baste with cooking juices several times while cooking.\nSprinkle with green onion and pomegranate seeds before serving.\n",
        "picture_link": "cE9uLJJdtGXBnsdyXu8iwaGH8dI6WHG"
    },
    {
        "title": "Eggplant and Tomato Packets",
        "ingredients": [
            "1 eggplant, peeled and halved lengthwise ADVERTISEMENT",
            "1 tomato, halved ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "2 sheets heavy duty aluminum foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat.\nPlace one eggplant half and one tomato half on each sheet of aluminum foil. Sprinkle with garlic salt and black pepper. Drizzle with the olive oil. Fold the foil up to form packets.\nGrill the packets until the eggplant and tomato are very tender, about 15 minutes.\n",
        "picture_link": ".jD00pJU93KA2siSY/dKnFPeLeGiciy"
    },
    {
        "title": "Creamy Sweet Potato Soup",
        "ingredients": [
            "4 large sweet potatoes ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "1/2 cup tomato sauce ADVERTISEMENT",
            "2 tablespoons half-and-half ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "1 cup cashew halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Bake sweet potatoes until soft, about 45 minutes. Remove potatoes, and set aside until cool enough to handle. Then peel, and place in a large bowl. With a large fork or potato masher, mash potatoes for 15 to 20 seconds (they do not need to be mashed smooth).\nSpoon the potatoes into a large saucepan over medium-high heat. Stir in butter, water, tomato sauce, and half-and-half. Season with salt, pepper, and thyme. Stir in cashews, and mix well. Bring to a boil, reduce heat to medium low, and simmer until cashews are soft, about 50 to 60 minutes.\n",
        "picture_link": "3pr/k6N/7xhfijrKZD06ZnJH7i5yxNe"
    },
    {
        "title": "No Yolk Deviled Eggs",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1 medium potato, peeled and diced ADVERTISEMENT",
            "1 tablespoon sweet pickle relish ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard, or to taste ADVERTISEMENT",
            "1 pinch paprika, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs in a pan of cold water and bring to a boil. Once they boil, remove from the heat, cover and let stand for 10 minutes. Drain, cool and peel.\nPlace the potato in a saucepan with enough water to cover. Bring to a boil, and cook until tender. Drain.\nCut the eggs in half lengthwise, and remove the yolks; reserve for other uses or discard. Place the potatoes in a medium bowl. Mash with a whisk until smooth, then mix in the relish, sugar, mayonnaise and mustard. Spoon into the egg whites, and dust with paprika. Refrigerate or serve.\n",
        "picture_link": ".irjCUhmu5c06lGT1MjDOBXUFcGVWFS"
    },
    {
        "title": "Eba",
        "ingredients": [
            "8 cups water ADVERTISEMENT",
            "4 cups gari (roasted cassava flour) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water to a boil in a large pot. Sprinkle in the gari, and cook, stirring constantly, until it becomes a paste similar to mashed potato consistency.\n",
        "picture_link": "Rh.mLOZNG7R9KRpG0acIOQox6GzskjK"
    },
    {
        "title": "Chicken Pelau",
        "ingredients": [
            "1 cup vinegar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 pounds bone-in chicken pieces ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "2 cups uncooked white rice ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "4 tablespoons curry powder ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the vinegar and 1 tablespoon of salt. Add chicken and soak for 20 minutes. Rinse chicken, and season with salt and pepper. Discard vinegar, and set chicken aside.\nHeat the oil in a deep saucepan or Dutch oven. Add the onion and garlic; cook and stir until browned. Add the chicken pieces, and fry until browned all over, stirring constantly. Pour in the rice, and season with thyme and curry powder. Stir in the water.\nCover, and cook over medium heat for about 20 minutes, or until rice is tender and has absorbed all of the liquid.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Italian Easter Pizza",
        "ingredients": [
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 pounds mild Italian sausage ADVERTISEMENT",
            "3 (16 ounce) containers ricotta cheese ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "9 hard-cooked eggs, sliced ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make the dough first. In a large bowl, stir together the flour, salt, sugar and baking powder. Combine the oil, milk and 3 eggs, pour into the dry ingredients and stir until the dough holds together well. If you have a stand mixer, use the dough hook attachment to mix until smooth.\nPreheat the oven to 350 degrees F (175 degrees C). Divide the dough in half. Roll out one half of the dough to fit a 14x18 inch baking sheet with sides that come up at least 1/2 inch. If the dough is too stiff to roll out to that size, let it rest for a few minutes and come back to it. Fit the dough into the baking sheet. Set aside.\nPlace the sausage into a large skillet over medium heat. Cook, stirring to crumble, until no longer pink. Drain off the grease and set aside to cool. Mix together the ricotta cheese, 5 eggs, salt, pepper and hard-cooked eggs in a large bowl. When the sausage is cool, stir it into the cheese and eggs. Spread this mixture evenly over the crust in the pan. Roll out the remaining dough and place on top. Roll the edges and pinch together to seal. Brush the top crust with the beaten egg.\nBake in the preheated oven until the crust is golden brown and the filling is bubbly, about 1 hour. Cool for at least 10 minutes before cutting into servings. This can be served warm or cold.\n",
        "picture_link": "T1gWWwZmhvV3.34ypoo7LF86u9RkpRO"
    },
    {
        "title": "Summer Seasoned String Beans",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 ham hock ADVERTISEMENT",
            "2 pounds fresh green beans, trimmed ADVERTISEMENT",
            "12 small red potatoes ADVERTISEMENT",
            "1 (.4 ounce) packet dry vegetable soup mix ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil and butter in a large pot. Place ham hock in the pot, and brown on both sides. Reduce heat to low. Place green beans and potatoes in the pot, and pour in enough water to cover.\nMix in soup mix, sugar, and pepper. Simmer 1 hour, or until beans and potatoes are tender. Remove hock and shred meat into pot before serving.\n",
        "picture_link": "M5KNDPE9aTDHHySmRrRvatbiol54hGq"
    },
    {
        "title": "Peach Pandowdy",
        "ingredients": [
            "6 cups thickly sliced peaches ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nPlace the peaches in a medium bowl. Sprinkle lemon juice over them. Mix together 1/2 cup of sugar and cornstarch. Sprinkle over the peaches, and stir to coat. Spoon into a 2 to 2 1/2 quart casserole dish.\nIn a medium bowl, stir together the flour, 2 tablespoons of sugar, baking powder and salt. Cut in butter with a fork or pastry cutter until it is in fine crumbs. Make a well in the center, and pour in the cream. Stir with a fork until the dough pulls away from the sides of the bowl.\nRoll out dough on a floured surface until it is just big enough to cover the baking dish. Cut a 2 inch cross in the center. Place over the peaches, and tuck in the dough around the sides. Turn back the corners of the cross to reveal the filling.\nBake for 40 to 45 minutes in the preheated oven, until filling is bubbly, and top is golden brown.\n",
        "picture_link": "hVfn2vLyoH5Knvp1shVUsJqfu2XnU4W"
    },
    {
        "title": "Russian Syrniki",
        "ingredients": [
            "1 cup cottage cheese ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons semolina flour ADVERTISEMENT",
            "3 tablespoons all-purpose flour, plus extra for dusting ADVERTISEMENT",
            "1/3 cup canola oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the cottage cheese, eggs, and sugar. Stir in semolina and all-purpose flour, and work into a soft dough. Turn the dough onto a floured surface, and roll into a 1-inch thick log. Slice the log into 8 pieces, then pat each piece in additional flour to form a patty.\nHeat the oil over medium heat until hot. Fry the syrniki in hot oil until golden brown on each side, 3 to 4 minutes per side.\n",
        "picture_link": "YaRzgtaSADOI0fSv5CvThZ5EPanXrKa"
    },
    {
        "title": "Mini Pumpkin Cheesecakes from Reddi-wip®",
        "ingredients": [
            "1 cup chopped walnuts ADVERTISEMENT",
            "4 teaspoons granulated sugar ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup granulated sugar ADVERTISEMENT",
            "1/2 cup canned solid-pack pumpkin ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 dash ground cloves ADVERTISEMENT",
            "1 dash ground nutmeg ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "Ground cinnamon (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (or to 300 degrees F if using dark nonstick pan). Place paper liners in 24 miniature muffin cups.\nCrust: Place walnuts and 4 teaspoons sugar in food processor; pulse until finely ground. Add melted butter and pulse until combined. Press 1 teaspoon walnut mixture firmly into bottom of each prepared muffin cup. Bake 5 minutes. Cool.\nFilling: Place cream cheese and remaining 1/2 cup sugar in large bowl. Beat with electric mixer on medium speed until creamy. Add pumpkin, sour cream, vanilla, cinnamon, cloves and nutmeg; beat until well blended. Add egg, beating on low speed just until blended. Spoon evenly over crusts.\nBake 20 minutes or until centers are almost set. Cool completely in pan, about 30 minutes. Refrigerate at least 2 hours or until chilled. Top with the Reddi-wip just before serving. Sprinkle with additional cinnamon, if desired.\n",
        "picture_link": "b9Vw0nq1oTK2G8O/eusrrAXj97PU3qy"
    },
    {
        "title": "Fresh Salmon Burgers with Lemon-Yogurt Sauce",
        "ingredients": [
            "Patties: ADVERTISEMENT",
            "2 1/2 pounds salmon filet, skin and pin bones removed ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2/3 cup finely chopped parsley ADVERTISEMENT",
            "1/4 cup finely chopped green onions ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1/2 cup plain dried bread crumbs ADVERTISEMENT",
            "1 tablespoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "2 tablespoons light mayonnaise ADVERTISEMENT",
            "2 tablespoons finely chopped parsley ADVERTISEMENT",
            "2 tablespoons finely chopped green onion ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "Burgers: ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "8 brioche buns, split and toasted ADVERTISEMENT",
            "2 cups fresh arugula ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop salmon into 1/8- to 1/4-inch pieces. Transfer to a bowl with 2/3 cup parsley, 1/4 cup green onions, 2 tablespoons lemon juice, bread crumbs, seafood seasoning, 1/2 teaspoon salt, and 1/2 teaspoon pepper; mix together with your hands. Divide into 8 equal portions and pat into 3 1/2-inch patties (1/2 inch thick). Chill, covered, at least 30 minutes or up to 4 hours.\nStir together yogurt, mayonnaise, 2 tablespoons parsley, 2 tablespoons green onion, 1 tablespoon lemon juice, 1/8 teaspoon salt, and 1/8 teaspoon pepper in a small bowl.\nPreheat an outdoor grill to medium heat (325 degrees F to 375 degrees F).\nBrush patties with oil. Oil grate. Grill patties, turning carefully, until cooked through and a thermometer inserted in center of each patty registers 160 degrees F, 2 to 3 minutes per side. Serve on buns with sauce and arugula.\n",
        "picture_link": "kFnUVpsXPLhJZf4vqrrJKx/73bUgJau"
    },
    {
        "title": "Honey Garlic Chicken with Rosemary",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 1/2 tablespoons garlic powder ADVERTISEMENT",
            "2 teaspoons rosemary ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "6 skinless chicken thighs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMelt butter in a large saucepan over medium heat. Add garlic powder, rosemary, salt, and pepper; simmer until flavors combine, about 1 minute. Stir in honey; bring to a boil. Reduce heat to low. Dip chicken into sauce, 1 piece at a time, until coated. Place chicken on a 9x13-inch baking pan; pour remaining sauce over chicken.\nBake chicken in the preheated oven until no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C). Remove from oven; immediately turn over chicken with tongs to coat the top with sauce.\n",
        "picture_link": "vanzqodNmJoTOvRfL6r8q32Gr7n7vBG"
    },
    {
        "title": "Tiger Salad",
        "ingredients": [
            "1/2 English cucumber ADVERTISEMENT",
            "1 1/4 teaspoons salt, divided ADVERTISEMENT",
            "3 large green onions, white and tender green parts only ADVERTISEMENT",
            "1 large green bell pepper ADVERTISEMENT",
            "1 large red bell pepper ADVERTISEMENT",
            "2 tablespoons unseasoned rice vinegar ADVERTISEMENT",
            "1 1/2 tablespoons toasted sesame oil ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "2 cups chopped fresh cilantro, leaves and stems ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut cucumber in half lengthwise and gently scrape out seeds with a spoon. Cut each half crosswise into 2-inch pieces. Cut each piece lengthwise into thin, uniform strips and transfer to a bowl. Toss cucumber with 1 teaspoon salt and let stand 15 minutes.\nMeanwhile, cut green onions and bell peppers into thin, uniform strips, about 2 inches long.\nTransfer cucumber to a fine-mesh sieve, rinse, and drain well. Whisk together vinegar, sesame oil, crushed red pepper, and remaining 1/4 teaspoon salt in a large bowl. Add cucumber, green onions, bell peppers, and cilantro, and toss well.\n",
        "picture_link": "gsoQLEREt6b8oZY0fk41nANtTLAfvLO"
    },
    {
        "title": "Maple Glazed French Toast Casserole",
        "ingredients": [
            "1 (16 ounce) loaf French bread, cut into 1-inch cubes ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "8 large eggs ADVERTISEMENT",
            "3 cups LACTAID® Whole Milk ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1 cup powdered sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3 tablespoons maple syrup ADVERTISEMENT",
            "2 tablespoons LACTAID® Whole Milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 9 X 13-inch pan with cooking spray.\nSpread half of the French bread cubes onto the bottom of the 9x 13 pan. Sprinkle with half of the raisins. Cover with remaining bread cubes. Sprinkle remaining raisins on top.\nMix eggs, 3 cups Lactaid(R) whole milk, 1 teaspoon cinnamon, white sugar, and vanilla together in a large bowl with an electric mixer until ingredients are well blended, 2 to 3 minutes. Pour over bread mixture in pan.\nGently press down bread so it is slightly covered by the liquid. Cover with plastic wrap and put in the refrigerator overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove plastic from casserole and place in the oven. Bake uncovered until set and top is golden brown, about 45 minutes.\nWhisk powdered sugar, 1/4 teaspoon cinnamon, maple syrup, and 1 tablespoon Lactaid(R) milk together in a bowl. If too think, add a bit more milk. Glaze should be thick but liquid enough to drizzle.\nDrizzle glaze over warm casserole. Allow glaze to thicken and set before serving, about 10 minutes.\n",
        "picture_link": "sCL9P8Yz.fntvuyekvLa9omrCbm4j.m"
    },
    {
        "title": "Chef John's Chocolate Energy Bars",
        "ingredients": [
            "2 cups pitted Medjool dates, roughly chopped ADVERTISEMENT",
            "2 cups raw cashews ADVERTISEMENT",
            "1 cup raw or roasted unsalted almonds ADVERTISEMENT",
            "3/4 cup high-quality unsweetened cocoa powder (such as Guittard® Cocoa Rouge) ADVERTISEMENT",
            "2 tablespoons coconut oil, melted ADVERTISEMENT",
            "1/2 cup unsweetened shredded coconut ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 tablespoon cold espresso, or more as needed (or water) ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cashews, almonds, coconut, dates, cocoa, coconut oil, vanilla, cold coffee, cayenne and salt in the bowl of a food processor. Pulse on and off to start. Process about 1 minute; check to ensure mixture is sticky and moist enough to stick together. Add more coffee if needed. Continue to process until mixture becomes a chunky mass.\nLine a baking pan with plastic wrap. Scoop mixture into pan. Press down with a spatula until mixture is even. Place a layer of plastic wrap on the surface and smooth again with your hands.\nRefrigerate until cold and firm, 2 or 3 hours.\nRemove from the pan and unwrap. Cut into bars of your preferred size. Store in a zip top back in the refrigerator.\n",
        "picture_link": "uJpDwG26Y9srOGuM6Sn3.HVulrR8eE."
    },
    {
        "title": "Soft Hard-Boiled Eggs",
        "ingredients": [
            "1 1/4 cups water ADVERTISEMENT",
            "6 large cold eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water into a 3-quart saucepan with a lid. Place over high heat and bring to a low boil. Carefully place the eggs in the water. Cover pan immediately, reduce heat to medium-high, and cook for 9 1/2 minutes. Remove pan from heat and cool eggs down with cold running water, tipping out the water, and continuing to run cold water over the eggs until they are cool.\n",
        "picture_link": "2EcoLT7SIojoOBNxTNy0EGegnke.cWK"
    },
    {
        "title": "Sriracha Honey Brussels Sprouts",
        "ingredients": [
            "nonfat cooking spray ADVERTISEMENT",
            "1 pound Brussels sprouts, trimmed and cut in half ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 teaspoon fresh cracked black pepper ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 1/2 teaspoons sriracha sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a rimmed baking sheet with cooking spray.\nCombine Brussels sprouts, olive oil, salt, pepper, and red pepper flakes in a bowl; toss until coated. Arrange in a single layer on prepared baking sheet.\nRoast in the preheated oven until Brussels sprouts are golden brown and tender, about 25 minutes.\nMix honey and Sriracha sauce together in a small bowl until combined.\nPlace roasted Brussels sprouts in a bowl. Drizzle with honey mixture; toss until well coated.\n",
        "picture_link": "brhZmfC30hNImOhO9K3MILseqlYg5Qa"
    },
    {
        "title": "Italian Sausage Stuffed Shells",
        "ingredients": [
            "1 (16 ounce) package jumbo pasta shells ADVERTISEMENT",
            "3 teaspoons vegetable oil, divided ADVERTISEMENT",
            "1 pound bulk Italian sausage ADVERTISEMENT",
            "1 (16 ounce) package finely shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 teaspoon dried Italian seasoning, plus more for garnish if desired ADVERTISEMENT",
            "1 (24 ounce) jar prepared marinara sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13 baking dish.\nBring a large pot of lightly salted water to a boil. Cook shells in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 to 12 minutes. Drain. Lightly oil a rimmed baking sheet; place drained pasta on baking sheet to cool.\nHeat 2 teaspoons vegetable oil over medium-high heat in a heavy skillet. Cook and crumble sausage until it has lost its pink color and begins to brown. Remove from heat; drain off grease.\nStir half of the shredded cheese and the Italian seasoning into the browned sausage. Spoon mixture into the pasta shells (1 to 2 tablespoons per shell). Arrange stuffed shells in prepared baking dish. Pour marinara sauce evenly over the shells. Top with remaining shredded cheese. Cover tightly with aluminum foil.\nBake in preheated oven until heated through and bubbly, about 30 minutes. Remove foil; bake until browned, 5 to 10 more minutes. Sprinkle with a pinch of Italian seasoning, if desired.\n",
        "picture_link": "Kff03PFCt4J6bNVtKIT4Nv6Fx6vDDYW"
    },
    {
        "title": "Smoky Baked Chicken",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "2 teaspoons mesquite seasoning ADVERTISEMENT",
            "1/2 (8 ounce) package shredded Mexican cheese blend ADVERTISEMENT",
            "1/3 cup real bacon bits ADVERTISEMENT",
            "1/3 cup sliced green onions ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 1/2 teaspoons chipotle-flavored hot sauce (such as Tabasco® Chipotle Pepper Sauce) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking dish with aluminum foil; brush with olive oil.\nSeason chicken breasts with mesquite seasoning and place in the prepared baking dish.\nMix cheese blend, bacon bits, green onions, mayonnaise, and chipotle-flavored hot sauce together in a small bowl. Spread mixture evenly over chicken.\nBake in the preheated oven until chicken is no longer pink in the center and an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), about 16 minutes. Turn off oven; leave chicken inside for 2 minutes. Turn on broiler; broil chicken on low until topping is golden, 2 to 3 minutes.\n",
        "picture_link": "gOoDaGad6ZvlhOe/lXIO8s0wrgsNkfK"
    },
    {
        "title": "Cottage Cheese Breakfast Muffins",
        "ingredients": [
            "Non-stick cooking spray ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "1 cup LACTAID® Cottage Cheese ADVERTISEMENT",
            "1 (4 ounce) can diced green chilies ADVERTISEMENT",
            "2 green onions, diced ADVERTISEMENT",
            "1/2 cup diced sweet bell peppers ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray 12-cup muffin tin with cooking spray.\nBeat eggs until thoroughly combined. Stir in cottage cheese, diced green chilies, green onions, sweet bell peppers, salt and pepper. Stir to combine. Pour mixture into prepared muffin tin.\nBake in preheated oven until set, 15 to 20 minutes.\nLoosen muffins from the muffin tin while still hot.\n",
        "picture_link": "iEJxxB9yzkNRiyjMgAwy9tmjhgXoOhu"
    },
    {
        "title": "Easy Bread Machine Dinner Rolls",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 1/2 cups White Lily® All Purpose Wheat Flour, or more as needed ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "Crisco® Original No-Stick Cooking Spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, butter, egg, 3 cups flour blend, sugar, salt and yeast in bread machine pan in order recommended by the manufacturer. Select Dough/Manual cycle. During initial mixing cycle, open lid and scrape down sides of bread pan as necessary. As dough mixes, add just enough additional flour blend to create a soft dough. When Dough/Manual cycle is complete, remove dough from bread machine pan. Place on lightly floured surface.\nCoat 13 x 9-inch baking pan with cooking spray. Pat dough into rectangle. Cut with pizza cutter or serrated knife into 15 equal pieces. Shape each into a ball. Place evenly in prepared pan. Cover and let rise in warm place until doubled, about 35 to 45 minutes.\nHeat oven to 375 degrees F. Uncover rolls. Bake 15 minutes or until golden brown. Serve warm or cool completely on wire rack.\n",
        "picture_link": "qf.RTpfUA9Sm202sMteyZhgi8dOEhjK"
    },
    {
        "title": "Cheesy Parmesan Crusted Crescent Rolls",
        "ingredients": [
            "1 (8 ounce) package refrigerated butter-flavored crescent rolls ADVERTISEMENT",
            "3/4 cup shredded Stella® mozzarella cheese ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/8 teaspoon dried basil ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "Stella® Parmesan cheese, for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Grease a large baking sheet and set aside.\nRoll crescent rolls out, then divide and top Stella shredded mozzarella cheese among rolls. Gently roll crescents and place onto baking sheet.\nWhisk together butter, dried basil and dried oregano together in a small bowl. Brush mixture onto crescent rolls and top with Stella Parmesan cheese.\nBake at 400 degrees F (205 degrees C) for 10 minutes or until lightly browned.\n",
        "picture_link": "WyR6t9KX8uSTiOl0jAbZwjRuoTVaJqK"
    },
    {
        "title": "\"Special\" Roasted Potatoes",
        "ingredients": [
            "2 pounds new yellow potatoes, halved ADVERTISEMENT",
            "3 sprigs fresh rosemary ADVERTISEMENT",
            "3 cloves garlic, whole, peeled, bruised ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 pinch kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot with water. Bruise the rosemary with the dull side of a knife blade and place in the pot. Add garlic, bay leaves, and salt. Bring to a boil; simmer for 5 minutes. Drain; let potatoes air dry.\nPreheat oven to 375 degrees F (190 degrees C).\nWhen potatoes are thoroughly dry, transfer them back to the pot. Drizzle with olive oil, cayenne pepper, and a pinch of salt. Stir to coat. Transfer potatoes to a rimmed sheet pan. Bake until potatoes are golden brown and crusty, and the flesh is creamy and soft, about 35 to 45 minutes, depending on the size of the potatoes.\n",
        "picture_link": "5DFaZAPk7me6wQXwNo3m/FECYMha6Ay"
    },
    {
        "title": "Spicy Cauliflower Fried 'Rice' with Pork",
        "ingredients": [
            "1 head cauliflower, cored and cut into florets ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "2 boneless pork chops ADVERTISEMENT",
            "1/2 teaspoon five-spice powder, or to taste ADVERTISEMENT",
            "1/4 cup reduced-sodium soy sauce ADVERTISEMENT",
            "1 tablespoon light brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons fish sauce ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "3/4 cup roughly-chopped mushrooms ADVERTISEMENT",
            "1 small yellow onion, finely chopped, or more to taste ADVERTISEMENT",
            "1/2 cup carrot, diced ADVERTISEMENT",
            "1/4 fresh poblano chile pepper, diced, or to taste ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 tablespoons chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse cauliflower in a food processor until it resembles rice.\nHeat sesame oil a large wok or skillet over medium heat. Season pork chops with five-spice powder; cook until pork is slightly pink in the center, 2 to 3 minutes per side. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Transfer pork chops to a cutting board to rest.\nWhisk soy sauce, brown sugar, fish sauce, red pepper flakes, and ginger together in a bowl.\nReturn wok to medium heat; cook and stir mushrooms, onion, carrot, and poblano chile until tender, about 4 minutes. Cut pork chops into cubes.\nPush mushroom mixture to one side of wok. Add eggs; cook and stir until scrambled, 1 to 2 minutes. Stir mushroom mixture and eggs together in wok. Stir in cauliflower and soy sauce mixture; add pork cubes. Cook until cauliflower is tender, 3 to 4 minutes more. Garnish with green onions.\n",
        "picture_link": "5UKpxc.IenliXoXwXUEgAPlQGs6twUS"
    },
    {
        "title": "Hunt's® Easy Tomato Bruschetta",
        "ingredients": [
            "1 (18-inch) French baguette, cut into 3/4-inch slices ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil, divided ADVERTISEMENT",
            "1 (14.5 ounce) can Hunt's® Petite Diced Tomatoes, drained ADVERTISEMENT",
            "1/3 cup chopped fresh basil ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nPlace bread slices on a baking sheet. Brush tops with 2 tablespoons olive oil. Bake 12 to 15 minutes or until lightly toasted.\nCombine remaining 2 tablespoons olive oil, drained tomatoes, basil, garlic, salt, and pepper in a small bowl.\nDivide tomato mixture evenly over toasted bread. Serve immediately.\n",
        "picture_link": "Gdc7YbH5Xf5NzkitpUZzDwiUMU/d0Jq"
    },
    {
        "title": "Cheesesteak Roll-Ups",
        "ingredients": [
            "1 1/2 pounds skirt steak, trimmed and cut into 4-inch wide strips ADVERTISEMENT",
            "1/2 cup Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 medium yellow onion, chopped ADVERTISEMENT",
            "1/2 green bell pepper, seeded and chopped ADVERTISEMENT",
            "3 whole button mushrooms, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 (10.25 ounce) can beef gravy ADVERTISEMENT",
            "1 (9.74 ounce) package Idahoan Signature™ Russets Mashed Potatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPlace beef strips in a shallow dish and cover with Worcestershire sauce. Turn to coat both sides. Let marinate at room temperature as you prepare the filling.\nMelt butter in a large skillet over medium heat. Add onion and cook until softened and starting to brown, about 3 minutes. Add bell pepper and mushrooms. Cook stirring frequently 3 additional minutes.\nTransfer beef strips from Worcestershire sauce to a cutting board; season with salt and pepper. Place a thin layer of cheese down the length of each beef strip. Add a layer of the vegetable mix down the length of each strip. Top each strip with another layer of cheese.\nStarting at the end nearest you carefully roll each beef strip over the filling all the way to the end and place in a baking sheet seam side down. Secure with a toothpick if necessary.\nBake in preheated oven to desired doneness, about 15 minutes. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove from the oven and let rest 5 minutes.\nPrepare Idahoan Signature™ Russets Mashed Potatoes according to package directions. Heat gravy in a saucepan over medium heat.\nCut each cheesesteak roll into slices prior to serving; top with gravy. Serve with Idahoan Signature™ Russets Mashed Potatoes.\n",
        "picture_link": "tFP87eIfVyPQ1WUZ8GHLgoTleXnvrBK"
    },
    {
        "title": "Sweet Tart Pastry",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2/3 cup unsalted butter, cubed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the flour, sugar, and salt into a bowl.\nToss butter through flour mixture to coat pieces. Using fingertips, rub fat into flour, working it until you have created a coarse meal with a few pea-size particles of fat.\nEmpty crumbs onto a cool surface. Form mixture into a mound. Make a 4 to 5 inch well in center of the mound. Combine egg and vanilla and pour mixture into the well. Using a fork, draw crumbs into egg mixture, about 1 - 2 tablespoons at a time. When all crumbs are added, toss mixture a few times with a pastry blender to form large clumps, then scrape into a mound.\nUsing the heel of your hand, push 2 - 3 tablespoons of the dough at a time, outward in 6 to 8 inch sweeps. This will blend fat and flour and give crust a delicate texture. If your hand becomes sticky, flour it as needed. Repeat process until all dough has been worked. Gather dough into a mound again. Repeat procedure 2 more times.\nAfter third time, flour your hands. Gently knead the dough 5 or 6 times to make it smooth. Shape into a 5 inch disk. Dust disk lightly with flour, score with side of your hand, cover with plastic wrap, refrigerate for 20 minutes before shaping. DO NOT LET DOUGH BECOME TOO HARD or it will be difficult to roll. If this happens, let pastry soften at room temperature.\nRoll out to 1/8 inch thickness. After dough has been rolled, position rolling pin 4 inches from top of the pastry. Lift dough over top of rolling pin and gently roll dough toward you. Lift pastry up. Make sure you keep a finger pressed against barrel of rolling pin to keep it from slipping. Position pastry, leaving about 1 1/2 inches of dough hanging over edge of pan on side closest to you. Then unroll pastry over an ungreased tart pan, moving pin away from you. Immediately lift overhang into pan to prevent sharp edge of the pan from cutting dough.\nWorking a small portion of the dough at a time, mold it into crease of the pan. Trim excess pastry from top edge of pan. Chill pastry in refrigerator or freezer for up to 30 minutes. Tear an 18 inch square of tin foil. Make a buttered circle in center of foil 2 inches larger than size of pan. Place foil buttered side down, centering it into the baking pan. Using your hand, press foil flush against the sides.\nHeat oven to 425 degrees F (220 degrees C). Position shelf in lower third of oven. Fill pan with enough dried beans or baking nuggets to just cover surface of pan. DO NOT OVERFILL. Bake pastry shell on a shallow pan with sides. Bake crust 15 to 18 minutes or until sides begin to brown. Remove pan from the oven. Let stand about 30 seconds. Gently remove foil and beans. Reduce oven to 375 degrees F (190 degrees C). Continue to bake crust for 3 to 5 minutes or until it is golden. If bottom of pastry shell puffs up, tap it gently with bottom of a fork to expel the air. Do this carefully so the pastry crust doesn't break. When crust is done, cool completely before filling.\n",
        "picture_link": "ySt2pMzl6bkzGYtLL4F.9EbOJbuBO5u"
    },
    {
        "title": "Pecan Delight",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "20 buttery round crackers, crushed fine ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites until slightly stiff. Add sugar, vanilla, baking powder, Ritz crackers and pecans. Mix well, and pour into greased 9 inch pie plate.\nBake at 350 degrees F (175 degrees C) for 25 minutes exactly.\nAllow pie to cool to room temperature, and then cover with nondairy whipped topping. Refrigerate for 2 hours before serving.\n",
        "picture_link": "R1R.U6Xxo/lyN05CpwSla0sDaFrWnC6"
    },
    {
        "title": "Family Favorite Crispy Parmesan Chicken",
        "ingredients": [
            "4 tablespoons butter, melted ADVERTISEMENT",
            "1 cup Borden® Finely Shredded Parmesan Natural Shreds ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "1 teaspoon dried Italian seasoning with garlic ADVERTISEMENT",
            "6 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Place melted butter in a 9 x 13-inch baking pan.\nCombine grated cheese, panko crumbs, and Italian seasoning in a shallow dish.\nPat chicken breasts dry with paper towels. Roll each chicken breast in the melted butter, then roll in the Parmesan crumb mixture, return the coated chicken to the baking pan, leaving a little space between each chicken breast.\nSprinkle remaining Parmesan crumb mixture over the top of the chicken and spoon any remaining melted butter over the top of the Parmesan crumbs.\nBake in preheated oven until no longer pink in the center and the juices run clear, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "6cAJunYXrcNj8tG2.EJL9S9UFeakzM."
    },
    {
        "title": "Simple Chicken Mayo with Parmesan and Bread Crumbs",
        "ingredients": [
            "2 skinless, boneless chicken breasts ADVERTISEMENT",
            "2 1/2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons mayonnaise, or more to taste ADVERTISEMENT",
            "2 tablespoons bread crumbs, or more to taste ADVERTISEMENT",
            "1 1/2 teaspoons herbes de Provence ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place chicken breasts in a baking pan.\nMix Parmesan cheese and mayonnaise in a bowl; spread evenly over chicken breasts. Coat with bread crumbs; sprinkle with herbes de Provence.\nBake in the preheated oven until chicken breasts are no longer pink in the center and the juices run clear, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "vf4pYMIODnIaLAizAOxKFkIImjcnacq"
    },
    {
        "title": "Watermelon Lime Agua Fresca ",
        "ingredients": [
            "8 cups water, divided ADVERTISEMENT",
            "5 cups peeled, cubed, and seeded watermelon ADVERTISEMENT",
            "1/2 cup white sugar, or more to taste ADVERTISEMENT",
            "1/3 cup lime juice, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1 cup water, watermelon, and sugar in a blender; process until smooth. Pour into a large pitcher; stir in lime juice and remaining 7 cups water. Taste; adjust sugar or lime juice. Refrigerate until chilled, about 1 hour.\n",
        "picture_link": "ooVizCT/OZOtJA1pOOFuymjNwD9l6ba"
    },
    {
        "title": "Potato, Leek, Carrot and Turmeric Soup",
        "ingredients": [
            "6 ounces egg noodles ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 (2 inch) piece ginger root, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 leek, sliced into 1/2-inch pieces ADVERTISEMENT",
            "2 carrots, cut into cubes ADVERTISEMENT",
            "2 stalks celery, sliced into 1/2-inch pieces ADVERTISEMENT",
            "2 potatoes, peeled and cubed ADVERTISEMENT",
            "1 teaspoon turmeric powder ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add egg noodles; cook, stirring occasionally until tender yet firm to the bite, about 3 minutes. Drain. Rinse with cool tap water until cooled, 1 to 2 minutes.\nHeat oil in a deep skillet over medium-high heat. Add ginger and garlic; cook and stir until fragrant, about 1 minute. Stir in leeks and cook until slightly browned, about 3 minutes. Add carrots and celery; cook and stir, about 2 minutes. Add potatoes; cook and stir, about 2 minutes.\nCover skillet and cook until vegetables release some moisture, about 5 minutes. Stir in turmeric, white pepper, and salt. Pour in water and bring soup to a boil.\nBring vegetable broth to a boil in a separate pot. Remove from heat and pour in soup. Stir in egg noodles. Return to heat and simmer until flavors combine, about 5 minutes.\n",
        "picture_link": "ySl.H6MMCFDJrmRId224xs6Epl6eQy6"
    },
    {
        "title": "Kristy's Le Tofu Orange",
        "ingredients": [
            "1 (14 ounce) package baked firm tofu, cut into 1-inch cubes ADVERTISEMENT",
            "2 tablespoons olive oil, or as needed, divided ADVERTISEMENT",
            "12 ounces riced cauliflower (such as Trader Joe's®) ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "3 scallions, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 tablespoon orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 red chile peppers, shredded ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wrap tofu in a paper towel and cover with plate; rest until moisture is removed, about 10 minutes.\nHeat 1 tablespoon olive oil in a skillet over medium heat. Add cauliflower; cook and stir until tender, about 5 minutes.\nPreheat oven to 425 degrees F (220 degrees C). (If using a countertop convection oven, preheat to 400 degrees F (200 degrees C)). Place baking sheet inside to warm.\nRemove paper towel from tofu; discard. Place tofu onto heated baking sheet using heatproof gloves.\nBake in the preheated oven, flipping once, until tofu is heated through, about 3 minutes per side in the conventional oven and 2 minutes per side in the countertop induction oven.\nHeat remaining 1 tablespoon olive oil in a wok on medium heat. Add onions and scallions; cook and stir until onions are slightly softened, about 5 minutes. Stir in garlic. Turn wok to high heat; stir in green peppers.\nCombine water and orange liqueur in a bowl. Pour 1 tablespoon liqueur mixture into wok; toss with 2 wooden spoons until mixed. Repeat with remaining liqueur mixture; cook and stir until evaporated, 3 to 5 minutes.\nSprinkle soy sauce into the wok. Fold in tofu until coated.\nPlace cauliflower in serving bowls and top with tofu mixture. Garnish with red chile peppers; season with salt.\n",
        "picture_link": "cWGrNU8UVKDdF2n5SxrXEjP0Tx4kPeq"
    },
    {
        "title": "Cliff's Greek Breakfast Pitas",
        "ingredients": [
            "1 pound thick-cut bacon, cut into 2-inch squares ADVERTISEMENT",
            "Tzatziki Sauce: ADVERTISEMENT",
            "2 cups plain Greek yogurt ADVERTISEMENT",
            "2 cucumbers, peeled ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground white pepper ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "1 1/2 pounds breakfast sausage, crumbled ADVERTISEMENT",
            "4 pita bread rounds ADVERTISEMENT",
            "1 (16 ounce) bag spring mix greens ADVERTISEMENT",
            "3 Roma tomatoes, diced ADVERTISEMENT",
            "1 white onion, thinly sliced ADVERTISEMENT",
            "1/2 cup olive oil, divided ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). (Set countertop conduction oven to Combo 2.) Line a rimmed baking sheet with aluminum foil, extending it up the sides.\nArrange bacon in a single layer on the foil (slight overlapping is okay as bacon will shrink). Place in preheated oven and cook until your desired level of doneness is reached, 10 and 20 minutes. (For countertop induction oven, cook bacon 8 to 10 minutes.) Transfer bacon to a paper-towel lined plate to drain and reserve bacon fat.\nPlace Greek yogurt in a bowl. Cut 1 cucumber in half and grate half into the yogurt. Stir in minced garlic, white pepper, and kosher salt to make tzatziki sauce.\nSlice the remaining cucumber into thin slices and set aside.\nHeat a large skillet over medium heat. Add sausage; cook and stir until browned, 5 to 8 minutes. Transfer to a bowl. Drain grease.\nTransfer bacon fat to skillet over medium heat. Add pita rounds; toast until golden brown, about 30 seconds per side. Drain on paper towels.\nTop each pita with bacon and sausage. Layer tzatziki sauce, spring mix, Roma tomatoes, cucumber slices, and onion on each pita.\nHeat 1 tablespoon oil in a small skillet. Crack in 1 egg; cook until set but still soft, about 1 1/2 minutes per side. Place egg on top of layered pita. Repeat with remaining oil and eggs. Season with salt and pepper.\n",
        "picture_link": "mKvhE02pTVUfuw3S0v7cnfrnyd5zr7O"
    },
    {
        "title": "Agua Fresca de Pepino (Cucumber Limeade)",
        "ingredients": [
            "5 cups water, or to taste ADVERTISEMENT",
            "3 cucumbers, peeled and chopped ADVERTISEMENT",
            "1/2 cup freshly squeezed lime juice ADVERTISEMENT",
            "1/4 cup granular sucralose sweetener (such as Splenda®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend 2 cups water, cucumbers, lime juice, and 2 tablespoons sweetener together in a blender until smooth. Pour into pitcher; add remaining water. Stir in additional sweetener to taste.\n",
        "picture_link": "sU3HYeZeQzT/hq2BrShSL9nNNDqvj3y"
    },
    {
        "title": "Funfetti® Rice",
        "ingredients": [
            "3 cups cooked rice ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons grapeseed oil ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 carrot, chopped ADVERTISEMENT",
            "1/2 stalk celery, chopped ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 cup French-fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rice in a large bowl. Season with garlic powder, onion powder, salt, and black pepper.\nHeat oil in a large skillet over medium heat. Add red bell pepper, carrot, and celery; cook and stir until tender, about 5 minutes. Add seasoned rice and water; cook until rice is heated through, about 5 minutes. Add French-fried onions; toss to combine.\n",
        "picture_link": "5oKyfz0e4PBn9.X9v8EJ8v2SOV79Pv2"
    },
    {
        "title": "Smoky Skillet with Brussels Sprouts & Sweet Potato",
        "ingredients": [
            "1 (12 ounce) package al fresco® Sweet & Smokey BBQ Chicken Sausage ADVERTISEMENT",
            "1 pound Brussels sprouts, cut in half ADVERTISEMENT",
            "2 large sweet potatoes, peeled, cut into 1-inch cubes ADVERTISEMENT",
            "1 large red onion, cut into quarters vertically ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "1 teaspoon smoked paprika ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "Olive oil ADVERTISEMENT",
            "1 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your grill to medium heat. Using a paper towel soaked with olive oil, coat the inside of a cast iron skillet. Heat it on the grill.\nAdd prepped Brussels sprouts, sweet potatoes and red onion to a large mixing bowl. Pour 2 tbsp olive oil, garlic, mustard, smoked paprika, brown sugar, cayenne pepper, kosher salt & freshly ground black pepper over the vegetables. Toss in the bowl to coat evenly.\nCreate a foil tray out of aluminum foil, about 12” x 5”. Spread vegetables in a single layer on tray. Cover the tray with another sheet of aluminum foil to form a pouch. Roast on the grill for 20-30 minutes, until vegetables are tender. Turn bag every 10 minutes.\nOnce the skillet has reached temperature, place the al fresco Sweet & Smokey BBQ Chicken sausages into the skillet. Cook while constantly turning for 7 minutes, until the outside has begun to brown.\nAdd in the roasted Brussels sprouts, roasted sweet potatoes, and red onions. Sprinkle the rosemary into the skillet and toss to distribute evenly.\nCook in the skillet for another 5 minutes, until the veggies begin to brown. Remove from the grill and enjoy!\n",
        "picture_link": "FROiQw/kIxnbaB3e/DfOfLHRzOVQHlu"
    },
    {
        "title": "Gluten Free Spaghetti & Meatballs",
        "ingredients": [
            "1 (12 ounce) box Barilla® Gluten Free Spaghetti ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1 slice gluten free bread ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "Salt and black pepper to taste ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1/2 cup grated Parmigiano Reggiano cheese ADVERTISEMENT",
            "1 garlic clove, chopped ADVERTISEMENT",
            "1/4 teaspoon chili flakes ADVERTISEMENT",
            "1 pint cherry tomatoes, halved ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine gluten free bread and milk. Let bread soak, then squeeze out excess milk.\nIn the same bowl, add bread, egg, ground beef, 1/2 the parsley, 1/2 the cheese, and season with salt and pepper. Roll into 3/4 inch balls & set aside.\nIn a large skillet, gently cook the garlic and chili flakes in olive oil. Add meatballs and cook thoroughly.\nAdd the cherry tomatoes and saute for 2 minutes, then season with salt and pepper to taste. Deglaze with wine and reduce mixture by half.\nCook the pasta according to package directions, then reserve 1/2 cup of the cooking liquid.\nDrain the pasta then toss with the sauce and add the reserved cooking liquid.\nCook the pasta in the sauce for one minute, remove the skillet from the heat and fold in the remaining cheese and parsley.\n",
        "picture_link": "T78RA/w0sFqcLICjf2kOCmlxFART6F."
    },
    {
        "title": "Chef John's Apple Fritters",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "2 large Granny Smith apples - peeled, cored and cut into 1/4-inch dice ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "1/2 cup sparkling apple cider ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1/2 cup confectioners' sugar, or more as needed ADVERTISEMENT",
            "1 tablespoon sparkling apple cider, or as needed to make glaze ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter over medium-high heat and cook until it turns golden brown, 2 to 3 minutes. Add apples and cook over medium-high heat until apples just begin to soften around the edges, 3 to 4 minutes. Sprinkle in 1 tablespoon sugar and continue cooking another 2 minutes. Remove from heat. Drain in a strainer; let cool to room temperature.\nWhisk flour, baking powder, salt, cinnamon, ginger, and nutmeg together in a mixing bowl until well combined.\nWhisk egg, 1/4 cup sugar, and melted butter together in a separate mixing bowl. Add cooled apple pieces and sparkling apple cider; add the flour mixture. Stir just until flour is incorporated.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Spoon about 2 tablespoons batter per fritter, into hot oil, slightly flattening them out. Cook in batches. Fry on one side until small bubbles appear on the surface, about 2 minutes. Carefully flip fritters over and fry the other side until richly browned, about 2 more minutes.\nTransfer with a slotted spoon to a paper-towel-lined plate to drain grease. Cool slightly before glazing.\nWhisk powdered sugar and cinnamon in a mixing bowl. Add enough apple cider, 1 teaspoon at a time, to form a smooth glaze that is just runny enough to drizzle over fritters.\n",
        "picture_link": "x3Zra0vNUIzv9Pj/guGoeZlHhvBLa.O"
    },
    {
        "title": "Dijon Pork with Apples and Cabbage",
        "ingredients": [
            "1/2 head green or red cabbage, cored and cut into 1/2-inch-thick wedges ADVERTISEMENT",
            "2 large apples - cored and sliced into thin wedges ADVERTISEMENT",
            "5 tablespoons extra-virgin olive oil divided ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt, divided ADVERTISEMENT",
            "1/2 teaspoon black pepper, divided ADVERTISEMENT",
            "2 (16 ounce) pork tenderloins ADVERTISEMENT",
            "1 tablespoon coarse-grain Dijon-style mustard ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme leaves ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Place 1 rack in center position and another 4 inches from broiler. Spray a rimmed sheet pan with cooking spray.\nToss together cabbage and apples with 3 tablespoons oil, 1/2 teaspoon salt, and 1/4 teaspoon pepper on prepared sheet pan and arrange in an even layer.\nPat pork dry and season with remaining teaspoon salt and 1/4 teaspoon pepper. Whisk together remaining 2 tablespoons oil with mustard, vinegar, honey, and thyme in a small bowl. Spread over all sides of pork and set pork on top of cabbage and apples.\nRoast on center rack until an instant-read thermometer inserted into center of thickest part of each tenderloin registers 130 degrees F, about 25 minutes.\nRemove pan from oven and turn oven to broil. When broiler is hot, put pan on top rack and broil until pork has a golden-brown crust, thermometer registers 145 degrees F, and cabbage and apples have a light char, about 5 minutes. Cover pan loosely with foil and let pork rest 10 minutes before slicing. Serve pork warm with cabbage and apples, sprinkled with parsley (if using).\n",
        "picture_link": "yxypz.pc5OHfZHcLRO08RvqHXgVD1ky"
    },
    {
        "title": "Apple Raisin Cobbler Pie",
        "ingredients": [
            "2 cups apple pie filling ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine apple pie filling, raisins, and nutmeg in a bowl. Pour into crust.\nIn another bowl, combine flour and brown sugar; cut in melted butter until mixture becomes crumbly. Stir in nuts. Sprinkle mixture over the top of the pie filling.\nBake at 350 degrees F (175 degrees C) for 35 to 45 minutes, or until top has browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "New Mexico Oatmeal Pie",
        "ingredients": [
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2/3 cup quick cooking oats ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs with an electric mixture. With a wooden spoon, stir in butter, white sugar, brown sugar, oats, vanilla, chopped nuts and raisins.\nPour into pie shell and bake at 375 degrees F (190 degrees C) for 30 minutes.\n",
        "picture_link": "06OdyDj2XZV/5DVCnjTyUDbER8q3zDy"
    },
    {
        "title": "Healthy Cauliflower and Edamame Salad",
        "ingredients": [
            "1 head cauliflower, cut into bite-size pieces ADVERTISEMENT",
            "1/2 (12 ounce) package frozen shelled edamame (green soybeans) ADVERTISEMENT",
            "4 hard-cooked eggs, chopped ADVERTISEMENT",
            "3 ribs celery, chopped, or to taste ADVERTISEMENT",
            "1 large bell pepper, chopped, or to taste ADVERTISEMENT",
            "1 (5.3 ounce) container plain Greek yogurt ADVERTISEMENT",
            "1 bunch radishes, sliced, or to taste ADVERTISEMENT",
            "4 green onions, chopped, or to taste ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon Dijon mustard (such as Grey Poupon®) ADVERTISEMENT",
            "2 kosher dill pickles, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 sprig fresh dill, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cauliflower and 1/2 cup water in a microwave-safe bowl. Cook in the microwave until tender, 2 to 3 minutes; drain. Place edamame in a microwave-safe bowl; cook in the microwave until tender, 1 to 2 minutes.\nCombine cauliflower, edamame, eggs, celery, bell pepper, yogurt, radishes, green onions, mayonnaise, mustard, pickles, olive oil, garlic, dill, salt, and black pepper together in a bowl; toss to distribute.\n",
        "picture_link": "gjXqUGgZfnrE6Gyns0wQUK16TAGR0iS"
    },
    {
        "title": "Chef John's Steak Diane",
        "ingredients": [
            "Sauce: ADVERTISEMENT",
            "1/2 cup demi-glace ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon tomato paste ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "Steaks: ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "2 (8 ounce) beef tenderloin steaks, fully trimmed, pounded to 1/2 inch thick ADVERTISEMENT",
            "Kosher salt and freshly ground black pepper, to taste ADVERTISEMENT",
            "1 tablespoon unsalted butter, cut into small chunks ADVERTISEMENT",
            "3 tablespoons shallot, minced ADVERTISEMENT",
            "1/4 cup Cognac or brandy ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 teaspoons sliced fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season steaks generously on both sides with salt. Allow steaks to come to room temperature while you make the sauce.\nStir together demi-glace, mustard, Worcestershire sauce, tomato paste, and cayenne pepper in a bowl.\nHeat oil in a skillet over very high heat, swirling carefully to evenly cover surface. When oil reaches a smoking point, transfer steaks to oil; add a few chunks of butter. Sear meat on high heat until brown on each side, 2 to 3 minutes per side; keep them on the rare side. An instant-read thermometer inserted into the center should read 125 degrees F (52 degrees C). Transfer steaks to a warm plate.\nStir shallots into skillet; cook until softened, 2 to 3 minutes. Remove skillet from heat; pour in Cognac. Carefully ignite with a fireplace lighter. When alcohol burns off and flames go out, return skillet to high heat and bring to a boil; cook, stirring, a few minutes to reduce slightly. Add cream and any accumulated juices from the steak. Cook on high heat just until sauce starts to thicken, 3 to 5 minutes. Transfer steaks back to pan and reduce heat to low. Gently simmer until meat is heated through and cooked to your desired level of doneness.\nTransfer to hot plates and serve with a generous spoonful or two of sauce. Sprinkle with chives.\n",
        "picture_link": "iYAmv/FleEgjV.Y7iKS9CFojTBx4OUe"
    },
    {
        "title": "Stuffed Angus Sliders with Heirloom Tomato and Onions",
        "ingredients": [
            "1 pound Black Angus ground chuck ADVERTISEMENT",
            "1/2 teaspoon fine sea salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 slices garlic and herb Jack cheese ADVERTISEMENT",
            "4 slider-sized burger buns ADVERTISEMENT",
            "canola oil cooking spray ADVERTISEMENT",
            "1 heirloom tomato, cut into 1/4-inch slices ADVERTISEMENT",
            "1 small sweet onion, sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground chuck in mixing bowl. Add sea salt and pepper and mix with a fork. Divide into 4 equal pieces. Divide each piece in two and shape into 8 flat patties, 2 for each slider.\nFold corners of the Jack cheese slices into the center to make smaller squares. Place cheese on 4 patties and top with remaining patties. Seal edges together.\nSlice buns in half and spray cut side with canola oil spray.\nSpray tomato and onion slices with cooking spray; season with salt and pepper.\nPreheat Panasonic(R) Countertop Induction Oven to Medium on the \"Grill\" setting.\nPlace rolls cut-side down on the grill pan and grill for 3 1/2 minutes. Remove from the oven.\nPlace tomato slices on the grill pan and grill for 2 minutes. Remove from the oven.\nPlace onion on the grill pan and grill for 5 minutes, turning halfway through. Remove from the oven.\nPlace patties on the grill pan and grill for 5 minutes, turning halfway through. Remove from the oven.\nAssemble burgers by placing patties on bottom buns and topping with tomato and onion slices. Cover with top buns.\n",
        "picture_link": "TeLOCHBRproOkgHjBKLoXEzCkyY/R4W"
    },
    {
        "title": "Italian Bean Ramen",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "5 large cloves garlic, finely chopped ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "3 medium carrots, sliced ADVERTISEMENT",
            "2 large celery stalks, diced ADVERTISEMENT",
            "1 medium potato, diced ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 (15.5 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 (3 ounce) packages ramen noodles, coarsely broken in package (flavor packets discarded) ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "6 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large, heavy pot over medium heat. Cook onion with salt, covered, stirring occasionally, until lightly browned, about 10 minutes. Add garlic and rosemary and cook, stirring, 1 minute. Add carrots, celery, potato, and water and bring to a boil. Reduce heat and simmer, covered, until carrots are tender, about 15 minutes.\nPuree 1/2 cup of beans with 1 cup of soup broth in a blender. Add to soup along with remaining cup beans and diced tomatoes, and bring to a boil. Add ramen noodles, then reduce heat and simmer, stirring occasionally, until just tender, about 3 minutes. Stir in parsley.\nSprinkle 1 tablespoon Parmesan cheese over each serving of soup.\n",
        "picture_link": "r/.9tVPAhu941JUFDRadTGOpGOW8yZm"
    },
    {
        "title": "Sriracha Honey Chicken Pizza",
        "ingredients": [
            "1/2 cup honey ADVERTISEMENT",
            "3 tablespoons sriracha sauce, or more to taste ADVERTISEMENT",
            "2 skinless, boneless chicken breasts, cut into 3/4-inch pieces ADVERTISEMENT",
            "1 (10 ounce) container refrigerated pizza crust ADVERTISEMENT",
            "2/3 cup ranch dressing ADVERTISEMENT",
            "1 cup Colby Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat Panasonic Countertop Induction Oven to Medium on the \"Grill\" setting.\nMix honey and sriracha sauce together in a bowl.\nSpread chicken on the grill pan and set the timer for 4 minutes. Turn chicken after 2 minutes. Remove from the oven and stir into the honey mixture.\nUnroll pizza crust flat onto the grill pan. Spread ranch dressing on top. Remove chicken from the honey mixture and place on top of the ranch dressing. Sprinkle Colby Jack cheese over chicken.\nPlace pizza in the oven and press \"Auto Cook.\" Select the frozen pizza setting, 12-inch size. Allow pizza to cook until timer goes off, about 13 minutes. Cut pizza into slices.\n",
        "picture_link": "21Tqv0q/c.tJgK9qXqE5L1cCTZ5A7t."
    },
    {
        "title": "Almond Milk Chocolate Pudding",
        "ingredients": [
            "1 cup white sugar, or to taste ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/3 cup cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt (optional) ADVERTISEMENT",
            "3 cups unsweetened almond milk ADVERTISEMENT",
            "1 teaspoon butter (optional) ADVERTISEMENT",
            "1 teaspoon vanilla extract (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sugar, cocoa powder, cornstarch, and salt together in a saucepan; whisk in 1/4 cup almond milk until foamy and smooth. Continue adding almond milk, 1/4 cup at a time, to cocoa mixture until mixture is smooth and foamy each time. Place saucepan over medium-high heat and cook, stirring constantly, until mixture comes to a simmer and starts to thicken, about 5 minutes.\nRemove saucepan from heat and stir in butter until melted and smooth. Add vanilla extract and mix well. Pour pudding into serving bowl and refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "MGTZA8LuHHPlqeSM/fN68XTf0xQ2Rfy"
    },
    {
        "title": "The Best Kale Salad",
        "ingredients": [
            "1 bunch lacinato kale, ribs discarded and leaves cut into thin strips ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "Lemon Vinaigrette: ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon maple syrup, or more to taste ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "2 carrots, grated ADVERTISEMENT",
            "1/2 cup frozen roasted corn (such as Trader Joe's®), thawed ADVERTISEMENT",
            "1/4 cup crushed tortilla chips ADVERTISEMENT",
            "1/4 cup dry-roasted almonds, coarsely chopped ADVERTISEMENT",
            "2 tablespoons grated smoked white cheese (such as Beecher's® Smoked Flagship) ADVERTISEMENT",
            "2 hard-boiled eggs, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place kale in a large serving bowl; add 1 teaspoon olive oil and 2 pinches salt. Gently massage the oil and salt into kale. Set aside to allow kale to soften, about 10 minutes.\nCombine 1/4 cup olive oil, lemon juice, Dijon mustard, maple syrup, cumin, garlic powder, cayenne pepper, salt, and pepper in a plastic or glass container with a lid. Cover container and vigorously shake until dressing is light yellow and evenly combined.\nLayer carrots, roasted corn, tortilla chips, almonds, and smoked cheese on top of kale. Drizzle dressing over salad. Mix salad using tongs to evenly distribute. Gently stir eggs into salad.\n",
        "picture_link": "dYlOyGzYlP64vnYoKuHsW6iPAy8tFeS"
    },
    {
        "title": "Hearty Potato Skillet",
        "ingredients": [
            "5 medium potatoes, cut into large bite-size pieces ADVERTISEMENT",
            "1 (12 ounce) package sausage links ADVERTISEMENT",
            "4 thick slices bacon ADVERTISEMENT",
            "2 ounces cooked ham, cubed ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1/2 teaspoon seasoned salt, or to taste ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to boil; add potatoes and boil until just tender, 7 to 10 minutes. Drain.\nHeat a large nonstick skillet over medium to medium-high heat and cook sausage links. When cooked through, remove to a plate. Add bacon to the same skillet and cook to nearly your desired doneness. During the last few minutes, add cubed ham to crisp and heat through, 5 to 8 minutes. Remove bacon and ham with a slotted spoon and drain on paper towels. Reserve grease.\nHeat 1 tablespoon oil over medium-high heat in a large pot. Add onion and bell pepper; season lightly with salt and pepper. Cook and stir occasionally until tender, 10 to 15 minutes.\nPlace cooked potatoes in the skillet with the bacon grease over medium heat. Brown on all sides, turning gently as needed. Season potatoes with seasoned salt and pepper, to taste.\nMelt butter in a separate skillet over medium heat. Fry eggs to your desired doneness.\nDistribute browned potatoes among 4 plates. Top with bell pepper-onion mixture, and the meats. Sprinkle with Cheddar cheese and top each with a fried egg.\n",
        "picture_link": "PmZZrrATiaXKyYkf/UtEq7Gv0qAO142"
    },
    {
        "title": "Greek Spinach and Cheese Quiche Squares",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon MAGIC Baking Powder ADVERTISEMENT",
            "2 (300 g) packages frozen chopped spinach, thawed, squeezed dry ADVERTISEMENT",
            "2 cups CRACKER BARREL Crumbled Feta Cheese with Oregano, Sun Dried Tomatoes and Black Pepper ADVERTISEMENT",
            "2 cups CRACKER BARREL Shredded Old Cheddar Cheese ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F (180 degrees C).\nBake butter in 9-inch square baking dish 2 minutes or until melted. Remove dish from oven; brush butter onto bottom and sides of dish.\nBeat eggs with mixer in large bowl. Add flour, milk and baking powder; mix until blended. Stir in spinach, cheeses and onion. Spoon into prepared dish.\nBake 35 minutes. Let stand 15 minutes before cutting into squares.\n",
        "picture_link": "PF4ryqfyfypBBniZCU0439GtjhKYWx2"
    },
    {
        "title": "Gluten-Free Crescent Rolls",
        "ingredients": [
            "1/4 cup whole milk ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/4 cup warm water (110 degrees F (43 degrees C)) ADVERTISEMENT",
            "1/2 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 egg, beaten, divided ADVERTISEMENT",
            "2 cups gluten-free all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter, softened, divided ADVERTISEMENT",
            "1 tablespoon potato starch, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk in a microwave-safe bowl until warm, about 30 seconds. Mix in 1/4 cup butter, 2 tablespoons plus 2 teaspoons honey, and salt. Cool until lukewarm, 3 to 5 minutes.\nCombine warm water and yeast in a small bowl. Let stand until dissolved and creamy, about 5 minutes.\nCombine milk and yeast mixture in the bowl of a stand mixer fitted with a paddle attachment. Add half the beaten egg. Beat in flour, 1/2 cup at a time, until dough pulls together. Switch to the dough hook attachment and knead lightly until dough is wet and sticky but forms into a ball, about 5 minutes.\nGrease a large bowl with 1 teaspoon softened butter. Use greased or wet hands to transfer dough into the bowl, turning to coat it with butter. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDust a work surface with potato starch. Deflate dough and turn it out onto the work surface. Divide the dough into 4 equal pieces and form into rounds. Place a piece of parchment paper over one of the rounds and roll into a rectangle about 1/8-inch thick with a rolling pin; cut into wedges. Brush each wedge with a little softened butter. Repeat with remaining dough rounds.\nRoll each wedge up from the base towards the point. Brush a little bit of remaining beaten egg on the seam to seal. Bend each roll into a crescent shape.\nLine baking sheets with parchment paper. Arrange crescents sealed-side down on the sheets. Brush tops with remaining beaten egg.\nTransfer baking sheets to the cold oven. Heat oven to 365 degrees F (185 degrees C).\nBake crescents until golden brown, about 25 minutes.\n",
        "picture_link": "K3k9iRukYUKT5f68E5yt8l4QeF8xW8W"
    },
    {
        "title": "Flan de Queso (Cream Cheese Flan)",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/3 cup 2% milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nFill a large oven-safe pot with water to 1 inch; bring to a boil.\nPlace sweetened condensed milk, evaporated milk, eggs, cream cheese, milk, and vanilla extract in a blender; blend until smooth.\nPlace sugar in an even layer in a saucepan over medium heat. Cook until edges start to brown, about 1 minute; drag sugar into the center with a spatula once the edges start to brown. Continue cooking, stirring from time to time, until caramel is an even golden brown, 4 to 5 minutes.\nPour caramel into a 9-inch flan mold or baking pan; swirl so that caramel reaches 1 inch up the sides. Pour condensed milk mixture on top. Place mold in the pot of boiling water.\nBake flan in the preheated oven until a damp table knife inserted into the center comes out clean, 45 minutes to 1 hour. Remove from oven and let stand for 5 minutes.\nChill flan in the refrigerator until firm, 2 to 3 hours. Invert onto a serving plate so that caramel is on top.\n",
        "picture_link": "M5..pD.NtARXP6puu6sVTXobsph1dFu"
    },
    {
        "title": "Jersey Fresh Stewed Tomatoes",
        "ingredients": [
            "6 large tomatoes - peeled, cored, and chopped ADVERTISEMENT",
            "3/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped sweet onion ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 1/2 teaspoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomatoes, green bell pepper, onion, and celery in a large skillet over medium heat; cook and stir until fragrant, about 10 minutes. Reduce heat and cook until green bell pepper and onion are soft, about 5 minutes more. Stir in sugar, salt, oregano, basil, and pepper.\nWhisk water and cornstarch together in a small bowl. Stir into the skillet. Simmer tomato mixture until thickened, about 5 minutes.\n",
        "picture_link": "AsaZ84dTzAFkdgYYjxJtqRR9rsn/sZ."
    },
    {
        "title": "Real Nacho Cheese Sauce",
        "ingredients": [
            "1 1/2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 cup milk, or more as needed ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons cream cheese ADVERTISEMENT",
            "1 teaspoon taco seasoning mix ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium-high heat. Whisk in cornstarch until paste forms, 30 seconds to 1 minute. Whisk in milk gradually until smooth, 1 to 2 minutes. Simmer until thickened to sauce consistency, about 2 minutes.\nWhisk Cheddar cheese, cream cheese, taco seasoning, and hot sauce into milk mixture until smooth, 1 to 2 minutes more. Add more milk as needed for desired consistency. Keep warm until ready to use.\n",
        "picture_link": "nYaWj8r4js36MbkJasHraD0F05WeIwO"
    },
    {
        "title": "Ruth's Eggplant Caponata",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound Japanese or other small eggplant, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup dry red wine ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons capers, drained ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat. Cook eggplant, onion, garlic, oregano, cinnamon, allspice, salt, and pepper, stirring frequently, until onion is slightly browned, 7 to 8 minutes.\nReduce heat to medium and add tomatoes, water, wine, and bay leaf. Simmer, stirring frequently, until eggplant is tender and mixture is thickened, 13 to 15 minutes. Remove from heat and stir in sugar, capers, and vinegar. Let cool 30 minutes, then discard bay leaf. Serve at room temperature or chilled.\n",
        "picture_link": "wRS3jPgP30paSevl9k5nJFtu0Nz.Y/W"
    },
    {
        "title": "Award-Winning White Chicken Chili",
        "ingredients": [
            "1 1/4 pounds skinless, boneless chicken breast ADVERTISEMENT",
            "2 (15 ounce) cans great Northern beans ADVERTISEMENT",
            "1 (15 ounce) can white corn ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "1 (10.5 ounce) can cream of chicken soup ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup shredded pepper Jack cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer chicken, great Northern beans, and corn into a slow cooker.\nMix chicken broth, chicken soup, green chile peppers, and taco seasoning together in a bowl; pour over chicken mixture.\nCover and cook on Low until chicken is no longer pink in the center, 8 to 10 hours. Stir in sour cream and pepper Jack cheese; cover and cook until cheese is melted, 3 to 5 minutes.\n",
        "picture_link": "mlwYO5zUACBIAu3BzMgmqqYTbVIHsym"
    },
    {
        "title": "Soba Noodle Salad with Chicken and Sesame",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "4 ounces buckwheat soba noodles ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 boneless skinless chicken breast, cut into thin bite-size strips ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 rib celery, sliced (optional) ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons chopped green onion ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk rice vinegar, 1 tablespoon vegetable oil, sesame oil, brown sugar, soy sauce, and ginger together in a large bowl until dressing is combined.\nBring water to a boil in a large pot. Add soba noodles, stir, and return water to a boil. Boil noodles until tender, 4 to 5 minutes. Drain noodles in a colander under cold running water until cool, about 1 minute.\nHeat 2 teaspoons vegetable oil in a skillet over medium heat. Cook chicken breast pieces until no longer pink in the center and the juices run clear, 2 to 4 minutes. Add garlic, salt, and pepper; stir until fragrant, about 1 minute more.\nToss soba noodles, chicken, celery, carrot, red pepper, cilantro, green onion, and sesame seeds together with dressing in large bowl.\n",
        "picture_link": "K8.DLN.oaFF29HD0MFikAyY1Gj00jtm"
    },
    {
        "title": "Gluten Free and Paleo Tuna Avocado Cups",
        "ingredients": [
            "1 (5 ounce) can Bumble Bee® Solid White Albacore Tuna in Water, drained ADVERTISEMENT",
            "2 tablespoons minced celery ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "2 tablespoons minced fresh dill ADVERTISEMENT",
            "2 tablespoons olive oil mayonnaise ADVERTISEMENT",
            "1/4 teaspoon celery salt ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "1/8 teaspoon lemon pepper ADVERTISEMENT",
            "Kosher salt and freshly ground black pepper, to taste ADVERTISEMENT",
            "1 large ripe avocado, halved, pitted ADVERTISEMENT",
            "Lemon wedges, for serving (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently mix tuna, celery, onion, dill, mayo, salt, mustard, lemon pepper and black pepper together in a small bowl until just combined.\nStuff the avocado halves with equal amounts of the tuna. Serve immediately with lemon wedges.\n",
        "picture_link": "7HXWWOsI2.WRtDi2FDFbPKXNbmhKMUy"
    },
    {
        "title": "Chicken Fajita Pasta Bake",
        "ingredients": [
            "1 pound ziti pasta ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "1 pound boneless chicken breast, cubed ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can corn, drained ADVERTISEMENT",
            "1 (16 ounce) package shredded Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in ziti and return to a boil. Cook pasta uncovered, stirring occasionally, until tender yet firm to the bite, about 10 minutes. Drain.\nHeat oil in a skillet over medium heat; add onion and green pepper. Cook and stir until soft, 5 to 7 minutes; remove from skillet. Place chicken into the skillet; cook and stir until no longer pink, 7 to 10 minutes.\nCombine salsa, cream cheese, and taco seasoning in a saucepan over low heat: cook until cream cheese is melted, about 5 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine ziti, chicken, salsa mixture, black beans, corn, and onion mixture in a large bowl. Add 8 ounces Cheddar cheese; mix until combined. Pour into a baking pan.\nBake in the preheated oven for 20 minutes. Remove from oven; top with remaining Cheddar cheese. Bake until cheese is melted, about 10 minutes.\n",
        "picture_link": "hJDI9SMnKzyflrZYGswU5NAZt/xcDJ."
    },
    {
        "title": "Salted Cashew Sweet Potato Fudge",
        "ingredients": [
            "12 ounces white chocolate chips ADVERTISEMENT",
            "1/2 cup Bruce's® Yams Cut Sweet Potatoes in Syrup, drained and mashed ADVERTISEMENT",
            "1 tablespoon heavy cream, warmed ADVERTISEMENT",
            "1 teaspoon vanilla extract, warmed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon nutmeg ADVERTISEMENT",
            "1/4 cup smooth cashew butter ADVERTISEMENT",
            "1/4 cup chopped salted cashews ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 4 x 5-inch glass dish with non-stick baking spray; set aside.\nWarm a glass bowl and add white chocolate chips. Heat in microwave, stopping every 20 seconds to stir.\nWhen melted, stir in mashed Bruce's(R) Yams Cut Sweet Potatoes, cream, vanilla, salt and nutmeg. Mix quickly, then add cashew butter and continue to mix until very smooth. Pour mixture into prepared dish. Sprinkle with chopped cashews (patting them gently into fudge).\nRefrigerate for a minimum of 2 hours.\n",
        "picture_link": "WelM3nP9pR3EEv1k5jdMxHSShLrzjt6"
    },
    {
        "title": "Gluten Free Spaghetti with Garlic & Red Pepper",
        "ingredients": [
            "1 (12 ounce) box Barilla® Gluten Free Spaghetti ADVERTISEMENT",
            "1/3 cup extra virgin olive oil ADVERTISEMENT",
            "3 cloves garlic, sliced ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1/4 cup freshly grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil.\nHeat olive oil in a large skillet over medium heat. Add garlic, parsley and red pepper flakes; saute 2 to 3 minutes.\nCook pasta according to package directions.\nDrain pasta, reserving 1/2 cup pasta water. Immediately add hot pasta to skillet.\nStir in reserved pasta cooking water. Mix well. Add cheese and toss lightly.\nTransfer to a serving platter or bowl.\n",
        "picture_link": "PsMjhAqxdKQWA4zE6DR8AumEDQ0J/hu"
    },
    {
        "title": "Bok Choy Ramen Salad",
        "ingredients": [
            "Salad Dressing: ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "Salad Crunchies: ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 (3 ounce) packages ramen noodles including flavor packet (such as Top Ramen®) ADVERTISEMENT",
            "1/2 cup sesame seeds ADVERTISEMENT",
            "3 ounces slivered almonds ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 large heads bok choy, chopped ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine canola oil, sugar, red wine vinegar, and 2 tablespoons soy sauce together in a bowl.\nMelt butter in a saucepan over low heat; add sugar and stir until dissolved. Crumble ramen noodles; stir into butter mixture. Stir ramen seasoning packet, sesame seeds, almonds, and soy sauce into noodle mixture; cook until lightly toasted, stirring constantly to prevent burning, 2 to 3 minutes. Remove from heat.\nToss oil and vinegar mixture, ramen mixture, bok choy, and green onions together in a large bowl.\n",
        "picture_link": "HAkaad7UW5rooxG7en/opbP3rkWP.gK"
    },
    {
        "title": "Easy Kolacky",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 (12.5 ounce) can apricot fruit filling (such as Solo®) ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cream cheese and butter in a large bowl; beat with electric mixer until smooth and creamy. Beat 1/2 cup of confectioners' sugar into the butter mixture. Slowly beat in the flour; mix well. Cover bowl and refrigerate at least 3 hours, or overnight.\nPreheat an oven to 375 degrees F (190 degrees C).\nOn a well floured board, roll out chilled dough to 1/8 inch. Use a pizza wheel to cut dough into 2 1/2 inch squares. Spoon approximately 2 teaspoons of filling in the center of each square; do not overfill. Fold opposite corners of each square into the middle to encase dough, pinching dough together in center. Filling should peek out a little at each end. Transfer cookies to an ungreased baking sheet.\nBake the kolacky in the preheated oven until set but not brown, about 12 minutes. Remove to racks to cool. Dust cooled kolacky with remaining powdered sugar.\n",
        "picture_link": "KQANVIkn9Ao.PjZsl7EYzhjjw8Xsd26"
    },
    {
        "title": "Creamy Pheasant and Noodle",
        "ingredients": [
            "2 cups sliced carrots ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "1 cup sliced celery ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 pounds cubed pheasant meat ADVERTISEMENT",
            "2 (10.75 ounce) cans reduced fat reduced sodium condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon dried thyme leaves, crushed ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup frozen peas ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "paprika to taste ADVERTISEMENT",
            "1 (10 ounce) package dried egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place carrot, onion, celery, parsley, and bay leaf into a large (4-quart) slow cooker. Add cubed pheasant meat, then stir together cream of mushroom soup, water, thyme, and 1/4 teaspoon pepper; pour over pheasant. Cover and cook on Low for 8 to 9 hours, or on High for 4 to 4 1/2 hours.\nStir frozen peas into pheasant and season to taste with salt, pepper, and paprika. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Serve creamy pheasant on a bed of noodles.\n",
        "picture_link": "0sSEbuBMQ8qUrmE4zQpLOigJAZh0gwK"
    },
    {
        "title": "Tempeh Sandwiches",
        "ingredients": [
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 (8 ounce) package tempeh, sliced into thin strips ADVERTISEMENT",
            "2 tablespoons liquid amino acid supplement ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 small onion, thinly sliced ADVERTISEMENT",
            "1 medium green bell pepper, thinly sliced ADVERTISEMENT",
            "1 jalapeno pepper, sliced ADVERTISEMENT",
            "2 pita breads, cut in half ADVERTISEMENT",
            "soy mayonnaise ADVERTISEMENT",
            "4 thin slices Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat. Add the tempeh slices and cook 3 to 4 minutes, or until they start to brown. Pour in half of the liquid aminos and cook for 1 minute. Flip the tempeh slices and cook until toasted, 3 to 4 more minutes. Pour in the remaining liquid aminos and cook for 1 minute. Remove the tempeh, and set it aside.\nIn the same skillet, heat the remaining oil over medium heat. Cook the onion, green pepper, and jalapeno until the vegetables have softened, 4 to 5 minutes.\nSpread each pita half with 1 teaspoon soy mayonnaise. Stuff each pita with several slices of tempeh, peppers and onions, and a piece of Swiss cheese. Toast the sandwiches in a toaster oven for 2 minutes or until the cheese has melted.\n",
        "picture_link": "TVA.9ZkpmNs5zBT2/0nY7mOB7Dl8CV."
    },
    {
        "title": "Campfire Angel Food Yummies",
        "ingredients": [
            "1 (10 inch) angel food cake, cut into large cubes ADVERTISEMENT",
            "1 (5 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 cup coconut flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast the angel food cake cubes over the coals of a campfire on toasting sticks until browned. Dip the toasted cake into the condensed milk, and roll in coconut flakes.\n",
        "picture_link": "owKrbF5x4ZZTXnW/CgL.y1/zpRh5pYC"
    },
    {
        "title": "Grandma's Quail",
        "ingredients": [
            "8 quail ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Heat the shortening in a large heavy-bottomed skillet over medium-high heat.\nSeason the quail with the garlic powder, salt, and pepper to taste. Place the flour in a shallow dish; roll the quail in the flour.\nWorking in batches, brown the quail on all sides in the preheated shortening. Place the browned quail in a large roasting pan or casserole dish; pour the water over the quail and cover with aluminum foil.\nBake in the preheated oven for 1 hour, or to an internal temperature of 165 degrees F (75 degrees C), taken in the thickest part of the thigh. Spoon the sour cream over the quails, allow the sour cream to melt before serving.\n",
        "picture_link": "0LxafY0secpLczb/F9CMLmuFxy.LPGC"
    },
    {
        "title": "Moroccan Inspired Apricot-Braised Chicken",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 chicken thighs ADVERTISEMENT",
            "1 large onion, halved lengthwise and cut into thick slices ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/2 cup unsulfured apricots, halved ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 cup beer (preferably lager) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a deep skillet over medium-high heat. Brown chicken thighs on both sides until golden, about 3 minutes per side. Set chicken aside, then stir in onion and garlic; cook for 1 to 2 minutes until the onion has softened. Stir in apricots and season with ginger, cumin, and allspice. Cook for 1 minute until spices are fragrant.\nPour beer into pan, scraping the bottom of the pan to dissolve the browned bits. Add chicken, cover, and reduce heat to medium-low. Simmer gently until the chicken begins to fall away from the bone, about 30 minutes.\n",
        "picture_link": "oy8hXO26.rXXQDHsjTBTx9EeLJPu3Xq"
    },
    {
        "title": "Fresh Apricot-Honey Sponge Cake (Russian Style)",
        "ingredients": [
            "1 tablespoon butter, plus more for pan ADVERTISEMENT",
            "3 tablespoons bread crumbs ADVERTISEMENT",
            "10 fresh apricots, pitted and sliced ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "3 large eggs, separated ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 cup crushed walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease a 9-inch cake pan with butter, and dust with bread crumbs; set aside.\nMelt butter in a small saucepan over medium heat. Add the sliced apricots, and drizzle with honey. Cover, and cook gently until the apricots have softened, then allow to cool to room temperature.\nMeanwhile, beat the egg whites to soft peaks with an electric mixer. Slowly pour in sugar while continuing to beat to stiff peaks; set aside.\nBeat the egg yolks on low speed for a few seconds until slightly thickened. Slowly pour in sugar while continuing to beat until thickened and light-colored. Beat in milk, then sift together flour with baking powder, and fold into yolks along with cooled apricot mixture, walnuts, and egg whites until combined.\nPour into prepared pan, and bake in the middle or bottom of the preheated oven until a toothpick inserted into the center comes out clean, about 50 minutes. Loosen the cake by running a knife around the edges of the pan. Invert cake onto a plate, then place another plate on the cake bottom, and flip right-side-up; cool completely before serving.\n",
        "picture_link": "b7rFmQ8nPT8X8Ts/y00yAAOzXx4ypBe"
    },
    {
        "title": "Easy Chicken Parmesan Sandwich",
        "ingredients": [
            "6 frozen chicken nuggets ADVERTISEMENT",
            "2 tablespoons tomato sauce ADVERTISEMENT",
            "1 hamburger bun, split ADVERTISEMENT",
            "1 slice American cheese ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken nuggets on a microwave-safe plate. Cook in microwave until hot in the middle, about 2 minutes.\nSpread 1 tablespoon tomato sauce on one piece of the hamburger bun; cover the sauce with the American cheese slice. Arrange the chicken nuggets onto the cheese. Pour the remaining tomato sauce over the nuggets; sprinkle with the Parmesan cheese. Top with the other half of the hamburger bun to finish the sandwich.\n",
        "picture_link": "SMJTSxaQV.zVGnrfbC0bG84fg.m1m.y"
    },
    {
        "title": "The Best Dang Rib Sauce, Period",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 fresh poblano pepper, seeded and finely chopped ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "3 tablespoons dark molasses ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup Marsala wine ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes, or to taste ADVERTISEMENT",
            "3/4 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a saucepan over medium heat, and cook and stir the poblano pepper and onion for 6 to 8 minutes, until the onion is translucent.\nStir in the honey, molasses, brown sugar, tomato paste, vinegar, Marsala wine, red pepper flakes, garlic powder, cumin, oregano, smoke flavoring, salt and pepper, and whisk until smooth. Bring the sauce to a boil over medium-low heat, reduce heat to low, and simmer for about 35 minutes, stirring occasionally, until the sauce is thick.\nStore refrigerated.\n",
        "picture_link": "8aHQkJWn2n0oB34owbWgrYJLneQGIoC"
    },
    {
        "title": "Auntie Emily's Rhubarb Pudding",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 cups chopped rhubarb ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon butter or margarine ADVERTISEMENT",
            "3/4 cup boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease an 8 inch square baking dish.\nIn a medium bowl, stir together the white sugar, flour and baking powder. Stir in the milk until blended, then stir in the rhubarb. Pour into the prepared baking dish and spread into an even layer. In a separate bowl, stir together the brown sugar, butter and boiling water until butter has melted. Pour over the cake in the pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 45 to 50 minutes.\n",
        "picture_link": "pI4s1hPB3g7EkRFLDi/h1WA.5dtX4dS"
    },
    {
        "title": "Slow Cooker Italian Moose Roast Sandwiches",
        "ingredients": [
            "1 (4 pound) moose roast ADVERTISEMENT",
            "10 cloves garlic ADVERTISEMENT",
            "10 cubes beef bouillon ADVERTISEMENT",
            "1 (16 ounce) jar sliced pepperoncini peppers, with liquid ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 (.7 ounce) package dry Italian salad dressing mix ADVERTISEMENT",
            "12 (6 inch) hard-crusted French rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut 20 small, deep slits all over the roast; stuff the slits with garlic and bouillon cubes, and place into a slow cooker. Drain half of the liquid from the peppers, then pour the remaining peppers and liquid over the roast. Season with Worcestershire sauce, and sprinkle the Italian dressing mix overtop.\nCook on Low for 10 to 12 hours until the meat can easily be pulled apart. Shred the meat finely, and serve mounded on French rolls; dip into juices if desired.\n",
        "picture_link": "U/m3C/E6FtiRuV51.FOAe.MsHAjlQpK"
    },
    {
        "title": "Seattle Caramel Apples",
        "ingredients": [
            "6 Granny Smith apples ADVERTISEMENT",
            "6 wooden sticks ADVERTISEMENT",
            "1 (14 ounce) package individually wrapped caramels, unwrapped ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups trail mix ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Insert wooden sticks 3/4 of the way into the stem end of each apple. Place apples on a cookie sheet covered with lightly greased aluminum foil.\nCombine caramels and water in a saucepan over low heat. Cook, stirring often, until caramel melts and is smooth. Stir in the vanilla. Dip each apple into the caramel and gently run apples around insides of saucepan to scrape off some of the caramel. Scrape excess caramel from the apple bottoms using the side of the saucepan.\nSpread the trail mix out on a dinner plate. Roll the apples in the mixture to coat. Place on the aluminum foil and chill.\nPut the chocolate chips in a microwave-safe bowl. Cook in the microwave for 30 second intervals, stirring between each, until melted and smooth. Drizzle over the apples and return them to the refrigerator until ready to serve.\n",
        "picture_link": "/dTWZYs7H00KxLvcmpy0UFRzLSCINJK"
    },
    {
        "title": "Apple Cheddar Pork",
        "ingredients": [
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup chopped Granny Smith apple ADVERTISEMENT",
            "2 boneless pork loin chops, pounded thin ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, toss together the Cheddar cheese and apple. Lay out the pork chops and spread a thin layer of the cheese mixture on top of each one. Roll them up and secure with toothpicks.\nHeat the oil in a large skillet over medium-high heat. Quickly brown the outsides of the chops, then pour in the vinegar and water. Reduce heat to low, cover and cook for about 30 minutes.\nMix the flour with a small amount of the liquid from the chops. Stir into the skillet until completely dissolved, then simmer for a few minutes, stirring constantly, to make a quick gravy.\n",
        "picture_link": "4pLVezWUZswkb3ME26/QhD7tpcQWR7q"
    },
    {
        "title": "LaMama Raisin Burgers",
        "ingredients": [
            "3 pounds ground beef ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce, or to taste ADVERTISEMENT",
            "6 hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for medium heat.\nIn a large bowl, combine the ground beef, raisins, onion, garlic, salt, pepper and Worcestershire sauce. Mix lightly using your hands, then divide into 6 portions. Flatten each portion into a patty.\nPlace burgers on the grill and cook for about 7 minutes per side, or until well done. If you do not wish to grill, fry patties in a skillet over medium heat. Serve on buns with your favorite toppings.\n",
        "picture_link": "XHw9k/J1RRBhO5atUBNCVoiOwYBlPUi"
    },
    {
        "title": "Chocolate-Dipped Strawberries",
        "ingredients": [
            "1 (7 ounce) package BAKER'S Real Milk Dipping Chocolate ADVERTISEMENT",
            "36 medium strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate as directed on package.\nDip strawberries into chocolate; let excess chocolate drip off.\nPlace on wax paper-covered baking sheet or tray. Let stand at room temperature or store in refrigerator for 30 min. or until chocolate is firm.\n",
        "picture_link": "aXG7Szwzbn2kpUHj6kAE4NiAX.jooe."
    },
    {
        "title": "Praline Pumpkin Mousse",
        "ingredients": [
            "1 cup cold milk ADVERTISEMENT",
            "1 (15 ounce) can pumpkin ADVERTISEMENT",
            "2 (3.4 ounce) packages JELL-O Vanilla Flavor Instant Pudding & Pie Filling ADVERTISEMENT",
            "1 1/4 teaspoons pumpkin pie spice ADVERTISEMENT",
            "2 cups thawed COOL WHIP Whipped Topping ADVERTISEMENT",
            "1/2 cup chopped PLANTERS Pecans ADVERTISEMENT",
            "1 tablespoon butter or margarine, melted ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat first 4 ingredients in large bowl with whisk 2 min. (Mixture will be thick.) Stir in COOL WHIP. Spoon into dessert glasses.\nRefrigerate 4 hours. Meanwhile, toss nuts with butter and sugar.\nSprinkle nut mixture over desserts just before serving.\n",
        "picture_link": "LVMkJALqL8DaQHsMRBKh5ptT9XnV136"
    },
    {
        "title": "Farmhouse Chicken Dinner",
        "ingredients": [
            "1/4 cup flour ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "4 small bone-in chicken breast halves, skin removed ADVERTISEMENT",
            "1/4 cup KRAFT Light Zesty Italian Dressing ADVERTISEMENT",
            "2 cups baby carrots ADVERTISEMENT",
            "1 onion, cut into wedges ADVERTISEMENT",
            "1 (14.5 ounce) can fat-free reduced-sodium chicken broth, divided ADVERTISEMENT",
            "2 cups instant brown rice, uncooked ADVERTISEMENT",
            "1/2 (8 ounce) container PHILADELPHIA Neufchatel Cheese, cubed ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour and pepper in shallow dish. Add chicken; turn to coat both sides of each piece. Gently shake off excess flour. Heat dressing in large nonstick skillet on medium heat. Add chicken, meat-sides down; cook 5 to 6 min. or until golden brown. Turn chicken. Add carrots, onions and 1 cup broth; cover. Simmer on medium-low 20 min. or until chicken is done (165 degrees F).\nMeanwhile, cook rice as directed on package; spoon onto serving platter. Use slotted spoon to remove chicken and vegetables from skillet; place over rice. Cover to keep warm.\nAdd Neufchatel and remaining broth to skillet; cook on high heat until Neufchatel is melted and sauce is well blended, stirring constantly. Simmer on medium-low heat 3 to 5 min. or until slightly thickened, stirring occasionally. Spoon over chicken and vegetables; top with parsley.\n",
        "picture_link": "I1pPwDjIA34kxvlELQra5NOnRGqGKUO"
    },
    {
        "title": "From-Scratch Venison Stroganoff",
        "ingredients": [
            "2 pounds cubed lean venison ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons canola oil ADVERTISEMENT",
            "1 (8 ounce) package sliced mushrooms ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nToss venison cubes with flour to coat. Heat 2 tablespoons of canola oil to smoking in a large skillet. Add venison, and cook until well browned, then remove and set aside. Pour in remaining 1 tablespoon of canola oil; when hot, add mushrooms and cook until softened then stir in onion and cook until softened.\nStir in the reserved venison, then add tomato sauce, garlic powder, salt, pepper, and Worcestershire sauce. Pour into a casserole dish, cover, and bake in preheated oven for 1 1/2 hours, stirring occasionally.\nStir in sour cream and continue cooking until venison is tender, about 30 minutes longer.\n",
        "picture_link": "1BDWsee8Oe5sKs31c8ynj2F5xc81D9."
    },
    {
        "title": "Mint and Lemon Dressing",
        "ingredients": [
            "1/3 cup olive oil ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh mint leaves ADVERTISEMENT",
            "1 tablespoon chopped fresh mint leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together olive oil, lemon juice, and 1 1/2 tablespoons of mint until well blended. Set aside for 2 hours.\nStrain mint out of dressing with a fine mesh strainer. Stir in remaining 1 tablespoon chopped mint leaves and serve.\n",
        "picture_link": "8nm.g0xbBHU7JLVK61sUoCo4.XlI33y"
    },
    {
        "title": "Venison Salami",
        "ingredients": [
            "5 pounds ground venison ADVERTISEMENT",
            "2 1/2 tablespoons sugar-based curing mixture (such as Morton® Quick Cure®) ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons cracked peppercorns ADVERTISEMENT",
            "4 teaspoons mustard seed ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "2 teaspoons hickory-flavored liquid smoke ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground venison in a large plastic bowl or bucket. Add the curing mixture, sugar, peppercorns, mustard seed, ground pepper, garlic powder, onion powder, liquid smoke, and salt. Mix well, then cover tightly and refrigerate for 24 hours.\nOn the second day, mix thoroughly, kneading as you would bread for 2 to 3 minutes. Re-cover and refrigerate for another 24 hours.\nOn the third day, mix and knead the mixture again for another 2 to 3 minutes. Refrigerate for 1 hour.\nPreheat oven to 250 degrees F (120 degrees C).\nShape mixture into 2 or 3 round logs, about 4-inches in diameter. Place on a lightly oiled baking tray and bake in preheated oven for five hours, turning halfway through, until the internal temperature reaches 160 degrees F (70 degrees C). Cool and then refrigerate overnight before slicing and serving.\n",
        "picture_link": "XMk30OmL14UmvIXPXtyvIpknciBbCZS"
    },
    {
        "title": "Persimmon Cookies IV",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups persimmon pulp ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nWhisk the flour, baking soda, cinnamon, and ginger in a bowl; set aside. Beat the butter and sugar with an electric mixer in a large bowl until smooth. Add the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in the persimmon pulp. Mix in the flour mixture until just incorporated. Drop spoonfuls of the dough 2 inches apart onto ungreased baking sheets.\nBake in the preheated oven until slightly puffed and golden brown, about 12 minutes. Cool on the pan for 5 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "Jk.WhhorUjlDXBtWMQUlJIG9ue/LflS"
    },
    {
        "title": "Peanut Butter Clusters",
        "ingredients": [
            "1 (10 ounce) package Reese's Peanut Butter Chips ADVERTISEMENT",
            "1/2 cup dry-roasted unsalted peanuts ADVERTISEMENT",
            "1/2 cup regular oats, uncooked ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Microwave chips in a bowl on high power until melted, about 1 1/2 minutes. Stir. Add remaining ingredients; mix thoroughly. Using your hands, firmly roll into 1-inch balls. Cool.\n",
        "picture_link": "djh6nsRu9dRtqiaWyPkMpZwDnLlpDp2"
    },
    {
        "title": "Passover Chocolate Cheesecake",
        "ingredients": [
            "2 1/2 cups crushed chocolate macaroon cookies ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 teaspoons matzo meal ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). In a small bowl, stir together the crushed macaroons and butter. Press into the bottom of a 9 inch springform pan. Bake for 15 minutes in the preheated oven; remove and cool.\nIn a medium bowl, stir cream cheese and sugar together until well blended. Stir in matzo meal, milk and vanilla until smooth. Mix in the eggs one at a time.\nCombine the chocolate chips and butter in a small microwave-safe dish. Heat at 30 second intervals until melted, stirring at each interval. Stir into the cream cheese batter. Pour the batter over the cooled crust and smooth the top.\nBake in the preheated oven for 40 minutes, or until the center appears solid when jiggled slightly.\n",
        "picture_link": "ZQuwvcf1tIdlbUOmCheQLPW3gWb2zzS"
    },
    {
        "title": "Slashed Sea Bass with Red Onions, Mushrooms, and New Potatoes",
        "ingredients": [
            "1 cup new potatoes ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 portobello mushroom caps, sliced ADVERTISEMENT",
            "1 red onion, sliced ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "cracked black pepper to taste ADVERTISEMENT",
            "2 (4 ounce) fillets sea bass ADVERTISEMENT",
            "2 tablespoons chopped fresh chervil ADVERTISEMENT",
            "1 teaspoon chili oil ADVERTISEMENT",
            "1/2 cup pesto sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler.\nPlace new potatoes in a pot with enough water to cover, and bring to a boil. Cook 10 minutes or until tender.\nMelt the butter in a skillet over medium heat, and saute the mushrooms and onion until tender. Sprinkle with lemon juice, and season with sea salt and cracked black pepper.\nSlash the sea bass fillets on both sides, and insert the chervil. Rub with chili oil, sea salt, and cracked black pepper. Place fillets on a baking sheet, and broil 5 minutes on each side, or until easily flaked with a fork. Drizzle with pesto sauce, and serve over new potatoes, mushrooms, and onion.\n",
        "picture_link": "gbWAYCg.x63eT31B2Sgj7bJSlWLQKLq"
    },
    {
        "title": "Chocolate Lizzie Cake with Caramel Filling",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "4 1/2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon lemon juice ADVERTISEMENT",
            "1 1/8 cups butter ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon lemon juice ADVERTISEMENT",
            "2 cups superfine sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour four 8-inch round cake pans.\nMix the flour, baking soda, and salt in a bowl. In a large bowl, cream together the butter and sugar. Beat in eggs one at a time. Alternately beat in flour mixture and buttermilk until smooth.\nPlace unsweetened chocolate in a small bowl. Pour the boiling water over the chocolate, and stir until melted. Mix chocolate, vanilla, and lemon juice into the buttermilk batter. Divide batter evenly into the prepared cake pans.\nBake 15 minutes in the preheated oven, or until a toothpick inserted in the center comes out clean. Cool 10 minutes in pans, then turn out onto wire racks to cool completely.\nCaramel Filling: Mix the butter, confectioners' sugar, vanilla, lemon juice, superfine sugar, and milk in a heavy saucepan. Stirring constantly, bring to a boil, and cook until temperature reaches 225 degrees F (110 degrees C) on a candy thermometer. Remove saucepan from heat, and set in a large bowl filled with ice water. Beat filling with an electric mixer until spreadable. At first this seems to be just hot, hard work, but the filling will suddenly start to thicken as it begins to cool. Transfer filling to a clean bowl, and it will continue to cool as you frost the top of each cake layer. Stack the frosted layers atop each other.\n",
        "picture_link": "prkyR8DW/EC/qXCRUHy.RxrxkCYehHK"
    },
    {
        "title": "Papaya Boats",
        "ingredients": [
            "1 cup fat-free plain yogurt ADVERTISEMENT",
            "1/4 cup walnuts ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1 cup chopped fresh strawberries ADVERTISEMENT",
            "2 medium papayas, cut in half lengthwise and seeded ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the yogurt, walnuts, and raisins. Fold in the strawberries. Spoon the mixture into the centers of the papaya halves. Drizzle with honey to serve.\n",
        "picture_link": "BeAqCV5zsOa5U2Rnf0vz.irDtqJTniG"
    }
]