[
    {
        "title": "Roasted Wild Mushrooms and Potatoes",
        "ingredients": [
            "2 pounds new potatoes (such as Yukon Gold), halved ADVERTISEMENT",
            "2 tablespoons olive oil, or more if needed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "2 ounces pancetta, chopped ADVERTISEMENT",
            "1/4 pound king trumpet mushrooms, cut into chunks ADVERTISEMENT",
            "1/4 pound chanterelle mushrooms, cut into chunks ADVERTISEMENT",
            "1/4 pound nameko mushrooms, trimmed ADVERTISEMENT",
            "1/4 pound clamshell (shimeji) mushrooms, trimmed ADVERTISEMENT",
            "3 tablespoons sherry vinegar ADVERTISEMENT",
            "2 tablespoons chopped fresh tarragon ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon olive oil (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace potatoes into a large roasting pan and drizzle with 2 tablespoons olive oil. Sprinkle with salt and mix to coat potatoes with salt and olive oil. Turn so the cut sides are up.\nRoast in the preheated oven for 30 minutes.\nWhile potatoes are cooking, pour 1 teaspoon olive oil into a large skillet over medium heat and cook pancetta, stirring often, in the hot oil until pancetta releases some fat and looks like cooked ham, about 5 minutes. Stir in king trumpet, chanterelle, nameko, and clamshell mushrooms, adding a pinch of salt as they cook.\nTurn heat to high and cook mushrooms until most of the juices evaporate and mushrooms begin to brown, about 10 minutes.\nTurn oven heat up to 425 degrees F (220 degrees C).\nStir potatoes in the baking dish; mix mushrooms and pancetta with potatoes. Return to oven and bake for 10 minutes; stir and continue baking until potatoes are browned, soft, and tender, about 10 more minutes. Let cool slightly, about 10 minutes.\nDrizzle sherry vinegar over potatoes and mushrooms, sprinkle with tarragon, garlic, and 1 tablespoon olive oil, and toss to mix. Taste and adjust seasoning. Transfer to a serving platter.\n",
        "picture_link": "UtyjnvEVtisQwr3Gm6nEDzeSF9iRjVK"
    },
    {
        "title": "Chewy Strawberry Sugar Cookies",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons strawberry puree ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon red colored sugar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nBeat 1 1/2 cups white sugar and butter together in a bowl with an electric mixer until creamy, about 3 minutes. Beat egg into butter mixture. Add strawberry puree.\nStir flour, vanilla extract, baking powder, and salt into strawberry mixture with a spoon until flour is completely incorporated into dough.\nStir 1/2 cup white sugar and red sugar together in a shallow bowl.\nRoll dough into walnut-sized balls, roll each ball in red sugar mixture, and place each ball 1 1/2 inches apart onto prepared baking sheets. Lightly press each dough ball down to flatten.\nBake cookies in the preheated oven until lightly browned, 10 to 15 minutes. Cool.\n",
        "picture_link": "VnrSHoCxj4MmKavC.fhN2nuC7lnaSmm"
    },
    {
        "title": "Ragu Chicken Parmesan",
        "ingredients": [
            "3/4 cup plain dry bread crumbs ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "6 (5 ounce) boneless, skinless chicken breast halves ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (24 ounce) jar Ragu® Old World Style® Traditional Sauce ADVERTISEMENT",
            "1 cup shredded part-skim mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F. Combine bread crumbs, Italian seasoning and garlic powder in shallow dish. Dip chicken in egg, then crumb mixture; turn to coat.\nArrange the chicken in a 13 x 9-inch baking dish. Bake 20 minutes.\nPour sauce over chicken; top with cheese. Bake an additional 10 minutes or until chicken is thoroughly cooked.\n",
        "picture_link": "1YX6E91uxa/8iL6HPl57wnZcxm3p2mW"
    },
    {
        "title": "Paleo Tortillas",
        "ingredients": [
            "1/2 cup almond flour ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 teaspoons butter, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix almond flour, eggs, honey, and salt together in a bowl; form mixture into 6 balls. Press each ball into a tortilla shape.\nHeat butter in a skillet over medium heat; cook each tortilla in the hot skillet until lightly browned, 1 to 2 minutes per side.\n",
        "picture_link": "mAyR3gDKT.74SRyY3cPxMpD.yKum8Pa"
    },
    {
        "title": "Mexican Sushi",
        "ingredients": [
            "3 ounces low-fat cream cheese, softened ADVERTISEMENT",
            "1 1/2 tablespoons seeded and finely chopped chipotle in adobo ADVERTISEMENT",
            "1 large plain flour tortilla ADVERTISEMENT",
            "1 large tomato-flavored tortilla ADVERTISEMENT",
            "1 large spinach-flavored tortilla ADVERTISEMENT",
            "3/4 cup low-fat refried black beans ADVERTISEMENT",
            "6 tablespoons pico de gallo salsa ADVERTISEMENT",
            "1 1/2 Avocados from Mexico, peeled, pitted and diced ADVERTISEMENT",
            "3/4 cup chopped cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together cream cheese and chipotle. Heat tortillas in microwave or oven to soften. Spread each tortilla with 2 Tbsp. chipotle cream cheese, 1/4 cup black beans and 2 Tbsp. salsa. Scatter one-third of the avocado and cilantro on each.\nRoll up tortillas tightly; wrap in plastic wrap and refrigerate. To serve, unwrap and trim ends; cut each roll across into 6 pieces.\n",
        "picture_link": "RBsV0YHeDSveX.z3pARCafYnKSqPb9O"
    },
    {
        "title": "Chef John's Breakfast Sausage Patties",
        "ingredients": [
            "1 pound coarsely ground pork shoulder ADVERTISEMENT",
            "2 teaspoons fennel seeds, or more to taste - lightly crushed ADVERTISEMENT",
            "2 teaspoons freshly grated orange zest ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried Italian herb seasoning ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "1 pinch freshly grated nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork, fennel seeds, orange zest, salt, black pepper, Italian seasoning, red pepper flakes, and nutmeg into a bowl and stir very lightly with a fork to combine. Do not overmix. Cover and refrigerate overnight.\nCheck seasonings before using: Shape about 2 teaspoons sausage into a small patty and fry until brown in a skillet over medium heat. Let cool 1 to 2 minutes and taste for seasoning.\nCover a cutting board with plastic wrap. Divide sausage into 6 equal pieces, roll into a balls, and wrap each ball with plastic wrap. Press flat into patties and discard plastic.\nPlace a heavy skillet, such as a cast iron skillet, over medium-high heat. Cook patties in hot skillet until meat is no longer pink in the center and the sausage is browned, about 3 minutes per side. Serve immediately.\n",
        "picture_link": "1FnLlBGE44NrmSnXN1sVnKdH1G2za6S"
    },
    {
        "title": "Whole Wheat Coconut Oil Waffles",
        "ingredients": [
            "1 1/2 cups whole wheat pastry flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups milk, room temperature ADVERTISEMENT",
            "1/3 cup virgin coconut oil, melted ADVERTISEMENT",
            "1 large egg, beaten ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to the manufacturer's instructions.\nWhisk flour, sugar, baking powder, and salt together in a bowl; make a well in the center of the flour mixture.\nBeat milk, coconut oil, egg, and vanilla extract together in another bowl; pour into well in the flour mixture and stir until batter is just combined.\nLadle batter into preheated waffle iron and cook until golden and crisp, 2 to 5 minutes.\n",
        "picture_link": "kP7uYep6ka2uTjo.rZynMBCCsmD5Idi"
    },
    {
        "title": "Yummy Summer Pea Salad",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "2 (6 ounce) packages frozen peas, thawed ADVERTISEMENT",
            "1 pound cooked bacon, chopped ADVERTISEMENT",
            "1 cup golden raisins ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons wine vinegar ADVERTISEMENT",
            "1/4 teaspoon white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss peas, bacon, raisins, Cheddar cheese, onion, and sunflower seeds together in a large bowl. Stir mayonnaise, vinegar, and sugar together in a small bowl; drizzle over the salad and toss to coat.\nCover bowl with plastic wrap and refrigerate for 1 hour.\n",
        "picture_link": "jSSOEcYpMcfsbyaYRRTY8Nr45e4zTL6"
    },
    {
        "title": "Deliciously Healthy Paleo Pancakes With Banana and Walnuts",
        "ingredients": [
            "1 teaspoon coconut oil, or more as needed ADVERTISEMENT",
            "6 large bananas, sliced ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "3 tablespoons extra-virgin coconut oil ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 teaspoon coconut oil on a griddle set to 325 degrees F (165 degrees C) or a skillet over medium heat.\nPlace bananas in the bowl of a stand mixer. Add eggs, 3 tablespoons coconut oil, vanilla extract, salt, and baking soda; beat until batter is smooth and fluffy.\nGently ladle batter, about 1/4 cup per pancake, onto the hot griddle; sprinkle with cinnamon and arrange walnuts on each pancake. Cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 3 to 4 more minutes. Repeat with remaining batter, adding more coconut oil between batches.\n",
        "picture_link": "Vbq0ETsci1vYvp9REMUyC7CC0J9/WrW"
    },
    {
        "title": "Quick Festive Ground Meat Skillet",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 tablespoon garlic pepper seasoning ADVERTISEMENT",
            "1 (15 ounce) can corn, drained ADVERTISEMENT",
            "1 cup ranch dressing ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "shredded Cheddar cheese, or more to taste ADVERTISEMENT",
            "2 cups cooked rice, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef and garlic pepper in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir corn, ranch dressing, salsa, and oregano into ground beef mixture; cook and stir until hot and bubbling, 5 to 10 minutes. Serve over cooked rice.\n",
        "picture_link": "spjPiDLzS/fwuXrBL6DAByIZZq4mhrC"
    },
    {
        "title": "Mushroom and Bacon Green Beans",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 (8 ounce) package sliced white mushrooms ADVERTISEMENT",
            "1 teaspoon minced onion ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "2 tablespoons crumbled cooked bacon ADVERTISEMENT",
            "1 pinch lemon-pepper seasoning ADVERTISEMENT",
            "1 pinch seasoned salt ADVERTISEMENT",
            "1 cup frozen green beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat; cook and stir mushrooms, onion, and garlic until mushrooms are slightly tender, about 5 minutes. Stir bacon, lemon pepper, and seasoned salt into onion mixture; cook until mushrooms are tender, 5 to 10 more minutes.\nStir green beans into mushroom mixture; cook, stirring occasionally, until green beans are softened and cooked through, 5 to 10 minutes.\n",
        "picture_link": "GubiYuWHrnPjHxmw9bgqMU0Bn.cplE."
    },
    {
        "title": "Homemade Coffee Creamer (Pumpkin Spice)",
        "ingredients": [
            "14 ounces heavy whipping cream, divided ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "3 tablespoons pumpkin puree ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 4 ounces cream, maple syrup, pumpkin puree, pumpkin pie spice, and vanilla extract together in a microwave-safe bowl. Heat pumpkin mixture in the microwave in 30-second intervals, stirring between intervals, until heated through and completely blended, 1 to 3 minutes.\nPour sweetened condensed milk, remaining 10 ounces cream, and pumpkin mixture into a container, cover the container with a lid, and shake until completely mixed. Store in the refrigerator.\n",
        "picture_link": "ufqjV5YmaNtYJJvhCuc9XT1M4M.g5LS"
    },
    {
        "title": "Ragu No Boiling Lasagna",
        "ingredients": [
            "2 (15 ounce) containers ricotta cheese ADVERTISEMENT",
            "2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 (24 ounce) jars Ragu® Old World Style® Traditional Sauce ADVERTISEMENT",
            "12 uncooked lasagna noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F. Combine ricotta cheese, 1 cup mozzarella cheese, 1/4 cup Parmesan cheese and eggs in bowl; set aside.\nSpread 1 cup Sauce in 13 x 9-inch baking dish. Layer 4 uncooked noodles, then 1 cup sauce and 1/2 of the ricotta cheese mixture; repeat. Top with remaining 4 uncooked noodles and remaining sauce.\nBake 1 hour covered tightly with aluminum foil. Remove foil and sprinkle with remaining mozzarella and Parmesan cheeses. Bake uncovered an additional 10 minutes. Let stand 10 minutes before serving.\n",
        "picture_link": "CBph7jawar2COiq89k8BclEW//VGp52"
    },
    {
        "title": "Savory Buttermilk Meatloaf ",
        "ingredients": [
            "Meatloaf: ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "2 1/2 pounds ground chuck ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon hot sauce ADVERTISEMENT",
            "1/2 teaspoon dried tarragon ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon cider vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with a silicone baking mat.\nMelt butter in a skillet over medium-high heat. Saute onion in hot butter until soft and translucent, 6 to 7 minutes. Cool to room temperature.\nCombine cooled onion, beef chuck, bread crumbs, buttermilk, ketchup, eggs, Worcestershire sauce, salt, black pepper, hot sauce, tarragon, and Italian seasoning in a bowl; mix together with a fork and let sit until breadcrumbs absorb moisture, about 10 minutes.\nTurn meatloaf mixture out into the center of the prepared baking sheet and form into a 9x5-inch loaf.\nBake in the preheated oven for 45 minutes. While meatloaf is baking, whisk brown sugar, mustard, and cider vinegar together in a small bowl. Spread brown sugar glaze over the top of the meatloaf and continue baking until no longer pink in the center, about 30 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "MSjHx.sJ4EB6XWiSazzYLnW6.2dxtpa"
    },
    {
        "title": "Tater Tots® Nachos",
        "ingredients": [
            "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater Tots®) ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 cup spicy nacho cheese sauce ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup diced onion ADVERTISEMENT",
            "1/4 cup jalapeno pepper slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nArrange potato nuggets in a single layer on a baking sheet.\nBake potato nuggets in the preheated oven until golden and heated through, 24 to 26 minutes.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir water and taco seasoning mix into beef; cook and stir until liquid is thickened, 2 to 3 minutes.\nPour cheese sauce into a microwave-safe bowl; heat in the microwave for 30 seconds, stir. Continue heating in 15-second intervals until hot, stirring between intervals.\nSpread potato nuggets on a serving plate. Top with meat, cheese sauce, sour cream, onion, and jalapeno slices.\n",
        "picture_link": "ZnyjBVasrcvsCmhpp6tnmVusSUfKI9e"
    },
    {
        "title": "Salted Caramel Banana Bread",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "Bread: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1 cup packed light brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 ripe bananas, mashed ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1/4 cup packed light brown sugar ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "2 tablespoons heavy whipping cream ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x5-inch loaf pan with cooking spray.\nWhisk flour, baking powder, and 1/2 teaspoon salt together in a bowl.\nBeat 1/2 cup butter and 1 cup brown sugar together in a bowl using an electric mixer until light and fluffy. Add eggs, 1 at a time, beating just until combined. Beat bananas and 1 tablespoon vanilla extract into butter mixture. Gradually add flour mixture, beating on low speed, just until incorporated. Pour batter into prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 45 to 55 minutes. Cool in the pan for 20 minutes. Run knife around edges of bread and transfer to a wire rack.\nHeat 1/4 cup brown sugar and 2 tablespoons butter in a saucepan over medium heat; bring to a boil. Cook, stirring constantly with a whisk, until sugar is dissolved, about 1 minute. Stir cream into brown sugar mixture and remove saucepan from heat. Stir 1/3 cup confectioners' sugar and 1/4 teaspoon salt into cream mixture until glaze is smooth. Drizzle glaze over loaf.\n",
        "picture_link": "9lE//PAj28I3RrtEVNyVuKLWcHICohK"
    },
    {
        "title": "Jumbo Shells with Asparagus, Prosciutto, Ricotta Cheese and Three Cheese Sauce",
        "ingredients": [
            "3/4 (16 ounce) box Barilla® Jumbo Shells ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 (9 ounce) package frozen cut asparagus, chopped and cooked ADVERTISEMENT",
            "1 1/2 cups chopped prosciutto ADVERTISEMENT",
            "1/2 cup freshly grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 (24 ounce) jar Barilla® Three Cheese Sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook shells according to package directions. Rinse cooked shells under cold water and drain. Cover and set aside.\nPreheat oven to 350 degrees F.\nMix together ricotta cheese, mozzarella cheese, asparagus, prosciutto, Parmigiano Reggiano cheese, salt, garlic powder, and black pepper in medium bowl.\nPour 1 cup of Barilla Three Cheese Sauce into 9x13-inch baking dish.\nFill each shell with one heaping tablespoon of filling; place in baking dish.\nPour remaining sauce over shells. Cover with foil.\nBake for 45 minutes or until thoroughly heated. Let stand 5 minutes before serving.\n",
        "picture_link": "pd9uCTVXoV8i8Z8mwccxxRr3VJBkmgu"
    },
    {
        "title": "Refried Bean and Cheese Enchiladas",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 (16 ounce) cans refried beans ADVERTISEMENT",
            "2 cups shredded Mexican cheese blend, divided ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "12 small corn tortillas ADVERTISEMENT",
            "2 (10 ounce) cans red enchilada sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch casserole dish with cooking spray.\nMix refried beans, 1 1/2 cup Mexican cheese blend, and onion in a microwave-safe bowl; heat in microwave until cheese is melted, about 1 minute.\nStack tortillas, 3 at a time, on a microwave-safe plate; heat in microwave until warmed, about 30 seconds. Repeat with remaining tortillas.\nPour enough enchilada sauce onto a small plate to cover. Quickly dip both sides of each tortilla in enchilada sauce. Spoon bean filling down the middle of each dipped tortilla and wrap tortilla around filling. Arrange filled tortillas in the prepared baking dish. Pour remaining enchilada sauce over filled tortillas and sprinkle remaining cheese over sauce layer. Cover dish with aluminum foil.\nBake in the preheated oven until sauce is bubbling and cheese is melted, 35 and 40 minutes.\n",
        "picture_link": "i17iV3q/VeV.DbcJDPl.IGypet4i6D6"
    },
    {
        "title": "Eggnog Cookies II",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup eggnog ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 tablespoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nCombine the flour, baking powder, cinnamon and nutmeg. Mix well and set aside.\nCream together the sugar and butter. Add eggnog, vanilla and egg yolks and beat until smooth.\nAdd the flour mixture and mix until combined; be careful not to overmix.\nDrop by rounded teaspoonfuls onto ungreased baking sheets 1 inch apart. Sprinkle lightly with nutmeg. Bake for 23 to 25 minutes or until bottoms turn light brown. Transfer to cool, flat surface immediately with a spatula.\n",
        "picture_link": "dIBNbKSkRMA338llJv8PNfcyml98vsK"
    },
    {
        "title": "Wrapped Mexican Eggs",
        "ingredients": [
            "1 1/2 pounds tomatillos, husked and cut in half ADVERTISEMENT",
            "2 cloves garlic, halved ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "1/3 cup chopped fresh cilantro ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "4 tomatoes, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 green bell pepper, thinly sliced ADVERTISEMENT",
            "16 eggs, beaten ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "8 (12 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMake the salsa: In a blender or food processor puree tomatillos, garlic, onions, cilantro, water, jalapeno pepper and salt. In a saucepan, bring the salsa to a simmer. Simmer for 5 minutes. Transfer the salsa into a bowl and set the bowl aside.\nMake the filling: Put the chopped tomatoes into a sieve, and let them drain for 10 minutes or more.\nIn a large skillet, heat the oil over medium heat. Add the bell peppers, and saute them until they are soft, about 5 to 10 minutes. Add the eggs, and turn the heat to low. Stirring occasionally with a wooden spoon, let the eggs cook until they begin to set. Take the skillet off the heat and sprinkle in the salt, pepper, 1 cup Monterey Jack cheese and the drained tomatoes; stir gently.\nLay a flour tortilla on a work surface. Spread about 2/3 cup of the egg filling down the middle of the tortilla. Drop 1 tablespoon of the sour cream on top of the eggs. Fold in the sides of the tortilla to partly cover the egg mixture, then roll the tortilla, folding in the outer edges as you roll, to enclose the egg mixture completely. Continue this process with the remaining filling and the tortillas.\nPlace the filled tortillas close together in a 10x16 inch casserole dish. At this point you can cover the dish and chill it for up to 24 hours.\nPour the salsa over the filled tortillas, and sprinkle them with the 1/2 cup grated cheese. Cover the dish with foil, and bake the casserole for 15 minutes (25 minutes if it has been chilled). Serve hot.\n",
        "picture_link": "dokhUe7.ftrNXHMYtNpq3UUL/VeXkA6"
    },
    {
        "title": "Springerle I",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup anise seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs in large mixing bowl until very light.\nAdd sugar and butter. Cream together until light and fluffy.\nSift flour, baking powder, and salt. Add dry ingredients and combine.\nKnead dough until smooth ... add more flour to get a smooth dough if necessary.\nCover dough and allow to chill in refrigerator for at least 2 hours.\nRoll onto slightly floured board to 1/2 inch thickness. Then roll again with springerle roller to make designs. Cut at border. Sprinkle anise seed on clean tea towel and place cookies on this. Allow to stand overnight (don't cover) to dry.\nBake 12 to 15 minutes at 325 degrees F (170 degrees C).\nCool completely. Store in tight tin container ... the longer they are stored, the more anise flavor they take up.\n",
        "picture_link": "Q2Lj2mC75Z4mB/baVPpENPC1zEKQWki"
    },
    {
        "title": "Sugarless Cookies II",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup unsweetened applesauce ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix dry ingredients, then add remaining ingredients. Dough will be thin.\nDrop by teaspoonfuls onto cookie sheet. Bake for 10 to 12 minutes.\n",
        "picture_link": "4IeSKMZaB9p2An9OT5Ues52MVebOM3m"
    },
    {
        "title": "Double Nut Chocolate Chip Cookies",
        "ingredients": [
            "1 (18.25 ounce) package moist yellow cake mix ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F. Grease cookie sheets.\nMelt the butter in a sauce pan over low heat. Pour into bowl and combine with cake mix and egg. Beat on low with an electric mixer until blended.\nStir in chocolate chips, pecans and 1/4 cup of almonds.\nShape dough into balls. Press top of ball in remaining almonds.\nBake for 9-11 minutes or until lightly browned.\n",
        "picture_link": "kmcC.j3zCZMx6.VlKI2OVymh2tHHA6e"
    },
    {
        "title": "Carrot Bars",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup grated carrots ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (160 degrees C). Grease a 9x13 inch baking pan.\nIn a small saucepan, combine sugar, carrots, spices, raisins, water, orange juice and butter. Bring to a boil, reduce heat and simmer for 5 minutes. Pour mixture into a large bowl and cool to lukewarm. Add flour, baking soda, and salt to the carrot mixture. Mix well, and stir in walnuts.\nBake for 35 to 40 minutes in the preheated oven, or until a toothpick comes out clean.\n",
        "picture_link": "VejLe/ayoVeznLowfKBirF3ZWkZBvk6"
    },
    {
        "title": "Dawn's Sugar Cookies",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "3 drops red food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper.\nIn a large bowl, cream together the shortening and white sugar until smooth. Beat in eggs one at a time, and stir in vanilla. Combine the flour, baking powder, and baking soda; stir into the creamed mixture alternately with the buttermilk until a soft dough forms. Drop by teaspoonfuls onto prepared cookie sheets.\nBake for 10 minutes in preheated oven, or until light brown. Cool on wire racks.\nIn a medium bowl, blend together melted butter and confectioners' sugar until smooth. Gradually stir in milk until frosting reaches the desired consistency. Mix in food coloring, if desired. Spread onto cooled cookies, and place frosted cookies on waxed paper or cooling racks until frosting is set.\n",
        "picture_link": "SRQpRGKFhoQ3MjFTfiV171UlG4GMAQ."
    },
    {
        "title": "Belgian Christmas Cookies",
        "ingredients": [
            "2/3 cup butter ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup finely chopped blanched almonds ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons red decorator sugar ADVERTISEMENT",
            "2 teaspoons green decorator sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large bowl, cream together the butter and brown sugar. Add eggs, one at a time, beating thoroughly after each addition, then stir in the almond extract. Sift flour, baking powder, and salt together; stir into the creamed mixture until well blended. Turn into a greased 15x10x1 inch jelly roll pan and spread evenly to edges.\nSprinkle a mixture of almonds and cinnamon over batter, then sprinkle with a mixture of red and green sugars.\nBake for 10 to 12 minutes in the preheated oven, until the edges start to pull away from the sides of the pan. Cut into bars while still warm.\n",
        "picture_link": "8JAVCqlrTt9IN.fNsBOVtVPutp6g/h."
    },
    {
        "title": "Apple Pie Slices",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "9 apple - peeled, cored and sliced ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a medium bowl, stir together the flour, 2 tablespoons of sugar, and salt. Cut in the shortening until the mixture resembles coarse crumbs. Combine the egg yolks and 1/2 cup of milk, stir into the flour mixture.\nOn a lightly floured surface, roll half of the dough out to the size of the prepared pan. Cover the inside of the pan with the dough. Spread dough with a light coating of egg white. Fill with sliced apples and sprinkle sugar and cinnamon on top. Roll out remaining dough and place on top of apples. Brush with a light coating of egg white.\nBake for 35 to 40 minutes in the preheated oven, until the crust is golden. In a small bowl, beat together the confectioners' sugar, salt, vanilla and milk until smooth. Drizzle over cooled bars, cut into squares.\n",
        "picture_link": "XRt43QbBi2ZlJaXT0Ydl9PLBefxkXaW"
    },
    {
        "title": "Pfeffernusse",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup finely chopped almonds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nCombine dry ingredients and set aside.\nIn a separate bowl, beat butter and sugar together until light. Add eggs one at a time, beating well after each addition.\nStir in dry ingredients 1/2 cup at a time. Add almonds, if desired.\nRoll into one inch balls and arrange 1 inch apart on ungreased baking sheet. Bake 11 to 14 minutes.\nCool and store in airtight containers for 3 days to mellow flavors.\n",
        "picture_link": "7uvMVsWL8Uv8PZwXx5Vm.eurCxQkqLK"
    },
    {
        "title": "Peanut Butter Shortbread Cookies",
        "ingredients": [
            "2 cups natural peanut butter ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nMix in the order given. Spoon onto cookie sheet and gently press into cookie shape. Bake for 10 to 15 minutes until golden. NOTE: You can add choclate chips to half the recipe for an awesome taste.\n",
        "picture_link": "q8fYhVnrTJ6pNBt49fD/v2jBMAuBSzC"
    },
    {
        "title": "Digestive Biscuits",
        "ingredients": [
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 tablespoon rolled oats ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "4 tablespoons brown sugar ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a large bowl, sift together the flour and baking powder. Mix in the oatmeal. Cream together the butter and the sugar and add to mixture. Stir in the milk until mixture forms a thick paste.\nKnead dough on a floured surface until smooth. Roll out dough to approximately 1/8\" thickness. Cut into rounds with cookie cutter about 2 1/2 inches in diameter. Transfer to cookie sheets and prick with a fork.\nBake 15 to 18 minutes, or until golden. Let cool on wire rack. Store in an airtight tin.\n",
        "picture_link": "cNy/RrGEExOw8zIbpRBH5POWvF.AmUS"
    },
    {
        "title": "Cranberry Fudge",
        "ingredients": [
            "1 (12 ounce) package fresh or frozen cranberries ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup evaporated milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line bottom and sides of an 8x8 inch pan with plastic wrap. Set aside.\nIn a medium saucepan, bring cranberries and corn syrup to a boil. Boil on high for 5 to 7 minutes, stirring occasionally, until the liquid is reduced to about 3 tablespoons. Remove from heat.\nImmediately add chocolate chips, stirring untill they are melted completely. Add confectioner's sugar, evaporated milk, and vanilla extract, stirring vigorously until mixture is thick and glossy. Pour into pan. Cover and chill untill firm.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hamantashen II",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "5 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 (21 ounce) can apple pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs, add oil and mix. Add the sugar, vanilla, baking powder and salt. Add the flour gradually and mix well.\nRefrigerate a few hours or overnight.\nKneed dough until it becomes soft enough to roll. Cut dough with three inch cup or three inch round cookie cutters. Put about 1 tablespoon of pie filling into the middle of each circle. Fold up the edges of the circle into the middle and pinch together.\nBake at 350 degrees F (180 degrees C) for 20 minutes.\n",
        "picture_link": "f7gzqmQZ4HpROmsCiMxVQcZ1lMeKQqi"
    },
    {
        "title": "Spicy Pumpkin Pie II",
        "ingredients": [
            "2 cups canned pumpkin puree ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C.)\nIn a large bowl, combine pumpkin puree, milk, cream, brown sugar and white sugar. Mix in the cinnamon, salt, nutmeg, ginger and cloves. Beat in the flour and eggs. Pour filling into pie shell.\nBake for 10 minutes at 450 degrees F (230 degrees C) then reduce the temperature to 350 degrees F (175 degrees C) and bake for 50 minutes, or until filling has set.\n",
        "picture_link": "uYSlN77fVAKr.38cqHVqMk.u/pkDNxy"
    },
    {
        "title": "Lauren's Sugar and Spice Black Pepper Cookies",
        "ingredients": [
            "1 (10 ounce) package cinnamon swirl coffee cake mix ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Remove the cinnamon packet from the mix and reserve 1/3 cup for later.\nIn a large bowl, stir together the cake mix, the rest of the packet of cinnamon, cloves, nutmeg and black pepper. Mix in the egg and shortening until a dough forms. Form dough into 1 inch balls, roll the balls in the reserved cinnamon packet and place them 2 inches apart onto ungreased cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, until the tops are cracked and puffy. Let cookies set on cookie sheets until completely cool.\n",
        "picture_link": "Dn.g7SkmPlIN6ckZsmxKw5KLH4sgHz6"
    },
    {
        "title": "Welsh Rabbit ",
        "ingredients": [
            "4 tablespoons butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon dry mustard ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 2 quart saucepan over low heat, melt the butter. Stir in and blend the flour, salt, mustard and pepper. Stir in the milk and Worcestershire sauce. Continue stirring the mixture for 10 minutes, or until thickened.\nStirring continuously, melt the cheese into the mixture and blend well. Serve immediately over warm toast.\n",
        "picture_link": "NeG1WmAsVlBzmuvJHSwCISoY//kjA72"
    },
    {
        "title": "Tortilla Rollups III",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (4 ounce) can diced green chile peppers ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "10 (10 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the cream cheese and green chile peppers.\nSpread the cream cheese mixture evenly on the tortillas. Roll up each tortilla individually. Slice rolled tortillas into bite sized pieces. Dip the pieces in salsa and enjoy!\n",
        "picture_link": "ccrVzhWVTkMyfVp2WE64GFBMmmKzOzC"
    },
    {
        "title": "Tofu Mayo",
        "ingredients": [
            "1 (10.5 ounce) package firm silken tofu ADVERTISEMENT",
            "1 1/2 teaspoons distilled white vinegar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine tofu, vinegar, salt, mustard and sugar. Blend until smooth. Keep refrigerated.\n",
        "picture_link": "S.hcX.467O0Z9VL053XzSdFtRttlMB6"
    },
    {
        "title": "Homemade Italian Sauce",
        "ingredients": [
            "1 (16 ounce) can whole tomatoes ADVERTISEMENT",
            "5 cloves garlic, peeled ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 white onion, chopped ADVERTISEMENT",
            "1 pound mushrooms, sliced ADVERTISEMENT",
            "1 (16 ounce) can crushed tomatoes ADVERTISEMENT",
            "8 ounces tomato paste ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "1 tablespoon dried basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender chop the whole tomatoes with juice and garlic until chunky. In a medium size pot, heat oil on medium high heat. Put onion and mushroom in and saute for about 5 minutes.\nPlace in pot the blended tomatoes, crushed tomatoes, tomato paste, chopped green peppers, oregano and basil. Bring to boil, then lower to medium low, cover and stir periodically. Cook and reduce about 1 to 2 hours or to your liking.\n",
        "picture_link": "widTuAsPpuGW2YGXUfXdKfDDwvb.dXq"
    },
    {
        "title": "Applesauce Bread III",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "2 1/4 cups bread flour ADVERTISEMENT",
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "2/3 cup warm applesauce ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1/2 cup apple juice ADVERTISEMENT",
            "1/2 cup shredded fresh apple, room temperature ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select White Bread cycle; press Start.\n",
        "picture_link": "v/raXPUbJiKA0jsJlwlW2LmEjPal7c."
    },
    {
        "title": "Crabby Cliff's Mushroom Puffs",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cups fresh chopped mushrooms ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1 (6 ounce) can crabmeat, drained and flaked ADVERTISEMENT",
            "1 (17.5 ounce) package frozen puff pastry sheets, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nHeat the olive oil in a medium saucepan over medium heat. Stir in the mushrooms, green onions, garlic and cayenne pepper. Cook 10 minutes, or until tender. Transfer the mushroom mixture to a medium bowl. Blend in the cream cheese and crabmeat.\nOn a lightly floured flat surface, roll each pastry sheet into a 12x12 inch square. Cut each sheet into nine 4x4 inch squares. Place 1 tablespoon of the mushroom mixture onto each pastry square. Fold the squares by bringing the corners to the center, creating an X. Place the squares on a medium baking sheet.\nBake 20 minutes in the preheated oven, or until golden brown.\n",
        "picture_link": "1Ec.R.qJVnOP1QJq1zcXNubHoIRaej."
    },
    {
        "title": "Mustard Oil Dressing",
        "ingredients": [
            "1 1/2 tablespoons prepared Dijon-style mustard ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "1 pinch onion powder ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a jar with a lid, combine the mustard, vegetable oil, vinegar, pepper, salt, garlic salt, onion powder and olive oil. Cover and shake until thoroughly combined. Chill until ready to serve.\n",
        "picture_link": "/0blBQGo2Qd4genTn12cfHIq/CP6.wm"
    },
    {
        "title": "Semolina Pudding",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup semolina flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, combine water, milk, sugar and cinnamon. Bring to a boil and remove from heat. Remove cinnamon stick.\nIn another saucepan, melt butter over medium heat. Allow it to bubble, but not to brown. Reduce the heat to low and stir in the semolina, a little at a time, until mixture is thick and smooth. Allow it to brown slightly, then stir in the milk mixture, a little at a time. Continue to stir until mixture has progressed from creamy to thick.\nPlace halva in a gelatin mold or glass dish. Serve warm or cold.\n",
        "picture_link": "cnM5AryJ7E2L09Kr/ZUwbR3lSnzU9ni"
    },
    {
        "title": "Vegetable Pasta Salad II",
        "ingredients": [
            "1 zucchini, cubed ADVERTISEMENT",
            "1 eggplant, cubed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 clove minced garlic ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (12 ounce) package rotini/corkscrew pasta ADVERTISEMENT",
            "2 chopped tomatoes ADVERTISEMENT",
            "3 ounces diced feta cheese ADVERTISEMENT",
            "1 cup Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine zucchini, eggplant, onion, bell pepper and garlic in a baking dish. Toss with olive oil. Bake for about 20 minutes. Remove from oven and cool.\nBring a large pot of lightly salted water to a boil. Add rotini pasta and cook for 8 to 10 minutes or until al dente; drain and rinse with cold water.\nIn a bowl combine vegetable mixture, cooled pasta, tomatoes, Feta cubes, and salad dressing; toss until well mixed.\n",
        "picture_link": "8/Jl5T6F/FYTm866ipDAP0ZCG5G.iBO"
    },
    {
        "title": "Zucchini Chive Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1 cup shredded zucchini ADVERTISEMENT",
            "3 tablespoons chopped fresh chives ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix cream cheese and milk until well blended. Mix in the zucchini, chives and salt. Chill in the refrigerator approximately 1 hour before serving.\n",
        "picture_link": "Y5zKTfww0jGjT/yI2/B1RLAps.6VT3G"
    },
    {
        "title": "Grandma's Strawberry Milkshake",
        "ingredients": [
            "4 ounces strawberries, hulled ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "6 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine ice cubes, strawberries, milk and honey. Blend until smooth. Pour into glass and enjoy!\n",
        "picture_link": "EanGg3PClvmw5T9eCmFrYKpd8ey/E7C"
    },
    {
        "title": "German-Style Beet Salad",
        "ingredients": [
            "2 bunches beets ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "2 tablespoons caraway seeds ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "1 teaspoon prepared horseradish ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "5 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash beets and trim off greens. Bring a medium pot of salted water to a boil, add beets and cook, covered, until beets are tender. Remove from heat, drain, and peel and slice when cool.\nIn a large bowl, whisk together the water, vinegar, caraway seeds, sugar, onion, horseradish, cloves, salt, pepper and oil. Add beets and toss to coat. Let stand for several hours, stirring occasionally. Serve at room temperature or chilled, as desired.\n",
        "picture_link": "WisZTSkDFu1IYZBPvOljVhxNovt9FkK"
    },
    {
        "title": "Cucumber Salsa ",
        "ingredients": [
            "2 cucumbers - peeled, seeded and chopped ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the cucumber, sour cream, yogurt, parsley, cilantro, cumin and salt. Mix well. Cover and refrigerate for 2 hours before serving.\n",
        "picture_link": "E9DFGAujYwvAcslNibHolT7hjQsslLC"
    },
    {
        "title": "Salad Dressing Chocolate Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 cup creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1 cup lukewarm water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nMix flour, sugar, baking soda, vanilla extract, cocoa powder, creamy salad dressing, and water in a large bowl. Pour into the greased baking dish.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "MCylw8V78DTEMZrnAb14FNC0uSA3hZW"
    },
    {
        "title": "Stuffed Leg of Lamb",
        "ingredients": [
            "1 (5 pound) boneless leg of lamb ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 (10 ounce) bag fresh spinach leaves ADVERTISEMENT",
            "6 ounces goat cheese, or more if needed ADVERTISEMENT",
            "2 teaspoons pine nuts ADVERTISEMENT",
            "kitchen twine ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon fennel seeds ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove plastic netting or twine from around the leg of lamb, if any, and open up the roast on a cutting board. Place the boned side of the roast up. With a sharp paring knife, cut away any excess fatty areas. Use a sharp knife to cut 1/2-inch deep slits in the meat about 2 inches apart, to help the meat lie flat. Cover the meat with a sturdy piece of plastic wrap or a cut-apart food storage bag, and pound the meat with a mallet or the edge of a small plate until the roast is about 3/4 inch thick everywhere, and 10 to 14 inches square.\nPreheat an oven to 400 degrees F (200 degrees C).\nSprinkle the upper side of the meat with salt and pepper, and then spread spinach leaves over the top of the roast to within 1/2 inch of the edges. Break up the goat cheese and sprinkle it evenly over the spinach, then sprinkle the pine nuts over the cheese.\nRoll the roast up into a tight cylinder, and tie the roast together with kitchen twine at 2 inch intervals. It's okay if a little stuffing protrudes from the sides of the roast.\nIn a flat dish, mix together the flour, 1 tablespoon of salt, 1 tablespoon of pepper, the thyme, and the fennel seeds, and press the tied roast firmly into the flour mixture to coat all sides.\nHeat the sesame oil in a heavy oven-proof or cast-iron skillet over medium-high heat until the oil shimmers, and sear all sides of the roast, including the ends, to a golden brown color. Lay the roast into the skillet, place into the preheated oven, and roast to your desired degree of doneness, or an internal temperature of 145 degrees F (65 degrees C) for medium, about 40 minutes. Remove from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area 10 to 15 minutes before slicing.\n",
        "picture_link": "cH3n9UgyjVQtMyb7mBvP6aSfm.cxcDi"
    },
    {
        "title": "Maja Blanca (Coconut Pudding)",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup cornstarch ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup fresh sweet corn kernels ADVERTISEMENT",
            "1/4 cup sweetened flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter an 8-inch baking dish or pie pan, and set aside. Mix 1/2 cup of water with the cornstarch in a bowl, and stir until smooth.\nCombine the coconut milk, 3/4 cup of water, and sugar in a saucepan over low heat, and stir until the sugar is dissolved. Bring the mixture to a boil, add the corn kernels, and then stir in the cornstarch mixture, stirring quickly to avoid lumps as it becomes very thick. Bring the mixture back to a boil, and simmer until fully thickened and smooth, stirring constantly, about 2 minutes. Pour the maja blanca into the prepared dish, and set aside to cool until firm, about 2 hours.\nPlace the coconut flakes in a dry skillet over medium heat, and stir to toast. Watch them carefully so they don't burn. Remove the toasted coconut flakes to a bowl, let cool, and sprinkle over the pudding before serving.\n",
        "picture_link": "EoDoYTnLr40fh/H4quowTUt.7e9r/NS"
    },
    {
        "title": "Finger Lickin' Onion Dip",
        "ingredients": [
            "2 1/2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1 large yellow onion, halved and sliced thin ADVERTISEMENT",
            "1/2 teaspoon salt, or more to taste ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "1 pinch brown sugar (optional) ADVERTISEMENT",
            "1 1/2 ounces fresh goat cheese, crumbled ADVERTISEMENT",
            "2 1/2 cups sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter with the olive oil in a shallow skillet over medium heat; cook the onion in the butter and oil until translucent. Season with salt, pepper, basil, paprika, tarragon, and brown sugar. Reduce heat to medium; cook and stir until the onions have softened and caramelized, 10 to 15 minutes. Remove from heat and set aside to cool.\nMix the goat cheese and sour cream together in a bowl; stir the onions into the mixture.\n",
        "picture_link": "fd6/HFPxssbvfjAI.dFQyLA4ziMZ962"
    },
    {
        "title": "Smoked Salmon Pasta Salad",
        "ingredients": [
            "11 ounces multi-colored fusilli pasta ADVERTISEMENT",
            "1 small carrot, grated ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 cup diced cucumber ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "8 ounces smoked salmon, cut into 3/4 inch pieces ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Stir in the fusilli; return to a boil. Cook the pasta uncovered, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well and rinse with cold water. Transfer cooled pasta to a large bowl.\nToss the carrot, onion, cucumber, celery, and salmon with the pasta; mix well.\nCombine the mayonnaise, lemon juice, salt, pepper, and cayenne pepper in a small bowl; mix well. Pour sauce over pasta mixture. Mix well to coat evenly.\n",
        "picture_link": "MOb4MokjQZ0UqbxBP4Mf6IoVf/gcyZC"
    },
    {
        "title": "White Bean Breakfast",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon minced jalapeno pepper, or more to taste ADVERTISEMENT",
            "1 (15.5 ounce) can white beans, drained and rinsed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon oregano ADVERTISEMENT",
            "1 pinch ground turmeric ADVERTISEMENT",
            "2 tablespoons pesto ADVERTISEMENT",
            "Kosher salt to taste ADVERTISEMENT",
            "2 slices rye bread, toasted ADVERTISEMENT",
            "1 wedge lemon ADVERTISEMENT",
            "1/4 teaspoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium-high heat. Crack eggs into the melted butter and cook to desired firmness, 5 to 7 minutes.\nHeat 1 tablespoon olive oil in a separate skillet over medium heat; cook the garlic and jalapeno pepper in the hot oil until fragrant, about 2 minutes. Stir the white beans, 2 tablespoons olive oil, oregano, and turmeric into the garlic mixture; cook and stir until the olive oil is mostly absorbed, about 5 minutes. Stir the pesto into the mixture and remove the skillet from the heat; season with salt. Top each slice of rye toast with about half of the bean mixture. Squeeze the lemon wedge over the beans. Place one of the fried eggs atop each portion and sprinkle with Parmesan cheese to serve.\n",
        "picture_link": "02qMriyE6g9aeRvJ6k5ZhCwfQwCpPhm"
    },
    {
        "title": "Monkey Banana Jam",
        "ingredients": [
            "3 cups white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "6 tablespoons fresh lemon juice ADVERTISEMENT",
            "3 1/2 cups mashed banana ADVERTISEMENT",
            "1 tablespoon whole cloves ADVERTISEMENT",
            "6 half pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the sugar and water in a saucepan; bring to a boil, and boil for 10 minutes. Stir in the lemon juice, mashed banana, and cloves. Reduce heat to low; simmer, stirring frequently, until the mixture thickens, about 45 minutes. Strain to remove cloves.\nDivide the jam between the jars, screw on lids, and refrigerate.\n",
        "picture_link": "qcfhZtLKFsXNhSrSzSuEzU.Q3kCTJV2"
    },
    {
        "title": "Orange Glazed Chicken Wings",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "18 chicken wings, tips removed and wings cut in half at joint ADVERTISEMENT",
            "1/2 cup orange marmalade ADVERTISEMENT",
            "1/4 cup Dijon mustard ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium-high heat. Add the wing pieces, and fry until golden brown on all sides, about 6 to 10 minutes.\nSpoon off any excess fat, and add the orange marmalade, mustard, and soy sauce to the skillet, stirring to blend the ingredients and coat the wing pieces. Simmer on medium heat 8 to 10 minutes, until the sauce thickens and glazes the wings. Serve hot.\n",
        "picture_link": "Bm2j5CGp3CMKNzI76udshKHhxXRRfRi"
    },
    {
        "title": "Baked Tuna 'Crab' Cakes",
        "ingredients": [
            "2 (12 ounce) cans chunk light tuna in water, drained and flaked ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 zucchini, shredded ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1/2 cup green onions, chopped ADVERTISEMENT",
            "2 cloves garlic, pressed or minced ADVERTISEMENT",
            "1 teaspoon finely chopped jalapeno pepper ADVERTISEMENT",
            "1/2 cup nonfat cottage cheese ADVERTISEMENT",
            "1/4 cup fat free sour cream ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup yellow cornmeal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil, and spray with cooking spray.\nIn a large bowl, thoroughly mix the tuna, bread crumbs, zucchini, green pepper, onion, green onions, garlic, jalapeno pepper, cottage cheese, sour cream, 2 eggs, lime juice, dried basil, pepper, and salt.\nBeat 2 eggs in a shallow bowl, and place the cornmeal on a plate.\nScoop up about 1/4 cup of the tuna mixture, and gently form it into a compact patty. Dip both sides of each cake into beaten egg and then press into cornmeal, and place the cakes onto the prepared baking sheet. Spray the tops of the cakes with cooking oil spray.\nBake in the preheated oven until the tops of the cakes are beginning to brown, about 20 minutes. Flip each cake, spray with cooking spray, and bake until the cakes are cooked through and lightly browned, about 20 more minutes.\n",
        "picture_link": "i5giPFTE8cF2q0HN7ecFatI0Poo9MFe"
    },
    {
        "title": "Orzo Ham Salad",
        "ingredients": [
            "2/3 cup uncooked orzo pasta ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon yellow mustard ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups chopped fully cooked ham ADVERTISEMENT",
            "1 cup diced red onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup halved cherry or grape tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the orzo, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain and rinse with cold water in a colander set in the sink.\nWhisk together the mayonnaise, sour cream, cider vinegar, Dijon and yellow mustard, chives, sugar, black pepper, and salt in a bowl.\nPlace the cooked and cooled pasta, ham, red onion, green pepper, and tomatoes in a large bowl. Toss together with the dressing. Cover and refrigerate for 30 minutes before serving.\n",
        "picture_link": "HIPAb.bqfSbandNoLpMtuh2PooNrdJy"
    },
    {
        "title": "Irish Beef Stew with Guinness® Beer",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 pounds beef stew meat, cubed ADVERTISEMENT",
            "3 cups stout beer (such as Guinness®) ADVERTISEMENT",
            "2 potatoes, peeled and sliced ADVERTISEMENT",
            "2 potatoes, peeled and quartered ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium heat. Stir in the onion, garlic, salt, and pepper. Cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the beef, beer, sliced potatoes, and quartered potatoes. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the beef is tender, about 2 hours. Season to taste with salt and pepper before serving.\n",
        "picture_link": "Z9eX1V.L4dVWZ9qn8EgArX.co7iWIVG"
    },
    {
        "title": "Don't Chicken Out",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 pounds chicken legs ADVERTISEMENT",
            "4 cups tomato sauce ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a skillet over medium heat; cook the chicken in the hot oil until lightly browned on all sides.\nWhisk the tomato sauce, garlic, onion, bay leaves, cumin, oregano, and vinegar in a bowl; pour over the chicken. Bring the mixture to a simmer and continue cooking until the chicken is no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "rBwoe5r.gH6OtMJjOGfyn5cQc/cCn4q"
    },
    {
        "title": "Bayou's Bodacious Pork Rub",
        "ingredients": [
            "5 tablespoons kosher salt ADVERTISEMENT",
            "6 tablespoons paprika ADVERTISEMENT",
            "10 tablespoons dark brown sugar ADVERTISEMENT",
            "3 tablespoons file powder (powdered sassafras leaves) ADVERTISEMENT",
            "2 tablespoons ground dried thyme ADVERTISEMENT",
            "2 tablespoons dried dill weed ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "10 tablespoons garlic powder ADVERTISEMENT",
            "10 tablespoons onion powder ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "2 tablespoons dry mustard powder ADVERTISEMENT",
            "2 tablespoons ground allspice ADVERTISEMENT",
            "2 tablespoons ground dried sage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the salt, paprika, brown sugar, file powder, thyme, dill, oregano, basil, black pepper, garlic powder, onion powder, cayenne pepper, mustard, allspice, and sage in a bowl until evenly blended. Store the rub at room temperature in an airtight container.\nTo use: liberally coat pork butt or brisket with some of the rub, massaging it into the meat. Wrap tightly with plastic wrap and refrigerate for at least 24 hours. Smoke meat as you normally would.\n",
        "picture_link": "ZECPfrUUShSgaFe16Sgg7UGjpjA/ZE6"
    },
    {
        "title": "Grandpa's Tomato Gravy",
        "ingredients": [
            "8 slices bacon, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 (28 ounce) cans diced tomatoes ADVERTISEMENT",
            "1 (14 ounce) can tomato sauce ADVERTISEMENT",
            "1 teaspoon white sugar, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a Dutch oven, and cook over medium heat, stirring occasionally, until the fat starts to cook out, about 2 minutes. Add the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the diced tomatoes and tomato sauce to the pan. Season with sugar and black pepper. Simmer until the sauce is reduced by at least 1/4 and up to 1/3, 30 to 45 minutes. Stir in the butter just before serving.\n",
        "picture_link": "09KaXflYbRxgCEyY1qhAbBQGV6T4Nyy"
    },
    {
        "title": "Strawberry-Banana Smoothie",
        "ingredients": [
            "3/4 cup chopped strawberries ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "1 tablespoon honey, or to taste ADVERTISEMENT",
            "1 tablespoon wheat germ (optional) ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "3/4 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the strawberries and bananas together in a blender until pureed. Add the honey and wheat germ to the puree; blend until combined. Pour the milk into the mixture and blend to integrate. Finally, add the ice and blend until no large chunks of ice remain. Pour into tall glasses to serve.\n",
        "picture_link": "IKYf3EhCHQjarvV/PYvlZe.lPpJZoPC"
    },
    {
        "title": "Lemongrass Ground Beef Skewers",
        "ingredients": [
            "1/2 cup coarsely chopped lemon grass ADVERTISEMENT",
            "1 onion, coarsely chopped ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon oyster sauce ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\nPlace lemon grass, onion, and garlic in the container of an electric blender or food processor. Cover and blend or process until finely chopped, about 10 seconds. Scrape lemon grass mixture into a bowl, and stir in beef, salt, pepper, sugar, cornstarch, oyster sauce, and sesame oil.\nForm meat mixture into 12 meatballs. Thread onto skewers.\nCook on the preheated grill until the meatballs are well done, about 7 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\n",
        "picture_link": "iCSA4a8/R2.VrzHSOZNXd5USDZsdfua"
    },
    {
        "title": "Chinese Cocktail Buns",
        "ingredients": [
            "1/3 cup white sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup softened butter ADVERTISEMENT",
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup all-purpose flour, or more if needed ADVERTISEMENT",
            "1/4 cup softened butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup nonfat dry milk powder ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 cup finely grated fresh coconut ADVERTISEMENT",
            "1 egg (optional) ADVERTISEMENT",
            "1 tablespoon sesame seeds, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1/3 cup sugar and milk in a small saucepan, and stir until the sugar is dissolved. Add 1/4 cup softened butter, and gently warm the mixture until the butter melts and the mixture is warm but not hot (no warmer than about 100 degrees F (40 degrees C). In a large bowl, stir together the yeast with 2 1/2 cups flour until well blended, and pour the milk mixture into the flour-yeast mixture. Stir in 1 beaten egg, and mix until the mixture forms a sticky, wet dough.\nTurn the dough out onto a well-floured surface, and knead for about 10 minutes, gradually kneading in 1 cup of additional flour or as needed to make a smooth, elastic dough. Form the dough into a round ball, place into an oiled bowl, and turn the dough around in the bowl a few times to coat with oil. Cover the bowl with a cloth, and allow dough to rise in a warm place until doubled, about 1 hour.\nCream 1/4 cup softened butter with 1/2 cup of sugar in a bowl until the mixture is light and fluffy, and stir in dry milk powder, 1/2 cup flour, and the coconut until the mixture is smooth and well blended. Set the filling aside.\nWorking on a floured surface, punch down the dough, and cut into 2 equal pieces. Cut each piece into 8 equal-sized pieces (16 pieces total). Form each piece into an oblong bun, and flatten the bun with a floured rolling pin. Scoop up about 1 tablespoon of filling with a spoon, and place in the center of a bun. Pull and pinch the edges of the dough together to enclose the filling in the bun. Repeat with all dough pieces, and place the filled buns, seam sides down, onto the prepared baking sheets. Cover the buns with a cloth, and allow to rise in a warm place 1 hour.\nPreheat an oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper.\nFor a glossy coating, beat 1 egg in a bowl, and brush each bun with a little beaten egg. Sprinkle each bun with a few sesame seeds.\nBake in the preheated oven until the buns are golden brown, 10 to 15 minutes. Allow to cool before serving.\n",
        "picture_link": "sUx7.Pg2H49.GFF3HcrIKLeoOWWFmwq"
    },
    {
        "title": "Apple Cider Chicken Marinade",
        "ingredients": [
            "2/3 cup white wine ADVERTISEMENT",
            "1/3 cup extra-virgin olive oil ADVERTISEMENT",
            "3 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon fresh-ground black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the white wine, olive oil, lemon juice, cider vinegar, basil, parsley, rosemary, thyme, garlic, pepper, and salt in a bowl. Marinade chicken in mixture 8 hours or overnight.\n",
        "picture_link": "uCikExxY1q..kTQiFsZ8ZSSu8R6QZmy"
    },
    {
        "title": "Simply Sensational Chili",
        "ingredients": [
            "2 tablespoons Goya Extra Virgin Olive Oil ADVERTISEMENT",
            "1 cup onion, chopped ADVERTISEMENT",
            "1/2 cup green bell pepper, chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and roughly chopped (optional) ADVERTISEMENT",
            "2 teaspoons Goya Minced Garlic ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "Goya Adobo with Pepper, to taste ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon finely chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon dry ground cumin ADVERTISEMENT",
            "1 (28 ounce) can whole tomatoes, chopped ADVERTISEMENT",
            "1 packet Goya Powdered Beef Bouillon ADVERTISEMENT",
            "1 packet Sazon Goya with Coriander and Annatto ADVERTISEMENT",
            "1 (15.5 ounce) can Goya Pinto Beans, undrained ADVERTISEMENT",
            "Shredded Monterey jack cheese (optional) ADVERTISEMENT",
            "Sour cream (optional) ADVERTISEMENT",
            "Finely chopped white onions (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in medium, heavy-bottomed pot over medium-high heat. Add onions, peppers and garlic; cook until vegetables are soft, stirring occasionally, about 8 minutes. Season meat with Adobo. Add meat to the pot, breaking into small pieces with a wooden spoon. Cook until browned, stirring occasionally, about 8 minutes. Stir in chili powder, cilantro and cumin, cook until fragrant, about 1 minute more.\nAdd 1 cup water, chopped tomatoes (with liquid), beef bouillon and Sazon to pot. Bring tomato mixture to a boil. Lower heat to medium-low and simmer, uncovered, until mixture thickens and flavors come together, stirring occasionally, about 1 hour. Stir in beans. Cook until heated through, about 15 minutes more.\nDivide chili among serving bowls. Garnish with cheese, sour cream and onions, if desired.\n",
        "picture_link": "UFJoJGvQu.sSxeQ5dJs49zFzQ.pCBxy"
    },
    {
        "title": "Homemade Sour Cream",
        "ingredients": [
            "1/4 cup milk ADVERTISEMENT",
            "3/4 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the milk and vinegar and let stand for 10 minutes. Pour the heavy cream into a jar. Stir in the milk mixture, cover the jar, and let stand at room temperature for 24 hours. Chill before using.\n",
        "picture_link": "GVvAiMuX4PcIimYRZd2llLlaAXBrkiu"
    },
    {
        "title": "Easy Pheasant Casserole",
        "ingredients": [
            "1 (6 ounce) package dry bread stuffing mix ADVERTISEMENT",
            "4 tablespoons butter, melted ADVERTISEMENT",
            "1 1/2 cups hot water ADVERTISEMENT",
            "1 (10.5 ounce) can chicken gravy ADVERTISEMENT",
            "1 pound cooked pheasant, cubed ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the seasoning packet from the stuffing mix with the butter and water. Stir in the stuffing crumbs until all the liquid is absorbed.\nIn a separate 2 quart casserole dish, combine the gravy, pheasant, vegetables and thyme. Stir all together well , then spoon the stuffing mix over the top.\nBake at 350 degrees F (175 degrees C) for 45 minutes, or until hot and bubbly.\n",
        "picture_link": "5bj25R9nUJ.t9T0AFMu14v64wvGVBzW"
    },
    {
        "title": "Butterscotch Bread",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "4 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9x5 inch loaf pans.\nIn a large bowl, stir together the flour, baking soda, salt and brown sugar. Stir in the eggs, buttermilk and melted butter all at once. Mix just enough to moisten. Pour batter into prepared pans.\nBake in preheated oven for 60 minutes, or until golden brown and a tooth pick inserted into center of a loaf comes out clean.\n",
        "picture_link": "4MbWlESiCtbDybNCyDwUlyXkive66jO"
    },
    {
        "title": "Tropical Cooler Smoothie",
        "ingredients": [
            "1 cup orange juice ADVERTISEMENT",
            "2 cups pineapple chunks, drained ADVERTISEMENT",
            "1 banana, coarsely chopped ADVERTISEMENT",
            "1/4 cup skim milk ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine orange juice, pineapple chunks, milk, honey and crushed ice. Blend until smooth.\n",
        "picture_link": "Tu99yxrHdImu7OFD6BekVmamdfkDhsm"
    },
    {
        "title": "Most Spectacular Strawberry Pie",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "4 cups fresh strawberries, halved ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C.) Lay one crust into a 9 inch pie pan, making sure the edges extend slightly beyond the pan.\nIn a large bowl, mix together white and brown sugars, flour, cornstarch, cinnamon, nutmeg, vanilla and almond extract. Add the strawberries to the mixture and gently stir to coat thoroughly. Pour into the crust, mounding it slightly in the middle.\nCut the second crust into 1/2 inch strips and weave into a lattice over the filling. Roll up the extra dough on the bottom crust to seal down the lattice strips, then press with fingers to form a fluted edge. Dot with butter in the open squares. For a golden crust, brush lattice lightly with milk, then sprinkle with sugar.\nBake in the preheated oven for 35 to 40 minutes, or until golden brown.\n",
        "picture_link": "SCuwCwBYliEFzoRwpYo2DQOvq20xEDq"
    },
    {
        "title": "Chocolate Butter Cream Frosting",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup strong, hot, brewed coffee ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons dark rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put chocolate chips into a dry blender, and process into powder. Stop blender and scrape chocolate away from the sides and bottom. Pour in the hot coffee and blend until smooth. Add the sugar, yolks, butter and rum, blend until smooth, about 15 seconds.\n",
        "picture_link": "wseAA70gbH6r4Xo53P8QjfXFm2v0Mcm"
    },
    {
        "title": "Sour Cream Muffins",
        "ingredients": [
            "1/4 cup applesauce ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3/4 cup nonfat sour cream ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a muffin pan with paper muffin liners.\nIn a medium bowl, stir together the applesauce, sugar and eggs. Combine the flour and baking soda, add to the wet mixture and mix well. Stir in the sour cream, then fold in the berries. Spoon the batter into the prepared muffin cups. Cups should be at least 3/4 full.\nBake for 12 to 15 minutes in the preheated oven, until muffins spring back when touched lightly.\n",
        "picture_link": "T50LQl2b9j4rA0dorYkRNNFk0m.8.5O"
    },
    {
        "title": "Citrus Mousse",
        "ingredients": [
            "2 (12 ounce) containers frozen whipped topping, thawed ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/2 cup grapefruit juice ADVERTISEMENT",
            "1 (15 ounce) can mandarin oranges, drained (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat together whipped topping and condensed milk. Gradually beat in lemon and grapefruit juices, until evenly blended.\nPour the mousse into one bowl or divide it into individual serving dishes. Garnish with fruit, if desired.\n",
        "picture_link": "bMbyhkLY0euNzGDRha/L3tuK5kD724i"
    },
    {
        "title": "Bonbons",
        "ingredients": [
            "1 cup margarine, softened ADVERTISEMENT",
            "2 pounds confectioners' sugar, sifted ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 cups coconut ADVERTISEMENT",
            "1 cup finely chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (12 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, combine margarine, confectioners' sugar, condensed milk, coconut, chopped walnuts and vanilla. Stir well. Cover and chill in the refrigerator for 2 hours, or until mixture has thickened enough to roll into balls. Roll the mixture into 1-inch balls and place close together, but not touching, on cookie sheets. Freeze until hard.\nWhile bonbons are freezing, line a cookie sheet or flat surface with waxed paper. Combine chocolate chips and shortening in the top of a double boiler, over, not in, simmering water. Stir until melted. Using a toothpick or a fork, dip each bonbon in the melted chocolate. Place on waxed paper to dry. When chocolate has hardened, store bonbons in plastic bag in the freezer.\n",
        "picture_link": "5onGyO9HKYIzObhlVfGqFh1fG34XHjC"
    },
    {
        "title": "Bierrocks I",
        "ingredients": [
            "2 cups milk, lukewarm ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 medium head cabbage, chopped ADVERTISEMENT",
            "18 slices American cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon sesame seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Dough: In a large bowl, mix together milk and oil. Stir in eggs, yeast, sugar, salt and 5 cups of flour. Mix well adding remaining cup of flour as necessary to form kneadable dough. Knead for a few minutes, then cover bowl and let dough rise one hour in a warm place.\nTo Make Filling: Brown beef in a large saucepan; do not drain juices. Add onion and cabbage to skillet and continue cooking until onion is soft; add salt and pepper to taste. Let cool.\nAfter dough has risen, roll out hunks of dough (about the size of tennis balls) as thin as possible. Place 1/2 slice of cheese on dough, top with filling, then place other 1/2 of cheese on top of filling. Fold over and seal like a turnover (moistening edges with water may help seal them). Place on a baking sheet, brush with egg wash and, if desired, sprinkle with sesame seeds.\nBake in a preheated 350 degrees F (175 degrees C) oven for 30 minutes or until golden brown. Serve immediately or cool and freeze for later. To reheat frozen bierrocks simply bake until hot.\n",
        "picture_link": "At9FRTtCLz0/7iM4lrrunJjcQLkXWWS"
    },
    {
        "title": "Russian Tea II",
        "ingredients": [
            "2 cups instant tea with lemon-flavoring dry mix ADVERTISEMENT",
            "2 cups orange-flavored drink mix (e.g. Tang) ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix together tea, orange-flavored drink mix, sugar, cinnamon and cloves. To serve place 2 tablespoons mix in a cup and fill with 8 ounces hot water.\n",
        "picture_link": "fMA8uNITiNXg74Yi47mdbeaYO7S2I5."
    },
    {
        "title": "Black Bean Dip",
        "ingredients": [
            "1 (15 ounce) can black beans ADVERTISEMENT",
            "1/2 cup fat-free creamy salad dressing (ie: Fat Free Miracle Whip TM) ADVERTISEMENT",
            "1/2 cup reduced fat sour cream ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 dash hot pepper sauce, or to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/4 cup picante sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, mash the beans with a fork. Combine the salad dressing, sour cream, green chilies, cilantro, chili powder, garlic powder and hot pepper sauce. Blend well. Refrigerate for 30 minutes. Serve with the baked tortilla chips.\nSpray the tortillas lightly with olive oil, and sprinkle lightly with salt. Bake until crisp and lightly browned.\n",
        "picture_link": "YVSUDXVUFsJwKGxydXAKqfR.swqbknu"
    },
    {
        "title": "Strawberry Upside Down Cake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (6 ounce) package orange flavored Jell-O® mix ADVERTISEMENT",
            "2 (10 ounce) packages frozen strawberries, thawed ADVERTISEMENT",
            "1 (10.5 ounce) package miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan. Put a single layer of miniature marshmallows on the bottom of the pan.\nPrepare cake mix according to package instructions. Pour batter over marshmallows in pan.\nMix gelatin powder and strawberries in a medium bowl. Pour over cake batter in the pan.\nBake according to package instructions.\n",
        "picture_link": "4HZwF9h5gm2F8Ih7Ku6uZoqwVHBxGSm"
    },
    {
        "title": "Hop, Skip, and Go Naked",
        "ingredients": [
            "6 (12 fluid ounce) cans or bottles beer ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "1 pint whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a gallon container, combine beer, lemonade concentrate and whiskey. Stir and serve over ice.\n",
        "picture_link": "UN.9r18Ahesf.CSzXuU/IxUOT5hFHzi"
    },
    {
        "title": "Swiss White Chocolate Cake",
        "ingredients": [
            "8 (1 ounce) squares white chocolate ADVERTISEMENT",
            "1/2 cup hot water ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "4 egg whites, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift together the flour and baking soda; set aside.\nChop the white chocolate and place it in a medium bowl. Pour the hot water over it and stir until chocolate is melted and smooth. Allow to cool to room temperature.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the egg yolks one at a time, then stir in the melted white chocolate and vanilla. Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated.\nIn a large glass or metal mixing bowl, beat egg whites until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain.\nPour batter into prepared pan. Bake in the preheated oven for 30 to 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "PdOIzOMFrexQh2HN8uqJpgmVd.nJkJC"
    },
    {
        "title": "Vegetable Medley",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "2 large sweet potatoes, sliced ADVERTISEMENT",
            "4 red potatoes, cubed ADVERTISEMENT",
            "1 large onion, sliced into rings ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "2 green bell peppers, sliced ADVERTISEMENT",
            "2 red bell peppers, sliced ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "1/4 cup Italian-style seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCoat the bottom of a 9x13 inch baking dish with oil. Spread sweet potatoes on the bottom, then top with red potatoes, onion, garlic, green bell peppers, red bell peppers and carrots. Sprinkle seasoning generously over all and cover dish with aluminum foil.\nBake at 350 degrees F 1 1/2 hours or until potatoes are cooked through and tender; remove foil cover and stir.\nChange oven temperature to 425 degrees F (220 degrees C) and bake mixture in oven for another 1/2 hour, or until browned on top.\n",
        "picture_link": "p5gX5WV9qTEo0CERuGIQdi1uquXrLr."
    },
    {
        "title": "Unbelievable Popovers",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease a popover pan and refrigerate. Beat together eggs and milk. Mix in flour and salt and stir until moistened. Ignore any lumps in the batter. Pour batter into chilled pan.\nPlace pan into cold oven. Heat oven to 450 degrees F (230 degrees C) and bake for 30 minutes, or until popovers have set.\n",
        "picture_link": "f9Bht5J6dUBzJzm6k9.n9f68D0J.fmS"
    },
    {
        "title": "Mexican Mac and Cheese",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "2 tablespoons dried onion flakes ADVERTISEMENT",
            "2 (7.25 ounce) packages dry macaroni and cheese ADVERTISEMENT",
            "15 ounces nacho cheese dip ADVERTISEMENT",
            "1 cup medium salsa ADVERTISEMENT",
            "1 (7 ounce) can diced green chiles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium skillet over medium-high heat, cook beef with onion flakes until beef is browned. Drain.\nIn a large saucepan, cook the macaroni and cheese according to package directions. Stir in the meat and onion mixture, nacho cheese dip, salsa and green chiles. Reduce heat and simmer 15 minutes, or until heated through.\n",
        "picture_link": "DAwehf2HllvsZHw0Ahj5.WNlzevYzGu"
    },
    {
        "title": "Karen's Salmon Salad",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "2 ripe tomatoes, diced ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "2 dill pickles, diced ADVERTISEMENT",
            "1 (14.75 ounce) can salmon, drained ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nWhen pasta has come to room temperature, combine it with tomatoes, green onions, pickles, salmon, mayonnaise, salt and pepper in a large bowl and mix well. Chill before serving.\n",
        "picture_link": "AWNMHkZorpFwmDiaoVPK1T782VeC00C"
    },
    {
        "title": "Waldorf Astoria Cake Frosting",
        "ingredients": [
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 teaspoon butter flavored extract ADVERTISEMENT",
            "1 teaspoon clear imitation vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine confectioners sugar, shortening, milk, salt, butter flavored extract and vanilla. Beat until smooth and fluffy.\n",
        "picture_link": "tYLvU9PNGSdnqiORBIYTv7hFXD7hfPC"
    },
    {
        "title": "Jack BBQ Sauce",
        "ingredients": [
            "1 cup ketchup ADVERTISEMENT",
            "2 tablespoons steak sauce ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "2 teaspoons liquid smoke flavoring ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "4 drops hot pepper sauce, or to taste ADVERTISEMENT",
            "4 dashes Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan combine ketchup, steak sauce, garlic salt, liquid smoke, onion powder and brown sugar. Add lemon juice, pepper sauce, Worcestershire sauce and whiskey. Warm over medium low heat until simmering.\nRefrigerate for at least one hour before using, to let flavors mingle. Brush on meat during the last few minutes of grilling or baking.\nNot recommended for marinating unless you omit the lemon juice, as the acid makes the chicken grainy.\n",
        "picture_link": "W1C2jRY3at3c6llohDeCEZ5ugOCQBU2"
    },
    {
        "title": "Mike's Peppered Beef Jerky",
        "ingredients": [
            "4 pounds very lean beef, visible fat trimmed and cut against the grain into 1/4 inch-thick strips ADVERTISEMENT",
            "3/4 cup Worcestershire sauce ADVERTISEMENT",
            "3/4 cup soy sauce ADVERTISEMENT",
            "1 1/2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon liquid smoke, or more to taste ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon coriander seeds ADVERTISEMENT",
            "3/4 cup water, or as needed ADVERTISEMENT",
            "1/4 teaspoon coriander seeds (optional) ADVERTISEMENT",
            "ground black pepper to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beef strips on a solid, level surface. Firmly pound beef with the tenderizing side of a meat mallet until the meat fibers are slightly broken but the strips still hold their shape.\nMix Worcestershire sauce, soy sauce, brown sugar, onion powder, garlic powder, black pepper, liquid smoke, cayenne pepper, and coriander seeds in a large bowl until brown sugar has dissolved.\nPlace beef strips into the bowl; add enough water to allow marinade to cover the meat. Stir to incorporate water and submerge the beef in marinade, cover the bowl, and refrigerate for 24 hours.\nPreheat oven to 300 degrees F (150 degrees C).\nRemove beef strips from marinade, shake off excess, and lay the strips onto oven-proof racks. Do not overlap the strips.\nBake the beef strips in the preheated oven until an instant-read thermometer inserted into the thickest strip reads at least 150 degrees F (65 degrees C).\nRemove strips from oven and place onto racks of a food dehydrator so the strips don't overlap.\nIf desired, sprinkle strips with more coriander seeds and black pepper.\nTurn on the dehydrator, set machine's temperature for 155 degrees F (70 degrees C), and dry the jerky until leathery, about 9 hours. Rotate the racks from top to bottom every 1 1/2 hours for even drying. A piece of jerky should crack but not break in half when folded. Store in refrigerator.\n",
        "picture_link": "IsccI4ipJ2zAaA3uVlbj66k3R0bZJEa"
    },
    {
        "title": "Cranberry-Nut Oatmeal Cookies",
        "ingredients": [
            "1 cup unsalted butter at room temperature ADVERTISEMENT",
            "1 1/2 cups light brown sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "2 cups old-fashioned rolled oats ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons coarse kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup chopped toasted pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place an oven rack in the upper third of the oven. Line baking sheets with parchment paper.\nPlace unsalted butter and light brown sugar into the work bowl of a stand mixer and mix on medium-slow speed until very fluffy, 3 to 4 minutes. Beat in the vanilla extract, followed by eggs, one at a time. Reduce mixer speed to lowest speed and leave running.\nIn a separate bowl, whisk together the rolled oats, flour, baking powder, cinnamon, kosher salt, and nutmeg. Pour the dry ingredients into the slowly running mixer in thirds; mix in dried cranberries and nuts until just incorporated. Using a large cookie scoop, place dough on prepared baking sheet about 2 inches apart.\nBake one batch at a time in the preheated oven just until the edges are brown, 17 to 18 minutes. Allow to cool on baking sheets for about 5 minutes before removing to finish cooling on wire racks.\n",
        "picture_link": "/4dq9bXi.PnrwZ.72gWvP.qgx.DKGVa"
    },
    {
        "title": "Nicola's Pad Thai",
        "ingredients": [
            "2 cups pad Thai rice noodles, soaked in water overnight and drained ADVERTISEMENT",
            "1/2 cup vegetable broth ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon rice wine vinegar ADVERTISEMENT",
            "1 1/2 teaspoons peanut butter ADVERTISEMENT",
            "1 teaspoon chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon tamarind paste ADVERTISEMENT",
            "1 teaspoon hot chile paste ADVERTISEMENT",
            "3/4 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon sesame oil ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1/3 cup chopped broccoli ADVERTISEMENT",
            "1/3 cup chopped carrots ADVERTISEMENT",
            "1/3 cup snow peas, trimmed ADVERTISEMENT",
            "1/3 cup sliced water chestnuts, drained ADVERTISEMENT",
            "1/3 cup baby corn, drained ADVERTISEMENT",
            "1/3 cup sliced fresh mushrooms ADVERTISEMENT",
            "1/3 cup sliced zucchini ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon chopped peanuts for topping ADVERTISEMENT",
            "1 tablespoon chopped cilantro ADVERTISEMENT",
            "1 pinch paprika for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak uncooked noodles in 8 cups of water until soft, 8 hours or overnight.\nDrain rice noodles and set aside.\nWhisk together vegetable broth, 2 tablespoons vegetable oil, brown sugar, soy sauce, rice wine vinegar, peanut butter, 1 teaspoon fresh cilantro, onion powder, tamarind paste, hot chile paste, garlic powder, sesame oil, red pepper flakes, ground coriander, ground ginger, salt, and ground black pepper in a saucepan.\nHeat sauce over medium heat until it bubbles; reduce heat to low, and simmer sauce while you prepare the remaining ingredients.\nHeat 3 tablespoons of vegetable oil in a large wok over medium heat.\nCook and stir broccoli, carrots, snow peas, water chestnuts, baby corn, mushrooms, and zucchini in the wok until tender, 8 to 10 minutes.\nAdd the drained noodles and 1 tablespoon vegetable oil to vegetables. Cook and stir until noodles are heated through, 2 to 3 minutes.\nRemove the wok from heat and pour the sauce over vegetables and rice noodles.\nToss to fully coat the vegetables and rice noodles with sauce.\nGarnish with peanuts, 2 tablespoons chopped cilantro, and paprika.\n",
        "picture_link": "LL/y2M6SEQulQOMx1pdRBd1pnO5CAUm"
    },
    {
        "title": "BBQ Pork-Stuffed Corn Muffins",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (8.5 ounce) package dry corn muffin mix (such as Jiffy®) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/4 cup shredded pepperjack cheese ADVERTISEMENT",
            "1 cup pulled pork in barbeque sauce ADVERTISEMENT",
            "1/4 cup shredded pepperjack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nLine muffin tin with paper baking cups. Spray each cup with cooking spray.\nStir together muffin mix, egg, milk, and 1/4 cup of shredded cheese in a bowl until combined.\nFill muffin cups halfway with batter.\nAdd 1 to 2 tablespoons of pulled pork to each cup.\nTop with remaining batter.\nUse the remaining 1/4 of shredded cheese to top each muffin.\nBake in the preheated oven until a toothpick inserted into the batter comes out clean, about 20 minutes.\n",
        "picture_link": "/x/4Vwq981g7dHniyTNnaRr1fPpQv5W"
    },
    {
        "title": "My Husband's Pad Thai Noodles",
        "ingredients": [
            "1 (8 ounce) package dried wide rice noodles ADVERTISEMENT",
            "1/4 cup fish sauce ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "2 tablespoons chili garlic sauce ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 tablespoon chili oil ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "20 extra large shrimp, peeled and deveined ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup thinly sliced onion ADVERTISEMENT",
            "1 cup thinly sliced celery ADVERTISEMENT",
            "2 cups napa cabbage, sliced into 2 inch strips ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "1 cup chopped fresh cilantro (optional) ADVERTISEMENT",
            "1/2 cup chopped peanuts (optional) ADVERTISEMENT",
            "1 hot red chile pepper, sliced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil over high heat. Turn off heat and drop in rice noodles. Allow them to soften, about 10 minutes. Drain noodles in a colander and set aside.\nWhisk together fish sauce, honey, soy sauce, lime juice, rice vinegar, chili garlic sauce, ketchup, chili oil, sesame oil, and garlic in a bowl.\nHeat a nonstick skillet over medium heat and scramble eggs. Remove and set aside.\nHeat vegetable oil in a large skillet over medium heat. Cook and stir shrimp until pink but not opaque, 3 to 4 minutes (they will finish cooking when returned to the skillet). Season shrimp with salt and ground black pepper and set aside.\nCook and stir onions and celery in the skillet just until tender, about 2 minutes.\nStir cabbage and drained rice noodles into the skillet and continue cooking until cabbage is tender, about 2 minutes. Pour in chicken stock as needed to keep noodles from getting dry.\nStir scrambled eggs, shrimp, salt, and ground black pepper into noodle mixture and gently toss to coat.\nPour sauce over the noodles and toss gently to combine. Continue cooking until shrimp are fully cooked, 2 to 5 minutes.\nRemove from heat and toss cilantro, peanuts, and red chiles into noodles.\n",
        "picture_link": "l050j0yyRJolLL.uHkAUBf64ouyBb1C"
    },
    {
        "title": "Fabulous Homemade Bread For the Food Processor",
        "ingredients": [
            "1 1/2 cups warm water (100 to 110 degrees F/40 to 45 degrees C) ADVERTISEMENT",
            "4 teaspoons bread flour ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "3 1/3 cups bread flour ADVERTISEMENT",
            "2/3 cup quick cooking oats ADVERTISEMENT",
            "2/3 cup whole wheat flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "3 1/2 tablespoons brown sugar ADVERTISEMENT",
            "3 1/2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the warm water into a large bowl, and whisk in 4 teaspoons of bread flour, the yeast, and the white sugar until thoroughly combined and the sugar has dissolved. Allow to stand until the yeast starts to form creamy bubbles, about 5 minutes.\nFit a dough blade into a large food processor, and place 3 1/2 cups of bread flour, the oats, whole wheat flour, salt, brown sugar, and vegetable oil into the work bowl. Start the food processor running, and slowly add enough of the water-yeast mixture to allow the dough to form a firm ball and pull away from the sides of the processor, about 1 minute. Process for another 30 seconds to knead.\nPlace the dough into an oiled bowl, and turn to coat the dough with oil. Cover with a damp cloth, and allow the dough to rise until doubled, about 1 hour. Punch down the dough, and divide into 2 equal-sized pieces. Form each piece into a loaf; pinch the seams and ends closed.\nGrease 2 4x8-inch loaf pans, and place the loaves into the pans with the seam sides down. Allow to rise until the dough is 1 inch above the rim of the pans, about 1 more hour.\nWhile dough is rising, preheat oven to 350 degrees F (175 degrees C).\nBake in the preheated oven until the tops are browned, about 35 minutes. Allow bread to cool in pans for 10 minutes, then turn out onto cooling racks to finish cooling.\n",
        "picture_link": "7RUNapxnK2vig8dSv1CCj4qokw3AcUa"
    },
    {
        "title": "Ghirardelli Chocolate Brownies with Peppermint Bark",
        "ingredients": [
            "1 1/2 sticks unsalted butter ADVERTISEMENT",
            "1 1/2 cups Ghirardelli 60% cacao chocolate chips ADVERTISEMENT",
            "3 large eggs, at room temperature ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup all purpose flour, plus ADVERTISEMENT",
            "2 tablespoons all purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "8 squares Ghirardelli Peppermint Bark, chopped into large chunks (for the brownies) ADVERTISEMENT",
            "18 squares Ghirardelli Peppermint Bark, broken into large chunks (about 8 pieces per square) (for the finishing) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees. Line a 9 x 13 inch baking pan with foil and grease with pan spray.\nIn a medium saucepan, bring 2 inches of water to a gentle simmer. Put the 60% chips and butter in a heatproof bowl and set it over (but not touching) the simmering water. Stir the mixture with a rubber spatula until the butter is melted and both ingredients are completely combined. Turn off the heat and leave the bowl over the warm water.\nSift together the flour and baking powder and set aside. In a large bowl whisk together eggs, salt, sugar and vanilla. Add the egg mixture to the chocolate mixture and whisk together gently. With a spatula, fold in the flour. Immediately pour 1/2 the mixture into the prepared baking pan and spread it evenly. Next, sprinkle the chopped peppermint bark over the batter and then pour the remaining batter over this. Spread evenly.\nBake for 15-20 minutes. The center should be fudgy but not dry. Remove from the oven and cool for 10 minutes. Place Peppermint Bark chunks on top of warm brownies and allow them to soften for 1 minute. Using a spatula, gently swirl the melting Peppermint Bark to create swirls of melted chocolate. Refrigerate for 1 hour. Trim the 4 edges of the brownies by 1/4 inch. And cut into 18 squares.\n",
        "picture_link": "XWNjp5Ekf/XgupR6D5Ef1DQuu7gXqx2"
    },
    {
        "title": "Perfect BBQ Baked Beans",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 tablespoons dry mesquite flavored seasoning mix ADVERTISEMENT",
            "2 (28 ounce) cans baked beans (such as Bush's Original®) ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup barbeque sauce ADVERTISEMENT",
            "2 teaspoons dry mustard powder ADVERTISEMENT",
            "2 pinches cayenne pepper, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium heat, cook the ground beef, onion, and mesquite seasoning until the meat is no longer pink, breaking it up into crumbles as it cooks, about 10 minutes. Drain excess grease, and transfer the meat mixture to a large baking dish. Stir in the baked beans, molasses, brown sugar, barbeque sauce, dry mustard powder, and cayenne pepper, and mix until any small lumps of brown sugar have dissolved.\nBake in the preheated oven until the beans are bubbling and the flavors have blended, about 20 minutes.\n",
        "picture_link": "bq.aY5bSKyfNh0T5tq04mQRnxYxT6cm"
    },
    {
        "title": "Spicy Cream of Asparagus Soup",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "24 fluid ounces chicken broth ADVERTISEMENT",
            "1 pound fresh asparagus spears, trimmed and halved crosswise ADVERTISEMENT",
            "1 large Idaho potato, peeled and diced ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 dash hot pepper sauce (such as Tabasco®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium heat.\nCook and stir onion in butter until translucent, about 5 minutes.\nPour chicken broth over onions and bring to a boil.\nStir in asparagus and potato; cover and cook until asparagus spears are tender, about 8 minutes.\nMix in jalapeno pepper.\nPour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot.\nStir in heavy cream.\nSeason with salt, black pepper and hot sauce.\n",
        "picture_link": "Itn5uO3gZhe/iEs2aaM0CG6xkRc9abG"
    },
    {
        "title": "CINfully Delicious Chocolate Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon cinnamon sugar, or as needed ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup butter-flavored shortening ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 cups confectioners' sugar, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nLine 24 muffin cups with paper liners.\nBeat together the chocolate cake mix, 1 cup milk, eggs, 1/2 cup melted butter, 1 teaspoon cinnamon, and 1 teaspoon vanilla extract in a bowl with an electric mixer on low speed until moist. Beat for 2 more minutes on medium speed.\nFill each muffin cup about 2/3 full of batter.\nSprinkle the cupcakes with cinnamon sugar.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 15 minutes.\nCool in the pans for 10 minutes before removing to cool completely on a wire rack.\nCream together 1/2 cup butter and shortening in a bowl until smooth.\nStir in sea salt, 1 teaspoon vanilla extract, 1 tablespoon cinnamon, cocoa powder, and 3 cups confectioners' sugar.\nStir in milk.\nMix in 2 more cups confectioners' sugar or as needed until desired consistency is achieved.\nSpread the frosting on the cooled cupcakes.\n",
        "picture_link": "k9TDz1ghJqBU8B9f1FaCtZS6cYnnsUm"
    },
    {
        "title": "Ham and Potato Casserole",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "5 potatoes, diced ADVERTISEMENT",
            "1 (16 ounce) bag frozen chopped broccoli, thawed ADVERTISEMENT",
            "1 pound diced cooked ham ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (4 ounce) package cream cheese ADVERTISEMENT",
            "6 ounces shredded Monterey Jack cheese ADVERTISEMENT",
            "1/2 cup buttery round crackers (such as Ritz®), crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpray a skillet with cooking spray. Cook and stir onion and green pepper over medium heat until onions are translucent, 5 to 7 minutes.\nSpray a 9x13-inch baking dish with cooking spray.\nCombine cooked onion, green pepper, potatoes, broccoli, ham, mushrooms, and celery in the prepared baking dish, stirring to distribute the vegetables and ham.\nStir cream of mushroom soup, sour cream, and cream cheese together in the same skillet used for onion and green pepper; mix until combined and smooth.\nStir soup mixture into vegetable and ham mixture until combined. Mix in the Monterey Jack cheese.\nBake in preheated oven until vegetables are tender and sauce is bubbling, about 35 minutes.\nSprinkle with cracker crumbs and return to oven until topping is lightly browned, about 5 minutes.\n",
        "picture_link": "aZPWzqGNCysFkDx9CogBIG4JTk7dJP6"
    },
    {
        "title": "Thanksgiving Broccoli and Cheese Casserole",
        "ingredients": [
            "2 (14 ounce) bags frozen broccoli florets, thawed ADVERTISEMENT",
            "2 cups cream of chicken soup ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "2 pounds processed cheese food (such as Velveeta ®), sliced ADVERTISEMENT",
            "2 sleeves buttery round crackers (such as Ritz®), crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir the broccoli florets, cream of chicken soup, and 1 tablespoon softened butter together in a 9x13-baking dish until the broccoli is coated with the soup. Pack lightly to form a flat surface. Layer about half the slices of processed cheese food atop the broccoli mixture.\nBake in the preheated oven until the cheese is bubbling, about 20 minutes.\nRemove the dish from the oven; stir to blend the melted cheese into the broccoli mixture. Top with the remaining processed cheese food. Top with the crushed buttery round crackers.\nReturn dish to oven and bake until the added cheese begins to melt, about 15 minutes more. Allow the casserole to cool and thicken slightly before serving, at least 15 minutes.\n",
        "picture_link": "A.UzYEU4ERvmeQV371JiOFOVMIzNFu."
    },
    {
        "title": "Sugar-Free BBQ Sauce",
        "ingredients": [
            "1 tablespoon canola oil ADVERTISEMENT",
            "1 cup minced onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 beef bouillon cubes ADVERTISEMENT",
            "1/2 cup hot water ADVERTISEMENT",
            "3 (6 ounce) cans tomato paste ADVERTISEMENT",
            "1 cup granular sucrolose sweetener (such as Splenda®) ADVERTISEMENT",
            "3/4 cup Worcestershire sauce ADVERTISEMENT",
            "3/4 cup Dijon mustard ADVERTISEMENT",
            "3 tablespoons hickory-flavored liquid smoke ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1 tablespoon hot pepper sauce (such as Tabasco®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large saucepan over medium heat, and cook and stir until the onion is translucent, about 5 minutes. Mix the beef bouillon cubes and water in a cup until the cubes are softened and beginning to dissolve, and pour the water and bouillon cubes into the saucepan. Bring to a simmer, stirring to dissolve the cubes. Mix in the tomato paste, sucralose sweetener, Worcestershire sauce, Dijon mustard, liquid smoke flavoring, salt, cider vinegar, and hot pepper sauce. Stir until the sweetener has dissolved.\nBring the sauce to a simmer, reduce heat, and simmer until the flavors have blended, 25 to 30 minutes. Stir frequently. For best flavor, cover and refrigerate overnight. Store in refrigerator up to 1 week.\n",
        "picture_link": "DpbWEEhwPmPUskJfkeo8dD.xRSOqZhO"
    }
]