[
    {
        "Title": "A Practical Guide to Creating a Garden Pond and Year-Round Maintenance (Tankmasters)",
        "Authors": "By Quick, Graham",
        "Description": "",
        "Category": " Pets , Fish & Aquariums",
        "Publisher": "Barrons Educational Series Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "British Museum Guide and Map",
        "Authors": "By Trustees of the British Museum",
        "Description": "",
        "Category": "",
        "Publisher": "Publications Limited",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Police Station (Where is The Puppy book series)",
        "Authors": "By Hood, Susan",
        "Description": "",
        "Category": "",
        "Publisher": "dalmatian press llc, 2009",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Watch Out for Banana Peels",
        "Authors": "By Sarah Albee",
        "Description": "",
        "Category": "",
        "Publisher": "Dalmation Press, LLC",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "My Brilliant Career.",
        "Authors": "By Miles franklin",
        "Description": "",
        "Category": "",
        "Publisher": "HARPERCOLLINS @ PUBLISHERS",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Dahnhak; the Way to Perfect Health",
        "Authors": "By Seung-Heun Lee",
        "Description": "",
        "Category": "",
        "Publisher": "Dahn Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Lone Star Christmas: A Christmas Chronicle/Here Cooks the Bride/Unexpected Blessings/The Marrying Kind (Inspirational Romance Collection)",
        "Authors": "By Pamela Griffin, Cathy Marie Hake, Vickie McDonough, Kathleen Y'Barbo",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Virginia State Parks: A Complete Outdoor Recreation Guide for Campers, Boaters, Anglers, Hikers and Outdoor Lovers (State Park Guidebooks)",
        "Authors": "By Bailey, Bill",
        "Description": "",
        "Category": " Travel , United States , South , South Atlantic (DC, DE, FL, GA, MD, NC, SC, VA, WV)",
        "Publisher": "Glovebox Guidebooks of Amer",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Loving Words: Every Woman Wants to Hear",
        "Authors": "By Anderson, Ed and Peterson, John E.",
        "Description": "Most men desire to convey love and acceptance to the women in their lives, but often find themselves lacking the exact words to do so. Believing that men have had few positive role models who communicate effectively with women, John Peterson and Dr. Edwin Anderson have written this invaluable book, outlining words that will encourage and soothe the female soul. A powerful resource for men who wish to positively impact their wives, mothers, daughters, sisters, and friends.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Romance & Folklore of North America's Railroads",
        "Authors": "By Yenne, Bill (EDT)",
        "Description": "Colorful anecdotes and personal narratives combine with folk legends, tall tales, human interest stories, jests, and songs to form a unique collection of American railroad memorabilia that also includes the history of railroad development and the railroader's occupation.",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Chasing the Devil: My Twenty-Year Quest to Capture the Green River Killer",
        "Authors": "By Reichert, David",
        "Description": "It began with the discovery of three women’s bodies found near suburban Seattle’s Green River in August, 1982. Soon more corpses and human remains would be found, some as far as Oregon. They were teenage runaways or other women whose anonymous lifestyles had made them easy, vulnerable targets—and they were all the victims of a faceless murderer whose rampage would span two decades and take as many as forty-nine lives. No other serial killer in the nation’s history had killed so many people.For twenty long years, Sheriff David Reichert played a cat and mouse game with the Green River killer who managed to stay one step ahead of Reichert, the local authorities, and even the FBI. But Reichert had no doubt in his mind that he was going to find the Green River killer— no matter how long it took…That day came in 2001 when DNA evidence linked fifty-two-year-old truck painter Gary Ridgway to three of the murder victims. The long nightmare was finally over for Reichert and the families of the murder victims. With startling insider disclosures and the fascinating forensic details of the relentless manhunt itself—Chasing the Devil exposes the heart of true evil and reveals the dauntless efforts behind one man’s quest to chase it...",
        "Category": " True Crime , Murder , Serial Killers",
        "Publisher": "St. Martin's True Crime",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "The Fedorovich File",
        "Authors": "By Spencer, Ross H.",
        "Description": "Lacey Lockington--a hard drinking, hard-living cop turned detective--trails a Soviet defector to Youngstown, Ohio, where the defector, former general Alexi Fedorovich, may have information about an imminent Soviet invasion",
        "Category": " Fiction , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "I Wish I Were an Alien (Lightning Readers: Level 2)",
        "Authors": "By French, Vivian and Williams, Lisa (ILT)",
        "Description": "When a child is learning to read, every word counts!                                  A boy gazes out the window of his house and wishes he could live in        outer space.  An alien gazes out the window of his spaceship and wishes        he could live on planet earth.  Well, be careful what you wish for!                                  I Wish I Were an Alien is an innovative Lightning Reader        that features a controlled word count to give readers practice with        essential sight words.  This leveled reader for grades K-1 features a        150 words or less and has been professionally leveled by reading experts        to ensure that the language and vocabulary are age-appropriate.  Word        lists and comprehension questions at the back of the book reinforce        fundamental reading concepts used in classrooms nationwide!                                  This title is also available in a Spanish version!                                  Children ages 2 to 8 will love to learn to read with our Lightning        Readers series!  Over 30 titles feature humorous, high-interest        stories in a variety of styles including, fantasy, fable, and rhyme,        which will appeal to both reluctant and enthusiastic readers.         Controlled word counts in this one of a kind series help to build the        word foundation for a lifetime of reading!  Check out our other titles        in this series!                                  Each title is available in an English and Spanish version!",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Brighter Child",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Spider Bones (13) (Tempe Brennan)",
        "Authors": "By Reichs, Kathy",
        "Description": "Don’t miss this “whopper” (Publishers Weekly) of a thriller from #1 New York Times bestselling author Kathy Reichs in her “cleverly plotted” (The New York Times) Temperance Brennan series, the inspiration for the hit FOX television series Bones.John Lowery was declared dead in 1968—the victim of a Huey crash in Vietnam, his body buried long ago in North Carolina. Four decades later, Temperance Brennan is called to the scene of a drowning in Hemmingford, Quebec. The victim appears to have died while in the midst of a bizarre sexual practice. The corpse is later identified as John Lowery. But how could Lowery have died twice, and how did an American soldier end up in Canada? Tempe sets off for the answer, exhuming Lowery’s grave in North Carolina and taking the remains to Hawaii for reanalysis—to the headquarters of JPAC, the US military’s Joint POW/ MIA Accounting Command, which strives to recover Americans who have died in past conflicts. In Hawaii, Tempe is joined by her colleague and ex-lover Detective Andrew Ryan (how “ex” is he?) and by her daughter, who is recovering from her own tragic loss. Soon another set of remains is located, with Lowery’s dog tags tangled among them. Three bodies—all identified as Lowery. And then Tempe is contacted by Hadley Perry, Honolulu’s flamboyant medical examiner, who needs help identifying the remains of an adolescent boy found offshore. Was he the victim of a shark attack? Or something much more sinister?",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2011"
        }
    },
    {
        "Title": "Essential Monet",
        "Authors": "By Potts, Vanessa",
        "Description": "",
        "Category": "",
        "Publisher": "Dempsey Parr",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Living the Extraordinary Life: Nine Principles to Discover It",
        "Authors": "By Stanley, Charles F.",
        "Description": "\"If an honest and capable portrait painter depicted you, what would the world see? Integrity, courage, and conviction? Or dishonesty, fear, and doubt?\"Dr. Charles Stanley asks this question as he encourages us to probe the depths of our hearts and to take stock of who we really are. Many people are content to live below their real potential and to settle for less than God intends?just the status quo. He wants us to live victorious lives.In Living the Extraordinary Life, Dr. Stanley gives us time-tested truths that God reveals through Scripture?nine simple but effective life principles that can help us live truly triumphant lives. Learn how:surrendering your life to God leads to peace, contentment, and joyobedience always brings blessingonly by patience can we know God's willwe can win out battles if we fight them on our kneesWhether we are longtime Christians struggling with the temptations and stresses of today's world, or new believers reaching out for the first time to Christ to transform our lives, this book can point us to the secrets for living happier, more meaningful  lives.\"Becoming the masterpiece God created you to be is a lifelong process in which He is continually shaping you into a unique reflection of His Son,\" Dr. Stanley says. \"It is my prayer that you will embrace each one of these principles fully, and in doing so, discover the extraordinary life God has planned for you.\"",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Joy Every Morning (Quiet Time Books)",
        "Authors": "By Larson, Muriel",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1979"
        }
    },
    {
        "Title": "In Style: Weddings",
        "Authors": "By Sterne, Hilary (EDT)",
        "Description": "A comprehensive, richly illustrated guide to creating the perfect wedding takes couples through the entire planning process, from engagement to honeymoon, offering a host of stylish concepts, suggestions, tips, and tricks that cover fashion options, food, flowers, settings, reception, ceremonies, and more, all enhanced with details from celebrity nuptials. 75,000 first printing.",
        "Category": " Reference , Weddings",
        "Publisher": "In Style Books",
        "Price Starting With ($)": "7.8",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "How To Reach And Teach Children with ADD / ADHD: Practical Techniques, Strategies, and Interventions",
        "Authors": "By Rief, Sandra F.",
        "Description": "This text offers information on improving the academic, behavioral, and social performance of children suffering from this neurobehavioral disorder. In 35 sections, Rief (educational consultant, author, and speaker) makes use of case studies and interviews in her coverage of such topics as preventing behavioral problems, learning styles, medication and its management, cooperative learning, and relaxation techniques. This second edition offers new content on medications, case studies, documentation, placement, and model programs. Designed for teachers, counselors, and psychologists. Annotation ©2004 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Education , Special Education , General",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "The Fire Engine Book (Little Golden Treasures)",
        "Authors": "By Gergely, Tibor (ILT) and Golden Books Publishing Company (COR)",
        "Description": "Children will feel as though they’re riding the big red fire engines and hearing theclang-clang of the bell! Active pictures transport young readers to the scene where brave firemen connect the hoses and save the day. This board book edition of the Little Golden Book, which has sold over 320,000 since 2001, is sure to be a hit.",
        "Category": " Juvenile Fiction , Transportation , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "One-Minute Prayers® for Women",
        "Authors": "By Harvest House Publishers",
        "Description": "Lord, You made me. You love me. You have a future for me. When I allow these truths to sink in, my spirit awakens, and I am open to the possibilities the day holds for me.Women who juggle schedules, responsibilities, and commitments will discover sacred moments of renewal among these prayers. Each minute spent with God leads them to:appreciate their abilities and giftsaccess God's peacerelease guilt and embrace graceseek the simplicity of a godly lifetrade daily trials for joyAs they steal away with God, women will experience the blessed joys of meditation and will deepen their belief in their Creator and His loving plans for them.",
        "Category": " Religion , Prayer",
        "Publisher": "Harvest House Publishers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Growing in the Life of Faith: Education and Christian Practices",
        "Authors": "By Dykstra, Craig R.",
        "Description": "In this new edition of his popular book, Craig Dykstra explores the contributions of the traditions, education, worship practices, and disciplines of the Reformed Christian community in helping people grow in faith. In doing so, he makes the case that the Christian church, in its own traditions, has a wealth of wisdom about satisfying spiritual hunger and the desire to know God deeply - wisdom that offers coherent, thoughtful guidance in such diverse settings as congregational life, families, youth groups, and higher education.This edition includes a study guide by Syd Hielema, a new foreword by Dorothy C. Bass, and a new preface by the author. It is ideal for clergy, Christian educators, spiritual directors, and all who are interested in finding guidance in their quest for a genuine encounter with God.",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Geneva Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Illustrated History of Fighters",
        "Authors": "By Gunston, Bill",
        "Description": "",
        "Category": "",
        "Publisher": "Bookthrift Co",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Kitchens (For Your Home)",
        "Authors": "By Suqi, Rima A.",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Friedman/Fairfax Pub",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Effective C++: 50 Specific Ways to Improve Your Programs and Designs",
        "Authors": "By Meyers, Scott",
        "Description": "",
        "Category": "",
        "Publisher": "Addison Wesley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1991"
        }
    },
    {
        "Title": "Macular Degeneration : The Complete Guide to Saving and Maximizing Your Sight",
        "Authors": "By Mogk, Lylas G. and Mogk, Marja",
        "Description": "A guide to reducing the risk factors for macular degeneration and dealing with the onset of the disease covers all the newest procedures and even assists readers in dealing with the depression that often accompanies the illness. Reissue.",
        "Category": " Medical , Diseases",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "With God by Your Side: ...You Never Have to Be Alone : A Collection from Blue Mountain Arts (Inspiration)",
        "Authors": "By Morris, Gary (EDT) and Blue Mountain Arts, Inc. (COR)",
        "Description": "",
        "Category": " Literary Criticism , Poetry",
        "Publisher": "Blue Mountain Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Sun-Kissed Christmas: A Summer Novel",
        "Authors": "By Applegate, Katherine",
        "Description": "All she wants for Christmas… Summer is headed to the Keys for winter break, but what should be a fun-in-the-sun holiday is becoming unbearable. Summer hasn’t been able to stop thinking about her ex-boyfriend, Austin, since their summer romance fizzled, and she can’t stand seeing him at the beach with his new girlfriend…. Now Austin is everywhere she goes. She’s reminded of how much fun they had, how gorgeous he is, and what she really wants is what she can’t have. Will it take a Christmas miracle for Summer to survive this holiday season? Or will the mistletoe work its magic?",
        "Category": " Young Adult Fiction , Holidays & Celebrations",
        "Publisher": "Simon Pulse",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2010"
        }
    },
    {
        "Title": "Moonlight & Vines (Newford)",
        "Authors": "By De Lint, Charles",
        "Description": "Return to NewfordFamiliar to Charles de Lint's ever-growing audience as the setting of the novels Moonheart, Forests of the Heart, The Onion Girl, and many others, Newford is the quintessential North American city, tough and streetwise on the surface and rich with hidden magic for those who can see.In the World Fantasy Award-winning Moonlight and Vines, de Lint returns to this extraordinary city for another volume of stories set there, featuring the intertwined lives of many characters from the novels. Here is enchantment under a streetlamp: the landscape of our lives as only Charles de Lint can show it.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Orb Books",
        "Price Starting With ($)": "31.31",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Nation's Choice, Reader's Library Grade 5 Theme 5: Houghton Mifflin the Nation's Choice (Houghton Mifflin Reading: The Nation's Choice)",
        "Authors": "By Read (COR)",
        "Description": "",
        "Category": " Juvenile Nonfiction , Language Arts , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Saved From Silence   Finding Women's Voice in Preaching",
        "Authors": "By Hudson, Mary Lin and Turner, Mary Donovan",
        "Description": "In this postmodern age, women preachers are finding their \"voice\" a distinctive way of proclamation. This book looks at the metaphor of voice, how women are moving to voice from silence, and how individuals can make themselves heard by those who don't want to hear.",
        "Category": " Religion , Christian Ministry , Preaching",
        "Publisher": "Chalice Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "The Best Little Grilling Cookbook (Best Little Cookbooks)",
        "Authors": "By Adler, Karen",
        "Description": "The second book in the new BEST LITTLE COOKBOOKS series is GRILLING uses the simple technique of cooking quickly over high heat over charcoal or hardwood. Hickory-Flavored Pork Patties, Pacific Rim Salmon Fillets, and Stir-Grilled Shrimp with Sugar Snap Peas are just a sampling. And vegetarians should try the Grilled Eggplant with Preserved Basil and Sundried Tomatoes. COMING IN JUNE.",
        "Category": " Cooking , Methods , Barbecue & Grilling",
        "Publisher": "Celestial Arts",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Gathering Dark (Peter Octavian)",
        "Authors": "By Golden, Christopher",
        "Description": "As the barriers between the mortal and supernatural realms slowly crumble, nightmarish creatures are unleashed throughout the world, and Peter Octavian, a powerful mage and accused vampire, is the only one that can save civilization from a fate worse than death. Original.",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "The Power of Integrity: Building a Life Without Compromise",
        "Authors": "By MacArthur, John",
        "Description": "A compelling study of how to cultivate true integrity--which requires both internal and external commitment and obedience to God. From the heart of this pastor and best-selling author.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Crossway",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Climber's Handbook",
        "Authors": "By Hattingh, Garth",
        "Description": "Introduces the skills and techniques need for all climbing styles, covering rock, snow, ice, and alpine climbing, equipment, and emergency and rescue techniques",
        "Category": " Sports & Recreation , Mountaineering",
        "Publisher": "Stackpole Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Review of gross anatomy: Text and illustrations",
        "Authors": "By Pansky, Ben, House, Earl Lawrence",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan Publishing Company",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Growing Up With My Children: Reflections of a Less-Than-Perfect Parent",
        "Authors": "By Walker, Elein",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Hazelden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Angel Death",
        "Authors": "By Moyes, Patricia",
        "Description": "After Henry Tibbett helps the police in their investigation of the disappearance of an old lady on a Caribbean island, he himself is kidnapped and his wife, Emmy, is left to unravel the mystery",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Black Widower: An Inspector Henry Tibbett Mystery",
        "Authors": "By Moyes, Patricia",
        "Description": "Marvis Ironmonger, always an embarrassment to her diplomat husband, upsets him no more after she is found murdered at a Washington party",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "9.49",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "Conflict Imperative (Stonyman, 48)",
        "Authors": "By Pendleton, Don",
        "Description": "The Stony Man team heads into action when their leader, Mack Bolan, and a DEA agent are taken hostage by a former IRA terrorist, who has brokered a land-for-peace deal between the Peruvian government and a local rebel faction. Original.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Gold Eagle",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Fight for Your Health: Exposing the FDA's Betrayal of America",
        "Authors": "By Richards, Byron J.",
        "Description": "",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Truth In Wellness",
        "Price Starting With ($)": "16.46",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Saving The Best For Last: Creating Our Lives After 50",
        "Authors": "By Fisher, Renee, Kramer, Joyce, and Peelen, Jean",
        "Description": "",
        "Category": " Self-help , Personal Growth , General",
        "Publisher": "iUniverse",
        "Price Starting With ($)": "13.12",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "SpongeBob's Slap Shot (Spongebob Squarepants (8x8))",
        "Authors": "By Lewman, David and Moore, Harry (ILT)",
        "Description": "“He shoots! He scores!” SpongeBob amazes an ice-hockey scout with his skills while sweeping up the Krusty Krab, and he soon finds himself playing professional hockey! But when he realizes whose team he is playing for, and who he must play against, SpongeBob starts having second thoughts. Does he really have what it takes to be an ice-hockey superstar? Hockey enthusiasts and SpongeBob fans alike will delight in this full-color, sports-themed story, ideal for young readers between the ages of 4 and 8.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Simon Spotlight/Nickelodeon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Moscow: A Travellers' Companion",
        "Authors": "By Kelly, Laurence",
        "Description": "Essays and selections from novels, biographies, letters, and diaries describe the history of Moscow from its founding to the rise of Lenin, in 1917",
        "Category": " History , General",
        "Publisher": "Macmillan Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "The Coin Collector's Survival Manual",
        "Authors": "By Travers, Scott A.",
        "Description": "",
        "Category": " Antiques & Collectibles , Coins, Currency & Medals",
        "Publisher": "Bonus Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "The Cradle Place",
        "Authors": "By Lux, Thomas",
        "Description": "The Cradle Place is the new collection from Thomas Lux, a self-described \"recovering surrealist\" and winner of the Kingsley Tufts Award.These fifty-two poems bring to full life the \"refreshing iconoclasms\" Rita Dove so admired in Lux's earlier work. His voice is plainspoken but moody, humorous and edgy, and ever surprising.These are philosophical poems that ask questions about language and intention, about the sometimes untidy connections between the human and natural worlds. In the poem \"Terminal Lake,\" Lux undermines notions of benign nature, finding dark currents beneath the surface: \"it's a huge black coin, / it's as if the real lake is drained / and this lake is the drain: gaping, language- / less, suck- and sinkhole.\" In the ominous \"Render, Render,\" the narrator asks us to consider a concentration of the essences of our lives: all that is physical, spiritual, remembered, and dreamed for, melded together to make the messy self we present to the world.Lux's voice is intelligent without being bookish, urgent and unrelentingly evocative. He has long been a strong advocate for the relevance of poetry in American culture. The Los Angeles Times praises Lux for his \"compelling rhythms, his biting irony, and his steady devotion to a craft that often seems thankless.\" As Sven Birkerts noted, \"Lux may be one of the poets on whom the future of the genre depends.\"",
        "Category": " Poetry , American , General",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "7.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Talking it over: Fifty-two inspiring devotionals with daily Bible readings for people on the move",
        "Authors": "By Sweeting, George",
        "Description": "",
        "Category": "",
        "Publisher": "Moody Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "A Dangerous Dream",
        "Authors": "By Mary Paine",
        "Description": "",
        "Category": "",
        "Publisher": "Wings ePress",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "The fir tree",
        "Authors": "By Andersen, H. C",
        "Description": "",
        "Category": "",
        "Publisher": "Harper & Row",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Kids' Games: Traditional Indoor and Outdoor Activities for Children of All Ages",
        "Authors": "By Wiswell, Phil",
        "Description": "Instructions for playing 130 traditional indoor and outdoor games for children five to fifteen. Includes word games, number and dice games, guessing and memory games, card games, strategy games, solitaire games, and puzzles.",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Main Street Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Pope Joan: An Unorthodox Interlude",
        "Authors": "By Glackens, Ira",
        "Description": "",
        "Category": "",
        "Publisher": "Coleridge Press",
        "Price Starting With ($)": "16.18",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Emily's Art (Richard Jackson Books (Atheneum Hardcover))",
        "Authors": "By Catalanotto, Peter",
        "Description": "\"What a gorgeous painting,\" exclaimed the judge of Ms. Fair's first-grade art contest. \"What a beautiful rabbit!\"  For Emily, the words are a shock.  Her painting is of her dog, Thor. Not a rabbit.  But instead of thinking: What's wrong with this judge? Emily takes the words, and the judgment, to heart.  Just as she takes her art.  Not everyone, not Ms. Fair, or even Emily's best friend, Kelly, can see that.  At first.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Atheneum/Richard Jackson Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Other Shepards",
        "Authors": "By Griffin, Adele",
        "Description": "Geneva Shepard and her older sister have lived their lives in the shadow of a memory--of their three siblings who were tragically killed in a car accident twenty years earlier--until Annie enters their lives and allows the girls to begin a much-needed healing process. Reprint. AB. C. SLJ. PW.",
        "Category": " Young Adult Fiction , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "Kick the Clutter: Clear Out Excess Stuff Without Losing What You Love",
        "Authors": "By Ellen Phillips",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Lincoln: A Pictorial History",
        "Authors": "By Steers, Edward",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Thomas Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1993"
        }
    },
    {
        "Title": "The Red Hat Society(R)'s Queens of Woodlawn Avenue (A Red Hat Society Romance (2))",
        "Authors": "By Sutherland, Regina Hale",
        "Description": "Left alone and broke after her husband leaves her on her fiftieth birthday for a younger woman, Ellie Johnston is struggling to build a new life in a rundown Tudor cottage that is one of four built by the original members of the Woodlawn Avenue Bridge Club and, with the help of the other women in the club, establishes her own business, finds new love, and fends off the attentions of her ex. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "Sudden Fear (Bartlett Brothers Adventure Series)",
        "Authors": "By Elwood, Roger",
        "Description": "The teenage sons of an American diplomat find their lives in danger when they intercept a terrorist's message",
        "Category": " Juvenile Fiction , General",
        "Publisher": "W Pub Group",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Here She Lies",
        "Authors": "By Pepper, Kate",
        "Description": "When she discovers evidence of her husband's infidelity, Annie Goodman's life is thrown asunder and she flees with her young daughter to the one person she has always trusted-her twin sister, Julie. In this safe harbor, the sisters quickly become as close as they were as children. But when Annie tries to get a job, her safe harbor turns rocky-she's arrested, her credit cards are stolen, and her very identity is in question. Seeking solace with Julie, she finds her twin sister gone-along with her daughter.  It soon becomes clear that nothing Annie previously believed is certain-and that she is the only one who can find her child, and reclaim the life that someone has stolen from her...",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Onyx",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Basic Balloon Sculpture: A Beginner's Manual",
        "Authors": "By Schindler, George",
        "Description": "",
        "Category": " Art , General",
        "Publisher": "Show Biz Services",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1983"
        }
    },
    {
        "Title": "Holy Bible-KJV",
        "Authors": "By King James Version",
        "Description": "",
        "Category": "",
        "Publisher": "American Bible Society",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Paul and the Corinthians: The Life and Letters of Paul",
        "Authors": "By Winegard, Robert",
        "Description": "Paul and the Corinthians explores the sometimes tumultuous relationship between Paul and the Christians in Corinth who were struggling to make sense of their faith in a diverse and secular culture. Wingard relates his firsthand knowledge of the setting of Corinth and applies Paul's wisdom to some of the most pressing issues faced by the church today: The Church and the Bible, Making Moral Decisions, Christian Unity, Women and Men in Church and Society, The Resurrection, Christian Giving, and Reconciliation in a Broken World. Each of the seven sessions is self-contained and includes questions for reflection.To see another group study offered by Cokesbury, go to the Adult Bible Studies website.",
        "Category": " Religion , Biblical Studies , New Testament , General",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "World War II Commanders",
        "Authors": "By Ian Westwell",
        "Description": "",
        "Category": "",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Literary Democracy: The Declaration of Cultural Independence in America",
        "Authors": "By Ziff, Larzer",
        "Description": "Tries to explain the development of a true American literature in the midnineteenth century by examining the careers of writers like Melville, Hawthorne, Whitman, and Thoreau",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "July",
            "Year": "1981"
        }
    },
    {
        "Title": "In the Know: The Classic Guide to Being Cultured and Cool",
        "Authors": "By Macdonell, Nancy",
        "Description": "The ultimate crash course for every woman who wants to be \"cool\" presents an entertaining, fact-filled guide on how to navigate life with style and flair, offering practical advice on everything from knowing why Jackson Pollock is important to which handbag can get you upgraded at the airport. Original. 40,000 first printing.",
        "Category": " Social Science , Popular Culture",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Learning to Listen, Listening to Learn: Building Essential Skills in Young Children",
        "Authors": "By Jalongo, Mary Renck",
        "Description": "Children’s listening habits and skills are a good predictor of oral language profi ciency, reading and writing skills, and later school success. Good listening skills do not simply develop naturally—they must be taught and practiced—yet many teachers do not get training on how to teach children to listen.Using clear language and real-life examples, Mary Renck Jalongo explains why being an effective listener is a challenge—for adults as well as children—and provides researchbased suggestions for improving listening in the classroom and at home. Learning to Listen, Listening to Learn will help teachers to: • understand the components of listening• discover why children do or do not listen• actively listen to children and other adults• provide a rich oral language environment• help parents support their children’s listening learningChildren, especially in the preschool years, are ready to learn about becoming good listeners. This book is a welcome resource for teachers who wish to help them to do so.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "The National Association for the Education of Young Children",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Men At War: The Fighting Agents",
        "Authors": "By Alex Baldwin",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Willow",
        "Authors": "By Hoban, Julia",
        "Description": "Seven months ago, on a rainy March night, sixteen-year- old Willow's parents drank too much wine and asked her to drive them home. They never made it. Willow lost control of the car and her parents died in the accident. Now she has left behind her old home, friends, and school, and blocks the pain by secretly cutting herself. But when Willow meets Guy, a boy as sensitive and complicated as she is, she begins an intense, life-changing relationship that turns her world upside down.Told in an arresting, fresh voice, Willow is an unforgettable novel about one girl's struggle to cope with tragedy, and one boy's refusal to give up on her.",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Speak",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2010"
        }
    },
    {
        "Title": "Love, Lust, and Longing in the White House: The Romantic Relationships of America's Presidents",
        "Authors": "By Garrison, Webb B.",
        "Description": "In this engaging and entertaining peek behind closed White House doors, bestselling author Web Garrison explores and explains the states of affairs that have often gone hand in hand with affairs of state. Illustrations.",
        "Category": " Political Science , History & Theory",
        "Publisher": "Cumberland House Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Bride's Instruction Manual: How to Survive and Possibly Even Enjoy the Biggest Day of Your Life (Owner's and Instruction Manual)",
        "Authors": "By Kepple, Paul (ILT), Denny, Carrie, and Reifsnyder, Scotty (ILT)",
        "Description": "At Last! A No-Nonsense Guide to Bridal Essentials!   Feuding in-laws, rehearsal dinner meltdowns, controlling wedding planners— what’s a gal to do when her Big Day threatens to go down with more drama than a boatload of wedding crashers? Have no fear: The Bride’s Instruction Manual boils it all down to the basics, covering every topic you need to know to march down that aisle with confidence, from setting the date and choosing The Dress to creating your guest list.   Chock-full of cheat sheets to keep you on track and on budget, The Bride’s Instruction Manual is the perfect shower gift for every blushing bride-to-be—courtesy of veteran wedding journalist Carrie Denny.",
        "Category": " Reference , Weddings",
        "Publisher": "Quirk Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Heroes: U.S. Marine Corps Medal of Honor Winners",
        "Authors": "By Cerasini, Marc",
        "Description": "The United States Marine Corps Medal of Honor, awarded for outstanding courage and sacrifice in combat, is the greatest honor a marine can hope to attain. In over two hundred years of Marine Corps existence, only 293 marines have received this honor.  These are their stories.  From the American Revolution to the Persian Gulf, this comprehensive book features detailed information on 293 Marine Corps Medal of Honor winners, with 150 in-depth accounts of those who demonstrated the courage and determination which are the cornerstones of the United States Marine Corps-in a compelling chronicle of those who have truly earned the rank of \"heroes.\"",
        "Category": " History , Military , General",
        "Publisher": "Berkley Hardcover",
        "Price Starting With ($)": "5.45",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Woodrow Wilson (Penguin Lives)",
        "Authors": "By Auchincloss, Louis",
        "Description": "In this portrait of Woodrow Wilson, Auchincloss examines the president who is perhaps better remembered for the force of his personality than for his accomplishments. A man of enormous energy but plagued by ill health, an admirer of the parliamentary system whose contentious relationship with Congress led to the crushing defeat of his cherished League of Nations, Wilson remains a fascinating enigma. We will always be left to ponder the extent to which his character shaped our century's history.This study sheds new light on Wilson's upbringing and career, from the grim determination that enabled him to overcome dyslexia to his skillful dance of isolationism and intervention in World War I. From the dynamic figure whose ringing speeches hypnotized vast crowds, to the gentle voice reading poetry to his children, to the rising academic and president of Princeton who made the giant leap into politics.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "MURDER ON THE THIRTY-FIRST FLO (Pantheon international crime)",
        "Authors": "By Wahloo, Per",
        "Description": "Chief Inspector Jensen investigates a bomb threat made to the nation's publishing conglomerate, supposedly in retaliation for a murder",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pantheon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1982"
        }
    },
    {
        "Title": "The Power of Freedom: Uniting Human Rights and Development",
        "Authors": "By Chauffour, Jean-pierre",
        "Description": "Arguing that freedom in all senses--civil, political, economic, social, and cultural--must be applied to thinking about economic development and human rights, Chauffour discusses the relationship between the two and how to think about one in the context of the other. He examines the UN's Declaration on the Right to Development, its historical and legal contexts and flaws, and other human rights instruments such as the UN Charter, Universal Declaration of Human Rights, and the International Covenants on Human Rights. He examines concepts of core rights, positive rights and liberty, rights holders, and economic needs and rights. He discusses how the right to development relates to developing countries' poverty reduction strategies, the Millennium Development Goals, and the official development assistance of developed countries. He then describes a policy framework that is aimed at low-income countries and stagnant economies. Chauffour, who has worked with international institutions such as the International Monetary Fund, is an economic advisor in the World Bank's International Trade Department. Annotation ©2009 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Human Rights",
        "Publisher": "Cato Institute",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Career Coward's Guide to Interviewing: Sensible Strategies for Overcoming Job Search Fears (Career Coward's Guides)",
        "Authors": "By Piotrowski, Katy",
        "Description": "Offers advice on preparing for a job interview, with insight on building confidence, assessing strengths and weaknesses, starting and ending an interview successfully, negotiating an offer, and dealing with rejection.",
        "Category": " Business & Economics , Careers , Job Hunting",
        "Publisher": "JIST Works",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "Psi Hunt",
        "Authors": "By Kurland, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "September",
            "Year": "1980"
        }
    },
    {
        "Title": "The Real Book About Stars (Real Book Series, 9)",
        "Authors": "By Hal Goodwin",
        "Description": "",
        "Category": "",
        "Publisher": "Garden City Books, by arrangement with E. Watts [N",
        "Price Starting With ($)": "9.73",
        "Publish Date": {
            "Month": "January",
            "Year": "1951"
        }
    },
    {
        "Title": "The Complete Real Estate Investment Handbook: A Professional Investment Strategy",
        "Authors": "By Sirmans, C. F. and Jaffe, Austin J.",
        "Description": "Sets forth guidelines for developing an effective real estate investment strategy, discussing cash flow forecasting, investment criteria, investor's objections, and makert analysis",
        "Category": " Business & Economics , General",
        "Publisher": "Prentice Hall Direct",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Kidbits",
        "Authors": "By Jenny Tesar",
        "Description": "",
        "Category": "",
        "Publisher": "Blackbirch Press, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Heaven and the Heather",
        "Authors": "By Holcombe, Elizabeth",
        "Description": "Betrothed against her will to a powerful but scheming Scottish lord, Sabine de Sainte Montagne, a member of the court of Mary, Queen of Scots, finds her life turned upside down by the proud and fierce Niall MacGregor, the chief of an outlaw clan. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Jove",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Ecotactics",
        "Authors": "By Sierra Club",
        "Description": "",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "14.97",
        "Publish Date": {
            "Month": "March",
            "Year": "1970"
        }
    },
    {
        "Title": "C. S. Lewis: Writer and Scholar (Heroes of the Faith)",
        "Authors": "By Wellman, Sam",
        "Description": "Presents the life and times of the author who created the fantasy world of Narnia.",
        "Category": " Biography & Autobiography , Religious",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "Have You Ever . . . ?",
        "Authors": "By Christie, Les",
        "Description": "Have you ever. . .? -Thought you were going to die? (When? Where? What brought you through it? - Been a teacher's pet? (What grade? How did you feel?) - Had a miracle happen to you? (What happened? Who did you tell?) - Said something you didn't mean just to be polite? (Why did you do it? What situation would cause you to do it again?) Inside are 442 more zingers like these, that nudge your kids' memories and get them talking -- perfect for launching small-group discussion, building community, getting a laugh and triggering hard thinking about situations and people that matter most to teenagers. Keep Have You Ever . . .? handy -- stick it in your pocket, your backpack, your car's glove box -- because you'll never know when you need a leading question to get conversation rolling with an individual or a group.",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Taken by the Prince (Governess Brides Series)",
        "Authors": "By Dodd, Christina",
        "Description": "No longer able to ignore their secret past, Victoria Cardiff, after encountering Saber Lawrence, a renegade prince plotting to seize control of his country, at a ball, confronts him, only to be kidnapped by this dangerous man who will stop at nothing, not even seduction, to ensure her silence. Original. 250,000 first printing.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "The Impressionists: Their Lives and Worlds",
        "Authors": "By Romano, Eileen",
        "Description": "The friendships, working relationships, and rivalries of the French Impressionist painters of the late nineteenth century--such as Monet, Degas, Ce+a7zanne, and Renoir--are put into perspective with the world in which they lived.",
        "Category": " Art , History , General",
        "Publisher": "Penguin Studio",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Principles of Intensive Psychotherapy",
        "Authors": "By Frieda Fromm-Reichmann",
        "Description": "",
        "Category": "",
        "Publisher": "University Of Chicago Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1950"
        }
    },
    {
        "Title": "Fantasia Mathematica - Being A Set Of Stories, Together With A Group Of Oddments And Diversions, All Drawn From The Universe...",
        "Authors": "By Clifton Fadiman",
        "Description": "",
        "Category": "",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "23.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1958"
        }
    },
    {
        "Title": "An Amish Christmas, Expanded Edition: A Choice to Forgive / A Miracle for Miriam / One Child / Christmas Cradles",
        "Authors": "By Cameron, Barbara, Fuller, Kathleen, Long, Kelly, and Wiseman, Beth",
        "Description": "Celebrate Christmas with four Amish romances.“A Choice to Forgive” by Beth Wiseman After Daniel disappeared that long-ago Christmas Eve, Lydia built a life with his brother. But now she's a widow and Daniel has reappeared, asking for forgiveness. Can she go back to her normal life with her long-lost love as her neighbor?“A Miracle for Miriam” by Kathleen FullerSeth is no longer the arrogant young man who shattered Miriam's confidence and broke her heart. Will he be able to show \"plain\" Miriam that she is truly beautiful to him?“One Child” by Barbara CameronThe birth of one child forever changed the world two thousand years ago. On a snowy Christmas night in Lancaster County, another child changes the world for two very different couples.\"Christmas Cradles\" by Kelly LongWhen Anna Stolis takes over for her aunt, the local midwife, Christmas night heats up with multiple deliveries, three strangers' quilts, and unexpected help from the handsome and brooding Asa Lapp.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "Why Mars and Venus Collide: Improving Relationships by Understanding How Men and Women Cope Differently with Stress",
        "Authors": "By Gray, John",
        "Description": "Once upon a time, Martians and Venusians functioned in separate worlds. But in today's hectic and career-oriented environment, relationships have become a lot more complicated, and men and women are experiencing unprecedented levels of stress. To add to the increasing tension, most men and women are also completely unaware that they are actually hardwired to react differently to the stress. It's a common scenario: a husband returns home from work stressed out and eager to kick back on the couch and watch television. A wife returns home from work stressed out and wants to talk about it with her husband. What happens? Neither is on the same page, anger and resentment set in, and Mars and Venus collide. Using his signature insight that has helped millions of couples transform their relationships, John Gray once again arms the inhabitants of Mars and Venus with information that will help them live harmoniously ever after. In Why Mars and Venus Collide, Gray focuses on the ways that men and women misinterpret and mismanage the stress in their daily lives, and how these reactions ultimately affect their relationships. \"It's not that he's just not into you; he needs to fulfill a biological need,\" Gray explains. \"And it's not that she wants to henpeck you; she also has a biological drive.\" He shows, for instance, how a husband's withdrawal is actually a natural way for him to replenish his depleted testosterone levels and restore his well-being, and how a woman's need for conversation and support helps her build her own stress-reducing hormone, oxytocin.Backed up by groundbreaking scientific research, Gray offers a clear, easy-to-understand program to bridge the gap between the two planets, providing effective communication strategies that will actually lower stress levels. Whether in a relationship or single, this book will help both men and women understand their new roles in a modern, work-oriented society, and allow them to discover a variety of new and practical ways to create a lifetime of love and harmony.",
        "Category": " Self-help , Self-Management , Stress Management",
        "Publisher": "Harper",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Borderline Patients: Psychoanalytic Perspectives (Monograph)",
        "Authors": "By Abend, Sander M., Porder, Michael S., and Willick., Artom S.",
        "Description": "",
        "Category": " Psychology , Movements , Psychoanalysis",
        "Publisher": "Intl Universities Pr Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1984"
        }
    },
    {
        "Title": "Power At Sea (Three Volume Set) The Age of Navalism / The Breaking Storm / A Violent Peace",
        "Authors": "By Rose, Lisle A.",
        "Description": "",
        "Category": "",
        "Publisher": "University of Missouri Press",
        "Price Starting With ($)": "19.7",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Magnolia",
        "Authors": "By Palmer, Diana",
        "Description": "Atlanta in 1900 was a city of contrasts: a bustling place where commerce and high society flourished amid the languid rhythms of the sultry South. Claire Lang loved her life there, but one man's presence unsettled her very soul. John Hawthorn's dark eyes and lean, handsome face captivated Claire more than she wanted to admit. And when tragedy struck, Claire found herself desperate enough to marry him&#151;a man who couldn't return her passionate love.As the fragrant scent of the magnolia wafted on warm breezes, Claire aroused fierce, unexpected desires in her elusive husband. And once she had tasted his kisses and savored his lovemaking, she dared to fight for him as a sizzling scandal threatened to engulf them and the love she began to believe could be theirs&#133;.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "HQN Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2010"
        }
    },
    {
        "Title": "An Original Sin (Paranormal Romance)",
        "Authors": "By Bangs, Nina",
        "Description": "",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Mathematical puzzles & diversions",
        "Authors": "By Martin Gardner",
        "Description": "",
        "Category": "",
        "Publisher": "Simon and Schuster",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "The Willing Wife",
        "Authors": "By Dain, Claudia",
        "Description": "Embarking on her fifth arranged marriage as ordered by King Henry, Nicolaa unexpectedly finds herself falling in love with her new husband, whose intelligence, compassion, and sensual demeanor takes her breath away. Original.",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Ellis Island Interviews: Immigrants Tell Their Stories In Their Own Words",
        "Authors": "By Peter Morton Coan",
        "Description": "",
        "Category": "",
        "Publisher": "Fall River Press",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Winter Spy",
        "Authors": "By Henissart, Paul",
        "Description": "",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Bible Cure for Allergies: Ancient Truths, Natural Remedies and the Latest Findings for Your Health Today",
        "Authors": "By Colbert, Donald",
        "Description": "OVER 3 MILLION BIBLE CURE BOOKS SOLDFROM THE NEW YORK TIMES BEST SELLING AUTHOR OF THE SEVEN PILLARS OF HEALTH AND I CAN DO THIS DIET This practical, informative booklet will expose the many nutritional, environmental and other underlying causes of allergies. Dr. Colbert presents insights from some of the top medical researchers in the world on allergy treatment, diagnosis and prevention. Dr. Colbert&#39;s extensive training in alternative therapies for allergies makes this booklet especially helpful for allergy sufferers who have spent thousands of dollars on medicines over the years.",
        "Category": " Health & Fitness , Allergies",
        "Publisher": "Siloam Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2000"
        }
    },
    {
        "Title": "Immortal Bad Boys, 2004 HARDCOVER",
        "Authors": "By Rebecca York, Rosemary Laurey, Linda Thomas-Sundstrom",
        "Description": "",
        "Category": "",
        "Publisher": "Kensington Publishing Corp.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "PURPOSE for EVERYDAY LIVING (FOR FATHERS)",
        "Authors": "By Simon & Schuster",
        "Description": "",
        "Category": "",
        "Publisher": "Freeman-Smith llc",
        "Price Starting With ($)": "5.39",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "It's Time to Eat",
        "Authors": "By Susan Riley",
        "Description": "",
        "Category": "",
        "Publisher": "Compass",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    }
]