[
    {
        "Title": "The Tail of Little Skunk (Step-Into-Reading, Step 2)",
        "Authors": "By Terry, Michael (ILT) and Arnold, Marsha Diane",
        "Description": "Little Skunk worries about how he will escape if Big Bear comes down from the mountain.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "The Pillars of the Earth: A Novel (Kingsbridge)",
        "Authors": "By Follett, Ken",
        "Description": "Nominated as one of America’s best-loved novels by PBS’s The Great American Read#1 New York Times BestsellerOprah's Book Club SelectionFrom the #1 New York Times bestselling author of A Column of Fire, the “monumental masterpiece” (Booklist) that changed the course of Ken Follett’s already phenomenal career. “Follett is a master,” extolled the Washington Post on the release of The Pillars of the Earth. A departure for the bestselling thriller writer, the historical epic stunned readers and critics alike with its ambitious scope and gripping humanity. Today, it stands as a testament to Follett’s unassailable command of the written word and to his universal appeal.  The Pillars of the Earth tells the story of Philip, prior of Kingsbridge, a devout and resourceful monk driven to build the greatest Gothic cathedral the world has known . . . of Tom, the mason who becomes his architect—a man divided in his soul . . . of the beautiful, elusive Lady Aliena, haunted by a secret shame . . . and of a struggle between good and evil that will turn church against state and brother against brother. A spellbinding epic tale of ambition, anarchy, and absolute power set against the sprawling medieval canvas of twelfth-century England, this is Ken Follett’s historical masterpiece.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "129.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "The Excellent 11: Qualities Teachers and Parents Use to Motivate, Inspire, and Educate Children",
        "Authors": "By Clark, Ron",
        "Description": "When The Essential 55 was published, Ron Clark became a tireless promoter, traveling the country to speak to large groups of teachers and fans. And when his Oprah appearance shot the book onto the New York Times bestseller list, he kept the heat on. We can expect the same tenacious commitment to promoting his follow-up book, The Excellent 11. The Excellent 11 contains eleven sections, with each one focusing on a theme directly related to teaching and raising children. Ron Clark draws from his own experience to give advice, telling personal stories that demonstrate the significance of each theme within the learning environment--an environment that extends beyond the classroom and into the larger world. Using themes ranging from Adventure, Ingenuity, and Humor to Dedication, Creativity, and Love, Clark provides a road map for both parents and teachers who want to enrich their children's learning experiences.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Disney's When Summer Is Over! (Disney's Winnie the Pooh's School Days)",
        "Authors": "By Disney Enterprises",
        "Description": "",
        "Category": "",
        "Publisher": "Disney Enterprises, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Book of Pooh: Beginning Sounds: Match the Flaps",
        "Authors": "By Barrett, John E. (ILT), Milne, A. A. (EDT), and Kennedy, Marge",
        "Description": "Winnie-the-Pooh and his friends introduce beginning sounds by inviting readers to find pictures-pairs that begin with the same sound, then lift the flaps for the matching letters.",
        "Category": " Juvenile Fiction , Concepts , Words",
        "Publisher": "Disney Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Over the Hills: A Midlife Escape Across America by Bicycle",
        "Authors": "By Lamb, David",
        "Description": "David Lamb gave himself - for this book - a fifty-fourth birthday present: a trip across America at ten miles per hour. The genesis of this notion occurred one afternoon when Lamb was seated at the bar of the Antlers Saloon in Wisdom, Montana. There was a hitching post outside and against it were two jet-black touring bicycles with stuffed panniers balanced over the rear wheels. The owners were a couple from Chicago on a biking vacation that would take them from Fargo, North Dakota, to Missoula, Montana. Lamb quizzed them as surely as he would have a wagonmaster headed west. It had never occurred to him that people actually traveled so far by bicycle, and the idea struck him as a captivating one, a kind of return to past times when to travel meant to experience an intimacy with the towns and valleys and mountains one crossed through or over.Lamb began his own journey on a sleek 21-speed touring bicycle, which would carry him 3,145 miles from his home in Alexandria, Virginia, all the way to the pier poking out into the Pacific Ocean in Santa Monica, California. He did no training for this feat, failed to curb his addictions to cigarettes and junk food, and along the way encountered an America all but invisible to those unfortunate travelers held hostage by the interstate. The journey took two months, and Over the Hills is the magnificent result: a literary travelogue, fun and celebratory, a story about people met and physical challenges overcome.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Unseen Guest",
        "Authors": "By David R Mains",
        "Description": "",
        "Category": "",
        "Publisher": "Mainstay Church Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "New American Pocket Medical Dictionary",
        "Authors": "By Nancy Roper",
        "Description": "",
        "Category": "",
        "Publisher": "Churchill Livingstone, Inc.",
        "Price Starting With ($)": "6.8",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "Psychiatric Dictionary",
        "Authors": "By Campbell, Robert Jean",
        "Description": "Newly revised and updated, this is the definitive reference work on psychiatric terminology.  It encompasses new information that has arisen from research advances, social changes, legal developments, and educational innovations since the appearance of the fifth edition in 1981.  Many new terms have been added from the study of agoraphobia and panic disorder; sleep, speech, and eating disorders; depression; disorders in cognitive functioning; and particularly from neuroscience and psychopharmacology. In addition, the nomenclature of the recently revised third edition of the Diagnostic and Statistical Manual of the American Psychiatric Association has been incorporated.  The result is an authoritative reference that offers encyclopedic, up-to-date coverage of all areas of psychiatric interest.  Called \"by far the best and most complete dictionary devoted to this subject\" (Psychiatric Quarterly on a previous edition), this new edition will be welcomed by all professionals and students in the field of mental health.",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "7.14",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Textbook of Child and Adolescent Psychiatry",
        "Authors": "By Wiener, Jerry M. (EDT)",
        "Description": "A clinically focused textbook encompassing the state of the art and the science, intended for pediatricians and other clinicians and for students. The ten sections comprise chapters on assessment and diagnosis; various types of disorders developmental, schizophrenia and affect, conduct and behavior, anxiety, eating and nutrition, tic and movement, and somatic function; and special issues and treatment. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Amer Psychiatric Pub",
        "Price Starting With ($)": "9.14",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Sam Durell, Assignment Black Viking",
        "Authors": "By Edward S. Aarons",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Hello Peter Rabbit",
        "Authors": "By Vining, Alex (ILT) and Potter, Beatrix (CRT)",
        "Description": "From crinkly leaves to a fuzzy blanket,  oversized touch-and-feel elements introduce preschoolers to the lively world of Peter Rabbit.",
        "Category": " Juvenile Fiction , Interactive Adventures",
        "Publisher": "Warne",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Good Morning, Sweetie Pie and Other Poems for Little Children",
        "Authors": "By Rylant, Cynthia and Dyer, Jane (ILT)",
        "Description": "When the birds begin their singing  and the sun begins its sunning  and the morning glories  open up all blue...  there's a mama or a papa  or a gramma somewhere saying:  \"Good morning, Sweetie Pie,  how are you?\"  From waking up and eating breakfast to bath and bedtime, these eight tender and gleeful poems celebrate the precious, everyday moments shared by parent and child. Through the lilting verse of Newbery Medalist Cynthia Rylant and illustrations beautifully crafted by best-selling artist Jane Dyer, the energy and exhilaration that sweetens every instance of toddlerhood will be relived again and again.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Simon & Schuster Children's Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "All About Corduroy",
        "Authors": "By Don Freeman",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Antioxidant Revolution",
        "Authors": "By Cooper, Kenneth H.",
        "Description": "From the groundbreaker in preventive medicine and father of the worldwide aerobics movement, Dr. Cooper takes the latest scientific antioxidant search from around the world and brings you a simple four step life plan that will revolutionize your health.  It's the simplest plan yet to build you own personal defense system for a longer, healthier life!",
        "Category": " Medical , Alternative & Complementary Medicine",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1997"
        }
    },
    {
        "Title": "Multiple Sclerosis: The Facts You Need (Your Personal Health)",
        "Authors": "By O'Connor, Paul",
        "Description": "Multiple sclerosis -- MS -- strikes about one in a thousand North Americans, usually in early adulthood, when they are building careers and starting families. Because the disease involves the central nervous system, its effects are wide-ranging and difficult to predict.    Multiple Sclerosis: The Facts You Need -- part of the Your Personal Health Series -- is a fact filled, comprehensive guide to living with MS, supported by diagrams, case histories, a drug table and an extensive list of helpful books and organizations. Topics include:    what MS is, and who gets it;  how MS is diagnosed as \"possible,\" \"probable\" or \"definite\";  why the disease affects different people in different ways;  how \"relapsing-remitting\" MS differs from \"progressive\" MS;  how people with MS and their families, can adapt            their homes, careers and lifestyles to cope with the disease;  which treatments work, which don't and what help is on the horizon.    Combining authoritative medical advice and practical hands-on tips, Multiple Sclerosis: The Facts You Need is an invaluable guide for  anyone affected, directly or indirectly by this complex disease.",
        "Category": " Health & Fitness , Diseases , Nervous System (incl. Brain)",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Sheeps Surprise (Phonics Readers Plus)",
        "Authors": "By Sengel",
        "Description": "",
        "Category": "",
        "Publisher": "Hmh Supplemental",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Wellness Encyclopedia the Comprehensive",
        "Authors": "By Wellness Letter Editors",
        "Description": "A medical reference that emphasizes preventive medicine",
        "Category": " Medical , General",
        "Publisher": "Houghton Mifflin Co",
        "Price Starting With ($)": "7.32",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "What To Do When Your Child Gets Sick (What to Do) (What to Do for Health)",
        "Authors": "By Mayer, Gloria G., Kuklier, Ann, and Kuklierus, Ann",
        "Description": "The Vietnamese edition of What To Do When Your Child Gets Sick. My child is sick. What should I do?  There are many things you can do at home for your sick child. At last, and easy-to-read, easy-to use book written by two nurses who know. This book tells you: what to look for when your child is sick, when to call the doctor, how to take your child's temperature, what to do when your child has the flu, how to care for cuts and scrapes, what to feed your child when he or she is sick, how to stop the spread of infection, how to prevent accidents around your home and what to do in an emergency.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Institute for Healthcare Advancement",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "West Virginia Blue Book 2004",
        "Authors": "By Darrell E. Holmes",
        "Description": "",
        "Category": "",
        "Publisher": "CHAPMAN PRINTING",
        "Price Starting With ($)": "6.51",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "The Well Adult: How to Stay Well- What to Do If You Are Ill",
        "Authors": "By Samuels, Mike and Samuels, Nancy",
        "Description": "",
        "Category": "",
        "Publisher": "Summit Books",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Disney's Beauty and the Beast : The Tale of Chip the Teacup (a First Little Golden Book)",
        "Authors": "By Betty Birney",
        "Description": "Through her great capacity to love, a kind and beautiful maid releases a handsome prince from the spell which has made him an ugly beast.",
        "Category": "",
        "Publisher": "West Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Animal Pals Abc (Animal Pals Series)",
        "Authors": "By Parmentier, Henri",
        "Description": "The letters of the alphabet are illustrated by rabbits, cats, elephants, bears, and other animals",
        "Category": "",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Winnie - the - Pooh's ABC",
        "Authors": "By Milne, A. A. and Shepard, Ernest H.",
        "Description": "An alphabet book presenting words and illustrations from the classic Pooh books helps young readers learn their alphabet, using the treasured pictures of Ernest Shepard and featuring a bright and eye-catching design.",
        "Category": " Juvenile Nonfiction , Concepts , General",
        "Publisher": "Dutton Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Dumbo at Bat",
        "Authors": "By Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Li'l Wolf Saves the Day (Walt Disney Fun-To-Read Library, Volume 16)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Dell Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Rudolph the Red-Nosed Reindeer (Rudolph the Red-Nosed Reindeer) (Little Golden Book)",
        "Authors": "By Arkadia (COR) and Bunsen, Rick (ADP)",
        "Description": "Children ages 3-6 will love to read this Little Golden Book retelling of the classic 1964 holiday TV special, Rudolph the Red-Nosed Reindeer. All of the other reindeer make fun of Rudolph and won't let him play in their reindeer games because he's different. But when Christmas is almost cancelled because of a huge snowstorm, Rudolph comes to the rescue with his wonderful shiny red nose.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Christmas & Advent",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Pooh Plans a Party (Walt Disney Fun-To-Read Library, Volume 18)",
        "Authors": "By Walt Disney",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Dell Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "Night Gliders",
        "Authors": "By Mathis, Melissa Bay (ILT) and Ryder, Joanne",
        "Description": "",
        "Category": " Juvenile Nonfiction , Animals , Mice, Hamsters, Guinea Pigs, Squirrels, etc.",
        "Publisher": "Troll Communications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "A Stable in Bethlehem: A Christmas Counting Story (A First Little Golden Book)",
        "Authors": "By Joy N. Hulme",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Secret Garden (HarperClassics)",
        "Authors": "By Burnett, Frances Hodgson and Tudor, Tasha (ILT)",
        "Description": "Celebrate an unforgettable classic with this beautifully illustrated 100th anniversary edition.This 100th anniversary paperback includes Tasha Tudor’s iconic illustrations, an extended author biography, activities, and more, making it the perfect collector’s edition or a wonderful gift for young readers.When orphaned Mary Lennox comes to live at her uncle's great house on the Yorkshire Moors, she finds it full of secrets. The mansion has nearly one hundred rooms, and her uncle keeps himself locked up. And at night, she hears the sound of crying down one of the long corridors.The gardens surrounding the large property are Mary's only escape. Then, Mary discovers a secret garden, surrounded by walls and locked with a missing key. With the help of two unexpected companions, Mary discovers a way in—and becomes determined to bring the garden back to life.",
        "Category": " Juvenile Fiction , People & Places , Europe",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "The Everyday Arthritis Solution: Food, Movement, and Lifestyle Secrets to Ease the Pain and Feel Your Best",
        "Authors": "By Laliberte, Richard, Kraus, Virginia Byers, and Rooks, Daniel S.",
        "Description": "Introduces a complete program of exercise, nutritional supplements, and diet designed to help sufferers decrease the painful symptoms of arthritis and promote healthy joints, offering a series of easy-to-follow exercise routines and targeted exercises tailored to special needs, as well as more than forty delicious recipes. Original.",
        "Category": " Health & Fitness , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Guide to Medical Cures and Treatments",
        "Authors": "By",
        "Description": "Discusses more than four hundred and fifty diseases with questions and answers to help understand the causes, treatments, tests, and alternative treatmemts",
        "Category": " Medical , General",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Unpuzzling Your Past Workbook",
        "Authors": "By Croom, Emily Anne",
        "Description": "",
        "Category": " Reference , Genealogy & Heraldry",
        "Publisher": "Betterway Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Walt Disney's Alice in Wonderland Meets the White Rabbit (a Little Golden Book)",
        "Authors": "By Werner, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Press",
        "Price Starting With ($)": "13.13",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Pocketful of Nonsense (Little Golden Book)",
        "Authors": "By Marshall, James",
        "Description": "A collection of such nonsense verses as Fuzzy Wuzzy was a bear, I love you, I love you, and Teddy Bear, Teddy Bear.",
        "Category": " Juvenile Nonfiction , Poetry , Humorous",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1992"
        }
    },
    {
        "Title": "Old Mother Goose and other nursery rhymes (A Little golden book)",
        "Authors": "By",
        "Description": "An illustrated collection of traditional rhymes.",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "BUGS BUNNY and the Health Hog",
        "Authors": "By Slater, Teddy",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Cabbage Patch Kids present Xavier's birthday surprise! (A Little Golden book)",
        "Authors": "By Hill, Ari",
        "Description": "The Cabbage Patch Kids audition for a talent show to celebrate Xavier's birthday, but Sybil Sadie, who's running the program, hurts a lot of feelings by telling the Kids they're not quite good enough.",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Disney's Mickey's Christmas Carol (Little Golden)",
        "Authors": "By unknown",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Christmas Bunny (Little Golden Book)",
        "Authors": "By Golden Books",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "Inner Cleansing: How to Free Yourself from Joint-Muscle-Artery-Circulation Sludge",
        "Authors": "By Wade, Carlson",
        "Description": "Argues that the unidentified cause of a variety of common health care problems is the accumulation of biological poisons in the body and suggests a diet that will cleanse and rejuvenate the body",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1983"
        }
    },
    {
        "Title": "ADOPT INTERNATIONAL",
        "Authors": "By Sweet, O. Robin and Bryan, Patty",
        "Description": "A comprehensive guide, Adopt International provides step-by-step advice on everything from selecting an adoption agency to traveling abroad to pick up your child to adjusting to a new life at home. The book walks you through the myriad government regulations and complicated forms (both American and foreign) as well as the financial issues involved. Finally, it includes the stories of people who have successfully adopted one or more children from across the world.",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Farrar, Straus and Giroux",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Daniel in the Lions' Den (A Little Golden Book)",
        "Authors": "By Broughton, Pamela",
        "Description": "A retelling of the Old Testament story of Daniel and how his belief in God saved him when he was thrown into the lion's den.",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Winnie the Pooh and the Honey Tree (A Little Golden Book)",
        "Authors": "By Hicks, Russell (ILT) and Packard, Mary (ADP)",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1995"
        }
    },
    {
        "Title": "Walt Disney's The Sorcerer's Apprentice (A Little Golden Book)",
        "Authors": "By Emslie, Peter (ILT) and Ferguson, Don (ADP)",
        "Description": "",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "The Jungle Book (Disney The Jungle Book) (Little Golden Book)",
        "Authors": "By Golden Books Publishing Company (COR)",
        "Description": "YOUNG MOWGLI LOVES growing up in the jungle with his animal friends. But what happens  when he is told that he must go live in the Man-village? Find out in this Little  Golden Book retelling of the classic Disney movie The Jungle Book.",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Golden/Disney",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Pandas take a vacation (A Big little golden book)",
        "Authors": "By Maestro, Betsy",
        "Description": "",
        "Category": "",
        "Publisher": "Western Pub. Co",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "Viewing Violence",
        "Authors": "By Levine, Madeline",
        "Description": "Psychologist and mother Madeline Levine looks at the history of television and movie violence in the United States. She translates into everyday language the results of over four decades of research on the effects of media violence - research that up until now has been inaccessible to most parents. Using a \"developmental approach,\" Dr. Levine helps parents understand that children at different ages think about, understand, and experience the world in very different ways. An appreciation of these differences in how children \"see\" things is critical if parents are to make wise choices about what is appropriate and what is potentially harmful to their children. Using research findings, common sense, and personal experience, Dr. Levine demonstrates that violence is not generic - and neither are children: the movie that may be instructive and appropriate for an eleven-year-old may be traumatic and overwhelming for a seven-year-old. Parents frequently underestimate the impact of violent television on their children and may be surprised at what children find upsetting.Dr. Levine argues that the issue of media violence is not trivial, that our society is increasingly at risk not only for higher levels of violence but for a greater tolerance and acceptance of this violence. In spite of efforts from both sides of the political spectrum to claim media violence as a political issue, Dr. Levine insists this is a parenting and citizenship issue. She looks at how parents, government, schools, and the media itself can best approach the problem. The book concludes with a list of resources to help parents become active in media reform.",
        "Category": " Social Science , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Essential Partnership: How Parents and Children Can Meet the Emotional Challenges of Infancy",
        "Authors": "By Greenspan, Stanley I. and Greenspan, Nancy Thorndike",
        "Description": "Utilizing case histories, the authors show parents how to work and play with their children to reinforce positive behavior",
        "Category": "",
        "Publisher": "Viking",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1989"
        }
    },
    {
        "Title": "Why Animals Don't Get Heart Attacks but People Do",
        "Authors": "By Matthias, Rath",
        "Description": "",
        "Category": "",
        "Publisher": "Matthias Rath Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The Macrobiotic approach to cancer: Towards preventing & controlling cancer with diet and lifestyle",
        "Authors": "By Kushi, Michio",
        "Description": "Examines the role of nutrition in the development of cancer and discusses methods for treating cancer with a diet based on whole grains, vegetables, beans, and seasonal fruits",
        "Category": "",
        "Publisher": "Avery Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Natural Healing Secrets [Mass Market Paperback] by chicester, Brian",
        "Authors": "By Brian chicester",
        "Description": "",
        "Category": "",
        "Publisher": "Ottenheimer",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "After Any Diagnosis: How to Take Action Against Your Illness Using the Best and Most Current Medical Information Available",
        "Authors": "By Svec, Carol",
        "Description": "Explains how consumers can wade through the overwhelming amount of medical information available to find the most accurate data and select the best possible treatment for any illness, offering helpful tips on searching for relevant data, using sources to their best advantage, rating the reliability and accuracy of information, research medical facilities, and more. Original. 15,000 first printing.",
        "Category": " Medical , Reference",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2001"
        }
    },
    {
        "Title": "Listen to Your Body: A Head-To-Toe Guide to More Than 400 Common Symptoms, Their Causes and Best Treatments",
        "Authors": "By Michaud, Ellen and Anastas, Lila L.",
        "Description": "Answers health questions, detailing treatment strategies for numerous common conditions and diseases",
        "Category": " Health & Fitness , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "67 Ways to Good Sleep: A People's Medical Society Book",
        "Authors": "By Inlander, Charles B. and Moran, Cynthia K.",
        "Description": "Offering tested and proven ways to get to sleep and stay asleep for the night, a guide based on reviews of worldwide medical literature and interviews with experts answers the major questions and offers techniques to deal with sleeplessness. Simultaneous.",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Walker & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "What Do You Like to Wear? (In Between Books)",
        "Authors": "By Dodd, Emma (ILT) and Reidy, Hannah",
        "Description": "Examines various articles of clothing worn for different occasions, while introducing descriptive words such as \"furry,\" \"itchy,\" and \"frilly\"",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Walt Disney's Donald Duck on Tom Sawyer's Island (Tell-A-Tale Books)",
        "Authors": "By Dorothea J. Snow",
        "Description": "",
        "Category": "",
        "Publisher": "Western",
        "Price Starting With ($)": "9.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1960"
        }
    },
    {
        "Title": "The Complete Home Healer: Your Guide to Every Treatment Available for 300 of the Most Common Health Problems",
        "Authors": "By Smyth, Angela",
        "Description": "A comprehensive home reference guide provides complete information about the possible causes of three hundred ailments--from acne to Alzheimer's--and kinds of treatment, from alternative and ancient therapeutic practices to the latest in modern Western medical techniques. $50,000 ad/promo.",
        "Category": " Medical , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "May",
            "Year": "1994"
        }
    },
    {
        "Title": "On Target : The Book on Marketing Plans",
        "Authors": "By Berry, Tim and Wilson, Doug",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Palo Alto Software Inc",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "Secrets and Lies: Digital Security in a Networked World",
        "Authors": "By Schneier, Bruce",
        "Description": "Bestselling author Bruce Schneier offers his expert guidance on achieving security on a networkInternationally recognized computer security expert Bruce Schneier offers a practical, straightforward guide to achieving security throughout computer networks. Schneier uses his extensive field experience with his own clients to dispel the myths that often mislead IT managers as they try to build secure systems. This practical guide provides readers with a better understanding of why protecting information is harder in the digital world, what they need to know to protect digital information, how to assess business and corporate security needs, and much more.* Walks the reader through the real choices they have now for digital security and how to pick and choose the right one to meet their business needs* Explains what cryptography can and can't do in achieving digital security",
        "Category": " Computers , Security , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "A Gothic Treasure Trove: Moonraker's Bride / The Golden Unicorn / Kirkland Revels / Wings of the Falcon / Lady of Mallow / River Rising",
        "Authors": "By Reader's Digest Association",
        "Description": "",
        "Category": "",
        "Publisher": "The Reader's Digest Association, Inc.",
        "Price Starting With ($)": "6.44",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "On Liberty & the Subjection of Women",
        "Authors": "By Mill, John Stuart",
        "Description": "",
        "Category": " Fiction , Classics",
        "Publisher": "Wordsworth Editions Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "Differentiating Instruction in the Regular Classroom: How to Reach and Teach All Learners, Grades 3-12",
        "Authors": "By Heacox, Diane",
        "Description": "\"In this updated edition of the popular and trusted guide, Diane Heacox provides a practical introduction to differentiation and explains how to differentiate instruction in a wide range of settings to provide variety and challenge in how teachers teach and in how students learn. Individual chapters focus on evaluation in a differentiated classroom and how to manage both behavior and work tasks. The author describes ways to get to know students and recognize that all have strengths and limitations. Templates and forms simplify planning; examples illustrate differentiation in many content areas. The book is refreshed throughout to reflect today's most effective practices in curriculum design and instructional methods. New features include connections to Common Core State Standards, revised information on multiple intelligences, updated bibliography and resources, and a PowerPoint presentation for use in staff training and professional development. The accompanying CD-ROM provides the PowerPoint and all ofthe reproducible forms from the book along with further examples of curriculum maps, workcards, and matrix plans. Teachers can print out what they need, when they need it, and can customize forms for their own classrooms and students\"--",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Free Spirit Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Wales: The Rough Guide, Second Edition",
        "Authors": "By Parker, Mike and Whitfield, Paul",
        "Description": "Provides information for traveling in Wales, including travel tips, recommended accommodations and restaurants, and background on its culture and history",
        "Category": " Travel , Europe , Great Britain",
        "Publisher": "Rough Guides",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Me and you book  (Britannica Discovery Library)",
        "Authors": "By [Timmons, Christine]",
        "Description": "Discusses the color of both natural and manmade things in the world and basic concepts of mixing colors. Includes color reproductions of some famous paintings.",
        "Category": "",
        "Publisher": "Encyclopaedia Britannica",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "The Accessible Home: Updating Your Home for Changing Physical Needs",
        "Authors": "By Editors of Creative Publishing Internati, international, The Editors of Creative Publishing",
        "Description": "",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "About Your House",
        "Authors": "By Binsacca, Rich and Yapp, Bob",
        "Description": "The companion volume to the fall 1997 PBS television series presents common maintenance advice intended to keep a house more functional as well as more beautiful, with step-by-step instructions for making the most basic kinds of household repairs. Original. TV tie-in. 20,000 first printing. IP.",
        "Category": " House & Home , Repair",
        "Publisher": "Bay Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Exploring Moscow & St. Petersburg (1995)",
        "Authors": "By Cure, Karen (EDT)",
        "Description": "· A lively, graphic, full-color guidebook to Moscow & St. Petersburg.· Color photography and archival and other illustrations throughout; zingy captions.· Intelligent, opinionated writing by Christopher and Melanie Rice.· Solid travel reportage on every region punctuated by lively sidebars on local color, personalities, culture, and history--all packed with fascinating trivia.· What to see and do, plus recommended tours.· Special rating system identifying not-to-be-missed sights.· To-the-point reviews of dining and lodging.· Key planning information.· Over 20 detailed maps and plans.· Comprehensive destination/topic index.",
        "Category": " Travel , Russia",
        "Publisher": "Fodor's",
        "Price Starting With ($)": "5.97",
        "Publish Date": {
            "Month": "September",
            "Year": "1995"
        }
    },
    {
        "Title": "Frommer's Adventure Guides: Australia and New Zealand (FROMMER'S ADVENTURE GUIDE AUSTRALIA AND NEW ZEALAND)",
        "Authors": "By Frommer, Arthur",
        "Description": "This exciting guide — written by a host of seasoned travel authors, ranging from the first New Zealander to qualify as a hot air balloon pilot to the operator of a popular walking tours company- offers endless possibilities for readers interested in exploring on foot, by boat, by bike or by jeep, or on horseback. Lively personal accounts of numerous adventures, including diving in the Great Barrier Reef, taking a jeep through the Outback, or discovering ancient Maori trails in New Zealand, will whet readers' appetites for a trip down under.The guides are packed with contact addresses for everything from tour companies to equipment resources. They also feature maps, a seasonal calendar and an alphabetical listing of activities to enjoy.",
        "Category": " Travel , Australia & Oceania",
        "Publisher": "Frommers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "The lighthouse book",
        "Authors": "By Crompton, Samuel Willard",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "America 24/7",
        "Authors": "By Smolan, Rick (EDT) and Cohen, David Elliott (EDT)",
        "Description": "A remarkable collection of digital photographs, representing the talents of hundreds of professional and amateur photographers, provides a visual time capsule of American life, capturing a stunning diversity of people, cultures, and accomplishments across America. 400,000 first printing. $600,000 ad/promo.",
        "Category": " Photography , Photojournalism",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "10.34",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The American Presidents",
        "Authors": "By Whitney, David C. and Whitney, Robin Vaughn",
        "Description": "Revised and updated to include both terms of Bill Clinton, as well as a profile of George W. Bush, this collection of presidential biographies introduces readers to the broad sweep of American chief executives and the events that shaped their administrations.",
        "Category": " Biography & Autobiography , Presidents & Heads of State",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.52",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The First Wives Club",
        "Authors": "By Goldsmith, Olivia",
        "Description": "Three faithful, middle-aged wives, who have been abandoned for \"trophy wives\"--younger, blonder, and sexier models--by their successful husbands, plot their sweet revenge. 100,000 first printing. Major ad/promo. Lit Guild Feat Alt. Tour.",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Perricone Promise: Look Younger, Live Longer in Three Easy Steps",
        "Authors": "By Perricone, Nicholas",
        "Description": "A twenty-eight-day, total-body aging reversal program discusses how neuropeptides can be regulated through diet, supplements, and topical applications in order to reduce wrinkles, promote weight loss, and enhance brain function. By the author of The Wrinkle Cure. Reprint. 100,000 first printing.",
        "Category": " Health & Fitness , Diseases , Skin",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "God's Little Devotional Book for Couples (God's Little Devotional Books)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Honor Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Oceans (First Starts)",
        "Authors": "By Palmer, Joy",
        "Description": "Describes the world's oceans, discussing marine plants and animals, how people use the ocean's resources, and protecting oceans from pollution.",
        "Category": " Juvenile Nonfiction , Science & Nature , Astronomy",
        "Publisher": "Steck-Vaughn Company",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "April",
            "Year": "1994"
        }
    },
    {
        "Title": "Born on a Blue Day: Inside the Extraordinary Mind of an Autistic Savant",
        "Authors": "By Tammet, Daniel",
        "Description": "Born on a Blue Day is a journey into one of the most fascinating minds alive today -- guided by its owner himself. Daniel Tammet sees numbers as shapes, colors, and textures, and he can perform extraordinary calculations in his head. He can learn to speak new languages fluently, from scratch, in a week. In 2004, he memorized and recited more than 22,000 digits of pi, setting a record. He has savant syndrome, an extremely rare condition that gives him almost unimaginable mental powers, much like those portrayed by Dustin Hoffman in the film Rain Man.Daniel has a compulsive need for order and routine -- he eats the same precise amount of cereal for breakfast every morning and cannot leave the house without counting the number of items of clothing he's wearing. When he gets stressed or is unhappy, he closes his eyes and counts. But in one crucial way Daniel is not at all like the Rain Man: he is virtually unique among people who have sev- ere autistic disorders in that he is capable of living a fully independent life. He has emerged from the \"other side\" of autism with the ability to function successfully -- he is even able to explain what is happening inside his head.Born on a Blue Day is a triumphant and uplifting story, starting from early childhood, when Daniel was incapable of making friends and prone to tantrums, to young adulthood, when he learned how to control himself and to live independently, fell in love, experienced a religious conversion to Christianity, and most recently, emerged as a celebrity. The world's leading neuroscientists have been studying Daniel's ability to solve complicated math problems in one fell swoop by seeing shapes rather than making step-by-step calculations. Here he explains how he does it, and how he is able to learn new languages so quickly, simply by absorbing their patterns. Fascinating and inspiring, Born on a Blue Day explores what it's like to be special and gives us an insight into what makes us all human -- our minds.",
        "Category": " Psychology , Psychopathology , Autism Spectrum Disorders",
        "Publisher": "Free Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Conflict Free Living: How to build healthy relationships for life.",
        "Authors": "By Meyer, Joyce",
        "Description": "Every person in the world should experience the joy of a peaceful life. But we don’t! We are full of emotional bruises, grudges, stress, and unresolved issues in our relationships. But things do not need to be this way. We can take control of damaging emotional issues and restore peace in our lives, friendships, families, and marriages.Joyce Meyer reveals that at one time her life and ministry were in danger of being destroyed by conflict. In this book she describes the destructive effects that conflict and dissension can have on your life and shows you how to recognize and confront it—once and for all. By following the teaching in this book, you can make a decision today to keep conflict out of your life; out of your thoughts, words, and attitudes; and out of your relationships. Choose life! Choose peace!",
        "Category": " Religion , Christian Living , Personal Growth",
        "Publisher": "Charisma House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "The Longman Anthology of British Literature, Volume 1C: The Restoration and the 18th Century",
        "Authors": "By Damrosch, David (EDT) and Sherman, Stuart",
        "Description": "Volume 1C: The Restoration and the 18th Century of The Longman Anthology of British Literature is a comprehensive and thoughtfully arranged anthology that offers a rich selection of major British authors throughout the Restoration and the 18th Century.  The book includes Perspectives, Companion Readings, and \"and Its Time\" sections which show how major literary writings interrelate with and respond to various social, historical, and cultural events of Great Britain in the 18th Century. With a generous representation of fiction, drama, and poetry, the second edition includes major additions of important works and an expanded illustration program. Fresh and up-to-date introductions and notes are written by an editorial team whose members are all actively engaged in teaching and in current scholarship, and illustrations show both artistic and cultural developments of the period. For those interested in British Literature of the Restoration and 18th Century.",
        "Category": " Literary Criticism , General",
        "Publisher": "Longman",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Sunshine, Moonshine (Step-Into-Reading, Step 1)",
        "Authors": "By Armstrong, Jennifer and Washburn, Lucia (ILT)",
        "Description": "The sun and the moon shine down on a young boy as he spends a day by the sea. \"Sun shines on the mountains, sun shines on the sea. Sun shines on my pillow, and says wake up to me.\"",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Othello (No Fear Shakespeare) (Volume 9)",
        "Authors": "By Shakespeare, William and Crowther, John (EDT)",
        "Description": "Read Shakespeare’s plays in all their brilliance—and understand what every word means!   Don’t be intimidated by Shakespeare! These popular guides make the Bard’s plays accessible and enjoyable.Each No Fear guide contains:The complete text of the original playA line-by-line translation that puts the words into everyday languageA complete list of characters, with descriptionsPlenty of helpful commentary",
        "Category": " Study Aids , Book Notes",
        "Publisher": "SparkNotes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Bad Girls of the Bible and What We Can Learn from Them",
        "Authors": "By Higgs, Liz Curtis",
        "Description": "Women everywhere marvel at those “good girls” in Scripture–Sarah, Mary, Esther–but on most days, that’s not who they see when they look in the mirror. Most women (if they’re honest) see the selfishness of Sapphira or the deception of Delilah. They catch of glimpse of Jezebel’s take-charge pride or Eve’s disastrous disobedience. Like Bathsheba, Herodias, and the rest, today’s modern woman is surrounded by temptations, exhausted by the demands of daily living, and burdened by her own desires.So what’s a good girl to do? Learn from their lives, says beloved humor writer Liz Curtis Higgs, and by God’s grace, choose a better path. InBad Girls of the Bible, Higgs offers a unique and clear-sighted approach to understanding those “other women” in Scripture, combining a contemporary retelling of their stories with a solid, verse-by-verse study of their mistakes and what lessons women today can learn from them.Whether they were “Bad to the Bone,” “Bad for a Season, but Not Forever” or only “Bad for a Moment,” these infamous sisters show women hownot to handle the challenges of life. With her trademark humor and encouragement, Liz Curtis Higgs teaches us how to avoid their tragic mistakes and joyfully embrace grace.",
        "Category": " Religion , Biblical Studies , General",
        "Publisher": "WaterBrook",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "The Alexandria Link: A Novel",
        "Authors": "By Berry, Steve",
        "Description": "Cotton Malone retired from the high-risk world of elite operatives for the U.S. Justice Department to lead the low-key life of a rare-book dealer. But his quiet existence is shattered when he receives an anonymous e-mail: “You have something I want. You’re the only person on earth who knows where to find it. Go get it. You have 72 hours. If I don’t hear from you, you will be childless.” His horrified ex-wife confirms that the threat is real: Their teenage son has been kidnapped. When Malone’s Copenhagen bookshop is burned to the ground, it becomes brutally clear that those responsible will stop at nothing to get what they want. And what they want is nothing less than the lost Library of Alexandria. A cradle of ideas–historical, philosophical, literary, scientific, and religious–the Library of Alexandria was unparalleled in the world. But fifteen hundred years ago, it vanished into the mists of myth and legend–its vast bounty of wisdom coveted ever since by scholars, fortune hunters, and those who believe its untold secrets hold the key to ultimate power.Now a cartel of wealthy international moguls, bent on altering the course of history, is desperate to breach the library’s hallowed halls–and only Malone possesses the information they need to succeed. At stake is an explosive ancient document with the potential not only to change the destiny of the Middle East but to shake the world’s three major religions to their very foundations. Pursued by a lethal mercenary, Malone crosses the globe in search of answers. His quest will lead him to England and Portugal, even to the highest levels of American government–and the shattering outcome, deep in the Sinai desert, will have worldwide repercussions.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Temples On the Other Side: How Wisdom from \"Beyond the Veil\" Can Help You Right Now",
        "Authors": "By Browne, Sylvia",
        "Description": "",
        "Category": "",
        "Publisher": "Hay House Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "A Deeper Shade of Grace",
        "Authors": "By Keaggy, Bernadette",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Chordant Distribution",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "The Third Circle (Arcane Society)",
        "Authors": "By Quick, Amanda",
        "Description": "Leona Hewitt, disguised in men's formal evening clothes, has secretly made her way into Lord Delbridge's private museum to recover a relic stolen from her family years ago. But someone else is there in the dimly lit gallery, on the same errand: a tall black-cloaked man whose very voice is enough to put her in a trance.Thaddeus Ware, a mesmerist with powerful psychic energy, is accustomed to fearful reactions from others women in particular. After all. a man who can control the minds and actions of others could rob a lady of her virtue without her ever knowing! But Leona shows no trace of hysteria in his presence. A force to be reckoned with as both a gifted crystal worker and a woman, she exerts a rather hypnotic power over the hypnotist himself. And she is determined to keep the crystal they recovered, by giving him the slip at a run-down London inn.Thaddeus, on assignment for the secretive Arcane Society, knows the menace Leona is courting by absconding with the crystal. It is a source of remarkable energy, and it holds the potential for great destruction. Lord Delbridge has already killed two men to acquire it, for it is his key to membership in the elite, shadowy group known as the Third Circle. And with the help of a seductive hunter of preternatural skill, dubbed \"The Midnight Monster\" by the press. Delbridge intends to find her. With the stolen crystal in their possession, the danger is only beginning.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Reaching for the Invisible God",
        "Authors": "By Yancey, Philip",
        "Description": "\"How do I relate to a God who is invisible when I’m never quite sure he’s there?\" —Philip YanceyLife with God doesn’t always work out like you think it should. High expectations slam against the reality of personal weaknesses and unwelcome surprises. And the God who, you’ve been told, wants a personal relationship with you may seem remote, emotionally unavailable.Is God playing games? What can you count on this God for? How can you know God?This relationship with a God you can’t see, hear, or touch—how does it really work?Reaching for the Invisible God offers deep, satisfying insights to the questions you are sometimes afraid to ask.Honest and deeply personal, here is straight talk on Christian living for the reader who wants more than pat answers to life’s imponderables. Ultimately, Yancey shifts the focus from your questions to the One who offers himself in answer. “A brilliant book. It is both profound and simple, the best blend, in my view. Simple is neither shallow, nor simplistic. The sections on doubt and God’s ‘absence’ are classics.”—Rick Warren, pastor and author, The Purpose Driven Life",
        "Category": " Religion , Christian Living , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Late Bloomer",
        "Authors": "By Michaels, Fern",
        "Description": "From New York Times bestselling author Fern Michaels comes her most emotionally powerful novel to date -- a heartwarming tale of love and envy, friendship and forgiveness, that introduces an unforgettable heroine, Cady Jordan, who comes into her own as she recovers her memory of a childhood tragedy.  Twenty years have passed since the incident involving six lonely children at a secret playground in Indigo Valley, Pennsylvania, which left the town bully dead and ten-year-old Cady Jordan seriously injured. Now Cady has returned to the valley to care for her ailing grandmother, Lola, an eccentric retired Wlm star, who is the only person Cady has ever truly loved. While Cady has recovered physically and has grown into an attractive and intelligent but overly cautious young woman, she has no memory of her childhood tragedy. Lola desperately wants to see Cady embrace life and Wnd the happiness she deserves, so she pushes her granddaughter to \"remember\" so she can go forward with her life.  As Cady reacquaints herself with her old friends -- Amy, who is now a wife and mother; Andy, an insurance agent; Pete, an attorney; and Mac, the town's chief of police -- she begins to recall bits and pieces of what happened that fateful day. Cady also discovers a new zest for life and falls in love for the Wrst time. But her friends don't want her to remember. If the truth comes out, their safe and secure lives might be ruined forever. Which of them will do what is best for Cady and acknowledge the truth? Which of them will betray her again and do what is best for themselves?  With vibrant characters, Michaels's distinctive blend of humor and poignancy, and a suspenseful story line that holds readers engrossed until the Wnal page is turned, Late Bloomer takes readers on a young woman's journey of self-discovery that is at once exciting, heartbreaking, and ultimately triumphant.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Paula Deen: It Ain't All About the Cookin'",
        "Authors": "By Deen, Paula H. and Cohen, Sherry Suib",
        "Description": "Do you know the real Paula Deen? You may think you know the butter-loving, finger-licking, joke-cracking queen of melt-in-your-mouth Southern cuisine. You may have even visited The Lady & Sons to taste for yourself the down-home delicacies that made her famous and even heard some version of her Cinderella story (a single mom with two teenage sons started a brown-bag lunch business with $200 and wound up with a thriving restaurant, a fairy-tale second marriage, and wildly popular television shows), but you have never heard the intimate details of her often bumpy road to fame and fortune.   Courageously honest, downright inspiring, and just a little bit saucy, Paula shares the highs and lows of her life in the inimitable charming and irreverent style that you know from her television shows and personal appearances. She talks about long childhood summers spent in a bathing suit and roller skates and hard years living in the back of her father's gas station; a buzzing high school social life of sleepovers, parties, cheerleading, and boys; and a difficult marriage. The death of her beloved parents precipitated a debilitating agoraphobia that crippled her for years. But even when the going got tough, Paula never lost the good grace and sense of humor that would eventually help carry her to success and stardom. Of course, you can't get by on charm alone: as Paula has learned, you need plenty of willpower, hard work, and, above all, the love and support of family and friends to finance, sustain, and run a successful restaurant.   In each chapter, Paula shares new recipes: there's serious comfort food like her momma's Chocolate-Dippy Doughnuts, Courage Chili for when you know life's going to get tough, Sexy Oxtails for seducing that special someone, and the recipe for her new mother-in-law's Banana Nut Delight Cake that Paula finally got just right. And you'll love the never-before-seen photos of her family.   In this memoir, Paula Deen speaks as frankly and intimately as few women in the public eye have ever dared. Whether she's telling tales of good times or bad, her story is proof that the old-fashioned American dream is alive and kicking, and there still is such a thing as a real-life happy ending.",
        "Category": " Cooking , Regional & Ethnic , American , Southern States",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Morgan's Run",
        "Authors": "By McCullough, Colleen",
        "Description": "In a novel of sweeping narrative power unequaled since her own beloved worldwide bestseller The Thorn Birds, Colleen McCullough returns to Australia -- this time with the story of its birth. At the center of her new novel is Richard Morgan, son of a Bristol tavern-keeper, devoted husband and loving father, sober and hardworking craftsman. By the machinations of fate and the vagaries of the 18th-century English judicial system, he is consigned as a convict to the famous \"First Fleet,\" which set sail, bearing, as an experiment in penology, 582 male and 193 female felons sentenced to transportation, in May of 1787 for the continent that Captain Cook had discovered only a few years earlier. The word \"epic\" is overused, but no other word can do justice to one of the most grueling and significant voyages in human history or to the courage of the convicts whose sufferings were not ended but had only just begun when they set foot on Australian soil at Botany Bay on January 19th, 1788. Of those convicts, Richard Morgan stood out, not only for his strength and his calm determination to let no man bully him, but also for his intelligence, his fair-mindedness, his common sense, and his willingness to help others. To these qualities must be added a certain innate dignity that hinted, even in the most terrible conditions, at a life marked by tragedies that would have broken most men.  In Richard Morgan, Colleen McCullough has created one of her most compelling characters. We see through Morgan's eyes the two worlds in which the story takes place: that of 18th-century Bristol, where Morgan was born and expected to live out his life, and that of a convicted felon sent to settle a hostile new world.  When the book begins, Richard Morgan is a contented man -- happily married, with a child he adores. Then, piece by piece, his idyll crumbles until he finds himself led into an ambiguous relationship with a beautiful young woman, whose dissolute protector seeks vengeance on Morgan to protect his own skin.  He endures the agonies of bereavement and financial loss, incarceration in prison and aboard the notorious \"hulks,\" then the horrors of the journeys to Botany Bay and Norfolk Island, where he finds against all odds a new love and a new life.  Richard Morgan's story is true, but in making Morgan the central figure of her novel, Colleen McCullough has created a hero whom no reader will ever forget; she has written not only a great adventure and a powerful love story, but also a book that combines the elements of Tom Jones and  Mutiny on the Bounty.  Morgan's Run is great fiction, full of drama, passion, history, love, and hatred, full-blooded and totally engrossing, a stunning work that is at once rich entertainment -- and a revelation.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Prayer: Does It Make Any Difference?",
        "Authors": "By Yancey, Philip",
        "Description": "In his most powerful book since What’s So Amazing About Grace? and The Jesus I Never Knew, Philip Yancey probes the very heartbeat—the most fundamental, challenging, perplexing, and deeply rewarding aspect—of our relationship with God: prayer. What is prayer? How does it work? And more importantly, does it work? In theory, prayer is the essential human act, a priceless point of contact between us and the God of the universe. In practice, prayer is often frustrating, confusing, and fraught with mystery. Prayer: Does It Make Any Difference? is an exploration of the mysterious intersection where God and humans meet and relate. Writing as a fellow pilgrim, Yancey explores such questions as: •Is God listening? •Why should God care about me? •If God knows everything, what’s the point of prayer? •Why do answers to prayer seem so inconsistent and capricious? •Why does God seem sometimes close and sometimes far away? •How can I make prayer more satisfying? “I have found that the most important purpose of prayer may be to let ourselves be loved by God,” says Yancey. Prayer: Does It Make Any Difference? encourages us to pray to God the Father who sees what lies ahead of us, knows what lies within us, and who invites us into an eternal partnership—through prayer. Also available: unabridged audio CD.",
        "Category": " Religion , Prayer",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Cosmology + 1 (Readings from Scientific American)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "W. H. Freeman",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1977"
        }
    },
    {
        "Title": "The Toddlers Bible (Toddler's Bible Series)",
        "Authors": "By Beers, V. Gilbert and Boerke, Carole (ILT)",
        "Description": "Start Your Child on a Lifetime of Bible Reading . . .Now! THE TODDLERS BIBLE    ? builds right attitudes about God and His Word,    ? offers 101 Bible stories written especially for toddlers,    ? helps children learn the Bible while learning to talk and walk,    ? delights infants to 3-year-olds with over 400 pages of beautiful art,    ? gives you the most simple Bible ever! \"Your toddler is ready to start building a delight in the Word, a hunger     to learn it, a passion to read it. This is the age to begin building that delight,     or hunger, or passion. Next year may too late.\"    --V. Gilbert Beers",
        "Category": " Juvenile Nonfiction , Religion , Biblical Studies",
        "Publisher": "David C. Cook",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "The grand tour: A traveler's guide to the solar system",
        "Authors": "By Miller, Ron",
        "Description": "Explores the mysteries of our solar system using an atlas of the planets and their satellites, artwork, and photographs from the Apollo, Mariner, Viking, Pioneer, and Voyager space missions",
        "Category": "",
        "Publisher": "Workman Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1981"
        }
    },
    {
        "Title": "The Crohn's Disease & Ulcerative Fact Book",
        "Authors": "By Steiner-Grossman, Penny (EDT), Present, Daniel H. (EDT), Banks, Peter A. (EDT), National Foundation for Ileitis and Colitis, and National Foundation for Ileitis & Colitis (U. S.) (COR)",
        "Description": "Advance praise for The Crohn's Disease and Ulcerative Colitis Fact Book: \"Crohn's disease nearly took my life and dream of running in the Olympics. This book is helping me control my disease and stay in training.\" ?Rene Felton, Track and Field National Record Holder \"A much needed and valuable resource for IBD patients, their families, and physicians towards understanding IBD.\" ?Kurt J. Isselbacher, M.D., Mallinckrodt Professor of Medicine, Harvard Medical School; Chief, Gastrointestinal Unit, Massachusetts General Hospital \"Since IBD has touched my family I can well understand how this book can offer understanding and hope to all of us.\" ?Gary Collins, Host, Hour Magazine \"An invaluable book not only for patients but for doctors as well. Anyone connected with IBD will profit from reading it.\" ?Henry D. Janowitz, M.D., Clinical Professor of Medicine and Director of IBD Unit, Mount Sinai School of Medicine \"This text gave me a better insight into my illness. I have found that knowing what to expect makes coping with the disease easier.\" ?Rolf Benirschke, Placekicker, San Diego Chargers",
        "Category": " Health & Fitness , Diseases , Gastrointestinal",
        "Publisher": "Charles Scribner's",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Prisoners at the Kitchen Table",
        "Authors": "By Holland, Barbara",
        "Description": "Two friends--a timid boy and a confident girl--find their positions reversed as they plot to escape from the kidnappers who are holding them captive in a remote farmhouse",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1979"
        }
    },
    {
        "Title": "The Berenstain Bears on Time",
        "Authors": "By Stan Berenstain, Jan Berenstain",
        "Description": "",
        "Category": "",
        "Publisher": "Western Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The American President: The Human Drama of Our Nation's Highest Office",
        "Authors": "By Kunhardt, Philip B. and Kunhardt, Peter W.",
        "Description": "A companion to a ten-hour PBS series, airing in Spring 2000, explores the lives of America's presidents, from Washington to Clinton, in a study that examines the nature, history, evolution, and influence of the U.S. presidency. TV tie-in. 75,000 first printing.",
        "Category": " History , United States , General",
        "Publisher": "Riverhead Hardcover",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The Complete Book of Money Secrets",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "The Reader's Digest Association, Inc.",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    }
]