[
    {
        "Title": "Country Music What's What: The Fan's Guide to the People, Places and Things of Today's Country Music",
        "Authors": "By Millard, Bob",
        "Description": "",
        "Category": " Music , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.5",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "Chicken Run Joke Book (Dreamworks)",
        "Authors": "By Phillips, Louis",
        "Description": "This illustrated joke book provides a collection of easy-to-read movie-related jokes for beginning readers. Original.",
        "Category": " Juvenile Nonfiction , Humor , General",
        "Publisher": "Puffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Explore America",
        "Authors": "By Marshall, Richard, Kiely, Kathleen M., Jones, Frances, McCormick, Maggi (EDT), McTeague, Lindsay (EDT), Leblanc, Beverly (EDT), Newman, Barbara (EDT), Beadle, Judith, Crossman, Michael, and Rigby, Gwen",
        "Description": "For vacationers, this is an informative travel planner to the country's more appealing destinations.",
        "Category": " Travel , United States , General",
        "Publisher": "Nbn Miscellaneous Items",
        "Price Starting With ($)": "7.3",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "A Sweet Familiarity",
        "Authors": "By Winston, Daoma",
        "Description": "A young man falls in love with a stranger, who gradually resembles and is then transformed into his old girlfriend, killed long ago in an accident and now seeking occult vengeance",
        "Category": " Fiction , General",
        "Publisher": "Arbor House Pub Co",
        "Price Starting With ($)": "5.69",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "An introduction to English glassware to 1900 (V & A introductions to the decorative arts)",
        "Authors": "By Victoria and Albert Museum",
        "Description": "",
        "Category": "",
        "Publisher": "H.M.S.O",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "101 Simple Ways To Be Good To Yourself",
        "Authors": "By Watson, Donna",
        "Description": "Suggests ways to develop a positive attitude, improve one's self-image, and handle the stress of work and family life",
        "Category": " Self-help , Stress Management",
        "Publisher": "Bard Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "Defendant: a Psychiatrist on Trial for Medical Malpractice",
        "Authors": "By Charles, Sara C. and Kennedy, Eugene",
        "Description": "",
        "Category": " Law , General",
        "Publisher": "Free Press",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "July",
            "Year": "1985"
        }
    },
    {
        "Title": "Between Thimble & Thumb",
        "Authors": "By Botsford, Shirley J.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Future developments in telecommunications (Prentice-Hall series in automatic computation)",
        "Authors": "By Martin, James",
        "Description": "",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "7.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "United States and Africa: Into the 21st Century (Overseas Development Council)",
        "Authors": "By Lancaster, Carol J.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Overseas Development Council",
        "Price Starting With ($)": "9.56",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "What Price Freedom?",
        "Authors": "By Brooke, Peggy",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Ronald N Haynes Pub",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "White Is the Color of Death: A Mystery",
        "Authors": "By Catanach, J. N.",
        "Description": "While vacationing in Malaysia, American professor Charles Quint becomes involved in a series of mysterious murders tied to a reputed Communist bandit and a reunion of British veterans of the World War II jungle war",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Countryman Pr",
        "Price Starting With ($)": "8.48",
        "Publish Date": {
            "Month": "May",
            "Year": "1988"
        }
    },
    {
        "Title": "Hooray for Captain Spaulding! Verbal & Visual Gems from \"Animal Crackers\"",
        "Authors": "By Anobile, Richard J.",
        "Description": "",
        "Category": "",
        "Publisher": "Darien House Book / Crown Publishers",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1974"
        }
    },
    {
        "Title": "Masters of the Victory Garden: Specialty Gardeners Share Their Expert Techniques",
        "Authors": "By Wilson, James W.",
        "Description": "Reveals the secrets and techniques of successful hobby gardeners, offering guidance on growing, hybridizing, and showing their specialties",
        "Category": " Gardening , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Millroy the Magician",
        "Authors": "By Theroux, Paul",
        "Description": "Jilly Farina is fourteen, but so small that she wears younger kids' clothes. Her father is drunk on the day of the Barnstable County Fair, so she goes by herself, and by that night her life has been transformed. When she walks into a tent to see Millroy the Magician, his eyes lighten from brown to green and fasten upon her. He performs miracles in front of Jilly's spellbound eyes and tells her he wants to eat her. He spirits her into his trailer, and for the first time in her forlorn young life, Jilly feels safe. He tells her that he has command over nine bodily functions, that he will train her to be his assistant, and that he will give her a sequined costume.But this is only the beginning. Millroy is a man like no other, a magician not simply of mere conjuring, but of true, baffling magic. He is a healer, too, a vegetarian and health fanatic with a mission to change the eating habits of his beloved United States. In search of the perfect platform, he finds it in television as an evangelical preacher, touting hygiene and the simple pure foods mentioned in the Bible. From fairground magician to cult leader, Millroy is unstoppable.In his portrait of a man who is part genius, part eccentric, and part miracle worker, and of his complete and uneasy relationship with young Jilly, Paul Theroux has created a remarkable parable of America today. A work of breathtaking imagination and resonance, Millroy the Magician displays the author at the height of his fictional powers, and in Jilly and Millroy he has created two truly unforgettable characters.",
        "Category": " Fiction , Literary",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "February",
            "Year": "1994"
        }
    },
    {
        "Title": "Thrown-Away Child: A Neil Hockaday Mystery",
        "Authors": "By Adcock, Thomas",
        "Description": "Set in New Orleans, the hometown of Hock's new wife, black actress Ruby Flagg, Thrown-Away Child is a pungent Creole stew of family secrets, sour politics, ritual murder, and bittersweet revenge.Hoping for respite from his hard-drinking past in Manhattan, Hock travels to the fabled Land of Dreams with Ruby to meet her close-knit family. Hardly have the newlyweds arrived when the peaceful home of Hock's mother-in-law, Violet, is disrupted by two racist cops hunting for Ruby's cousin Perry Duclat, who has been living with Violet since his mother abandoned him. Now this thrown-away child is a grown and troubled man, wanted for murder. The victim is Perry's former cellmate at Angola penitentiary, whose mutilated body has been branded with a bizarre acronym - MOMS. When Perry disappears, Hock teams up with a disenchanted New Orleans cop to conduct a highly unofficial Investigation. Before justice is finally done, there are more brutal murders - and more brandings. Among the slain: a little boy so alone in the world he can only guess at his name. Besides the terrible murders, Hock must resolve personal quandaries: the meaning of Ruby's unsettling emotions about returning to her southern roots, and his own future - if any - with the New York Police Department.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "18.3",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Whole Baseball Catalogue (Baseball Ink Book)",
        "Authors": "By Reuther, David (EDT), Thorn, John (EDT), and Carroll, Bob (EDT)",
        "Description": "An authoritative compendium of information on everything to do with America's favorite pastime includes where to buy baseball equipment, who runs baseball tours, facts on jobs in baseball, and how to try out for a major league team",
        "Category": " Sports & Recreation , Baseball , General",
        "Publisher": "Fireside",
        "Price Starting With ($)": "6.12",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "The Good Fight: A Laura Di Palma Mystery",
        "Authors": "By Matera, Lia",
        "Description": "Defending an old politically idealistic friend draws lawyer Laura DiPalma into a fight with Feds, the New Left, her law partners, and her own materialism, in a mystery that also has Laura in a frantic hunt for her missing lover",
        "Category": " Fiction , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The State of the Nation: Government and the Quest for a Better Society",
        "Authors": "By Bok, Derek Curtis",
        "Description": "Never before have Americans been so anxious about the future of their society. But rarely has anyone offered a clear statement about why, in a nation so prosperous, free, and stable, we tend to assume that the country is in dire straits and that the government can do little to help. This book is just such a statement, an eloquent assessment of where America stands, how our society has changed in the past half-century, and who or what is responsible for our current frustrations.Derek Bok examines the nation's progress in five areas that Americans generally consider to be of paramount importance: economic prosperity, quality of life, opportunity, personal security, and societal values. He shows that although we are better off today in most areas than we were in 1960, we have performed poorly overall compared with other leading industrial nations. And when it comes to providing adequate health care at a reasonable cost, educating our young people for high-skilled jobs, alleviating poverty and urban blight, and reducing crime, our record has been dismal. Comparing the United States with other leading industrial nations on more than sixty key indicators, Bok shows that we rank below average in more than two-thirds of the cases and at the bottom in more than half.What has caused this decline, and what can be done about it? In virtually all important areas of American life, Bok concludes, government policies have played a significant, often decisive role in accounting for our successes as well as our failures. But whereas others call for downsizing the federal government, Bok argues that government is essential to achieving America's goals. In short, Ronald Reagan was only half right. Government is the problem. But it is also the most important part of the solution. By assessing the state of the nation and identifying the reasons for its current condition, this book helps set the agenda for improving America's performance in the future.",
        "Category": " Political Science , American Government , State",
        "Publisher": "Harvard University Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "Time of Hope (An Inspector Nick Trevellyan/Alison Hope Myster)",
        "Authors": "By Kelly, Susan B.",
        "Description": "Detective Inspector Nick Trevellyan and his elegant lover, businesswoman Alison Hope, should have stayed longer in Venice. They have just returned from a romantic Italian holiday when Nick must take charge of a murder case that profoundly shocks and disturbs their West Country village of Little Hopford.Eighteen-year-old Ben Lawson has worked hard to pass his exams and qualify for college. Only Frisco Carstairs now stands in his way. The young girl - reputed in the village to be essentially amoral in her sexual inclinations - watches smugly as Ben tells his mother that he and Frisco are engaged. Alison and Nick understand only too well the overwhelming power of sexual passion, especially among the young. They also understand that Ben has broken his mother's heart. Is Ben so besotted by Frisco that he will marry her and relinquish his mother's dreams? The diamond on Frisco's finger suggests his answer.\"Over my dead body,\" says Ben's mother, but it's Frisco's body that is found near an isolated country lane. Strangled with her own scarf, vulnerable in death as she never seemed to be in life, Frisco no longer poses a threat to any of the good citizens of Little Hopford.Initially assuming that he has an open-and-shut case, Nick discovers that Alison may hold the key to a crime of passion that is much subtler and more complex than anyone could have guessed. Nick is the professional detective, but it's Alison who often leads the way to the truth.Witty, romantic, evocative of the richness and eccentricity of English village life, Time of Hope confirms Susan B. Kelly's reputation as one of the most promising and original new talents on the crime-writing scene.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Blue Nowhere : A Novel",
        "Authors": "By Deaver, Jeffery",
        "Description": "The Blue Nowhere will forever change the way you feel about your computer.  Jeffery Deaver, bestselling author of The Empty Chair and The Bone Collector, now turns to the labyrinthine world of cyberspace -- a world where safety is elusive, appearances are deceiving, and the most powerful can lose their wealth, their minds, their lives with a hacker's touch of a button.  When a sadistic hacker, code-named Phate, sets his sights on Silicon Valley, his victims never know what hit them. He infiltrates their computers, invades their lives, and -- with chilling precision -- lures them to their deaths. To Phate, each murder is like a big, challenging computer hack: every time he succeeds, he must challenge himself anew -- by taking his methodology to a higher level, with bigger targets.  Desperate, the head of The California State Police Computer Crimes Division frees Wyatt Gillette, imprisoned for hacking, to aid the investigation -- against the loud protests of the rest of the division.With an obsession emblematic of hackers, Gillette fervently attempts to trace Phate's insidious computer virus back to its source. Then Phate delivers a huge blow, murdering one of the division's own -- a \"wizard\" who had pioneered the internet -- and the search takes on a zealous intensity. Gillette and Detective Frank Bishop, an old-school homicide cop who's accustomed to forensic sleuthing, at first make an uneasy team. But with a merciless and brilliant killer like Phate in their crosshairs, and his twisted game reaching a fever pitch, they must utilize every ounce of their disparate talents to stop him.  Hot on the trail of the New York Times bestseller The Empty Chair, The Blue Nowhere once again demonstrates that Deaver is \"the master of ticking-bomb suspense\" (People). It is a truly stunning tale of suspense in the computer age.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The Press",
        "Authors": "By Cose, Ellis",
        "Description": "Five of the nation's largest and most prestigious newspapers are the subject of a study tracing economic growth in the industry, the individuals behind their success, and expectations for the future",
        "Category": "",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "The Intermarriage Handbook: A Guide for Jews & Christians",
        "Authors": "By Petsonk, Judy and Remsen, Jim",
        "Description": "The Intermarriage Handbook is a comprehensive, immensely practical self-help book for interfaith couples. Judy Petsonk and Jim Remsen interviewed hundreds of experts: psychologists, family therapist, sociologists, religious leaders--and especially the couples themselves. They discovered that the cultural differences between Christians and Jews are as significiant as their religious upbringings. Even if husband and wife are not practicing a faith, they may be feeling the strain of being in an interfaith relationship.Filled with true-life anecdotes and useful step-by-step suggestions for a relationship at any stage, The Intermarriage Handbook is a book that couples can turn to again and again--for help with the questions that matter most.",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Quill (William Morrow)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "The Mourners' Bench: A Novel",
        "Authors": "By Dodd, Susan M.",
        "Description": "Thirty-year-old Leandra leads a solitary existence on an island in North Carolina, earning a modest living by fixing broken dolls. But her quiet, isolated life takes an unexpected turn when her sister's husband, Wim, appears, a man she has not seen for ten years, since their urgent love affair ended in tragedy. Wim, now dying of cancer, feels the need to see Leandra one last time.In alternating, distinctly American voices -- one the twang of a New England Yankee, the other a gentle Southern drawl -- these two characters tell a wistful, wonderfully evoked story, from their first meeting, when Leandra was summoned to Boston to care for her pregnant, depressed sister, to the growing passion that led them beyond common sense and caution. As the narrative alternates between past and present, Leandra and Wim lay claim to the love they've denied themselves and each other.With a sure sense of language and the kind of detail that rings with truth, Susan Dodd creates characters who will resonate in the reader's mind long after their tale reaches its inevitable end. Soft-spoken, sensitive, and deeply moving, The Mourners' Bench is literary fiction at its best, a powerfully eloquent novel of love, loss, regret, and rediscovery.",
        "Category": " Fiction , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Sorcerers of Majipoor (Prestimion Trilogy)",
        "Authors": "By Silverberg, Robert",
        "Description": "On the gigantic planet Majipoor, it is a time of ancient mysteries and new wonders. The aged Pontifex Prankipin, who brought sorcery (and prosperity) to the Fifty Cities of Castle Mount, is at last near death. Omens are seen, prodigies are born, wine and blood are consumed...even the sea-dragons have been glimpsed from the cliffs. Truly, a great change is at hand!The Coronal Lord Confalume, who will become Pontifex, decides to begin the Funeral Games before his own replacement is chosen. It is no secret that the next Coronal will be Prince Prestimion. By law and custom, the blood son of the present Coronal cannot rule the seemingly endless castle with its 30,000 rooms. Besides, everyone knows that young Korsibar is an outdoorsman, preferring the pleasures of the hunt to the intrigues of the court.What everyone does not know is that the hunter has a new and secret quarry - the Starburst Crown. Korsibar has been visited by an oracle. From the thin lips of the two-headed Su-Suheris, he has heard the whispered words that will plunge the planet into a fearsome conflagration, engulfing all the myriad races of Majipoor in a war to alter destiny itself.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Harper Prism",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Smokescreen: A Novel of Medical Intrigue",
        "Authors": "By Avila, Vernon L.",
        "Description": "Smokescreen traces the rise of Eloy Cordova Santiago from humble beginnings in a village on the shores of Lake Maracaibo, where he apprentices with the village medicine man and learns the ways of the curandero and the secrets of the spirits of the forest, to world renown as a brilliant neuroscientist.His pathway is charted by the death of his father from Huntington's and the vow he takes to find a cure for the disease. Then a tragic accident brings him together with Karen Williams, a researcher from the United States coincidentally investigating the genetics of Huntington's. With her encouragement, and through his own talent, determination and ambition, Eloy gains the formal scientific training in Venezuela and Puerto Rico that leads to a breakthrough discovery and lands him a position at the National Institutes of Health.But the journey is harrowing and dangerous. Eloy faces challenge after challenge in a world where scientific ambition and love conflict, where drug lords dispense escape and pain, where powerful politicians play God, and where greed and power determine who lives and who dies. Yet none of these challenges is as great as his race against time to use his scientific knowledge to save the United States from a cynical, manipulative conspiracy that puts the President of the United States in mortal danger.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Penmarin Books Inc",
        "Price Starting With ($)": "8.57",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Complete Idiot's Guide to Wills and Estates (The Complete Idiot's Guide)",
        "Authors": "By Maple, Stephen M.",
        "Description": "You're no idiot, of course.  You know how to save money, plan important family events, and pay your bills on time. But when it comes to writing your will and estate plan, you feel confused.  Don't panic!  The Complete Idiot's Guide to Wills and Estates helps make sense of the legal aspects of writing a valid will and disposing of your estate the way you want to.  In this Complete Idiot's Guide, you get:",
        "Category": " Law , Estates & Trusts",
        "Publisher": "Alpha",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "The Complete Idiot's Guide to Beating Debt",
        "Authors": "By Jaffe, Azriela and Strauss, Steven D.",
        "Description": "You're no idiot, of course. You know the \"grace period\" for your bills better than you know how to say grace. And if there were an Olympic competition for \"credit surfing\"--transferring your credit debt from one card to another--you'd bring home the gold metal. But when it comes to paying off that debt, you're afraid it will take a gold-medal winner's endorsements. Don't head for bankruptcy court just yet! The Complete Idiot's Guide to Beating Debt shows you not only how to eliminate the debt you have, but how to create a workable plan of \"financial health\". In this Complete Idiot's Guide, you get:",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Humanoid Touch",
        "Authors": "By Williamson, Jack",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "The South in Modern America: A Region at Odds (New American Nation Series)",
        "Authors": "By Grantham, Dewey W.",
        "Description": "Grantham (history, Vanderbilt U.) observes that at the end of Reconstruction the South was the nation's poorest, most isolated, and most \"distinctive\" region. This study is concerned with post-Reconstruction South and its interaction with the rest of the nation, in particular: sectional conflict; compromise and accommodation in the relationship between North and South; regional convergence attributed to such compromise; and regional specificity of the South. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Political Science , American Government , State",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "August",
            "Year": "1994"
        }
    },
    {
        "Title": "Evaluation and Treatment of Insomnia (Oxford Medicine Publications)",
        "Authors": "By Kales, Anthony",
        "Description": "",
        "Category": " History , Asia , India & South Asia",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "March",
            "Year": "1984"
        }
    },
    {
        "Title": "Roosevelt to Reagan: A Reporter's Encounters With Nine Presidents",
        "Authors": "By Donovan, Hedley",
        "Description": "The former editor-in-chief of Time, Inc. sketches intimate portraits of nine presidents, capturing them in action, evaluating their characters, and assessing their performances as president",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1985"
        }
    },
    {
        "Title": "Seasonal Herbs from Caprilands",
        "Authors": "By Simmons, Adelma Grenier",
        "Description": "",
        "Category": "",
        "Publisher": "Mallard Press,. New York, NY, U.S.A.: B D D Promotional Book Company, Incorporat",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Are We Winning Yet?: How Women Are Changing Sports and Sports Are Changing Women",
        "Authors": "By Nelson, Mariah Burton",
        "Description": "Essays discuss women's athletics, high school sports, success against male competitors, treatment by the press, mixed doubles, and body building",
        "Category": " Sports & Recreation , Reference",
        "Publisher": "Random House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1991"
        }
    },
    {
        "Title": "Almanac Of World Crime",
        "Authors": "By Nash, Jay Robert",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1988"
        }
    },
    {
        "Title": "A Shoulder to Lean on",
        "Authors": "By Hanson, Bill (PHT)",
        "Description": "",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Bright Books Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "All of Shakespeare",
        "Authors": "By Charney, Maurice",
        "Description": "In All of Shakespeare, Maurice Charney, former president of the Shakespeare Association of America, provides a play by play, poem by poem guide to all of Shakespeare's works. In succinct and lucid chapters, Charney brings to life every play, from The Comedy of Errors to The Tempest, in addition to the long poems and the Sonnets.The book is divided into sections according to genre: comedies, histories, tragedies, romances, and poems. Charney also considers works that may be only partly by Shakespeare: The Two Noble Kinsmen, Pericles, and A Lover's Complaint.Charney's account is accessibly written and infused with the belief that Shakespeare's works are intelligible and relevant to modern readers and audiences. The result is a volume that will be cherished and celebrated by readers who are just beginning to read Shakespeare and see his plays as well as those who are reacquainting themselves with his many delights.",
        "Category": " Literary Criticism , European , General",
        "Publisher": "Columbia University Press",
        "Price Starting With ($)": "5.5",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "C++ Primer (2nd Edition)",
        "Authors": "By Lippman, Stanley B.",
        "Description": "The most important new addition to the C++ language is templates, a feature that facilitates the development of extensive class and algorithmic libraries. This second edition provides coverage of this and the other features of Release 3.0. Assumes only an understanding of the basic constructs of a programming language. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Addison Wesley Longman",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "July",
            "Year": "1991"
        }
    },
    {
        "Title": "Fit to Be Tied ~ Making Marriage Last a Lifetime",
        "Authors": "By Hybels, Bill and Hybels, Lynne",
        "Description": "Bill and Lynne Hybels draw on their own personal experience and a guiding faith to offer practical advice on how to enjoy a lifetime of togetherness -- from finding a suitable mate and dealing with the most common marital problems to avoiding the pitfalls that can sabotage a healthy relationship. This easy-to-follow guide for enjoying a happy, healthy, and lifelong relationship includes: - Creative ways to 'court' your spouse - Checklists for singles to use in selecting a mate - Steps to resolve conflict and not drive it underground - Practical ways to determine relational fit -- Whether you are already married or planning to marry in the future, the authors' sound, wholesome advice can show you how to make wise decisions about whom to marry and how to stay married for a long time.",
        "Category": " Religion , Christian Life , Love & Marriage",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1991"
        }
    },
    {
        "Title": "Burt Wolf's Menu Cookbook",
        "Authors": "By Wolf, Burton",
        "Description": "Burt Wolf's Menu Cookbook, the companion to his third series for public television, visits more than twenty locations in Europe, South America, the United States, Canada, and Asia.Along with his often irreverent, always informative reporting on food history and folklore, Burt offers a complete selection of recipes from some of the most talented cooks in each location. And for the first time in any of his books, Burt has paired each main course dish with complementary recipes to create a complete and authentic menu.There are more than fifty menus in all, and, as always, each of Burt's recipes is meticulously tested and simple to prepare with easily acquired ingredients.",
        "Category": " Cooking , General",
        "Publisher": "Broadway",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "Kiteworld",
        "Authors": "By Roberts, Keith",
        "Description": "Within a future world where pilots are launched on giant kites to watch the skies for demonic monsters, two great religions are on the verge of battle for the souls of the realm",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Arbor House",
        "Price Starting With ($)": "13.17",
        "Publish Date": {
            "Month": "April",
            "Year": "1986"
        }
    },
    {
        "Title": "Mummers' Curse",
        "Authors": "By Roberts, Gillian and Blades, Joe (EDT)",
        "Description": "\"Here's the Dorothy Parker of mystery writers . . . giving more wit per page than most writers give per book.\" --Nancy PickardIn her new novel starring Philadelphia schoolteacher Amanda Pepper, Gillian Roberts once again mixes mystery and mirth. This time Roberts explores Philadelphia's unique flesh and blood \"historical monument\"-- the Mummers, who live (and perhaps are willing to die) for a few hours of glory every New Year's Day.The famous Mummers' Parade is an extravaganza that draws enormous crowds who cheer through chattering teeth, as more than thirty thousand clowns, string bands, and fancy brigades strut their stuff up Broad Street. But this year, while the music blares and the Mummers dance, a reveling Pierrot suddenly sinks to the ground, shot dead.Amanda is, at first, only a horrified spectator. But when the prime suspect--her friend and fellow teacher at Philly Prep--falsely claims to have been with her at the time of the murder, Amanda can no longer stay on the sidelines.Is the murder a flare-up of deadly rivalries? Is it connected with the disappearance, the week before Christmas, of another Mummer, the heir to a meat-packing family? Does someone disapprove of the Mummers' feathers, sequins, and string bands? And why is no one in the tight-knit world Amanda investigates willing to tell the truth about anything?With Amanda on the scene, the who in whodunit doesn't stay secret for long. In The Mummers' Curse, Gillian Roberts is, as always, at the head of the parade.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Kindness of Strangers: A Skip Langdon Novel",
        "Authors": "By Smith, Julie",
        "Description": "Julie Smith's New Orleans is not a city. It's a world - exotic, sweetly perverse, dangerously seductive. Nowhere else does politics make stranger bedfellows; and the approaching mayoral election is stranger than most, pitting the usual thugs and vipers against a seeming breath of fresh air - Errol Jacomine, a liberal-minded, civic-spirited preacher. The only problem is, in the opinion of Police Detective Skip Langdon, Jacomine is a psychopath and dangerous as hell.On leave of absence from the police force, Skip becomes obsessed with exposing the frightening figure beneath Jacomine's good-guy image. Immediately, an anonymous army of spies and hatchet men go to work on her, and Skip begins to understand that in opposing Jacomine, she is risking not only her livelihood but her sanity and possibly the lives of people she loves.Skip's instincts seem confirmed when the only witness to Jacomine's crimes turns up dead. Skip thinks there are more bodies buried in Jacomine's past, but it's the present she's worried about. And protecting one of her own against the preacher's evil sends Skip to the dark center of bayou country, where even the elements are her enemies. A deadly chase through the swamp during a fierce hurricane forces Skip to rely not on the kindness of strangers but on her own inner strength to survive.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1996"
        }
    },
    {
        "Title": "Lawyer: A Life of Counsel and Controversy",
        "Authors": "By Israel, Peter and Liman, Arthur L.",
        "Description": "During nearly half a century of practicing law, Arthur L. Liman represented the very best ideals of his profession. He was renowned both for his brilliance as a corporate lawyer and for his commitment to public service and pro bono work. Vanity Fair called him a \"big trouble\" lawyer?i.e., the lawyer you call when you're in it.    In this candid memoir, written in the months before his death, Liman discusses his life in the law from the moment Roy Cohn's performance at the McCarthy hearings inspired him to become a lawyer (in order to stand against lawyers like Cohn) to his influential investigation of the Attica prison uprising, through his role as chief counsel in the Iran-Contra hearings, with looks at many fascinating cases, clients, and controversies along the way. Full of lively portraits of the moguls, financiers, politicians and criminals with whom Liman worked, and grounded in his insightful, provocative opinions on the practice of law and on today's legal issues, Lawyer is an absorbing read.",
        "Category": " Law , Ethics & Professional Responsibility",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Quixtar Revolution: Discover the New High-Tech, High-Touch World of Marketing",
        "Authors": "By Barefoot, Coy",
        "Description": "Describes the launch of the e-commerce Web site Quixtar.com, which experts believe will change business practices in the new Internet economy, and includes interviews with some of the nation's top Internet and e-commerce experts",
        "Category": " Business & Economics , Marketing , Multilevel",
        "Publisher": "Prima Lifestyles",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "The A+ Certification Success Guide for Computer Technicians: For Computer Technicians",
        "Authors": "By Kalman, Bobbie and Parks, Sarah T.",
        "Description": "Compiled with the assistance of the developers and sponsors of the test, this guide to the exam for computer service technicians introduces the format and offers sample questions. Original. (Intermediate).",
        "Category": " Computers , Computer Science",
        "Publisher": "Computing McGraw-Hill",
        "Price Starting With ($)": "5.42",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "The McGraw-Hill Telecommunications Factbook",
        "Authors": "By Pecar, Joseph A., O'Connor, Roger J., and Garbin, David A.",
        "Description": "Subtitled,  A Readable Guide to Planning and Acquiring Products and Services.  Shows how to manage and participate in the planning, acquisition, operation, and control of major telecommunications projects. Covers preparation of technical specifications, requests for proposals, and life-cycle support documents and comparison of media types, applications, and topologies. Includes a glossary. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Technology & Engineering , General",
        "Publisher": "McGraw-Hill Osborne Media",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Oxford Dictionary of Modern Quotations (Oxford Quick Reference)",
        "Authors": "By Augarde, Tony (EDT)",
        "Description": "Winston Churchill and Franklin D. Roosevelt, Marcel Proust and Virginia Woolf, Martin Luther King and John F. Kennedy, Louis Armstrong and Mae West, Woody Allen and Dorothy Parker--these are but a few of the figures who have given voice to our century's most memorable quotations. Now, in The Oxford Dictionary of Modern Quotations, A.J. Augarde gathers together 6,000 of the best known quotes from our time, drawn from novels, plays, poems, essays, speeches, films, radio and television, songs, and even advertisements.     Here readers will find the history-making quotes, from Churchill's stirring wartime speeches (\"Never in the field of human conflict was so much owed by so many to so few\"), to Neville Chamberlain's infamous \"Peace for our time,\" to Spiro T. Agnew's outrageous \"If you've seen one city slum you've seen them all.\" On the lighter side, readers will enjoy such wits as Woody Allen (\"It's not that I'm afraid to die. I just don't want to be there when it happens\"), Fran Lebowitz (\"Food is an important part of a balanced diet\"), and Dorothy Parker (\"This is not a novel to be tossed aside lightly. It should be thrown with great force\"). There are generous excerpts from literature, from the novels of Hemingway and Joyce, the poetry of Auden, Eliot, and Pound, the plays of Lillian Hellman and Anita Loos, and the lyrics of Irving Berlin and Cole Porter (\"In olden days a glimpse of stocking / Was looked on as something shocking / Now, heaven knows, / Anything goes\"). Augarde also includes famous book titles (such as Shepherd Mead's \"How To Succeed in Business Without Really Trying\"), song titles (Larry Morey's \"Whistle While You Work\"), even cartoon captions (Bill Maudlin's wartime \"I feel like a fugitive from the law of averages\"). And of course, the book brims with wisdom, from Count Ciano's \"Victory has a hundred fathers, but defeat is an orphan,\" to Lord Morley's \"You have not converted a man because you have silenced him,\" to Alfred Adler's \"It is always easier to fight for one's principles than to live up to them.\" Designed both for reference and for browsing, the Dictionary arranges quotations in alphabetical order by author, with attributions after each quote so that readers can, if they wish, return to the original sources.  In addition, the index helps the reader trace quotations from their most important keywords, so that if you know the quote but not the author, you can still find it easily.      Whether you want to find out who first used the expression \"a walk on the wild side\" (it was Nelson Algren) or simply enjoy discovering fine turns of phrase or witty remarks (such as Beatrice Lillie's off-the-cuff comment to a waiter who spilled soup on her dress: \"Never darken my Dior again\"), The Oxford Dictionary of Modern Quotations offers a unique view of the twentieth century through some of its most memorable bon mots.",
        "Category": " Reference , Quotations",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "The Politics of Interpretation: Ideology, Professionalism, and the Study of Literature",
        "Authors": "By Hogan, Patrick Colm",
        "Description": "This interpretive study analyzes the complex politics of literature, criticism, and professionalism.  While affirming the profound importance of political analysis--from the ideological critique of literary texts to the social and economic critique of academic institutions--Hogan reassesses the poststructuralist doctrines that underlie much recent work in this area.  He presents extended expositions and criticisms of the views of several influential poststructuralist writers, including Jacques Derrida and Luce Irigaray.  In keeping with recent \"post-poststructuralist\" trends in France and elsewhere, Hogan argues for the political necessity of rational inference, and empirical enquiry, guided by ethical, and more specifically Kantian, considerations.  In the process, he convincingly formulates a general theory of ideology that recognizes the crucial link between literary politics and the concrete political issues that affect the lives of real men and women in the real world of social and material life.  His study concludes with an economic analysis of the institutions of literary study, outlining some anarchist implications for their restructuring.",
        "Category": " Law , Business & Financial",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1990"
        }
    },
    {
        "Title": "Rookie Dad: Meditations From the Backyard",
        "Authors": "By Epstein, Rick",
        "Description": "",
        "Category": " Social Science , General",
        "Publisher": "Hyperion",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Shattered",
        "Authors": "By Francis, Dick",
        "Description": "When jockey Martin Stukely dies following a fall in a steeplechase at Cheltenham races, he accidentally embroils his friend Gerard Logan in a perilous search for a stolen videotape.Gerard Logan, half artist, half artisan, is a glass-blower on the verge of widespread acclaim for the originality and ingenuity of his work. He has long been accustomed to the frightful dangers inherent in molten glass, not to mention in maintaining a glass-making furnace at seldom less than 1,800 degrees F day and night, but now he is suddenly faced with a series of unexpected and terrifying threats, first to his livelihood, then to his courage and, finally, to his life.Believing the missing videotape to contain priceless information, and wrongly convinced that Logan knows where to find it, a vicious group of villains sets out to extract from him the information he does not have. Logan reckons that to survive he must himself find out the truth. The journey is a thorny one, and the final race to the tape throws more hurdles and more hazards in his way than his dead jockey friend could ever have imagined.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Et Cetera, Et Cetera: Notes of a Word-Watcher",
        "Authors": "By Thomas, Lewis",
        "Description": "Examines the origin of simple but important words, the development of language, and the light that words shed on the history of human beings",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Bulimarexia: The Binge/Purge Cycle",
        "Authors": "By Boskind-White, Marlene",
        "Description": "When this book was first published, the authors received thousands of letters from women. After reading it, many were able to reach out for help for the first time. In the second edition, the authors added new findings about the binge-purge disorder, discussing the physiological effects of binge-ing, the question of drug therapy, and the need for nutritional counseling.Here is basic information on the dynamics of the disorder, including socialization and the family, adolescent danger signals, the college years and beyond, bulimarexia and the body, workshops, intensive psychotherapy, and future prospects.",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Greed Is Not Enough Reaganomics",
        "Authors": "By Lekachman, Robert",
        "Description": "Takes a critical look at the Reagan administration's economic policies, and considers whether supply-side economics and reduced government regulation will really benefit the nation",
        "Category": "",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1982"
        }
    },
    {
        "Title": "Puppy Who Couldn't Remember (Pound Puppies)",
        "Authors": "By Paris, Pat (ILT) and Hill, Johnson",
        "Description": "The huggable team tries to help a lost puppy find its way home, but they are stumped when the young dog's memory fails",
        "Category": "",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "Three Beheim Boys: Growing Up in Early Modern Germany",
        "Authors": "By Ozment, Steven E. (EDT)",
        "Description": "Through correspondence to mothers and guardians, the reader experiences the lives of three generations of German boys in sixteenth- and seventeenth-century Europe",
        "Category": "",
        "Publisher": "Yale Univ Pr",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "Ticket Home: A Novel",
        "Authors": "By Pratt, James Michael",
        "Description": "At the dawn of World War II, in rural Oklahoma, identical twins Lucien and Norman Parker are bound by the tragic death of their mother, their railroad jobs, and an abiding well of brotherly devotion. But when both fall for the prettiest girl in town, they learn the hard way that they can't share everything. It is brash Lucien who finally wins her hand, while gentle cherishes and the brother who betrayed him. At last, reunited, and reconciled, in the war-torn South Pacific, Lucien and Norman fight side by side. But burdened with the heartbreaking loss of his brother--and the weight of a shocking secret that will haunt him for decades to come...",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "The Miami Herald Report: Democracy Held Hostage",
        "Authors": "By Merzer, Martin and Miami Herald Publishing Company (COR)",
        "Description": "Americans Woke up on November 8, 2000, unsure who their next President would be. A population accustomed to knowing the outcome of electoral contests before the polls closed - and often much earlier than that - would endure another five weeks of high-stakes political and legal maneuvering before the United States Supreme Court stopped recounts in the State of Florida, effectively sealing the race for Texas governor George W. Bush.",
        "Category": " Political Science , Political Process , Elections",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "May",
            "Year": "2001"
        }
    },
    {
        "Title": "The System: The American Way of Politics at the Breaking Point",
        "Authors": "By Johnson, Haynes and Broder, David S.",
        "Description": "In this remarkable book, two of America's best-known journalists use their unparalleled access to the major players to examine The System, specifically as it operated during the ferocious battle over the Clinton effort to provide universal health insurance for Americans - and they come to some startling conclusions about America's future.From the beginning of the struggle, Johnson and Broder gained the confidence of more than one hundred of the participants, including the President and the First Lady; key congressional leaders like Bob Dole, Newt Gingrich, Ted Kennedy, and George Mitchell; the many competing special interests; and, outside the Beltway, ordinary citizens and workers on the battlefront of medical care. The authors have written a brilliant chronicle of the battle - of lost opportunities in the White House and of the savage determination and cunning tactics of the Gingrich forces, who plotted secretly for more than a year in advance to kill health care reform in an attempt to regain control of Congress and lead a conservative Republican Revolution that would fundamentally alter American government, privatize public function, and dismantle progressive programs and policies established over the last sixty years. Filled with stunning disclosures about the President and his supporters and adversaries, The System is an extraordinary portrait of democracy under siege, providing one of the most candid looks at American politics and government ever written. It is a book of vital importance to every American and is certain to become a classic in years to come.",
        "Category": " Medical , Health Policy",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Portable World Atlas",
        "Authors": "By Willett, B. M and Gaylard, David (EDT)",
        "Description": "A colorful and conveniently sized atlas highlights an easy-to-read format that includes high quality political and topographical maps for every region of the world. Reissue.",
        "Category": " Reference , Atlases, Gazetteers & Maps",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "The Night Remembers",
        "Authors": "By Eagle, Kathleen",
        "Description": "Angela Prescott has pulled up stakes and moved halfway across the country, seeking refuge from a man who has made her life a nightmare. Starting over in an unfamiliar city, she's wary and keeps to herself, until she meets twelve-year-old Tommy T.Street-smart Tommy T knows how to keep secrets. He's told no one of the mysterious recluse living in an underground hideaway, whose face he's never seen. A gifted comic book artist with no place to live, Tommy T needs someone to believe in, and in this phantom stranger he finds the comic book superhero of his dreams.Jesse Brown Wolf's past has driven him underground in many ways. By day, he is a handsome repairman who fixes the plumbing in Angela's rooms. By night he lives in the shadows, acting with reckless bravery to make the streets safer for kids...and whispering into Angela's sleeping ear promises of comfort, security, and heart's ease.The Night Remembers is about finding heroes in unexpected places - in a neighborhood school, in a rundown apartment house, even in a dark hole of a riverbank. It is a novel about redemption: about a courageous woman who reaches out to make new connections; an irrepressible boy at risk who finds a family; a good man tormented by grief and guilt whose fragmented self is made whole through a woman's care.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "June",
            "Year": "1997"
        }
    },
    {
        "Title": "The Mozart score (Crime club)",
        "Authors": "By Leather, Edwin",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Published for the Crime Club by Doubleday",
        "Price Starting With ($)": "8.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Truly One Nation",
        "Authors": "By Neuharth, Allen H. and Greaney, Daniel J.",
        "Description": "Shares the results of a six-month trip through all fifty states, gathering the opinions of average citizens concerning politics, works, business, charity, and religion",
        "Category": " History , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "The Coach's Wife: A Memoir",
        "Authors": "By Phelps, Teresa Godwin",
        "Description": "Here is an unprecedented look from the inside at big-time college sports, a memoir that bears equal comparison to Jill Ker Conway's The Road from Coorain and John Feinstein's A Season on the Brink. Taking us to the center of the high-pressure world of college basketball, Terry Phelps, wife of longtime Notre Dame head basketball coach Digger Phelps, shares the richly rewarding story of their life at Notre Dame and offers a surprising look at the Notre Dame sports mystique.In twenty years as Notre Dame's basketball coach, Digger Phelps won nearly 400 games. But his proudest statistic was his team's unparalleled 100 percent graduation rate. It could only have happened at Notre Dame, where President Theodore Hesburgh insisted that athletes be students too. During those two decades, not content to be just a \"lovelywife\" in sportscaster's parlance, Terry discovered a different Notre Dame mystique. For her it existed not on the football field or the basketball court, but in the classrooms, the campus ministry office, and all the other places where the spotlight rarely shines. Earning three degrees at Notre Dame, Terry became the first female \"triple Domer\" and a tenured professor in the law school. Notre Dame made her, she writes, \"a person who could talk about the soul without being embarrassed.\"Believing fervently in Notre Dame's ideals and happily raising their three children in the midst of the larger Notre Dame family, Terry and Digger were unprepared for the changes that occurred when Father Hesburgh retired. Under a new administration the ugliness of college sports elsewhere began to infect Notre Dame basketball, as the athletic department insisted on a schedule that left the players less and less time to be students and began to undercut Digger's position as one of the most respected and successful coaches in America. A formerly supportive campus atmosphere now became increasingly hostile.What happened next, as Terry and Digger battled to preserve their vision of Notre Dame sports at its best, is a story of absorbing human interest, narrated by Terry Phelps with astonishing grace and emotional honesty.",
        "Category": "",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "The Discovery of Our Galaxy",
        "Authors": "By Whitney, Charles Allen",
        "Description": "Recreates the lives, work and discoveries of the world's outstanding astronomers",
        "Category": " Science , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1971"
        }
    },
    {
        "Title": "Atlas of the Environment",
        "Authors": "By Lean, Geoffrey / Hinrichsen, Don / Markham, Adam",
        "Description": "A twenty-seven-year history of the environment outlines the problems humankind has created for itself, displaying, through maps, diagrams, and text the scope of the problems and actions needed to correct them",
        "Category": "",
        "Publisher": "Prentice Hall",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "A Smile as Big as the Moon: A Teacher, His Class, and Their Unforgettable Journey",
        "Authors": "By Layden, Joseph and Kersjes, Mike",
        "Description": "Besides being a football coach at his Michigan High School, MikeKersjes taught special education classes, dealing with children whose disabilities included Tourette syndrome, Downs Syndrome, dyslexia, eating disorders and a variety of emotional problems.One autumn Kersjes got the outlandish idea that his students would benefit from going to Space Camp, where, in conjunction with NASA, high school students compete in a variety of activities similar to those experienced by astronauts in training for space shuttle missions. There was only one problem: this program had been specifically designed for gifted and talented students, the best and the brightest from America's most privileged high schools.Kersjes believed that, given a chance, his kids could do as well as anybody, and with remarkable persistence broke down one barrier after another, from his own principal's office to the inner sanctum of NASA, until Space Camp opened its doors, on an experimental basis, to special ed students. After nine months of rigorous preparation, during which the class molded itself into a working team, they arrived at Space Camp, where they turned in a performance so startling, so surprising, that it will leave the reader breathless. A truly triumphant story of the power of the human spirit.",
        "Category": " Education , Special Education , General",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "The Binding Chair: or, A Visit from the Foot Emancipation Society",
        "Authors": "By Harrison, Kathryn",
        "Description": "In poised and elegant prose, Kathryn Harrison weaves a stunning story of women, travel, and flight; of love, revenge, and fear; of the search for home and the need to escape it. Set in alluring Shanghai at the turn of the century, The Binding Chair intertwines the destinies of a Chinese woman determined to forget her past and a Western girl focused on the promises of the future.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Harper Perennial",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "The Simpsons: A Complete Guide to Our Favorite Family",
        "Authors": "By Groening, Matt, Richmond, Ray (EDT), and Coffman, Antonia (EDT)",
        "Description": "It's hard to believe that the Simpsons have been around for more than a decade. Today, The Simpsons is the longest-running animated series of all time (dethroning The Flintstones in February 1997), and an intrinsic part of pop culture. The Simpsons Complete Guide to your Favourite Show is a celebration of this family's phenomenal decade. Arranged by season, the book covers each episode of the television show, with the special episodes (the annual Halloween show, \"Who Shot Mr. Burns?\" and \"Krusty Gets Kancelled\") receiving eyeball-busting two-page spreads. In addition, special sidebars are sprinkled throughout, showing: Simpsons firstsBart's chalkboard linesTop HomerismsAn Itchy & Scratchy filmographyA Springfield timelineThings the audience may have missed Highlighting the best of every show, The Simpsons is the ultimate celebration of the cartoon family that has kept the world in stitches. It is the ultimate must-have for all Simpsons aficionados.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Harper Design",
        "Price Starting With ($)": "6.04",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "The McGraw-Hill Internetworking Handbook (McGraw-Hill Series on Computer Communications)",
        "Authors": "By Taylor, Ed",
        "Description": "Written by a leading expert in the field, the book provides you with detailed coverage of all the dominant upper-layer protocols, including SNA, TCP/IP, Appletalk, APPN, OSI, DECnet, and NetWare; all the dominant lower-layer protocols, such as ATM, ESCON, ETHERNET, FDDI, Frame Relay, and X.25; all the major network devices, including repeaters, bridges, routers, servers, and gateways; and all data communications information applicable to networking.The McGraw-Hill Internetworking Handbook also features a complete glossary for quick reference, plus an extensive listing of important acronyms.",
        "Category": " Computers , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "11.18",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Battle of the Books: The Curriculum Debate in America",
        "Authors": "By Atlas, James",
        "Description": "Does it matter which books college students read? Indeed it does, contends James Atlas. What we read has crucial implications for both our development as individuals and our ability to establish consensus on national issues. We are what we read.Where once the giants of Western thought - Aristotle, Plato, Shakespeare, Milton, and Dante - had pride of place, university courses now boast authors such as Raymond Chandler, Alice Walker, and Louis L'Amour. Traditionalists argue that abandoning the \"Great Books\" spells doom for America's education system, a system that multiculturalists have called a white, elitist scam that fails to reflect America's multi-ethnic, non-European heritage.Has the \"opening\" of the curriculum gone too far? Atlas's attempt to answer this question takes him to university classrooms across America, where the canon of \"Great Books\" is being dismantled in the name of political correctness, and into his own past, as he considers the influence of these books on his own life.As ethnic groups reassert their identities and break from traditional assimilation, Atlas argues, America's need for common ground is greater than ever. Unless there is a set of core beliefs upon which to build consensus, there may soon be no clear idea of America, no common heritage, and no unified future.Like The Closing of the American Mind and The Disuniting of America, Battle of the Books is a powerful, unsettling argument that calls attention to a looming crisis in American education.",
        "Category": "",
        "Publisher": "W. W. Norton & Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Chance",
        "Authors": "By Parker, Robert B.",
        "Description": "Once again, Robert B. Parker makes artfulness look easy, with Chance, his sensational new thriller. This time Spenser - the tough-but-tender sleuth whose passion for justice repeatedly plunges him into a sea of trouble - hires out on a marital matter whose attached strings entangle him with the Mob.When big-time Boston hoodlum Julius Ventura approaches Spenser and his redoubtable sidekick, Hawk, about locating his only daughter's missing husband, it's clear he's not telling them the whole truth about the blushing bride and the ardent groom. In fact, he may be lying. But something about these missing links appeals to Spenser, and he agrees to take the case.So begins an odyssey into the netherworld of disorganized crime: from the throne rooms of crime lords to the Vegas strip; from two-bit wiseguys with a genius for dangerous liaisons to gangsters' molls in jeopardy; from larceny to homicide. And that's just for openers. All too soon, it becomes clear that what's at stake is not young love, but control of gangland Boston. Spenser and Hawk find themselves dead-center in a circus of violence whose shadowy ringmaster is all too familiar to a private eye with a past.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "G. P. Putnam's Sons",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Essential Client Server Survival Guide",
        "Authors": "By Orfali, Robert, Harkey, Dan, and Edwards, Jeri",
        "Description": "",
        "Category": "",
        "Publisher": "John Wiley & Sons Inc",
        "Price Starting With ($)": "6.3",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Christopher Discovers a Secret",
        "Authors": "By Merrick,  Donna",
        "Description": "",
        "Category": "",
        "Publisher": "Watertower Books",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "January",
            "Year": "1977"
        }
    },
    {
        "Title": "Critical Judgment",
        "Authors": "By Palmer, Michael",
        "Description": "Dr. Abby Dolan was on the fast track at a major San Francisco hospital when she made a critical choice: to follow her fiance, Josh Wyler, to the picturesque California town of Patience, where he has a new job with manufacturing giant Colstar. Working in a small-town emergency room, knowing that her every move sparks gossip, Abby nonetheless begins to feel at home - until the first undiagnosable patients start showing up.Abby calls them NIWWs: No Idea What's Wrong. And despite her considerable skills, she can't crack these baffling, seemingly random cases. At the same time, Josh is experiencing blinding headaches and pain-driven episodes of manic, even violent, behavior.Abby wonders whether Colstar could somehow be poisoning the town. Her suspicions are shared by ER colleague Dr. Lew Alvarez, whose investigating committee has shrunk from several dozen members to a cautious three. When Abby finds herself playing a dangerous game of cat and mouse with Colstar's steely head of security, Lew warns her that her predecessor in the ER, a Colstar detractor, died in a dubious climbing accident.But Abby cannot back off. She loses a patient in the ER, the victim of a murderous rage in a normally easygoing man. Another patient nearly dies during a routine diagnostic test. And Abby starts to question everyone and everything in the now hostile town of Patience - while her most dangerous enemy is far closer than she thinks.",
        "Category": " Fiction , Anthologies (multiple authors)",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1996"
        }
    },
    {
        "Title": "Pro Footballs Great Moments 19",
        "Authors": "By Rh Value Publishing",
        "Description": "",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "1984"
        }
    },
    {
        "Title": "Prevention's Quick and Healthy Low-Fat Cooking: Featuring Healthy Cuisines from the Mediterranean",
        "Authors": "By Rogers, Jean (EDT)",
        "Description": "Luscious, low-fat recipes-most ready in 30 minutes or less.Over 200 easy, great tasting recipes for light and lean dishes with at-a-glance nutritional information that all your family will eat up. There's a complete guide to the best low-fat ingredients and hundreds of healthy cooking tips.",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1994"
        }
    },
    {
        "Title": "Sleep With the Angels: A Mother Challenges AIDS",
        "Authors": "By Fisher, Mary",
        "Description": "The founder of the Family AIDS Network and noted AIDS activist describes her own battle with an HIV-positive diagnosis, her strategies for dealing with the disease, and the need for family support and the elimination of prejudice. 30,000 first printing.",
        "Category": " Medical , AIDS & HIV",
        "Publisher": "Moyer Bell Ltd.",
        "Price Starting With ($)": "8.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Sesame Street: Up in the Attic (Little Golden Book)",
        "Authors": "By Liza Alexander",
        "Description": "On a rainy afternoon Ernie and Bert entertain themselves with the wonderful treasures to be found in an attic.",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1996"
        }
    },
    {
        "Title": "Deep Space",
        "Authors": "By Ronan, Colin A",
        "Description": "Numerous photographs, diagrams, and drawings enhance the lucid, scientifically accurate up-to-date descriptions of deep space phenomena, such as quasars and black holes",
        "Category": " Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "6.66",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "The Peacemaking Struggle",
        "Authors": "By Stone, Ronald and Wilbanks, Dana",
        "Description": "This collection of essays focuses on the relationship of the Christian faith to the issues involved in the contemporary struggle over the meaning of resistance to militarism.",
        "Category": " Religion , Christianity , Presbyterian",
        "Publisher": "UPA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1985"
        }
    },
    {
        "Title": "The Little Salad Cookbook (The Little Cookbook Series)",
        "Authors": "By Fraser, Linda",
        "Description": "",
        "Category": "",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "The Bicentennial almanac: 200 years of America 1776-1976",
        "Authors": "By Linton, Calvin Darlington",
        "Description": "",
        "Category": "",
        "Publisher": "T. Nelson",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1975"
        }
    },
    {
        "Title": "The Best of Popular Photography",
        "Authors": "By Fondiller, Harvey V.",
        "Description": "A restrospective of Popular Photography since 1937, this liberally illustrated volume presents special articles, features, profiles, photographs, and reproductions to provide an accurate record of trends and developments in photography over the past four decades",
        "Category": " Photography , General",
        "Publisher": "Watson-Guptill Pubns",
        "Price Starting With ($)": "8.15",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "The Chinese Cookbook",
        "Authors": "By Claiborne, Craig, Lee, Virginia",
        "Description": "",
        "Category": "",
        "Publisher": "J. B. Lippincott Company",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "July",
            "Year": "1975"
        }
    },
    {
        "Title": "The English",
        "Authors": "By Priestley, J. B.",
        "Description": "",
        "Category": "",
        "Publisher": "The Viking Press",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "September",
            "Year": "1973"
        }
    },
    {
        "Title": "The Last Extinction",
        "Authors": "By Les Kaufman~Kenneth Mallory~Ken Mallory",
        "Description": "Essays discuss endangered species, mass extinctions of the past, the destruction of the Amazon rain forrest, extinct U.S. species, captive breeding programs, and the preservation of threatened wildlife",
        "Category": "",
        "Publisher": "The MIT Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1986"
        }
    },
    {
        "Title": "There's No Place Like Home",
        "Authors": "By Tom Dunsmuir",
        "Description": "The Muppets introduce many kinds of homes that people live in.",
        "Category": "",
        "Publisher": "Western Publishing Company, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "The Healthy Male: A Comprehensive Guide for Men nd the Women Who Care About Them",
        "Authors": "By Mylander, Maureen",
        "Description": "Provides information on stress, nutrition, exercise, tanning, sexualhealth, addiction, aging, heart disease, cancer, strokes, sexually transmitted diseases, dandruff, baldness, fertility, and suicide",
        "Category": " Medical , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "July",
            "Year": "1987"
        }
    },
    {
        "Title": "The Merchant of Menace (Jane Jeffry Mysteries, No. 10)",
        "Authors": "By Churchill, Jill",
        "Description": "It's Christmas season, and Jane Jeffry has guests coming, cookies baking, and music blaring from the next-door neighbor's garishly decorated house. But what's worse is the obnoxious, muck-raking TV reporter who arrives to do a piece on Jane's nice little neighborhood caroling party and decides that he'll play Old St. Nick. When his red-suited body slides off the neighbor's roof and lands, silenced forever, on top of a fallen plastic reindeer, it looks like the mishap was no accident, and Jane has to solve the mystery of who killed Santa Claus.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "From the Ocean to the Sky",
        "Authors": "By Hillary, Edmund, Sir",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1979"
        }
    },
    {
        "Title": "Family Memories: An Autobiographical Journey",
        "Authors": "By West, Rebecca and Evans, Faith (EDT)",
        "Description": "Written during the last two decades of West's life, this memoir traces the lives of the novelist's ancestors, recounting the family history that became the root and inspiration for her accomplishments",
        "Category": " Biography & Autobiography , General",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1988"
        }
    },
    {
        "Title": "Corduroy's Easter Lift-the-Flap",
        "Authors": "By McCue, Lisa (ILT), Hennessy, B. G., McCue, Lisa, and Freeman, Don (EDT)",
        "Description": "Celebrate 50 years of Corduroy with this fun lift-the-flap book.    Corduroy and his friends are so happy to play outside now that spring is here. In this cheerful book that's chock-full of flaps on each spread, children will enjoy discovering who's hiding at the playground, or peering under flaps to find baby animals at a farm. There are plenty of Easter preparations before the final spread, as readers join the search to see what the Bunny has left behind. Happy Easter, Corduroy!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "Viking Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1999"
        }
    },
    {
        "Title": "Defiance County",
        "Authors": "By Brandon, Jay",
        "Description": "Galilee is only an hour and a half south of metropolitan Houston, but it might as well be in another world. The slow pace of life there is entirely controlled by an aging matriarch, Alice Beaumont, owner of the town's only significant enterprise - a successful apparel factory. But a hideous double murder has rocked Galilee's ruling family, tearing the town apart. Alice's younger daughter, Lorrie, and her husband, Ronnie, have been shot to death in Alice's parlor, and their infant daughter has been snatched from her crib. The local district attorney, Morgan Fletcher, is closely tied to the Beaumont family ... but he is also the brother of the chief suspect, and must remove himself from investigating the crime.Thrust into this awful scenario is Kelsey Thatch, a young assistant DA sent from Austin as special prosecutor by the attorney general. At once, she feels the heavy hand of Alice Beaumont, pushing for the indictment and speedy trial of Billy Fletcher, who is Morgan's brother and her factory manager. Kelsey soon discovers that the townspeople's loyalties are fiercely divided between the accuser and the accused - and the entire population of Galilee is fixed in a grid of interlocking relationships that govern each one's actions.",
        "Category": " Fiction , Mystery & Detective , Police Procedural",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "Genome: The Story of the Most Astonishing Scientific Adventure of Our Time\u0097The Attempt to Map All the Genes in the Human Body",
        "Authors": "By Waldholz, Michael and Bishop, Jerry E.",
        "Description": "Studies the attempt to map all the genes in the human body, examining the resulting breakthroughs and the implications for genetic research",
        "Category": " Science , Life Sciences , Genetics & Genomics",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "August",
            "Year": "1990"
        }
    },
    {
        "Title": "Decorating for Comfort:: The Marriage of Ease and Style",
        "Authors": "By Seidman, Teri and Cohen, Sherry Suib",
        "Description": "An illustrated guide to home decoration and interior design explains how to integrate comfort with beauty, style, and elegance, discussing such topics as different types of comfort, stylistic themes, and ways to achieve functional, emotional, and visual ease. 30,000 first printing.",
        "Category": " House & Home , Decorating",
        "Publisher": "Villard",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "The Center Holds",
        "Authors": "By Simon, James F.",
        "Description": "In The Center Holds, James E. Simon provides the first behind-the-scenes look at the private deliberations and deep disagreements of the justices of the Rehnquist Court at a critical juncture in the history of the modern Supreme Court. But more than that, he gives us the inside story of a conservative judicial revolution that failed.Simon focuses on four crucial areas of civil rights and liberties - racial discrimination, abortion, criminal law, and First Amendment freedoms - to chronicle the most intense confrontations between the old liberal order and the emerging conservative majority. He takes us into the courtroom where the cases were argued, into the closed conferences where they were fiercely debated, and into the justices' private chambers where strong personalities and wills often collided.In fascinating detail, Simon shows that it was the internal dynamic among the justices - and their desire to stake out independent positions - that ultimately discouraged the wholesale revolution that Reagan, Bush, and Rehnquist hoped to achieve.This is a compelling, behind-the-scenes account of how the justices fought - sometimes diplomatically, sometimes with bare-knuckled determination - for the soul of the Court, and of how, in the end, the center held.",
        "Category": " Law , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Back to Basics: The Traditionalist Movement That Is Sweeping Grass-Roots America",
        "Authors": "By Pines, Burton Yale",
        "Description": "Details the activities and successes of New Right individuals and organizations that are seeking to reestablish traditional ways, means, and values in the fields of religion, the family, education, business, government, and law and order",
        "Category": " Social Science , General",
        "Publisher": "William Morrow & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1982"
        }
    },
    {
        "Title": "Savoring the Wine Country",
        "Authors": "By Rothfeld, Steven (PHT), Halm, Meesha (EDT), and Macy, Dayna (EDT)",
        "Description": "A tour of California's Napa, Sonoma, and Mendocino counties combines landscape illustrations, portraits of the area's finest restaurants, and recipes for such regional specialties as Local Wild Mushroom Ragout and Wild Huckleberry Tarts. Simultaneous.",
        "Category": " Cooking , Beverages , Alcoholic , Wine",
        "Publisher": "William Morrow Cookbooks",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "Fooling with Words: A Celebration of Poets and Their Craft",
        "Authors": "By Moyers, Bill D. (EDT)",
        "Description": "A Celebration of Poets and Their CraftColeman BarksLorna Dee CervantesMark DotyDeborah GarrisonJane HirshfieldStanley Kunitz Kurtis LamkinShirley Geok-Lin LimPaul MuldoonMarge PiercyRobert Pinsky",
        "Category": " Poetry , General",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2000"
        }
    }
]