[
    {
        "Title": "A Woman's Book of Days: Inspiration and Celebration",
        "Authors": "By Thomas Nelson Publishers",
        "Description": "",
        "Category": " Religion , Inspirational",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "Boxers (Animal Planet® Pet Care Library)",
        "Authors": "By Gallagher, Cynthia P.",
        "Description": "This unique guide covers the variety of sports and events that best showcase the athletic nature of the Boxer. TFH Publications, Inc. has teamed up with Animal Planet, the only television network devoted to the unique bonds between humans and animals, to present an exciting new series of comprehensive guides to superior pet care. Each book in the Animal Planet Pet Care Library offers incredible value, featuring 112 pages of all-new, current information from pet care and animal experts—with a family-friendly design, over 60 full-color photographs, and helpful tip boxes. Also included is advice on feeding, housing, grooming, training, health care, and fun activities.",
        "Category": " Pets , Dogs , Breeds",
        "Publisher": "T.F.H. Publications, Inc.",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "September",
            "Year": "2006"
        }
    },
    {
        "Title": "Gardening Through the Year: A Step-By-Step Guide to Seasonal Gardening Tasks",
        "Authors": "By McHoy, Peter",
        "Description": "A seasonal guide takes readers on a step-by-step tour through the year, offering specific instructions for obtaining successful results on a month-by-month basis for plants, vegetables, fruits, and flowers.",
        "Category": " Gardening , General",
        "Publisher": "Smithmark Pub",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "April",
            "Year": "1995"
        }
    },
    {
        "Title": "Seeing is not believing: Structuring your daily life on faith",
        "Authors": "By Susek, Ron",
        "Description": "",
        "Category": "",
        "Publisher": "Masters Press",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "If I Have a Wicked Stepmother, Where's My Prince?",
        "Authors": "By Kantor, Melissa",
        "Description": "Wicked stepmother? Check. Evil stepsisters? Check. Miserable life? Check.Lucy Norton’s life has all the makings of a Cinderella story. Her dad’s always away on business, leaving Lucy with her cruel stepmother and bratty stepsisters. She’s burdened with chores, and has a hard time fitting in at her new school. So when she sees Connor Pearson, the star player on the varsity basketball team, Lucy hopes her destiny has finally changed. With everything else going on in her life, doesn’t she at least deserve to get the handsome prince?Melissa Kantor’s enchanting novel proves that sometimes the happy ending isn’t quite the one you’d expect. Lucy’s about to discover the truth about finding her real Prince Charming… and finding herself.",
        "Category": " Young Adult Fiction , Fairy Tales & Folklore , Adaptations",
        "Publisher": "Hyperion Book CH",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2007"
        }
    },
    {
        "Title": "Games and Puzzles (Games and Puzzles Series)",
        "Authors": "By Smith, Alastair",
        "Description": "Provides instructions for making and playing a variety of board and other types of games, along with a collection of mazes, picture puzzles, math and logic puzzles, and other brainteasers.",
        "Category": " Juvenile Nonfiction , Games & Activities , Puzzles",
        "Publisher": "Usborne Pub Ltd",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Snow White and the Sever Dwarfs",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Longmeadow Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Ortho's Home Improvement Encyclopedia: Problem Solving From A To Z",
        "Authors": "By Ortho Books",
        "Description": "This comprehensive reference features recommendations, explanations, and how-to instructions to cover diverse aspects of home repair and remodeling",
        "Category": "",
        "Publisher": "see notes for publisher info",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Igor Movie Adaptation",
        "Authors": "By Kesel, Barbara and Bond, Grant (CON)",
        "Description": "In the land of Malaria, it always rains and evil scientists are celebrities. Igor is a hunchbacked lab assistant who dreams of becoming a real scientist and winning first prize at Malaria's annual Evil Science Fair. With the help of Scamper, a morose, immortal rabbit and Brain, a not-so-bright brain in a jar, Igor tries to pull off the greatest scientific feat ever seen! IDW Publishing is proud to be present this adaptation of Igor, the first animated feature to be released by The Weinstein Company.",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Angel: Blood and Trenches",
        "Authors": "By Byrne, John",
        "Description": "In Europe, war ravages nations, but a greater darkness than human conflict calls Angel back across the ocean from his distant home in America — bodies of combatants found drained of blood, and signs of an ancient evil once more abroad in the world. Writer/artist John Byrne tells an untold tale of Angel’s WWI exploits!",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Now You Know Question and Answer Book",
        "Authors": "By Long, Jack and McKissack, Vernon (ILT)",
        "Description": "",
        "Category": "",
        "Publisher": "WiSHING WELL BOOKS",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1993"
        }
    },
    {
        "Title": "Astro Boy: Movie Prequel",
        "Authors": "By Tipton, Scott and Jourdan, Diego (ILT)",
        "Description": "He's back! Astro Boy makes his amazing return to comics, paving the way for his exciting feature film debut later this year! It's an all-new Astro Boy adventure, with Astro exploring a strange subterranean kingdom in search of his lost father, encountering weird creatures large and small. But are they friend or foe?",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Of the People, By the People, For the People",
        "Authors": "By Agel, Jerome and Bernstein, Richard Bruce",
        "Description": "An accessible guide to the United States government features illuminating histories of the processes of the three branches--Executive, Judicial, and Legislative--and discussion that explains the ins and outs of the government.",
        "Category": " Political Science , General",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Billboards",
        "Authors": "By Meth, Clifford and Gutierrez, Dave (ILT)",
        "Description": "In the not-too-distant future, when every conceivable flat surface is covered by advertising, men and women begin selling the geography of their bodies to the highest corporate bidders. What they don't know is that the new tattoos have integrated circuits that track every product they use. It's no big deal... that is, until weddings are forbidden based on corporate conflicts of interest! Featuring an Introduction by science-fiction legend and multi-HUGO and NEBULA Award-winning auther Robert Silverberg, and with art by Dave Gutierrez, this biting satire by Clifford Meth (SNAKED) will tickle the bejezus out of you!",
        "Category": " Comics & Graphic Novels , Science Fiction",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Gary the Pirate",
        "Authors": "By Sava, Scott Christian and Bailey, Tracy (ILT)",
        "Description": "Thirteen-year-old Judy is so sick of boys and their immature ways. One night, Judy meets a boy unlike any she’s ever seen — a real, live pirate! But Gary isn’t after girls — he’s after treasure! Judy offers to help this hapless pirate and they embark on an adventure of a lifetime!",
        "Category": " Juvenile Fiction , Comics & Graphic Novels , General",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Otto's Orange Day (Toon)",
        "Authors": "By Lynch, Jay and Cammuso, Frank (ILT)",
        "Description": "“[A] high-quality comic that is both loads of fun and easy to read…[S]ure to engage a new generation in the art form; kids will want to read it once, then return to it again and again.”– Booklist (starred review)When Otto the cat meets a magical genie, he knows just what to wish for: he makes the whole world orange! At first, this new, bright world seems like a lot of fun, but when his mom serves orange spinach for lunch, Otto realizes that his favorite color isn’t the best color for everything. Fixing this mixed-up world won’t be easy, though, because Otto already used up his only wish. To save the day, Otto will need his family’s help, some quick thinking, and…a pizza? Two master cartoonists collaborate to bring all the fun and magic comics can offer to early readers.From the Hardcover edition.",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "TOON Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Cameron And His Dinosaurs",
        "Authors": "By Sava, Scott Christian and Blanco, Andres Silva (CON)",
        "Description": "A mad scientist breaks every law of nature and creates four extinct dinosaurs for a terrorist group called B.U.R.P.S. When the dinosaurs revolt, it's Cameron's good fortune to befriend them! But the mad scientist and his employers want those dinosaurs back at any cost, and they'll wage a war between robots and dinosaurs to get what they want!",
        "Category": " Juvenile Fiction , Bedtime & Dreams",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Who Will Be My Friends? (An Early I Can Read Book)",
        "Authors": "By Syd Hoff",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Pooh's Easter Basket",
        "Authors": "By Walt Disney Company (COR)",
        "Description": "It’s Easter in the Hundred-Acre Wood, and Pooh and his friends are finding all the colorful eggs! Can you name all the colors along with Pooh? This sturdy board book is die-cut in the shape of basket and features a braided handle. And the glitter on the cover makes every Easter egg in Pooh’s basket sparkle!",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Easter & Lent",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "Air Patrol",
        "Authors": "By Michael Teitelbaum",
        "Description": "",
        "Category": "",
        "Publisher": "Readers Digest",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Jungle Journal",
        "Authors": "By Totaro, Roberto",
        "Description": "It's The Far Side meets Jungle Book! It's not all fun and games in the jungle... but it sure is in Jungle Journal! This adorable collection of color stories shows a slice of off-beat life in the jungle, where monkeys, rhinos, elephants, birds, and more all share whacky moments thanks to the steady hand of Italian writer/artist Roberto Totaro.",
        "Category": " Juvenile Fiction , Comics & Graphic Novels , General",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "Terminator: Salvation Movie Prequel",
        "Authors": "By Naraghi, Dara, Robinson, Alan (ILT), Smith, Tom (CON), Uyetake, Neil (CON), and Waltz, Tom (EDT)",
        "Description": "The year is 2018. With John Connor as the voice of the resistance, the scattered remnants of humanity find themselves united against their common enemy — Skynet and its Terminators. Through a patchwork system of radio transmitters, hacked satellite phones, and encrypted computer networks, resistance leader Elena Maric in Detroit and Nigerian mining engineer Bem Aworuwa have formed an unlikely friendship and drawn up battle plans to take the fight to the Terminators!",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.32",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "MICKEY & THE BEANSTALK (Disney's wonderful world of reading)",
        "Authors": "By Walt Disney Productions",
        "Description": "Retells the traditional tale of Jack and the beanstalk with Mickey Mouse, Donald Duck, and Goofy playing major roles.",
        "Category": "",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1973"
        }
    },
    {
        "Title": "Revelations (The Transformers: Spotlight)",
        "Authors": "By Roche, Nick (ILT), Khanna, Dan (ILT), Su, E. J., and Furman, Simon (CON)",
        "Description": "Following the events of Transformers: Devastation, long-lost Cybertronians are returning from a dead dimension with plans to set off a cosmic event that could mean the end of our universe as we know it! Can the Autobots retrieve an all-knowing, all-seeing artifact before the coming apocalypse, despite having a double agent in their midst? But would that even save them from Nemesis Prime's master plan? Originally presented in one-shots featuring Cyclonus, Hardhead, Doubledealer, and Sideswipe.",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "8.08",
        "Publish Date": {
            "Month": "February",
            "Year": "2009"
        }
    },
    {
        "Title": "The Environmental Gardener (Plants & Gardens Brooklyn Botanic Garden Record, Vol. 48, No. 1 Spring, 1992)",
        "Authors": "By Marinelli, Janet (EDT)",
        "Description": "",
        "Category": " Gardening , General",
        "Publisher": "Brooklyn Botanic Garden",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "My \"W\" Book",
        "Authors": "By Jane Belk Mancure",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "My \"t\" Book",
        "Authors": "By Jane Belk Moncure",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Publishing Co. Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "My \"L\" Book",
        "Authors": "By Belk Moncrue, Jane",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Publishing Co. Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "My \"j\" Book",
        "Authors": "By Moncure, Jane Belk",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Publishing Co. Inc.",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "My \"i\" Book",
        "Authors": "By Jane Belk Moncure",
        "Description": "",
        "Category": "",
        "Publisher": "Grolier Publishing Co. Inc.",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Jonah and the Whale (Touch and Feel)",
        "Authors": "By Amanda Bartlett",
        "Description": "",
        "Category": "",
        "Publisher": "Paradise Press, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Hypoglycemia: The Classic Healthcare Handbook Completely",
        "Authors": "By Saunders, Jeraldine and Ross, Harvey M.",
        "Description": "Linking hypoglycemia to a wide range of disorders, from depression to heart disease, a completely revised and updated edition of the classic health guide explains how to identify and control hypoglycemia, lists important foods to avoid, and features the revolutionary Vim and Vigor Diet, which helps regulate blood sugar while promoting weight loss. Reprint.",
        "Category": " Health & Fitness , Diseases , General",
        "Publisher": "Kensington",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "Benjamin Bunny (Pop Up Book)",
        "Authors": "By Potter, Beatrix and Bruno, Elsa Knight",
        "Description": "In this retelling with pop-up illustrations, Peter's mischievous cousin, Benjamin Bunny, persuades him to go back to Mr. McGregor's garden to retrieve the clothes he lost there.",
        "Category": " Juvenile Fiction , Animals , Rabbits",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1992"
        }
    },
    {
        "Title": "G.I. JOE The Rise Of Cobra Official Movie Prequel",
        "Authors": "By Dixon, Chuck and Gallant, Sl (ART)",
        "Description": "You've seen the blockbuster movie! Now find out the real stories of Duke, Destro, The Baroness, and Snake Eyes as they each take center stage prior to the film's pulse-pounding opening! Learn how Duke and Ripcord became friends in one of their earlier missions! See Destro in action across the globe, outwitting terrorists who try to rip him off! Witness The Baroness seduce, manipulate, and eviscerate her prey! And last, but not least, marvel at the mysteries of Snake Eyes revealed!",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "David and Goliath (Great Bible Stories)",
        "Authors": "By Maxine Nodel",
        "Description": "",
        "Category": "",
        "Publisher": "Baronet Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "G.I. Joe: Rise of Cobra - Official Movie Adaptation",
        "Authors": "By Tipton, Denton and Maloney, Casey (ART)",
        "Description": "The official adaptation of this summer's highly anticipated film G.I. Joe: Rise of Cobra picks up where the movie prequels leave off!A case holding weapons of mass destruction sets off a struggle between a group of elite military operatives codenamed G.I. JOE, and a mysterious terrorist outfit that has just reared its ugly head!",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Great Bible Stories: Jonah",
        "Authors": "By Maxine Nodel",
        "Description": "",
        "Category": "",
        "Publisher": "Baronet Books",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "1993"
        }
    },
    {
        "Title": "Angel: Smile Time (Angel (IDW Hardcover))",
        "Authors": "By Lynch, Brian, Mariotte, Jeff, and Edlund, Ben (ADP)",
        "Description": "From the same team behind IDW’s bestselling series from creator Joss Whedon, Angel: After the Fall, comes three tales about the fan-favorite puppet characters! This collection features the re-adaptation of the fan-favorite episode Smile Time, the mini-series Shadow Puppets (which include puppet Spike and Lorne), and a puppet story from the special collection Angel: Mask.",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Transformers: Revenge of the Fallen Movie Prequel - Alliance",
        "Authors": "By Milne, Alex (ILT) and Mowry, Chris",
        "Description": "The official prequel to next summer’s Transformers: Revenge of the Fallen film kicks off here! In this first chapter of the Destiny story arc, \"Alliance,\" readers will learn more about what happened to Sector Seven and the Autobots, and why their war on our planet is far from over. Discover the events that bridge the two blockbusters as envisioned by the creative team behind The Transformers Movie Sequel: Reign of Starscream, Chris Mowry and Alex Milne.",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2009"
        }
    },
    {
        "Title": "Public Policymaking in a Democratic Society: A Guide to Civic Engagement",
        "Authors": "By Ehrlich, Thomas (FRW) and Gerston, Larry N.",
        "Description": "This book provides a \"macro\" overview of public policymaking as well the \"micro\" level knowledge that enables ordinary citizens, both individually and collectively, to become involved in public policymaking. It combines a bird's eye view of political institutions, processes, and relationships with a \"how-to\" approach to civic engagement. Each chapter includes a policy case study, a student project, and discussion questions. Designed as a service-learning supplement for courses in public policy and American or local government, for fieldwork courses and internships, and for teacher training, the book will be equally useful in any organized effort to foster community service and civic responsibility.",
        "Category": " Political Science , Public Policy , General",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Angel Experiment: A Maximum Ride Novel (Book 1)",
        "Authors": "By Patterson, James",
        "Description": "Max soars above the world . . . but in James Patterson's thrilling adventure, fantasy can come crashing down to reveal the nightmares of the Angel Experiment.Maximum Ride and her \"flock\" -- Fang, Iggy, Nudge, Gasman and Angel -- are just like ordinary kids, only they have wings and can fly. It may seem like a dream come true to some, but their lives can morph into a living nightmare at any time.Angel, the youngest member of the flock, is kidnapped and taken back to the \"School\" where she and the others were experimented on by a crew of whack jobs. Her friends brave a journey to blazing hot Death Valley, CA, to save Angel, but soon enough, they find themselves in yet another nightmare: fighting off the half-human, half-wolf \"Erasers\" in New York City. Whether in the treetops of Central Park or in the bowels of the Manhattan subway system, Max and her adopted family take the ride of their lives. Along the way, Max discovers that her purpose is save the world. But can she?",
        "Category": " Young Adult Fiction , Fantasy , General",
        "Publisher": "jimmy patterson",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "G.I. Joe Volume 1",
        "Authors": "By Dixon, Chuck and Atkins, Robert (ART)",
        "Description": "It starts here! G.I. Joe explodes out of the gate in their very first adventure! Destro, the twisted-yet-honorable arms dealer from Scotland is planning something big — a new weapon called the Mass Device that can — and will — change the face of warfare forever! Meanwhile, G.I. Joe is under attack in their own secret base of operations! But who could have found — much less attack — them! Where has Snake Eyes gone and what is his mysterious connection to G.I. Joe member Scarlett? And under the shadows, whispers of a terrible and powerful organization grow louder. Whispers that say one word over and over... \"COBRA.\"",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "IDW Publishing",
        "Price Starting With ($)": "24.0",
        "Publish Date": {
            "Month": "July",
            "Year": "2009"
        }
    },
    {
        "Title": "Grimm's Fairy Tales (Barnes & Noble Classics)",
        "Authors": "By Grimm, Wilhelm, Grimm, Jacob, Dalton, Elizabeth, and Grimm, Ludwig Emil",
        "Description": "&&LDIV&&R&&LDIV&&R&&LDIV&&R&&LI&&RGrimm's Fairy Tales&&L/I&&R, by &&LSTRONG&&RWilhelm and Jacob Grimm&&L/B&&R&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&RNew introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RWith the words “Once upon a time,” the Brothers Grimm transport readers to a timeless realm where witches, giants, princesses, kings, fairies, goblins, and wizards fall in love, try to get rich, quarrel with their neighbors, and have magical adventures of all kinds—and in the process reveal essential truths about human nature. &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RWhen &&LB&&RJacob and Wilhelm Grimm&&L/B&&R set out to collect stories in the early 1800s, their goal was not to entertain children but to preserve Germanic folklore—and the hard life of European peasants was reflected in the tales they discovered. However, once the brothers saw how the stories entranced young readers, they began softening some of the harsher aspects to make them more suitable for children. &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RA cornerstone of Western culture since the early 1800s, &&LI&&RGrimm’s Fairy Tales&&L/I&&R is now beloved the world over. This collection of more than 120 of the Grimms’ best tales includes such classics as “Cinderella,” “Snow White,” “Hansel and Grethel,” “Rapunzel,” “Rumpelstiltskin,” “Little Red Riding Hood,” and “The Frog Prince,” as well as others that are no less delightful.&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LDIV&&R&&LB&&RElizabeth Dalton&&L/B&&R is Professor of English and Comparative Literature at Barnard College. She has published fiction and criticism in &&LI&&RThe New Yorker&&L/I&&R, &&LI&&RPartisan Review&&L/I&&R, &&LI&&RCommentary&&L/I&&R, and &&LI&&RThe New York Times Book Review&&L/I&&R.&&L/DIV&&R&&L/DIV&&R&&L/DIV&&R",
        "Category": " Fiction , Fantasy , General",
        "Publisher": "Sterling Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "Richard Scarry's Cars",
        "Authors": "By Scarry, Richard",
        "Description": "Animals drive cars, visit the garage, put out a fire, ride on buses, fix a flat tire, and try to avoid accidents",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "Beyond the Savage Sea (Lovestruck)",
        "Authors": "By Wendt, Jo Ann",
        "Description": "A marriage of convenience seems the only alternative for Edwinna Crawford, the fate of whose plantation hangs in the balance, and Drake Steel, a pirate sentenced to die, but their stormy union could cause them more trouble than it is worth",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Popular Library",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1990"
        }
    },
    {
        "Title": "As You Like It (Dover Thrift Editions)",
        "Authors": "By Shakespeare, William",
        "Description": "Unjustly deposed by his younger brother, the rightful duke retreats to the Forest of Arden and forms a utopia with his loyal followers while his daughter remains at court as a companion to her cousin. When forbidden romance enters their lives, the girls assume disguises and flee to the forest, where they encounter a magical world of friendly outlaws and wise fools. Both a lighthearted comedy and a deeper exploration of social and literary issues, this play features a memorable cast of characters and some of Shakespeare's finest poetry.",
        "Category": " Drama , Shakespeare",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Passion in the Blood",
        "Authors": "By Seymour, Arabella",
        "Description": "Anna Brodie, the illegitimate daughter of a nineteenth-century British landowner, is determined to become a successful horse breeder, but is uncertain whether she should accept the help of a handsome widower, Lord Russell",
        "Category": " Fiction , Romance , General",
        "Publisher": "Warner Books Inc (Mm)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Broken Silence (Family Secrets)",
        "Authors": "By Shayne, Maggie, Wilks, Eileen, and Winston, Anne Marie",
        "Description": "The matriarchs of Greenlaurel, Texas, host a Bluebonnet Ball to distract the residents from the recent discovery of government experiments in genetic manipulation, which has sent shockwaves throughout the community--a thrilling night of dark secrets and dangerous desires. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "Before I Print",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Trend Enterprises, Incorporated",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Border Fire",
        "Authors": "By Scott, Amanda",
        "Description": "Heir apparent and highwayman Sir Quinton Scott is rescued from the hangman's noose by impetuous Janet Graham, who is swept away by Quin despite the risks when he fears her actions will condemn her. Original.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Johnson's Child Development: Your Baby from Birth to 6 Months (Johnson's Child Development)",
        "Authors": "By Holland, Katy",
        "Description": "An inexpensive development reference for parents from the most trusted name in childcare. Aiming to provide parents with an accessible reference series to their child's physical, cognitive, and emotional development, Johnson's Ages & Stages provides a comprehensive overview of when development occurs, how it is expressed individually, and what parents can do to nurture and stimulate their child. Each of the four books in the series outlines important milestones for each age group, and helps chart a child's growth at each stage of development.",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "DK",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "My Freshman Manual: The Official College Handbook",
        "Authors": "By Turton, Joe P.",
        "Description": "",
        "Category": "",
        "Publisher": "Creative Publishing",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "Goodnight, Sweetheart (Berkley Sensation)",
        "Authors": "By Simmons, Suzanne",
        "Description": "After losing her job, Sydney Marie St. John returns home to Sweetheart, Indiana, where she literally collides with Eric Law, a successful lawyer--and the object of her high school crush long ago--a chance encounter that leads to unexpected love. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "Gospel Parallels: A Synopsis of the First Three Gospels",
        "Authors": "By Throckmorton, Burton H.",
        "Description": "",
        "Category": "",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Gargoyles (Golden Books)",
        "Authors": "By Henry, Lawrence",
        "Description": "The gargoyles who guard a Scottish castle from the Vikings are turned to stone until the castle should rise above the clouds",
        "Category": " Juvenile Fiction , General",
        "Publisher": "Golden Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1995"
        }
    },
    {
        "Title": "Wanted - Movie Edition",
        "Authors": "By Millar, Mark and Jones, J. G. (ILT)",
        "Description": "What if everything in your life was out of your hands and those around youpropelled your fate? Your girlfriend left you for your best friend; your bossgave your job to someone better. What if then, after all this, someone gave youback total control? What if he revealed you were the next in line to join asecret society of super-villians that controlled the entire planet? Mark Millarand J.G. Jones provide a look at one man who goes from being the world's biggestloser to the deadliest assassin alive.",
        "Category": " Comics & Graphic Novels , Media Tie-In",
        "Publisher": "Image Comics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Dollar Meltdown: Surviving the Impending Currency Crisis with Gold, Oil, and Other Unconventional Investments",
        "Authors": "By Goyette, Charles",
        "Description": "\"America's debt is a powder keg about to blow, and the fuse was lit by the rush of bailouts and stimulus spending.\"  Is your money inflation-proof? It had better be. On the heels of the most recent economic crisis, America is headed toward another: high inflation and dollar devaluation. Charles Goyette reveals the governmental errors that led to the current economic crisis and the bumpy road ahead. The signs are clear: Federal debt is compounding while growth has stalled, and America's foreign creditors are questioning the dollar's reserve currency status. Meanwhile, the \"hidden\" federal debt, much larger than the official debt, makes things even worse. So what can you do to safeguard your assets when the dollar heads south? This book is the essential guide for protecting yourself--and even profiting--in this time of financial turbulence. In clear detail, Goyette explains the alternative investments--from gold and silver to oil and agriculture-- that will remain strong in the face of mounting inflation. The Dollar Meltdown gives you the tools to maintain the value of your savings and captilize on the coming opportunities. Don't get left holding the bag after decades of government irresponsibility. The Dollar Meltdown shows you how to take the safety of your finances into your own hands.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Portfolio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "The Long Chase",
        "Authors": "By Eshleman, John M.",
        "Description": "",
        "Category": "",
        "Publisher": "Ives Washburn",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1954"
        }
    },
    {
        "Title": "Rocks and Minerals (Macmillan Field Guide)",
        "Authors": "By Wright, David and Bell, Pat",
        "Description": "Identifies more than four hundred rocks and minerals, explains how rocks form, and suggests clothing, equipment, and techniques for fieldwork",
        "Category": " Science , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1985"
        }
    },
    {
        "Title": "Prickly Pear",
        "Authors": "By Thompson, Ronda",
        "Description": "",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1999"
        }
    },
    {
        "Title": "The Winter of Her Discontent: A Rosie Winter Mystery (Rosie Winter Mysteries, 2)",
        "Authors": "By Haines, Kathryn Miller",
        "Description": "It's tough shooting for stardom when there's a war on. But Rosie's got enough pluck for two: she's willing to stumble around in a Broadway dance chorus that she has no right to be a part of, in a musical that's got \"flop\" written all over it. And all the while, she's worrying about her missing-in-action soldier boyfriend, who hasn't written in months. Lately, she's also been keeping bad company with her mob-muscle pal, Al, who's dabbling in a host of shady money-making enterprises in this time of shortages and rationing. But despite his illicit line of work, Al's no killer. When the cops finger him for his girlfriend's murder, Rosie and Jayne, her close compatriot/fellow castmate, set out to clear big Al's name, and plunge into an intricate backstage drama featuring a bevy of suspiciously well-dressed wannabe starlets. But the plot could soon be taking another lethal turn, bringing a final curtain down on Rosie, Jayne, and all their good intentions.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "How I Came to Be A Writer",
        "Authors": "By Naylor, Phyllis Reynolds",
        "Description": "Newbery Medalist Phyllis Reynolds Naylor's one hundred and more books are true to life, funny, and, most of all, well written -- you'd think that she doesn't have to work at writing at all. But that's not true.  How I Came to Be a Writer is the story of one author's beginnings -- successes and failures, reviews and rejection slips -- things that mark the stages of a writer's life. Illustrated with photographs, and including samples of her earlier writing, this book will show you the inner workings of the writing process, from the spark of an idea to a book's actual publication.  This classic writer's memoir has been revised and updated to include material on the writing of the Newbery-winning Shiloh and its two sequels.",
        "Category": " Young Adult Nonfiction , Language Arts , Composition & Creative Writing",
        "Publisher": "Atheneum Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "A Swim Through the Sea",
        "Authors": "By Pratt, Kristin Joy",
        "Description": "Uses the letters of the alphabet to introduce angelfish, dolphins, manatees, octopus, and other fish and mammals living in the world's oceans, giving their physical charactistics and behavior.",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Dawn Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2006"
        }
    },
    {
        "Title": "King Kong",
        "Authors": "By Delos W. Lovelace",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Putnam~childrens Hc",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Cover Letters For Dummies",
        "Authors": "By Kennedy, Joyce Lain",
        "Description": "A great cover letter isWritten to a target jobSo intriguing that a reader makes room in a busy schedule to meet youAn electrifying personal advertising tool that short-circuits the competitionA great cover letter is notBland and indifferentLittered with dry factsWhat the hiring manager's kid uses as scratch paperYour cover letter should spark the reader's interest as a dynamic introduction to your resume. This is your chance to personalize your resume. Here's where you make yourself into a living, breathing human being and set your accomplishments aglow. How do you achieve this? Let the second edition of Cover Letters For Dummies be your guide.In this book, you'll gain understanding of why you need a cover letter, what the different types of cover letters are, what myths surround them, and how to break out of writer's block. You'll figure out how your letter should look and sound, with tips on language, content, and image. You'll get ideas for writing a dazzling opening line. And you'll work through a checklist to make sure that the best of you lives in your cover letter. What's more, you'llExplore the changing rules in the workplace and how they impact the way you find workIdentify where your skills fit in today's workplace through a number of self-assessment worksheetsSum up surefire tips for working with recruiters, answering job ads, avoiding the salary question, handling negative references, and creating letters that even a computer can loveSee examples of successful cover letters, from which you can model your own. Each is a candidate for reformulation as an e-mail cover letter.A well-written cover letter can make your ideal job a reality. So get this book and start writing.",
        "Category": " Business & Economics , Careers , Resumes",
        "Publisher": "For Dummies",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Night Walker",
        "Authors": "By Sommerfield, Sylvie",
        "Description": "A missionary teacher on Sioux territory in the Dakotas, Brittany stumbles upon a Native American warrior who refuses to explain his presence in her village but seems to be there to steal her heart and inflame her passion. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Leisure Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1998"
        }
    },
    {
        "Title": "Smokescreen",
        "Authors": "By Francis",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "The Triathlete's Training Bible",
        "Authors": "By Friel, Joe",
        "Description": "The Triathlete’s Training Bible is the bestselling and most comprehensive reference available to triathletes.Based on Joe Friel’s proven, science-based methodology and his 28 years of coaching experience, The Triathlete’s Training Bible has equipped hundreds of thousands of triathletes for success in the sport. The Triathlete's Training Bible  equips triathletes of all abilities with every detail they must  consider when planning a season, lining up a week of workouts, or  preparing for race day.With this new edition, you will develop your own personalized training plan and learn how to:      improve economy in swimming, cycling, and running     balance intensity and volume     gain maximum fitness through smart recovery     make up for missed workouts and avoid overtraining     adapt your training plan based on your progress     build muscular endurance with a new approach to strength training     improve body composition with smarter nutrition The Triathlete’s Training Bible  is the best-selling book on tri training ever published. Get stronger,  smarter, and faster with this newest version of the bible of the sport.",
        "Category": " Sports & Recreation , Triathlon",
        "Publisher": "VeloPress",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Two Years Before the Mast: A Personal Narrative of Life at Sea (Penguin Classics)",
        "Authors": "By Dana, Richard Henry",
        "Description": "In 1834, Richard Henry Dana Jr. left the comforts of Boston for the hardships and abuses of the most exploited segment of the American working class.  Dana’s account of his passage around Cape Horn to California, and back, is a remarkable portrait of the seagoing life: the day-to-day routines and conversations, the sailors who manned the ship, the brutality of incompetent officers, and the style of life in the newly emerging coastal towns of California.  As Thomas Philbrick discusses in his introduction, the public’s sympathy for the plight of mariners, which was aroused by the book, eventually faded, but Two Years Before the Mast forever changed readers’ romanticized perceptions of life at sea and inaugurated a lasting tradition of realism and concern for human values.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1981"
        }
    },
    {
        "Title": "A Grateful Remembrance: The Story of Montgomery County, Maryland",
        "Authors": "By Hiebert, Ray Eldon",
        "Description": "",
        "Category": "",
        "Publisher": "Montgomery County Govt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1976"
        }
    },
    {
        "Title": "Strange but True : Weird Stories from the Wacky World of Sports",
        "Authors": "By Egan, Erin (Series Editor)",
        "Description": "",
        "Category": "",
        "Publisher": "Sports Illustrated for Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "What Kind of a House is That?",
        "Authors": "By Memling, Carl",
        "Description": "",
        "Category": "",
        "Publisher": "Parents' Magazine Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Special Occasions - Birthdays",
        "Authors": "By dianna-kalenuik-kim-griffiths-ron-kalenuik",
        "Description": "",
        "Category": "",
        "Publisher": "Magnanimity",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Garden Birds: How To Attract Birds To Your Garden",
        "Authors": "By Proctor, Noble S., Walker, Cyril Alexander (EDT), and Parmenter, Tim (EDT)",
        "Description": "* Features 100 of the most popular American garden birds* Expert advice on how to make your garden more attractive to birds* Useful tips for backyard bird watchers-- each bird's favorite foods, nesting habits, and distinctive markings* Gorgeous illustrations bring each bird to life",
        "Category": " Gardening , General",
        "Publisher": "Rodale Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "World Atlas",
        "Authors": "By Rand McNally and Company",
        "Description": "A good basic atlas, subject, of course, to the obsolescence wrought by recent rapid changes in national boundaries. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": "",
        "Publisher": "Rand McNally & Company",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1991"
        }
    },
    {
        "Title": "Lives of the Artists (Classics)",
        "Authors": "By Vasari, Giorgio",
        "Description": "",
        "Category": "",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Everything Einstein Book (Everything Series)",
        "Authors": "By Priwer, Shana and Phillips, Cynthia, Ph.D.",
        "Description": "",
        "Category": " Science , Physics , Relativity",
        "Publisher": "Everything",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Worthy is the Child",
        "Authors": "By Polzin, Richard A.",
        "Description": "",
        "Category": "",
        "Publisher": "Nite Lite Stories",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The Kingfisher Illustrated Junior Dictionary",
        "Authors": "By Tuck, Allene (EDT), Crossley, Heather (EDT), Soukhanov, Anne H. (EDT), Grisewood, John (EDT), and Stock, Penny (EDT)",
        "Description": "Perfect for the child who is ready to move beyond an introductory dictionary, The Kingfisher Illustrated Junior Dictionary provides the necessary pedagogical support for the upper elementary and middle-school child. Comprehensive and authoritative, it defines over 4,000 words with clear, age-appropriate entries. Plenty of sample sentences offer further clarification, as do the easy-to-use pronunciation guides for difficult words.  More than 600 bright photographs and illustrations contribute extra vocabulary information and make this dictionary a visual treasure trove.  Illustrations expand and compliment textual information.  Full-color, high-interest topic boxes provide an in-depth look at selected subjects and related vocabulary.  Color-coded guide words and alphabet strings make words easy to look up..  Vocabulary panels discuss word-usage.  Definitions clearly identify parts of speech, different word forms, and alternate spellings.  Includes information about homonyms and antonyms and key language topics.",
        "Category": " Juvenile Nonfiction , Reference , Dictionaries",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Nursing, the Finest Art: An Illustrated History",
        "Authors": "By Donahue, M. Patricia",
        "Description": "In the tradition of the best art books, Nursing: The Finest Art An Illustrated History, second edition, portrays the profession of nursing using some of the world's most beautiful paintings , objects of art, and photographs.This inspiring volume traces the social, political, and economic history of nursing from its origins through contemporary practice, providing the definitive chronicle of the nursing profession as it has evolved through the ages. Written by one of the foremost authorities on the history of nursing, this thoroughly updated and expanded edition highlights nurses' involvement in recent events throughout the world as well as developments in international nursing.",
        "Category": " Medical , Nursing , General",
        "Publisher": "Mosby",
        "Price Starting With ($)": "8.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Great American Quilts 1993",
        "Authors": "By O'Brien, Sandra L. (EDT)",
        "Description": "",
        "Category": " Crafts & Hobbies , Quilts & Quilting",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1993"
        }
    },
    {
        "Title": "Raggedy Ann & Andy's Grow-And-Learn Library: Raggedy Dog Learns To Share (14)",
        "Authors": "By unknown",
        "Description": "",
        "Category": "",
        "Publisher": "Macmillan, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Surrender the Stars (Raveneau Family, Book 2)",
        "Authors": "By Wright, Cynthia Challed",
        "Description": "Ryan Coleraine, adventurer and spy, and Lindsey Raveneau, a proper English schoolmistress hiding a passionate soul, forge a love that nothing can alter--even Ryan's masquerade as Lindsey's brother to help the American cause",
        "Category": " Fiction , Romance , General",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Please Love Me",
        "Authors": "By Keith Miller",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1979"
        }
    },
    {
        "Title": "The Writing System",
        "Authors": "By Daniel O. Graham, Judith H. Graham",
        "Description": "",
        "Category": "",
        "Publisher": "Preview Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2002"
        }
    },
    {
        "Title": "Kingfisher Knowledge: Forensics",
        "Authors": "By Platt, Richard and Reichs, Kathy (FRW)",
        "Description": "Explore the crime lab with Forensics and discover how detectives use science to solve crimes. From the scene of the crime to a criminal's conviction, discover how the marks of blood, footprints, and fingerprints can lead the police to criminals. Find out how specialists can match trace evidence, such as a single hair found on a victim, to the murderer. Learn how famous crimes were solved and,like a true detective, find out whether it was arson, poison,or murder.From the scene of the crime to a criminal's conviction, the reader is invited into the crime lab to learn how detectives use forensics--such as blood, footprints, and fingerprints--to catch perpetrators and solve crimes.",
        "Category": " Juvenile Nonfiction , Law & Crime",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Earth Movers",
        "Authors": "By Thrasher, Barbara and Thatcher, Barbara",
        "Description": "",
        "Category": " Science , General",
        "Publisher": "Crescent",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "The Trouser People: A Story of Burma in the Shadow of the Empire",
        "Authors": "By Marshall, Andrew",
        "Description": "Andrew Marshall has written an unforgettable adventure story, the wry account of two journeys into the untraveled heart of Burma. Part travelogue, part history, part reportage, The Trouser People recounts the story of George Scott, the eccentric British explorer, photographer, adventurer, and later Colonial Administrator of Burma, who introduced the Empire's best game (soccer!) to Burmese natives and to the forbidden Wa state of headhunters, who were similarly enthusiastic about it. The second, contrasting journey is Marshall's own, taking the same dangerous path one hundred years later in a country now devastated by colonial incompetence, war, and totalitarianism. Wonderfully observed, mordantly funny, and skillfully recounted, this is journalistic travel writing at its best.",
        "Category": " History , Asia , General",
        "Publisher": "Counterpoint",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Short friday and Other Stories",
        "Authors": "By Isaac Singer",
        "Description": "",
        "Category": "",
        "Publisher": "Farrar Straus and Co",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1965"
        }
    },
    {
        "Title": "Schroeders Antiques Price Guide",
        "Authors": "By Huxford, Sharon (EDT) and Huxford, Bob (EDT)",
        "Description": "No other book on the market houses as much information for a bargain price. Once again over 50,000 listings from reliable sources are included and carefully checked by an authority on the subject. More than 400 expert advisors make sure only the best and most accurate data remains. Hundreds of sharp photographs accompany the 500+ categories: glass and porcelain, match holders, purses, cookie jars, jewelry, advertising, furniture, dolls, records and more. History and other pertinent facts complement the descriptive listings, which reflect the current market and developing trends.",
        "Category": " Antiques & Collectibles , General",
        "Publisher": "Collector Books",
        "Price Starting With ($)": "7.08",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "The First Ships Round the World (Cambridge Introduction to World History)",
        "Authors": "By Brownlee, Walter D.",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Cambridge University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1974"
        }
    },
    {
        "Title": "Transformers: The Movie Storybook",
        "Authors": "By Egan, Kate (ADP) and Matere, Marcelo (ILT)",
        "Description": "When Sam learns that Transformers are descending upon Earth in search of the Allspark, he knows he must help save the human race from complete destruction. It will take the force of the United States government, a team of code-cracking scientists, and the help of the Autobots to stop the evil Decepticons.Will they get to the Allspark in time, or will the Decepticons take overthe world?Relive the excitement of the big screen adventure with this storybook!",
        "Category": " Juvenile Fiction , Toys, Dolls & Puppets",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Listening Is an Act of Love: A Celebration of American Life from the StoryCorps Project (Penguin Books for English: Developmental)",
        "Authors": "By Isay, Dave (EDT) and Isay, Dave (INT)",
        "Description": "A New York Times bestseller!As heard on NPR, a wondrous nationwide celebration of our shared humanity StoryCorps founder and legendary radio producer Dave Isay selects the most memorable stories from StoryCorps' collection, creating a moving portrait of American life. The voices here connect us to real people and their lives--to their experiences of profound joy, sadness, courage, and despair, to good times and hard times, to good deeds and misdeeds. To read this book is to be reminded of how rich and varied the American storybook truly is, how resistant to easy categorization or stereotype. We are our history, individually and collectively, and Listening Is an Act of Love touchingly reminds us of this powerful truth.Dave Isay's newest book, Callings, is now available from Penguin Press.",
        "Category": " Social Science , Customs & Traditions",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Journal of Love & Healing (Journals)",
        "Authors": "By Browne, Sylvia and Dufresne, Nancy",
        "Description": "This journal is for those who love deeply. It will encompass your letters, phone calls, and communications with those who have gone Home. It is your refuge, your friend, and your tribute. Fill the journal pages with what you need to say, share, and remember.",
        "Category": " Body, Mind & Spirit , New Thought",
        "Publisher": "Hay House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "pat the bunny Alphabet Book (Picture Book)",
        "Authors": "By Golden Books",
        "Description": "The little white bunny who introduced babies and toddlers to the wondrous world of touch and feel over 60 years ago now helps them discover their ABCs!This sweet, padded board book features “fuzzy” flocking on the final spread so young children can touch and feel all the letters of the alphabet!",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Go Big or Go Home",
        "Authors": "By Hobbs, Will",
        "Description": "A meteorite is hurtling toward the Black Hills of South Dakota. . . . Brady Steele's love for all things extreme is given a boost when a fireball crashes through the roof of his house. It turns out that Brady's space rock is one of the rarest meteorites ever found. In fact, a professor from a nearby museum wants to study it in search of extraterrestrial bacteria, hoping to discover the first proof of life beyond Earth.During a wild week of extreme bicycling, fishing, and caving, Brady discovers he's able to do strange and wonderful feats that shouldn't be possible. At the same time, he's developing some frightening symptoms. Could he be infected with long-dormant microbes from space? Is his meteorite a prize . . . or a menace?",
        "Category": " Juvenile Fiction , Science Fiction",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "Dragon of the Red Dawn (Magic Tree House (R) Merlin Mission)",
        "Authors": "By Murdocca, Sal (ILT) and Osborne, Mary Pope",
        "Description": "The #1   bestselling chapter book series of all time celebrates 25 years with new   covers and a new, easy-to-use numbering system! Jack and Annie are headed to a land of fierce samurai and great beauty, the   capital city of Edo (now the city of Tokyo), in ancient Japan in the 1600s.   They bring only a research book to guide them and a magic wand with three   special rules.Formerly numbered as Magic Tree House #37, the title of this book is now Magic Tree House Merlin Mission #9: Dragon of the Red Dawn. Did you know that there’s a Magic Tree House book for every kid? Magic Tree House: Adventures with Jack and Annie, perfect for readers who   are just beginning chapter books Merlin Missions: More challenging adventures for the   experienced reader Super Edition: A longer and more dangerous adventure Fact Trackers: Nonfiction companions to your favorite Magic Tree House   adventures Have more fun with Jack and Annie at MagicTreeHouse.com!",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "This living earth",
        "Authors": "By Cavagnaro, David",
        "Description": "",
        "Category": "",
        "Publisher": "American West Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "Giant Book of Card Tricks",
        "Authors": "By Longe, Bob",
        "Description": "With a little sleight of hand and the secrets behind hundreds of card tricks, you'll amaze, amuse, and astonish your friends every time. Become an expert at \"sneaking a peek\" at a card without anyone noticing. Practice doing slippery shuffles, cuts, and hand movements that fool an audience and really make a magical show. Win over the crowd with a professional's inventive stage patter and witty wisecracks.Choose from these cool tricks:* \"Colorful\" and \"Presto\" Predictions.* Transpose cards with the \"Tick Tock Trick,\" \"Easy Aces,\" and \"One in Four.\"* Using \"Easy Estimation,\" figure out how many cards a spectator picked from the deck.Plus: \"The Rare Reverse,\" \"My Favorite Card,\" the \"Impossible Poker Deal,\" and several hundred more.",
        "Category": " Games , Card Games , General",
        "Publisher": "Main Street",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Algebra Vol 1",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "JRL Enterprises, Inc.",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    }
]