[
    {
        "Title": "Wise Words and Quotes",
        "Authors": "By McLellan, Vernon K. (EDT)",
        "Description": "Many great things have been said since the beginning of time. Many are wise, many are funny, and some are both. Wise Words and Quotes presents classic sayings that encourage, inspire, and entertain.",
        "Category": " Reference , Quotations",
        "Publisher": "Tyndale House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Doubleday Christmas Treasury",
        "Authors": "By Olliver, Jane (COM)",
        "Description": "A celebration of the Christmas holidays features a collection of stories, poems, songs, carols, traditions, and customs from around the world",
        "Category": " Juvenile Nonfiction , General",
        "Publisher": "Doubleday Books for Young Readers",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Guide to Washington Cathedral",
        "Authors": "By Nancy S. Montgomery",
        "Description": "",
        "Category": "",
        "Publisher": "National Cathedral Association",
        "Price Starting With ($)": "6.75",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Caribbean: A Picture Book To Remember Her By",
        "Authors": "By Gibbon",
        "Description": "",
        "Category": "",
        "Publisher": "Crescent",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1987"
        }
    },
    {
        "Title": "Adventure Vacations in 5 Mid-Atlantic States",
        "Authors": "By Mulford, Carolyn and Ford, Betty C.",
        "Description": "",
        "Category": "",
        "Publisher": "Epm Pubns Inc",
        "Price Starting With ($)": "5.91",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "A Walker's Guide to Harpers Ferry, West Virginia",
        "Authors": "By Gilbert, Dave",
        "Description": "",
        "Category": " Sports & Recreation , Walking",
        "Publisher": "Appalachian Trail Conference",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "The Change-Your-Life Quote Book",
        "Authors": "By Allen Klein",
        "Description": "",
        "Category": "",
        "Publisher": "Portland House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "What Now?: Words of Wisdom for Life After Graduation",
        "Authors": "By Jennifer Leigh Selig",
        "Description": "",
        "Category": "",
        "Publisher": "MJF Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Teachers Jokes Quotes And Anecdotes",
        "Authors": "By Regan, Patrick (EDT)",
        "Description": "Teachers are some of the most beloved people in the world. That's only one of the reasons why it's so easy to make fun of them. The witty, amusing, and heartwarming tidbits collected here will charm educators and their fans alike. For instance, when asked to give definitions of clouds, a classroom of elementary students provided such definitions as \"Rain is saved up in cloud banks,\" \"Clouds are high-flying fogs.\" This book is a natural gift for your children's favorite teachers.",
        "Category": " Humor , Form , Jokes & Riddles",
        "Publisher": "Andrews McMeel Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Yo, Millard Fillmore!",
        "Authors": "By Cleveland, Will, Alvarez, Mark",
        "Description": "",
        "Category": "",
        "Publisher": "Goodwood Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Walks in the Great Smokies",
        "Authors": "By Rodney Albrigh, Priscilla Albright",
        "Description": "",
        "Category": "",
        "Publisher": "Fast & McMillan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Seven Songs of Merlin (DIGEST) (Lost Years Of Merlin)",
        "Authors": "By Barron, T. A.",
        "Description": "To save his ailing mother, Merlin must master the Seven Songs of Wisdom passed down from his grandfather, a legendary wizard.  \"Young sorcery fans...set aside Harry Potter and pick up Merlin.\" (Cincinnati Enquirer)",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "The Trouble with Jesus",
        "Authors": "By Stowell, Joseph M.",
        "Description": "Our pluralistic society accepts all... all except Jesus. Joseph Stowell  brings to light our need to be undaunted advocates for Jesus in a world that has  no tolerance for Him or His followers. How do you reach those who do not have a  churched background, or are openly hostile to the good news of Jesus Christ? Would  you miss church to go fishing with your colleague at work? What should or would  you do when golfing with three non-believing friends, and they want to play for  'prize money'? Joseph Stowell's style is biblical and insightful, but always within  reach of today's reader.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Moody Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Politika (Tom Clancy's Power Plays, Book 1)",
        "Authors": "By Clancy, Tom and Greenberg, Martin Harry",
        "Description": "It is 1999.     The sudden death of Russia's president has thrown the Russian Federation into chaos. Devastating crop failures have left millions in the grip of famine, and an uprising seems inevitable.    One of Russia's provisional leaders asks the American president for help. But the whole world is watching when a deadly terrorist attack stuns the United States and evidence points to the Russian government.    Amidst the turmoil in Russia, American businessman Roger Gordian finds his multinational corporation and its employees in jeopardy. Determined to find those responsible for the attack, he calls upon his crisis control team to interven. But Gordian doesn't realize how far the terrorists will go and how much he has to lose...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1997"
        }
    },
    {
        "Title": "Two Little Girls in Blue: A Novel",
        "Authors": "By Clark, Mary Higgins",
        "Description": "In a riveting new thriller, worldwide bestselling suspense writer Mary Higgins Clark weaves the mystery of twin telepathy into a mother's search for a kidnapped child, presumed dead.Margaret and Steve Frawley celebrate the third birthday of their twin girls, Kelly and Kathy, with an afternoon party in their new home, a modest fixer-upper in Ridgefield, Connecticut.  The evening of the twins' birthday party, Steve and Margaret attend a black-tie dinner in New York. When they return home, the police are in the house, and they are told that the babysitter had been found unconscious, the children are gone, and a note demanding an eight-million-dollar ransom had been left in their room.  Steve Frawley's firm, a global investment company, agrees to pay the ransom. The kidnapper, who identifies himself as the \"Pied Piper,\" makes his terms known -- on delivery of the ransom, a call will come, revealing the girls' whereabouts. The call comes, but only Kelly is in the car parked behind a deserted restaurant. The driver is dead from a gunshot wound and has left a suicide note, saying he had inadvertently killed Kathy and had dumped her body in the ocean.  At the private memorial Mass for Kathy, Kelly tugs Margaret's arm and says: \"Mommy, Kathy is very scared of that lady. She wants to come home right now.\" More unexplainable occurrences follow, indicating that Kelly is in touch with Kathy. At first, no one except the mother believes that the twins are communicating and that Kathy is still alive. As Kelly's warnings become increasingly specific and alarming, however, FBI agents set out on a search for Kathy. The novel reaches a breathtaking climax as they close in on the Pied Piper and his accomplices, while Kathy's life hangs by a thread.  In delving into the well-documented but still unexplained phenomenon of twin telepathy, Mary Higgins Clark tells a spellbinding tale that takes us deep into the minds of her characters while lifting us to the heights of suspense.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "The Innocent: A Suspense Thriller",
        "Authors": "By Coben, Harlan",
        "Description": "SOON TO BE A NETFLIX ORIGINAL SERIES!#1 New York Times bestselling author Harlan Coben takes readers on an electrifying ride in this thriller that peeks behind the white picket fences of suburbia—where one mistake can change your life forever.One night, Matt Hunter innocently tried to break up a fight—and ended up a killer. Now, nine years later, he’s an ex-con who takes nothing for granted. His wife, Olivia, is pregnant, and the two of them are closing on their dream house. But all it will take is one shocking, inexplicable call from Olivia’s cell phone to shatter Matt’s life a second time...",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Dutton",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Redliners",
        "Authors": "By Drake, David",
        "Description": "Burned out by their horrific wartime experiences but too dangerous to themselves and others to be returned to civilian life, Major Arthur Farrell and Strike Force Company C41 is assigned to guard a colony being sent to a hell planet, but their mission goes horribly wrong.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Baen",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "How to Be the Almost Perfect Husband: By Wives Who Know",
        "Authors": "By Salt, J. S.",
        "Description": "",
        "Category": " Family & Relationships , Love & Romance",
        "Publisher": "Shake It!",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "I Love Being a Mom: Treasured Stories, Memories and Milestones",
        "Authors": "By Borchard, Therese Johnson (EDT)",
        "Description": "Therese J. Borchard, the coeditor of I Like Being [insert trademark] Married, returns with another enchanting exploration of the love, laughter, tears, and uncertainties that bind one human being to another. Including more than 100 photographs of famous (and not-so-famous) moms and their children and drawings, I Love Being a Mom is about the common bonds all mothers share and the intimate experiences that make each mother-child relationship unique. In stories, recollections, and witty observations from Sarah Jessica Parker and Katie Couric to Barbara Bush, mothers of all stripes describe how their lives were forever changed by the arrival of a child. They recount the ecstasy and exhaustion of the early days of parenthood, the miracles and milestones that mark a child’s--and a mother’s—growth, and the lessons in life that are part of being a mother. Louise Erdrich writes about childbirth, the quintessential “labor of love”; Cokie Roberts, about balancing life at home and the office; Alex Witchell, about the trials and joys of being a stepmother; and Barbara Bush, about the death of her little girl. Contributions from Alice Walker, Marie Osmond, Debra Winger, Shirley Maclaine, Hillary Rodham Clinton, and other well-known women, and from moms across America, illuminate the myriad ways mothers nurture, protect, and celebrate their children, and illustrate why each writer loves being a mom. Top-ten lists highlight the best movies, novels, songs, and TV sitcoms about mothers and provide an entertaining, sometimes surprising look at our culture’s assumptions, perceptions, and ideals.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2004"
        }
    },
    {
        "Title": "Motherly Devotion: Memories and Expressions of Endearment from the Past (Sweet Nellie)",
        "Authors": "By Ross, Pat (EDT)",
        "Description": "A collection of poems, songs, letters, diary entries, proverbs, and illustrations dedicated to mothers and maternal devotion",
        "Category": " Reference , General",
        "Publisher": "Avery",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1990"
        }
    },
    {
        "Title": "The Prince (Bantam Classics)",
        "Authors": "By Machiavelli, Niccolo",
        "Description": "Here is the world's most famous master plan for seizing and holding power.  Astonishing in its candor The Prince even today remains a disturbingly realistic and prophetic work on what it takes to be a prince . . . a king . . . a president.  When, in 1512, Machiavelli was removed from his post in his beloved Florence, he resolved to set down a treatise on leadership that was practical, not idealistic.  In The Prince he envisioned would be unencumbered by ordinary ethical and moral values; his prince would be man and beast, fox and lion.  Today, this small sixteenth-century masterpiece has become essential reading for every student of government, and is the ultimate book on power politics.",
        "Category": "",
        "Publisher": "Bantam Classics",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1984"
        }
    },
    {
        "Title": "Gods & Goddesses of Classical Mythology",
        "Authors": "By Crompton, Samuel W",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "America by the Numbers: Facts and Figures from the Weighty to the Way-Out",
        "Authors": "By Krantz, Les",
        "Description": "A compendium of facts about the United States and its citizens includes such facts as the most likely way to find a date, the ten rarest mammals in America, the most popular activities in the bedroom, and the most popular color for cars. Original. 30,000 first printing.",
        "Category": " History , United States , General",
        "Publisher": "Houghton Mifflin Harcourt",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "The Hat",
        "Authors": "By Brett, Jan",
        "Description": "A Publishers Weekly #1 bestseller, Jan Brett's heartwarming story of Hedgie the hedgehog's misadventures in the snow has become a family favorite. When Lisa's woolen stocking flies off the closeline, Hedgie can't resist poking his nose in. He tries to pull it out, but the stocking is stuck on his prickles. At first the other animals laugh at the sight of him, but when they realize they might like something to keep their heads dry and ears warm, too, even more silliness ensues.Like its companion The Mitten, The Hat is now available as a wonderful board book to share with young children. \"Brett's signature art introduces animal characters as endearing and expressive as those who congregated in her earlier book's expandable white mitten.\" 'Publishers Weekly\"A clever and appealing picture book. . . . The pictures, story, and subject matter make this a natural for sharing aloud.\" 'School Library Journal",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "G.P. Putnam's Sons Books for Young Readers",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "October",
            "Year": "1999"
        }
    },
    {
        "Title": "Math Review For Standardized Tests (Cliffs Test Prep)",
        "Authors": "By Bobrow, Jerry, Orton, Peter Z., Shiflett, Ray, and Clapp, Michael",
        "Description": "The CliffsTestPrep series offers full-length practice exams that simulate the real tests; proven test-taking strategies to increase your chances at doing well; and thorough review exercises to help fill in any knowledge gaps.Math Review for Standardized Tests is for anyone who is planning to take the *SAT, ACT, GRE, GMAT, *PSAT, CBEST, NTE, or any other standardized test. You get a fighting chance at success by focusing squarely on a test-oriented math review. Each review section includes:A diagnostic test to spot areas that need special attentionRules and concepts with examplesPractice problemsComplete (and understandable) explanationsA review testIf your math skills are shaky, this guide will refresh your memory by reintroducing mathematical rules and concepts you've learned but since forgotten. Glossaries assist your understanding of math terms used in the problems and explanations. Math Review for Standardized Tests covers these areas of math:Arithmetic, including rounding off, positives and negatives, fractions, decimals, percentages, scientific notation, exponents, square roots, statistics, measuresAlgebra, including sets, variables, expressions, ratios, factoring, proportions, monomials, polynomials, quadratic equations, inequalities, roots and radicals.Geometry, including angles, lines, polygons, triangles, Pythagorean Theorem, quadrilaterals, circles, congruence and similarity, and solid figuresWord problems, including simple and compound interest, ratio and proportion, motion, percentages, ages, geometry, mixturesWith guidance from the CliffsTestPrep series, you'll feel at home in any standardized-test environment!*SAT and PSAT are registered trademarks of the College Board, which was not involved in the production of, and does not endorse this product.",
        "Category": " Study Aids , Tests (Other)",
        "Publisher": "Cliffs Notes",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1985"
        }
    },
    {
        "Title": "The Exquisite Life of Oscar Wilde",
        "Authors": "By Calloway, Stephen and Colvin, David",
        "Description": "",
        "Category": " Literary Criticism , European , English, Irish, Scottish, Welsh",
        "Publisher": "Welcome Rain",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Dog Tales: Classic Stories About Smart Dogs",
        "Authors": "By Beck, Myron (PHT)",
        "Description": "Nine tales from well-known authors feature all-too-human dogs of every class and disposition, from Eric Knight's heroic Lassie to James Thurber's determinedly vicious Muggs",
        "Category": " Fiction , General",
        "Publisher": "Studio",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Anything We Love Can Be Saved: A Writer's Activism",
        "Authors": "By Walker, Alice",
        "Description": "The author of The Color Purple offers a series of provocative reflections on her life, contemporary politics, and culture, from the Million Man March and civil rights to the trials of raising daughters. 40,000 first printing.",
        "Category": " Literary Collections , Essays",
        "Publisher": "Random House",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1997"
        }
    },
    {
        "Title": "Hershel and the Hanukkah Goblins",
        "Authors": "By Kimmel, Eric A. and Hyman, Trina Schart (ILT)",
        "Description": "On the first night of Hanukkah, a weary traveler named Hershel of Ostropol eagerly approaches a village, where plenty of latkes and merriment should warm him. But when he arrives not a single candle is lit. A band of frightful goblins has taken over the synagogue, and the villagers cannot celebrate at all! Hershel vows to help them. But can one man alone stand up to the goblins, save Hanukkah, and live to tell the tale? The 25th anniversary edition of this Caldecott Honor-winning classic includes an insightful afterword from the author and publisher explaining the book's origins and remembering Trina Schart Hyman, the illustrator who brought the tale to life.",
        "Category": " Juvenile Fiction , Fairy Tales & Folklore , Anthologies",
        "Publisher": "Holiday House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Four Special Questions: A Passover Story (Festival Time)",
        "Authors": "By Cohen, Jan Barger (ILT), Zucker, Jonny, and Cohen, Jan Barger",
        "Description": "A mother, father, and three young children in a typical Jewish family celebrate their most important holidays in the attractively illustrated Festival Time books, which speak not only to Jewish children but to boys and girls of all faiths.  This simple and delightful introduction to the Jewish holiday of Passover describes a family as they celebrate their festival of freedom. They prepare the six different types of food on the Seder plate, ask the four traditional questions, and hunt for the Afikoman. (Ages 3-7)",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Passover",
        "Publisher": "B.E.S. Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Kingfisher Book of Children's Poetry",
        "Authors": "By Rosen, Michael and Englaner, Alice (ILT)",
        "Description": "In The Kingfisher Book of Children's Poetry, Michael Rosen encourages children to see poetry as lively and entertaining. To this end he has included ballads, limericks, riddles, and nonsense verse, as well as a wide variety of poetry old and new, and from near and far.",
        "Category": " Juvenile Nonfiction , Poetry , General",
        "Publisher": "Kingfisher",
        "Price Starting With ($)": "5.64",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "You Know Me Al (Dover Thrift Editions)",
        "Authors": "By Lardner, Ring",
        "Description": "In the early decades of the twentieth century, newspaperman and humorist Ring Lardner (1885–1933) made America laugh with his hilarious depictions of odd characters in the sporting world, Tin Pan Alley, and Hollywood. His first great success was You Know Me Al, a fictional series of letters from a popular baseball hero to his friend, slyly revealing the letter writer as a crude, conceited, semiliterate, self-deceiving boob.The letters, created while Lardner was writing a sports column for The Chicago Tribune, first appeared in The Saturday Evening Post and were later published in book form in 1918. You Know Me Al reveals Lardner as a satirical master at the peak of his form: a fine albeit misanthropic storyteller with a superb feel for the niceties of characters and speech and a sure instinct for provoking laughter.",
        "Category": " Fiction , Sports",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2016"
        }
    },
    {
        "Title": "Sylvester and the Magic Pebble",
        "Authors": "By Steig, William",
        "Description": "On a rainy day, Sylvester finds a magic pebble that can make wishes come true. But when a lion frightens him on his way home, Sylvester makes a wish that brings unexpected results. How Sylvester is eventually reunited with his loving family and restored to his true self makes a story that is beautifully tender and filled with magic. Illustrated with William Steig's glowing pictures, this is a modern classic beloved by children everywhere. Selected as one of the 100 Best Books of the Century by the National Education Association.",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Aladdin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Spider Woman Stories: Legends of the Hopi Indians",
        "Authors": "By Mullett, G. M.",
        "Description": "\"This is a fine introduction to Hopi mythology and values. It recreates an authentic poetic spirit and makes the reader eager to read more Hopi tales.\" —New Mexico Humanities Review",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "University of Arizona Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Koala Lou",
        "Authors": "By Fox, Mem and Lofts, Pamela (ILT)",
        "Description": "When Koala Lou’s mother becomes so busy that she forgets to tell her firstborn how much she loves her, Koala Lou enters the Bush Olympics, intending to win an event and her mother’s love all at one time. “A first-rate choice for bedtime, story hour, or reading aloud.”--The Horn Book",
        "Category": " Juvenile Fiction , Family , Parents",
        "Publisher": "The Trumpet Club",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Encyclopedia of Native American Religions",
        "Authors": "By Hirschfelder, Arlene B. and Molin, Paulette",
        "Description": "",
        "Category": "",
        "Publisher": "Fine Communications",
        "Price Starting With ($)": "7.98",
        "Publish Date": {
            "Month": "July",
            "Year": "1997"
        }
    },
    {
        "Title": "Native Americans: Enduring Culture and Traditions",
        "Authors": "By Griffin-Pierce, Trudy",
        "Description": "",
        "Category": " History , General",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1899"
        }
    },
    {
        "Title": "The Littlest Christmas Tree: A Tale of Growing and Becoming",
        "Authors": "By Jasin, Janie and Kurtz, Pam (ILT)",
        "Description": "For the smallest seedling on the tree farm, waiting and growing seem to take an eternity. As the seasons pass, the seedling observes the gifts that nature brings her - the sky, the wind, the birds and animals, and the sun and rain that help her grow. She dreams about the things she could become and gradually realizes that becoming a Christmas tree is only one of the many options life presents.",
        "Category": " Juvenile Fiction , Social Themes , Emotions & Feelings",
        "Publisher": "Book Peddlers, The",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Raven: A Trickster Tale from the Pacific Northwest",
        "Authors": "By McDermott, Gerald",
        "Description": "Raven, the trickster, wants to give people the gift of light. But can he find out where Sky Chief keeps it? And if he does, will he be able to escape without being discovered? His dream seems impossible, but if anyone can find a way to bring light to the world, wise and clever Raven can!",
        "Category": " Juvenile Fiction , Animals , General",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Divided Union: The Story of the Great American War, 1861-65",
        "Authors": "By Batty, Peter and Parish, Peter J.",
        "Description": "Offers a fresh look at the Civil War, discusses the social, economic, and political aspects of the war, and assesses its influences in modern America",
        "Category": " Young Adult Nonfiction , General",
        "Publisher": "Salem House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "It's a Family Thanksgiving! (Think about It!)",
        "Authors": "By Fink, Deborah F. and Kreiswirth, Kinny (ILT)",
        "Description": "Provides background information on the origins and development of Thanksgiving and the foods and activities associated with it, suggests things to do to understand the holiday better, and offers ideas for families to share.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Thanksgiving",
        "Publisher": "Harmony Hearth, LLC",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "September",
            "Year": "2009"
        }
    },
    {
        "Title": "The Causes of the Civil War: Revised Edition (Touchstone S)",
        "Authors": "By Stampp, Kenneth Milton (EDT)",
        "Description": "Gathers original sources, including newspaper editorials, speeches, and documents, and shares comments by historians on the period",
        "Category": " History , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Williams-Sonoma's Celebrating the Pleasures of Cooking: Chuck Williams Commemorates 40 Years of Cooking in America",
        "Authors": "By Williams, Chuck and Kolpas, Norman",
        "Description": "In Celebrating the Pleasures of Cooking, Chuck Williams warmly shares 150 of the best recipes he has adapted or developed as both keen observer and driving force in American food. Divided into chapters by decade and illustrated with 40 full-color photographs, the recipes form a singular chronicle of our cooking and eating habits, including our first forays into classic French cuisine in the late 1950s, our late discovery of French provincial cooking, our growing interest in the Mediterranean kitchen, and our present-day affinity for the simpler culinary pleasures.Chuck Williams complements his recipes with insightful, warmhearted anecdotes and observations. Woven throughout the decades are personal recollections and favorite quotes from the works of such culinary greats as James Beard, Julia Child, Elizabeth David and Marcella Hazan.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Yucatan Before and After the Conquest (Native American)",
        "Authors": "By Landa, Diego de",
        "Description": "These people also used certain characters or letters, with which they wrote in their books about the antiquities and their sciences. We found a great number of books in these letters and since they contained nothing but superstitions and falsehoods of the devil we burned them all, which they took most grievously, and which gave them great pain.So writes Friar Diego de Landa in his Relación De las cosas de Yucatan of 1566, the basic book in Maya studies. Landa did all he could to wipe out Maya culture and civilization. In the famous auto da fé of July 1562 at Maní, as he tells us, he destroyed 5,000 \"idols\" and burned 27 hieroglyphic rolls. And yet paradoxically Landa's book, written in Spain to defend himself against charges of despotic mismanagement, is the only significant account of Yucatan done in the early post-Conquest era. As the distinguished Maya scholar William Gates states in his introduction, \"ninety-nine percent of what we today know of the Mayas, we know as the result either of what Landa has told us in the pages that follow, or have learned in the use and study of what he told.\" Yucatan Before and After the Conquest is the first English translation of this very important work.Landa's book gives us a full account of Maya customs, daily activities, history, ceremonial festivals, and the many social and communal functions in which their life was expressed. Included here are the geography and natural history of Yucatan, the history of the Conquest, indigenous architecture and other aspects of Maya civilization (sciences, books, religion, etc.), native historical traditions, the Inquisition instituted by the Spanish clergy, Maya clothing, food, commerce, agriculture, human sacrifices, calendrical lore, and much more.",
        "Category": " History , Latin America , Mexico",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2012"
        }
    },
    {
        "Title": "Encyclopedia of American architecture",
        "Authors": "By Hunt, William Dudley",
        "Description": "",
        "Category": "",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "8.93",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "If You'll Be My Valentine",
        "Authors": "By Rylant, Cynthia and Kosaka, Fumi (ILT)",
        "Description": "IF YOU'LL BE MY VALENTINE Cynthia Rylant and Fumi Kosaka If You'll Be My Valentine sweetly celebrates the true meaning of Valentine's Day.  Charming prose and captivatingly sweet art create an adorable tableau of loving wishes from one little boy to all the members of his family.",
        "Category": " Juvenile Fiction , Holidays & Celebrations , Valentine's Day",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2005"
        }
    },
    {
        "Title": "Secret Missions of the Civil War",
        "Authors": "By Philip Van Doren Stern",
        "Description": "",
        "Category": "",
        "Publisher": "Portland House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Illustrated Atlas of The Civil War (Echoes of Glory)",
        "Authors": "By Time-Life Books Editors",
        "Description": "",
        "Category": "",
        "Publisher": "Time-life Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Panati's Extraordinary Origins of Everyday Things",
        "Authors": "By Panati, Charles",
        "Description": "For lovers of facts, students of popular culture, history buffs, and science enthusiasts, the fascinating stories behind 500 everyday items, expressions, and customs--from Kleenex to steak sauce, Barbie Dolls to honeymoons.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Father Knew Best: Wit and Wisdom from the Dads of Celebrities",
        "Authors": "By Hornfischer, David and Hornfischer, Elsa",
        "Description": "Father Knew Best, a book that evokes deep rooted family values, features quatations and anecdotes that cover seven basic virtues: Ambition, Courage, Devotion, Faith, Perspective, Responsibility, and Self discipline. We hear the voices of John Wayne's father (\"Mind you, don't go looking for fights, but if you find yourself in one, make damn sure you win\"). Oprah Winfrey's (\"Be home by midnight, or, by God, sleep on the porch\"), and Mickey Mantle's (\"Practice, practice, practice. Your belly can wait\"), as well as the fathers of Jackie Onassis, Katharine Hepburn, Arthur Ashe, Wolfgang Amedeus Mozart, Paul McCartney, Emily Dickinson, and scores of other timeless stars, heroes, and heroines.",
        "Category": " Social Science , Sociology , Marriage & Family",
        "Publisher": "Plume",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Rembrandt's Ghost (A Finn Ryan Novel)",
        "Authors": "By Christopher, Paul",
        "Description": "From the USA Today bestselling author of The Lucifer Gospel  There is truth in art. But the truth can kill.  Young archaeologist Finn Ryan is laboring for a London auction house when she gets some unlikely luck.  Along with the handsome young nobleman Billy Pilgrim, she's inherited a house in Amsterdam, a cargo ship off Borneo South Pacific, and what appears to be a fake Rembrandt.  But the fake hides a real Rembrandt portrait, which in turn hides a clue to a centuries-old mystery. Finn and Billy aren't the only ones who know what is at stake-and what is waiting to be found at the bottom of the South Pacific. Pursued around the globe by ruthless adversaries, Finn and Billy are thrown into the hunt for a forgotten treasure that could change their lives forever-or end their lives in an instant.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "War of the Rats: A Novel",
        "Authors": "By Robbins, David L.",
        "Description": "For six months in 1942, Stalingrad is the center of a titanic struggle between the Russian and German armies—the bloodiest campaign in mankind's long history of warfare.  The outcome is pivotal.  If Hitler's forces are not stopped, Russia will fall.  And with it, the world....German soldiers call the battle Rattenkrieg, War of the Rats.  The combat is horrific, as soldiers die in the smoking cellars and trenches of a ruined city.  Through this twisted carnage stalk two men—one Russian, one German—each the top sniper in his respective army. These two marksmen are equally matched in both skill and tenacity. Each man has his own mission:  to find his counterpart—and kill him. But an American woman trapped in Russia complicates this extraordinary duel.  Joining the Russian sniper's cadre, she soon becomes one of his most talented assassins—and perhaps his greatest weakness.  Based on a true story, this is the harrowing tale of two adversaries enmeshed in their own private war—and whose fortunes will help decide the fate of the world.",
        "Category": " Fiction , Thrillers , Military",
        "Publisher": "BANTAM",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The 27-Ingredient Chili Con Carne Murders: A Eugenia Potter Mystery (The Eugenia Potter Mysteries)",
        "Authors": "By Pickard, Nancy",
        "Description": "Some like it hot“Delightful . . . Ms. Pickard has given the protagonist a new least on life!”—The New York TimesWhen Eugenia Potter receives an urgent phone call from the manager of her ranch near Tucson, she's only too happy to drop everything and fly home. Something inside of her is calling her back to the desert. Why else would be preparing spicy Mexican meatball soup at her cottage in Maine when the menu clearly calls for clam chowder?But once she arrives home, Mrs. Potter discovers that her ranch manager and his granddaughter are missing from her ranch, Las Palomas, and feared dead. When a guest at a dinner gathering thrown by Mrs. Potter is food poisoned—apparently from eating her famous 27-ingredient chili—she knows she must act quickly before the murderer strikes again. And it doesn't hurt to have the help of a long-lost beau to spice up the danger with romance . . .",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Aunt Dimity Beats the Devil (Aunt Dimity Mystery)",
        "Authors": "By Atherton, Nancy",
        "Description": "The charming sixth installment of the bestselling Aunt Dimity series. Watch out for Nancy Atherton's latest, Aunt Dimity and the King's Ransom, coming in July 2018 from Viking! With rain crashing down on her Range Rover, as it climbs up a steep embankment on the Northumberland moors, Lori Shepherd is beginning to doubt the wisdom of her decision to evaluate a rare book collection at Wyrdhurst Hall. The grim, neo-gothic hall that greets her upon arrival is full of surprises-including a charming, secretive stranger, and a cache of World War I letters that tell a tale of doomed love and hint at a hidden treasure. It will take all of Dimity's supernatural skills to help Lori solve the puzzle and restore peace to a family haunted by its tragic past.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Scimitar (Highlander)",
        "Authors": "By McConnell, Ashley",
        "Description": "When a legendary sword, an ancient Arabian scimitar, is sent to Joe Dawson, one of the Watchers, with instructions to give it to immortal Scottish warrior Duncan MacLeod, Joe sets out to unravel the secrets of the sword and why it is being sent to the Highlander. Original. TV tie-in.",
        "Category": "",
        "Publisher": "Aspect",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1996"
        }
    },
    {
        "Title": "Eccentric epitaphs: Gaffes from beyond the grave",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Self-Reliance and Other Essays (Dover Thrift Editions: Philosophy)",
        "Authors": "By Emerson, Ralph Waldo",
        "Description": "Essayist, poet, and philosopher, Ralph Waldo Emerson (1803–1882) propounded a transcendental idealism emphasizing self-reliance, self-culture, and individual expression. The six essays and one address included in this volume, selected from Essays, First Series (1841) and Essays, Second Series (1844), offer a representative sampling of his views outlining that moral idealism as well as a hint of the later skepticism that colored his thought. In addition to the celebrated title essay, the others included here are \"History,\" \"Friendship,\" \"The Over-Soul,\" \"The Poet,\" and \"Experience,\" plus the well-known and frequently read Harvard Divinity School Address.",
        "Category": " Philosophy , Essays",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Essential Philosophy: Everything You Need to Understand the World's Greatest Thinkers",
        "Authors": "By james-mannion",
        "Description": "",
        "Category": "",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Hammond Atlas of the 20th Century",
        "Authors": "By Hammond Incorporated (COR) and Overy, R. J. (EDT)",
        "Description": "",
        "Category": " Reference , Atlases & Gazetteers",
        "Publisher": "Hammond World Atlas Corp",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Honeymoon Book: A Tribute to the Last Ritual of Sexual Innocence",
        "Authors": "By Scher, Paula",
        "Description": "Tells the stories of celebrities' honeymoons, looks at unusual wedding customs, traces the history of the honeymoon tradition, and offers quotations on marriage",
        "Category": "",
        "Publisher": "M Evans & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Battlefields Then & Now",
        "Authors": "By Man, John and Newark, Tim",
        "Description": "Provides historical information about battles from Gaugamela in 331 B.C. to Desert Storm, and uses printed transparent overlays to demonstrate what the battlefields looked like at the time of battle and as they look today",
        "Category": " History , Military , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "November",
            "Year": "1997"
        }
    },
    {
        "Title": "Crimes of War: What the Public Should Know",
        "Authors": "By Gutman, Roy (EDT) and Rieff, David (EDT)",
        "Description": "We see and read about brutal and seemingly senseless warfare in the news every day --Rwanda, Bosnia, Chechnya, to name a few. This A-to-Z guidebook reveals --through case studies, definitions of key terms, and explanations of what's legal and what's not --what the public needs to know about war and the law. Laws of war exist. They define and categorize those acts of signal cruelty and murder that are universally known as war crimes. The laws of war have never been more developed, yet never before have so many innocent civilians been the victims of war crimes. It is clear that the laws are not being adhered to, nor have these laws been brought to light for the public or the journalists reporting on conflicts. Crimes of War is a timely and important book, especially in light of the recent creation of the United Nations International Criminal Tribunal to try war criminals in Rwanda and Bosnia and the development of a permanent International Criminal Court. Authors Sidney Schanberg and Peter Maass, reporters Tom Gjelton from NPR and Roger Cohen from the New York Times, and photojournalists Gilles Peress and Susan Meiselas, along with many other award-winning writers and photographers, have contributed to this powerful book. The 145 entries define terms from Armistice to Wanton Destruction as well as give case studies of recent and ongoing conflicts.",
        "Category": " History , World",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "June",
            "Year": "1999"
        }
    },
    {
        "Title": "The Lion and the Mouse (Step-Into-Reading, Step 1)",
        "Authors": "By Herman, Gail and McCue, Lisa (ILT)",
        "Description": "\"Little Mouse. Big Lion. Big, big trouble. Who will save the mouse? Who will save the lion?\" This simple retelling of the classic Aesop fable will be a treat for kids and their parents as an adventurous mouse proves that even small creatures are capable of great deeds--like rescuing the King of the Jungle. With big, bold illustrations by Lisa McCue and large type, this Early Step into Reading book is perfect for kids just beginning to learn how to read.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1998"
        }
    },
    {
        "Title": "The Terrible Hours",
        "Authors": "By Maas, Peter",
        "Description": "On the eve of World War II, the Squalus, America's newest submarine, plunged to the bottom of the North Atlantic. Miraculously, thirty-three crew members still survived. While their loved ones waited in unbearable tension on shore, their ultimate fate would depend upon one man, U.S. Navy officer Charles \"Swede\" Momsen -- an extraordinary combination of visionary, scientist, and man of action. In this thrilling true account, prize-winning author Peter Maas vividly re-creates a moment-by-moment account of the disaster and the man at its center. Could he actually pluck those men from a watery grave? Or had all his pioneering work been in vain?",
        "Category": " History , Military , Naval",
        "Publisher": "HarperTorch",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2000"
        }
    },
    {
        "Title": "Documentation standards",
        "Authors": "By Gray, Max",
        "Description": "",
        "Category": "",
        "Publisher": "Brandon Systems Press",
        "Price Starting With ($)": "9.6",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Fury: A Novel (Modern Library)",
        "Authors": "By Rushdie, Salman",
        "Description": "A NEW YORK TIMES NOTABLE BOOK“Salman Rushdie’s great grasp of the human tragicomedy–its dimensions, its absurdities and horrors–has made him one of the most intelligent fiction writers in the English language.”–Gail Caldwell, The Boston Globe“Fury is a profoundly, ecstatically affirmative work of fiction. It reaffirms Rushdie’s standing . . . at the very front rank of contemporary literary novelists.”–Baltimore SunMalik Solanka, historian of ideas and world-famous dollmaker, steps out of his life one day, abandons his family in London without a word of explanation, and flees for New York. There’s a fury within him, and he fears he has become dangerous to those he loves. He arrives in New York at a time of unprecedented plenty, in the highest hour of America’s wealth and power, seeking to “erase” himself. But fury is all around him. An astonishing work of explosive energy, Fury is by turns a pitiless and pitch-black comedy, a love story of mesmerizing force, and a disturbing inquiry into the darkest side of human nature.“Rushdie’s ideas–about society, about culture, about politics–are embedded in his stories and in the interlocking momentum with which he tells them. . . . All of Rushdie’s synthesizing energy, the way he brings together ancient myth and old story, contemporary incident and archetypal emotion, transfigures reason into a waking dream.”–Los Angeles Times Book Review“Well, here it is, then, his first 3-D, full-volume American novel, finger-snapping, wildly stupefying, often slyly funny, red-blooded and red-toothed. [Fury] twinkles brightly in tragicomic passages.”–The Miami HeraldCover design:Cover illustration:",
        "Category": " Fiction , Humorous , Black Humor",
        "Publisher": "Random House Trade Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2002"
        }
    },
    {
        "Title": "Before It's too Late : Employee Involvement... An Idea Whose Time Has Come",
        "Authors": "By Grazier, Peter B.",
        "Description": "",
        "Category": " Business & Economics , General",
        "Publisher": "Teambuilding",
        "Price Starting With ($)": "6.47",
        "Publish Date": {
            "Month": "April",
            "Year": "1989"
        }
    },
    {
        "Title": "Scary Stories to Tell in the Dark: Collected from American Folklore",
        "Authors": "By Schwartz, Alvin and Gammell, Stephen (ILT)",
        "Description": "This spooky addition to Alvin Schwartz's popular books on American folklore is filled with tales of eerie horror and dark revenge that will make you jump with fright. There is a story here for everyone -- skeletons with torn and tangled flesh who roam the earth; a ghost who takes revenge on her murderer; and a haunted house where every night a bloody head falls down the chimney. Stephen Gammell's splendidly creepy drawings perfectly capture the mood of more than two dozen scary stories -- and even scary songs -- all just right for reading alone or for telling aloud in the dark.If You Dare!",
        "Category": " Juvenile Fiction , Short Stories",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1986"
        }
    },
    {
        "Title": "301 Spanish Verbs Fully Conjugated in All the Tenses (English and Spanish Edition)",
        "Authors": "By Kendris, Christopher",
        "Description": "Lists the complete conjugation for hundreds of the most commonly used Spanish verbs and includes tips on idiomatic expressions and using prepositions with verbs",
        "Category": " Foreign Language Study , Spanish",
        "Publisher": "B E S Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1982"
        }
    },
    {
        "Title": "Al Qaeda: Brotherhood of Terror",
        "Authors": "By Williams, Paul L.",
        "Description": "Places the Qaeda movement in the context of Islamic and Middle Eastern history, and discusses terrorist methods, the life and thought of Osama bin Laden, terrorist psychology, finances, and related topics.",
        "Category": " History , Middle East , General",
        "Publisher": "Alpha",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Breaking Up: From Heartache to Happiness in 48 Pages",
        "Authors": "By Nave, Yolanda",
        "Description": "Believing that ending a relationship is too depressing to go through alone, BREAKING UP offers solace, acceptance, several good laughs, and camaraderie to every woman who's been left behind, and is trying to deal with it. Yolanda Nave's little watercolor saga starts the moment what's-his-name walks out the door and ends when that old feeing called loneliness begins to feel like something else-freedom.   Meanwhile, revenge is dealt with in page after page of gleeful drawings with wry captions. Including the reminder to agree with him when he stops by and admits he's a cad and the suggestion that his underwear should be returned haphazardly packed, but immaculately starched.   BREAKING UP is a true-to-life documentation of the end of a love affair. But suddenly life doesn't seem so bad after all. Excerpted in Cosmopolitan. 133,000 copies in print.",
        "Category": "",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "The Kiss: A Romantic Treasury Of Photographs And Quotes (Running Press Miniature Editions)",
        "Authors": "By Jay, Molly",
        "Description": "\"Stylishly romantic black-and-white photographs complement quotations and excerpts from literary works, all glorifying the kiss as a symbol of love and friendship.\"",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Running Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "The Embrace: A Treasury Of Ramance,In Word And Image (Miniature Editions)",
        "Authors": "By Stein, Melissa",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Running Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Knock Knock Jokes (Dover Children's Activity Books)",
        "Authors": "By Daste, Larry (ILT), Fremont, Victoria (EDT), and Daste, Larry (EDT)",
        "Description": "\"Knock, Knock.\" \"Who's there?\" \"Isadore.\" \"Isadore who? \"Isadore open or shut?\" Knock knock teeth-gritters such as this one have tickled funnybones for generations. Now, this entertaining collection of 60 knock knock gems, painstakingly selected by Victoria Fremont to appeal to all ages, puts dozens of these rib-ticklers at the fingertips of fun-loving jokesters.Accompanied by engaging black-and-white illustrations and incorporating key works that double as preposterous puns, these amusing queries provide all the ammunition you need to entertain friends, relatives, and anyone who enjoys a bit of madcap humor.",
        "Category": " Games & Activities , Puzzles",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "Growing Up Jewish in America: An Oral History",
        "Authors": "By Frommer, Harvey and Frommer, Myrna Katz",
        "Description": "The childhood reminiscences of a hundred men and women as young as 22 and as old as 99 combine to create a unique portrait of Jewish-American life in the twentieth century, with all its vibrancy, complexity, humor, and contradictions. Here are memories of how place stamped personality in landscapes as diverse as Auburn, Maine, and Mitchell, South Dakota; Brooklyn, New York, and Laredo, Texas; Seattle, Washington, and Westminster, South Carolina; and countless gilded suburbs. Some recollections are common to most growing-up-in-America sagas; others are unique to the Jewish experience.",
        "Category": " History , Jewish",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "Everything You Need to Know about America's Jews and their History",
        "Authors": "By Rosenberg, Roy A.",
        "Description": "Chronicles the history of Jews in America and the contributions they have made, in a question-and-answer format",
        "Category": " History , Jewish",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1997"
        }
    },
    {
        "Title": "Jewish Wit and Wisdom (Dover Thrift Editions)",
        "Authors": "By Galewitz, Herb (EDT)",
        "Description": "\"It's no disgrace to be poor,\" observed Sholom Aleichem, \"but it's no great honor, either.\" \"Happiness is having a large, loving, caring, close-knit family in another city,\" remarked George Burns, while Marc Chagall noted that \"Art is the unceasing effort to compete with the beauty of flowers and never succeeding.\" These and many more classic examples of Jewish wit and wisdom — sometimes hilarious, frequently profound, almost always incisive — enliven the pages of this entertaining and practical little volume.Some 500 aphorisms include observations and remarks from statesmen, writers, artist, philosophers, jurists, musicians, and celebrities — from the prophets of the Old Testament, the Talmud, and Maimonides to Joey Adams, Barbra Streisand, and Woody Allen. Here also are memorable quotes from Louis Brandeis, Martin Buber, Fanny Brice, Heinrich Heine, Sam Goldwyn, Golda Meir, Karl Marx, Groucho Marx, Herman Mankiewicz, Albert Einstein, and many others.Arranged alphabetically by author, these thought-provoking pronouncements will not only serve as a handy resource for speech writers and public speakers but will also amuse and inspire all readers.",
        "Category": " Humor , Topic , Religion",
        "Publisher": "Dover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "The Wild Swans",
        "Authors": "By Andersen, Hans Christian, Jeffers, Susan, and Ehrlich, Amy",
        "Description": "Eleven princes become wild swans as the result of an evil spell and their sister, Elise, is to be burned at the stake as a witch",
        "Category": "",
        "Publisher": "Dutton Childrens Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Case of the Scaredy Cats (An I Can Read Book, Level 2, Grades 1-3)",
        "Authors": "By Bonsall, Crosby Newell",
        "Description": "When little ‘scaredy cat’ Annie disappears, it’s another baffling case for detectives Wizard, Tubby, Skinny, and Snitch.  ‘One of the funniest of the author’s easy-to-read stories about the youthful ‘private eyes.’’ —BL.",
        "Category": " Juvenile Fiction , Readers , Beginner",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1984"
        }
    },
    {
        "Title": "Eleven on Top",
        "Authors": "By Evanovich, Janet",
        "Description": "#1 New York Times#1 Wall Street Journal#1 Los Angeles Times#1 Entertainment Weekly#1 Publishers WeeklyStephanie Plum is thinking her career as a fugitive apprehension agent has run its course. She's been shot at, spat at, cussed at, fire-bombed, mooned, and attacked by dogs. Time for a change, Stephanie thinks. Time to find the kind of job her mother can tell her friends about without making the sign of the cross.So Stephanie Plum quits. Resigns. No looking back. No changing her mind. She wants something safe and normal. As it turns out, jobs that are safe and normal for most people aren't necessarily safe and normal for Stephanie Plum. Trouble follows her, and the kind of trouble she had at the bail bonds office can't compare to the kind of trouble she finds herself facing now. Her past has come back to haunt her. She's stalked by a maniac returned from the grave for the sole purpose of putting her into a burial plot of her own. He's killed before, and he'll kill again if given the chance. Caught between staying far away from the bounty hunter business and staying alive, Stephanie reexamines her life and the possibility that being a bounty hunter is the solution rather than the problem. After disturbingly brief careers at the button factory, Kan Klean Dry Cleaners, and Cluck-in-a-Bucket, Stephanie takes an office position in security, working for Ranger, the sexiest, baddest bounty hunter and businessman on two continents. It might not be the job she'll keep for the rest of her life, but for now it gives her the technical access she needs to find her stalker. Tempers and temperatures rise as competition ratchets up between the two men in her life---her on-again, off-again boyfriend, tough Trenton cop Joe Morelli, and her bad-ass boss, Ranger. Can Stephanie Plum take the heat? Can you?Between the adventure and the adversity there's attitude, and Stephanie Plum's got plenty in her newest misadventure,Eleven on Top.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "St. Martin's Press",
        "Price Starting With ($)": "5.35",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Postcard from Hell",
        "Authors": "By Dancer, Rex",
        "Description": "It was literally a postcard from Hell, and Andy Derain would have been smart to ignore it. But when the stunning Princess Astrid Montebello cried out for help from that infernally named village on Grand Cayman Island, Andy could not resist. Besides, he had already infuriated a local mob boss by selling pictures of the boss's bullet-riddled son, so a trip to the Caribbean - even one risking the jealous fury of his formidable fiancee - seemed a sensible response.Little did Andy realize that this little excursion would land him smack in the middle of vicious drug smugglers, a nasty socialite bored with the money that legitimate business could bring her, the corpses of some of New York's most beautiful women, and a lovely, adventurous airplane pilot named Glory.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "July",
            "Year": "1995"
        }
    },
    {
        "Title": "The Program",
        "Authors": "By White, Stephen",
        "Description": "The Program safeguards the truth, but when The Program has a hidden agenda, the protected become the huntedWith his nuanced psychological insight, inscrutable plotting, and a captivating lead character that parallels Jonathan Kellerman's Alex Delaware, Stephen White's Alan Gregory novels have become perennial national bestsellers. But, with The Program, White has challenged himself and honed his craft with remarkable assurance to create a rare breed of thriller. A dazzling mix of first-person and omniscient voices rewards readers with an irresistible narrative momentum. But the heart and soul of the novel is an indomitable woman reevaluating the seemingly innocuous choices she's made in the past while confronting the horrifying circumstances that threaten her family's future survival.\"Every precious thing I lose, you will lose two.\" The Program begins with a condemned man's last words to New Orleans District Attorney Kirsten Lord. After her husband is gunned down in front of her, Lord has no choice but to flee the wrath of the murderer's vengeance. Lord pulls up stakes, changes her name, and accepts the Witness Protection Program's offer to hide her and her young daughter in Boulder, Colorado. Soon thereafter, they are befriended by Program veteran Carl Luppo, a solitary mob assassin tormented by his former life who has nothing but time for regret.Sensing that someone inside the program has compromised Lord and her daughter's safety, Luppo takes on the role of sentinel, fully realizing that this may be his last shot at redemption. Even though Lord suspects that Luppo's warnings about the Program's dark side are justified and that she should believe the former hit man's instincts, the only people she can really trust are her nine-year-old daughter and perhaps her Program-appointed psychologist Alan Gregory.Fans of White's previous work will applaud the brilliant use of series favorite Alan Gregory in a seemingly secondary role in the novel, and new readers will find themselves compelled to find out what Gregory has encountered before. But all readers will agree that The Program is a superior thriller; a novel firmly grounded in the realities of three-dimensional characters in crisis and driven with the narrative pace of a guilty pleasure.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "Bodies in a Bookshop",
        "Authors": "By Campbell, R. T.",
        "Description": "Max Boyle, a botanist, Professor John Stubbs, and Chief Inspector Reginald F. Bish of Scotland Yard work together to solve a mysterious double murder",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "10.95",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Henry McGee Is Not Dead (November Man)",
        "Authors": "By Granger, Bill",
        "Description": "A Soviet scientist who has defected and then disappeared nonetheless manages to manipulate the efforts of R-section agent Devereaux, the November Man, to find him and KGB agent Denisov and kidnap them both",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Grand Central Pub",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "October",
            "Year": "1988"
        }
    },
    {
        "Title": "A Study of Maya Art: Its Subject Matter & Historical Development",
        "Authors": "By Spinden, Herbert Joseph",
        "Description": "Landmark classic interprets Maya symbolism, estimates styles, covers ceramics, architecture, murals, stone carvings as art forms. Over 750 illustrations.",
        "Category": " History , Native American",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "June",
            "Year": "1975"
        }
    },
    {
        "Title": "America the Beautiful: The Complete Verses",
        "Authors": "By Bates, Katharine Lee",
        "Description": "An illustrated edition of the nineteenth-century poem, later set to music, celebrating the beauty of America.",
        "Category": " Photography , Photoessays & Documentaries",
        "Publisher": "Boswell Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2001"
        }
    },
    {
        "Title": "Plays by and about Women",
        "Authors": "By Sullivan, Victoria (COM) and Hatch, James Vernon",
        "Description": "Eight plays written during the twentieth century by such women as Lillian Hellman, Doris Lessing, and Clare Boothe focus on the problems and struggles of women",
        "Category": " Drama , American , General",
        "Publisher": "Vintage",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "After Suicide (Christian Care Books)",
        "Authors": "By Hewett, John H.",
        "Description": "Clarifies current knowledge of suicide and demonstrates how survivors should deal with feelings of guilt, anger, bewilderment, and shame",
        "Category": " Religion , Christian Ministry , Counseling & Recovery",
        "Publisher": "Westminster John Knox Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "LA France Gastronomique",
        "Authors": "By Willan, Anne",
        "Description": "Offers one hundred recipes collected from ten French provinces, including salmon in ginger cream sauce from Alsace, roast veal with sorrel puree from the Loire, and candied orange tarte from Provence",
        "Category": " Cooking , General",
        "Publisher": "Arcade Pub",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1991"
        }
    },
    {
        "Title": "Throw Your Tooth on the Roof: Tooth Traditions from Around the World",
        "Authors": "By Karas, G. Brian (ILT) and Beeler, Selby",
        "Description": "What do you do when you lose a tooth? Do you put it under your pillow and wait for the tooth fairy? Not if you live in Botswana! In Botswana, children throw their teeth onto the roof. In Afghanistan they drop their teeth down mouse holes, and in Egypt they fling their teeth at the sun! Travel around the world and discover the surprising things children do when they lose a tooth. Selby B. Beeler spent years collecting traditions from every corner of the globe for this whimsical book, and illustrator G. Brian Karas adds to the fun, filling every page with humorous detail. He perfectly captures the excitement and pride that children experience when a tooth falls out.This title has been selected as a Common Core Text Exemplar (Grades 2-3, Informational Texts)",
        "Category": " Juvenile Nonfiction , Social Science , Customs, Traditions, Anthropology",
        "Publisher": "Clarion Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "The Alphabet Book (Pictureback(R))",
        "Authors": "By Eastman, P. D.",
        "Description": "P.D. Eastman, the author of Go, Dog, Go! and Are You My Mother? takes you on a silly romp through the alphabet. From American Ants to a Zebra with a Zither, there are laughs in store: an elephant on eggs! A walrus in a wig!And there's a handy alphabet down the side of each page so that everyone can keep track of where they are in the ABC's.",
        "Category": " Juvenile Fiction , Concepts , Alphabet",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1974"
        }
    },
    {
        "Title": "Merry Christmas",
        "Authors": "By Ohrbach, Barbara Milo",
        "Description": "A festive offering of best-loved holiday thoughts and songs--from Louisa May Alcott and Charles Dickens to Sir Walter Scott and Washington Irving. Their touching sentiments connect us to a simpler side of Christmas and to memories of childhood. Decorated with colorful Victorian Christmas cards and other charming 19th-century illustrations. Four-color illustrations.",
        "Category": " Crafts & Hobbies , Seasonal",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1992"
        }
    },
    {
        "Title": "Brown Bear, Brown Bear, What Do You See?",
        "Authors": "By Martin, Bill and Carle, Eric (ILT)",
        "Description": "A big happy frog, a plump purple cat, a handsome blue horse, and a soft yellow duck-- all parade across the pages of this delightful classic children's book, Brown Bear, Brown Bear, What Do You See? Children will immediately respond to Eric Carle's flat, boldly colored collages. Combined with Bill Martin's singsong text, they create unforgettable images of these endearing animals.",
        "Category": " Juvenile Fiction , Concepts , Colors",
        "Publisher": "Henry Holt and Co. (BYR)",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1996"
        }
    },
    {
        "Title": "Christmas: Celebrating The Joy of Faith and Family (God's Way)",
        "Authors": "By White Stone Books",
        "Description": "",
        "Category": " Religion , Devotional",
        "Publisher": "White Stone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "For unto Us a Child Is Born",
        "Authors": "By Sanna, Ellyn",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Mothers A Tribute",
        "Authors": "By Eisen, Armand",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Andrews and McMeel",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Only the Strong Survive: The Odyssey of Allen Iverson",
        "Authors": "By Platt, Larry",
        "Description": "There are few figures among America's media-saturated landscape that loom larger than the National Basketball Association's undeniable superstar Allen Iverson. He was the first overall pick of the 1996 NBA draft, and the spotlight has not left him since. Defiantly tattooed, with his hair in cornrows, the six-foot Philadelphia 76ers point guard has been vilified by a sports press still fawning over Michael Jordan's non-threatening, clean-cut visage. From Iverson's rap sheet to his rap album, from his on-court feats to his off-court antics, breathless fans and journalists alike seem determined to track his every move. Part sports star, part antihero, part hip-hop icon, Iverson has managed to cross over into the mainstream of American culture -- without compromise.It wasn't long before Iverson's prodigious athletic skills became apparent. Raised in poverty, with his father in prison, Iverson retreated to his local playgrounds and found escape from the all-too-common woes of the inner-city dweller. In one summer alone, eight of his friends were killed in shootings. But Iverson's talent simply could not be denied, and basketball remained the one constant in his tumultuous existence.And so Iverson, despite all odds, rose. A now-infamous scuffle in a bowling alley led to near race riots in Iverson's hometown of Newport News, Virginia, resulting in his being sentenced to jail time during high school. Eventually, Governor Douglas Wilder granted him clemency, the conviction was overturned on appeal, and his ascent continued. Georgetown coach John Thompson stepped in, giving Iverson a berth on his team at a time when other universities were too skittish to offer the same. It was their loss. After two tremendous years at Georgetown, Iverson declared himself eligible for the NBA draft. And the rest is history.In Only the Strong Survive, Larry Platt offers up the first full portrait of a complicated and intensely private star, a man whose loyalty to his family, the streets, and his friends (a group he calls Cru Thik) trumps any other concerns -- and that includes multimillion-dollar endorsement deals. Possessing an almost otherworldly talent, Allen Iverson is determined that everyone -- his mom, his homeboys, his cousins -- benefit from it. By embracing his roots and refusing to conform, Iverson has won fans and admirers far beyond the boundaries of the sports world.Filled with exclusive interview material and unprecedented access to many of Iverson's inner circle, Only the Strong Survive provides the first in-depth look at the truth behind this newly minted legend.",
        "Category": " Biography & Autobiography , Sports",
        "Publisher": "HarperEntertainment",
        "Price Starting With ($)": "5.68",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "Sweet Caroline: Last Child of Camelot",
        "Authors": "By Andersen, Christopher P.",
        "Description": "She is the heiress to a legacy of power, wealth, unfulfilled promise, and unspeakable tragedy. Her father was gunned down before a stunned world forty years ago, forever changing the course of history. Her mother became the most celebrated American woman of the twentieth century -- an icon of style, glamour, and personal courage. Her brother was the most promising Kennedy of his generation -- a global heartthrob who was killed when his plane crashed within sight of his mother's estate on Martha's Vineyard.Through it all, the sole surviving member of Camelot's First Family, Caroline Kennedy, has remained largely a mystery. Until now. In the manner of his #1 New York Times bestsellers The Day Diana Died and The Day John Died, as well as his other bestselling books on the Kennedys, Jack and Jackie and Jackie After Jack, Christopher Andersen draws on important sources -- many speaking here for the first time -- to provide a full, compelling portrait of Caroline, the young wife and mother left to carry on in her legendary family's name. Among the revelations:New details about life inside the Kennedy White House -- and the events surrounding JFK's assassination -- from Caroline's unique perspective.A spellbinding account of the surreal years she spent as the stepdaughter of Aristotle Onassis.Caroline's own battles with a variety of harrowing personal problems, both physical and emotional.The times she, too, cheated death; the stalkers who have caused her to fear for her life.Her often frustrating attempts to carve out an identity for herself in the shadow of her famous mother.Her loves, and the enigmatic character she chose to marry.The way she coped with the heartbreaking losses of her father, mother, and brother -- as well as the countless catastrophes that have plagued the Kennedy family over the last half-century and the demons that haunt her to this day.How she is raising her children, and what lessons she is teaching them about love -- and loss.Sweet Caroline: Last Child of Camelot is an often moving, always captivating look at the life of one little girl who was handed more than her share of heartache -- and has not only survived but flourished. It is the story of America's daughter.",
        "Category": " Biography & Autobiography , General",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Emily Post's The Etiquette Advantage in Business: Personal Skills for Professional Success, Second Edition",
        "Authors": "By Post, Emily, Post, Peter, and Post, Peggy",
        "Description": "As today's workplace becomes increasingly more competitive, knowing how to behave can make the difference between getting ahead and getting left behind. In The Etiquette Advantage in Business, 2nd Edition, etiquette authorities Peggy Post and Peter Post provide you with the all-important tools for building solid, productive relationships with your business associates -- relationships that will help propel you and your company straight to the top.In this completely revised and updated edition, which includes three new chapters on ethics, table manners, and electronic communication, the Posts show you how to handle both everyday and unusual situations that are essential to professional and personal success -- from resolving business conflicts with ease and grace to getting along with your boss and coworkers; from making long-lasting contacts to winning clients and closing deals. They also offer up-to-date guidance on pressing issues such as harassment in the workplace, worker privacy, e-mail dos and don'ts, and knowing how and when to shoulder blame.Written for business workers of all types and backgrounds, The Etiquette Advantage in Business remains the definitive resource for timeless advice on business entertaining, written communication, dressing appropriately for any business occasion, conventions and trade shows, job searches and interviews, gift-giving, and overseas travel.No matter the situation in which you find yourself, the Posts will give you the confidence to meet the challenges of the work world with confidence and poise -- because today, more than ever, good manners mean good business.",
        "Category": " Reference , Etiquette",
        "Publisher": "William Morrow",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Dilbert and the Way of the Weasel",
        "Authors": "By Adams, Scott",
        "Description": "Back after a four-year hiatus, New York Times best-selling author Scott Adams presents an outrageous look at work, home, and everyday life in his new book, Dilbert and the Way of the Weasel. Building on Dilbert’s theory that “All people are idiots,” Adams now says, “All people are idiots. And they are also weasels.” Just ask anyone who worked at Enron.In this book, Adams takes a look into the Weasel Zone, the giant grey area between good moral behaviour and outright felonious activities. In the Weasel Zone, where most people reside, everything is misleading, but not exactly a lie. Building on his popular comic strip, Adams looks into work, home, and everyday life and exposes the way of the weasel for everyone to see. With appearances from all the regular comic strip characters, Adams and Dilbert are at the top of their game—master satirists who expose the truth while making us laugh our heads off.",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    }
]