[
    {
        "Title": "The Door to December",
        "Authors": "By Koontz, Dean R.",
        "Description": "#1 New York Times bestselling author Dean Koontz takes readers into the darkest recesses of the human mind—and into the tempest of a father's obsession.A call in the middle of the night summoned psychiatrist Laura McCaffrey out into the rain-swept streets of Los Angeles. The police had found her husband-beaten to death. But what of her daughter, Melanie, whom he had kidnapped six years earlier? At the brutal murder scene, the police lead Laura into her husband's makeshift lab—and open the door to a rising tide of terror that has trapped Melanie in its midst...",
        "Category": " Fiction , Psychological",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2002"
        }
    },
    {
        "Title": "Serena Technique of Belly Dancing",
        "Authors": "By Serena Wilson, Alan Wilson",
        "Description": "",
        "Category": "",
        "Publisher": "Pocket",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1973"
        }
    },
    {
        "Title": "Sex: a user's manual",
        "Authors": "By Diagram Group",
        "Description": "",
        "Category": " Family & Relationships , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1985"
        }
    },
    {
        "Title": "Deep Freeze (West Coast Series)",
        "Authors": "By Jackson, Lisa",
        "Description": "Her Biggest Fan.  .  .When she wakes up, she's very cold. Colder than she's ever been in her life. She can't move or speak. And then she sees him. The one who took her. And before she dies, she wishes she could scream.  .  .  Is About To Become.  .  .  Former movie star Jenna Hughes left Hollywood for an isolated farm in Oregon to get away from fame. But someone has followed her--an obsessed fan whose letters are personal and deeply disturbing. And while Jenna's already shaken up by what she's seen on paper, she'd be terrified if she knew what Sheriff Shane Carter is investigating. It's a shocking case that started with the discovery of a dead woman in the woods. Now two more women are missing, one of whom bears a striking resemblance to Jenna.  .  .  Her Worst Nightmare.  .  .",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Serving Them Right: Innovative and Powerful Customer Retention Strategies",
        "Authors": "By Liswood, Laura",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "8.05",
        "Publish Date": {
            "Month": "March",
            "Year": "1992"
        }
    },
    {
        "Title": "The Harsh Cry of the Heron: The Last Tale of the Otori (Tales of the Otori, Book 4)",
        "Authors": "By Hearn, Lian",
        "Description": "The Harsh Cry of the Heron is the fourth book in the Tales of the Otori series by Lian Hearn. Don't miss the related series, The Tale of Shikanoko. A dazzling epic of warfare and sacrifice, passionate revenge, treacherous betrayal, and unconquerable love, The Harsh Cry of the Heron takes the storytelling achievement of Lian Hearn's fantastic medieval Japanese world to startling new heights of drama and action. Fifteen years of peace and prosperity under the rule of Lord Otori Takeo and his wife Kaede is threatened by a rogue network of assassins, the resurgence of old rivalries, the arrival of foreigners bearing new weapons and religion, and an unfulfilled prophecy that Lord Takeo will die at the hand of a member of his own family. The Harsh Cry of the Heron is the rich and stirring finale to a series whose imaginative vision has enthralled millions of readers worldwide, and an extraordinary novel that stands as a thrilling achievement in its own right.",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "12.43",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Animals (Learn to Draw)",
        "Authors": "By Fisher, Diana",
        "Description": "Now anyone can learn to draw 26 captivating creatures! Simples step-by-step instructions make it fun and easy to draw lifelike wildlife. Just start with basic shapes and follow the illustrated examples, and you'll be creating your own amazing masterpieces in no time at all!",
        "Category": " Art , Techniques , Drawing",
        "Publisher": "Walter Foster",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2005"
        }
    },
    {
        "Title": "One Thing You Can't Do in Heaven",
        "Authors": "By Cahill, Mark",
        "Description": "Are you ready for eternity? If so, are you helping others get ready for that journey into eternity that each of us must take? As believers, we all know that we should tell others about the Lord, but we often don't know how. This practical book gives great ideas for starting conversations with the lost, how to keep them going, examples of various witnessing situations, and solid answers to commonly asked questions. It will help motivate and equip you to reach both friends and strangers for Jesus Christ the rest of your life. Hear stories of real-life encounters that demonstrate how to put these principles into action. Learn how to open conversations and keep them going using very simple questions and ideas familiar to all of us. See how to navigate around common would-be obstacles to walk people right to the gospel. Then see how the lost are impacted to be thinking about their eternal destination and thankful to have their questions answered. You'll be filled with incredible thanks for having given them the help they need and for honoring God by giving them the truth about salvation.",
        "Category": " Religion , Christianity , General",
        "Publisher": "Mark Cahill Ministries",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2002"
        }
    },
    {
        "Title": "Ultra Cool Rides",
        "Authors": "By Padgett, Martin",
        "Description": "",
        "Category": "",
        "Publisher": "Kidsbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2004"
        }
    },
    {
        "Title": "Disney Best Friends (My First Look & Find)",
        "Authors": "By Editors of Publications International Ltd.",
        "Description": "",
        "Category": " NON-CLASSIFIABLE",
        "Publisher": "Publications International",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "After Dark: A Novel",
        "Authors": "By Margolin, Phillip",
        "Description": "Gone, But Not Forgotten rocketed Phillip Margolin into the select company of million-selling  novelists. Here he displays again the same genius for best-selling suspense in another  intricate, breathtaking thriller of multiple murder in the legal community of the  Pacific Northwest. Laura Rizzati, a law clerk for Oregon Supreme Court Justice  Robert Griffen, is found slain late one night in the deserted courthouse. Her office  is ransacked—but nothing seems to be missing. There are no suspects and no clues. The following month Griffen himself is killed by a car bomb in the driveway of  his Portland home. This time, though, there is a suspect: in a shocking turn of events,  Abigail Griffen, star prosecutor in the Multnomah County District Attorney's office  and estranged wife of Justice Griffen, is charged with first degree murder. With  the same gripping suspense that drove Gone, But Not Forgotten onto the bestseller  lists, this is a complex legalthriller with a truly startling ending.",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "To Trust a Stranger",
        "Authors": "By Robards, Karen",
        "Description": "She trusted her husband and got burned. Now she's playing with fire and daring  To Trust A Stranger  Suspicion burned within Julie Carlson -- the heartbreaking, infuriating suspicion that her husband, a wealthy and powerful contractor, was having an affair. Not sure whom to trust, Julie turns to a handsome stranger....Private detective Mac McQuarry ignores his better judgment about not mixing women and work when he's hired by Julie Carlson. Not only is she drop-dead gorgeous, but Sid Carlson was a player in Mac's inglorious downfall from the Charleston P.D. -- and revenge would be sweet indeed. But when Mac witnesses an explosive hit that targeted Julie, the tables are turned -- and Mac and Julie become the hunted. With their fiery flirtation sparking into full-blown passion, they must crash their way through a maze of buried secrets and deadly deceptions.  Karen Robards electrifies the page with thrilling passion and suspense in this heart-pounding New York Times bestseller.",
        "Category": " Fiction , Action & Adventure",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "Blessing Your Husband: Understanding and Affirming Your Man",
        "Authors": "By Evans, Debra",
        "Description": "Author Debra Evans makes a convincing case for the power a wife can have in motivating and bringing comfort to her husband by blessing him with words, actions, and prayer. Filled with scriptural advice, true stories, insights about how men think, and practical ideas, Blessing Your Husband will help women strengthen their marriage relationships and bring out the best in their husbands.",
        "Category": " Family & Relationships , Marriage & Long-Term Relationships",
        "Publisher": "Focus on the Family",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2003"
        }
    },
    {
        "Title": "A Parents Guide to My First Steps to Reading",
        "Authors": "By Anon",
        "Description": "",
        "Category": "",
        "Publisher": "The Child's World",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "Daddy's Angel",
        "Authors": "By Broadrick, Annette",
        "Description": "Noelle St. Nichols, a guardian angel, transforms herself into a housekeeper to help widower Bret Bishop and his four adorable children reclaim the happiness that is missing from their lives, but her plan backfires when she falls in love with him and his family. Reprint.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Harlequin Readers' Choice",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Strawberry Shortcake: Be My Valentine!",
        "Authors": "By Bryant, Megan E. and Oesch, Brian (ILT)",
        "Description": "Strawberry Shortcake spends the morning making heart-shaped pancakes for breakfast and special valentines for all of her friends, and when she sets off to deliver the valentines, she finds a big, beautiful heart on her doorstep. Original.",
        "Category": " Juvenile Fiction , Social Themes , Friendship",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Confessions of a Contractor",
        "Authors": "By Murphy, Richard",
        "Description": "After spending fifteen years renovating houses for wealthy L.A. women and keeping his distance from his clients, Henry Sullivan finds himself breaking the rules when he falls for two very different women, former friends for whom he takes on separate remodeling jobs while trying to uncover the events that had ended the women's friendship. A first novel. 50,000 first printing.",
        "Category": " Fiction , Literary",
        "Publisher": "Putnam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "A Baby Changes Everything (The Fortune's of Texas Reunion)",
        "Authors": "By Ferrarella, Marie",
        "Description": "As he and his wife Savannah grow further apart due to the demands of running their new ranch, Cruz Perez suddenly realizes that his marriage is in jeopardy and vows to prove to his wife, who is pregnant with their second child, that family is the most important thing in his life. Original.",
        "Category": " Fiction , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Hospital: Man, Woman, Birth, Death, Infinity, Plus Red Tape, Bad Behavior, Money, God and Diversity on Steroids",
        "Authors": "By Salamon, Julie",
        "Description": "Traces a year at Brooklyn's Maimonides Hospital and its new state-of-the-art cancer center, offering insight into the particular challenges being posed by the region's increasingly multicultural populace while exploring how the hospital addresses key issues related to financial, technological, and ethical matters.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Penguin",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Dragonology: The Complete Book of Dragons (Ologies)",
        "Authors": "By Steer, Dugald (EDT) and Drake, Ernest",
        "Description": "For true believers only, a lavishly illustrated reproduction of a legendary volume by the world’s most distinguished dragonologist. Don’t let it fall into the wrong hands!Do you believe in dragons? Now, for the first time, the long-lost research of renowned nineteenth century dragonologist Dr. Ernest Drake is presented in all its eccentric glory, happily bridging the gap between dragon legend and fact. The meticulous Dr. Drake assigns Latin names to various dragon species, ruminates on why dragons are able to speak, speculates on how they could fly, and explains the true purpose of their notorious hoarding habits. Here are just a few of DRAGONOLOGY'S fascinating features: — Novelty item on every spread, including tactile samples of dragon wings, dragon scales, and dragon skin — Booklet of dragon riddles (indispensable to the burgeoning dragonologist) — Sealed envelope containing a powerful dragon-calling spell — Embossed faux leather cover with silver foil, encrusted with three dragon gemsIn his afterword, Dr. Drake reveals that one of the crucial goals of dragonologists is to preserve the magnificent creatures of their study wherever possible - a goal this tongue-in-cheek volume most affectionately achieves. An incomparable gift for secret dragonologists everywhere!",
        "Category": " Juvenile Nonfiction , Social Science , Folklore & Mythology",
        "Publisher": "Candlewick",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "October",
            "Year": "2021"
        }
    },
    {
        "Title": "The China Price: The True Cost of Chinese Competitive Advantage",
        "Authors": "By Harney, Alexandra",
        "Description": "A landmark eyewitness expos? of how China's factory economy competes for Western business by selling out its workers, its environment, and its future  In The China Price, acclaimed Financial Times correspondent Alex Harney uncovers the truth about how China is able to offer such amazingly low prices to the rest of the world. What she has discovered is a brutal, Hobbesian world in which intense pricing pressure from Western companies combines with ubiquitous corruption and a lack of transparency to exact an unseen and unconscionable toll in human misery and environmental damage.  In a way, Harney shows, what goes on in China is inevitable. In a country with almost no transparency, where graft is institutionalized and workers have little recourse to the rule of law, incentives to lie about business practices vastly outweigh incentives to tell the truth. Harney reveals that despite a decade of monitoring factories, outsiders all too often have no idea of the conditions under which goods from China are made. She exposes the widespread practice of using a dummy or model factory as a company's false window out to the world, concealing a vast number of illegal factories operating completely off the books. Some Western companies are better than others about sniffing out such deception, but too many are perfectly happy to embrace plausible deniability as long as the prices remain so low. And in the gold-rush atmosphere that's infected the country, in which everyone is clamoring to get rich at once and corruption is rampant, it's almost impossible for the Chinese government's own underfunded regulatory mechanisms  to do much good at all.  But perhaps the most important revelation in The China Price is how fast change is coming, one way or another. A generation of Chinese flocked from the rural interior of the country to its coastline, where its factory work largely is, in the largest mass migration in human history. But that migration has slowed dramatically, in no small part because of widespread disenchantment with the way of life the factories offer. As pollution in China's industrial cities worsens and their infrastructure buckles, and grassroots activism for more legal recourse grows, pressures are mounting on the system that will not dissipate without profound change. Managing the violence of that change is the greatest challenge China faces in the near future, and managing its impact on the world economy is the challenge that faces us all.",
        "Category": " Political Science , Labor & Industrial Relations",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "A TV Guide to Life: How I Learned Everything I Needed to Know From Watching Television",
        "Authors": "By Alexander, Jeff",
        "Description": "Read Jeff Alexander's posts on the Penguin Blog.A couch potato’s book of wisdom— 100% commercial free! Some say that entire generations of Americans are being raised by the television…like that’s a bad thing. Not so, says author Jeff Alexander, long-time television writer, advocate of education by television, and recapper for the popular website Television Without Pity. Here, he offers the ultimate in life lessons as seen on TV. Topics include: • Saved by the Bell: School on TV • Somebody Save Me: Super Powers and Magic Spells • Tell Me Why I Love You Like I Do: Relationships on TV • Making A Living: The Workplace • And more With a smart, snarky style, Alexander guides readers through important lessons gleaned from years of TV reviewing (now in convenient book form!), freeing up a whole new generation to learn other things, like how to cure cancer or solve world hunger…or anything more useful than watching TV (Author’s note: Just joking… there is no such thing).",
        "Category": " Performing Arts , Television , History & Criticism",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "In The Arms Of The Law (The Fortunes of Texas: Reunion)",
        "Authors": "By Moreland, Peggy",
        "Description": "Assigned to work with Officer Gabe Thunderhawk to investigate a murder involving \"the lost Fortune,\" Detective Andrea Matthews vows never to let personal feelings get in the way of a case until she can no longer hide her attraction to Gabe. Original.",
        "Category": " Fiction , General",
        "Publisher": "Silhouette",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Confessions of a Jane Austen Addict (Jane Austen Addict Series)",
        "Authors": "By Rigler, Laurie Viera",
        "Description": "Read Laurie Viera Rigler's posts on the Penguin Blog.    After nursing a broken engagement with Jane Austen novels and Absolut, Courtney Stone wakes up and finds herself   not in her Los Angeles bedroom or even in her own body, but inside the bedchamber of a woman in Regency   England.   Who but an Austen addict like herself could concoct such a fantasy?     Not only is Courtney stuck in another woman’s life, she is forced to pretend she actually is that woman; and despite   knowing nothing about her, she manages to fool even the most astute observer. But not even her level of Austen   mania   has prepared Courtney for the chamber pots and filthy coaching inns of nineteenth-century England, let alone the   realities of being a single woman who must fend off suffocating chaperones, condom-less seducers, and marriages   of   convenience.     This looking-glass Austen world is not without its charms, however. There are journeys to Bath and London, balls in   the   Assembly Rooms, and the enigmatic Mr. Edgeworth, who may not be a familiar species of philanderer after all. But   when Courtney’s borrowed brain serves up memories that are not her own, the ultimate identity crisis ensues. Will   she   ever get her real life back, and does she even want to?",
        "Category": " Fiction , Women",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Consequences",
        "Authors": "By Lively, Penelope",
        "Description": "The Booker Prize winning author's sweeping saga of three generations of women\"One of the most accomplished writers of fiction of our day\" (The Washington Post ) follows the lives and loves of three women--Lorna, Molly, and Ruth--from World War II-era London to the close of the century. Told in Lively's incomparable prose, this is a powerful story of growth, death, and renewal, as well as a penetrating look at how the major and minor events of the twentieth century changed lives. By chronicling the choices and consequences that comprise one family's history, Lively offers an intimate and profound reaffirmation of the force of connection between generations.",
        "Category": " Fiction , Sagas",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Love Overboard",
        "Authors": "By Evanovich, Janet",
        "Description": "She's been called \"side-splittingly funny\" (Publishers Weekly), \"a blast of fresh air\" (Washington Post), and \"a winner\" (Glamour).  She is, of course, Janet Evanovich, the award-winning, #1 New York Times bestselling author of the Stephanie Plum mystery series. Now available for the first time in more than a decade comes Love Overboard, the hilarious story of a sinfully handsome schooner captain and the spirited woman who agrees to work on his cruise ship. It's a classic novel of comic mayhem from the incomparable Janet Evanovich.",
        "Category": " Fiction , Romance , General",
        "Publisher": "Harper",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2012"
        }
    },
    {
        "Title": "The Gentle Axe: A Novel (A Porfiry Petrovich Novel)",
        "Authors": "By Morris, R. N.",
        "Description": "Fresh off the case of a deranged student who murdered his landlady, noted police investigator Porfiry Petrovich barely takes a breath before a bizarre and very grisly double murder lands him back on the streets of the tsarist St. Petersburg he knows all too well. The sardonic sleuth follows a trail from the drinking dens of the Haymarket district to an altogether more genteel stratum of society-a hunt that leads him to a conclusion even he will find shocking. In the tradition of such first-rate historical novels such as The Alienist and The Dante Club, The Gentle Axe is atmospheric and tense storytelling from its dramatic opening to its stunning climax.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "The Art of the Start: The Time-Tested, Battle-Hardened Guide for Anyone Starting Anything",
        "Authors": "By Kawasaki, Guy",
        "Description": "A new product, a new service, a new company, a new division, a new organization, a new anything—where there’s a will, here’s the way. It begins with a dream that just won’t quit, the once-in-a-lifetime thunderbolt of pure inspiration, the obsession, the world-beater, the killer app, the next big thing. Everyone who wants to make the world a better place becomes possessed by a grand idea.But what does it take to turn your idea into action?  Whether you are an entrepreneur, intrapreneur, or not-for-profit crusader, there’s no shortage of advice available on issues such as writing a business plan, recruiting, raising capital, and branding. In fact, there are so many books, articles, and Web sites that many startups get bogged down to the point of paralysis. Or else they focus on the wrong priorities and go broke before they discover their mistakes. In The Art of the Start, Guy Kawasaki brings two decades of experience as one of business’s most original and irreverent strategists to offer the essential guide for anyone starting anything, from a multinational corporation to a church group. At Apple in the 1980s, he helped lead one of the great companies of the century, turning ordinary consumers into evangelists. As founder and CEO of Garage Technology Ventures, a venture capital firm, he has field-tested his ideas with dozens of newly hatched companies. And as the author of bestselling business books and articles, he has advised thousands of people who are making their startup dreams real. From raising money to hiring the right people, from defining your positioning to creating a brand, from creating buzz to buzzing the competition, from managing a board to fostering a community, this book will guide you through an adventure that’s more art than science—the art of the start.",
        "Category": " Business & Economics , Investments & Securities , General",
        "Publisher": "Portfolio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "Slummy Mummy",
        "Authors": "By Neill, Fiona",
        "Description": "A smart, laugh-out-loud debut novel about a deeply flawed but endearing stay-at-home mom, a book for anyone who took Helen Fielding’s Bridget Jones to heart a decade ago-and now has kids.Lucy Sweeney has three sons, a husband on a short fuse, and a tendency toward domestic disaster. It has been years since the dirty laundry pile was less than three feet high, months since she remembered to have sex, and weeks since her toddler started using the trash can as a toilet. Lucy is living in a constant state of emergency, caught between perfectionist Yummy Mummy No. 1 and competitive Alpha Mum, making it hard for her to remember exactly why she exchanged her career and sanity for less than blissful domesticity. When she begins a flirtation with Sexy Domesticated Dad, a father from the school car-pool lane, the string of white lies to cover up the trail of chaos and illicit desire starts to unravel and disaster looms.Slummy Mummy is a hilarious novel about the dilemmas of modern marriage and motherhood for those who never discovered their inner domestic goddess. Pitch-perfect and satisfyingly smart, it does for the stay-at-home mother what Allison Pearson's blockbuster bestseller I Don't Know How She Does It did for the working mom: It offers a lovable, flawed character who resonates, entertains, and undoubtedly has it worse than you do.",
        "Category": " Fiction , Women",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "My Prerogative",
        "Authors": "By White, Sasha",
        "Description": "Happy with her single life--friends, a nice apartment, and a job tending bar--Kelsey Howard discovers that her voyeuristic neighbor is watching her every move and that the mystery man could be the answer to fulfilling every one of her erotic fantasies. Original.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Dare to Win",
        "Authors": "By Hansen, Mark Victor",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Hay House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "The Essential Handbook of Victorian Etiquette",
        "Authors": "By Hill, Thomas E",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "1994"
        }
    },
    {
        "Title": "Couples' Devotional Bible for Engaged and Newly Married Couples",
        "Authors": "By Marriage Partnership (EDT)",
        "Description": "If you&apos;re newly married or are contemplating marriage, the best-selling NIV Couples&apos; Devotional Bible is for you.  Whether you use it together as a couple or as individuals, this Bible will draw you closer to God and to each other.  Each weekday you&apos;ll read a brief devotional message and a nearby Scripture passage. At the bottom of the devotion, you&apos;ll find 'Marriage Builder' questions for discussion or personal evaluation.  At the end of the week, you&apos;ll find 'Weekending,' which combines a short, reflective devotion with Scripture readings for Saturday and Sunday. The NIV Couples&apos; Devotional Bible contains 52 weeks of devotions--an entire year to help you start your marriage off right.  - This Bible draws on the experiences and insights of over 140 contributors from all wages and walks of life. You&apos;ll read from the writings of marriage and family experts such as Jim and Sally Conway, Gary Smalley, Lewis Smedes, and the staff of Marriage Partnership magazine. You&apos;ll also enjoy the writings of Frederick Buechner, Charles Colson, Bill and Gloria Gaither, Ruth Bell Graham, Charles Swindoll, Joni Eareckson Tada, Philip Yancey and many others. - The topics are as broad and important as marriage itself. Communication. Work. Sex. In-laws. Decision-making. Money. Spiritual growth. Friends. You&apos;ll find them here, together with the complete text of the New International Version, today&apos;s best-selling modern translation, known for its accuracy and readability.  Now revised to reflect the realities of relationships today, the NIV Couples&apos; Devotional Bible is a Bible for, by and about today&apos;s couple. A Bible for you.",
        "Category": " Bibles , New International Version , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Are You a Trick or a Treat? (Adult Mad Libs)",
        "Authors": "By Price, Roger and Stern, Leonard",
        "Description": "",
        "Category": " Humor , Topic , Adult",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Sinner's Guide to Confession",
        "Authors": "By Schieber, Phyllis",
        "Description": "From the author of Willing Spirits?a novel of three women, their deepest longings, and their most profound secrets.Barbara, Kaye, and Ellen, longtime friends, are inseparable?but each nurtures her own secret. As a widowed mother, Barbara hides her persona as a writer of erotica. Kaye is having an extramarital affair that reawakens her passion but fills her with conflict. Ellen has lost her husband to a younger woman who is now pregnant?a painful blow, since Ellen and her husband were never able to conceive. But she is not childless?Ellen is still haunted by the memory of the baby girl she had at sixteen and was forced to relinquish at birth. Estranged from her family, Ellen realizes that if she is ever to find her lost daughter?now a grown woman herself?she will have to confront her shame and rely on her dearest friends.",
        "Category": " Fiction , Psychological",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Little Face: A Zailer and Waterhouse Mystery (A Zailer & Waterhouse Mystery)",
        "Authors": "By Hannah, Sophie",
        "Description": "A creepy, fast-paced psychological thriller from the author of The Wrong Mother and The Other Woman’s HouseIt’s every mother’s worst nightmare. When Alice Fancourt leaves her newborn daughter at home with her husband for the first time, she comes home to a horrifying discovery: her child has been swapped with another baby. In near hysterics, Alice rushes to call the police, but soon discovers that no one, not even her husband David, believes her. When the police arrive, Detective Simon Waterhouse is drawn to the lovely Alice but doubts her story and suspects that she is suffering from postpartum depression. Meanwhile, David is growing increasingly hostile and Alice begins to fear that her baby’s disappearance may be linked to his first wife’s untimely death. Can Alice convince the police before it’s too late?The first book in Sophie Hannah’s acclaimed Zailer and Waterhouse series established her as a new master of psychological suspense. For fans of Tana French and Tess Gerritsen, Little Face is a chilling look at the lengths to which a mother will go to protect her child.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Bad Dog: 278 Outspoken, Indecent, and Overdressed Dogs",
        "Authors": "By Prichett, Harry, Battles, Rob, and Rosen, Richard Dean",
        "Description": "Bad habits, bad attitudes, bad breath. With a weakness for bad outfits and having bad hair days. Dogs are no less bad than cats, so it was only a matter of time before, emboldened by the runaway success of Bad Cat, the #1 New York Times bestseller with 487,000 copies in print, dogs would be begging for the chance to speak out. Dogs like:   Trixie, the puppy eating her own foot, who says: “If you’re wondering, it tastes like chicken.” Or the aging Sam, eyes popping out of his head and granny glasses askew: “Sweet mother of mercy—the Viagra’s working!” Or Tasia, a big mutt forced to wear little Santa hats, who snarls: “ I’d like to roast your chestnuts on an open fire.” There’s Dallas the surly yoga instructor. The old letch Samson, half-mastiff and half-slobber. Barley of the Order of the Vested Shih Tzus. Devil-worshipping Penny. Friend of sailors Miz Skeeter Bug. And Charlie, whose words should be heeded by every owner who thinks it’s cute to dress up the family pet: “Listen to me! I am not a bird. I am not a plane. I’m just your dog, Charlie.” In the same format as Bad Cat, with 244 truly funny photographs (including a number of group portraits), plus name, age, hobby, and candid quote.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2005"
        }
    },
    {
        "Title": "Darker Than Midnight (Mordecai Young Series, Book 3)",
        "Authors": "By Shayne, Maggie",
        "Description": "Escaping the state mental institution, Michael Corbett, on the run from the law and from a faceless enemy who wants him dead, finds an ally in police lieutenant Cassandra \"Jax\" Jackson, who agrees to help him find the truth surrounding his wife's murder. Original.",
        "Category": " Fiction , Romance , Suspense",
        "Publisher": "MIRA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Secrets of Ireland by Kevin Ayres, V. K. Guy (Photographer) (2006) Hardcover",
        "Authors": "By V. K. Guy (Photographer) Kevin Ayres",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "7.23",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Wired for War: The Robotics Revolution and Conflict in the 21st Century",
        "Authors": "By Singer, P. W.",
        "Description": "A military expert reveals how science fiction is fast becoming reality on the battlefield, changing not just how wars are fought, but also the politics, economics, laws, and ethics that surround war itself P. W. Singer?s previous two books foretold the rise of private military contractors and the advent of child soldiers? predictions that proved all too accurate. Now, he explores the greatest revolution in military affairs since the atom bomb?the advent of robotic warfare. We are just beginning to see a massive shift in military technology that threatens to make the stuff of I,Robot and the Terminator all too real. More than seven- thousand robotic systems are now in Iraq. Pilots in Nevada are remotely killing terrorists in Afghanistan. Scientists are debating just how smart?and how lethal?to make their current robotic prototypes. And many of the most renowned science fiction authors are secretly consulting for the Pentagon on the next generation. Blending historic evidence with interviews from the field, Singer vividly shows that as these technologies multiply, they will have profound effects on the front lines as well as on the politics back home. Moving humans off the battlefield makes wars easier to start, but more complex to fight. Replacing men with machines may save some lives, but will lower the morale and psychological barriers to killing. The ?warrior ethos,? which has long defined soldiers? identity, will erode, as will the laws of war that have governed military conflict for generations. Paradoxically, these new technologies will also bring war to our doorstep. As other nations and even terrorist organizations start to build or buy their own robotic weapons, the robot revolution could undermine America?s military preeminence. While his analysis is unnerving, there?s an irresistible gee-whiz quality to the innovations Singer uncovers. Wired for War travels from Iraq to see these robots in combat to the latter-day ?skunk works? in America?s suburbia, where tomorrow?s technologies of war are quietly being designed. In Singer?s hands, the future of war is as fascinating as it is frightening.",
        "Category": " Technology & Engineering , Military Science",
        "Publisher": "Penguin Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Wikinomics: How Mass Collaboration Changes Everything",
        "Authors": "By Tapscott, Don and Williams, Anthony D.",
        "Description": "An updated edition of the national bestseller?now with a new introduction and a new chapter Today, encyclopedias, jetliners, operating systems, mutual funds, and many other items are being created by teams numbering in the thousands or even millions. While some leaders fear the heaving growth of these massive online communities, Wikinomics proves this fear is folly. Smart firms can harness collective capability and genius to spur innovation, growth, and success. A brilliant guide to one of the most profound changes of our time, Wikinomics challenges our most deeply-rooted assumptions about business and will prove indispensable to anyone who wants to understand competitiveness in the twenty- first century. Based on a $9 million research project led by bestselling author Don Tapscott, Wikinomics shows how masses of people can participate in the economy like never before. They are creating TV news stories, sequencing the human genome, remixing their favorite music, designing software, finding a cure for disease, editing school texts, inventing new cosmetics, or even building motorcycles. You'll read about: ? Rob McEwen, the Goldcorp, Inc. CEO who used open source tactics and an online competition to save his company and breathe new life into an old-fashioned industry. ? Flickr, Second Life, YouTube, and other thriving online communities that transcend social networking to pioneer a new form of collaborative production. ? Mature companies like Procter & Gamble that cultivate nimble, trust-based relationships with external collaborators to form vibrant business ecosystems. An important look into the future, Wikinomics will be your road map for doing business in the twenty-first century.",
        "Category": " Technology & Engineering , Telecommunications",
        "Publisher": "Portfolio Hardcover",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "Silent Snow",
        "Authors": "By Thayer, Steve",
        "Description": "A St. Paul, Minnesota, investigative reporter embarks on a personal quest for justice and revenge when his young son is snatched from his nursery at the height of a blizzard, a crime that may have ties to his own past.",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Signet",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "The Black Book of Hollywood Beauty Secrets",
        "Authors": "By Pearlman, Cindy and Douglas, Kym",
        "Description": "We just asked the movie stars how they did it. What did they use? How often? Where did they get it? How can we do it, too? And they told us. We couldnt believe it either.Kym Douglas, host of the upcoming Lifetime makeover show Queen and the image consultant onThe View, and celebrity journalist Cindy Pearlman had always wanted to know how the A-list stars looked so, well, A-list. It turns out that even the most carefully guarded stars were more than happy to dish. Collected here, in their own words, celebrities and their beauty gurus reveal their tricks of the trade. How do they reduce puffiness, lose five pounds in a week, put shine in their hair, buff their skin, and vacuum their pores without spending a fortune? Find out from Jennifer Aniston, Catherine Zeta-Jones, Lindsay Lohan, Beyonce Knowles, Jennifer Lopez, Elizabeth Hurley, Charlize Theron, and many, many more! Kym Douglas is the creator and host of the upcoming Lifetime Television makeover show,Queen, airing in October and the image consultant on The View. She appears regularly onSoap Talk, Good Day Live, Before & Afternoon, and Your Weekend with Jim Brickman.",
        "Category": " Health & Fitness , Beauty & Grooming",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2006"
        }
    },
    {
        "Title": "Smart Words: Vocabulary for the Erudite",
        "Authors": "By Harrison, Mim",
        "Description": "How and where to use 500 of the words that make you sound more cultured, worldly, and downright smart. Whoever said sounding smart had to be painful? It's all in how you acquire the \"ten-dollar words\" of English. Smart Words makes fast and smooth learning of words such as prelapsarian, sedulous, sybaritic and draconian. How? By sticking to ultra-simple definitions, then offering a memorable--and often funny--description of when or why to use the word. A sample sentence shows you how. And the phonetics are a snap. Here's the description of sybaritic, defined as luxurious: \"Make that luxurious with a capital S. The word got its start from Sybaris, an ancient Greek city known for being a tad over the top in the pamper-me department.\" Whether you're a word lover, a fan of quirky reference books, or simply in need of a vocabulary makeover, Smart Words will help you be smart(er) about the words you use and the way you use them.",
        "Category": " Reference , Personal & Practical Guides",
        "Publisher": "TarcherPerigee",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Living Well: 21 Days to Transform Your Life, Supercharge Your Health, and Feel Spectacular",
        "Authors": "By Williams, Montel and Doyle, William",
        "Description": "Montel Williams? New York Times bestselling battle plan for better living. Now in paperback! In Living Well, Montel explains the science behind his successful battle against multiple sclerosis, interviewing a global ?SWAT Team? of doctors, scientists, and researchers, and reveals the amazing effects of healthy eating and regular exercise. Most importantly, Montel shares his groundbreaking 21-Day Living Well Food and Workout Program? a hard-hitting health plan of diet changes, a step-by-step exercise plan, and the gradual addition of raw and whole foods to daily menu plans. This three-week regimen forms the cornerstone of Montel?s successful dietary health plan. Also included are simple, wholesome recipes that are as healthful as they are delicious. For anyone who wants to fight obesity, cancer, heart disease, and neurological diseases like Parkinson?s, Alzheimer?s, or multiple sclerosis?or if they just want to feel spectacular every day?it?s time to push life to the next level, by Living Well with Montel!",
        "Category": " Health & Fitness , Healthy Living",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2008"
        }
    },
    {
        "Title": "The Better Brain Book: The Best Tool for Improving Memory and Sharpness and Preventing Aging of the Brain",
        "Authors": "By Colman, Carol and Perlmutter, David, M.D.",
        "Description": "From the author of the #1 New York Times bestseller Grain Brain and New York Times bestseller Brain Maker...Loss of memory is not a natural part of aging—and this book explains why.Celebrated neurologist David Perlmutter reveals how everyday memory-loss—misplacing car keys, forgetting a name, losing concentration in meetings—is actually a warning sign of a distressed brain. Here he and Carol Colman offer a simple plan for repairing those problems, clarifying misconstrued connections between memory loss and aging, and regaining and maintaining mental clarity by offering the tools for:Building a better brain through nutrition, lifestyle changes, and brain workoutsCoping with specific brain disorders such as stroke, vascular dementia, Alzheimer's, Parkinson's, multiple sclerosis, and Lou Gehrig's diseaseUnderstanding risk factors and individually tailoring a diet and supplementary programFeatures a \"Life Style Audit,\" quizzes, a brain fitness program with the most effective ways to exercise your brain, and a nutritional program that details the best brain food and supplements.",
        "Category": " Science , Life Sciences , Neuroscience",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "The Everything Baby's First Year Book: Complete Practical Advice to Get You and Baby Through the First 12 Months",
        "Authors": "By Nee, T. S.",
        "Description": "The first twelve months of your child's life can be as challenging as they are rewarding. From birth through baby's first birthday, this revised edition guides you through all the critical milestones, focusing on such topics as:Breastfeeding and bottle-feedingPreparing food, including organic options and food allergiesTracking baby's developmentTraveling with babyChoosing safe toys and games This edition includes completely new material on:Baby sign languageJuggling parenting and a careerBottle safetyMaking your own baby foodPlaygroupsThe latest research on vaccines This guide also includes updated medical information, a detailed explanation of baby gear (what parents really need, and what they don't), and a new chapter on returning to work. You will reach for this valuable resource time and again as you make your way through these exciting months with your beautiful new baby!",
        "Category": " Family & Relationships , Life Stages , Infants & Toddlers",
        "Publisher": "Adams Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Great Short Poems (Dover Thrift Editions)",
        "Authors": "By Negri, Paul (EDT)",
        "Description": "This outstanding anthology of short verse offers poetry lovers an impressive sampling of more than 150 masterpieces spanning over 400 years of English and American literary history. Although short in length (the longest are 24 lines, most 16 lines or less), these poems are long on beauty, power, imagination, and originality.Included are such memorable compositions as John Donne's \"Death Be Not Proud,\" Shakespeare's \"When, in Disgrace with Fortune and Men's Eyes,\" \"On His Blindness\" by John Milton, William Blake's \"The Tyger,\" Wordsworth's \"I Wandered Lonely as a Cloud,\" Byron's \"She Walks in Beauty,\" Shelley's \"Ozymandias,\" as well as works by Alfred Lord Tennyson, Walt Whitman, Emily Dickinson, Gerard Manly Hopkins, Amy Lowell, William Butler Yeats, Robert Frost, Edna St. Vincent Millay, Langston Hughes, Dylan Thomas, Paul Laurence Dunbar, and many others.Attractive and inexpensive, this compilation of carefully chosen verse contains many of the most loved, most anthologized poems in the English language. Students, teachers, and any lover of great poetry will treasure this splendid collection. Includes \"The Road Not Taken,\" \"Loveliest of Trees,\" and \"Ozymandias.\"",
        "Category": " Poetry , Anthologies (multiple authors)",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "Red Carpet Suicide: A Survival Guide on Keeping Up With the Hiltons",
        "Authors": "By Hilton, Perez and Shapiro, Jared",
        "Description": "The creator of the celebrity blog PerezHilton.com presents a hilarious satire of today's insane, celebrity-driven, pop-culture world as he offers offbeat advice on how to become a celebrity oneself.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Celebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "Escape the Night: A Novel",
        "Authors": "By Patterson, Richard North",
        "Description": "\"Intricate . . . Intelligent and menacing.\" The Boston GlobeBy the bestselling author of \"Degree of Guilt,\" an inescapable tale of suspense, scandal, and shock too terrifying to put aside as it draws you into its vortex of unforgettable characters and shattering events.Peter Carey is the son of privilege -- and an heir to terror. Poised on the brink of power over a mighty family dynasty, he is also the victim of a recurring nightmare that suddenly becomes all too real. The twisted force that had claimed his parents many years before now stalks him too. But the key to his survival lies locked deep in Peter's own mind. And he must discover it before the final night closes in. . .",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1986"
        }
    },
    {
        "Title": "A Whole New Mind: Moving from the Information Age to the Conceptual Age",
        "Authors": "By Pink, Daniel H.",
        "Description": "Look out for Daniel Pink’s new book, When: The Scientific Secrets of Perfect TimingLawyers. Accountants. Radiologists. Software  engineers. That's what our parents encouraged us to become when we grew up. But Mom and Dad were wrong. The future belongs to a very different kind of person with a very different kind of mind. The era of \"left brain\" dominance, and the Information Age that it engendered, are giving way to a new world in which \"right brain\" qualities-inventiveness, empathy, meaning-predominate. That's the argument at the center of this provocative and original book, which uses the two sides of our brains as a metaphor for understanding the contours of our times.In the tradition of Emotional Intelligence and Now, Discover Your Strengths, Daniel H. Pink offers a fresh look at what it takes to excel. A Whole New Mind reveals the six essential aptitudes on which professional success and personal fulfillment now depend, and includes a series of hands-on exercises culled from experts around the world to help readers sharpen the necessary abilities. This book will change not only how we see the world but how we experience it as well.",
        "Category": " Psychology , Creative Ability",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "7.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "What Would MacGyver Do?: True Stories of Improvised Genius in Everyday Life",
        "Authors": "By Vaughan, Brendan",
        "Description": "A clever collection of true stories celebrating real-life ?MacGyverisms? For anyone who?s ever wished they could channel 1980s action-adventure icon Angus MacGyver?a secret agent known for relying on his brains, scientific prowess, duct tape, and a Swiss Army knife to save the day?this unique collection commemorates the use of improvised genius in everyday life. The ?MacGyverisms? recounted range from the concrete (using Chex Mix to provide traction in an icy parking lot) to the intangible (saving a relationship with the perfect turn of phrase). Divided by theme, the book features over forty true accounts in all?some by well-known writers, including Chuck Klosterman and A. J. Jacobs, most by ordinary people. Edgy, entertaining, and smirk-to-yourself funny, these masterfully told stories reveal that, with a little luck and a lot of ingenuity, you can ?MacGyver? yourself out of virtually any predicament.",
        "Category": " Humor , Form , Essays",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "Christopher Lowell's If You Can Dream It, You Can Do It!: Dream Decor on a Budget",
        "Authors": "By Lowell, Christopher",
        "Description": "Emmy award-winning author Christopher Lowell is back with his second groundbreaking book, ready to inspire his millions of fans with hundreds of ideas that can transform their homes—and their lives. With his first book, Christopher Lowell’s Seven Layers of Design, Lowell introduced design basics layer by layer, demystifying and reassuring the first-time home decorator. Now he takes the process one step further, encouraging readers to discover their own hearts’ desires so they can turn their dreams into unique realities.Taking us by the hand, Lowell starts with his own experiences of self-discovery as a guide for the dreaming process. Next he provides a questionnaire that helps you identify your own sources of pleasure and fulfillment. Finally, he illustrates the process with exciting design projects built on particular themes. The longing to entertain friends in a cozy cocktail room transforms an awkward space into a “Martini Lounge”; dreams of living by the seashore become “Coastal Living”; the desire for travel and theatrical surroundings informs “Moroccan Mystique”; and a nostalgia for the mid-twentieth century finds its creative expression in “Retro Chic.” Each of these imaginative rooms not only expresses the creative spirit, but also feeds the soul.As Lowell explains it, no matter what your budget, no matter what your talents, if you begin to understand the relationship between the interior of your mind and the interior of your home, you can create beauty in both. The sense of satisfaction promised by a home that you yourself decorated is not beyond your reach or your budget, if you follow the simple steps of America’s favorite design guru.",
        "Category": " House & Home , Do-It-Yourself , General",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "Victoria: Intimate Home: Creating a Private World",
        "Authors": "By Victoria (New York, N. Y.)",
        "Description": "An illustrated collection of home decorating secrets from the editors of Victoria magazine includes interviews with homeowners and insights from Charlotte Bronte+a5, Henry James, and other great writers. 50,000 first printing. $25,000 ad/promo.",
        "Category": " House & Home , Decorating",
        "Publisher": "Hearst",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "The Chosen Sin",
        "Authors": "By Bast, Anya",
        "Description": "A sensuous and lust-filled otherworld?from a ?sinfully hot?( Ilona Andrews, author of Magic Bites) bestselling author. The Chosen are vampires fighting for their very existence. It is Daria Morris?s destiny to become one of them? Daria is a special forces agent with one obsession: to wreak vengeance on the vampire who nearly destroyed her. But to succeed, she must become something she detests: a vampire. Her fate rests upon Alejandro Martinez, a sexy vampire with whom she once shared an unforgettable night of scorching passion. Now, while Daria struggles against her newfound bloodlust, the two must slip into the shadows to bring a monster to justice?even as their desire threatens to consume them?",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Ultimate Stencils",
        "Authors": "By Wilson, Althea",
        "Description": "Gives instructions for using innovative stencil designs--from Portuguese tiles to sea creatures, printed for easy copying from the book--to create decorative themes on walls, furniture and fabrics",
        "Category": " Crafts & Hobbies , Stenciling",
        "Publisher": "Harmony",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Stylish Storage: Simple Ways to Contain Your Clutter",
        "Authors": "By Gilchrist, Paige",
        "Description": "Find functional and tasteful ways to organize clutter and make everything from papers to out-of-season clothes quickly accessible.  Banish the confusion with fresh, attractive projects for every room.  Salvage and transform old furniture into \"junk holders.\"  Stash CDs in a library card catalog. Turn shiny metal trash cans into laundry bins, or a crate fashioned with casters into a mobile bookshelf. \"Clever, creative ideas for solving storage problems will make this book valuable.\"--Library Journal.",
        "Category": " House & Home , General",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "6.07",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Bringing Up Geeks: How to Protect Your Kid's Childhood in a Grow-Up-Too-Fast World",
        "Authors": "By Hicks, Marybeth",
        "Description": "A breakthrough parenting book that redefines the meaning of ?geek??and inspires parents to free themselves and their kids from the ?culture of cool.? In a world of superficial values, peer pressure, and out-of-control consumerism, the world needs more GEEKs: Genuine, Enthusiastic, Empowered Kids. Today?s ?culture of cool? has changed the way kids grow up. Rather than enjoying innocent childhoods while developing strong, authentic characters, today?s kids can become cynical?even jaded?as they absorb the dangerous messages and harmful influences of a dominant popular culture that encourages materialism, high-risk behaviors, and a state of pseudo-adulthood. Author and mother of four Marybeth Hicks suggests an alternative: bringing up geeks. In this groundbreaking book, she shows parents how they can help their children gain the enthusiasm to pursue their passions, not just the latest fashions; the confidence to resist peer pressure and destructive behaviors; the love of learning that helps them excel at school and in life; and the maturity to value family as well as friends, as well as make good moral decisions. With a foundation like that, kids will grow up to be the coolest adults.",
        "Category": " Family & Relationships , Parenting , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2008"
        }
    },
    {
        "Title": "Decorating with Tile",
        "Authors": "By Wills, Margaret Sabo",
        "Description": "Decorating with Tile is the homeowner's guide to the many possibilities of tile. The book gives a brief look at the history of tile because it has ancient practical and decorative applications.Decorating with Tile also presents different types, styles, designs, and makers of tile through to present day. Readers will appreciate why tile is still an ideal decorating material for today's homes. Through beautiful four-color photos, they will not only be able to see many examples of various tiles, which will help with their decorating decisions, but will also learn how to choose the right type of tile for interior or exterior use. Kitchens and baths, the two most common rooms where a homeowner installs tile, are discussed in individual chapters. One-of-a-kind handmade and hand-painted craft tiles, both very popular and sought after in today's market, are also presented as a creative option in design and decorating. A final section provides helpful tips for successful planning. A glossary of tile terms and information on maintaining and cleaning tile are also included.",
        "Category": " Architecture , Interior Design , General",
        "Publisher": "Creative Homeowner",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    },
    {
        "Title": "The Science of Heroes: The Real-Life Possibilities Behind the Hit TV Show",
        "Authors": "By Carts-powell, Yvonne",
        "Description": "A fun, fact-filled examination of the science (or lack thereof) behind the hit television series Heroes. Ordinary people with extraordinary powers populate the world of the hit television show Heroes, where characters exhibit such abilities as flight, telepathy, tissue regeneration, prognostication, invisibility, and teleportation through space and time. The Science of Heroes explores these superpowers and many more through real-world research into the potential of human physical and mental capabilities. Citing the work of renowned scientists and engineers, Yvonne Carts-Powell reveals that even the least likely of powers has been studied?and in some cases, even developed. From the wonders found in nature and cutting-edge technological achievements to the latest discoveries in genetics and mutations, humanity might just possess the knowledge to achieve the extraordinary.",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "Royal Harlot: A Novel of the Countess Castlemaine and King Charles II",
        "Authors": "By Scott, Susan Holloway",
        "Description": "London, 1660: Ready to throw off a generation of Puritan rule, all England rejoices when Charles Stuart returns to reclaim the throne. Among those welcoming him is young Barbara Villiers Palmer, a breathtaking Royalist beauty whose sensuality and clever wit instantly captivate the handsome, jaded king. Though each is promised to another, Barbara soon becomes Charles's mistress and closest friend, and the uncrowned queen of his bawdy Restoration court. Rewarded with titles, land, and jewels, she is the most envied and desired woman in England--and the most powerful. But the role of royal mistress is a precarious one, and Barbara's enemies and rivals are everywhere in the palace.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "Blue Grit: Making Impossible, Improbable, and Inspirational Political Change in America",
        "Authors": "By Flanders, Laura",
        "Description": "Noted political commentator Laura Flanders investigates the state of American politics from the bottom up With her trademark wit and indefatigable reporting, Laura Flanders, host of RadioNation and bestselling author of Bushwomen: Tales of a Cynical Species, reveals as only she can the state of progressive America today. All over the country, grassroots organizations are making a difference, and democrats of all stripes are doing what the national party has failed to do: engage new voters, advance progressive issues, and even run their own candidates for office?and win?in some of the most unlikely places. With a fiery polemic, assured narrative, and acute political commentary, Blue Grit is crucial reading for anyone interested in the future of the Democrats?and this country.",
        "Category": " Political Science , Political Process , Political Parties",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "8 Minute Meditation: Quiet Your Mind. Change Your Life.",
        "Authors": "By Davich, Victor N.",
        "Description": "In recent years, mainstream Americans have begun to come around to meditation in a big way-and scientific studies are suggesting that the physical and mental benefits are solid and real. But to many, it remains something mystical and inaccessible...and spiritually-oriented tomes on the market don't do much to make it easier.  As interest in meditation continues to grow, this book offers a simple, no-nonsense program to help beginners experience reduced stress and increased focus in only eight minutes a day. Designed by meditation expert and bestselling author Victor Davich, this program teaches the basic principles of meditation while clearing up the misconceptions and myths that too often get in the way.",
        "Category": " Body, Mind & Spirit , Mindfulness & Meditation",
        "Publisher": "Perigee Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "Step-by-Step Sewing Course: Essential Techniques for Making Over 150 Creative Home Projects",
        "Authors": "By Hemingway, Karen",
        "Description": "More than 450 full-color illustrations and photographs highlight an easy-to-follow introduction to sewing techniques that furnishes detailed step-by-step instructions for more than 150 creative sewing projects for the home--including curtains, pillows, throws, furniture coverings, home decorations, and other handmade items--as well as basic skills and stitches and lists of materials.",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Reader's Digest",
        "Price Starting With ($)": "7.25",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Bled Dry (Vegas Vampires, Book 3)",
        "Authors": "By McCarthy, Erin",
        "Description": "Hooking up with a vampire has its risks-but getting pregnant usually isn't one of them. Tell that to Brittany Baldizzi, who finds herself in the family way with no father in sight. After their one night of passion, vampire Corbin Jean Michel disappeared off the face of the earth-or at least off the Vegas strip. Corbin is a vampire with a cause, secretly trying to find a cure for his condition. But when he finds out Brittany is pregnant with his child, Corbin can't keep his paternal instincts from trumping his bloodsucking ones. Even when showing his hand could cost him the woman he can't help but love.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley Sensation",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Christmas Happy & Bright (The \"I can do that\" books)",
        "Authors": "By Carol Field Dahlstrom",
        "Description": "",
        "Category": "",
        "Publisher": "Brave Ink Press",
        "Price Starting With ($)": "5.79",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "Murder at the National Gallery (Capital Crimes)",
        "Authors": "By Truman, Margaret",
        "Description": "“Powerful . . . Fascinating . . . Truman absolutely amazes.”—Atlanta Journal & ConstitutionWhen the senior curator at Washington's famed National Gallery finds a missing painting by the Renaissance master Caravaggio, he mounts a world-class exhibition—and plots a brilliant forgery scheme that will stun the art world.“A thrilling chase.”—Publishers WeeklyBut an artful deception suddenly becomes a portrait of blackmail and murder—as gallery owner and part-time sleuth Annabel Reed-Smith and her husband go searching for clues in the heady arena of international art and uncover a rare collection of unscrupulous characters that leads all the way to Italy.“Highly recommended . . . One of [Margaret] Truman's best.”—Booklist",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1997"
        }
    },
    {
        "Title": "Interred with Their Bones",
        "Authors": "By Carrell, Jennifer Lee",
        "Description": "INTERNATIONAL BESTSELLER“A feverishly paced action adventure” (The New York Times) about a long-lost Shakespeare work and a killer who reenacts the Bard’s most bloody murders On the eve of the Globe’s production of Hamlet, Shakespeare scholar and theater director Kate Stanley’s eccentric mentor Rosalind Howard gives her a mysterious box, claiming to have made a groundbreaking discovery. Before she can reveal it to Kate, the Globe is burned to the ground and Roz is found dead—murdered in the strange manner of Hamlet’s father. Inside the box, Kate finds the first piece in a Shakespearean puzzle, setting her on a deadly, high-stakes treasure hunt. From London to Harvard to the American West, Kate races to evade a killer and solve a tantalizing string of clues hidden in the words of Shakespeare, which may unlock one of history’s greatest secrets. But Kate is not alone in this hunt, and the buried truth threatens to come at the ultimate cost.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Plume",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "Flat-Out Sexy (Fast Track)",
        "Authors": "By McCarthy, Erin",
        "Description": "?One of the romance writing industry?s brightest stars?(Romance Reviews Today) returns with a flat-out delightful, new, and sexy contemporary romance about a woman who?s happy being single?and the man determined to change her mind. Independent single mother Tamara Briggs wanted to find a new, sexy, no-strings-attached man?just not one as young as NASCAR driver Elec Monroe. But he sure does get her heart racing. And after she?s tricked into a blind date with him, Tamara gives in to her passion. Things screech to a halt, though, when he asks to meet her children. Whatever happened to wham-bam-thank-youma?am? Suddenly Tamara has to decide how much risk she?s willing to take to experience the power of true love.",
        "Category": " Fiction , Romance , Erotica",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "Simply Sparkling Christmas Beading: Over 35 Beautiful Beaded Decorations and Gifts",
        "Authors": "By Wood, Dorothy",
        "Description": "",
        "Category": " Crafts & Hobbies , Beadwork",
        "Publisher": "David & Charles",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2007"
        }
    },
    {
        "Title": "Better Homes and Gardens Low-Fat Meals",
        "Authors": "By",
        "Description": "Collects recipes for delicious, low-fat dishes such as entrees, salads, and desserts, explains the relationship between fat, cholesterol, and health, and includes a chart showing fat and cholesterol content of a variety of foods",
        "Category": " Cooking , Health & Healing , Low Fat",
        "Publisher": "Meredith Corporation",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Perennials: A Photographic Guide to More than 1,000 Plants",
        "Authors": "By Hawthorne, Linden and Parker, Helen (EDT)",
        "Description": "A large-format photographic handbook illustrates and describes more than one thousand perennial plants for the garden, with special sections on garden design, cultivation and plant maintenance tips, plant selection advice, and sections organized by size, season of bloom, and flower color.",
        "Category": " Gardening , Flowers , Perennials",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "7.72",
        "Publish Date": {
            "Month": "February",
            "Year": "2000"
        }
    },
    {
        "Title": "The Edge of Impropriety (Signet Eclipse)",
        "Authors": "By Rosenthal, Pam",
        "Description": "Break the sensual boundaries of Regency England with the bestselling author of The Slightest Provocation. The ribald private life of novelist Countess Marina Wyatt is the stuff of public scandal?and it doesn?t hurt the sale of her romances either. But she?s totally unprepared for her consuming new affair with Jasper James Hedges, noted art appraiser and her former lover?s uncle. In Marina, Jasper sees a work of art of another kind. And for all of Marina?s passionate inventions, nothing can compare to what Jasper delivers?an erotic and dangerous voyage to the edge of impropriety and beyond.",
        "Category": " Fiction , Romance , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2008"
        }
    },
    {
        "Title": "The Storm (The Sons of Destiny, Book 6)",
        "Authors": "By Johnson, Jean",
        "Description": "Sixth book in the must-read series from a national bestselling ?fresh new voice in fantasy romance.?( Robin D. Owens) Eight brothers, born in four sets of twins, two years apart to the day?they fulfill the Curse of Eight Prophecy. Though no longer trapped in exile, their growing family faces new problems. Now Rydan, the tormented sixth-born son, must find a way to trust his Destined bride, Rora, a woman who possesses her own secret power?one that could bring them together or annihilate their world forever.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "A Contract with the Earth: Ten Commitments You Can Make to Protect the Environment Now",
        "Authors": "By Gingrich, Newt and Maple, Terry L.",
        "Description": "A bold rallying cry for conservative environmental leadership. Appealing to America?s core conservative readership and defying conventional thinking, former Speaker of the House Newt Gingrich and eminent conservationist Terry L. Maple posit that the values of conservative America are aligned with the principles of conservation and ?entrepreneurial environmentalism.? Saving the earth is not?and cannot be?a partisan issue. The authors outline a ten-point Contract with the Earth that promotes ingenuity over rhetoric, maintaining that the expansion of ?green business,? new technologies, and environmental economic incentives will be the defining opportunities for the leaders of the next generation. An inspiring call to action, A Contract with the Earth offers a vision of the future that is both hopeful and achievable.",
        "Category": " Nature , Environmental Conservation & Protection",
        "Publisher": "Plume",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Treasures from Bible Times",
        "Authors": "By Millard, Alan R.",
        "Description": "Describes archaeological discoveries in the Holy Land and considers whether these ruins and antiquities support the reliability of Biblical texts",
        "Category": " Religion , General",
        "Publisher": "Chariot Victor Pub",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "March",
            "Year": "1985"
        }
    },
    {
        "Title": "Do You!: 12 Laws to Access the Power in You to Achieve Happiness and Success",
        "Authors": "By Simmons, Russell and Morrow, Chris",
        "Description": "A prominent hip-hop entrepreneur draws on the experiences and life lessons from his successful career to counsel readers on how to achieve personal and professional happiness and empowerment, in a guide that features such wisdom as \"Never change for the mainstream\" and \"There aren't any failures in life, just quitters.\"",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Gotham",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Power of Love",
        "Authors": "By McCarthy, Erin, Foster, Lori, Blake, Toni, and Castell, Dianne",
        "Description": "Twelve all-new stories of women's resilience, empowerment, and fulfillment, by bestselling and award-winning authors.In this engaging anthology of never-before published stories, twelve authors are united by their unique visions of the female experience. A young woman is torn between the security of her fiancé and the excitement of an old flame; a desperate wife is forced into the workplace for the first time in her life; an ambitious professional woman finally finds the courage to take control of her career; and her man; an emotionally fragile divorcee finds resolve in the ethereal visitations of an archangel...These are just some of the women who discover and rediscover their own wonderfully fallible but ultimately strong selves in the shadow of love, romantic love, platonic love, new love, and lost love. Readers will be touched, inspired, charmed, and entertained by these original stories of disparate longings, unsettled lives, and the power of love.Includes 12 stories by New York Times Bestselling Author Lori Foster and Erin McCarthy, Toni Blake, Dianne Castell, Karen Kelley, Rosemary Laurey, Janice Maynard, LuAnn McLane, Lucy Monroe, Patricia Sargeant, Kay Stockham, and J.C. Wilder.A PORTION OF THE PROCEEDS FROM THE POWER OF LOVE GOES TO THE BATTERED WOMEN’S SHELTER OF CINCINNATI",
        "Category": " Fiction , Romance , Collections & Anthologies",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Ark Angel (Alex Rider Adventure)",
        "Authors": "By Horowitz, Anthony",
        "Description": "Alex Rider will soon be a star in his very own TV series! Alex Rider is an orphan turned teen superspy who's saving the world one mission at a time—from #1 New York Times bestselling author! The sniper’s bullet nearly killed him. But Alex Rider managed to survive . . . just in time for more trouble to come his way. When kidnappers attempt to snatch a fellow patient from the exclusive hospital where Alex is recovering, he knows he has to stop him. But the boy he saves is no ordinary patient: He is the son of Nikolai Drevin, one of the richest men in the world. The eccentric billionaire has been targeted by Force Three, a group of eco-terrorists who claim his project Ark Angel—the first luxury hotel in outer space—is a danger to the environment. Soon Alex discovers that Force Three will stop at nothing to destroy Ark Angel, even if it means sending four hundred tons of molten glass and steel hurtling down to Earth and killing millions . . . unless Alex can stop them.From the author of Magpie Murders and Moriarty.",
        "Category": " Young Adult Fiction , Action & Adventure , General",
        "Publisher": "Puffin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "The Sisterhood: A Novel",
        "Authors": "By Palmer, Michael",
        "Description": "“A suspenseful page-turner . . . jolts and entertains the reader.”—Mary Higgins ClarkInside Boston Doctors Hospital, patients are dying. In the glare of the operating room, they survive the surgeon's knife. But in the dark, hollow silence of the night, they die. Suddenly, inexplicable, horribly. A tough, bright doctor will risk his career—his very life—to unmask the terrifying mystery. A dedicated young nurse unknowingly holds the answer. Together they will  discover that no one is from . . . the sisterhood“Teriffic . . . a compelling suspense tale.”—Clive Cussler",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1991"
        }
    },
    {
        "Title": "Hitler's Empire: How the Nazis Ruled Europe",
        "Authors": "By Mazower, Mark",
        "Description": "Drawing on an unprecedented range and variety of sources, Hitler's Empire demands that we face the full implications of Hitler's takeover of Europe. Using twentieth-century technology to achieve nineteenth-century goals, Germany's forces achieved, in just a few years, the astounding domination of a landmass and population larger than that of the United States. Control of this vast territory was supposed to provide the basis for Germany's rise to unquestioned world power. Eastern Europe was to be the Reich's Wild West, transformed, pacified and civilized by massacre and colonial settlement. Western Europe was to provide the economic resources that would knit an authoritarian and racially cleansed continent together. But the brutality and short-sightedness of Nazi politics lost what German arms had won and brought their equally rapid downfall.Throughout this book are fascinating, chilling glimpses of the world that might have been. The genocide of the Jews was the harbinger of more killing ahead: Russians, Poles and other ethnic groups would have been slaughtered or enslaved en masse. Germans would have been settled upon now empty lands as far east as the Black Sea-the new \"Greater Germany.\" Europe's treasuries would have been systematically sacked, its great cities ransacked and recast as dormitories for forced laborers when they were not deliberately demolished. As dire as all this sounds, it was no more than the planned extension of what actually happened in Europe under Nazi rule, as recounted in this authoritative, absorbing account.",
        "Category": " History , Europe , Germany",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "Anxiety & Panic Attacks: Their Cause and Cure",
        "Authors": "By Handly, Robert and Neff, Pauline",
        "Description": "Now, at last, there's a simple, easy-to-follow method for reducing the anxiety and panic attacks that feel like they are taking over your life. Developed by a renowned stress management consultant who has been there himself, you will discover the simple five-step prgram that will help you, conquer fear, reduce or eliminate anxiety, end stress-related illness, and change bad habits, and more--all without drugs or expensive therapy. You don't have to suffer anymore--join the countless number of people who have been helped by Robert Handly's LIFE-PLUS PLAN--starting right now!\"Readable and timely, this is an important self-help book in our stressful times.\"Booklist",
        "Category": " Self-help , Mood Disorders",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1987"
        }
    },
    {
        "Title": "Christ the Lord: Out of Egypt: A Novel",
        "Authors": "By Rice, Anne",
        "Description": "Having completed the two cycles of legend to which she has devoted her career so far, Anne Rice gives us now her most thoughtful and powerful book, a novel about the childhood of Christ the Lord based on the gospels and on the most respected New Testament scholarship.The book’s power derives from the passion its author brings to the writing, and the way in which she summons up the voice, the presence, the words of the young Jesus who tells the story.From the Hardcover edition.",
        "Category": " Fiction , Religious",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Invasion of Earth",
        "Authors": "By Harrison, Harry",
        "Description": "",
        "Category": "",
        "Publisher": "Ace",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1983"
        }
    },
    {
        "Title": "Her Majesty's Wizard (A Wizard in Rhyme)",
        "Authors": "By Stasheff, Christopher",
        "Description": "A rollicking tale by the author of We Open on VenusMatt didn’t know the scrap of parchment was a trap. So he read the runes—and found himself on a world where reciting verses worked magic. His first effort got him locked in a dungeon by the evil sorcerer Malingo. Trying for light, he brought forth a fire-breathing, drunken dragon, who told him Princess Alisande, rightful ruler, was also held in the dungeon.Naturally, he had to free her, himself, and the dragon, using poetry lifted from Shakespeare. And because she was young and beautiful, he swore to serve as her wizard. Then he learned that his job as wizard was to fix it so the three of them could overcome all the dark magic and armies of Malingo!The addition to the party of a lust witch and a priest who became a werewolf now and then didn’t seem much help. Matt figured he had got himself into quite a predicament.For once, he was right!",
        "Category": "",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1986"
        }
    },
    {
        "Title": "Left To Die (An Alvarez & Pescoli Novel)",
        "Authors": "By Jackson, Lisa",
        "Description": "The First Selena Alvarez/Regan Pescoli Novel!Nothing's More Terrifying.  .  .One by one, the victims are carefully captured, toyed with, then subjected to a slow and agonizing death. Piece by piece, his exquisite plan takes shape. The police can't yet see the beauty in his work--but soon, very soon, they will.  .  .Than Being Left Alone.  .  .In the lonely woods around Grizzly Point, Montana, four bodies have been discovered. Detectives Selena Alvarez and Regan Pescoli have been hoping for a career-making case, but this is a nightmare. Even with the FBI involved, Selena and Regan have nothing to go on but a killer's cryptic notes, and the unsettling knowledge that there is much worse to come.  .  .To Die.  .  .When Jillian Rivers opens her eyes, she's trapped in a mangled car. Then a stranger, claiming to be a trail guide named Zane McGregor, pries her free. Though she's grateful, something about him sets Jillian on edge. And if she knew what lay out there in the woods of Montana, she'd be truly terrified. Because someone is waiting.  .  .watching.  .  .poised to strike and make Jillian the next victim.  .  .",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2008"
        }
    },
    {
        "Title": "The Lion in Autumn: A Season with Joe Paterno and Penn State Football",
        "Authors": "By Fitzpatrick, Frank",
        "Description": "Follows Penn State's Nittany Lions and their famous coach, Joe Paterno, through the 2004 season, describing their efforts to achieve grades as well as wins, documenting their fundraising attempts, and offering insight into the accusations of misconduct that have compromised Paterno's reputation. Reprint.",
        "Category": " Sports & Recreation , Football",
        "Publisher": "Gotham",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2006"
        }
    },
    {
        "Title": "Stick to Drawing Comics, Monkey Brain!: Cartoonist Explains Cloning, Blouse Monsters, Voting Machines, Romance, Monkey G ods, How to Avoid Being Mistaken for a Rodent, and More",
        "Authors": "By Adams, Scott",
        "Description": "Everyone knows Scott Adams, the creator of Dilbert, as the king of workplace humor. His insights into the crazy world of business have long been on display in his hugely popular comic strip and bestselling books like The Dilbert Principle. But there?s much more to life than work, and it turns out that the man behind Dogbert and the Pointy-Haired Boss has an equally outrageous take on life outside the cubicle. Adams ventures into uncharted territory in this collection of more than 150 short pieces?on everything from lunar real estate to serial killers, not to mention politics, religion, dating, underwear, alien life, and the menace of car singing. He isn?t afraid to confront the most pressing questions of our day, such as the pros and cons of toothpaste smuggling, why kangaroos don?t drive cars, and whether Jesus would approve of your second iPod.",
        "Category": " Business & Economics , Office Management",
        "Publisher": "Portfolio",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2008"
        }
    },
    {
        "Title": "A Gift from Brittany: A Memoir of Love and Loss in the French Countryside",
        "Authors": "By Price, Marjorie",
        "Description": "Documents the author's socially controversial decision to travel alone to Paris in 1960, her efforts to develop herself artistically, and her whirlwind marriage to a volatile painter whose impulsive relocation to a rustic hamlet in southern Brittany gave way to the author's friendship with a wise and illiterate elderly neighbor. 30,000 first printing.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Gotham",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "April",
            "Year": "2008"
        }
    },
    {
        "Title": "The Deportees: and Other Stories",
        "Authors": "By Doyle, Roddy",
        "Description": "A first collection of short works by the author of Paddy Clarke Ha Ha Ha depicts the immigrant experience in contemporary Ireland as reflected in the stories of a father who confronts his prejudices when his daughter brings home a black man, a nine-year-old African boy's first day in a new school, and a nanny who plots against her charge's older sisters.",
        "Category": " Fiction , Short Stories (single author)",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Remix: Making Art and Commerce Thrive in the Hybrid Economy",
        "Authors": "By Lessig, Lawrence",
        "Description": "Argues that future generations are being harmed by a restrictive copyright system that protects corporate interests, in a report that calls for an end of the practice of criminalizing artists who build on the creative works of others and for implementing a collaborative and profitable \"hybrid economy\" that protects both creative and ethical needs. 30,000 first printing.",
        "Category": " Law , Computer & Internet",
        "Publisher": "Penguin Press HC, The",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2008"
        }
    },
    {
        "Title": "The Savage Garden: A Thriller",
        "Authors": "By Mills, Mark",
        "Description": "Young Cambridge scholar Adam Banting is in Tuscany, assigned to write a scholarly monograph about the famous Docci garden—a mysterious world of statues, grottoes, meandering rills, and classical inscriptions. As his research deepens, Adam comes to suspect that buried in the garden’s strange iconography is the key to uncovering a long-ago murder. But the ancient house holds its own secrets as well. And as Adam delves into his subject, he begins to suspect that he is being used to discover the true meaning of the villa’s murderous past.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Berkley",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "Mafia Princess",
        "Authors": "By Giancana, Antoinette and Renner, Thomas C.",
        "Description": "In an autobiography illustrated with family photographs, the daughter of a gangster once the most powerful Mafia boss west of the Mississippi and an award-winning investigative reporter reveal the day-to-day life of a Mafia family",
        "Category": " Political Science , General",
        "Publisher": "Avon Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1985"
        }
    },
    {
        "Title": "Lady of the Roses: A Novel of the Wars of the Roses",
        "Authors": "By Worth, Sandra",
        "Description": "During her short time as a ward in Queen Marguerite's Lancastrian court, fifteen-year-old Isobel has had many suitors ask for her hand, but the spirited beauty is blind to all but Yorkist Sir John Neville. It is nothing short of a miracle when the Queen allows Isobel's marriage to the enemy, albeit at a hefty price.  All around Isobel and John rages a lawless war. It is only their passion that can see them through the bloody siege of London by the Duke of York, the violent madness of Queen Marguerite, and the devolution of Isobel's meek uncle into the Butcher of England. For theirs is an everlasting love that fears not the scratch of thorns, from either the Red Rose or the White.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Miracle: A Novel",
        "Authors": "By Steel, Danielle",
        "Description": "It is New Year’s Eve when the storm of the century hits northern California. In a  quiet neighborhood in San Francisco, amid the chaos of fallen trees and damaged homes,  the lives of three strangers are about to collide.  For Quinn Thompson, what happens  in the storm’s wake will bring down a barrier he has built around himself since his  wife’s death.  For neighbor Maggie Dartman, it will spark friendship at a time when  she needs it most.  And for Jack Adams, a carpenter who will repair Quinn’s and Maggie’ s homes, the storm brings an opportunity: to help two people and to be repaid with  the greatest gift of all. As three lives come together and a unique friendship is  forged, something extraordinary begins to happen…Maggie, still grieving a loss, slowly  comes alive again–and Jack finally shares a painful secret he has hidden for years.   But at the center of the friendship is Quinn.  A man who has scaled heights of success  in business, Quinn is now adrift, waiting as builders put the finishing touches on  his newest passion, a 180-foot yacht he plans to sail around the world.  Looking  back at all he missed with his family while he built his empire, Quinn is consumed  by guilt, focused only on escaping to the sea.  But as his plans near completion,  and his friendship with Maggie begins to change, Quinn faces a choice–between a safe  haven and an adventure of the heart.  The choice he makes will affect other lives  as powerfully as his own.  And it will take him on an extraordinary journey–and into  a second, terrifying storm, one that will bring him danger…or deliverance.   Danielle  Steel brings us miracles big and small–the kind we are blessed with and those we  give to others.  With a subtle hand and a flawless touch, she has written a novel  that soars with hope, and makes us laugh, cry, and care.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Dell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2006"
        }
    },
    {
        "Title": "Beyond the Blonde",
        "Authors": "By Flynn-Hui, Kathleen",
        "Description": "The Devil Wears Prada meets Steel Magnolias in this fictionalized account of the real-life rise of Kathleen Flynn-Hui, star of the hot Manhattan Salon AKS. Welcome to Jean-Luc, New Yorks hottest salon of the minute, where high above Madison Avenue, Georgia Watkinsstar coloristtends to the hair of socialites, actresses, models and moguls.Georgia wasnt born to the Manhattan elite, but she was born to color hair; back in rural New Hampshire, her single mother struggled to pay rent on her own small-town beauty parlor and keep her family afloat. But Georgia wanted more. And so, after a stint at Wilfred Academy, Georgia landed a job at Jean-Luc and moved to New York City. Thrust into a glitzy, glittering over-the-top world, Georgia finds herself highlighting dogs hair to match that of their owners, making house calls to the Hamptons, and barely batting a well-groomed eyelash at a thousand dollar tip. A rising star in the salon, Georgia is far too busy for romance or even a day offuntil she finds that her quiet, handsome colleague Massimo has more to offer than styling pointers.But when Jean-Luc betrays them, Georgia finds her loyalty and her love are put to the test, and she must depend on the most unlikely sources to help her navigate the ugly side of the world of beauty.",
        "Category": " Fiction , General",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2006"
        }
    },
    {
        "Title": "The Wolf (The Sons of Destiny, Book 2)",
        "Authors": "By Johnson, Jean",
        "Description": "The Sons of Destiny series continues in this breathtaking romantic fantasy from a fresh new voice.  Eight brothers, born in four sets of twins, two years apart to the day-they fulfill the Curse of Eight Prophecy. To avoid tempting their destiny, the brothers are exiled to Nightfall Island, where women are forbidden. When a childhood friend seeks refuge among the brothers, it triggers a confrontation with their mysterious enemy.  Alys arrives desperate and afraid, but welcomed by Wolfer, the second-born brother who harbors deep feelings for Alys. But she harbors a secret: her own uncle is tormenting the exiled brothers, and seeks to kill them to secure their ancestral inheritance for himself.  Confessing her uncle's plan to the brothers puts them at even greater risk, for their resistance against the evil mage has stirred his wrath. Alys fears her uncle is determined this time to exterminate the brothers once and for all- destroying the star-crossed lovers as well.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Bond of Blood (Texas Vampires, Book 1)",
        "Authors": "By Whiteside, Diane",
        "Description": "Vampire fiction with a twist-and a touch of Texas heat. First in an exciting new trilogy.  Former Spanish knight Don Raphael Perez has been a vampire for seven centuries, and is now the leader of the largest vampire territory in North America, spanning Texas and Oklahoma. But a rival is challenging his rule. Then he meets veterinarian Grania O'Malley, who's never felt the touch of a man. Raphael has sworn never to initiate a woman into the eternal pleasures of the flesh, but now it may be the only way to save her from his bloodthirsty adversary...",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Unleashed",
        "Authors": "By Monroe, Lucy, Whiteside, Diane, and York, Rebecca (EDT)",
        "Description": "Four leading romance authors bring together a quartet of tales about paranormal passion in an anthology that features Rebecca York's take on the Atlantis myth, Diane Whiteside's story of vampire love, a seductive tale of werewolf love by Lucy Monroe, and Susan Kearney's saga of love on the wild side. Original. 30,000 first printing.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Berkley Trade",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2006"
        }
    },
    {
        "Title": "The Song (The Sons of Destiny, Book 4)",
        "Authors": "By Johnson, Jean",
        "Description": "The fourth installment in the national bestselling Sons of Destiny series. Eight brothers, born in four sets of twins, two years apart to the day-they fulfill the Curse of Eight Prophecy, and are thus exiled to Nightfall Isle, in Jean Johnson's \"thoroughly romantic and wildly entertaining\"* series. Evanor lost his powers-and his voice-in a terrible battle that defeated his family's greatest enemy and gave his sister-in-law her freedom. The advanced magical healing that would restore his voice and powers is beyond their means-but not beyond the ability of the lovely healer Mariel. Mariel can restore what was torn from Evanor-and possibly repair her own broken heart in the process.",
        "Category": " Fiction , Romance , Paranormal , General",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    }
]