[
    {
        "Title": "Fundamentals of Physics, , Problem Supplement No. 1",
        "Authors": "By Halliday, David, Resnick, Robert, and Walker, Jearl",
        "Description": "This supplement to accompany  Fundamentals of Physics, 6th Edition  provides hundreds of fresh problems to instructors for use in their classes. All begin with the basic key idea and then build step-by-step to a solution. Halliday (U. of Pittsburgh), Robert Resnick (Rensselaer Polytechnic Institute), and Jearl Walker (Cleveland State U.) also include a wide range of checkpoint-style, organizing, and discussion questions. Some of the problems involve applied physics, and certain chapters contain clustered problems that involve a common theme or technique, as well as tutorial problems, which demonstrate worked-out solutions and allow students to develop the thought process behind solving physics problems. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Physics , General",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The New Bear in the Woods",
        "Authors": "By Burtch, Susan T.",
        "Description": "",
        "Category": "",
        "Publisher": "Jordan and Company",
        "Price Starting With ($)": "6.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Animal Grossology: The Science of Creatures Gross and Disgusting",
        "Authors": "By Branzei, Sylvia and Keely, Jack (ILT)",
        "Description": "Author Sylvia Branzei and illustrator Jack Keely prove once again that they know what fascinates&150and completely disgusts&150kids of all ages. Learn about slimy creatures, vomit-munchers, bloodsuckers, and unforgettable animal poops. It's an icky concoction of information, but it contains a heaping helping of real and memorable scientific facts. With a perfect-bound spine and all new covers, Animal Grossology is easy to read! And it is perfect timeing, as the Grossology Museum Tour begins this summer.",
        "Category": " Juvenile Nonfiction , Animals , General",
        "Publisher": "Price Stern Sloan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "Canvas Falcons: The Men and the Planes of WW1",
        "Authors": "By Longstreet, Stephen",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "Countering the Urban Influence",
        "Authors": "By Edward DeJesus",
        "Description": "",
        "Category": "",
        "Publisher": "Youth Development and Research Fund",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2005"
        }
    },
    {
        "Title": "California Heritage Continues: A Cookbook",
        "Authors": "By Junior League Pasadena",
        "Description": "This collection of over three hundred recipes captures the distinctive flavors of California cuisine and includes full menus for special occasions and stunning full-color photographs",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "The Mudhole Mystery (The Cul-de-Sac Kids, No. 10) (Book 10)",
        "Authors": "By Lewis, Beverly and Huntington, Janet (ILT)",
        "Description": "Dunkum's persistence in digging out a mysterious object that he discovers in a mudhole yields some interesting information about previous residents in the neighborhood",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Bethany House Publishers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "French Novelists of Today",
        "Authors": "By Henri Peyre",
        "Description": "",
        "Category": "",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "Basic Writing Skills, Grade 4 (Basic Skills)",
        "Authors": "By Wilke, Suzanne Lowe",
        "Description": "Communication is essential in daily life, and writing is an important aspect of communication. Give your fourth graders a solid writing foundation through Basic Writing Skills. The book focuses primarily on teaching students to write sentences effectively. It helps to create confidence with skills such as sentence building, sentence combining, kinds of sentences, story sequence, and writing stories. The fun illustrations will hold your students' interest while the engaging activities teach them to write clearly and concisely. An answer key is also included.",
        "Category": " Juvenile Nonfiction , Language Arts , Composition & Creative Writing",
        "Publisher": "Instructional Fair",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "Activate: An Entirely New Approach to Small Groups",
        "Authors": "By Searcy, Nelson and Thomas, Kerrick",
        "Description": "Church leaders want to know how to make small groups work for their church communities, yet a quick look around shows that while small groups are all the rage, much of the time they create more problems than they solve. Nelson Searcy and Kerrick Thomas, founding pastors of The Journey Church in the heart of New York City, suggest that this failure is due to widely held beliefs about small groups that just aren’t true—and they aim to debunk the myths and set the record straight! Drawing from the startling success of small groups at The Journey Church (which has had over 100-percent participation in small groups for more than 4 years) Searcy and Thomas show how church leaders can implement a life-changing small-group ministry that gets the maximum number of people involved and solves many of the important (yet irritating) problems facing churches of all sizes.",
        "Category": " Religion , Christian Church , Growth",
        "Publisher": "Regal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "Ishmael My Brother: A Christian Introduction to Islam",
        "Authors": "By Cooper, Anne (COM)",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Monarch Publications",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "June",
            "Year": "1993"
        }
    },
    {
        "Title": "Victorian Details: Enhancing Antique and Contemporary Homes with Period Accents",
        "Authors": "By Wissinger, Joanna",
        "Description": "",
        "Category": "",
        "Publisher": "Studio",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1990"
        }
    },
    {
        "Title": "The Missing Books of the Bible ( Volume 1)",
        "Authors": "By Media Solution Service",
        "Description": "",
        "Category": "",
        "Publisher": "Media Solution Services",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2004"
        }
    },
    {
        "Title": "Baltimore With Children",
        "Authors": "By Strzelecki, Mike",
        "Description": "",
        "Category": " Travel , Special Interest , Family",
        "Publisher": "Camino Books Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "In the Shadow of Gotham (Detective Simon Ziele, 1)",
        "Authors": "By Pintoff, Stefanie",
        "Description": "Dobson, New York, 1905.Detective Simon Ziele lost his fiancée in the General Slocum ferry disaster—a thousand perished on that summer day in 1904 when an onboard fire burned the boat down in the waters of the East River. Still reeling from the tragedy, Ziele transferred to a police department north of New York, to escape the city and all the memories it conjured. But only a few months into his new life in a quiet country town, he's faced with the most shocking homicide of his career to date: Young Sarah Wingate has been brutally murdered in her own bedroom in the middle of an otherwise calm and quiet winter afternoon. After just one day of investigation, Simon's contacted by Columbia University's noted criminologist Alistair Sinclair, who offers a startling claim about one of his patients, Michael Fromley—that the facts of the murder bear an uncanny resemblance to Fromley's deranged mutterings.But what would have led Fromley, with his history of violent behavior and brutal fantasies, to seek out Sarah, a notable mathematics student and a proper young lady who has little in common with his previous targets? Is Fromley really a murderer, or is someone mimicking him?This is what Simon Ziele must find out, with the help of the brilliant but self-interested Alistair Sinclair—before the killer strikes again.With this taut, atmospheric, and original story of a haunted man who must search for a killer while on the run from his own demons, Stefanie Pintoff's In the Shadow of Gotham marks the debut of an outstanding new talent, the inaugural winner of the Minotaur Books/Mystery Writers of America Best First Crime Novel Competition.In the Shadow of Gotham is the winner of the 2010 Edgar Award for Best First Novel.",
        "Category": " Fiction , Mystery & Detective , Hard-Boiled",
        "Publisher": "Minotaur Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2010"
        }
    },
    {
        "Title": "Dark Knight: Batman versus the Joker, The",
        "Authors": "By McCaig, Dave (ILT), Raymond, N. T. (ADP), and Stewart, Cameron (ILT)",
        "Description": "He's the most difficult enemy Batman has ever faced. Will Batman be able to defeat the Joker before he puts his master plan into effect?",
        "Category": " Juvenile Fiction , Media Tie-In",
        "Publisher": "Festival",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2008"
        }
    },
    {
        "Title": "I'm Going to Read® (Level 1): Sometimes I Share (I'm Going to Read® Series)",
        "Authors": "By Ziefert, Harriet and Nicklaus, Carol (ILT)",
        "Description": "A little girl sometimes shares with her brother: she gives him half her cookie, lets him play with her toys, and even allows him to ride her bike. But when her friends come over, she doesn't always want him around. What happens then? A delightfully told and illustrated little tale that will evoke giggles even as it makes a valuable point about good behavior.",
        "Category": " Juvenile Nonfiction , Readers , Beginner",
        "Publisher": "Union Square Kids",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2005"
        }
    },
    {
        "Title": "Basic Plumbing: Illustrated",
        "Authors": "By Vandervort, Don (EDT) and Gilberg, Lynne",
        "Description": "A detailed guide to the installation, maintenance, and repair of indoor and outdoor plumbing and connected fixtures",
        "Category": " House & Home , Do-It-Yourself , Plumbing",
        "Publisher": "Sunset Pub Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1992"
        }
    },
    {
        "Title": "A Fine Tops'l Breeze (War of 1812 Trilogy, Volume 2)",
        "Authors": "By White, William H. and Garnet, Paul (ILT)",
        "Description": "Continuing the adventures of the newest character in American sea fiction, Isaac Biggs of Marble head, Massachusetts, this second volume of the trilogy finds Isaac as Third Mate on the Salem privateer General Washington in February 1813. At the same time, his friends from the British frigate Orpheus and the Baltimore schooner Glory find berths on the American warship USS Constellation and, eventually, they wind up on the USS Chesapeake in Boston just in time for her disastrous meeting with HMS Shannon. Throughout the spring of 1813, Isaac and the General Washington roam the waters between Massachusetts and Nova Scotia, taking prizes and harassing the British. When the American survivors of the Chesapeake/Shannon battle are confined in Melville Island Prison in Halifax, the General Washington and Isaac play an important role in securing their freedom.",
        "Category": " Fiction , Sea Stories",
        "Publisher": "Tiller Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2001"
        }
    },
    {
        "Title": "Traitor's Embrace",
        "Authors": "By Dorsey, Christine",
        "Description": "Elizabeth Lancaster, a haughty loyalist, finds herself, against her will, falling in love with Major Alexander Knox, a rebel spy",
        "Category": " Fiction , Romance , Historical",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "March",
            "Year": "1990"
        }
    },
    {
        "Title": "Even Though We're Far Apart",
        "Authors": "By Shannon Hill",
        "Description": "",
        "Category": "",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.44",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Encyclopedia of Mammals",
        "Authors": "By David MacDonald",
        "Description": "",
        "Category": "",
        "Publisher": "Barnes & Noble Books",
        "Price Starting With ($)": "14.44",
        "Publish Date": {
            "Month": "January",
            "Year": "2001"
        }
    },
    {
        "Title": "When Generations Collide: Who They Are. Why They Clash. How to Solve the Generational Puzzle at Work",
        "Authors": "By Lancaster, Lynne C. and Stillman, David",
        "Description": "If your workplace feels like a battle zone and colleagues sometimes act like adversaries, you ore not alone. Today four generations glare at one another across the conference table, and the potential for conflict and confusion has never been greater.Traditionalist employees with their \"heads down, onward and upward\" attitude live out a work ethic shaped during the Great Depression.Eighty million Baby Boomers vacillate between their overwhelming need to succeed and their growing desire to slow down and enjoy life.Generation Xers try to prove themselves constantly yet dislike the image of being overly ambitious, disrespectful, and irreverent.Millennials, new to the workforce, mix savvy with social conscience and promise to further change the business landscape.This insightful book provides hands-on methods to close the generation gaps. With effective tools to recruit, retain, motivate, and manage each generation, you can now create teamwork, not war, in today's highperformance workplace . . . where at any age, productivity is what counts.",
        "Category": " Social Science , Human Services",
        "Publisher": "Harper Business",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Art of Literary Research",
        "Authors": "By Richard D. Altick",
        "Description": "",
        "Category": "",
        "Publisher": "WW Norton & Co",
        "Price Starting With ($)": "12.33",
        "Publish Date": {
            "Month": "April",
            "Year": "1964"
        }
    },
    {
        "Title": "Dunces of Doomsday: 10 Blunders That Gave Rise to Radical Islam, Terrorist Regimes, and the Threat of an American Hiroshima",
        "Authors": "By Williams, Paul L.",
        "Description": "In this right-wing critique of American policy towards the Middle East, the author boldly declares at the outset that the \"enemy\" is \"Islam itself, as expressed by the life and teachings of Muhammad, as witnessed by the sociopolitical and religious movement that the Prophet unleashed against Judeo-Christian civilization, as upheld by contemporary Sunnis and Shi'ites around the world.\" Almost all of his criticisms of past and present US policy flow from this not particularly nuanced idea. Thus the blunders of US policy include the alleged failure of Jimmy Carter to adequately support the Shah of Iran when he was overthrown by the 1979 Islamic revolution, the \"betrayal\" of Saddam Hussein as he fought his war with Iran, the waging of the first Gulf War to protect the Saudis, the ignoring of the possibility of nuclear materials falling into Muslim hands, the siding with Muslims during the Balkan wars, and the failure to crack down on immigrants. Annotation ©2006 Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , Terrorism",
        "Publisher": "WND Books",
        "Price Starting With ($)": "14.39",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Discovering the Hill Towns of Italy",
        "Authors": "By Sims, John Ferro (PHT) and Duncan, Paul",
        "Description": "Describes the history, customs, and cuisines of each region, and shows small towns and rural areas",
        "Category": " Travel , Europe , Italy",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "5.94",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Seven Deadly Sins of Small Group Ministry, The",
        "Authors": "By Donahue, Bill and Robinson, Russ",
        "Description": "It’s one thing to start a small group ministry. It’s another to keep the groups in your church healthy and headed in the same direction. Whatever your church’s approach may be—whether it is a church with groups or of groups—sooner or later, as a leader, you’ll need to do some troubleshooting. That’s when the expert, to-the-point guidance in this book will prove its worth.In The Seven Deadly Sins of Small Group Ministry, what would take you years to learn through trial and error is distilled into some of the most useful information you can find. Drawing on the knowledge they’ve gleaned from working inside Willow Creek Community Church, from consulting with hundreds of churches, and from conducting conferences and seminars worldwide, small group experts Bill Donahue and Russ Robinson furnish you with proven, real-life solutions to the knottiest problems in your small group ministry. This is no theory—it’s hands-on stuff you can read and apply today.The beauty of this book lies in its unique diagnostic process. It allows you to assess, diagnose, and correct seven common “deadly sins” that can drain the life from your church’s small group ministry. Here are the strategies and tools you need to deal with 1. Unclear Ministry Objectives 2. Lack of Point Leadership 3. Poor Coaching Structures 4. Neglect of Ongoing Leadership Development 5. Closed Group Mind-set 6. Narrow Definition of a Small Group 7. Neglect of Assimilation ProcessThe Seven Deadly Sins of Small Group Ministry is indispensable for every small group director, church staff, ministry leader, and senior pastor. It’s strong medicine for the ailments that threaten the small groups in your",
        "Category": " Religion , Philosophy",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Creative Kindness: People and Projects Making a Difference and How You Can, Too",
        "Authors": "By Zieman, Nancy Luedtke and Brown, Gail",
        "Description": "",
        "Category": " Crafts & Hobbies , Sewing",
        "Publisher": "Krause Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "More Kennedy Wit",
        "Authors": "By Kennedy, John F",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam Books",
        "Price Starting With ($)": "14.97",
        "Publish Date": {
            "Month": "October",
            "Year": "1965"
        }
    },
    {
        "Title": "Steaks, Chops, Roasts & Ribs",
        "Authors": "By Cook's Illustrated Magazine (EDT), Burgoyne, John (ILT), Van Ackere, Daniel J. (PHT), and Tremblay, Carl (PHT)",
        "Description": "Presents over three hundred tested recipes for all kinds of meat dishes and a shopping guide for selecting cuts of meat.",
        "Category": " Cooking , Specific Ingredients , Meat",
        "Publisher": "Boston Common Pr",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "American Diplomacy 1900-1950",
        "Authors": "By George F. Kennan",
        "Description": "",
        "Category": "",
        "Publisher": "Mentor Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Creative Paint Finishes for the Home",
        "Authors": "By Myer, Phillip C.",
        "Description": "Provides practical information on surface preparation, painted finish techniques, marbelizing, decorative painting, and finishing methods, and includes decorating designs and a list of supplies",
        "Category": " Crafts & Hobbies , Painting",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.83",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Prefab Elements",
        "Authors": "By McLendon, Sandy and Demetrios, Eames (FRW)",
        "Description": "When you go to Home Depot to look at their ready-made cabinetry, you may not think of it as prefab, but in fact that’s just one example of the many amenities today’s manufacturers offer. Customized amenities provide homeowners comforts they couldn’t afford otherwise and often more economical and environmentally smart ways. Think of luxury bathrooms with multilevel showers or oversized whirlpool tubs, skylights, staircases, ceramic tile and much, much more. Prefab Elements discusses this phenomenon, presenting scores of new materials and items that can be used either in a total prefab environment built from scratch or as individual items in a renovation or redesign. Building on the bestselling success of Prefab Modern, this inspiring book also provides a fascinating history of how the prefab movement really got started and how architects like Frank Lloyd Wright became increasingly involved with early prefab development. A source list and glossary are included to help homeowners get up to speed on this all the new exciting opportunities prefabricated elements offer today.",
        "Category": " House & Home , Remodeling & Renovation",
        "Publisher": "HarperDes",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "The Commonsense Book of Wine",
        "Authors": "By Adams, Leon D.",
        "Description": "A popular wine appreciation guide for the novice and expert, this book is a concise, no-nonsense work that makes sense out of often confusing wine information. From understanding wine labels and making sense of wine rituals to understanding how to apply the methods of expert wine tasters to identify good wine values, this book is the perfect resource for anyone with an interest in wine.",
        "Category": " Cooking , Beverages , Alcoholic , General",
        "Publisher": "Wine Appreciation Guild",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Graphing Technology Guide for Larson/Hostetler/Edwards' Calculus, 6th (Calculus (Houghton Mifflin))",
        "Authors": "By Larson, Ron",
        "Description": "",
        "Category": " Mathematics , Calculus",
        "Publisher": "Cengage Learning",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1998"
        }
    },
    {
        "Title": "Selling What You Make: Profit from Your Handcrafts",
        "Authors": "By Seitz, James E.",
        "Description": "Provides advice, and strategies that will help you reach your intended market, develop a financial plan, obtain licenses and permits, control inventory, and meet IRS tax requirements",
        "Category": " Crafts & Hobbies , Reference",
        "Publisher": "Tab Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1992"
        }
    },
    {
        "Title": "Organizing for the Future: The New Logic for Managing Complex Organizations (Jossey Bass Business & Management Series)",
        "Authors": "By Lawler, Edward E. and Galbraith, Jay R.",
        "Description": "A Leading-Edge Look at Advanced Organizational DesignsContributors from the Center for Effective Organizations: Susan G. Cohen, Gerald E. Ledford, Jr., Morgan W. McCall, Jr., Allan M. Mohrman, Jr., and Susan A. Mohrman.Perhaps the most thorough look at emerging organizational designs and management techniques written to date. Based on research conducted at USC's Center for Effective Organization, this volume tells how to create a company with high levels of employee involvement and identifies revolutionary new management techniques. Knowledge organizations, senior team management, distributed staffs, and virtual networks are among the many forward-looking organizational forms and phenomena explained and explored. Shows precisely how all organizational structures can be aligned to move information, power, knowledge, and rewards downward to maximize performance throughout the organization.",
        "Category": " Business & Economics , Organizational Behavior",
        "Publisher": "Jossey-Bass",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "Millennium Year By Year: A Chronicle of World History from AD 1000 to the Present Day",
        "Authors": "By DK Publishing",
        "Description": "",
        "Category": " History , Reference",
        "Publisher": "DK ADULT",
        "Price Starting With ($)": "9.72",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "English Countryside Needlepoint (A Treasury of Over 50 Original Needlepoint Designs)",
        "Authors": "By Whiteaker, Stafford",
        "Description": "Provides needlepoint patterns featuring gardens, flowers, fish, birds, alphabets, and abstract designs, and demonstrates basic stitches",
        "Category": "",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "African independence",
        "Authors": "By Judd, Peter",
        "Description": "",
        "Category": "",
        "Publisher": "Dell Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1963"
        }
    },
    {
        "Title": "Everything for Early Learning, Grade 2",
        "Authors": "By Douglas, Vincent",
        "Description": "Everything for Early Learning is the perfect practice tool that every second grader needs to achieve success in school! Children work through fun and engaging activities that provide skill-and-drill in important reading, language arts, and mathematical skills. This 320 page workbook is full of bold, appealing illustrations that motivate young learners and features practice pages to ensure children master the essential skills with easy-to-understand directions.Features:~ Problem-solving~ Deductive and analytical thinking~ Fractions~ Counting money~ Main idea~ Facts and opinions~ Nouns and verbs~ Punctuation",
        "Category": " Juvenile Fiction , Concepts , General",
        "Publisher": "American Education Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2004"
        }
    },
    {
        "Title": "That special grace",
        "Authors": "By Bradlee, Benjamin C",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "5.33",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "A Woman and Her God: Life -Enriching Messages Featuring",
        "Authors": "By American Association of Christian Counselors (COR) and Moore, Beth (EDT)",
        "Description": "Many of today's most extraordinary Christian women communicators join together to impart the wisdom God has given them--and to help women realize all God intended for them.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Integrity Pub",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "2003"
        }
    },
    {
        "Title": "The Wild One",
        "Authors": "By John Reese",
        "Description": "",
        "Category": "",
        "Publisher": "Fawcett",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1972"
        }
    },
    {
        "Title": "The Burden is Light: The Autobiography of a Transformed Pagan Who Took God at His Word",
        "Authors": "By Eugenia Price",
        "Description": "",
        "Category": "",
        "Publisher": "Spire",
        "Price Starting With ($)": "13.46",
        "Publish Date": {
            "Month": "October",
            "Year": "1971"
        }
    },
    {
        "Title": "Perfect Vegetables: Part of \"The Best Recipe\" Series",
        "Authors": "By Cook's Illustrated Magazine (EDT)",
        "Description": "Presents more than 350 recipes for a variety of vegetable dishes along with advice on cooking techniques and how to purchase the best vegetables.",
        "Category": " Cooking , Specific Ingredients , Vegetables",
        "Publisher": "America\u0092s Test Kitchen",
        "Price Starting With ($)": "6.95",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Gourmet's Five Ingredients: More Than 175 Easy Recipes for Every Day",
        "Authors": "By Gourmet (EDT)",
        "Description": "Provides recipes for quick and easy to make items, from appetizers to desserts to beverages, and suggests seasonal menus.",
        "Category": " Cooking , Entertaining",
        "Publisher": "Random House",
        "Price Starting With ($)": "6.06",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Family Budget Workbook: Gaining Control of Your Personal Finances",
        "Authors": "By Burkett, Larry",
        "Description": "Tired of bouncing checks, skyrocketing credit, or depletion of your  savints account? Larry Burkett, a respected authority on finances, creates the breakthrough  manual you need to regain control of your personal budget. Burkett offers  practical advice about managing your finances and provides a series of easy-to-follow  worksheets that allow you to structure and maintain your family's budget. As a bonus,  extra worksheets have been included, allowing for use year after year. The  Family Budget Workbook is a sensible, realistic plan that brings your finances  under control. It shows you where to start, how to stay on track, and addresses  special budgeting problems. There's no need to panic at the end close of  every month, wondering where your money went. Proper budgeting will let you know  exactly where the money goes—and keeps it from going where you don't want  it to go!",
        "Category": " Business & Economics , Finance , General",
        "Publisher": "Northfield Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1993"
        }
    },
    {
        "Title": "Intermediate Algebra: Functions & Authentic Applications",
        "Authors": "By Lehmann, Jay",
        "Description": "",
        "Category": " Mathematics , Algebra , Intermediate",
        "Publisher": "Pearson College Div",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Ladies' home journal easy as 1-2-3 family favorites cookbook",
        "Authors": "By \"Ladies' Home Journal\"",
        "Description": "",
        "Category": "",
        "Publisher": "Ladies' Home Journal Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1985"
        }
    },
    {
        "Title": "Golden Book of Amsterdam (Golden Guides)",
        "Authors": "By amsterdam",
        "Description": "",
        "Category": "",
        "Publisher": "Casa Editrice Bonechi",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2009"
        }
    },
    {
        "Title": "When I Met the Wolf Girls",
        "Authors": "By Noyes, Deborah and Hall, August (ILT)",
        "Description": "Two little girls—raised by wolves—have just arrived at the orphanage, and life will never be the same.Based on a true story, this book is about many things at once: family, friendship, and what it means to have a home.",
        "Category": " Juvenile Fiction , People & Places , Asia",
        "Publisher": "HMH Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2007"
        }
    },
    {
        "Title": "Turtles",
        "Authors": "By Roberts, Mervin F.",
        "Description": "",
        "Category": "",
        "Publisher": "TFH Publications",
        "Price Starting With ($)": "15.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Essential Dali (Essential Art)",
        "Authors": "By Bradbury, Kirsten",
        "Description": "",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "7.09",
        "Publish Date": {
            "Month": "April",
            "Year": "2002"
        }
    },
    {
        "Title": "More Decorative Napkin Folding (Dover Craft Books)",
        "Authors": "By Oppenheimer, Lillian and Epstein, Natalie",
        "Description": "\"Shows you how simple it can be to make your table tasteful and sophisticated with napkins. Twenty-two methods are shown in detailed easy to follow step by step drawings. A perfect addition to a gift basket for the young bride and groom.\" — Texas Kitchen and Garden and MoreFor a fun way to turn a good meal into a gala occasion, delight your guests with the special touch of an artistically folded napkin. Besides adding eye-appeal to the table, ingeniously folded napkins will enhance the festivities, serve as conversation starters, and intrigue your guests. Decorative folds also serve such practical uses as holding a place card, silverware, party favor, dinner roll, butter dish or a flower.A rich selection of folds is illustrated in clear step-by-step drawings accompanied by easy-to-follow instructions, beginning with simple folds and proceeding to more elaborate and intricate shapes. A photograph of the finished napkin faces each page of instruction. Choose from 22 attractive folds including: Triple Fold; Tricorn; Tiered Lily; Elegant Simplicity; Sunbonnet Sue; Nut Dish; Silver Holder, Gourmet; Turban; Night Light; Double Jabot; Double Vase; and 10 more.Decorative napkin folding provides the creative host or hostess with a challenge readily and elegantly resolved by following the simple instructions and diagrams. With a bit of practice, you'll soon be delighting family and friends with expert folds that add flair to any table setting.",
        "Category": " Crafts & Hobbies , Papercrafts",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1984"
        }
    },
    {
        "Title": "Taming and Training Cockatoos",
        "Authors": "By Teitler, Risa",
        "Description": "",
        "Category": " Pets , Birds",
        "Publisher": "Tfh Pubns Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1988"
        }
    },
    {
        "Title": "Knitting The New Classics: 60 Exquisite Sweaters From The Studios Of Classic Elite",
        "Authors": "By Nicholas, Kristin",
        "Description": "“Crisp, clear photographs precede charts and schematics, providing an easy-to-follow format. Altogether a wonderful book.”—McCall’s Needlework. “Well represented are Aran, Fair Isle, and multihued patterns for sweaters and coats that can be worn by men or women.”—Booklist. “Libraries should consider this title for even very small knitting collections.”—Library Journal.",
        "Category": " Crafts & Hobbies , Needlework , Knitting",
        "Publisher": "Union Square & Co.",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "June",
            "Year": "1998"
        }
    },
    {
        "Title": "The Modern Reader's Japanese-English Character Dictionary",
        "Authors": "By Nelson, Andrew Nathaniel",
        "Description": "Both old and new forms of characters are presented and arranged under the traditional radical system",
        "Category": " Foreign Language Study , Japanese",
        "Publisher": "Tuttle Pub",
        "Price Starting With ($)": "7.56",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Front Page History of the World Wars: As Reported by the New York Times",
        "Authors": "By Demirjian, Arto and Nelson, Eve",
        "Description": "",
        "Category": "",
        "Publisher": "Arno Press",
        "Price Starting With ($)": "5.76",
        "Publish Date": {
            "Month": "June",
            "Year": "1976"
        }
    },
    {
        "Title": "Dirt on My Shirt",
        "Authors": "By Bjorkman, Steve (ILT) and Foxworthy, Jeff",
        "Description": "In this hilarious collection of poems, comedian Jeff Foxworthy creates a neighborhood filled with fun, family, friends, and more. Here you'll meet Cousin Lizzy, Uncle Ed and Aunt Foo Foo, cows with horns that don't go beep, dads in sweaters, also sheep. From the thrill of flying to the imaginary planet Woosocket to bonding with a friend over a shared hatred of spinach, these poems capture the very essence of being a kid.Filled with sly humor and always affectionate, Dirt on My Shirt is sure to delight kids, big and little, everywhere.",
        "Category": " Juvenile Fiction , Humorous Stories",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Artists of the American West: A Biographical Journey, Vol. 2",
        "Authors": "By Dawdy, Doris Ostrander",
        "Description": "",
        "Category": "",
        "Publisher": "Swallow Press",
        "Price Starting With ($)": "6.26",
        "Publish Date": {
            "Month": "May",
            "Year": "1981"
        }
    },
    {
        "Title": "Hell's Belles",
        "Authors": "By Kessler, Jackie",
        "Description": "Once upon a time, Jezebel was a powerful succubus, capable of seducing men and sucking out their souls. But that was before Hell put a bounty on her head. Now her only chance to escape a fate far worse than death is to live as a mortal, losing herself ina sea of unfamiliar humanity, in a place where the sinners walk hand in hand with saints, a place like Belle's strip club in New York City.",
        "Category": " Fiction , Romance , Fantasy",
        "Publisher": "Zebra Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "Frommer's British Columbia & the Canadian Rockies",
        "Authors": "By McRae, Bill and Blore, Shawn",
        "Description": "You'll never fall into the tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go--they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us!This brand-new guide will show you the best of Vancouver, the hottest destination in North America, where you can enjoy cutting-edge Asian-fusion cuisine and experience firsthand its vibrant arts and nightlife scene. Then we'll take you into some of the most spectacular, unspoiled countryside on the continent, where you can enjoy whale watching, sea kayaking, canoeing, wildlife viewing, downhill skiing, wine tasting, hiking, biking, and more. In the Rockies, you'll get full coverage of gorgeous Banff and Jasper National Parks, and we'll also take you to the glowing glacial waters of Lake Louise. Our author has traveled every inch of this vast region, and he's chosen the best places to stay: wilderness lodges, guest ranches, elegant B&Bs, mom-and-pop motels, secluded campgrounds, and luxury resorts. With Frommer's in hand, it's a snap to design the Canadian adventure that's right for you.",
        "Category": " Travel , Canada , Western Provinces (AB, BC)",
        "Publisher": "*Frommers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2000"
        }
    },
    {
        "Title": "The Ninth Nugget (A to Z Mysteries)",
        "Authors": "By Gurney, John Steven (ILT) and Roy, Ron",
        "Description": "Help Dink, Josh, and Ruth Rose solve mysteries from A to Z!    Kids love collecting the entire alphabet and super editions! With over 8 million copies in print, the A to Z Mysteries® have been hooking chapter book readers on mysteries and reading for years. Now this classic kid favorite is back with a bright new look!   N is for Nugget . . . Howdy from Montana, pardners! Dink, Josh, and Ruth Rose are spending a week at a dude ranch. When they pan for gold, Josh finds a huge nugget. But gold fever has struck, and soon the nugget is stolen. It’s up to the kids to round up the thief.",
        "Category": " Juvenile Fiction , Readers , Chapter Books",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Russian Roulette (Hannibal Jones Mystery Series)",
        "Authors": "By Camacho, Austin S.",
        "Description": "Washington D.C.’s professional troubleshooter, Hannibal Jones, is enraged when he is forced to take a case at gunpoint. His client is a Russian assassin who will kill Hannibal’s beloved, Cindy Santiago, if Hannibal refuses to help him. With no choice, Hannibal agrees to investigate the smooth, wealthy Algerian who has stolen the heart of the woman his new client loves. At first the case looks simple, but Hannibal’s view quickly changes when evidence surfaces connecting the Algerian to Russian mob money and the apparent suicide of the girl’s father several years earlier. Further investigation reveals that the Algerian may not be who he says he is. Then more deaths follow, closing in on the Algerian and the girl. At first working only to protect Cindy’s life, Hannibal is soon chasing the truth for its own sake and must fight his way through past lies, present jealousies and the Red Mafiya to learn the real reason that death is stalking the couple. Hannibal peels the Algerian’s history like an onion, each layer revealing a false identity. His search for the truth leads to a dramatic shootout on Roosevelt Island, side-by-side with his murderous client.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "Intrigue Publishing LLC",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "June",
            "Year": "2009"
        }
    },
    {
        "Title": "The Cougar Club: A Novel",
        "Authors": "By McBride, Susan",
        "Description": "Meet three women who aren't about to run and hide just because the world says they should be on the shelf and out of circulation.KatHer life seems perfect until she loses her high-powered advertising job and catches her live-in lover in a compromising position—with his computer! CarlaThis sexy TV news anchor is in danger of being replaced by a twentysomething blond bimbo. Wasn't it just yesterday that she was the up-and-coming star?EliseA married dermatologist, Elise thinks her plastic surgeon husband is playing doctor with someone else. Kat firmly believes that aging gracefully isn't about giving up; it's about living life with your engine on overdrive. So this unofficial \"Cougar Club\" quickly learns three things about survival of the fittest in today's youth-obsessed society:  True friendship never dies, the only way to live is real, and you're never too old to follow your heart.",
        "Category": " Fiction , Contemporary Women",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2010"
        }
    },
    {
        "Title": "Firstborn (Time Odyssey)",
        "Authors": "By Clarke, Arthur C. and Baxter, Stephen",
        "Description": "The Firstborn–the mysterious race of aliens who first became known to science fiction fans as the builders of the iconic black monolith in 2001: A Space Odyssey–have inhabited legendary master of science fiction Sir Arthur C. Clarke’s writing for decades. With Time’s Eye and Sunstorm, the first two books in their acclaimed Time Odyssey series, Clarke and his brilliant co-author Stephen Baxter imagined a near-future in which the Firstborn seek to stop the advance of human civilization by employing a technology indistinguishable from magic.Their first act was the Discontinuity, in which Earth was carved into sections from different eras of history, restitched into a patchwork world, and renamed Mir. Mir’s inhabitants included such notables as Alexander the Great, Genghis Khan, and United Nations peacekeeper Bisesa Dutt. For reasons unknown to her, Bisesa entered into communication with an alien artifact of inscrutable purpose and godlike power–a power that eventually returned her to Earth. There, she played an instrumental role in humanity’s race against time to stop a doomsday event: a massive solar storm triggered by the alien Firstborn designed to eradicate all life from the planet. That fate was averted at an inconceivable price. Now, twenty-seven years later, the Firstborn are back.This time, they are pulling no punches: They have sent a “quantum bomb.” Speeding toward Earth, it is a device that human scientists can barely comprehend, that cannot be stopped or destroyed–and one that will obliterate Earth.Bisesa’s desperate quest for answers sends her first to Mars and then to Mir, which is itself threatened with extinction. The end seems inevitable. But as shocking new insights emerge into the nature of the Firstborn and their chilling plans for mankind, an unexpected ally appears from light-years away.",
        "Category": " Fiction , Science Fiction , Space Opera",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2007"
        }
    },
    {
        "Title": "American Foreign Policy: Pattern and Process",
        "Authors": "By Kegley, Charles W. and Wittkopf, Eugene R.",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "St Martins Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Human SIGMA: Managing the Employee-Customer Encounter",
        "Authors": "By Fleming, John H., Ph.D. and Asplund, Jim",
        "Description": "Six Sigma changed the face of manufacturing quality. Now, HumanSigma is poised to do the same for sales and services. Human Sigma offers an innovative research-based approach to one of the toughest challenges facing sales and services companies today: how to effectively manage the employee-customer encounter to drive business success.What would your company look like if you could increase the revenue and profitability potential of every customer by more than 20 percent? What if you could double the productivity of every employee? And what if these two phenomena together could drive overall organizational performance exponentially? What would your company look like? And how would you go about creating this kind of change? One thing is certain: Business leaders are never going to inspire higher levels of employee productivity and build more passionate customer relationships by doing the same things they have tried for the past 25 years. Business leaders need something fresh. Something new. The last thing they need is more of the same old conventional wisdom about “satisfying” their employees and their customers. Based on solid research by The Gallup Organization, Human Sigma will appeal to senior leaders and line managers alike who are looking for a way to dramatically increase productivity, retain a base of high value customers, and improve overall business performance. Human Sigma is: • Rigorous: Based on research involving hundreds of companies, and over 10 million employees and 10 million customers around the world. • Innovative: Cutting-edge management science supported by data, including brain imaging research into customer’s emotional connections to the companies they love. • Practical: The principles in the book were developed from observations of real-life successes, not some fictional freaks-of-nature that exist only in a laboratory. As such, the lessons contained in the book have been tested in the real world, and can be applied in many situations. • Interactive: The book contains a code that can be used to estimate the potential value of HumanSigma to readers’ organizations.",
        "Category": " Business & Economics , Management",
        "Publisher": "Gallup Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "Oracle SQL*Plus: The Definitive Guide",
        "Authors": "By Gennick, Jonathan",
        "Description": "This book is the definitive guide to SQLPlus. If you want to take best advantage of the power and flexibility of this popular Oracle tool, you need this book.SQLPlus is an interactive query tool that is ubiquitous in the Oracle world. It is present in every Oracle installation and is  available to almost every Oracle developer and database  administrator. SQLPlus has been shipped with Oracle since at  least version 6. It continues to be supported and enhanced  with each new version of Oracle, including Oracle8 and Oracle8i.  It is still the only widely available tool for writing SQL scripts. Despite this wide availability and usage, few developers and DBAs know how powerful SQLPlus really is.This book introduces SQLPlus, includes a quick reference to  all of its syntax options, and, most important, provides chapters that describe, in step-by-step fashion, how to perform all of the  tasks that Oracle developers and DBAs want to perform with SQLPlus --  and maybe some they didn't realize they COULD perform with SQLPlus.  You will learn how to write and execute script files, generate ad hoc reports, extract data from the database, query the data dictionary  tables, customize your SQLPlus environment, and use the SQLPlus  administrative features (new in Oracle8i).This book is an indispensable resource for readers who are new to SQLPlus, a task-oriented learning tool for those who are already using it, and a quick reference for every user.A table of contents follows:Preface Introduction to SQLPlus Interacting with SQLPlus Generating Reports with SQLPlus Writing SQLPlus Scripts Extracting Data with SQLPlus Exploring Your Database with SQLPlus Advanced Scripting Tuning and Timing The Product User Profile Administration with SQLPlus Customizing Your SQLPlus EnvironmentAppendicesA.  SQLPlus Command ReferenceB.  Connect Strings and the SQLPlus Command",
        "Category": " Computers , Database Management , General",
        "Publisher": "O'Reilly Media",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "1999"
        }
    },
    {
        "Title": "Chateaux of the Loire (Bonechi Golden Book Collection)",
        "Authors": "By D`Huart, Simone et al",
        "Description": "",
        "Category": "",
        "Publisher": "Casa Editrice Bonechi",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1995"
        }
    },
    {
        "Title": "24: The Unofficial Guide",
        "Authors": "By Sangster, Jim",
        "Description": "\"This book follows each episode in the first season of the acclaimed Fox television show 24, which stars Kiefer Sutherland as FBI Agent Jack Bauer. The action, plot twists, and surprises in each show are described, and a detailed profile of each character is provided. Discussion is included on the potential flaws, unanswered questions, and various loose ends that resulted after the showÆs first season. A special trivia section details such facts as BauerÆs mobile phone number and his daughterÆs birthday.\"",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Contender Entertainment Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2003"
        }
    },
    {
        "Title": "Unplayable Lie: A Chief Inspector St. George Mystery (Chief Inspector St. George Mysteries)",
        "Authors": "By Jamesson, Peter",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Sleeping Bear Pr",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "February",
            "Year": "2002"
        }
    },
    {
        "Title": "Australia Spiral Guide (AAA Spiral Guides)",
        "Authors": "By Moran, Pip",
        "Description": "More than 200 pages of slick graphics, spectacular photographs, color-coded locator maps and engaging prose written by experts make the Australia Spiral Guide an indispensable travel companion - the one to trust at home or abroad. Entertaining prose by savvy authors illuminates popular places and introduces newcomers to those little-known gems that locals like to keep secret. This guide is flush with listings of accommodations, restaurants, shopping venues, and nightspots. And foolproof insider information helps readers spend their vacation time wisely. With its practical wire binding, this user-friendly guide lays flat and handles like no other.",
        "Category": " Travel , Australia & Oceania",
        "Publisher": "AAA",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2006"
        }
    },
    {
        "Title": "A history of Far Eastern art",
        "Authors": "By Lee, Sherman E.",
        "Description": "Surveys the development of sculpture, painting, ceramics, and the decorative arts in Asia from the Stone Age",
        "Category": "",
        "Publisher": "H.N. Abrams",
        "Price Starting With ($)": "10.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "Peachtree Dreams: Love's Image / Double Blessing / If the Dress Fits (Romancing America: Georgia)",
        "Authors": "By Mayne, Debby",
        "Description": "Have you ever felt that modern life tries to steal hope from lasting love and enduring faith? Three Georgia women face the challenge to believe in happily-ever-after endings. Shannon McNab has lost her boyfriend when her super-model looks are marred in an accident. Jill Hargrove buries the pain in her past by focusing on a business in ruins. Cindi Clark is ready to sell her bridal boutique after her parents announce that they are divorcing. Three determined men will attempt to change these women's opinions of love.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Barbour Publishing, Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "ANCIENT ROME",
        "Authors": "By Hill, Duncan",
        "Description": "",
        "Category": " History , Ancient , Rome",
        "Publisher": "Parragon Books",
        "Price Starting With ($)": "7.74",
        "Publish Date": {
            "Month": "January",
            "Year": "2007"
        }
    },
    {
        "Title": "The Mom Inventors Handbook: How to Turn Your Great Idea Into the Next Big Thing",
        "Authors": "By Monosoff, Tamara",
        "Description": "The Mom Inventors Handbook. gives practical step-by- step advice for putting inspiration into action. The book takes inventors from idea development to marketing and sales covering everything from market research to prototype development, manufacturing and licensing and debunks some common myths. It simplifies the invention process; even providing stories from real mom inventors sharing their 'aha' moments and lessons learned.",
        "Category": " Business & Economics , Business Communication , General",
        "Publisher": "McGraw-Hill",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "2005"
        }
    },
    {
        "Title": "Napkin Origami: 25 Creative and Fun Ideas for Napkin Folding",
        "Authors": "By Sawyer, Brian (EDT)",
        "Description": "Why fold a napkin into an ordinary square when it can become a swan, bread holder, or pirate’s ship? Like magic, these amazing origami projects turn humble paper or fabric napkins into restaurant-worthy centerpieces that transform the table. There’s a napkin sculpture for any and every occasion: simple patterns, such as a leaf, fish, or heart; designs for those special moments, including a baby bootie for a shower or a bunny for Easter dinner; innovative creations like a peacock, dessert server, and carousel; and complex shells, rosettes, and pleated wraps for formal dining. All the traditional origami techniques, tips, and symbols are beautifully explained; elegant photography throughout makes the process easy to follow and showcases the remarkable results.",
        "Category": " Crafts & Hobbies , Origami",
        "Publisher": "Sterling/Hollan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2008"
        }
    },
    {
        "Title": "3rd Teddy Bear and Friends Price Guide",
        "Authors": "By Sieverling, Helen",
        "Description": "",
        "Category": "",
        "Publisher": "Hobby House Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Winning With Mutual Funds",
        "Authors": "By Money (Chicago, Ill.) and Ellis, Junius (EDT)",
        "Description": "Explains how mutual funds work, tells how to determine which funds meet one's financial goals, and provides information on taxes, portfolio management, and top funds",
        "Category": " Business & Economics , General",
        "Publisher": "Oxmoor House",
        "Price Starting With ($)": "8.52",
        "Publish Date": {
            "Month": "November",
            "Year": "1987"
        }
    },
    {
        "Title": "Rogets Thesaurus P Cha Riv *NR*",
        "Authors": "By Roget, Samuel Romilly",
        "Description": "A reference of synonyms giving words related to specific themes and topics",
        "Category": " Reference , Thesauri",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "My Most Excellent Year: A Novel of Love, Mary Poppins, and Fenway Park",
        "Authors": "By Kluger, Steve",
        "Description": "Dear Anthony: I appreciate your recent interest, but I?m not accepting applications at this time. Your letter will be kept in our files and someone will get back to you if there is an opening. Thank you for thinking of me. Respectfully, Alejandra Perez P.S. It?s not ?Allie.? It?s ?Ale.? Meet T.C., who is valiantly attempting to get Alejandra to fall in love with him; Alejandra, who is playing hard to get and is busy trying to sashay out from under the responsibilities of being a diplomat?s daughter; and T.C.?s brother Augie, who is gay and in love and everyone knows it but him.",
        "Category": " Young Adult Fiction , Humorous , General",
        "Publisher": "Dial",
        "Price Starting With ($)": "5.21",
        "Publish Date": {
            "Month": "March",
            "Year": "2008"
        }
    },
    {
        "Title": "Love, Charleston",
        "Authors": "By Hart, Beth Webb",
        "Description": "Charleston's past is full of romance. Does Anne's future hold the same?Charleston's Anne Brumley has long dreamed of love while ringing the bells at St. Michael's, but those dreams are beginning to fade. Her sister Alisha and cousin Della encourage the thirty-six year old to move somewhere new for a fresh start.Widower Roy Summerall has happily ministered to the country folks of Church of the Good Shepherd for years. So why would the Lord call him and his daughter away to Charleston--the city that Roy remembers from his childhood as pretentious and superficial? Surely the refined congregation of St. Michael's won't accept a reverend with a red neck and a simple faith.Meanwhile, Anne's sister, Alisha, struggles with her husband's ambition, which seems to be taking him further from their dreams of a happy family. And Cousin Della's former fiance has returned to Charleston, making her wonder if she chose the wrong path when she married her gifted but unemployed-artist husband.Family, friendship, and faith converge in a beautiful story about how God's transforming love works in the Holy City of Charleston.",
        "Category": " Fiction , Christian , Romance",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2010"
        }
    },
    {
        "Title": "The Golden Road to Samarkand (A Studio book)",
        "Authors": "By Blunt, Wilfred",
        "Description": "",
        "Category": "",
        "Publisher": "Viking Press/A Studio Book",
        "Price Starting With ($)": "29.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1973"
        }
    },
    {
        "Title": "A Short History of Women: A Novel",
        "Authors": "By Walbert, Kate",
        "Description": "NOMINATED FOR THE LOS ANGELES TIMES BOOK PRIZE A profoundly moving portrait of the complicated legacies of mothers and daughters, A Short History of Women chronicles five generations of women from the close of the nineteenth century through the early years of the twenty-first.Beginning in 1914 at the deathbed of Dorothy Trevor Townsend, a suffragette who starves herself for the cause, the novel traces the echoes of her choice in the stories of her descendants—a brilliant daughter who tries to escape the burden of her mother’s infamy; a granddaughter who chooses a conventional path, only to find herself disillusioned; a great-granddaughter who wryly articulates the free-floating anxiety of post-9/11 Manhattan. In a kaleidoscope of characters and with a richness of imagery, emotion, and wit, A Short History of Women is a thought-provoking and vividly original narrative that crisscrosses a century—a book for \"any woman who has ever struggled to find her own voice; to make sense of being a mother, wife, daughter, and lover\" (Associated Press).",
        "Category": " Fiction , Historical",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "Tea is for Terror (A Claire Gulliver Mystery)",
        "Authors": "By Wigglesworth, Gayle",
        "Description": "",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Koenisha Publications",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "August",
            "Year": "2004"
        }
    },
    {
        "Title": "Portobello: A Novel",
        "Authors": "By Rendell, Ruth",
        "Description": "INCLUDES AN EXCERPT OF RENDELL’S FINAL NOVEL, DARK CORNERS Ruth Rendell is widely considered to be crime fiction’s reigning queen, with a remarkable career spanning more than forty years. Now, in Portobello, she delivers a captivating and intricate tale that weaves together the troubled lives of several people in the gentrified neighborhood of London’s Notting Hill.Walking to the shops one day, fifty-year-old Eugene Wren discovers an envelope on the street bulging with cash. A man plagued by a shameful addiction—and his own good intentions—Wren hatches a plan to find the money’s rightful owner. Instead of going to the police, or taking the cash for himself, he prints a notice and posts it around Portobello Road. This ill-conceived act creates a chain of events that links Wren to other Londoners—people afflicted with their own obsessions and despairs. As these volatile characters come into Wren’s life—and the life of his trusting fiancée—the consequences will change them all.  Portobello is a wonderfully complex tour de force featuring a dazzling depiction of one of London’s most intriguing neighborhoods—and the dangers beneath its newly posh veneer.",
        "Category": " Fiction , Thrillers , Suspense",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Watercolor Bold & Free",
        "Authors": "By Goldsmith, Lawrence C.",
        "Description": "Sixty-four bold, exploratory experiments, each accompanied by a full-page color painting by a leading contemporary artist, promote freshness, vibrancy, and originality in watercolor painting while concentrating on composition, concept, and technique",
        "Category": " Art , Techniques , Watercolor Painting",
        "Publisher": "Watson-Guptill",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Beowulf",
        "Authors": "By Morgan, Edwin",
        "Description": "",
        "Category": "",
        "Publisher": "University of California",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "Scholastic Success With: 2nd Grade (Bind-Up)",
        "Authors": "By",
        "Description": "416 bright, colorful pages that give kids practice in the skills every 2nd grader needs to be successful. Includes addition and subtraction, problem solving, number concepts, reading comprehension, handwriting, writing, grammar, maps, and lots more.  For use with Grade 2.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "June",
            "Year": "2003"
        }
    },
    {
        "Title": "Brock Biology of Microorganisms (10th Edition)",
        "Authors": "By Madigan, Michael T., Martinko, John M., and Parker, Jack",
        "Description": "The tenth edition of this text is reorganized into six units on principles of microbiology, evolutionary microbiology and microbial diversity, immunology and pathogenicity, microbial diseases, and microorganisms as tools for industry and research. There are seven new chapters on topics including microbial genomics, viruses, methods in microbial ecology, immunology, and microbial disease. The revised art program features many color micrographs, and links for Web site tutorials are given at specific points in chapters. Other learning features include glossary terms, concept checks, and boxes on applications and historical perspectives. Madigan teaches microbiology at Southern Illinois University-Carbondale. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Science , Life Sciences , Biology",
        "Publisher": "Prentice-Hall",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "American Food",
        "Authors": "By Jones, Evan",
        "Description": "Featuring a new section on game cooking, this edition combines more than seven hundred distinctive regional, traditional, and contemporary American recipes with an anecdotal history of America's native cuisine",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Abrams Press",
        "Price Starting With ($)": "8.78",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Searching for Pemberley",
        "Authors": "By Simonsen, Mary Lydon",
        "Description": "\"History, romance, and even a little mystery all combined in one wonderful book.\" -Best Sellers World, Five Star ReviewMaggie went in search of a love story, but she never expected to find her own...Desperate to escape her life in a small Pennsylvania mining town, Maggie Joyce accepts a job in post-World War II London, hoping to find adventure. While touring Derbyshire, she stumbles upon the stately Montclair, rumored by locals to be the inspiration for Pemberley, the centerpiece of Jane Austen's beloved Pride and Prejudice.Determined to discover the truth behind the rumors, Maggie embarks on a journey through the letters and journals of Montclair's former owners, the Lacey family, searching for signs of Darcy and Elizabeth.But when the search introduces her to both a dashing American pilot and a handsome descendant of the \"Darcy\" line, Maggie must decide how her own love story will end.Perfect for fans of Death Comes to Pemberley.Praise for Searching for Pemberley: \"A shining addition to the world of historical fiction.\"- Curled Up With A Good Book \"A resounding success on all levels.\"- Roundtable Reviews \"A precious jewel of a novel with a strong love story and page-turning mystery. Absorbing, amusing, and very cleverly written.\"- The Searcher",
        "Category": " Fiction , Historical , General",
        "Publisher": "Sourcebooks Landmark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2009"
        }
    },
    {
        "Title": "The Other Mr. Darcy: Did you know Mr. Darcy had an American cousin?",
        "Authors": "By Fairview, Monica",
        "Description": "Did you know that Mr. Darcy had an American cousin?!        In this  highly original Pride and Prejudice sequel by  British author Monica Fairview, Caroline Bingley is our heroine. Caroline is  sincerely broken-hearted when Mr. Darcy marries Lizzy Bennet? that is, until  she meets his charming and sympathetic American cousin?        Mr.  Robert Darcy is as charming as Mr. Fitzwilliam Darcy is proud, and he is  stunned to find the beautiful Caroline weeping at his cousin's wedding. Such  depth of love, he thinks, is rare and precious. For him, it's nearly love at first  sight. But these British can be so haughty and off-putting. How can he let the  young lady, who was understandably mortified to be discovered in such a  vulnerable moment, know how much he feels for and sympathizes with her?",
        "Category": " Fiction , Romance , Historical , Regency",
        "Publisher": "Sourcebooks Landmark",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2009"
        }
    },
    {
        "Title": "Twentieth-Century America: Recent Interpretations.",
        "Authors": "By Bernstein, Barton J",
        "Description": "",
        "Category": "",
        "Publisher": "HBJ College & School Division",
        "Price Starting With ($)": "5.88",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Daily Learning Drills Grade 4",
        "Authors": "By Douglas, Vincent",
        "Description": "Daily Learning Drills Grade 4 provides young learners completesupplemental practice for skills taught in fourth grade! Theentertaining skill-building activities cover the core subjects--languagearts, math, science, and social studies--and make learning fun. Topicsinclude idioms, reading comprehension, two-digit multiplication,division, magnets, bones, holidays, and many more. A review section foreach subject area is located in the back with its own answer key,reinforcing the skills covered earlier in the book.      Daily Learning Drills provides practice in the skills and subjectareas that are essential to student success!",
        "Category": " Juvenile Nonfiction , Activity Books , General",
        "Publisher": "Brighter Child",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "The Best Holiday Crafts Ever",
        "Authors": "By Ross, Kathy and Holm, Sharon Lane (ILT)",
        "Description": "Provides instructions for more than seventy-five craft projects for Valentine's Day, Easter, Earth Day, Halloween, Thanksgiving, Hanukkah, Christmas, and Kwanzaa",
        "Category": " Juvenile Nonfiction , Crafts & Hobbies",
        "Publisher": "Millbrook Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1996"
        }
    },
    {
        "Title": "Organic Chemistry, Study Guide and Solutions Manual",
        "Authors": "By Solomons, T. W. Graham, Fryhle, Craig B., and Johnson, Robert G.",
        "Description": "On the cover of this book is a Pacific yew tree, found in the ancient forests of the Pacific Northwest. The bark of the Pacific yew tree produces Taxol, found to be a highly effective drug against ovarian and breast cancer. Taxol blocks mitosis during eukaryotic cell division. The supply of Taxol from the Pacific yew tree is vanishingly small, however. A single 100-year-old tree provides only about one dose of the drug (roughly 300 mg). For this reason, as well as the spectacular molecular architecture of Taxol, synthetic organic chemists fiercely undertook efforts to synthesize it. Five total syntheses of Taxol have thus far been reported. Now, a combination of isolation of a related metabolite from European yew needles, and synthesis of Taxol from that intermediate, supply the clinical demand. This case clearly demonstrates the importance of synthesis and the use of organic chemistry. It's just one of the many examples used in the text that will spark the interest of students and get them involved in the study of organic chemistry!",
        "Category": " Science , Chemistry , Organic",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1999"
        }
    },
    {
        "Title": "The Humanities Cultural Roots and Continuities Volume 1 (The Humanities, volume 1)",
        "Authors": "By Mary Ann Frese Witt",
        "Description": "",
        "Category": "",
        "Publisher": "Heath",
        "Price Starting With ($)": "6.84",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    }
]