[
    {
        "Title": "After the Soviet Union: From Empire to Nations (American Assembly Series)",
        "Authors": "By Legvold, Robert (EDT), Colton, Timothy J. (EDT), and Legyold, Robert (EDT)",
        "Description": "The failed coup by Communist hardliners in Moscow in August 1991 marked the inevitable disintegration of the Soviet Union. No single event since the end of World War II will have more far-reaching effects. The power struggles now underway in the fifteen successor republics raise the specter of chaos in Eastern Europe and Southern Asia. Can these new nations manage their deepening economic crisis? What political form will the new republics take, and can the changes be accomplished peacefully? What dangers and problems does the Soviet Union's passage present to the outside world?This collection of original essays, sponsored by the Harriman Institute at Columbia University and the American Assembly, is the first comprehensive assessment of the challenges facing the Soviet Union's successor republics. In five concise chapters, leading American scholars of Soviet affairs examine the economics, politics, and foreign policy of the new nations. The future role of the Soviet military machine - really another nation among the nations - is also discussed. The authors' conclusions lend ground for a tempered optimism about the future of the former USSR.",
        "Category": " History , Russia & the Former Soviet Union",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1992"
        }
    },
    {
        "Title": "In the Name of God: The Khomeini Decade",
        "Authors": "By Wright, Robin",
        "Description": "The author chronicles the first ten years of the Iranian Revolution, employing an unprecedented access to Iran's major figures to outline the nation's importance to the rest of the world",
        "Category": " History , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "5.41",
        "Publish Date": {
            "Month": "October",
            "Year": "1989"
        }
    },
    {
        "Title": "Creative Touches : How to Add Flair to Ready-to-Wear",
        "Authors": "By Leisure Arts Staff",
        "Description": "",
        "Category": "",
        "Publisher": "Leisure Arts",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Modern Latin America",
        "Authors": "By Skidmore, Thomas E. and Smith, Peter H.",
        "Description": "Now thoroughly updated in its seventh edition, Modern Latin America is a lively interpretive history and the leading text in the field. Featuring vivid anecdotal illustrative boxes, the book uses case studies to discuss the major countries and themes of the region over the past 150 years.Modern Latin America, Seventh Edition, will continue to be an exceptional text for undergraduate courses on contemporary Latin American history, society, and politics.New to this Edition· Four entirely new chapters:o The central Andes, including Peru and--for the first time--Bolivia and Ecuador (chapter 6)o Venezuela (chapter 8)o Strategies for economic development (chapter 12)o Culture and society (chapter 14)· Two additional new chapters created by recombining previous ones:o The Greater Caribbean and Central America (chapter 4)o Political transitions in comparative perspective (chapter 13)Ancillaries · Companion Website (www.oup.com/us/skidmore)oFor students and general readers: a timeline of key events, analyses of major news developments, lists of heads of state, questions for review, suggestions for further reading, and guides to primary sourceso For instructors: an essay on pedagogical challenges in teaching Latin America, sample syllabi, and a guide to instructional videos and films",
        "Category": " History , Latin America , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "Politics: Observations and Arguments, 1966-2004",
        "Authors": "By Hertzberg, Hendrik",
        "Description": "An analysis of American politics from the presidency of Johnson to the present is arranged in such themes as campaigns, the media, and wars, in a volume that draws on the author's work as a winner of the National Magazine Award for General Excellence to illuminate particular events in modern history. Reprint.",
        "Category": " Political Science , Essays",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2005"
        }
    },
    {
        "Title": "Transforming Bible Study with Children: A Guide for Learning Together",
        "Authors": "By Van Ness, Patricia",
        "Description": "Uses the right-brain/left-brain methodology, popularized by Walter Wink in his classic book Transforming Bible Study. Patricia W. Van Ness shows how to present imaginative Bible Study lessons that take advantage of the unique way in which children learn..focusing on wonder, imagination, and prayer rather than on information. Van Ness specifically demonstrates how to prepare a lesson so that this transformative process can take place. She also shows how to adapt the lesson with children.",
        "Category": " Religion , Christian Education , Children & Youth",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "Dinosaurs",
        "Authors": "By Norman, David, Sibbick, John (ILT), Blagden, Denise (ILT), and Nicholls, David (ILT)",
        "Description": "Discusses the characteristics, origins, periods, and geographic locations of different dinosaur species",
        "Category": " Science , General",
        "Publisher": "Random House Value Pub",
        "Price Starting With ($)": "19.25",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The Control Revolution: How the Internet is Putting Individuals in Charge and Changing the World We Know",
        "Authors": "By Shapiro, Andrew L.",
        "Description": "Shows how the Internet has enabled individuals to take power from institutions, and examines the benefits and drawbacks of these changes",
        "Category": " Technology & Engineering , General",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2000"
        }
    },
    {
        "Title": "Crafts in a Flash: Quick, Quicker & Quickest Projects (Crafts Magazine Series)",
        "Authors": "By The Editors of Creative Publishing international, The Editors of Crafts Magazine",
        "Description": "",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Creative Pub Intl",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1998"
        }
    },
    {
        "Title": "Confessions of a Slacker Mom",
        "Authors": "By Mead-Ferro, Muffy",
        "Description": "Parents who are fed up with the pressure to turn their children into star athletes, concert violinists, and merit scholars-all at once!-finally have an alternative: the world of Slacker Moms, where kids learn to do things for themselves and parents can cut themselves some slack; where it's perfectly all right to do less, have less, and spend less. Slacker moms say \"No\" to parenting philosophies that undermine parents'-and children's-ability to think for themselves. They say \"Yes\" to saving their money and time by opting out of the parenting competition. And they say \"Hell, Yes!\" to having a life of their own, knowing it makes them better parents.In this witty and insightful book, author Muffy Mead-Ferro reflects on her experience of growing up on a ranch in Wyoming, where parenting-by necessity-was more hands-off, people \"made do\" with what they had, and common sense and generational wisdom prevailed. We should all take her sane lead!",
        "Category": " Social Science , Anthropology , Cultural & Social",
        "Publisher": "Da Capo Lifelong",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2004"
        }
    },
    {
        "Title": "Somersize Desserts",
        "Authors": "By Somers, Suzanne",
        "Description": "Now you can have your cake and eat it, too!  Suzanne Somers, whose revolutionary Somersizing program and bestselling books have helped millions of people lose weight, shares thirty delicious recipes for decadent, flavorful desserts that not only taste great but won’t make you gain an ounce. Sound too good to be true? Not if you Somersize! This remarkable program allows you to lose weight while eating delicious foods, including sinfully rich desserts such as:* Crème Brûlée* New York–Style Cheesecake with Raspberry Coulis* Lemon Zabaglione* Chocolate Layer Cake* Wild Mountain Blueberry Pie* Caramel Swirl Chocolate Chunk Ice CreamYou can lose weight while eating these tasty desserts because the key to weight loss is reducing sugar in your diet, not fat. Fat is not the enemy. In fact, fat is your friend. It’s the sugar that makes people put on the pounds. The fabulous, tempting desserts in this book are made with SomerSweet, a miracle product that won’t spike your insulin levels. This is a breakthrough for diabetics! And it’s perfect for Somersizers or anyone who just wants to eat a tantalizing, guilt-free dessert. Never before has weight loss been so easy and enjoyable. Illustrated with mouthwatering photos, Somersize Desserts is the perfect companion to Suzanne Somers’ revolutionary series of weight-loss books. Don’t deprive yourself of those sweets; go ahead—they’re perfectly Somersized!",
        "Category": " Health & Fitness , Diet & Nutrition , Diets",
        "Publisher": "Clarkson Potter",
        "Price Starting With ($)": "12.57",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Eye of the Storm: A Civil War Odyssey",
        "Authors": "By Sneden, Robert Knox, Bryan, Charles F., Jr. (EDT), and Lankford, Nelson D. (EDT)",
        "Description": "Eye of the Storm is one of the most important Civil War documents ever published. Four tattered scrapbooks found in a Connecticut bank vault in 1994 have yielded a treasure trove of more than five hundred watercolors and maps that vividly depict America's great national conflict. These scrapbooks, and the accompanying memoir, are the life's work of a long-forgotten Union private and mapmaker named Robert Knox Sneden, who witnessed some of the war's greatest campaigns and spent more than a year in Southern prison camps, including Andersonville.A must-have for anyone interested in the subject, Robert Knox Sneden's Eye of the Storm is a permanent addition to Civil War literature and art, and a lasting achievement in human expression of the horrors of war.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Free Press",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2002"
        }
    },
    {
        "Title": "Lead or Get Off the Pot!: The Seven Secrets of a Self-Made Leader",
        "Authors": "By Croce, Pat, Lyon, Bill, and Covey, Stephen R. (FRW)",
        "Description": "Each and every one of us -- regardless of our age, position, or station in life -- has the opportunity to take control of, and improve, our lives...and the lives of those around us. In Lead or Get Off the Pot!, the irrepressible count of carpe diem shares his bold vision and unorthodox strategies for developing personal passion, a can-do attitude, and the motivation essential for cultivating leadership skills. Pat's advice includes:   Twelve Ways to Build a Passionate Team Walk the Talk The Ten Commandments of Service How to Listen with a Leader's Eye Learning your AAAs -- Attitude, Assets, Ambition   ...and other leadership lessons that can teach you to become a true leader -- one who challenges, mediates, motivates, communicates, and inspires.",
        "Category": " Business & Economics , General",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "The Art Institute of Chicago: The Essential Guide",
        "Authors": "By Art Institute of Chicago (COR), May, Sally Ruth, Edelstein, T. J., and Wood, James N.",
        "Description": "",
        "Category": " Art , Collections, Catalogs, Exhibitions , General",
        "Publisher": "Art Inst of Chicago Museum Shop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Law and Democracy in the New Russia (Brookings Dialogues on Public Policy)",
        "Authors": "By Smith, Bruce L. R. and Danilenko, Gennady M. (EDT)",
        "Description": "This book presents papers by American, Western European, and Russian legal scholars who discuss recent constitutional developments in Russia, assess the complex processes of change that are under way, and interpret Russian constitutionalism in light of both the American and European experience.Dialogues on Public Policy",
        "Category": " Law , General",
        "Publisher": "Brookings Inst Pr",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Holiday Celebrations (Williams-sonoma Lifestyles)",
        "Authors": "By Williams, Chuck (EDT), Eskite, Richard (ILT), and Simmons, Marie",
        "Description": "Discusses the specifics of holiday entertaining and provides recipes for such dishes as  mushroom crostini, cornmeal-crusted oysters with sour cream and caviar, roasted tomato soup with tiny meatballs and rice, and venison loin with mushroom sauce",
        "Category": " Cooking , Holiday",
        "Publisher": "Time Life Education",
        "Price Starting With ($)": "5.61",
        "Publish Date": {
            "Month": "November",
            "Year": "1998"
        }
    },
    {
        "Title": "Doonesbury's Greatest Hits",
        "Authors": "By Trudeau, G. B., Trudeau, Garry B.",
        "Description": "",
        "Category": "",
        "Publisher": "Holt, Rinehart and Winston",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Library Book: Lion Dancer (Rise and Shine)",
        "Authors": "By Waters, Kate and Slovenz-Low, Madeline",
        "Description": "Describes six-year-old Ernie Wong's preparations, at home and in school, for the Chinese New Year celebrations and his first public performance of the lion dance.",
        "Category": " Juvenile Fiction , People & Places , United States , Asian American",
        "Publisher": "National Geographic School Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "2010"
        }
    },
    {
        "Title": "A cook's tour of Rome",
        "Authors": "By Doris Muscatine",
        "Description": "",
        "Category": "",
        "Publisher": "Scribner",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "If I Ever Get Back to Georgia, I'm Gonna Nail My Feet to the Ground",
        "Authors": "By Grizzard, Lewis",
        "Description": "Newsroom anecdotes and observations on Northern weather, women, food, and manners make up the humorist's remembrance of his year as sports editor of the \"Chicago Tribune\"",
        "Category": " Humor , General",
        "Publisher": "Villard",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Laughing Matters: A Celebration of American Humor",
        "Authors": "By Shalit, Gene",
        "Description": "A wide-ranging and humorous collection of stories, cartoons, film and radio scripts, and other pieces by such artists as Woody Allen, Russell Baker, Gary Trudeau, and Garrison Keillor",
        "Category": " Humor , General",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1987"
        }
    },
    {
        "Title": "Mrs. Moskowitz and the Sabbath Candlesticks",
        "Authors": "By Schwartz, Amy",
        "Description": "A National Jewish Book Award Winner Mrs. Moskowitz and her cat move from their house into a new apartment and feel a little lost. They miss their house, filled with family memories. But then her son brings her a box she left behind, in which she finds a pair of Sabbath candlesticks. The rediscovered candlesticks and her memories of past Sabbaths help her finally to think of the apartment as home.",
        "Category": " Juvenile Fiction , Religious , Jewish",
        "Publisher": "JEWISH PUBLICATON SOCIETY",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "1983"
        }
    },
    {
        "Title": "Biotechnology of Plants and Microorganisms",
        "Authors": "By Crocomo, O. J. (CON)",
        "Description": "",
        "Category": "",
        "Publisher": "Ohio State Univ Pr (Txt)",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Smashed: Story of a Drunken Girlhood",
        "Authors": "By Zailckas, Koren",
        "Description": "Garnering a vast amount of attention from young people and parents, and from book buyers across the country, Smashed became a media sensation and aNew York Times bestseller. Eye-opening and utterly gripping, Koren Zailckas’s story is that of thousands of girls like her who are not alcoholics—yet—but who routinely use booze as a shortcut to courage and a stand-in for good judgment.With one stiff sip of Southern Comfort at the age of fourteen, Zailckas is initiated into the world of drinking. From then on, she will drink faithfully, fanatically. In high school, her experimentation will lead to a stomach pumping. In college, her excess will give way to a pattern of self-poisoning that will grow more destructive each year. At age twenty-two, Zailckas will wake up in an unfamiliar apartment in New York City, elbow her friend who is passed out next to her, and ask, \"Where are we?\"Smashed is a sober look at how she got there and, after years of blackouts and smashups, what it took for her to realize she had to stop drinking. Smashed is an astonishing literary debut destined to become a classic.",
        "Category": " Biography & Autobiography , Personal Memoirs",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Social Psychology (9th Edition)",
        "Authors": "By Baron, Robert A. and Byrne, Donn",
        "Description": "An attractive introductory text for undergraduates. Pedagogical features include chapter outlines, bold key terms and margin definitions, chapter summaries, and reviews of key points, plus boxes on classic studies and important figures in the field. Includes color photos and graphics. This second edition contains new boxes on issues in the news and on illustrations of important concepts, as well as expanded material on cultural and ethnic diversity, integration within the field of social psychology, and the biological perspective. The authors are affiliated with Rensselaer Polytechnic Institute and the University of Albany-SUNY. Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Psychology , Social Psychology",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "7.88",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "Mammoths",
        "Authors": "By Lister, Adrian and Bahn, Paul",
        "Description": "The colorful story of the mammoths involves archaeological and geological excavation and the exploratory research of biologists, anthropologists, and art historians worldwide. These findings are collected here in one volume for the first time. Superbly illustrated in full color, Mammoths features scores of photographs of mammoth remains, cave art, and prehistoric carvings made of mammoth ivory - along with fifteen dramatic reconstructions depicting how mammoths lived and how humans responded to their presence.Here, then, is the history of the origins, life, and eventual demise of a creature that has long held a special, nearly mystical, place in the human imagination. As the mammoths come to life on these pages, so too do the environments in which they lived, along with other extinct mammals and our own prehistoric ancestors who drew and carved images of mammoths more than 30,000 years ago. Mammoths is at once an up-to-date study and a dazzling visual record of one of the Earth's most extraordinary species.",
        "Category": " Science , General",
        "Publisher": "Macmillan General Reference",
        "Price Starting With ($)": "6.36",
        "Publish Date": {
            "Month": "December",
            "Year": "1994"
        }
    },
    {
        "Title": "Cooking the Vietnamese Way (Easy Menu Ethnic Cookbooks)",
        "Authors": "By Nguyen, Chi, Monroe, Judy, Wolfe, Robert L., and Wolfe, Diane",
        "Description": "",
        "Category": " Young Adult Nonfiction , Cooking & Food",
        "Publisher": "First Avenue Editions ™",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "1993"
        }
    },
    {
        "Title": "Shards of a Broken Crown: Volume IV of the Serpentwar Saga (Serpentwar Saga/Raymond E. Feist, Vol 4)",
        "Authors": "By Feist, Raymond E.",
        "Description": "“Undeniably riveting.”—Booklist The terrible Emerald Queen is vanquished…but the war in Midkemia is not yet won, as the remarkable Raymond E. Feist concludes his magnificent Serpentwar Saga with Shards of a Broken Crown—a spellbinding tale of magic, conflict, and treachery that sees the rise of a new threat from the ashes of defeat, an evil poised to strike mercilessly at realm triumphant but weakened by war. This is epic fantasy adventure at its finest—a classic that stands tall alongside the best works of Terry Goodkind, George R. R. Martin, Terry Brooks and other acclaimed fantasists. Feist once again works his breathtaking magic in Shards of a Broken Crown, and, as always, he “brings a new world alive” (Portland Oregonian).",
        "Category": " Fiction , Fantasy , Epic",
        "Publisher": "Harper Voyager",
        "Price Starting With ($)": "14.62",
        "Publish Date": {
            "Month": "April",
            "Year": "1998"
        }
    },
    {
        "Title": "Living-room War",
        "Authors": "By Arlen, Michael J",
        "Description": "Television, its role in society, and its transforming effects is the major concern of thirty-six essays",
        "Category": " Performing Arts , Television , General",
        "Publisher": "Penguin Books",
        "Price Starting With ($)": "5.59",
        "Publish Date": {
            "Month": "August",
            "Year": "1982"
        }
    },
    {
        "Title": "The Business of Bliss: How To Profit From Doing What You Love",
        "Authors": "By Victoria (New York, N. Y.) (EDT) and Allon, Janet",
        "Description": "Featured on the Oprah Winfrey Show. “This book is certainly blissful to look at...inspirational. It is full of lush, soft-focus photographs of women running businesses.”—The Wall Street Journal. “Entrepreneurs who daydream about converting a hobby into a career should consult The Business of Bliss.”—USA Today.",
        "Category": " Business & Economics , Small Business",
        "Publisher": "Hearst",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Invitation to Provence",
        "Authors": "By Adler, Elizabeth",
        "Description": "",
        "Category": " Fiction , General",
        "Publisher": "Large Print Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Under the Sun",
        "Authors": "By Dorros, arthur",
        "Description": "Chronicles the harrowing journey of Ehmet, a thirteen-year-old boy from Sarajevo who gets caught up in the ethnic conflicts in the former Yugoslavia.",
        "Category": " Young Adult Fiction , Historical , Military & Wars",
        "Publisher": "Amulet Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Smart Eating: Choosing Wisely, Living Lean",
        "Authors": "By Bailey, Covert and Gates, Ronda",
        "Description": "In this companion volume to his best-selling Smart Exercise, America's most famous health crusader teams with Ronda Gates to show you how to achieve and maintain your ideal weightwithout ever dieting. The secret is choosing the right foods, and the authors tell you exactly how to determine what your body needs. Especially useful is the unique Smart Eating Food Target: this simple graphic, which grades foods according to their fat and fiber content, is a handy way to remember all you need to know about the best foods for you.Smart Eating is right for everyone - men and women, vegetarians, people with weight problems, athletes, healthy people who just want to eat smart. And the 200 recipes specifically keyed to the Food Target make it easy to prepare and cook meals that are as nutritious as they are tasty.",
        "Category": " Health & Fitness , General",
        "Publisher": "HOUGHTON MIFFLIN",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1996"
        }
    },
    {
        "Title": "Sociology Essentials (Essentials Study Guides)",
        "Authors": "By Fuchs, Robyn A. Goldstein, Ph.D.",
        "Description": "REA’s Essentials provide quick and easy access to critical information in a variety of different fields, ranging from the most basic to the most advanced. As its name implies, these concise, comprehensive study guides summarize the essentials of the field covered. Essentials are helpful when preparing for exams, doing homework and will remain a lasting reference source for students, teachers, and professionals.   Sociology reviews sociological perspectives, methods of research, socialization and self-formation, cultures, society, theories of societies, social structure and the social process, social groups and organizations, deviance, law and crime, the family, social stratification, gender and sexuality, ethnicity and race, aging and the elderly, health care, collective behavior, social movements and social change.",
        "Category": " Social Science , Sociology , General",
        "Publisher": "Research & Education Association",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1995"
        }
    },
    {
        "Title": "Play to Your Strengths: Managing Your Internal Labor Markets for Lasting Competitive Advantage",
        "Authors": "By Nalbantian, Haig R. (EDT), Guzzo, Richard A., Kieffer, Dave, and Doherty, Jay",
        "Description": "The breakthrough approach for aligning people with strategy for higher profitsOrganizations that select, develop, deploy, manage, and motivate their people to produce outstanding business results have an extraordinary competitive advantage that others can't copy. Backed by Mercer's nine-year, $10 million study of leading companies around the world, Play to Your Strengths shows how to leverage a company's human capital strategy into business results that are measurable and profitable and that will create exceptional, enduring competitive advantages.This bottom-line-boosting guide gives managers, senior executives, and consultants the theory, tools, and processes they need to:Measure the effects of people on business results Determine the impact of strategies before making them Focus on the organization's most effective people strategies Deliver more money to the bottom line in a sustainable manner Create enduring, copy-proof competitive advantages",
        "Category": " Business & Economics , Management",
        "Publisher": "McGraw-Hill Education",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2003"
        }
    },
    {
        "Title": "Splendors of Ancient Egypt",
        "Authors": "By Peck, William H.",
        "Description": "Mummy portraits, tomb sculptures, and jewelry representing ancient Egyptian gods and goddesses, powerful rulers, and ordinary laborers come alive in this illustrated book. Concise descriptions of each work of art give essential information on the land, the people, the religion, and the afterlife - all fascinating aspects of this ancient culture.",
        "Category": "",
        "Publisher": "Abbeville Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "Complete Book of Birdhouses",
        "Authors": "By Russo, Monica and Dewire, Robert",
        "Description": "Reveals the most successful designs for all kinds of birdhouses and feeders, and demonstrates how to custom-build a house to attract a particular species of bird",
        "Category": "",
        "Publisher": "Random House Value Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1990"
        }
    },
    {
        "Title": "Misery Loves Maggody: An Arly Hanks Mystery (Maggody)",
        "Authors": "By Hess, Joan",
        "Description": "Misery Loves Maggody  And you will too.  Murder and mayhem have never been so hilarious as in the sleepy little town of Maggody, Arkansas. Population 755. And in this newest entry to the Joan Hess series, there's twice the fun when some of Maggody's most beloved inhabitants venture out of state. Meanwhile, all manner of unrest also unfolds on the familiar Maggody home front.  When beleaguered chief of police Arly Hanks hears that her mother, Ruby Bee, and best friend, Estelle Oppers, are headed for Memphis on a four-day Elvis Pilgrimage, she thinks she may be getting a break that is long overdue. But before the \"pilgrims\" are past the airport on the way out of Faberville, the fur starts flying, and soon the trip is completely stalled by a variety of deadly doings. Estelle calls home to report that Ruby Bee has collapsed and is in the local hospital, and even before Arly's seen the delta dawn, one of the other clients on the tour is found dead beneath the eighth-floor balcony of the hotel. Worse still, the balcony from which she plunged turns out to be none other than the room of a prominent Maggody citizen, who has been hauled off to the local jail. What's more, Estelle's pretty darn sure the tour van is being followed by thugs in an ominous black car -- and another body's about to be laid to rest in Graceland.  Back home things aren't much better and certainly no quieter, so Arly Hanks will have to be at her most resourceful to restore the peace once again to the inhabitants of Maggody -- both those at home and those who have roamed beyond the town limits.  Variously described by critics as a \"rollicking tour de force\" (Boston Magazine), \"Bawdy entertainment\" (Kirkus Reviews), \"Hilarious\" (St. Louis Post-Dispatch), \"delectable and continually surprising\" (The New York Times Book Review), Joan Hess's Maggody series is one of a kind and just keeps getting better.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "The Secret Diary of Anne Boleyn",
        "Authors": "By Maxwell, Robin",
        "Description": "In this \"energetic\" (Kirkus Reviews) re-creation of Anne Boleyn's tragic life -- and death -- Robin Maxwell offers a pitch-perfect version of a bawdy and exuberant time filled with lust, betrayal, love, and murder.  When the young Queen Elizabeth I is entrusted with Anne Boleyn's secret diary, she discovers a great deal about the much-maligned mother she never knew. And on learning the truth about her lascivious and despotic father, Henry VIII, she vows never to relinquish control to any man. But this avowal doesn't prevent Elizabeth from pursuing a torrid love affair with her horsemaster, Robin Dudley -- described with near-shocking candor -- as too are Anne's graphic trysts with a very persistent and lustful Henry. Blending a historian's attention to accuracy with a novelist's artful rendering, Maxwell weaves compelling descriptions of court life and devastating portraits of actual people into her naughty, page-turning tale. The result is a masterpiece of historical fiction -- so prophetic of our time that one would think it were ripped from today's headlines.",
        "Category": " Fiction , Historical , General",
        "Publisher": "Atria",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "1998"
        }
    },
    {
        "Title": "How to Write and Illustrate Children's Books",
        "Authors": "By Bicknell, Treld",
        "Description": "Covers classic fiction, contemporary themes, picture books, book production, fads, nonfiction, and careers as a children's writer or illustrator",
        "Category": " Language Arts & Disciplines , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Talk to Me: Travels in Media and Politics",
        "Authors": "By Smith, Anna Deavere",
        "Description": "Anna Deveare Smith's award-winning one-woman shows were borne of her uniquely brilliant ability to listen. In Talk to Me she applies her rare talent to the language of political power in America.Believing that character and language are inextricably bound, Smith sets out to discern the essence of America by listening to its people and trying to capture its politics. To that end she travels to some of America's most conspicuous places, like the presidential conventions of 1996, and some of its darkest corners, like a women's prison in Maryland. And along the way she interviews everyone from janitors to murderers to Bill Clinton himself. Memoir, social commentary, meditation on language, this book is as vastly ambitious as it is compellingly unique.",
        "Category": " Biography & Autobiography , Political",
        "Publisher": "Anchor",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "The Physics of Star Trek",
        "Authors": "By Krauss, Lawrence M.",
        "Description": "What warps when you're traveling at warp speed?  What's the difference between a holodeck and a hologram?  What happens when you get beamed up?  What's the difference between a wormhole and a black hole?   What is antimatter, and why does the Enterprise need it?  Are time loops really possible, and can I kill my grandmother before I am born?  Discover the answers to these and many other fascinating questions from a renowned physicist and dedicated Trekker.  Featuring a section on the top ten physics bloopers and blunders in Star Trek as selected by Nobel-Prize winning physicists and other devout Trekkers!  \"Today's science fiction is often tomorrow's science fact. The physics that underlines Star Trek is surely worth investigating. To confine our attention to terrestrial matters would be to limit the human spirit.\" --From the foreword by Stephen Hawking  NATIONAL BESTSELLER!  This book was not prepared, approved, licensed, or endorsed by any entity involved in creating or producing the Star Trek television series or films.",
        "Category": " Science , Physics , General",
        "Publisher": "HarperPb",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "Cruel As the Grave: A Medieval Mystery",
        "Authors": "By Penman, Sharon Kay",
        "Description": "Melangell had only just marked her fifteenth birthday. In the street where she, her father, and her little sister boarded, she had been loved by all, as much for her kind heart and generous nature as for her curly black hair and slender good looks. But someone had taken advantage of that sweetness, leaving her dead in St. Mary Magdalene's churchyard, her ripped bodice testimony to her struggle, a bloodstained stone cross the solitary witness to her death.Justin de Quincy was the queen's man, working on behalf of Eleanor of Aquitaine. His duty was clear: to find her missing son, Richard Lionheart, and prevent Prince John from usurping Richard's throne. What had he to do with a commonplace murder, with the death of a poor man's child? But little by little, Justin comes to feel the force of the dead girl, perhaps even to love her as well, and he soon commits to finding her killer. But can he also bring him to justice?",
        "Category": " Fiction , Mystery & Detective , General",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1998"
        }
    },
    {
        "Title": "Billy Martin",
        "Authors": "By Schoor, Gene",
        "Description": "",
        "Category": "",
        "Publisher": "Doubleday",
        "Price Starting With ($)": "5.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Wilfred Grenfell: His Life and Work",
        "Authors": "By Kerr, James Lennox",
        "Description": "",
        "Category": "",
        "Publisher": "Dodd, Mead & company",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1959"
        }
    },
    {
        "Title": "What to Do When You're Having a Baby (What to Do for Health)",
        "Authors": "By Mayer, Gloria G. and Kuklierus, Ann",
        "Description": "",
        "Category": " Health & Fitness , Pregnancy & Childbirth",
        "Publisher": "Institute for Healthcare Advancement",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Robinson Crusoe",
        "Authors": "By Daniel Defoe",
        "Description": "",
        "Category": "",
        "Publisher": "Modern Promotions",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1982"
        }
    },
    {
        "Title": "E.M. Forster",
        "Authors": "By Summers, Claude J.",
        "Description": "",
        "Category": "",
        "Publisher": "Ungar Pub Co",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1987"
        }
    },
    {
        "Title": "First Feline",
        "Authors": "By Gerberg, Mort",
        "Description": "The new presidential pet shows what it's like living with the candidate, moving to the White House, and coping with his new position",
        "Category": " Humor , General",
        "Publisher": "Zebra",
        "Price Starting With ($)": "5.57",
        "Publish Date": {
            "Month": "February",
            "Year": "1993"
        }
    },
    {
        "Title": "Making Things Grow",
        "Authors": "By Cruso, Thalassa",
        "Description": "",
        "Category": "",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "10.98",
        "Publish Date": {
            "Month": "September",
            "Year": "1969"
        }
    },
    {
        "Title": "Maestro: Greenspans Fed And The American Boom",
        "Authors": "By Woodward, Bob",
        "Description": "In eight Tuesdays each year, Federal Reserve chairman Alan Greenspan convenes a small committee to set the short-term interest rate that can move through the American and world economies like an electric jolt. As much as any, the committee's actions determine the economic well-being of every American. The availability of money for business or consumer loans, mortgages, job creation and overall national economic growth flows from those decisions. Perhaps the last Washington secret is how the Federal Reserve and its enigmatic chairman, Alan Greenspan, operate. In Maestro, Bob Woodward takes you inside the Fed and Greenspan's thinking. We listen to the Fed's internal debates as the American economy is pushed into a historic 10-year expansion while the world economy lurches from financial crisis to financial crisis. Greenspan plays a sometimes subtle, sometimes blunt behind-the-scenes role. He appears in Maestro up close as never before -- alternately nervous and calm, plunging into mathematics one moment and politics the next, skeptical, dispassionate, always struggling -- often alone.  Maestro traces a fascinating intellectual journey as Greenspan, an old-school anti-inflation hawk of the traditional economy, is among the first to realize the potential in the modern, high-productivity new economy -- the foundation of the current American boom. Woodward's account of the Greenspan years is a remarkable portrait of a man who has become the symbol of American economic preeminence.",
        "Category": " Business & Economics , Economics , General",
        "Publisher": "Simon & Schuster",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2000"
        }
    },
    {
        "Title": "Audubon, Homer, Whistler and 19th Century America",
        "Authors": "By Wilmerding, John",
        "Description": "",
        "Category": "",
        "Publisher": "The McCall Publishing Company",
        "Price Starting With ($)": "5.04",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Perfect Madness: Motherhood in the Age of Anxiety",
        "Authors": "By Warner, Judith",
        "Description": "A lively and provocative look at the modern culture of motherhood and at the social, economic, and political forces that shaped current ideas about parenting     What is wrong with this picture? That's the question Judith Warner asks in this national bestseller after taking a good, hard look at the world of modern parenting--at anxious women at work and at home and in bed with unhappy husbands.     When Warner had her first child, she was living in Paris, where parents routinely left their children home, with state-subsidized nannies, to join friends in the evening for dinner or to go on dates with their husbands. When she returned to the States, she was stunned by the cultural differences she found toward how people think about effective parenting--in particular, assumptions about motherhood. None of the mothers she met seemed happy; instead, they worried about the possibility of not having the perfect child, panicking as each developmental benchmark approached.     Combining close readings of mainstream magazines, TV shows, and pop culture with a thorough command of dominant ideas in recent psychological, social, and economic theory, Perfect Madness addresses our cultural assumptions, and examines the forces that have shaped them.     Working in the tradition of classics like Betty Friedan's The Feminine Mystique and Christopher Lasch's The Culture of Narcissism, and with an awareness of a readership that turned recent hits like The Bitch in the House and Allison Pearson's I Don't Know How She Does It into bestsellers, Warner offers a context in which to understand parenting culture and the way we live, as well as ways of imagining alternatives--actual concrete changes--that might better our lives.",
        "Category": " Family & Relationships , Parenting , Motherhood",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Greek Experiment Imperialism and Social Conflict, 80",
        "Authors": "By Littman, Robert J.",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt College Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1974"
        }
    },
    {
        "Title": "Science and Health with Key to the Scriptures (Authorized, Trade Ed.)",
        "Authors": "By Eddy, Mary Baker",
        "Description": "",
        "Category": " Religion , Religion & Science",
        "Publisher": "The Christian Science Board of Directors",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "October",
            "Year": "1994"
        }
    },
    {
        "Title": "Sometimes Madness Is Wisdom: Zelda and Scott Fitzgerald: A Marriage (Ballantine Reader's Circle)",
        "Authors": "By Taylor, Kendall",
        "Description": "Irresistibly charming, recklessly brilliant, Zelda and Scott Fitzgerald epitomized everything that was beautiful and damned about the Jazz Age. But behind the legend, there was a highly complex and competitive marriage–a union not of opposites but almost of twins who both inspired and tormented each other, and who were ultimately destroyed by their shared fantasies. Now in this frank, stylish, superbly written new book, Kendall Taylor tells the story of the Fitzgerald marriage as it has never been told before.Following the success of Fitzgerald’s first novel, This Side of Paradise, Scott and Zelda took New York by storm. Scott was recognized as the greatest American author of the twenties and everyone was fascinated with Zelda, his ravishing young wife, known as the model for all his flapper heroines. Ultimately it all fell apart, and Kendall Taylor tells us why. Drawing on previously suppressed material, including crucial medical records, Taylor sheds fresh light on Zelda’s depths and mysteries–her rich but largely unrealized artistic talents, her own ambitions that were unfulfilled because she was Mrs. F. Scott Fitzgerald, her passionate love affairs. Zelda’s contribution to Scott’s fiction, which was based on her diaries, her letters, and her life, was her only great achievement–and for that she may have paid the terrible price of her own sanity.In Sometimes Madness Is Wisdom, Kendall Taylor has created the definitive Fitzgerald biography. Written with sympathy, original insight, and dazzling style–and featuring memorable appearances from Edmund Wilson, Gertrude Stein, and Ernest Hemingway, among others–this is a stunning portrait of a marriage, an age, and a fabulous but tragic woman.From the Hardcover edition.",
        "Category": " Biography & Autobiography , Literary",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "6.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2003"
        }
    },
    {
        "Title": "Air Time: The Inside Story of CBS News",
        "Authors": "By Gates, Gary Paul",
        "Description": "",
        "Category": "",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "May",
            "Year": "1978"
        }
    },
    {
        "Title": "Churchill As War Leader",
        "Authors": "By Lamb, Richard",
        "Description": "A look at Churchill's role as leader during World War II reveals how the prime minister made serious blunders that he later attempted to cover up and explores his relations with President Roosevelt.",
        "Category": "",
        "Publisher": "Carroll & Graf Publishers",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "April",
            "Year": "1993"
        }
    },
    {
        "Title": "America's Best Recipes",
        "Authors": "By Hanley, Rosemary",
        "Description": "A selection of more than 250 recipes that have won blue ribbons at state fairs across the country represents a wide range of both innovative and traditional American dishes",
        "Category": " Cooking , General",
        "Publisher": "Little Brown & Co",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1986"
        }
    },
    {
        "Title": "Correspondence of F. Scott Fitzgerald",
        "Authors": "By Fitzgerald, F. Scott",
        "Description": "",
        "Category": "",
        "Publisher": "RANDOM HOUSE",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "January",
            "Year": "1980"
        }
    },
    {
        "Title": "Caleb Williams",
        "Authors": "By Godwin, William and Hindle, Maurice",
        "Description": "",
        "Category": " Literary Criticism , General",
        "Publisher": "Penguin Classics",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1988"
        }
    },
    {
        "Title": "Caesar's Hours: My Life in Comedy, With Love and Laughter",
        "Authors": "By Caesar, Sid and Friedfeld, Eddy",
        "Description": "Sid Caesar's place in comedy history is assured by his shows from the \"Golden Age of Television,\"  Your Show of Shows  and  Caesar's Hour . In this memoir he recounts his entry into comedy and the course of his career, describes the origins of some of his most famous sketches, and reminisces about other comedians he's worked with (including Carl Reiner, Mel Brooks, and Woody Allen). Annotation (c) Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Performing Arts , Comedy",
        "Publisher": "PublicAffairs",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "November",
            "Year": "2003"
        }
    },
    {
        "Title": "The Rorschach, a Comprehensive System Vol. 1: Basic Foundations (Wiley Series on Personality Processes) (Volume 1)",
        "Authors": "By Exner, John E. and Weiner, Irving B.",
        "Description": "",
        "Category": " Psychology , Assessment, Testing & Measurement",
        "Publisher": "Wiley",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "February",
            "Year": "1986"
        }
    },
    {
        "Title": "Blunder Book: Gigantic",
        "Authors": "By Goldberg, Hirsh M. and Driver, Ray (ILT)",
        "Description": "The Blunder Book: Colossal Errors, Minor Mistakes, and Surprising Slipups that have changed the course of history. The pantheon of error making is large and always growing. History is replete with notables who have made serious mistakes, who have every right to hide their red faces from the limelight: people like Columbus, Gutenburg, Washington, Einstein. All of them -- and many others -- have had to overcome the errors of their ways to make their marks in the world.This book presents the many ways in which error has become ingrained in our government, science, medicine, and the arts, how error has changed history, crept into our libraries, altered our thoughts, and affected out daily existence.",
        "Category": " Reference , Curiosities & Wonders",
        "Publisher": "William Morrow Paperbacks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1988"
        }
    },
    {
        "Title": "Mathematical Magic Show: More Puzzles, Games, Diversions, Illusions and Other Mathematical Sleight-Of-Mind from Scientific American",
        "Authors": "By Gardner, Martin",
        "Description": "A dictionary of games, puzzles, and tricks that move from Nothing to Everything and range from finger arithmetic to game theory",
        "Category": " Mathematics , General",
        "Publisher": "Random House, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1978"
        }
    },
    {
        "Title": "Adolescent religion;: A developmental study of the religion of youth",
        "Authors": "By Charles William Stewart",
        "Description": "",
        "Category": "",
        "Publisher": "Abingdon Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1967"
        }
    },
    {
        "Title": "The People Called Shakers",
        "Authors": "By Andrews, Edward Deming",
        "Description": "\"A substantial contribution to American history.\" — The New York Times. Definitive study provides detailed coverage of origins, ideology, industry and art, mode of worship, internal organization of communities. Author's reliance on original manuscript material, contemporary illustrations make this study especially useful to students of American social and religious movements. 33 illustrations.",
        "Category": " Music , Genres & Styles , Folk & Traditional",
        "Publisher": "Dover Publications",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "2011"
        }
    },
    {
        "Title": "Recipes to Rona: Kitchen Bazaar's nostalgic collection of world wide family favorites",
        "Authors": "By Cohen, Rona",
        "Description": "",
        "Category": "",
        "Publisher": "Kitchen Bazaar",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "The New Russia: Troubled Transformation",
        "Authors": "By Lapidus, Gail W. (EDT)",
        "Description": "In this book, distinguished U.S. and Russian scholars analyze the great challenges confronting post-Communist Russia and examine the Yeltsin government's attempts to deal with them. Focusing on problems of state- and nation-building, economic reform, demilitarization, and the definition of Russia's national interests in its relations with the outside world, the authors trace the complex interplay between the communist legacy and efforts to chart new directions in both domestic and foreign policy. They give special attention to the defeat of liberal reformers in the latest parliamentary elections and to the implications of that shift for Russia's domestic and foreign policy in the years ahead.",
        "Category": " History , Russia & the Former Soviet Union",
        "Publisher": "Routledge",
        "Price Starting With ($)": "5.93",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "The Threat and the Glory: Reflections on Science and Scientists",
        "Authors": "By Medawar, P. B and Pyke, David (EDT)",
        "Description": "Originally published in Great Britain in 1959, this is the first US edition of a collection of essays by the late Nobel Prize-winning (1960, for work in immunology) biologist that range over genetics, evolution, philosophy, creativity, scientific fraud, and attitudes toward death. With a foreword by Lewis Thomas and an introduction by David Pyke. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Science , General",
        "Publisher": "HarperCollins",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1990"
        }
    },
    {
        "Title": "Getting in Touch with Your Inner Bitch",
        "Authors": "By Hilts, Elizabeth",
        "Description": "",
        "Category": " Humor , General",
        "Publisher": "Sourcebooks",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Dora's Eggs",
        "Authors": "By Chapman, Jane (ILT) and Sykes, Julie",
        "Description": "As she goes around seeing the babies of the other farmyard animals, Dora becomes less and less proud of her first eggs--until they hatch into cute chicks",
        "Category": " Juvenile Fiction , Animals , Farm Animals",
        "Publisher": "Little Tiger Pr",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "March",
            "Year": "1997"
        }
    },
    {
        "Title": "Dried flower gardening",
        "Authors": "By Sheen, Joanna, Alexander, Caroline",
        "Description": "",
        "Category": "",
        "Publisher": "WARD LOCK",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Surviving Personal Bankruptcy: Your Guide to the Personal, Legal, and Financial Issues",
        "Authors": "By Raum, Nora",
        "Description": "An NPR newscaster and bankruptcy attorney provides compassionate, step-by-step advice on the legal and practical aspects of regaining financial security, presenting the options and alternatives that are currently available, recommendations for hiring a lawyer, and suggestions on how to approach credit-reporting agencies and creditors. Original. 30,000 first printing.",
        "Category": " Business & Economics , Personal Finance , Money Management",
        "Publisher": "Gotham",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2005"
        }
    },
    {
        "Title": "Thomas Beecham;: An independent biography",
        "Authors": "By Charles Reid",
        "Description": "",
        "Category": "",
        "Publisher": "Dutton",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "My First Passover",
        "Authors": "By dePaola, Tomie",
        "Description": "Passover is a time for families and friends to celebrate their faith and shared history. Tomie dePaola’s simple text and beautiful illustrations provide insight into this special holiday for young readers.",
        "Category": " Juvenile Nonfiction , Holidays & Celebrations , Passover",
        "Publisher": "Putnam Juvenile",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1991"
        }
    },
    {
        "Title": "America from Space",
        "Authors": "By Allen, Thomas B.",
        "Description": "From the sprawling cities of California to Maine's island-flecked coast, from the glaciers of Alaska to the beaches of Florida, here is the United States as you have never seen it before.    America from Space takes you into orbit over the United States. You see what Space Shuttle astronauts see when they aim their camera at their homeland. Here is America by night, a breathtaking view of the entire nation pulsating with lights marking cities and suburbs. Here are the Great Lakes, the mountains and cities, rivers and seashores -- each image a piece of the nation. Together they create a unique and fascinating portrait of the United States of America.    Sections of this book include:    Fire and Ice: Hawaii and Alaska  The West Coast: from Washington to the Mexican border  The West: the wild lands of deserts and canyon  The Rockies: the backbone of            the continent  The Heartland: the grandeur of the Great Plains  The Great Lakes: deep waters and fertile lands  The Southland: Blue Ridge Mountains, New Orleans, Florida  The Northeast Corridor: an urban swath along the coast.    In Wyoming's Bighorn Basin, stunning views are transformed into geological data: bright yellow marks an oil field, orange shows a mesa; red, purple and blue color irrigated field. In a flood region of Texas, varying blue and purple shades show what lands were under water.    What the images show most of all is the beauty of the land and the seas that touch it. \"Life is like landscape,\" Charles Lindbergh wrote after his historic solo flight across the Atlantic. \"You live in the midst of it, but can describe it only from the vantage point of distance.\" Here is a new vantage point, a new way of seeing and understanding our country.",
        "Category": " Photography , General",
        "Publisher": "Firefly Books",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "March",
            "Year": "2001"
        }
    },
    {
        "Title": "Top Shelf On Parade",
        "Authors": "By Warnock, Brett (EDT)",
        "Description": "Brett Warnock began publishing in 1995 with the anthology TOP SHELF. Created in the spirit of promoting the careers of up-and-coming cartoonists, the anthology has since grown in scope and size, garnering critical accolades, as well as Best Anthology nominations from both the Harvey and Ignatz Awards. This anthology helped Top Shelf become a leader in discovering and showcasing the vanguard of the alternative comics scene.",
        "Category": " Comics & Graphic Novels , Anthologies",
        "Publisher": "Top Shelf Productions",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2002"
        }
    },
    {
        "Title": "Happy Birthday, Thomas! (Step-Into-Reading, Step 2)",
        "Authors": "By Awdry, W. and Bell, Owain (ILT)",
        "Description": "Illus. in full color. It's Thomas's birthday, but where are all the presents, balloons, and silly hats? Thomas thinks his friends have forgotten, but they may have a surprise for him.  From the Trade Paperback edition.",
        "Category": " Juvenile Fiction , Transportation , Railroads & Trains",
        "Publisher": "Random House Books for Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1990"
        }
    },
    {
        "Title": "Heinerman's Encyclopedia of Fruits, Vegetables, and Herbs",
        "Authors": "By Heinerman, John",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "PARKER",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1988"
        }
    },
    {
        "Title": "Down the Volga: A Journey Through Mother Russia in a Time of Troubles",
        "Authors": "By de Villiers, Marq",
        "Description": "A travel writer who took the \"Mother Volga\" river and traveled two thosand miles through Russia presents a study of the heart of Russia, discussing the land, the concerns of its people, and such sites as the birthplace of Lenin",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Viking Adult",
        "Price Starting With ($)": "4.89",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Living the Topmost Years: A Compilation of Letters from Clara Cassidy 1985-1986",
        "Authors": "By Cassidy, Clara (McGrew)",
        "Description": "",
        "Category": "",
        "Publisher": "Clara McGrew Cassidy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "The Raiders: The Elite Strike Forces That Altered the Course of War and History",
        "Authors": "By Garrett, Richard",
        "Description": "",
        "Category": " Political Science , General",
        "Publisher": "Van Nostrand Reinhold",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1980"
        }
    },
    {
        "Title": "The Essential Adoption Handbook",
        "Authors": "By Alexander-Roberts, Colleen",
        "Description": "Offers step-by-step advice on adoption, discusses single parent adoption, and describes adoptive parent support groups",
        "Category": " Family & Relationships , Adoption & Fostering",
        "Publisher": "Taylor Trade Publishing",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Cook-Off America: Prize-Winning Recipes from the Public Television Series (PBS Cooking)",
        "Authors": "By Bristol",
        "Description": "",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Bristol Publishing Enterprises Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "A history of the University of Maryland",
        "Authors": "By Callcott, George H",
        "Description": "",
        "Category": "",
        "Publisher": "Maryland Historical Society",
        "Price Starting With ($)": "16.17",
        "Publish Date": {
            "Month": "January",
            "Year": "1966"
        }
    },
    {
        "Title": "He's Just Not That Into You: The No-Excuses Truth to Understanding Guys",
        "Authors": "By Behrendt, Greg and Tuccillo, Liz",
        "Description": "The Instant New York Times BestsellerHe's Just Not That Into You -- based on the popular episode of Sex and the City -- educates otherwise smart women on how to tell when a guy just doesn't like them enough, so they can stop wasting time making excuses for a dead-end relationship.Reexamining familiar scenarios and classic mindsets that keep us in unsatisfying relationships, Greg Behrendt and Liz Tuccillo's wise and wry understanding of the sexes spares women hours of waiting by the phone, obsessing over the details with sympathetic girlfriends, and hoping his mixed messages really mean \"I'm in love with you and want to be with you.\"He's Just Not That Into You is provocative, hilarious, and, above all, intoxicatingly liberating. It knows you're a beautiful, smart, funny woman who deserves better. The next time you feel the need to start \"figuring him out,\" consider the glorious thought that maybe He's Just Not That Into You.  And then set yourself loose to find the one who is.",
        "Category": " Self-help , General",
        "Publisher": "Simon & Schuster Audio",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "November",
            "Year": "2004"
        }
    },
    {
        "Title": "I Ching",
        "Authors": "By Huang, Kerson and Huang, Rosemary",
        "Description": "For three thousand years, people have sought personal insight and a window on the future from the I Ching, or the Book of Changes, the classic Chinese oracle and book of wisdom. Drawing on archeological findings, previously published only in Chinese, indicating how the I Ching was actually used by those who created it, and motivated by a lifetime of personal use and fascination, Kerson Huang has created a new translation of great significance. Restoring the I Ching to its original form, Huang underscores its first use as a practical oracle by Chinese farmers. His translation beautifully preserves the starkly poetic voice of the original, while his comments clearly and simply explain the images and detail the historical references buried within the verse. Huang reveals the I Ching as an epic poem equivalent to The Iliad and The Odyssey--one hexagram recalls the dethroning of Feng Feng; a series of lines portray Wang Hai, one of the three High Ancestors of the Shang dynasty; a third contains a sage proclamation of Lord Tang. Each hexagram and its corresponding interpretation is presented on a two-page spread, making this version unusually easy to use and understand. Introductory chapters detail the evolution of the I Ching, from the philosophical reinterpretations of Confucius to the modern musings of Carl Jung, and clearly explain both the coin method and yarrow-stalk method for consulting the oracle. Over 55,000 copies in print.",
        "Category": " Body, Mind & Spirit , I Ching",
        "Publisher": "Workman Publishing Company",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1987"
        }
    },
    {
        "Title": "Shooting Straight: Telling the Truth About Guns in America",
        "Authors": "By Lapierre, Wayne and Baker, James Jay",
        "Description": "LaPierre is the current CEO of the National Rifle Association of America (NRA); Baker is the former director of the NRA's Institute for Legislative Action.  Through a critique of the tactics used by anti-gun advocates in the gun-control lobby, Congress, and the country's media, they argue in favor of the right to gun ownership in the U.S.  Written for gun-owning Americans, this text may also be informative to readers who are against gun ownership. ^ Annotation c. Book News, Inc., Portland, OR (booknews.com)",
        "Category": " Political Science , International Relations , Arms Control",
        "Publisher": "Regnery Publishing",
        "Price Starting With ($)": "5.31",
        "Publish Date": {
            "Month": "July",
            "Year": "2002"
        }
    },
    {
        "Title": "100 Years of the U.S. Open: A Century of Excellence",
        "Authors": "By Garber, Greg and Delery, John",
        "Description": "",
        "Category": " Sports & Recreation , Golf",
        "Publisher": "Metro Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2000"
        }
    },
    {
        "Title": "Herblock Through the Looking Glass",
        "Authors": "By Block, Herbert",
        "Description": "More than two hundred satirical drawings supported by a text that provides a background of events and analysis comment on the policies and proclivities of the Reagan administration",
        "Category": " Humor , Form , Comic Strips & Cartoons",
        "Publisher": "W W Norton & Co Inc",
        "Price Starting With ($)": "5.58",
        "Publish Date": {
            "Month": "January",
            "Year": "1984"
        }
    },
    {
        "Title": "The Roosevelt Women: A Portrait In Five Generations",
        "Authors": "By Caroli, Betty Boyd",
        "Description": "The Roosevelt name conjures up images of powerful Presidents and dashing men of high society. But few people know much about the extraordinary network of women that held the Roosevelt clan together through war, scandal, and disease. In The Roosevelt Women, Betty Boyd Caroli weaves together stories culled from a rich store of letters, memoirs, and interviews to chronicle nine extraordinary Roosevelt women across a century and a half of turbulent history.She examines the Roosevelt women as mothers, daughters, wives, and, beyond that, as world travelers, authors, campaigners, and socialites&#151;in short, as themselves. She reveals how they demonstrated the energy and intellectual curiosity that defined their famous family, as well as the roles they played in the intrigues, scandals, and accomplishments that were hallmarks of the Roosevelt clan. From the much maligned Sara Delano (who sired Franklin and by turns terrified and supported Eleanor) to Theodore&#39;s irrepressible daughter, Alice (”I can either rule the country or control Alice,” Teddy once said) to the beloved Bamie, who was the only mother Alice ever knew, and the model of everything she never was in life, to the exceptionally beautiful but ultimately overwhelmed Mittie, Theodore&#39;s mother, The Roosevelt Women is an intricate portrait of bold and talented women, a grand tale of both unbearable tragedies and triumphant achievements.",
        "Category": " Science , Life Sciences , Biology",
        "Publisher": "Basic Books",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "December",
            "Year": "1999"
        }
    },
    {
        "Title": "The wanting of Levine",
        "Authors": "By Halberstam, Michael",
        "Description": "",
        "Category": "",
        "Publisher": "Lippincott",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "January",
            "Year": "1978"
        }
    },
    {
        "Title": "The Fighting Spirit: A Championship Season at Notre Dame",
        "Authors": "By Holtz, Lou and Heisler, John",
        "Description": "Notre Dame's head football coach chronicles the events of a season, from recruitment, to the early practices, to the final dramatic games, detailing the intricacies of a successful football program",
        "Category": " Sports & Recreation , General",
        "Publisher": "Pocket Books",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "The Rosenberg File: A Search for the Truth",
        "Authors": "By Milton, Joyce and Radosh, Ronald",
        "Description": "Based on extensive research in government files, papers, unpublished memoirs, and numerous interviews this account chronicles the history of the Rosenberg spy case",
        "Category": " Literary Criticism , European , German",
        "Publisher": "Henry Holt & Co",
        "Price Starting With ($)": "8.79",
        "Publish Date": {
            "Month": "September",
            "Year": "1983"
        }
    },
    {
        "Title": "The Spirit of Jewish Thought",
        "Authors": "By Evslin, B (Ed.)",
        "Description": "",
        "Category": "",
        "Publisher": "Grosset & Dunlap",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "The American West",
        "Authors": "By Brown, Dee and Schmitt, Martin Ferdinand (EDT)",
        "Description": "Renowned storyteller Dee Brown, author of the bestselling Bury My Heart at Wounded Knee, recreates the struggles of Native Americans, settlers, and ranchers in this stunning volume that illuminates the history of the old West that’s filled with maps and vintage photographs.Beginning with the demise of the Native Americans of the Plains, Brown depicts the onrush of the burgeoning cattle trade and the waves of immigrants who ultimately “settled” the land. In the retelling of this oft-told saga, Brown has demonstrated once again his abilities as a master storyteller and an entertaining popular historian. By turns heroic, tragic, and even humorous, The American West brings to life American tragedy and triumph in the years from 1840 to the turn of the century, and a roster of characters both great and small: Red Cloud, Sitting Bull, Geronimo, Dull Knife, Crazy Horse, Captain Jack, John H. Tunstall, Billy the Kid, Pat Garrett, Wyatt Earp, the Hole-in-the-Wall Gang, Wild Bill Hickok, Charles Goodnight, Oliver Loving, Buffalo Bill, and many others. The American West is about cattle and the railroads; it is about settlers who came to claim a land not originally their own and how they slowly imposed law and order on these wild and untamed places; and it is about the wanton destruction of the Native American way of life. This is epic history at its best and popular history at its most readable. This new work is culled from Dee Brown’s highly acclaimed writings, which instantly established him as one of America’s foremost Western authorities. Fully revised, rewritten, and edited into one seamless account of America’s most famous frontier, this epic narrative, along with the introduction and a chronological table of events, etches an unforgettable and poignant portrait. The American West is at once a tribute to the West and a majestic new peak for a writer whose long and successful career has been synonymous with excellence in frontier history.",
        "Category": " History , United States , State & Local , West (AK, CA, CO, HI, ID, MT, NV, UT, WY)",
        "Publisher": "Touchstone",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "November",
            "Year": "1995"
        }
    },
    {
        "Title": "The Ten Commandments of Character: Essential Advice for Living an Honorable, Ethical, Honest Life",
        "Authors": "By Telushkin, Joseph Rabbi",
        "Description": "A companion volume to The Book of Jewish Values outlines ten important commandments of character--ranging from being kind and showing gratitude to exercising self-control--that can be used to make the ethical choice in issues regarding marriage and family, friendship, community, work, financial affairs, and more. 30,000 first printing.",
        "Category": " Religion , Ethics",
        "Publisher": "Harmony/Bell Tower",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Contemporary Machine Embroidery",
        "Authors": "By Gonet, Deborah",
        "Description": "Discusses basic equipment and materials, reviews techniques, and provides patterns and instructions for embroidering shirts, vests, scarves, handbags, hats, and home furnishings",
        "Category": " Crafts & Hobbies , Needlework , Embroidery",
        "Publisher": "UNKNO",
        "Price Starting With ($)": "5.43",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "The New Terrorism: Fanaticism and the Arms of Mass Destruction",
        "Authors": "By Laqueur, Walter",
        "Description": "Recent attacks in Oklahoma City, at the World Trade Towers, and at American embassies in Africa demonstrate the horrifying consequences of a terrorist strike. But as technological advances make weapons of mass destruction frighteningly easy to acquire, a revolution is occurring in the very nature of terrorism--one that may make these attacks look like child's play.   In The New Terrorism Walter Laqueur, one of the foremost experts on terrorism and international strategic affairs, recounts the history of terrorism and, more importantly, examines the future of terrorist activity worldwide. Laqueur traces the chilling trend away from terrorism perpetrated by groups of oppressed nationalists and radicals seeking political change to small clusters of fanatics bent on vengeance and simple destruction. Coinciding with this trend is the alarming availability of weapons of mass destruction. Chemical and biological weapons are cheap and relatively easy to make or buy. Even nuclear devices are increasingly feasible options for terrorists. And with the information age, cyber terrorism is just around the corner. Laqueur argues that as a new quasi-religious extreme right rises, with more personal and less ideological motivations than their left-wing counterparts, it is only a matter of time before the attainability of weapons of mass destruction creates a terrifying and unstable scenario.     From militant separatism in Kashmir to state-sponsored extremism in Libya and ecoterrorism in the West, The New Terrorism offers a thorough account of terrorism in all its past and current manifestations. Most importantly, it casts a sober eye to the future, when the inevitable marriage of technology and fanaticism will give us all something new to think about.",
        "Category": " Political Science , International Relations , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2000"
        }
    }
]