[
    {
        "Title": "Don't Waste Your Sorrows: New Insight into God's Eternal Purpose for Each Christian in the Midst of Life's Greatest Adversities",
        "Authors": "By Billheimer, Paul E.",
        "Description": "",
        "Category": " Religion , General",
        "Publisher": "Bethany House Pub",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1983"
        }
    },
    {
        "Title": "Gravity Dreams",
        "Authors": "By Modesitt, L. E.",
        "Description": "In Earth's distant future, Tyndel is both teacher and mentor, a staunch devotee to his conservative and rigidly structured religious culture. Then a rogue infection of nanotechnology transforms him into a \"demon\", something more than human, and he is forced into exile, fleeing to the more technologically advanced space-faring civilization that lies to the north, one that his own righteous people consider evil. Although shaken by his transformation, he has the rare talent required to become a space pilot. What no one, least of all Tyndel, expects, is his deep-space encounter with a vastly superior being--perhaps with God.",
        "Category": " Fiction , Science Fiction , Adventure",
        "Publisher": "Tor Science Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2000"
        }
    },
    {
        "Title": "Breathing Room: Poems",
        "Authors": "By DAVISON, Peter.",
        "Description": "Celebrating the ever-changing cycle of the seasons, this new collection of poetry explores the topics of growing old, death and rebirth, memory, parents, and the literary life.",
        "Category": " Poetry , American , General",
        "Publisher": "Knopf",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2000"
        }
    },
    {
        "Title": "Assessing Adolescent and Adult Intelligence",
        "Authors": "By Kaufman, Alan S.",
        "Description": "This text/reference concerns the clinical assessment of the intelligence of adolescents and adults. In addition to the Wechsler Adults Intelligence Scale (WAIS-R), other instruments are also integrated with the WAIS-R to aid clinicians in assessing individuals with brain damage, learning disabilities, mental retardation, Alzheimer's disease, psychiatric disorders, and a variety of neuropsychiatric disabilities. Annotation copyright Book News, Inc. Portland, Or.",
        "Category": " Psychology , Assessment, Testing & Measurement",
        "Publisher": "Allyn & Bacon",
        "Price Starting With ($)": "10.99",
        "Publish Date": {
            "Month": "April",
            "Year": "1990"
        }
    },
    {
        "Title": "Fractals: Endlessly Repeated Geometrical Figures",
        "Authors": "By Lauwerier, Hans and Gill-Hoffstadt, Sophia (TRN)",
        "Description": "Fractals are shapes in which an identical motif repeats itself on an ever diminishing scale. A coastline, for instance, is a fractal, with each bay or headland having its own smaller bays and headlands--as is a tree with a trunk that separates into two smaller side branches, which in their turn separate into side branches that are smaller still. No longer mathematical curiosities, fractals are now a vital subject of mathematical study, practical application, and popular interest. For readers interested in graphic design, computers, and science and mathematics in general, Hans Lauwerier provides an accessible introduction to fractals that makes only modest use of mathematical techniques. Lauwerier calls this volume a \"book to work with.\" Readers with access to microcomputers can design new figures, as well as re-create famous examples. They can start with the final chapter, try out one of the programs described there (preferably in a compiled version such as TURBO BASIC), and consult the earlier chapters for whatever is needed to understand the fractals produced in this way. The first chapter, which builds on the relationship of binary number systems to the \"tree fractal\" described above, is the best place to start if one has no computer. There will be much to enjoy on the way, including the beautiful color illustrations.",
        "Category": " Mathematics , Geometry , General",
        "Publisher": "Princeton University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1991"
        }
    },
    {
        "Title": "Streams of Confusion: Thirteen Great Ideas That Are Contaminating Our Thought and Culture",
        "Authors": "By Scott, Brad",
        "Description": "",
        "Category": " Religion , Christian Theology , General",
        "Publisher": "Crossway Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1999"
        }
    },
    {
        "Title": "Chairman-X",
        "Authors": "By Loya, Rami",
        "Description": "",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "AuthorHouse",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "2007"
        }
    },
    {
        "Title": "Until Tuesday: A Wounded Warrior and the Golden Retriever Who Saved Him",
        "Authors": "By Witter, Bret (CON) and Montalvan, Luis Carlos",
        "Description": "\"We aren't just service dog and master;Tuesday and I are also best friends. Kindred souls. Brothers.Whatever you want to call it. We weren't made for each other,but we turned out to be exactly what the other needed.\"A highly decorated captain in the U.S. Army, Luis Montalván never backed down from a challenge during his two tours of duty in Iraq. After returning home from combat, however, the pressures of his physical wounds, traumatic brain injury, and crippling post-traumatic stress disorder began to take their toll. Haunted by the war and in constant physical pain, he soon found himself unable to climb a simple flight of stairs or face a bus ride to the VA hospital. He drank; he argued; ultimately, he cut himself off from those he loved. Alienated and alone, unable to sleep or bend over without pain, he began to wonder if he would ever recover.Then Luis met Tuesday, a beautiful and sensitive golden retriever trained to assist the disabled. Tuesday had lived amongst prisoners and at a home for troubled boys, blessing many lives; he could turn on lights, open doors, and sense the onset of anxiety and flashbacks. But because of a unique training situation and sensitive nature, he found it difficult to trust in or connect with a human being-until Luis.Until Tuesday is the story of how two wounded warriors, who had given so much and suffered the consequences, found salvation in each other. It is a story about war and peace, injury and recovery, psychological wounds and spiritual restoration. But more than that, it is a story about the love between a man and dog, and how together they healed each other's souls.",
        "Category": " Pets , Dogs , General",
        "Publisher": "Hachette Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "The Death by Bikini Mysteries (The Death by ... Mysteries)",
        "Authors": "By Gerber, Linda",
        "Description": "All three of the hit Death by Bikini Mysteries now available in one fabulously priced volume! Aphra Connolly was living a quiet, teenaged life. But that was before devastatingly handsome Seth Mulo turned up at her family's island resort. And that was before a girl-the strings of her bikini top tight around her neck-was discovered dead on the beach. Without warning, Aphra is plunged into a vast conspiracy that takes her from Seattle to Paris to Italy. And, in the end, Aphra and Seth will be lucky to escape with their lives-and hearts-intact.",
        "Category": " Young Adult Fiction , Law & Crime",
        "Publisher": "Speak",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2011"
        }
    },
    {
        "Title": "Magic in marriage.",
        "Authors": "By James H Jauncey",
        "Description": "",
        "Category": "",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1970"
        }
    },
    {
        "Title": "Me, Myself, and Them: A Firsthand Account of One Young Person's Experience with Schizophrenia (Adolescent Mental Health Initiative)",
        "Authors": "By Andrews, Linda Wasmer, Gur, Raquel E., and Snyder, Kurt",
        "Description": "During his second semester at college, Kurt Snyder became convinced that he was about to discover a fabulously important mathematical principle, spending hours lost in daydreams about numbers and symbols. In time, his thoughts took a darker turn, and he became preoccupied with the idea that cars were following him, or that strangers wanted to harm him. Kurt's mind had been hijacked by schizophrenia, a severe mental disorder that typically strikes during the late teen or young adult years. In Me, Myself, and Them, Kurt, now an adult, looks back from the vantage point of recovery and eloquently describes the debilitating changes in thoughts and perceptions that took hold of his life during his teens and twenties. As a memoir, this book is remarkable for its unvarnished look at the slow and difficult process of coming back from severe mental illness. Yet Kurt's memoir is only half the story. With the help of psychiatrist Raquel E. Gur, M.D., Ph.D., and veteran science writer Linda Wasmer Andrews, Kurt paints the big picture for others affected by adolescent schizophrenia. Drawing on the latest scientific and medical evidence, he explains how to recognize warning signs, where to find help, and what treatments have proved effective. Kurt also offers practical advice on topics of particular interest to young people, such as suggestions on managing the illness at home, school, and work, and in relationships with family and friends.     Part of the Adolescent Mental Health Initiative series of books written specifically for teens and young adults, My, Myself, and Them offers hope to young people who are struggling with schizophrenia, helping them to understand and manage the challenges of this illness and go on to lead healthy lives.",
        "Category": " Medical , Psychiatry , General",
        "Publisher": "Oxford University Press",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2007"
        }
    },
    {
        "Title": "A Ticklish Christmas on Seasame Street : 1 2 3 Sesame Street (POP - UP)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Sesame Workshop",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2008"
        }
    },
    {
        "Title": "Art Fun! (ART AND ACTIVITIES FOR KIDS)",
        "Authors": "By North Light Books (EDT), Solga, Kim (EDT), Savage-Hubbard, Kathy, and Speicher, Rose C.",
        "Description": "69 original projects for ages 6-11Uses everyday materials found in your own homeColorful step-by-step how-to photos for all projectsArt Fun!Help young artists develop their creativity, imagination and talents, and have hours of fun along the way! Kids will love these fun-filled art adventures, including:Print Making!Experiment with patterns and shapes using bars of soap blocks, buttons, leaves, vegetables and, the simplest of tools of all, fingers.Sculpting!Making clay \"critter pots,\" cardboard tube towers, life-size self-portraits and time capsules.Drawing!Encourage kids to try watercolor paints, felt-tip pens, crayons, pastel chalks and charcoal and colored pencils on everything from paper bags to adding machine tape.",
        "Category": " Juvenile Nonfiction , Art , General",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "5.7",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "Beach Lane (A Chesapeake Shores Novel, 7)",
        "Authors": "By Woods, Sherryl",
        "Description": "In the close-knit community of Chesapeake Shores, Maryland, Susie O'Brien and Mack Franklin's \"not dating\" claim befuddles everyone, especially since the two spend every spare minute together. Susie's thrilled when their friendship finally heats up. Then, just when happily-ever-after seems within reach, Mack loses the job he loves and Susie faces a devastating diagnosis.But O'Briens always unite in a crisis. Even her cousin Jess, Susie's rival for most of their lives, becomes her staunchest supporter&#151;especially when Mack's former lover comes to town. The stakes are higher than ever before, but Susie's definitely up to the challenge&#133;as long as Mack's right there by her side.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "MIRA",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Immortality Option",
        "Authors": "By Hogan, James P.",
        "Description": "Living on the frozen world of Titan, Saturn's largest moon, the robotic race of the Taloids is discovered by Earth, completely stumping the scientific community, until Taloid digital DNA is recovered from the moon's ancient computer banks. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "1995"
        }
    },
    {
        "Title": "The Cracker Factory",
        "Authors": "By Joyce Rebeta-Burditt",
        "Description": "",
        "Category": "",
        "Publisher": "Bantam",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1979"
        }
    },
    {
        "Title": "Strange Attractors: Volume Two of the 'The Chaos Chronicles'",
        "Authors": "By Carver, Jeffrey A",
        "Description": "Stranded on the artificial structure known as Shipworld, John Bandicut searches for the keys to its mysteries and stumbles into a confrontation with an entity known as the boojum, an evil corruption that threatens both Shipworld and the universe. Reprint.",
        "Category": " Fiction , Science Fiction , General",
        "Publisher": "Tor Science Fiction",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1996"
        }
    },
    {
        "Title": "The Wonder of Christmas: Fifty Meditations on the Birth of Christ",
        "Authors": "By Partner, Daniel",
        "Description": "",
        "Category": " Religion , Holidays , Christmas & Advent",
        "Publisher": "Barbour Publishing, Incorporated",
        "Price Starting With ($)": "5.19",
        "Publish Date": {
            "Month": "September",
            "Year": "2004"
        }
    },
    {
        "Title": "From the Heart of a Father",
        "Authors": "By Johnson, William",
        "Description": "",
        "Category": " Family & Relationships , Parenting , Fatherhood",
        "Publisher": "Suncreek Books",
        "Price Starting With ($)": "5.77",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "Sharing the Joy of Nature: Nature Activities for All Ages",
        "Authors": "By Cornell, Joseph Bharat",
        "Description": "",
        "Category": " Nature , General",
        "Publisher": "Dawn Pubns",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "A Lucky Child: A Memoir of Surviving Auschwitz as a Young Boy",
        "Authors": "By Buergenthal, Thomas and Wiesel, Elie (FRW)",
        "Description": "Thomas Buergenthal, now a Judge in the International Court of Justice in The Hague, tells his astonishing experiences as a young boy in his memoir A LUCKY CHILD. He arrived at Auschwitz at age 10 after surviving two ghettos and a labor camp. Separated first from his mother and then his father, Buergenthal managed by his wits and some remarkable strokes of luck to survive on his own. Almost two years after his liberation, Buergenthal was miraculously reunited with his mother and in 1951 arrived in the U.S. to start a new life.Now dedicated to helping those subjected to tyranny throughout the world, Buergenthal writes his story with a simple clarity that highlights the stark details of unimaginable hardship. A LUCKY CHILD is a book that demands to be read by all.",
        "Category": " Biography & Autobiography , Historical",
        "Publisher": "Back Bay Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Rat Race",
        "Authors": "By Dick Francis",
        "Description": "",
        "Category": "",
        "Publisher": "POCKET",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "September",
            "Year": "1989"
        }
    },
    {
        "Title": "The Oxford new Spanish Dictionary",
        "Authors": "By Lea, Christine, Carvajal, Carol Styles (EDT), Britton, Michael (EDT), Horwood, Jane (EDT), Carvajal, Carol Styles, Britton, Michael, and Horwood, Jane",
        "Description": "A comprehensive Spanish-English, English-Spanish dictionary for students, tourists, and businesspeople furnishes translations of more than 100,000 words and phrases, along with pronunciation keys and verb tables, covering Mexican, Latin American, and European Spanish. Original.",
        "Category": " Reference , Dictionaries",
        "Publisher": "Berkley",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1999"
        }
    },
    {
        "Title": "Resistance The Gathering Storm",
        "Authors": "By Dietz, William C.",
        "Description": "Great Britain. July 1951. Three years ago, Russia went dark. Nothing got in. Nothing got out. The world assumed it was political strife. But it was the Chimera: voracious extraterrestrial invaders. And in December 1949, they burst across the Russian border and poured into Europe. The luckiest humans died. The less fortunate succumbed to an alien virus–and changed.Within a year, most of Europe had fallen. Only Great Britain, after struggling desperately, had kept the conquerors at bay. But as the Chimera were repelled, they were evolving. Building. Planning.America. November 1952.The Chimera have crossed the Atlantic. Their lightning strikes on American borders are devastating. Cities are lost. Small towns overrun. Citizens transformed into monstrosities. Enter Lieutenant Nathan Hale, U.S. Ranger. A veteran of the Chimeran conflict, he is uniquely immune to the alien virus. And when regular troops can’t stem the Chimeran onslaught, Hale and his special-operations team meet the menace head-on.But while they battle the relentless Chimera, deadly power games rage in the White House. And when Hale discovers a far-reaching conspiracy, one with deadly consequences for the human race, his allegiance to country and mankind is stretched to the breaking point.",
        "Category": " Fiction , Science Fiction , Action & Adventure",
        "Publisher": "Del Rey",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2009"
        }
    },
    {
        "Title": "All the Best Salads",
        "Authors": "By Warner, Joie",
        "Description": "Shares recipes for salad dressings and salads featuring vegetables, fruit, meat, poultry, seafood, fish, rice, beans, pasta, and cheese",
        "Category": " Cooking , Courses & Dishes , Salads",
        "Publisher": "Hearst Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1991"
        }
    },
    {
        "Title": "Fondue And Hot Dips (Nitty Gritty Cookbooks)",
        "Authors": "By White, Joanna",
        "Description": "Bristol author Joanna White present a new fondue and hot dip collection to meet the demand for this endlessly popular serving style. Fondue pots offer a simple, but always delicious, casual approach to entertaining and family eating, and this book will give you a vast variety of ways to keep yours filled with creamy cheese fondues, both lean and hearty hot dips, luscious sweet dips and every manner of warm concoctions \"dip-able\".",
        "Category": " Cooking , Courses & Dishes , Appetizers",
        "Publisher": "Nitty Gritty Cookbooks",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2001"
        }
    },
    {
        "Title": "Heart of the Matter",
        "Authors": "By Giffin, Emily",
        "Description": "\"Giffin excels at creating complex characters and stories that ask us to explore what we really want from our lives.\"--Atlanta Journal-ConstitutionTessa Russo is the mother of two young children and the wife of a renowned pediatric surgeon. Despite her own mother's warnings, Tessa has recently given up her career to focus on her family and the pursuit of domestic happiness. From the outside, she seems destined to live a charmed life. Valerie Anderson is an attorney and single mother to six-year-old Charlie--a boy who has never known his father. After too many disappointments, she has given up on romance--and even to some degree, friendships--believing that it is always safer not to expect too much.Although both women live in the same Boston suburb, the two have relatively little in common aside from a fierce love for their children. But one night, a tragic accident causes their lives to converge in ways no one could have imagined. In alternating, pitch-perfect points of view, Emily Giffin's Heart of the Matter creates a moving, luminous story of good people caught in untenable circumstances. Each being tested in ways they never thought possible. Each questioning everything they once believed. And each ultimately discovering what truly matters most.",
        "Category": " Fiction , Women",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "March",
            "Year": "2011"
        }
    },
    {
        "Title": "Distant Lights (Adventure Stories from Highlights)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Highlights for Children",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "1994"
        }
    },
    {
        "Title": "Suture Self (Bed-and-Breakfast Mysteries)",
        "Authors": "By Daheim, Mary",
        "Description": "A bum hip has bed-and-breakfast hostess Judith McMonigle Flynn limping off to Good Cheer Hospital -- a questionable \"haven of healing\" where two recent patients didn't make the cut after routine surgery. Judith's trepidation at undergoing the knife is eased only by sharing a room with cousin Renie, who's in for rotator cuff repair. Though the cousins survive their surgeries, the ex-pro quarterback next door is permanently sacked after minor knee surgery. With the scoreboard showing Grim Reaper 3, post-op patients 0, Judith decides that she and Renie are obliged to get to the bottom of Good Cheer's carnage. But in order to sew up the case, Judith and Renie must probe into the suspects' psyches. And suddenly it looks as if the cousins' own prognoses could take them out of the game...for good.",
        "Category": " Fiction , Mystery & Detective , Women Sleuths",
        "Publisher": "Avon",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "The Wolf at the Door (Sean Dillon)",
        "Authors": "By Higgins, Jack",
        "Description": "Jack Higgins “doesn’t stint on action” (Publishers Weekly) in this New York Times bestseller featuring black ops specialist Sean Dillon.On a Long Island pier, a trusted operative for the President is wounded by gunfire. In London, an adviser to the Prime Minister approaches his car when it explodes. In New York, British soldier-turned covert operative Sean Dillon is approached by a man with a pistol in his hand... Someone is targeting members of an elite intelligence unit known as “the Prime Minister's private army” and all those who work with them. The culprit has a full complement of resources at his command—and Dillon has an idea of who it may be: an old nemesis out to destroy the unit out once and for all. But proving it will be difficult. And surviving it might be impossible.",
        "Category": " Fiction , Thrillers , General",
        "Publisher": "G.P. Putnam's Sons",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "A Tale of Two Pretties (Clique)",
        "Authors": "By Harrison, Lisi",
        "Description": "Massie Block has long led the Pretty Committee--through boy drama, clique mutinies, and jealous wannabe attacks--while always in ah-dorable outfits. Over the past thirteen novels, avid fans of Massie, Alicia, Dylan, Kristin, and Claire, have made The Clique one of the premier bestselling series in the world. After the myriad of juicy escapades, the Clique is finally ready for their curtain call.  The Clique . . . the only thing harder than getting in is saying goodbye.",
        "Category": " Young Adult Fiction , Girls & Women",
        "Publisher": "Poppy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2011"
        }
    },
    {
        "Title": "The Darkest Hour (Warriors, Book 6)",
        "Authors": "By Hunter, Erin",
        "Description": "ThunderClan's darkest hour is upon them, as Tigerstar's quest for power plunges all the Clans into the most terrible danger any cat has ever faced. In order to save his Clan and his friends, Fireheart must uncover the meaning of an ominous proclamation from StarClan:\"Four will become two. Lion and tiger will meet in battle, and blood will rule the forest.\"The time has come for prophecies to unfold, and for heroes to rise ...",
        "Category": " Juvenile Fiction , Fantasy & Magic",
        "Publisher": "Avon",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "Grow Rich! With Peace of Mind",
        "Authors": "By Hill, Napoleon",
        "Description": "",
        "Category": " Self-help , Motivational & Inspirational",
        "Publisher": "Ballantine Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1996"
        }
    },
    {
        "Title": "KODAK Guide to Digital Photography",
        "Authors": "By Sheppard, Rob",
        "Description": "Following in the footsteps of the best-selling KODAK Guide to 35mm Photography comes a comprehensive guide with something for every digital photographer?be it an amateur looking for new techniques or a seasoned pro who’s brushing up. Written by a highly respected editor of PCPhoto and Outdoor Photographer magazines, its authoritative text helps readers choose the right camera, understand the workings of the camera’s sensor, master exposure measuring techniques, and determine the best shutter speed and aperture combinations for shooting various subjects. There’s an expert discussion of white balance and lighting, from daylight to artificial setups to flash photography, and entire chapters devoted to filters, close-up photography, and action shots. Finally, get practical information on digital file types, downloading, retouching, image processing, converting RAW files, and storing and retrieving images. This book has it all!",
        "Category": " Photography , Techniques , Digital",
        "Publisher": "Lark Books",
        "Price Starting With ($)": "6.0",
        "Publish Date": {
            "Month": "November",
            "Year": "2007"
        }
    },
    {
        "Title": "365 Super Science Experiments: With Everyday Materials",
        "Authors": "By Loeschnig, Louis V., Mandell, Muriel, Zweifel, Frances W. (ILT), Breckenridge, Judy (EDT), Fredericks, Anthony D., Breckenridge, Judy, and Churchill, E. Richard (EDT)",
        "Description": "How does heat change a solid to a liquid? What makes an echo? Why do we cry when we peel an onion? Can water flow upwards? Uncover these answers and put the world at your fingertips every day of the year with hands-on, always surprising science activities. Every experiment is illustrated with over 700 delightful drawings and uses easy-to-find materials.",
        "Category": " Juvenile Nonfiction , Science & Nature , Experiments & Projects",
        "Publisher": "Sterling",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Fundamentals of Czech History",
        "Authors": "By Petr Cornej",
        "Description": "",
        "Category": "",
        "Publisher": "Prah",
        "Price Starting With ($)": "6.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1992"
        }
    },
    {
        "Title": "Microeconomics, Theory and Applications",
        "Authors": "By Lee, Dwight R. and Glahe, Fred R.",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt",
        "Price Starting With ($)": "12.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1989"
        }
    },
    {
        "Title": "Cats (Little Golden Book)",
        "Authors": "By Pfloog, Jan",
        "Description": "",
        "Category": "",
        "Publisher": "Golden Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "1995"
        }
    },
    {
        "Title": "Breath of God: Unleashing His Presence into Your Life",
        "Authors": "By Lawrence, Eddie",
        "Description": "Just as we desire a close relationship with God our Father, so does He long to draw us to His side. In this in-depth biblical study, Dr. Eddie Lawrence looks closely at our natural longing for God, and he shows us how our pursuit of true intimacy with the Lord can help determine our destiny. Let Dr. Lawrence demonstrate for you how to find your true purpose for this life by receiving your \"Breath of God\" through the Holy Spirit.",
        "Category": " Religion , Spirituality",
        "Publisher": "World Pub",
        "Price Starting With ($)": "5.99",
        "Publish Date": {
            "Month": "April",
            "Year": "2006"
        }
    },
    {
        "Title": "Lonely Planet Africa the South (Lonely Planet Travel Guides)",
        "Authors": "By Else, David, Murray, Jon, and Swaney, Deanna",
        "Description": "Describes the region's history, cultures, wildlife, accommodations, restaurants, and activities",
        "Category": " Travel , Africa , General",
        "Publisher": "Lonely Planet",
        "Price Starting With ($)": "5.47",
        "Publish Date": {
            "Month": "September",
            "Year": "1997"
        }
    },
    {
        "Title": "A Woman's Guide to a Simpler Life",
        "Authors": "By Fuller, Doris A. and Van Steenhouse, Andrea",
        "Description": "Explains how women can create space in their lives for leisure, friends, and peace of mind by establishing limits to intrusions on their time and spirit without appearing rude",
        "Category": " Self-help , General",
        "Publisher": "Three Rivers Press",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Flight of the Romanovs",
        "Authors": "By Perry, John Curtis, Pleshakov, Constantine",
        "Description": "",
        "Category": "",
        "Publisher": "Konecky & Konecky",
        "Price Starting With ($)": "6.18",
        "Publish Date": {
            "Month": "September",
            "Year": "2002"
        }
    },
    {
        "Title": "The Book of Cancer Prevention",
        "Authors": "By editors of prevention magazine health books",
        "Description": "",
        "Category": "",
        "Publisher": "Rodale Press",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "January",
            "Year": "1988"
        }
    },
    {
        "Title": "Medical Dimensions of Mental Retardation",
        "Authors": "By Menolascino, Frank J.",
        "Description": "",
        "Category": " Medical , General",
        "Publisher": "University of Nebraska Press",
        "Price Starting With ($)": "10.63",
        "Publish Date": {
            "Month": "September",
            "Year": "1977"
        }
    },
    {
        "Title": "Trauma, Growth, and Personality",
        "Authors": "By Greenacre, Phyllis",
        "Description": "",
        "Category": " Psychology , Movements , Psychoanalysis",
        "Publisher": "W.W. Norton & Company",
        "Price Starting With ($)": "15.67",
        "Publish Date": {
            "Month": "January",
            "Year": "1952"
        }
    },
    {
        "Title": "Personality in Young Children, Vol. 2: Colin - A Normal Child",
        "Authors": "By Murphy, Lois Barclay",
        "Description": "",
        "Category": "",
        "Publisher": "Basic Books, Inc., New York",
        "Price Starting With ($)": "5.38",
        "Publish Date": {
            "Month": "January",
            "Year": "1956"
        }
    },
    {
        "Title": "The Memoirs of Mary Queen of Scots: A Novel",
        "Authors": "By Erickson, Carolly",
        "Description": "Queen of Scotland at six days of age, married as a young girl to the invalid young king of France, Mary took the reins of the unruly kingdom of Scotland as a young widow and fought to keep her throne. A second marriage to her handsome but dissolute cousin Lord Darnley ended in murder and scandal, while a third to the dashing Lord Bothwell, the love of her life, gave her joy but widened the scandal and surrounded her with enduring ill repute. Unable to rise above the violence and disorder that swirled around her, Mary escaped to England—only to find herself a prisoner of her ruthless, merciless cousin Queen Elizabeth. Here, in a riveting first-person account, is the enchanting woman whose name still evokes excitement and compassion—and whose death under the headsman's axe still draws forth our sorrow.",
        "Category": " Fiction , Biographical",
        "Publisher": "St. Martin's Griffin",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "2010"
        }
    },
    {
        "Title": "Civil War Soldiers (Touchstone Books (Paperback))",
        "Authors": "By Mitchell, Reid",
        "Description": "",
        "Category": " History , United States , Civil War Period (1850-1877)",
        "Publisher": "Touchstone Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1989"
        }
    },
    {
        "Title": "GROWING to Be Like Jesus-Student Edition: 6 Small Group Sessions on Discipleship (Life Together)",
        "Authors": "By Fields, Doug and Eastman, Brett",
        "Description": "IMAGINE a group of students sharing this goal—to know Jesus Christ deeper and to make him known to others!IMAGINE them doing as the disciples did—fellowshipping, growing, serving, sharing, and worshiping together!IMAGINE yourself in this kind of caring, committed community—revolutionizing your life and those in the group!The Life Together series is the beginning of a relational journey, from being a member of a group to being a vital part of an unbelievable spiritual community. These books will help you think, talk, dig deep, care, heal, share…and have the time of your life! Life…together! Growing to Be Like Jesus teaches about discipleship. How does Scripture apply to your life situation? How can Jesus make a difference in your daily life? How can we make a difference for Jesus? This volume of the Life Together series deals with these questions and others. Weaving through the six exciting sessions are new and fun ways to match your brain’s work with your heart’s desire to follow Christ and care for others.YOUTH LEADERS the Life Together series is a revolutionary small group resource that will change the lives of your students. Six related books overflow with Bible-based sessions to encourage and equip them. Check out the incredible Life Together DVD resources! Doug Fields and Brett Eastman share tips and approaches based on the books’ contents, and about communicating with kids. Also on each DVD are Bible teachings, directly related to passages in the books’ sessions, conducted by the most respected names in youth ministry—Doug Fields, Mike Yaconelli, Duffy Robbins, Efrem Smith, Helen Musick, and Marv Penner. 12 “conversations” with Doug and Brett, 12 detailed Bible teachings—these clips are invaluable resources for anyone seeking to share God's Word effectively to teenagers. Each DVD has almost three hours of the best small group teaching for youth you can imagine!",
        "Category": " Religion , Christian Ministry , General",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "2003"
        }
    },
    {
        "Title": "Imperfect Birds: A Novel",
        "Authors": "By Lamott, Anne",
        "Description": "From the New York Times bestselling author of Hallelujah Anyway, Almost Everything, and Bird by Bird, a powerful and redemptive novel of love and family Rosie Ferguson is seventeen and ready to enjoy the summer before her senior year of high school. She's intelligent-she aced AP physics; athletic-a former state-ranked tennis doubles champion; and beautiful. She is, in short, everything her mother, Elizabeth, hoped she could be. The family's move to Landsdale, with stepfather James in tow, hadn't been as bumpy as Elizabeth feared.  But as the school year draws to a close, there are disturbing signs that the life Rosie claims to be leading is a sham, and that Elizabeth's hopes for her daughter to remain immune from the pull of the darker impulses of drugs and alcohol are dashed. Slowly and against their will, Elizabeth and James are forced to confront the fact that Rosie has been lying to them-and that her deceptions will have profound consequences.  This is Anne Lamott's most honest and heartrending novel yet, exploring our human quest for connection and salvation as it reveals the traps that can befall all of us.",
        "Category": " Fiction , Psychological",
        "Publisher": "Riverhead Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2011"
        }
    },
    {
        "Title": "Theory of suicide",
        "Authors": "By Farber, Maurice L",
        "Description": "",
        "Category": "",
        "Publisher": "Funk & Wagnalls",
        "Price Starting With ($)": "16.16",
        "Publish Date": {
            "Month": "January",
            "Year": "1968"
        }
    },
    {
        "Title": "The Film Snob*s Dictionary: An Essential Lexicon of Filmological Knowledge",
        "Authors": "By Kamp, David, MacDonald, Ross (ILT), and Levi, Lawrence",
        "Description": "From the same brain trust that brought you The Rock Snob*s Dictionary, the hilarious, bestselling guide to insiderist rock arcana, comes The Film Snob*s Dictionary, an informative and subversively funny A-to-Z reference guide to all that is held sacred by Film Snobs, those perverse creatures of the repertory cinema. No longer must you suffer silently as some clerk in a “Tod Browning’s Freaks” T-shirt bombards you with baffling allusions to “wire-fu” pictures, “Todd-AO process,” and “Sam Raimi.” By helping to close the knowledge gap between average moviegoers and incorrigible Snobs, the dictionary lets you in on hidden gems that film geeks have been hoarding (such as Douglas Sirk and Guy Maddin movies) while exposing the trash that Snobs inexplicably laud (e.g., most chop-socky films and Mexican wrestling pictures). Delightfully illustrated and handily organized in alphabetical order for quick reference, The Film Snob*s Dictionary is your fail-safe companion in the video store, the cineplex, or wherever insufferable Film Snobs congregate.",
        "Category": " Performing Arts , Film , Reference",
        "Publisher": "Crown",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2006"
        }
    },
    {
        "Title": "Society without the father;: A contribution to social psychology",
        "Authors": "By Alexander Mitscherlich",
        "Description": "",
        "Category": "",
        "Publisher": "Harcourt, Brace & World",
        "Price Starting With ($)": "22.03",
        "Publish Date": {
            "Month": "January",
            "Year": "1969"
        }
    },
    {
        "Title": "Angel Sanctuary, Vol. 5",
        "Authors": "By Yuki, Kaori and Yuki, Kaori (ILT)",
        "Description": "Setsuna has seven days to find his beloved sister Sara in the afterlife, and the first stop is to find the Guardian of the Hellgate--a being any normal person would avoid! Kato, an old enemy of Setsuna's, is now his only companion, but Kato has a history of being manipulated in life. Now that he's dead at the hands of Setsuna himself, just how far can he be trusted?",
        "Category": " Comics & Graphic Novels , Manga , General",
        "Publisher": "VIZ Media LLC",
        "Price Starting With ($)": "6.98",
        "Publish Date": {
            "Month": "December",
            "Year": "2004"
        }
    },
    {
        "Title": "Angels in Pink: Raina's Story (Angels in Pink Series)",
        "Authors": "By McDaniel, Lurlene",
        "Description": "Raina is happy and relieved that her friends Kathleen and Holly found volunteering at the hospital rewarding. They loved their summers at the hospital so much they will be working for credit during their junior year. Raina is also looking forward to spending as much time as possible with Hunter during their last year of high school together. Kathleen is still dating Carson, but they are at different schools and she’s worried it won’t last. And poor Holly’s still waiting for her parents to let up on their rules so she can actually go out on a date.Everything is going well until Raina’s old boyfriend Tony shows up and threatens to ruin the thing that matters to Raina the most—her relationship with Hunter. But she isn’t the only one with a secret. When Raina’s mother reveals her family secret, Raina feels betrayed. Luckily she has Holly and Kathleen to lean on.From the Hardcover edition.",
        "Category": " Young Adult Fiction , Family , Siblings",
        "Publisher": "Laurel Leaf",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2006"
        }
    },
    {
        "Title": "Animals in Flight",
        "Authors": "By Jenkins, Steve (ILT), Page, Robin, and Jenkins, Steve",
        "Description": "Wings carry tiny insects, fluttering butterflies, backyard birds, and they even propelled some dinosaurs up and through the skies. Find out how, when, and why birds and beasts have taken to the air, and discover how wings work in this informative and brilliantly illustrated book about flight.",
        "Category": " Juvenile Fiction , Animals , Birds",
        "Publisher": "HOUGHTON MIFFLIN HARCOURT",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "Love Me, Never Leave Me: Discovering the Inseparable Bond That Our Hearts Crave",
        "Authors": "By Meberg, Marilyn",
        "Description": "Caught off guard, surprised by their own reactions, emotions bubble up that women fight to smother. Where did that come from? What can I do with this feeling that won’t go away? Why do I feel and act this way?Counselor Marilyn Meberg has been there too. When she got pregnant, she got scared. When her baby girl died, she got angry. When her husband died, she battled loneliness and sorrow. In between the peaks and valleys, Marilyn began to see a pattern that led to a greater understanding of herself and a richer happiness in life.She says, “We crave connection with the ones we love most, and when our bond with them is broken, damaged, or threatened, we fear being left. We fear abandonment.”Love Me, Never Leave Me tells you that desiring a love that never leaves is natural, that there are ways to turn feelings of being abandoned into experiences of emotional abundance, and to know that you are God’s beloved child—and he will never leave you or forsake you.  \"Thanks Marilyn for helping me make some sense to me. What a relief! Everyone I know is going to love this book. And you make me laugh. That's my kind of reading! By the way, I recommend people read in a room with chocolate cupcakes nearby. They'll know what I'm talking about as soon as they start the book; everybody's doing it.\" ?Sherri Shepherd, actress and co-host of The View\"I do not know one single person who has not felt forgotten or abandoned sometime in life. I so recommend Marilyn's fantastic book. It is helping me way more than I even thought I needed. Grab a cupcake and settle in with me for a healing read. You'll thank me I promise!\" ?Sandi Patty, singer, writer, speaker",
        "Category": " Religion , Christian Living , Women's Interests",
        "Publisher": "Thomas Nelson Inc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2008"
        }
    },
    {
        "Title": "Sacajawea: Her True Story (Penguin Young Readers, Level 4)",
        "Authors": "By Milton, Joyce and Hehenberger, Shelly (ILT)",
        "Description": "When President Jefferson sent Lewis and Clark to find an overland route to the Pacific Ocean, it was Sacajawea, with a baby on her back, who taught them how to survive in the wilderness. Simultaneous.",
        "Category": " Juvenile Nonfiction , Biography & Autobiography , General",
        "Publisher": "Penguin Young Readers",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "2001"
        }
    },
    {
        "Title": "A Taste of Chicken Soup for the Couples Soul",
        "Authors": "By Jack Canfield",
        "Description": "",
        "Category": "",
        "Publisher": "Health Communications, Inc.",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "If You Can't Lose It, Decorate It: And Other Hip Alternatives to Dealing With Reality",
        "Authors": "By Renfroe, Anita",
        "Description": "From weight control to childhood to personality issues, a laugh-out-loud guide to situations in life reveals that while some issues are here to stay, attitude makes all the difference between existing and thriving. Original. 20,000 first printing.",
        "Category": " Religion , Christian Life , General",
        "Publisher": "Navpress Pub Group",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2007"
        }
    },
    {
        "Title": "I Studied to Be an Opera Singer-But I Married a Cowboy",
        "Authors": "By Caryl Velisek",
        "Description": "",
        "Category": "",
        "Publisher": "Velisek",
        "Price Starting With ($)": "5.98",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "A Stranger's Desire",
        "Authors": "By Raye, Kimberly",
        "Description": "Forced to serve the Evil One by seducing women and stealing their souls, Cain, a formidable demon, finds himself powerfully drawn to his latest victim, Sophie Alexander, who has the power to release him from his prison with her love. Original.",
        "Category": " Fiction , Romance , Contemporary",
        "Publisher": "Love Spell",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "A Tour Of Evil",
        "Authors": "By Wizowaty, Suzi",
        "Description": "The lives of an eleven-year-old runaway foster child, an old man with a tragic past, and a worried foster mother intertwine as they rescue a group of kidnapped children from an evil tour guide at a cathedral in Northern France.",
        "Category": " Juvenile Fiction , Family , Orphans & Foster Homes",
        "Publisher": "Philomel",
        "Price Starting With ($)": "5.0",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "20 minutes or less (No time to cook)",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "Publications International",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "1997"
        }
    },
    {
        "Title": "The Western Experience: To the Eighteenth Century",
        "Authors": "By Chambers, Mortimer, Grew, Raymond, Herlihy, David, Rabb, Theodore K., Chambers, Mortimer (EDT), and Woloch, Isser",
        "Description": "The Western Experience offers a thorough, analytical overview of Western civilization, giving students an introduction to the major achievements in Western thought, art, and science as well as the social, political, and economic context for understanding those developments. To demonstrate the connected nature of all histories, these various aspects of history are examined in an integrated way. To help readers develop their reasoning and writing skills, each chapter is constructed to serve as an example of a historical essay: A historical problem is presented and arguments are developed using historical evidence. The ninth edition features many improvements, including the work of Lisa Tiersten in her new chapter on Nineteenth Century Empires.",
        "Category": " History , World",
        "Publisher": "McGraw - Hill College",
        "Price Starting With ($)": "6.72",
        "Publish Date": {
            "Month": "November",
            "Year": "1994"
        }
    },
    {
        "Title": "Whose Face? Pooh's Face! (Busy Book)",
        "Authors": "By RH Disney",
        "Description": "An oval mirror attached to the book allows children to find their body parts along with Pooh and his friends as they look, taste, touch, and smell",
        "Category": " Juvenile Nonfiction , Concepts , General",
        "Publisher": "RH/Disney",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "1999"
        }
    },
    {
        "Title": "Usborne First Nature Flowers",
        "Authors": "By Cox, Rosamund Kidman and Cork, Barbara",
        "Description": "Provides an introduction to flowers.",
        "Category": " Juvenile Nonfiction , Science & Nature , Flowers & Plants",
        "Publisher": "Hayes Books",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "1980"
        }
    },
    {
        "Title": "I'm Praying for You",
        "Authors": "By Ellyn Sanna",
        "Description": "",
        "Category": "",
        "Publisher": "Humble Creek",
        "Price Starting With ($)": "5.37",
        "Publish Date": {
            "Month": "January",
            "Year": "2000"
        }
    },
    {
        "Title": "Food Flavors: Generation, Analysis and Process Influence (Developments in Food Science)",
        "Authors": "By Charalambous, George (EDT)",
        "Description": "",
        "Category": " Science , Environmental Science",
        "Publisher": "Elsevier Science",
        "Price Starting With ($)": "126.46",
        "Publish Date": {
            "Month": "March",
            "Year": "1995"
        }
    },
    {
        "Title": "10 Great Dates Before You Say \"I Do\"",
        "Authors": "By Arp, Claudia, Arp, David (EDT), Brown, Natelle, and Brown, Curt",
        "Description": "10 Fun, Innovative Relationship-Building Dates for Seriously Dating and Engaged Couples! 10 Great Dates Before You Say “I Do” combines the best of marriage preparation research with a fun, easy-to-follow format. Couples will love growing together while going out together. Share your hopes and dreams Appreciate your differences Communicate and connect Develop spiritual intimacy Evaluate your relationship Celebrate romance And more!",
        "Category": " Religion , Christian Life , Love & Marriage",
        "Publisher": "Zondervan",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2003"
        }
    },
    {
        "Title": "The Water in Between: A Journey at Sea",
        "Authors": "By Patterson, Kevin",
        "Description": "Wise, funny and beautifully written, The Water in Between is an inspiring-and cautionary-tale for anyone who has ever wanted to escape into another life. A stint in the army and a broken heart lead Kevin Patterson, who has never sailed before, to buy a 37-foot sailboat.  He recruits a more experienced sailor-another brokenhearted guy-and together they set sail for Tahiti, hoping to burn away their miseries in hard miles at sea.At first Patterson finds life under sail distinctly less heroic than the travel literature that has inspired him.  But when his companion remains behind, Patterson single-handedly sails his boat across the North Pacific and through a perilous four-day gale, truly testing himself against the elements.",
        "Category": " Travel , Essays & Travelogues",
        "Publisher": "Anchor",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Mosaicos: Spanish 3",
        "Authors": "By Matilde Olivella de Castells, Elizabeth Guzman, Paloma Lapuerta, Carmen Garcia",
        "Description": "",
        "Category": "",
        "Publisher": "Pearson Custom Publishing",
        "Price Starting With ($)": "5.82",
        "Publish Date": {
            "Month": "January",
            "Year": "2002"
        }
    },
    {
        "Title": "Sign of Four (Watermill Classics)",
        "Authors": "By Doyle, Arthur Conan, Sir",
        "Description": "",
        "Category": " Fiction , Mystery & Detective , Traditional",
        "Publisher": "Troll Communications Llc",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "June",
            "Year": "1987"
        }
    },
    {
        "Title": "Outside the Lines: Paintings by Alexandra Nichita",
        "Authors": "By Nechita, Alexandra, Osgood, Charles (INT), and Bell, Suzanne Comer",
        "Description": "Artistic prodigy Alexandra Nechita has not only captured the art world, which is hailing her \"the ten-year-old Picasso\" for her astonishing abstract paintings, but she is fast becoming the darling of the international media for her charismatic personality, uncommon beauty, and the yearning for worldwide peace expressed in her paintings.In December, when Alexandra exhibited paintings in the Perry Gallery in New York, international publicity began flooding in. First were articles in the London Times-Mirror and Sunday Times, then came invitations for a European tour and television features spanning five continents, from South Africa to Romania, Germany to Israel, Japan to Australia. Combining humor, unusual depth of vision, and a childlike charm, this \"Mozart with a paintbrush\" seems to speak a universal language, stirring both children and their parents, art critics and those who would otherwise never step into a gallery.Outside the Lines, showcasing fifty of Alexandra's recent works, will dazzle people around the world with the artist's brilliant color combinations, startling compositions, and her simple, moving narratives about the daily inspirations to express herself through painting.",
        "Category": " Art , Individual Artists , General",
        "Publisher": "Longstreet Press Inc",
        "Price Starting With ($)": "31.63",
        "Publish Date": {
            "Month": "May",
            "Year": "1996"
        }
    },
    {
        "Title": "johnny and the tool chest",
        "Authors": "By william d. hayes",
        "Description": "",
        "Category": "",
        "Publisher": "Atheneum",
        "Price Starting With ($)": "7.49",
        "Publish Date": {
            "Month": "January",
            "Year": "1964"
        }
    },
    {
        "Title": "The Day I Died: An Unforgettable Story of Life After Death",
        "Authors": "By Sjogren, Steve",
        "Description": "It was a beautiful winter’s day, showing no signs of what was to come. Steve Sjogren, a successful pastor of a growing church, went into the hospital for routine surgery and died twice. What began as a tragic medical accident led to Steve’s near death experience, an encounter of unimaginable peace and some surprises, with comforting words from God, a meeting with an angel, and seeing those who had died before him. Readers of The Day I Died will hear Steve’s unforgettable story and catch a glimpse of heaven, discover how he learned a number of lessons about hearing God’s voice in times of crisis, how he learned to trust God in a new way during the recovery process and how his life has changed as a result of this experience.",
        "Category": " Religion , Inspirational",
        "Publisher": "Regal",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "January",
            "Year": "2006"
        }
    },
    {
        "Title": "My First Book of Jokes",
        "Authors": "By D'amato, Janet and Alex",
        "Description": "",
        "Category": "",
        "Publisher": "Wonder Books",
        "Price Starting With ($)": "12.51",
        "Publish Date": {
            "Month": "January",
            "Year": "1962"
        }
    },
    {
        "Title": "The Jewish Spirit: A Celebration in Stories & Art",
        "Authors": "By Frankel, Ellen (EDT)",
        "Description": "Presents Jewish tales from around the world, from biblical tales and legends of Midrash to folktales and literary stories by such writers as Isaac Singer, Bernard Malamud, and Grace Paley",
        "Category": " Religion , Judaism , General",
        "Publisher": "Harry N. Abrams",
        "Price Starting With ($)": "7.21",
        "Publish Date": {
            "Month": "August",
            "Year": "1997"
        }
    },
    {
        "Title": "Chronicles of the Civil War: An Illustrated Almanac and Encyclopedia of America's Bloodiest War",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "JG Press",
        "Price Starting With ($)": "8.98",
        "Publish Date": {
            "Month": "August",
            "Year": "2005"
        }
    },
    {
        "Title": "Instant Success for Classroom Teachers: New and Substitute Teachers Grades K Through 8",
        "Authors": "By Cawthorne, Barbara",
        "Description": "",
        "Category": " Education , General",
        "Publisher": "Greenfield Pubns",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "August",
            "Year": "1981"
        }
    },
    {
        "Title": "Caught Up Into Heaven",
        "Authors": "By Davis, Marietta",
        "Description": "Within Heaven’s Gates  During a nine-day visionary journey, Marietta Davis saw many breathtaking aspects of heaven and hell, including… The place where death, sin, and pain do not existInfants who have perished being carried to heaven by guardian angelsThe peace and harmony that exist among all the inhabitants of heavenMinistering angels going on errands of mercyThe horrors of an eternity without God Here is an eyewitness account of the glorious beauty, pleasures, and joys of heaven that await every Christian, as well as a look at the coming torment for unrepentant souls.",
        "Category": " Religion , Christian Living , Inspirational",
        "Publisher": "Whitaker House",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "1999"
        }
    },
    {
        "Title": "The Wombat Strategy: A Kylie Kendall Mystery",
        "Authors": "By McNab, Claire",
        "Description": "Best-selling mystery novelist Claire McNab (The Carol Ashton Mysteries, The Denise Cleever Mysteries) launches her newest series with a bang. Running a pub in the tiny Australian outback town of Wollegudgerie doesn’t offer much fun or future to knockabout Aussie dyke Kylie Kendall. So when the father she never knew dies and leaves her 51 percent of his Los Angeles-based private detective agency, it’s bright lights, big city for America-bound Kylie. Not so happy about her arrival is her father’s former (and Kylie’s new) business partner, the beautiful, enigmatic Arianna Creeling, who wants to buy out Kylie and gives her a decidedly chilly reception in sunny Southern California. But the two women soon have other matters besides their bickering to attend to. Dr. Deer, psychiatrist to the stars whose “slap, slap, get on with it” approach has made him a celebrity, hires them to investigate the theft of records and subsequent suicide of a successful but almost universally reviled film director. Concerned for his reputation, Dr. Deer would much prefer that the death of his former client be revealed to be a murder. As the sparks between Arianna and Kylie fly, the City of Angels has turned out to be much more difficult and dangerous than Kylie had imagined.Transplanted Australian Claire McNab has written 18 best-selling mystery novels, 14 featuring the highly popular Detective-Inspector Carol Ashton and four featuring undercover agent Denise Cleever. She has served as the president of Sisters in Crime and is a member of both the Mystery Writers of America and the Science Fiction Writers of America. She lives in Los Angeles.",
        "Category": " Fiction , LGBT , Lesbian",
        "Publisher": "Alyson Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "May",
            "Year": "2004"
        }
    },
    {
        "Title": "The Savage Garden: The Seeds of Sin Were Planted Long Ago…",
        "Authors": "By Mills, Mark",
        "Description": "The No.1 bestselling novel and Richard & Judy Summer Read: a haunting tale of murder, love and lost innocence for fans of Carlos Ruiz Zafon and Jed Rubenfeld",
        "Category": " Fiction , Crime",
        "Publisher": "Harpercollins",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "July",
            "Year": "2007"
        }
    },
    {
        "Title": "The Murder of King Tut",
        "Authors": "By Patterson, James and Dugard, Martin",
        "Description": "The mystery of King Tut's death in Ancient Egypt has haunted the world for centuries. Discover the ultimate true crime story of passion and betrayal, where the clues point to murder.Thrust onto Egypt's most powerful throne at the age of nine, King Tut's reign was fiercely debated from the outset. Behind the palace's veil of prosperity, bitter rivalries and jealousy flourished among the Boy King's most trusted advisors, and after only nine years, King Tut suddenly perished, his name purged from Egyptian history. To this day, his death remains shrouded in controversy. Now, in The Murder of King Tut, James Patterson and Martin Dugard dig through stacks of evidence-X-rays, Carter's files, forensic clues, and stories told through the ages-to arrive at their own account of King Tut's life and death. The result is an exhilarating true crime tale of intrigue, passion, and betrayal that casts fresh light on the oldest mystery of all.",
        "Category": " History , Ancient , Egypt",
        "Publisher": "Grand Central Publishing",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "December",
            "Year": "2010"
        }
    },
    {
        "Title": "Read to Me, Grandma",
        "Authors": "By Hale, Glorya (EDT)",
        "Description": "An illustrated collection of fairy tales, fables, and poems by such authors as Robert Louis Stevenson and James Whitcomb Riley.",
        "Category": "",
        "Publisher": "Gramercy",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "October",
            "Year": "1993"
        }
    },
    {
        "Title": "Random House Webster's Student Notebook Dictionary: Second Edition (Handy Reference Series)",
        "Authors": "By Maas, Georgia (EDT)",
        "Description": "In an all-new second edition, Random House Webster's Student Notebook Dictionary includes the newest words for today's student.  And, with its convenient 3-hole punched format, it's perfect for easy look-up any time.Features Include:• Over 52,000 clear, concise definitions, including important new words, idioms, and phrases• Helpful usage notes and pronunciation guides• Essential reference tools, such as the periodic table, maps, math and science formulas, and more• Three-hole punched format fits conveniently into a standard 3-ring binder",
        "Category": " Reference , Dictionaries",
        "Publisher": "Random House Reference",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "June",
            "Year": "2001"
        }
    },
    {
        "Title": "Daddy's Little Boy",
        "Authors": "By Randall, Ronne and Corke, Estelle (ILT)",
        "Description": "",
        "Category": " Juvenile Fiction , Family , General",
        "Publisher": "Parragon Inc",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "April",
            "Year": "2007"
        }
    },
    {
        "Title": "Strange Museum: Men in Green",
        "Authors": "By Malcolm, Jahnna",
        "Description": "",
        "Category": "",
        "Publisher": "Gateway Learning",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "January",
            "Year": "2003"
        }
    },
    {
        "Title": "The Bead Maker",
        "Authors": "By Maguire, Mary and Maquire, Mary",
        "Description": "Provides instructions for using clay, felt, paper, seeds, shells, plastic, and embroidery to create beads, and offers ideas for using beads in jewelry and home decoration projects.",
        "Category": " Crafts & Hobbies , Jewelry",
        "Publisher": "North Light Books",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "November",
            "Year": "2002"
        }
    },
    {
        "Title": "The Future According To Kids",
        "Authors": "By",
        "Description": "",
        "Category": "",
        "Publisher": "A Roundtable Press Book / Nickelodeon Books / Nickellennium [1999]",
        "Price Starting With ($)": "7.4",
        "Publish Date": {
            "Month": "January",
            "Year": "1999"
        }
    },
    {
        "Title": "2 Minutes and Under: Character Monologues for Actors (Monologue Audition Series.)",
        "Authors": "By Alterman, Glenn",
        "Description": "",
        "Category": " Performing Arts , Acting & Auditioning",
        "Publisher": "Smith & Kraus",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "September",
            "Year": "1993"
        }
    },
    {
        "Title": "In Front of God and Everybody (The Confessions of April Grace)",
        "Authors": "By Mccrite, K. D.",
        "Description": "If God wanted April Grace to be kind to her neighbors, He should have made them nicer!Growing up in the country is never easy, but it sure is funny—especially if you happen to have a sister obsessed with being glamorous, a grandma just discovering make-up, hippie friends who never shower, and brand new neighbors from the city who test everyone’s patience. From disastrous dye jobs to forced apologies and elderly date tagalongs, you’ll laugh ‘til you cry as you read theConfessions of April Grace! Here are just a couple of April's thoughts: On her sister, Myra Sue: \"How anyone can be that dumb and still be able to eat with a fork is beyond me.\"  On senior citizen lovebirds: \"What if they started smooching right at the table in front of God and everybody?\"In spite of all the loony characters in her life, April Grace is able to learn from her parents as they share the love of God—to even the craziest of characters!",
        "Category": " Juvenile Fiction , Religious , Christian , Friendship",
        "Publisher": "Thomas Nelson",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "May",
            "Year": "2011"
        }
    },
    {
        "Title": "Country Living Handmade Frames: Decorative Accents for the Home",
        "Authors": "By Country Living Magazine (EDT)",
        "Description": "Make fabulous frames for just a fraction of what they cost in stores. The 30 projects here present a range of styles, so whether you're showing off a traditional painting or a beloved black and white picture of you and your mom, you'll find just the right frame. Start from scratch or revamp one that's purchased: directions take you from measuring to mounting to hanging, and you can gild, paint, add mosaics, or more. Plus: display ideas.",
        "Category": " Crafts & Hobbies , Decorating",
        "Publisher": "Hearst",
        "Price Starting With ($)": "5.53",
        "Publish Date": {
            "Month": "December",
            "Year": "2001"
        }
    },
    {
        "Title": "Church Suppers: 722 Favorite Recipes from Our Church Communities",
        "Authors": "By Greenman, Barbara (EDT)",
        "Description": "Church Suppers celebrates gatherings of neighbors, family, and friends with delicious, down-home recipes from all over the United States and Canada. These are the dishes we remember and cherish, that bring us back to a simpler time: Fiesta Dip, Red Flannel Hash, Sloppy Joe Turnovers, Green Bean Casserole, Earthquake Cake, Blueberry Buckle...plus many regional and ethnic foods: Moussaka, Jambalaya, Chiles Relleños, Babka, Cannoli, and more. And because the recipes come from real people with bustling families, busy work schedules, imperfect kitchens, and realistic budgets, they are easy to prepare and focus as much on simplicity as they do on taste. Full of local flavor and rounded out with line drawings and anecdotes about the contributing churches, Church Suppers is a delightful addition to any home kitchen.",
        "Category": " Cooking , Regional & Ethnic , American , General",
        "Publisher": "Black Dog & Leventhal",
        "Price Starting With ($)": "9.89",
        "Publish Date": {
            "Month": "May",
            "Year": "2005"
        }
    },
    {
        "Title": "Internet in an Hour for Beginners",
        "Authors": "By Mayo, Don and Berkemeyer, Kathy",
        "Description": "Covers Web browsing, e-mail, Microsoft Internet explorer, Netscape Navigator, America Online, online shopping and entertainment, financial services, newsgroups, and \"netiquette\"",
        "Category": " Computers , Internet , General",
        "Publisher": "D D C Pub",
        "Price Starting With ($)": "5.66",
        "Publish Date": {
            "Month": "February",
            "Year": "1998"
        }
    },
    {
        "Title": "AlphaTales (Letter E: The Enormous Elephant Show): A Series of 26 Irresistible Animal Storybooks That Build Phonemic Awareness & Teach Each letter of the Alphabet",
        "Authors": "By Charlesworth, Liza and West, Nadine Bernard (ILT)",
        "Description": "Let Elvin the Elephant entertain you. You'll be amazed at everything Elvin can do! This engaging rhyming tale teaches the letter E. AlphaTales are humorous stories designed to help young children recognize letters and the sounds they make. Lay the foundation for reading success with these kid-pleasing books&#8249one for each letter of the alphabet. For use with Grades PreK-1.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "AlphaTales (Letter G: Gorilla, Be Good!): A Series of 26 Irresistible Animal Storybooks That Build Phonemic Awareness & Teach Each letter of the Alphabet",
        "Authors": "By Fleming, Maria and Phillips, Matt (ILT)",
        "Description": "Will Gorilla learn to be a good houseguest? As kids giggle at Gorilla&#8217s goofy antics, they&#8217ll learn about the letter G. AlphaTales are humorous stories designed to help young children recognize letters and the sounds they make. Lay the foundation for reading success with these kid-pleasing books&#8212one for each letter of the alphabet. For use with Grades PreK-1.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "AlphaTales (Letter L: The Lamb Who Loved to Laugh): A Series of 26 Irresistible Animal Storybooks That Build Phonemic Awareness & Teach Each letter of the Alphabet",
        "Authors": "By Wilhelm, Hans (ILT) and Pugliano-Martin, Carol",
        "Description": "Lulu the Lamb doesn&#8217t know when to stop laughing until Lion teaches her a lesson. Learn about the letter L with this rib-tickling tale! AlphaTales are humorous stories designed to help young children recognize letters and the sounds they make. Lay the foundation for reading success with these kid-pleasing books&#8212one for each letter of the alphabet. For use with Grades PreK-1.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "AlphaTales (Letter N: The Nicest Newt): A Series of 26 Irresistible Animal Storybooks That Build Phonemic Awareness & Teach Each letter of the Alphabet",
        "Authors": "By Harvey, Paul (ILT) and Feldman, Heather",
        "Description": "Nate is the nicest newt in the neighborhood. Find out what happens when he decides to be naughty as you teach the letter N. AlphaTales are humorous stories designed to help young children recognize letters and the sounds they make. Lay the foundation for reading success with these kid-pleasing books&#8212one for each letter of the alphabet. For use with Grades PreK-1.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "4.99",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    },
    {
        "Title": "AlphaTales (Letter O: Olive the Octopus\u0092s Day of Juggling): A Series of 26 Irresistible Animal Storybooks That Build Phonemic Awareness & Teach Each letter of the Alphabet",
        "Authors": "By Phillips, Matt (ILT) and Charlesworth, Liza",
        "Description": "Olive the Octopus wants to be a juggler. Read about her outrageous antics as you teach the letter O. AlphaTales are humorous stories designed to help young children recognize letters and the sounds they make. Lay the foundation for reading success with these kid-pleasing books&#8212one for each letter of the alphabet. For use with Grades PreK-1.",
        "Category": " Education , Teaching Methods & Materials , General",
        "Publisher": "Teaching Resources",
        "Price Starting With ($)": "5.29",
        "Publish Date": {
            "Month": "February",
            "Year": "2001"
        }
    }
]